{
  "post content": "Let me just preface this by saying this: **I HAVE ABSOLUTELY NO PROBLEM WITH INTERRACIAL RELATIONSHIPS.** Now that the air is clear, let me continue. \n\nMy daughter (Anna) has recently started to date an African American man (Jamal). While I'm not exactly what you would refer to as \"liberal\", he's a nice young man and as long as my daughter is happy, I'm happy. The problem is Anna is rather naive about the community she lives in. While her friends are quite content to see a relationship like hers, more than a few tongues are wagging in the community and a few people have privately expressed their concern to me. As I said, I have no problem with mixed relationships and I've set them straight, but I am painfully aware of how these matters are viewed by certain segments of the population.\n\nMy parents are planning to come and stay with us for a week and Anna expressed a desire to introduce Jamal to them now that things were getting more serious between them. I told her on no uncertain terms that this wasn't going to happen. I may have no problem with Jamal, but they *absolutely will*, and even when the relationship ends they won't forget it. They might even go as far as to cut her off entirely. Anna was extremely upset by this and implied I was a racist and more concerned with what my parents think than how she feels.\n\nAs I said, I know my parents. They simply aren't okay with mixed relationships and if Anna were to bring Jamal over even as a friend, they would be furious both at her *and* me.\n\nAnna is currently staying with Jamal and doesn't want to speak with me right now. My wife stands by me given she knows very well how my parents are (they had a problem with her for months over the *length of the skirt* she wore when I introduced her to them, for christs sake), but a close friend I confided in told me that I have behaved like an ass and that I needed to focus more on my daughter than pleasing my parents.\n\nNo advice needed, but I have to know. Have I been an ass?",
  "id": 1,
  "comments": [
    {
      "score": 39237,
      "content": "* EDIT: Thank you so much for all the positive and supportive responses and...*all* the awards, my goodness. If it makes you feel lost in the crowd, try [Mutual Aid Disaster Relief](http://mutualaiddisasterrelief.org) for your donation needs. MADR evolved from the Common Ground organization that drove racist patrols out of the French Quarter after Hurricane Katrina, set up clinics and a hospital, and today helps people organize to survive disasters all over.\n\n* SOLIDARITY CHALLENGE: Add up the cost of all 69 silver awards on this post as of now, and donate the total to MADR for my 33rd birthday. Or you know, just like $3 or just train with them!\n\nYTA. Has it occurred to you to [edit: uncivil remark] and PROTECT your daughter from the racists you are supposedly so against? Anti racism isn't popular in \"the community\" when you define that as white people of a certain age and class. It never has been and never will be. Dr King's dream wasn't to ask politely for people to be \"not exactly liberal but okay\", then give up and abandon black people and their white partners to the wolves if they say no.\n\n> furious at both her *and* me\n\n[edit: This is ultimately an avoidant desire.] You and the other white moderates are the jewel in their crown; they need to win your complicity before they expand their empire. You are the oil in their tanks; your [edit: uncivil adjective] actions fuel their advance. Do \"your daughter\" a favor and tell her you've chosen not to be a dad to her because it might affect your little popularity contest. She deserves to know the truth. Jamal deserves to know you place your little neighborhood pecking order above his safety and freedom, too.\n\nLet's hear from Dr. King about the white moderate:\n\nLetter from Birmingham Jail (excerpt)\n\nBy Rev. Martin Luther King, Jr., 16 April 1963\n\n\"First, I must confess that over the last few years I have been gravely disappointed with the white moderate. I have almost reached the regrettable conclusion that the Negro's great stumbling block in the stride toward freedom is not the White Citizen's Council-er or the Ku Klux Klanner, but the white moderate who is more devoted to \"order\" than to justice; who prefers a negative peace which is the absence of tension to a positive peace which is the presence of justice; who constantly says \"I agree with you in the goal you seek, but I can't agree with your methods of direct action;\" who paternalistically feels he can set the timetable for another man's freedom; who lives by the myth of time and who constantly advises the Negro to wait until a \"more convenient season.\"\n\nShallow understanding from people of goodwill is more frustrating than absolute misunderstanding from people of ill will. Lukewarm acceptance is much more bewildering than outright rejection.\"\n\nYou're not just \"not liberal\", OP. You are the enemy of [edit: antiracists]. [edit: uncivil suggestion.] Be a [edit: swearing should probably go too, given the tone] DAD. Get your [attitude] together before you get someone seriously hurt with your wishy-washy bull[crap]. Be part of the solution or get out of the way. And might I add, your parents are who Dr. King meant by \"White Citizen's Council-er\". How many black people did they attack at soda fountains and city halls? How many have they intimidated out of their neighborhood? Have you even asked? Ball's in your court, [TAH].",
      "id": 2,
      "comments": [
        {
          "score": 8664,
          "content": "This response is amazing. Bravo! 👏✊",
          "id": 3,
          "comments": [
            {
              "score": 4287,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 2518,
                  "content": "Yeah, I'm not going to bother either lol. It's 3 hours old and already has 20 awards. I'd like to see this on r/MurderedByWords, though.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 259,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 190,
                      "content": "The problem with it getting onto murdered by words is that you would need the entire original post and then the comment. \n\nunless they allow cross posts but I don't think they do.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "[removed]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "There might be an actual murder on the sub for once, then. /s",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "WHAT HAPPENED BELOW YOU",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 58,
                  "content": "this will get buried but another good token of Dr King is this:\n\"True peace is not merely the absence of tension; it is the presence of justice.\"",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "[removed]",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "IDK.... I missed it too.  Upvote for using the word tarnation.... I haven't seen that word in ages!",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "My first thought was what if they decide to get married and have a baby like wtf does op expect his daughter to do? Abort the baby and elope in secrecy lol this is bizarre. If Jamal is a nice young man you should be not be ashamed. Racism is so debilitating it's like a mental illness and should be treated as such.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "[removed]",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "[removed]",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "[removed]",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "The purge",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "What happened? So many comments have been removed, what did they say",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2161,
              "content": "It is. However, I imagine this is the real problem: Gramma and Grampa will not stand for OP defending his daughter in this situation and they will \"cut him off\" too. Which means, most likely, cut out of the Will. Know this, racist old white grandparents usually have a few bucks. OP doesn't want to lose his shot at inheritance and he doesn't want to jeopardize his chances over a black kid -- especially when OP says things like \"even when the relationship ends.\" You're not going to get this guy to give up Baby Boomer financial assets in exchange for his daughter's happiness.",
              "id": 20,
              "comments": [
                {
                  "score": 2603,
                  "content": "> Which means, most likely, cut out of the Will. Know this, racist old white grandparents usually have a few bucks. \n\nHow much is your soul worth?  How much is your daughter's love and trust worth? \n\nHow much is your integrity worth?",
                  "id": 21,
                  "comments": [
                    {
                      "score": 603,
                      "content": "If you had the chance to earn $1,000,000 to go towards your child’s future, you might bite your tongue around a couple of old racists.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "About 10,000 per 500g",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "About 1 racist parent's inheritance. /s",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "How much you got?",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Apparently the price of a second or third home",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 238,
                  "content": "so, you'd choose money over your children? pathetic.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 182,
                  "content": "[removed]",
                  "id": 28,
                  "comments": [
                    {
                      "score": 928,
                      "content": "My father told me that if I ever started dating a black guy, he was going to shoot both of us. You've must not have been around many racist people. They are fucking nuts and ready to get violent at a moment's notice. I'm pretty sure OP know their parents better than anyone.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "\\> doesn't want to jeopardize his chances over a black kid\n\nWHOOPS YOU DROPPED SOMETHING",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "[removed]",
              "id": 31,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I would like brought up how he mentioned when she breaks up with him, not if. Why does he assume they won't last?",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3747,
          "content": "Honestly, I think you’ve been overly reductionist in the situation. You’ve tried to frame your response as an attack on racism instead of actually helping OP navigate the situation. \n\nOP is TA for refusing to have the BF introduced, but he is absolutely NOT TA for telling the daughter that grandparents will not like him because he is black. \n\nI have quite literally been in this situation before as the black BF. The appropriate way to go about this is to introduce them in a safe environment, and then immediately rebuke any prejudicial comments from the grandparents. You tell daughter and BF in advance what is likely to happen so they can make an informed decision, and then stand behind them and do the right thing if they decide to proceed. You DO NOT, allow them to go in unprepared and allow both of them to be hurt and embarrassed without advance warning that you could easily provide.",
          "id": 33,
          "comments": [
            {
              "score": 2790,
              "content": "The commenters aren't obligated to give advice, though. It explicitly says in the rules that this isn't an advice subreddit. This commenter passed judgement and told OP exactly why he is the asshole, which is literally what this sub is for. If he's looking for advice on how to navigate the situation, he should be looking in a different subreddit.",
              "id": 34,
              "comments": [
                {
                  "score": 547,
                  "content": "The last sentence of the post even says “no advice needed”",
                  "id": 35,
                  "comments": [
                    {
                      "score": 21,
                      "content": "That is a really fair point tbf, I forgot about that line, definitely a shitty thing to include, like why even share your story if you aren't going to heed any advice given to you.\n\nGreat point.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "yes.. and it was eloquent af",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1091,
              "content": "OP is not asking how to navigate the situation. They specifically said “No advice needed”. But they did ask if they were an asshole. Which they are.",
              "id": 38,
              "comments": [
                {
                  "score": 820,
                  "content": "Tbh I thought that line of “no advice needed” was just a further example of OP’s cowardice and of his need to establish control.\n\nHe doesn’t want to read anything here or experience anything in real life that might suggest that he should rethink his stance. And he wants everyone to do what he says — similar to his ordering his daughter when he has no right to.\n\nEdited to add that I do realize this isn’t an advice sub. But it’s so rare that someone actually demand that no advice be given. Usually people explain their vote, and presumable this is the “advice” OP can’t stomach.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I get OPs mentality having grown up with it. Why piss off people who (in your mind) you’ll have to see for the rest of your/their lives, who are mostly super nice people (as long as you live “correctly”) in defense of a person who you’ll in all likelihood only interact with for maybe a few months? It’s far easier to say nothing and preserve the peace between you and those that you have to interact with more frequently. He asks for no advice because in his mind, it’s better to preserve the peaceful status quo than it is to piss off his parents and any other extended family, but he also knows deep down that it’s not really the right thing to do, it’s just the easiest and least confrontational thing to do and so doesn’t want advice that tells him to act differently than his intended path.\n\nThat said, it’s a mentality people need to shake off because it’s what has enabled racism to survive and thrive into the modern era.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 452,
              "content": "He's saying no, actually. He's a coward. He has the opportunity to contend with the racist in his backyard and he is not taking it.\n\nMy mother is not a liberal by any means. But I will never forget that when I got into an argument with my grandmother about race and my mom simply looked at my grandmother and said, \"The world's not like this anymore and we have to keep moving with it.\" That's how we keep moving things forward.",
              "id": 41,
              "comments": [
                {
                  "score": 314,
                  "content": "I walked out of my grandmother's house when she was racist against my aunt (her daughter's) new boyfriend.\n\n\n\n\n\nThen she called me after her racist tirade ended and asked \"Where did you go? I tried looking for you upstairs and downstairs...?\" and I said \"I really didn't like how you were talking about this person. I felt you were being racist. And so I left. I am halfway to my house right now. If you don't apologize for your racism and rethink it, I'm never seeing you again. He's already done so much to be accepted, converting religion and is such a nicer kinder person than Aunt's prior husband that I could not stand you talking about him this way.\" She interrogated me a bit about why I felt like that and why I'd left and then apologized and said \"Okay I was wrong to say that. Also I didn't realize he'd converted but interracial marriages are hard etc\" and because our religion's prophet had done interracial marriage himself (PBUH), I was able to use religious law to argue against her and so she backed down fully. Now the aunt is happier than she's ever been before and the new Uncle feels fully welcome in our town.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Good for you for speaking up, and acting out.  That's awesome, and I commend you for it.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 313,
              "content": "op is an asshole because he shut down the idea of a meeting entirely. \n\nwith the daughter being 19, im sure she already knows how her grandparents would react. she asked him to step up to the plate and support her in her relationship. and he declined - because of her BFs race. yea it is easy to rebuke strangers and even friends, but when it comes to family, thats where people start to really know where they stand.\n\n*my guess: rich grandparents, dont wanna risk losing the inheritance.",
              "id": 44,
              "comments": [
                {
                  "score": 30,
                  "content": "Yeah. He says “they might cut her off entirely”. \n\nI appreciate that you might want to make sure your daughter doesn’t lose an inheritance, but that’s her choice. Many people who have a bit of cash manipulate people using the threat of missing out on an inheritance. \n\nI guess whether you put up with that shit or not depends on how poor you are, but if you can’t get by without an anticipated inheritance, then those people are arseholes for not giving you a helping hand.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I would shut down any meeting too, but not in the same way for the same reasons OP did. I would not allow my racist parents to visit, because I support my daughter first and foremost. If they cannot be supportive, they are not welcome in my home. I would let her know why they couldn't visit, and would let them know too. If they had some time to think on it and agreed to be kind and accepting, then I might allow a visit. But, if they uttered one negative word, they would be out that very minute.\n\nThere was a rift in my family, b/c my racist old great granny got mad that her grandson bought his black friend with him and his family to visit. The kid was staying with my aunt and uncle, b/c he had a bad family situation, and they treated him like family. None of us thought a thing of it, except Granny. She blamed my aunt (her DIL) b/c she hated my aunt. She accused her of doing it on purpose to rub a black child in her face. My aunt stood up to her matter of factly. She was a way better person than I would have been about it. She still continued to be kind and even helped take care of my Granny when she was dying. I did tell my Granny what I thought and distanced myself from her. It was a big shit storm, b/c everyone stood by my aunt, uncle, cousin, and his friend instead of her. She fancied herself some kind of family matriarch, but the reaction she got showed her differently.   \n\n\nI liked my other granny way better. The worst thing she did is get super excited over my husband, because she had a huge crush on him and thought he was good looking. My husband kind of played into it and held her hand and gave her a lot of attention when he was there. I used to tell her that I would never forgive her if she stole my husband. It was kind of adorable.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 200,
              "content": "[deleted]",
              "id": 47,
              "comments": [
                {
                  "score": 17,
                  "content": "except he doesn't 100% disagree with the grandparents.\n\n&#x200B;\n\nThat part would be a lie. He probably 20% disagrees with the grandparents.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "I think this is fair. You cannot stop it, In fact it’s inportant to not just respect the daughters wishes but also support and defend her, but do let her know that there is a POSSIBILITY they won’t be happy. My ex told me not to tell his nan I was Jewish and when we did it was just fine. Op is YTA. Also he says “after they break up” either the kid is young or he’s incredibly presumptuous.",
              "id": 49,
              "comments": [
                {
                  "score": 21,
                  "content": "Even when the relationship ends stuck out for me as well. He's counting on the relationship ending at some point s he doesn't have to deal with the racism in his family.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "I cannot argue with your advice. My experience with the situation is being close to a white parent who hides behind \"other people's\" views to (edit: *attempt to*) manipulate the white offspring into racist behavior for the sake of peace. It doesn't always come from a hateful place, but I knew that the guy needed to understand his ruse was seen and regarded with contempt. Call it tough love, without the love.",
              "id": 51,
              "comments": [
                {
                  "score": 104,
                  "content": "> It doesn't always come from a hateful place,\n\nIt comes from a fearful place. Which, funnily enough, is the same as the hateful place. The pit from which all base and negative impulses of humanity stew.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1243,
          "content": "This is the best response I’ve ever seen on AITA. Preach!",
          "id": 53,
          "comments": [
            {
              "score": 144,
              "content": "I really do think we have reached the peak of this subreddit. I hope I see something that proves me wrong cause that would be amazing",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[removed]",
              "id": 55,
              "comments": [
                {
                  "score": 24,
                  "content": "[removed]",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "[removed]",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1067,
          "content": "[deleted]",
          "id": 58,
          "comments": [
            {
              "score": 727,
              "content": "OP ‘supports’ it bc he thinks it’s a phase. Emphasis mine.\n\n>I may have no problem with Jamal, but they absolutely will, and **even when the relationship ends they won't forget it.** They might even go as far as to cut her off entirely.\n\nAlso he thinks getting cut off (from their money? Affection? Both?) is an important aspect of the situation.\n\n>they would be furious both with her *and* me.\n\nThis is if Jamal is *only* a friend.\n\nOP doesn’t want to upset mommy and daddy and is hoping his daughter will ditch her bf before they find out. OP is a coward and a low-key racist...and doesn’t even realize.",
              "id": 59,
              "comments": [
                {
                  "score": 207,
                  "content": "Yeah the \"when the relationship ends\" and not \"if\" kind of threw me. I wish I could give the benefit of the doubt and say OP has that mindset cause his daughter is young and lots of young relationships are feeling (honestly just lots of relationships are fleeting) but it doesn't really seem like that is the case.\n\nLike I have a friend who I would probably use this phrasing with. She has had a bf of the year basically every year since we were in 8th grade and we're 23 now. The last four or so of them, she has told me how she see's spending the rest of her life with them and how if they're still together a year from now, they'll likely move in together. And she didn't last with any of them. At this point, the way she deals with relationships has made it feel more like a \"when it ends\" rather than \"if\". But this is a justified case with history to back it up. Ops? Seems not to be the case.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 8,
                      "content": "> Ops? Seems not to be the case.\n\nnot enough context/info to make that judgement",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "People like OP think being called racist is more offensive than actual racism",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I don't get why he focuses on them being upset. I would be so upset with my parents if they treated my kid that way, that they wouldn't forget my wrath for a very long time. I wouldn't even think twice about their feelings.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 383,
              "content": "Yep. This is especially highlighted by the fact that OP continues to choose to live in an area where apparently an interracial couple is seen as scandalous. I think I'd rather get 4 root canals than live in an area like that for even a month.",
              "id": 64,
              "comments": [
                {
                  "score": 125,
                  "content": "Makes me wonder where the hell they live. It sounds like a scene plucked from the 1950s",
                  "id": 65,
                  "comments": [
                    {
                      "score": 225,
                      "content": "To give an example, I'm in Mississippi and interracial couples are still a very controversial thing behind closed doors here. No one who isn't a *complete* asshole will ever say it in public, but when I (white) dated my ex-girlfriend (black) we had a *ton* of racist bullshit said to us in private. In one case in public.\n\nShit said to me was always along the lines of, \"We dont think she'll be a good match for you\" when we had the same interests, \"are you sure she isnt trying to marry you for your money?\" when she held a higher paying job than I have, \"we dont think your children will have a good life\" neither of us wanted kids anyway, and even if we did the only people who would make life harder for them would be the same people making those comments.\n\nRural communities can get extremely close minded, especially here in the south.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 173,
                      "content": "Currently, live in the bible belt. Can confirm this 100% happens to every interracial couple here. Have had people tell me its like laundry \"Colors just should not be mixed\".\n\nKeep in mind I am not talking about Bubba the 300-pound redneck. Just normal everyday people around here believe this 100%. They also legit believe they are not racist. They can with a straight face say that they do not dislike *insert anyone not white* but they should not date outside their own race.\n\nExcept for Asians for some reason. Asians are ok.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I've seen this attitude in the deep south, and rich WASPy areas in the north. Although the south is more overtly racist, southern people are more likely to say \"this is one of the good ones\" and treat them like a person. Northern racist are more likely to be HATEFULLY racist, and never accept anyone outside their WASPy ass place. My wife is from a northern WASPy family.  Both parents are extremely rich. Upon marrying me (poor white trash military in their eyes) she was cut off, they stopped paying for her college completely, she was evicted from her apartment. Sucks for them, cuz we got married and had grandbabies, and her sister is gay. So they've never met their grandchildren.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Yeah I'm from the DC Metro area and nobody bats an eye about it around here.  I'm actually glad I read this post because it helps remind me that shit like this is still going on in small town America.  It's easy to become insulated and forget this shit is still fucking happening.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Root canals aren't really that bad, in comparison.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Its not as easy to just up & move like that sometimes. I lived in some pretty shitty places as a kid because we didn't have the money for anything better.\n\nNow, I have the ability to make that choice. Yay?\n\nEdit: OP is still the asshole for a myriad of other reasons though.",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "OP claims they have no problem with interracial relationships then proceeds to detail how they clearly have a problem with interracial relationships.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1036,
          "content": "[deleted]",
          "id": 73,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 878,
          "content": "Pack up and go home ladies and gentlemen, this is all OP needs to hear.",
          "id": 74,
          "comments": [
            {
              "score": 44,
              "content": "[removed]",
              "id": 75,
              "comments": [
                {
                  "score": 42,
                  "content": "[removed]",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "[removed]",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 666,
          "content": "Honestly this is perfect.\n\nWhen I came ‘out’ to my parents there wasn’t really much muster about anything... I mean that as a positive as well as negative. However I chose to believe that this means they’re fine with it etc...\n\n\nMonths (5 months) later we’re off to my birthday meal in which my gf was invited too BY MY PARENTS. As we’re leaving the door my mother announces ‘by the way, introduce her as your friend not gf.... they don’t even know you’re gay nevermind have a gf so this is too much for them..... we have to love you we’re your parents’\n\n\nALL I got from that convo was that they were ashamed of me. They accepted me because they had to, yet they believe my close family would cut me off. My love was based upon choices I made, not unconditional like I believed from aunts and uncles. \n\nThey thought the same as you, but this is NOT how it came across to me and I had never/have never felt more ashamed or abandoned by them in my life.\n\nEdit: wow this kind of blew up a little bit. Thank you so much to everyone for your love and support. It’s not something I ever, really looked at too intensely. If I ever mention how I felt/feel about this sort of stuff I’m labelled as ‘too sensitive’ and they become the victims. It’s just easier to smile, shut up and buck up. I have the most amazing, loving and patient fiancé so I realise I’m luckier than most. \n\nMy family and I are close (minus the manipulation I sometimes feel they do) but thank you. \n\nAlso just as an FYI (LOL) out of the close family they didn’t want to know about me there was my gay uncle who was the first to gift my fiancé with an Easter present a mere 4 weeks after (this is for your ‘friend...’ *wink wink*) my Aunty who’s neighbour was my co-worker and already knew I was gay.... honestly. Nothing as weird as family.",
          "id": 78,
          "comments": [
            {
              "score": 164,
              "content": "Thank you. That's exactly why I felt I had to be clear about the contempt for TAH. The white moderate parent sees the whole social picture and is losing sight of the emotional picture for his daughter, who he has a duty toward that simply cannot make time for outdated social attitudes. In Dr. King's day, a white moderate parent of a male child with her attitude was expected to wish him well and send him off to fight klanners in the street. It did not matter if the parent was liberal or not. They were expected to be parents of their time. Today, that means going to war on a social and political level with the racist grandparents.",
              "id": 79,
              "comments": [
                {
                  "score": 6,
                  "content": "Exactly this! You’re fight is, or should be, our fight too.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "He not only y sees the whole social picture, he ACCEPTS it. Approves of it, even.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Jesus...\n\n*HUG*",
              "id": 82,
              "comments": [
                {
                  "score": 7,
                  "content": "Thank you! \n\nHonestly we’re good now, I’m marrying my partner and they love her. They’re very open about her now but that shit sticks. \n\nThey also seem to believe there is nothing wrong with how they acted, and always come across as innocent and I’m ‘too sensitive’ They have never asked a single question as to any part of my lgbt life (how I realised, did I have gf before? Am I OK? Etc) but it is what it is and I’ve accepted it. \n\nThank you though!",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Truly. The things I was told by my parents when I came out in 1991. \"Don't tell your grandparents, they will never understand\" was the least troubling of everything they said. I guess by comparison it was easy not to tell my grandparents after hearing that I was never to acknowledge any part of my personal life in front of my mother and father. That I was obviously molested at some point and damaged. That I was disgusting and what I was doing to them was mortifying. I was choosing never to be happy. I would be miserable all my life. I had humiliated my parents. That I shouldn't tell people they knew. Keep your secret secret, for God's sake. But you know, they followed everything with \"We love you.\"\n\nI don't know if my parents wonder why we're not close now. Maybe they're happier this way.",
              "id": 84,
              "comments": [
                {
                  "score": 10,
                  "content": "I remember when my brother came out. My dad showed up, unannounced, at my door and asked me flat out \"Are you gay?\" I was very confused at the question, because I am not. I said no, and he said \"OK. Because your brother is. but if you ever decide that you are, don't tell your mother.\"\n\nShe eventually got over it, accepted it, and welcomed his partners into the family, but she spent a long time trying to find ways to make him NOT gay.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": ">we have to love you we’re your parents\n\n\"but we wish we didn't have to\" Jesus fuck, I'm so sorry.",
              "id": 86,
              "comments": [
                {
                  "score": 4,
                  "content": "Thank you! \n\nHonestly we’re good now, I’m marrying my partner and they love her. They’re very open about her now but that shit sticks. \n\nThey also seem to believe there is nothing wrong with how they acted, and always come across as innocent and I’m ‘too sensitive’ They have never asked a single question as to any part of my lgbt life (how I realised, did I have gf before? Am I OK? Etc) but it is what it is and I’ve accepted it. \n\nThank you though!",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 436,
          "content": "Is there a judgment beyond \"YTA\"? Like \"YTA and your entire family (except your daughter) are assholes too, you bring no value to society with your horrible backwards views.\"\n\nYeah OP. That's who you want to appease. Your shitbag, racist, anti-progressive parents. You'd rather have people like that in your life than your daughter and her boyfriend? Good lord, get your freaking priorities straight.",
          "id": 88,
          "comments": [
            {
              "score": 102,
              "content": "It's ESH, but that would imply the kid and the bf are assholes too, so YTA is appropriate here.",
              "id": 89,
              "comments": [
                {
                  "score": 12,
                  "content": "Good point. God I feel bad for those kids.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Yeah, but don't forget the horse he has in this race - he doesn't want to be written out of their will by supporting such liberal notions as interracial relationships. Notice how he said his daughter might be \"cut off\" as a result of introducing her boyfriend?",
              "id": 91,
              "comments": [
                {
                  "score": 11,
                  "content": "And that even if the kids were just friends OP’s parents would be furious with both himself and his daughter. A craven and a racist who doesn’t realize he’s racist.",
                  "id": 92,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Ha, good point. Can't afford to lose that sweet money over such super liberal-leaning concepts like women wearing skirts. The scandal!",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 360,
          "content": "Excellent response and thank you for the great quote from MLK. I was not aware of this quote but I find it to be as true today as it was the day it was written.",
          "id": 94,
          "comments": [
            {
              "score": 1201,
              "content": "MLK has been butchered by revisionist history, turned into basically black Santa who wants everyone to be good. It’s intentional, the real MLK was a revolutionary who would be disgusted by the current state of affairs. He wanted to tear it all down and build a new equitable society without economic exploitation, classism, or neo-colonialism.\n\nThey shot him, they buried him, and they buried his message with him. They gave him a day, made some limited changes, and told everyone that the changes they made in his name were the changes that he wanted. The man was a “dangerous negro” and proud of it. And now they use him to sell trucks.\n\nGoogle his “Proud to be maladjusted” speech if you want to see what he envisioned before he was silenced. And realize that he failed, that with his death his movement lost their momentum and that the establishment succeeded by killing him.",
              "id": 95,
              "comments": [
                {
                  "score": 75,
                  "content": "This comment needs to be much, much higher up.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Also remember he was murdered shortly after speaking about economic inequality and how poor whites were a weaponized social class.",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "They use him in fucking truck ads.  What a travesty it is to use an anti-capitalist, anti-racist’s message to sell bullshit trucks.  And the excerpt they used is from a speech where he says consumer culture is what has lead to the stalling of racial and class equality.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 40,
                      "content": "My favorite is when people bitch that MLK would never block roads for a protest. Like shit that was his fucking thing.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "Look, it's just a coincidence that every dead Civil Rights leader would have agreed with us and all of the live ones who worked with them are uppity socialists who hate America.",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "White Boomers posting on Facebook about how MLK would be ashamed of Colin Kaepernick",
                  "id": 101,
                  "comments": [
                    {
                      "score": 23,
                      "content": "White boomers know that the two historical figures who would agree with all their political and social views are Jesus and MLK (even though they were both socialists).",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "> They gave him a day\n\nand there was a huge backlash to that as well.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "At my son’s school, not only did they not observe  MLK day, but they didn’t even bother to talk about his legacy/teachings. I complained and told administration that it was absolutely unfathomable that they wouldn’t even recognize the day or teach kids about him. The following year (last year) they had MLK day as a no school day due to professional development day for teachers. \n\nI’m proud to say my 7 year old son willingly picked up an MLK book and read all about him, why he was important and why he was murdered. We had a conversation about it after.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "And in case anyone is wondering who \"they\" means: A civil suit found that the U.S. Government assassinated Dr. King, who by the way was actually considered a moderate leader for the time (other than by racists), even with full awareness of his socialist revolutionary views.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 14,
                      "content": "FBI were also blackmailing him over his affairs, threatening to release incriminating tapes unless he killed himself. They also sent him some cringeworthy letters posing as “concerned African Americans who disagree with his radicalism” in an absurdly out of touch way.\n\nThey sell it as MLK wanted civil rights and he talked the government around and everyone got along nicely until some mean person shot him. MLK wanted a fucking revolution and the end of capitalism and so the FBI shot him and then told everyone they’d agreed to split the difference and just reform civil rights. And they got away with it too.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "JFC.  [https://www.retailmenot.com/blog/best-mlk-day-sales.html](https://www.retailmenot.com/blog/best-mlk-day-sales.html)",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 158,
              "content": "It's from \"Letter from Birmingjam Jail\" . If you want to get the full context you should also read \"A Call for Unity\". The latter is an open letter from 8 Alabama Clergymen who believed that directly protesting for civil rights was wrong even if the cause was right. Kings response is effectively a manifesto for the movement and all other similar movements.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "That is unfortunately correct. The man was not perfect like all of us but he was prophetic on this issue.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I really recommend letters from the Birmingham jail.  They should be required reading in high school.  Basically everything we think we learn about MLK is this watered down message of HOPE, when it really is a rallying cry for radical change and upending the system.\n\nThere’s a reason the CIA and FBI tried to get him to kill himself, he was a radical who would have changed the world if he lived longer.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "Lets not forget one of the best statements \n\n> “and even *when* the relationship ends”",
          "id": 111,
          "comments": [
            {
              "score": 221,
              "content": "That line struck me too. Clearly this guy has a really low opinion of his daughter’s relationship. He probably thinks that eventually she’ll come to her senses and marry a white guy. He just can’t outwardly express how much he thinks the relationship is wrong because then he’ll alienate his daughter.\n\nHis daughter’s relationship sounds very serious to me though, if she’s thinking of introducing her bf to her grandparents. Introduction to grandparents is a really big step, even bigger than introduction to parents",
              "id": 112,
              "comments": [
                {
                  "score": 22,
                  "content": ">That line struck me too. Clearly this guy has a really low opinion of his daughter’s relationship. He probably thinks that eventually she’ll come to her senses and marry a white guy.\n\nGiven his throwaway username is literally /u/mixedwoes...yeah. Yikes.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh my Lord, I completely missed this.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "This is the other stand out\n\n> if Anna were to bring Jamal over even as a friend, they would be furious both at her *and* me.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Good catch! His daughter is playing around with an interracial relationship, like the kids do nowadays, but she'll snap out of it.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15681,
      "content": "YTA. Your daughter has nothing to hide and neither do you. If your parents love your daughter any less because of who she loves, then you and her do not need them in your lives.",
      "id": 117,
      "comments": [
        {
          "score": 3902,
          "content": "Thank you! I’ve tried to convey this to my mom. She loves my boyfriend, they get along great, but she doesn’t want my family to know I’m dating a black guy because “she’s not ready to lose her family yet”.",
          "id": 118,
          "comments": [
            {
              "score": 4633,
              "content": ">  she doesn’t want my family to know I’m dating a black guy because “she’s not ready to lose her family yet”.\n\n\"So...mom...you're not ready to lose your family yet, so I guess that means I'm not your family because you seem fine about losing me.\"",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 601,
              "content": "[deleted]",
              "id": 120,
              "comments": [
                {
                  "score": 251,
                  "content": "Thank your mom for me. When I came out as a lesbian, I was bluntly told that I could never take my girlfriend (now my wife) home for Christmas because my grandparents would flip. Lost my whole family over that, including my parents.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 102,
                      "content": "That's horrible! My parents have had a string of... not bad luck child wise but children who have really gone against what her extended family views as good.\n\nI'm a single mom, with 2 kids. They do not have the same dad. My one aunt did not speak to me for 9 months during my first pregnancy.\n\nMy sister is queer and has brought her girlfriend to family gatherings.\n\nMy sibling is trans.\n\nHilarious considering I was raised very conservative. Even homeschooled. My parents have done a full 180 from their views when I was younger.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Sorry..\n\nIt's even worse the excuse \"because the grandparents would flip\". So the dozen or however many other people around the table are fine, but because of those two bigots everyone tows the line? Nah fuck that, they think the same but are careful to not be open about it. Fucking cowards. Hell at least the grandfolk are honest about how they feel.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Tell your mom thank you on behalf of a trans dude who was cut off from his family.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's absolutely horrible. I'm sorry.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 224,
              "content": "Whatever happens, you don't ever need to feel ashamed of this. Even if you don't work out in the long run, you're free to be yourself without judgement. \n\nIf people don't accept you, fuck them. Life's too short to care what other people think.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "\"I'm not ready to no longer have racists in my life. Wahhh\"",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Gross. Sad upvote.",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Wow. So many people go through this. I wish my parents were more receptive to me having a South African SO but they weren't and TBH, their negativity about him has has slipped into my subconscious and now I am very negative towards him and it's affecting our relationship. It's almost like my parents brainwashed me unconsciously and I can't get it off. I was very close to my family and I have to admit that once I started dating him, my relationship with them has not been the same and although I miss it, I still don't think they have treated him fairly. I love my SO but I also don't like the void I have of not having a close connection with my family anymore and it tears me up inside. So much so, that it's affecting my behaviors towards him and I'm becoming very bitter and resentful.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 764,
          "content": "[removed]",
          "id": 130,
          "comments": [
            {
              "score": 397,
              "content": "Yup.  Remember that almost no racist actually believes they are racist.\n\n\"Not exactly liberal\" was the big giveaway to me.  This person does have a problem with the relationship deep down.",
              "id": 131,
              "comments": [
                {
                  "score": 244,
                  "content": "[deleted]",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 192,
                  "content": "I enjoyed that OP said “when they break up.”\n\nShows what he really thinks of the relationship. “It’s fine if she plays around with the black boy, they won’t get married and have kids anyway.”",
                  "id": 133,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Exactly! That's a good way to lose your daughter, OP.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "and also “if she’s happy i’m happy” like he believes there would otherwise be something wrong with it but he’s willing to overlook that for her",
                  "id": 135,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Good point!",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Yeah, bring liberal has nothing to do (or should not at least) with not being racist.",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "You're dead on. The OP is absolutely peppered with tells from the tree of \"I'm not racist...*but*...\" \n\nIt bears the fingerprints of a coward racist who believes racist things but is scared to say them in certain company because they know it's wrong and they can't handle being judged for it.\n\nOnce you recognize that, it's no mystery why the guy is siding with his racist parents over his daughter.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Yeah I kind of realized at that point what OP meant. This isn’t a political issue so why state your political affiliation? It’s not a liberal thing to approve of Anna and Jamal, it’s just a normal, moral thing. If you have something against him solely for being black, that’s not something up for debate like political issues, that’s just being shitty. \n\nWhat OP meant was “I’m not the type of person to usually approve of interracial dating, but I guess I’m not super against it either. I just don’t want *my* baby dating a black boy!” \n\nUse whatever excuse you want, racist grandparents, racist society, whatever. But ultimately it comes down to the parents to love and protect their kid.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 123,
          "content": "I mean, OP does have something to hide.....Their parents.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 106,
          "content": "Amen, I cant help but feel that there might be some sort of future inheritance from the grandparents that is helping to fuel this situation.",
          "id": 141,
          "comments": [
            {
              "score": 177,
              "content": ">\"they might even cut her off\" \n\n>\"They would be furious with both her AND me\" \n\nCorrected emphasis mine. This is 90+% about grandma and grandpa's money.",
              "id": 142,
              "comments": [
                {
                  "score": 20,
                  "content": "Those are the exact comments that caught my attention.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Easy guess here - the grandparents have big $$$ and OP doesn't want to lose his/his daughter's inheritance.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Dude got plenty he's already hiding. He starts by saying his daughters dating a black guy and he's not exactly \"liberal\" aka he has a problem with it to but is hiding behind his parents. This guy sucks and either needs to learn to grow and change or lose his relationship with his daughter",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10439,
      "content": "YTA and sounds like your parents are assholes. Your daughter is dating Jamal and YOU are ok with him but you won’t introduce him to your parents. You’re still scared of Mommy and Daddy.  Grow up, this isn’t about your parents it’s about your insecurity",
      "id": 146,
      "comments": [
        {
          "score": 4855,
          "content": "I don’t think OP is actually ok with Jamal. He lives in a racist area with racist parents and goes on and on about how “everyone” is talking. He’s probably just like them",
          "id": 147,
          "comments": [
            {
              "score": 3116,
              "content": "> While I'm not exactly what you would refer to as \"liberal\", he's a nice young man and as long as my daughter is happy, I'm happy.\n\nI mean this reads just as \"I'm racist but I can let that one slip because I'm not THAT racist\". I don't blame him 100% for that though, if his parents are actually full blown racists he grew up surrounded by this and at least it's a step forward. But he's still racist regardless and he's making another step, backward this time, by putting his parent's racism before his daughter's well being.\n\nYTA",
              "id": 148,
              "comments": [
                {
                  "score": 1678,
                  "content": "He’s also banking in the fact that the relationship won’t last. He says his parents will hold it against his daughter even after  “it ends”, which suggests that a part of the reason he is “okay” with it is because he sees it as necessarily temporary. Would he still be “okay” with it if they were engaged? I doubt it.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 892,
                      "content": "Jamal is just a phase, right? Pitiful. This is why I left the fucking south.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 232,
                      "content": "Yeah wtf is he gonna do if she gets pregnant or they get married? Make her choose between hiding her nuclear family from them or not being his daughter anymore?",
                      "id": 151,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 208,
                      "content": "I caught that one too. It totally reads like “I can temporarily bite my tongue.” Absolutely repugnant. OP seems like the kind of asshole who decries affirmative action and doesn’t believe white privilege exists.",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "We stairght up have no clue how old these people are. \n\n\nWhat if his daughter is 16? Chances are they will not get married. So it just seems like a weird detail to Target when for that to be a reasonable you'd need more context to their place in life at this point.",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "To be fair, that one can be explained as just him assuming that it’ll end because most teenage relationships do. The majority of people don’t marry their high school sweethearts. \n\nEverything else he said was stupid though. “I’m not really liberal...” Congrats. This isn’t a political post. Are we debating healthcare and presidential candidates here? What he really meant was “I’m not usually okay with black people/interracial relationships the way most liberals are, but I’ll let it slide this one time.”",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "for a little defense - it sounds like the daughter is in HS - 99.9% of relationships in HS do end. \n\n&#x200B;\n\nI am not picking sides, but I do think that particular criticism is unfair",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 803,
                  "content": "Yeah, if he's putting \"race mixing\" as a liberal policy and you know, not a settled human right, there's already a problem there.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 236,
                      "content": "[deleted]",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 138,
                      "content": "Great point! People who frame other people's existence and basic relationships as \"politics\" tend to be... not great people, TBH.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "As soon as I saw “not a liberal” I skipped to the first comment expecting a YTA and multiple golds.  I was not wrong.  Dude’s a closet racist and came here looking for justification.  Wrong place.  Maybe the_Donald needs it own AITA subreddit.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Yeah, that was the first thing that jumped out at me. Anyone who tries to frame their supposed lack of racism like that is, without a doubt, a racist. They are equating race and racism with political ideology, as if racism is just a natural expression of thought or opinion, and not something that is damaging to another human being. My parents are very conservative, and I am absolutely certain they wouldnt describe their aversion to racism that way. On the flip side, I work with some people who absolutely are racists (and will openly admit it) and that is exactly how they would describe their ability to be in the same room as someone who is black or hispanic. \n\nNot being racist isnt a political idea, its just the way people should be.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Didn’t even think of that but holy shit you’re right",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah, that was the first thing I noticed and I just cringed. Apparently, treating people like people no matter what their skin colour is is a liberal policy and not being a decent human being.",
                      "id": 162,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 258,
                  "content": "100%. This phrasing also didn't sit well with me:\n\n>..., and even when the relationship ends they won't forget it.\n\nAlthough OP has stated that things are becoming more serious between his daughter and Jamal, he has no doubt that the relationship will inevitably end. It seems like in OP's eyes, Jamal isn't a man his daughter loves, rather an adolescent fad she'll grow out of. YTA OP. I'm gay and if my parents asked me not to introduce my boyfriend to my mega-Catholic (yet liberal) grandparents, I'd have freaked the fuck out.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My dad is pretty homophobic but if I have a gay kid you bet your ass I’m parading into his house with a rainbow flag wearing an “I LOVE MY GAY SON” shirt every time I see him. You’d have to be a monster to be complicit in the oppression of your own child.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 168,
                  "content": "I read that as \"he's not one of *those* Blacks\"..... sounds like the kinda guy that says things like \" I don't mind blacks, it's the niggers I can't stand\" and thinks he's being progressive and tolerant or some shit.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Also reads a bit as someone saying \"They're one of the good ones\"",
                  "id": 166,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "BINGO. It’s not “liberal” to not be a fucking racist.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Imagine thinking that mixed race relationships are a liberal idea in 2019.",
                  "id": 168,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "It's such a fucking backhanded thing to say. *If she's happy I'm happy*. That hugely implies *I'm not okay with it but her happiness is more important*.\n\nOp is prejudiced and doesn't even know it. That's why they're so hesitant to stand up for them...because they DON'T actually believe in it!",
                  "id": 169,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Uh... I blame him. I was raised by parents who used archaic terms for black people and other people of color that I'm not even comfortable thinking about. I am not a racist. My friend's mother was raised by a Klansman, and when she brought home not only a PoC but revealed she was gay? She cried with joy because she was happy her daughter was finally happy. There's no excuse for being slightly less racist than your parents. They just don't care to be any more \"progressive\" (and the fact that I just had to use the word progressive to define not being a racist is a HUGE problem, not unlike this guy saying he isn't a liberal but he's fine with interracial relationships, as though somehow human equality is a party issue.)",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "That line got me too, Liberal is code for what exactly here? Someone who’s accepting of others? Non-racist? \n\nHe’s usually [racist] but Jamal is a nice young man [and thus an exception].",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "[deleted]",
              "id": 172,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I don't either. He said \"when\" the relationship ends, not \"if\". I think he's convinced himself that this is a phase and she'll likely date a white boy next.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Everyone is talking (it's not everyone; it just seems like everyone to him because it's a secret sore point with him and he's ashamed) but he doesn't tell them to fuck off, that he supports his daughter, and that times have changed.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 647,
          "content": "[deleted]",
          "id": 175,
          "comments": [
            {
              "score": 623,
              "content": ">  While I'm not exactly what you would refer to as \"liberal\", he's a nice young man and as long as my daughter is happy, I'm happy.\n\nAgreed. WTF does being liberal have to do with it? Only liberals would be ok with interracial dating but OP is a hero because even though he's not liberal, since Jamal is nice he'll allow it???",
              "id": 176,
              "comments": [
                {
                  "score": 227,
                  "content": "I'm also weary of the way OP uses the phase \"African American\". Yes its a valid way to refer to black people. But when used the way OP does it makes black people sound like some scary \"other\". It was the first thing to stand out to me about this post. I myself have always preferred when people just say black. I've never been to Africa and my family has been here going way back. I mean, involuntarily but still.\n\nEdit: It is not racist to use African American. I said this above but apparently no one is reading that part. OP use of it came off as a veil. A \"I'm not racist veil\" Disagree with me if you like. But that was my opinion.",
                  "id": 177,
                  "comments": [
                    {
                      "score": 18,
                      "content": "He says \"I'm not racist but ...\" and then uses just enough coded language for us to argue whether or not he's really racist. The AA phrase is the cherry on top of a bunch of other stuff: \"liberal\" as if those are the only people who'd be comfy with this, calls his daughter naive, to me strongly implies that this is ok because Jamal is one of the \"good ones\" and/or that this is just a phase for her. None of this phrasing is how a non racist person would present the situation.\n\nI had no idea any one still said \"mixed relationships\" and that one personally skeeves me out. Do people still say mixed??",
                      "id": 178,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "This is such a weird topic to talk about as well. I'm white, live in a predominantly white area, I have black coworkers, and a couple black friends.\n\n\nMy black friends both think like you do but I've had black coworkers that don't feel the same way and feel like a level of familiarity is required before using \"black\". One coworker was actually clearly uncomfortable with the conversation. It was a group convo that was curious in nature but this was the first experience I had that I realized that no one person can represent a group. Given the right circumstances some people will even be uncomfortable by the questions. This made me completely rethink the way I broached topics of race. \n\n\nI was, likely still am, the naive whiteboi who thought/thinks that just talking openly about race can solve problems and show those people around me that I'm an ally. I've realized that there is a lot of nuance I don't understand.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "They sure love to give away the game when he says he's not that liberal when apparently his definition of \"liberal\" is \"tolerates interracial marriages\".",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "He uses the word \"liberal\" because he views racial equality as a political issue, not a moral issue.",
                  "id": 181,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "\"He's one of the good ones\" is always code for \"I'm a racist\". (EDIT: or sexist/bigoted/etc.)",
                  "id": 182,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "It's clear. Their use of \"when their relationship ends\" proves this. They want their daughter to break up or at least think it's inevitable.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Honestly, I got more of a \"but he's one of the good ones\" racist vibe from OP.",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 369,
          "content": "The vibe I got from OP is that he is OK with Jamal because he is confident the relationship will end soon. I think he will not be so accepting if Anna and Jamal get engaged/married or have kids.",
          "id": 185,
          "comments": [
            {
              "score": 162,
              "content": "Yep, my thought exactly. He even says \" I may have no problem with Jamal, but they *absolutely will*, and even **when** the relationship ends they won't forget it. \"  So he's not saying if, he expects for them to not be a long term bf/gf or anything more.",
              "id": 186,
              "comments": [
                {
                  "score": 18,
                  "content": "I caught the same thing. Seems to me like OP is pretending to be ok with their relationship because he figures the daughter is just going through a phase that she will get over soon enough. And really, why get the grandparents involved in something that is just a phase?\n\nOP is definitely YTA here.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "He also said when they break up. So he wouldn’t be ok with his daughter marrying a black guy.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4909,
      "content": "YTA\n\nYour daughter's happiness should come first. If your parents decide to cut her off, then it's their loss not hers. \n\nShe should be free to make her own decisions, and not have to hide who she is to anyone. \n\nI also respect that your actions are coming from a place of love, but this is your parents issue to get over not your daughters to hide.\n\n**Edit:** Has anyone else noticed OP made this post, replied to one comment, and hasn't been seen since.",
      "id": 189,
      "comments": [
        {
          "score": 594,
          "content": "Further to that, sure, your parents may well be angry with you as well as with your daughter, but your priority should really be your daughter, and if a bunch of old racists want to be racist, you need to stick up for the right side here.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 562,
          "content": "A place of love? I don't think so. This is fear. Fear that his parents will cut him off because they'll think he failed to bring his daughter up \"correctly\". Fear of the whispers around town. Ultimately, what he should be afraid of is his daughter cutting him and his wife off when she realizes where they stand.",
          "id": 191,
          "comments": [
            {
              "score": 220,
              "content": "Considering the use of the phrase “cut off”, I wonder if the grandparents have money, and OP is willing to tolerate their hateful bullshit because of the promise of a big payday when they die.",
              "id": 192,
              "comments": [
                {
                  "score": 47,
                  "content": "That's exactly what I thought. They're of a generation when non-1%-people could still amass a decent amount of money, even with a comparatively humble job, and they're getting up there. OP wants to keep the peace until he can cash the check.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "You could be right, but it may also come from him not wanting his daughter to lose a relationship with her grandparents.\n\nHowever misguided, it's possible there are good intentions as well.",
              "id": 194,
              "comments": [
                {
                  "score": 90,
                  "content": "I feel like she's willing to lose her racist grandparents at this point. I'd be.",
                  "id": 195,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Place of love? To not be supportive of their own daughters happiness. Being concerned about what people are whispering? Talking about being “cut off” financially. Sorry, but none of that screams “place of love”. Just awful.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "> Edit: Has anyone else noticed OP made this post, replied to one comment, and hasn't been seen since.\n\nIt's hard to hear that you're a racist asshole, that your wife is a complicit asshole, and that your parents are vile assholes. I think there's too much truth in these comments and that's scaring him. Especially with the top comment being such a classy murder by words.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "OP has checked out because he like most people don't actually want to know that they're the asshole. These are trial balloons of \"I'm right, reddit, tell me I'm right.\" And if reddit says sorry you ain't right they're just going to say \"What the fuck does reddit know, bunch of neckbeards anyway.\" ... in this case \"liberal neckbeards\". \n\nThis sub is entirely about confirmation and not about trying to find the error of your ways. People who post here are already sure that they are not the asshole and want to hear a thousand people tell them that someone else is.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4307,
      "content": "YTA - I get where you're coming from but what is your plan if this relationship continues into the foreseeable future? Will her grandparents not be invited to the wedding? Will they never meet their mixed race great grandchildren?\n\nIf your parents don't take it well, then that's their problem and you should stand up for your daughter.\n\n&#x200B;\n\n> but a close friend I confided in told me that I have behaved like an ass and that I needed to focus more on my daughter than pleasing my parents. \n\nKeep that friend around. They know what they're talking about.",
      "id": 199,
      "comments": [
        {
          "score": 1837,
          "content": "Considering op says \"WHEN the relationship ends\" and not IF, its clear he sees it as a tenporary thing and doesnt view the boyfriend as a long term partner/potential family member. I'd be interested to know if he'd feel the same about a white boyfriend. Or is it indicative that he is hoping it will end. Since hes \"not exactly a liberal\" and all.",
          "id": 200,
          "comments": [
            {
              "score": 635,
              "content": "I'm glad I'm not the only one who noticed that was pretty fucked up. I'd like to know how old OPs daughter and her boyfriend are. If they're in their teens I could see that it's likely they won't be together forever, but either way I would honestly be very hurt to know one of my parents was expecting failure from a happy aspect of my life.\n\nI feel bad for the daughter. She wanted her family to meet someone she really likes only to be shot down. I don't blame her for not talking to OP.\n\nEdit: and now that I know OPs daughter is 18, that confirms that she is capable of a long-term relationship.\nEdit edit: By \"long-term\" I don't mean forever. A few years. I don't think the fact that they most likely won't be together forever changes anything big picture.",
              "id": 201,
              "comments": [
                {
                  "score": 274,
                  "content": "OP said she’s staying with Jamal right now, so I would guess 18+.\n\nEDIT: He commented earlier she’s 18 and Jamal is 21.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Ah, thank you",
                      "id": 203,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "She’s living w the boyfriend since she and OP had their argument. So the daughter is at least 18. However, given his, ah...conservative background (grandparents mad at OP’s wife for the length of her skirt?!), I’d assume OP would be freaking out just a bit more if his 18 yo daughter was (temporarily) shacking up with a guy than say, if she was 22 or so.",
                  "id": 204,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Definitely a good point. 18 is still very young either way",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 145,
          "content": "why do you get where he's coming from?  He's coming from 1953.",
          "id": 206,
          "comments": [
            {
              "score": 15,
              "content": "\"I'm not a racist, I just prefer Jim Crow.\"",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2884,
      "content": "YTA for being more concerned about what some racist relatives and ignorant strangers think than your daughter's feelings.  This is part of why racism persists.  You're allowing the racists to control your - and your daughter's behavior.",
      "id": 208,
      "comments": [
        {
          "score": 1878,
          "content": "> While I'm not exactly what you would refer to as \"liberal\", he's a nice young man and as long as my daughter is happy\n\n&#x200B;\n\nCan we just talk for a second about how he subtly implies that dating a black person makes you \"liberal\".",
          "id": 209,
          "comments": [
            {
              "score": 622,
              "content": "Glad you caught that too. It made me do a double take. He also seems to assume that the relationship can't possibly last very long and is looking forward to that.\n\nI suppose growing up in a very racist community will do that to someone.",
              "id": 210,
              "comments": [
                {
                  "score": 199,
                  "content": "Being racist will also do that to someone.\n\nEdit: got banned from this sub for 30 days for telling somebody justifying segregation to fuck off but if your reply is true and living in large swaths of the country makes you racist than nobody should have a problem with the statement \"american culture is inherently racist and we should do something to change that\"\n\nDouble edit to Darthoverride since I'm banned: if youre in a community where interracial relationships are legit controversial you shouldnt have any problem with the statement \"you live in a bigoted community\"",
                  "id": 211,
                  "comments": [
                    {
                      "score": 16,
                      "content": "You become racist by living in such a community.",
                      "id": 212,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "This isn't about growing up in a racist community or living in a racist community. The daughter had to have lived in the parents house and isnt racist obviously. OP IS racist. \n\nBut I agree. The liberal remark just sounds crazy",
                  "id": 213,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Yeah. I was wondering why he thought his political party mattered, too.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "\"even *when* the relationship ends they won't forget it\"\n\nEmphasis mine. It seems like he's thinking of this as temporary or a phase.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 486,
              "content": "I love how by saying this, he basically implies that being \"conservative\" means you are racist. It's perfect, because he is",
              "id": 216,
              "comments": [
                {
                  "score": 125,
                  "content": "The funny thing is that there was no need to even offer this information in the first place. It's not really relevant what his political affiliation (and subsequent association) is to his daughter or her relationships unless he makes it that way.\n\nOP basically showed his hand when he could have easily kept the focus of the post on the grandparents' likely reaction.",
                  "id": 217,
                  "comments": [
                    {
                      "score": 16,
                      "content": "It’s like when you tell a story and preface it with \n\n“my Friend James is Black and he... “\n\nokay so what did your friend being black have to do with anything",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 77,
                  "content": "Hey if the shoe fits.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 4,
                      "content": "\"Hey, if the bedsheet fits...\"  \n\n\nFTFY.",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 260,
              "content": "That’s because he’s racist.\n\nThere’s no argument here. If you think simply being neutral about interracial marriage is a “liberal” political ideal and not a ethical obligation you’re a fucking racist. \n\nThis is dog whistling bullshit under the guise of “being diplomatic”. \n\nDon’t be diplomatic with RACISTS. Even if they’re related to you. You can tolerate those family members existence and peacefully exist in the same sphere, I do it everyday with mine. But you do not ever compromise your principles for their idiotic and immoral actions. You call them the fuck out, and if you don’t you’re complicit with their racism.",
              "id": 221,
              "comments": [
                {
                  "score": 28,
                  "content": "100% agree, I know we aren't supposed to get political in this sub but I truly think this is one of the main reasons we're in the state we're in with this country the non-racists or as OP refers to them as liberals are too polite and nonconfrontational and let the racists or as OP dog whistled conservatives walk all over them. This is the shit they fought against in the 60's and because we don't want to offend our dusty-ass grandparents we keep our mouths shut. I don't care how \"sweet\" your grandma is if she's racist fuck her, let her rot.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 14,
                      "content": "It doesn’t even have to be all or nothing, you don’t have to disown them. You just don’t CONDONE them. Don’t shift your moral principles to please people who we should know are unethical.\n\nIt’s about not being a coward and standing up for what you know is right. You don’t have to burn bridges, but if someone is racist and you don’t at least have a very serious conversation correcting them you’ve become complicit by definition. Then they can burn the bridge if they want.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "\"I mean, she's just got the jungle fever right now, it'll pass and I don't want her grandparents to view her negatively once she comes to her senses and settles down with a white man.\" If this is true, OP is a fucking nut.",
                  "id": 224,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 161,
              "content": "Subtly implies that viewing black people as completely and unequivocally equal to white people makes you a liberal.",
              "id": 225,
              "comments": [
                {
                  "score": 84,
                  "content": "I mean... He's not wrong, but unfortunately it says more about conservatives than I think he meant to admit. \n\nIf you're still out there yelling \"fiscally conservative socially liberal!\" and voting for Team Red, you're not as fiscally conservative OR socially liberal as you think you are.",
                  "id": 226,
                  "comments": [
                    {
                      "score": 23,
                      "content": "He said the quiet part loud...",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, fiscally conservative/socially liberal is such a bullshit contradiction. Income inequality IS a social issue!",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "This post is FULL of backhanded shit like that. So many red flags and indicators of prejudice yet the facade of acceptance. These are the same people who say racism doesn't exist anymore and completely ignore the words that come out of their own mouth dripping with underlying prejudice. \n\nI mean he might as well have said \"I'm not okay with it but her happiness is more important\" or \"it's okay because he's not one of *those* black people\".\n\nFucking A man.",
              "id": 229,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Gotta love the tacit admission that conservative views and racism go hand in hand. I mean it’s not like we don’t know, but when they slip up and admit it you gotta take a moment to appreciate it",
              "id": 230,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "or the fact that he chose Jamal as his name. god forbid any black person has a name like “john” or “bob”",
              "id": 231,
              "comments": [
                {
                  "score": 10,
                  "content": "How do you know it's a pseudonym? Did the OP mention elsewhere that he wasn't using real names?",
                  "id": 232,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Not even that it goes a step further - according to OP being okay with your daughter dating a black person makes you \"liberal\"",
              "id": 233,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Yea I didn't think not being racist was all that progressive.",
              "id": 234,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Ethnocentrism is a conservatism in itself (and essential to the majority of conservative ideologies), so dating outside of race is indeed a liberalism.  That's not to say that a mixed race couple couldn't both be Republicans or something it's just to say that with regards to their relationship they made a liberal choice.",
              "id": 235,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 150,
          "content": "[deleted]",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I get where OP is coming from. I'm gay and I chose not to come out to certain members of my family because it would do nothing but \"rock the boat\". I'd rather spend my last years with them happy, and there's no way coming out to them wouldn't be awkward. \n\nBut that's my choice. This is the daughter's choice.  Not the mother's choice. If my mom said \"Hey, I'd rather you didn't tell grandparents that you're gay\" I'd get it. But telling me I have to keep my life hidden? Hah!",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2821,
      "content": "OP, my grandparents feel as your parents do.  If I turned up on the arm of a man who was literally anything other than white, it might *literally* induce an aneurysm in my horrifically racist grandmother. \n\nYTA.   You don’t want your daughter to introduce her boyfriend to her grandparents *because they will make your life difficult if she does*.  \n\nI get it.   It sucks when someone in the family is loudly unpleasant.   But all that is needed for evil to prosper is for good people to say nothing.   The world burns if you tolerate racism, even from your own parents.   \n\nThis is a choice.   You are literally picking a side.   You have to pick one - there is no neutral territory here.   Staying neutral is the same as siding with the racists.   Telling your daughter to be silent and her boyfriend to be invisible is siding with the racists.   You have to choose now - will you be on your daughter’s side, or your parents’?   Whose battle line will you join?   Because there is a battle coming one way or another.   I suggest that you decide now, before the decision is made for you.",
      "id": 238,
      "comments": [
        {
          "score": 356,
          "content": "Wow, very well written response.\n\nMy Grandma can be \"loudly unpleasant\" too, so sadly I have decided to limit my contact with her, for my own well being.",
          "id": 239,
          "comments": [
            {
              "score": 114,
              "content": "[deleted]",
              "id": 240,
              "comments": [
                {
                  "score": 27,
                  "content": "Thanks for not being a trash human",
                  "id": 241,
                  "comments": [
                    {
                      "score": 23,
                      "content": "You give me too much credit.",
                      "id": 242,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "It's crazy to me that anyone makes fun of adults or kids speaking English with an accent.  I was talking to my brother the other day about how I admire these people even though their accents can sound \"funny\" sometimes, but at the end of the day these people are speaking a second language and trying really hard and making fun of them for that is pretty revolting.",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "My grandfather was always difficult to be around, but the Obama years were down right insufferable. I mean, that's really only the tip of the iceberg. There's the sexism and homophobia, too. And more. But you could not walk into his home without the news on, and the very moment Obama was mentioned at all, he'd go on the craziest (and incredibly racist) tirades. I got sick of being kicked out for calling him a racist. I'm getting married early next year. Not only is he not invited, he's only met my fiance once, as a courtesy.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "This is such a beautifully eloquent response. It gets the point across without escalating the conversation. Love it.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yes. OP, STAND UP FOR YOUR DAUGHTER IF YOU ACTUALLY CARE ABOUT HER. These people in your community who you refer to who supposedly are trying to tell you it's wrong are assholes. You need to stand up to anyone who makes negative comments about this. If you don't, that makes you an asshole too.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Exactly. This is the kind of shit that perpetuates racism.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1199,
      "content": "YTA -- And yeah, racist.  You care more about what other people will say about your daughter's interracial relationship than you do about supporting your daughter.  And if you can't stand up to your own parents for the sake of your own kid?  You're double the asshole.  Jesus.  The heck is wrong with you?",
      "id": 248,
      "comments": [
        {
          "score": 269,
          "content": "Yes, why is cutting out the toxic parents before they can cut you out, not the solution, op?\n\nI cut my toxic parents out BECAUSE I had children who deserved the rights they were born into as  human beings. No way in bloody fuck was I gonna make my kids live in the environment I grew up in. I let our differences be known, drew boundaries, and kept my mf word when they obvs broke them. \n\nBecause THEY'RE the ones who are wrong and not fitting to be in our lives, not the other way around. You're giving them respect and power they don't deserve. Not just over you, but YOUR kids?",
          "id": 249,
          "comments": [
            {
              "score": 20,
              "content": "easy guess here - the parents have $$$ and OP doesn't want to lose his/his daughter's inheritance.",
              "id": 250,
              "comments": [
                {
                  "score": 19,
                  "content": "Probably, and let me say this...I have lived a very difficult existence bc I wasn't willing to be a phony to get money I didn't earn in the first place.",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I did this too. I now have NC with anyone in either side of my family, but my babies are safe and that’s all I care about.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1071,
      "content": "YTA. \n\n\" While I'm not exactly what you would refer to as \"liberal\" \" as opposed to what..? \n\nPlus, maybe your daughter is perfectly conscious about the kind of environment she lives in, and maybe, just maybe, she just can't give a damn about this. Your parents sound very rude and racist, and you still want to \"spare\" them?",
      "id": 253,
      "comments": [
        {
          "score": 827,
          "content": "Fucking right? I could barely get past that point! \"My daughter's dating a black boy and while I'm not one of them there liberals, he's one of the good ones.\" \n\nHow very fucking progressive of you, OP. YTA.",
          "id": 254,
          "comments": [
            {
              "score": 312,
              "content": "Lord, I hope OP never says to Jamal that he’s “well spoken”.",
              "id": 255,
              "comments": [
                {
                  "score": 135,
                  "content": "Articulate.",
                  "id": 256,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Clean.",
                      "id": 257,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "[deleted]",
                  "id": 258,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Connor",
                      "id": 259,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "I hope Jamal is his real name, and not some anonymous nickname OP picked because if it is he couldn't have picked a more telling name.",
                  "id": 260,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I grew up in a majority black neighborhood and I've seen some interesting names but literally never a Jamal outside of 4chan greentext and other racist fan fiction.",
                      "id": 261,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I have relatives who honestly believe they're progressive and not racist because \"You don't have to be black to be a n-word\"\n\nAccuse them of being racist and in reply you get some variation of \"You're making the word lose all meaning\" or \"This is why Trump won\"",
                  "id": 262,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "*\"By the way, I would have voted for Obama for a third term if I could.\"*",
              "id": 263,
              "comments": [
                {
                  "score": 12,
                  "content": "“I have black friends” \nI couldn’t even finish reading OP’s post but I KNOW that he put other qualifiers in there proving how not racist he is. YTA asshole.",
                  "id": 264,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Lol. That was a good movie",
                  "id": 265,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 78,
              "content": "I clocked that shit too. Insane.",
              "id": 266,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This is exactly how this post read to me. And I’m also guessing granny and papaw have a chunk of money OP is waiting to inherit...",
              "id": 267,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "No kidding. My sister has a mixed son. Some grand aunt who we've met once officially informed her she would never speak to her again. My grandfather (the aunt's BIL) said \"even if I don't approve, I would never hold it against a *baby*\". He actually thought that he wasn't racist because he only held someone's skin color against adults and teens, and not children. Just completely, unbelievably hypocritical.",
              "id": 268,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 108,
          "content": "Damn didn't realize tolerating inter-racial relationships qualifies as liberal... YTA",
          "id": 269,
          "comments": [
            {
              "score": 19,
              "content": "[deleted]",
              "id": 270,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Exactly! JFC",
              "id": 271,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Welcome to 2019 where being a decent human being excludes you from being conservative.",
              "id": 272,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "[deleted]",
          "id": 273,
          "comments": [
            {
              "score": 16,
              "content": "He's saying \"I knowingly ally myself with racists\".",
              "id": 274,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Seriously, what the hell happened to us where not being racists became a trait associated with only one side of the political spectrum.",
          "id": 275,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "that's a coded way of saying \"i'm pretty racist, but i keep it to my self for the most part.\"",
          "id": 276,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 870,
      "content": "Sorry mate but YTA massively here. “How these matters are viewed by certain segments of the population” you mean racists? Including your parents? Whose opinions you shouldn’t give a shit about because they’re racists? Dude, be a decent parent and stick up for your daughter. You know your parents are in the wrong, why be on their side?",
      "id": 277,
      "comments": [
        {
          "score": 289,
          "content": "The other galling part of this is that the OP has no issue living a town full of racists and having his parents believe he is a racist as well.",
          "id": 278,
          "comments": [
            {
              "score": 243,
              "content": "\"I'm not a racist, but please keep that between us, okay?\"",
              "id": 279,
              "comments": [
                {
                  "score": 20,
                  "content": "That's because OP is racist.",
                  "id": 280,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "That’s such a great and accurate way to say it.",
                  "id": 281,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "thank you. so glad I wasn't the one that thought this.\n\nimagine living in an area where at best you have to 'pretend' to be racist to fit in. who, tf, would willingly live in an area like that unless they were racist themselves and enjoy the insular seclusion it provides?",
              "id": 282,
              "comments": [
                {
                  "score": 14,
                  "content": "I mean, not everyone has the privilege of being able to move at will.",
                  "id": 283,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}