{
  "post content": "To start, free bleeding is essentially not wearing any form of protection on your period (so you are bleeding freely - clues in the name).\n\nI'm currently staying at my MILs house with my husband for a family get together (six birthdays in one week).\n\nI have horrifically painful periods and bad mobility. I can not use cups and am allergic to all brands of pad I've used (rashes on all genitalia, which does not feel good). I do have cloth pads but I only brought a couple small ones for my trip as I wasn't due on until days after we got home, but we're on day four of our trip and I started my period on our first night. \n\nI tried to use some disposable pads I picked up but I broke out in a rash and have blisters everywhere they should not be, so two days ago I decided to say what the hell and free bleed like I do at home.\n\nI bring my own towels to my MILs, so I have been sitting and sleeping on those. I have bled through twice but cleaned the mess and left no stain. \n\nMy MIL is pissed off to say the least. She's disgusted by my lack of decorum and carrying my bloody towel around everywhere. She also hates that I'm washing them in her machines and is now saying we need to pay to have them professionally cleaned (which we will do).\n\nEverything kinda came to a head last night when she lost it on me for \"behaving like an animal\". She wants me to leave, but my husband stay, which isn't possible (one car, I can't drive that far, especially not with the amount of pain I'm in).\n\nMy husband is on damage control but I just feel so shitty. Am I in the wrong here? I understand that it's not super sanitary but my health matters more than some bed sheets. I'll replace them if she wants.\n\nI'm close to just gritting my teeth through the pain and putting a pad on, but I really don't want to. I don't want open sores down there when we're driving home - sitting for that long will suck.\n\nAITA? I feel like I'm choosing the lessar of two evils but now I don't know.",
  "id": 1,
  "comments": [
    {
      "score": 51680,
      "content": "YTA. This is completely unsanitary and disgusting to do in someone else’s home. You do have options you know can work, including period panties; you should have come prepared. Period suppression is also an option with contraceptives, for the future. “Free bleeding” in someone else’s home is never an option. The better option would have been to leave, and if your husband needed to leave in order to facilitate that, that’s fine. One must have quite a sense of entitlement to spill their biohazard all over someone else’s home and property. Absolutely wild.",
      "id": 2,
      "comments": [
        {
          "score": 1015,
          "content": "I was instantly thinking of period panties! OP try them! \n\nAnd I totally agree it's not okay to openly carry around bloody towels and sit with them on everything. As a woman I don't think periods are disgusting or one should have to be ashamed of it....but if she can sit on the towels I am sure they would have been the option to put like a smaller one like for washing the face inside wide jogging pants or something instead of openly carrying her bloody things around? Knowing the smell of period blood....oh my....so much the YTA",
          "id": 3,
          "comments": [
            {
              "score": 455,
              "content": "I had an ex-partner that used bandanas as pads instead of traditional pads. She swore by them and found them to be very comfortable. She would change them like regular pads and then wash them throughout the week. This or wash clothes like you suggest seems like far better options than free bleeding at OP MIL’s house. \n\nI recently had a hysterectomy in my 30s due to horrific periods that ended up being massive fibroids and severe endometriosis. I get period pain. I would NEVER EVER even on my worst days have free bled anywhere that wasn’t my home. \n\nSorry OP, YTA. Cut the trip short with your family and go home. Not worth suffering there and causing a family riff over this.",
              "id": 4,
              "comments": [
                {
                  "score": 41,
                  "content": "Also have endometriosis and adhesive allergies and mobility issues like op and on top of that also get irritated tiny cuts from most pads + I can't use tampons or menstrual cups because of the angle of both reproductive system.\n\nI have free bled a few times at home and with numerous layers -- some waterproof and stain proof -- between my most ugly sheets. I once spilt an entire water bottle and it didn't get through...\n\nIn this situation if I felt pressure to stay I'd have gone to the baby section at Walmart and gotten those thick ass Gerber fabric baby diapers that look like they're from 1940. \n\nThose things can absorb so damn much and tbh I only know this because a housekeeper I worked with swore by them for dusting and cleaning rags because they're soft, easy to wash, and absorbent.\n\nI'd also be like getting a shitty hand towel from Walmart or whatever and putting them in undies if they didn't have those.\n\nIdk there were things OP could have figured out \n\nEven if I am pro-period, even if I think very often people are weird about encountering evidence of menstruation, it makes MIL uncomfortable/it's MIL's house/it's MIL's sheets and guest bed. At this point IDK if we can believe OP re: no stains. \n\nThe washing machine bit is whack, though, and would still be a problem. Gross shit is guaranteed washed in there. Cleaning rags? Mops? Towels that get poop spray? Towels that get allllll sorts of germs? And more. \n\nI mean, washing the sheets and towels with no other laundry and maybe cleaning out afterward is not horrifically gross. But I think that's one too many hoops to jump through trying multiple different solutions and then having to shell out more would mean time to go home.\n\nIDK, the more I think on it the more I'd risk also damaging the MIL relationship by leaving than by pulling... this.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Sounds like you have a retroverted uterus like me. Have you checked out the Hello Disc? I can't use tampons with the angle of mine, and cups caused cervix pain and leaking. Thought I'd mention it just incase it's of benefit to you! 😊 The design is good for low cervix (like myself) or high, and I've never had it leak even when overflowingly full. 🙂",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I read this as bananas!! Got to the her washing them bit and was so confused lol",
                  "id": 7,
                  "comments": [
                    {
                      "score": 7,
                      "content": "ME TOO.  Oh my God, I need to read slower 😵‍💫",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Yes! Like even wrapping some layers of toilet paper around your underwear would help some. If her periods are so strong she still leaks fast she unfortunately needs to change/renew all 30mins. It sucks but she could at least try. She could still sit on the towel outside just in case and double protection for small leaks but wouldn't have to openly carry a totally bleed through towel...",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Also have endo. I once bled so much in a friend's shower I blocked it. I was about 13. It was horrible and so embarrassing. I wouldn't Subject myself to that purposefully.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "I can get period panties in my local supermarket, maybe go have a look for some? Free bleeding is fine, but not when it affects the belongings of others.",
              "id": 11,
              "comments": [
                {
                  "score": 10,
                  "content": "Yeah I actually prefer not using pads or anything at MY home just thicker normal panties and change/use the bathroom often to make sure I don't leak on anything. But I only risk a mess on MY things, not anyone elses and I don't force a front-row seat on my bloody period towels on anyone else either. There's a big difference of being in one's own home or being a guest.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yep. I free bleed most of the time now,  my period used to be hell, like the scene from The Shining. I got a Mirena IUD and it still causes debilitating pain, but is much lighter except for clumps, which stay in my undies. I only need protection when I work or go out, and if I'm on a trip I'm super paranoid and take extra. \n\nOP is saying that they are disabled and cannot insert a cup, but maybe if they got their husband to help? Being stuck at the in-laws and going through this sounds like hell, I'd be willing to try anything at that point.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm wondering if she could wrap a washcloth around a pad. Since she's not touching it with her body, would she react?",
              "id": 14,
              "comments": [
                {
                  "score": 7,
                  "content": "Yes! She said she used period panties and she has cloth pads and washclothes she can use. But they leak after a while. But her towels leak as well...so why can't she use the pads, wrap pads with stuff she is not allergic to (as you say) and then use the towel just as a security double? Like why not use both? And thus reduce the amount of blood on the towel you openly carry around?",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1000,
          "content": "Also she “bled through twice but left no stain?” Yeah I don’t buy that. Blood doesn’t just wash out. She owes her MIL new bedsheets.\n\nOP’s situation is really unfortunate but she needs to either figure out something as far as period products that will work, or else stay home during her period. It’s not acceptable to “free bleed” in someone else’s house.",
          "id": 16,
          "comments": [
            {
              "score": 459,
              "content": "It’s actually quite easy to get blood out of cloth IF you’re quick about it (hydrogen peroxide). That being said, if someone chose to bleed on my sheets I would be pretty upset regardless of whether a stain was left. I agree OP’s actions are definitely not acceptable.",
              "id": 17,
              "comments": [
                {
                  "score": 29,
                  "content": "I honestly don't buy the \"no stain\" bit. OP said she was both sitting and sleeping (she could sit on chairs, a couch etc), but didn't say where she bled through, if the material was colored / type of material etc. \n\nIt's not enough to just not leave a stain if it looks different than before she bled through it. Moreover, people have different standards for \"it didn't leave a stain\".\n\nEdit: added the paranthesis",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Cold Water also works really well on blood if you don't have Hydrogen Peroxide!  Again, you have to be quick about it.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yes cold water and soap! I made a huge mess growing up and my mom told me how to save my undies and sheets. Hell cold water and soap also works on any blood related messes. My fiancé got a nosebleed on his white shirt. Insta ran to the sink and washes it after it stopped. Saved that shirt.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "If she bled through A TOWEL, I find it hard to believe it wouldn't also go through one thin bed sheet and onto the mattress itself, unless she took precautions and put down one of that waterproof covers usually used for bed wetting, which she probably would have mentioned if she had.\n\nAnd even she did manage to get the surface stain off somehow by just rubbing it with something, it is still likely just below the surface... Definitely not okay.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "You don’t even need bleach, just cold water. One of the first things my mum taught me after I started. Cold (specifically cold, not hot, water is shockingly good at getting blood out if it’s not dried in). \n\nAlso agree that intentional free bleeding in someone else’s house is not okay, not justifying her actions here, just a tip!",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Only use hydrogen peroxide on certain fabrics! Like, don’t make the mistake I did when I had breakthrough bleeding in college and ruin the couch…it freaking bleached the upholstery. There are other solutions to use (FOLEX IS $16 for 2 bottles, it’s a miracle) but please—a giant white/pink bleach circle is way more obv than the im tiny blood drip I left and I had to flip the vision forever.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "If she stained the sheets she may have stained the mattress too. She might owe MIL a lot more than new sheets.",
              "id": 24,
              "comments": [
                {
                  "score": 10,
                  "content": "yeah that's what I was thinking man I would be pissed of with that... I get my mattress professionally cleaned every year and even that does get all the stains out which aren't even blood tf",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "Blood can and does come out of sheets. My period started during the night recently and all came out of the light blue sheets and white duvet and cover full two days later. I just did a double pre rinse and wasted on powdered Tide on hot. Didn’t even pretreat.",
              "id": 26,
              "comments": [
                {
                  "score": 127,
                  "content": "Alright, but if it’s someone else’s sheets I still think she should replace them. If it’s your own it’s different.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Handy hit, use cold water for blood stains, it's more effective.   Cold salt water in particukar is fantastic for getting blood out of clothing/bedding",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 765,
          "content": "“Free bleeding” in your home is okay! But in someone else’s home, that too when you know they are uncomfortable! She could have gone to the store to get more cotton pads or just spoken to the MIL on whether she’s comfortable with it. If not, she should have chosen to leave!",
          "id": 29,
          "comments": [
            {
              "score": 43,
              "content": "I will not sit anywhere in a free bleeders house. I don't need to be exposed to their body fluids.",
              "id": 30,
              "comments": [
                {
                  "score": 25,
                  "content": "Now I understand when a co-worker told me she rarely eats from a potluck. Dude, seriously, you never know if people are clean, let their kids lick the spoon or have pets on the counter etc",
                  "id": 31,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Store bought only at potlucks. And nothing that should be refrigerated. Maybe not entirely risk free but certainly reduces it.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "The entitlement is this one is beyond crazy.. even women that choose to “free bleed” do so respectfully for the most part. This reminds me of when I was a kid and a girl in school started her cycle for the first time.. she also had white pants… I remember so vividly is bec she was traumatized all the little kids were laughing and a female teacher swooped in and covered her with a jacket… but this woman.. I’d find a new wife",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 667,
          "content": "And i can only imagine how gross and smelly that towel is. Imagine trying to eat and she walks in with a menstrual blood soaked towel, I’d lose my appetite.",
          "id": 34,
          "comments": [
            {
              "score": 399,
              "content": "I’m thinking about how gross her clothes are if it’s bad enough to have to sit on a towel.",
              "id": 35,
              "comments": [
                {
                  "score": 10,
                  "content": "Omg. Seriously",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 204,
              "content": ">imagine how gross and smelly that towel is\n\nYes! Omg I'm in my mid 30s and I still remember in hs when a guy friend of mine asked why this *smell* was lingering around one of our female teachers that day ... and I was like I'll tell you but you cannot repeat it (she was on her period and needed to change her pad)",
              "id": 37,
              "comments": [
                {
                  "score": 31,
                  "content": "Which makes me think that poor teacher knew that and hadn't had the time to go to the toilet.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "And some of us just have a really sensitive sense of smell. My daughter gets mad when I tell her that her period is going to start in the next 12-24 hours, but mostly because I’m always right.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Next time tell her \"Congrats, you're not pregnant!\"",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I keep using this phrase to describe that specific smell -- a coworker showed me this video where a guy describes his bathroom after his gf changes her pad as smelling like \"dog surgery\" 😭. It sounds so gross and insensitive at first, but then I feel like anyone who's had a period knows that it's somehow strangely apt lmao. It's a very.. specific odor",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Not to mention the fact that if OP is anywhere in the northern hemisphere it’s late summer, so it’s basically hotter than the breath of hell. Even if MIL’s house is air-conditioned, I don’t want to think about the reek from someone’s menstrual-blood-laden towel amplified by mid-August heat and humidity. This situation is foul and OP’s behavior is entitled beyond words.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Her MIL is a polite woman for just saying things verbally. I would've kicked her out instantly.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 206,
          "content": "Yup. This was done intentionally as an exhibitionist or NC kink, if it was actually done at all. Reads like fiction",
          "id": 44,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 156,
          "content": "That’s a literal biohazard. How absolutely disgusting.",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Yeah I'm not even going to waste my time reading this. YTA. Blood is a biohazard. Stop being fucking gross and giving women a bad name. Do whatever TF you want in your own house but not in others. I have period panties for when I'm not sure if my uterus is going to be a bitch or not. Buy some if you don't like the standard tampon/ pad option. \n\nHalf of the population gets a period, you're not special. Stop your shit. Free bleeding is fucking gross. That's like saying free pissing and pissing all over the place. But at least urine is sterile. \n\nI am a woman, I've been bleeding every month for over 20 years before anyone comes at me.",
          "id": 46,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "I really can't imagine walking around with a .. period towel? In someone else's home, with probably other family members around... It's just so bizarre",
          "id": 47,
          "comments": [
            {
              "score": 18,
              "content": "> In someone else's home, with probably other family members around\n\nThe reason for the visit is *SIX BIRTHDAY CELEBRATIONS.* So I'd assume the entire extended family!",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "It's the sense of entitlement of trying to bring a baby into this mess that gets me .\n\n'I can't cope with my period so bringing a baby into this seems ideal'",
          "id": 49,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "And certainly not long term. If she has to free bleed for a day until Amazon delivers reusable pads/period underwear I’d be giving her a pass because it was unplanned but to decide to just keep doing it especially when she’s bleeding through.. it doesn’t matter if she cleans it it’s totally understandable to be upset that she isn’t willing to do anything about it",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19818,
      "content": "YTA. Listen I’m a woman and I suffered for decades with painful oh horrifically painful endometriosis pain. Periods where I bled through a tampon and pad in 1-2 hrs. It was bad. I’m also allergic to pretty much every pad. So I get it!!! I really do. But you’re the a. This is not appropriate on any level. This is your MiL’s home and it should be respected. Not “I’ll replace the sheets.” If this is a major issue you should have prepared better. And If you did bring your cotton reusable pads why aren’t you washing them (even by hand) and drying them to use?!?! This is crazy and you’re in the wrong.",
      "id": 51,
      "comments": [
        {
          "score": 8911,
          "content": "The part I don't understand is why, if she is going to bleed on the towels and it's an emergency, did she not just cut up a towel and stuff some in her underwear like a makeshift cloth pad? Like it seems like sacrificing one towel is far more preferable to bleeding publicly in front of your MIL and family??? I'd be embarrassed, jesus.",
          "id": 52,
          "comments": [
            {
              "score": 6904,
              "content": "This kind of behavior is teetering on the edge of performative I'm-in-pain-so-I'll-make-it-EVERYONE's-problem behavior. Because yeah, if the material of disposable pads in the problem, then OP would surely—as she is a grown adult woman—have a system in place, like reusable pads. There's no way this issue just sprang up this month. So I wonder if OP isn't intentionally doing this to get a rise out of everyone.",
              "id": 53,
              "comments": [
                {
                  "score": 4112,
                  "content": "This has to be it. \n\nI feel like by their 20s all menstruating women have had to fashion a pad out of something random, like toilet paper with paper towels last or a clean sock on a camping trip or something. \n\nPeriods are natural, but blood is very much a biohazard. The shame isn't in menstruating, which does not make you gross or dirty, but in spreading your biohazard unnecessarily in the home of someone who is clearly uncomfortable with it.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 2361,
                      "content": "In a pinch disposable masks are great, waterproof, conforming, and you can use a cloth inside them. Don’t ask how I know",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1145,
                      "content": ">a clean sock on a camping trip or something. \n\n\nI remember a sex ed teacher in grade 6 who put us in this exact scenario and asked what we'd use if we didn't have any menstrual products with us. \n\n\"Socks?\"\n\n\"Yep, great!\"\n\n\"Folded underwear/tank top?\"\n\n\"Sure.\"\n\n\"Gauze/bandages from the first aid kit?\"\n\n\"Perfect!\"\n\n\"Leaves!?\"\n\n\"... probably not very absorbent\"",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 306,
                      "content": "MacGyver could've made a pad with a paperclip and a doorknob!",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Good lord! Right? This reminds me of the post about the coworker free bleeding at work and compounding it by not bathing during her period. The OP there found it gross she’d leave a blood pool on her desk chair, a chair in the lunchroom, the toilet seat, etc. When she and others complained the coworker upped the ante by aggressively marking everything in the office with blood. Walls, door handles, coworkers desks. IIRC after that happened the boss tried a Hail Mary by confronting her in his office and there was an inference that the coworker blatantly slapped something bloody on his desk.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "If I had a 💵 for every time that I had to figure out something on the go for my period due to an irregular cycle, damn, I'd be able to go on a nice shopping trip. It would be really easy to go to a store and maybe get some cloth diapers, period underwear or even wash cloths to use while they are staying with OP's ILs. I don't understand how she could feel like she's in the right here.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It's been awhile since I've used a sock. Completely forgot about that until now.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 699,
                  "content": "Her carrying around the towel is like a toddler carrying their favorite blanket around",
                  "id": 61,
                  "comments": [
                    {
                      "score": 174,
                      "content": "A bloody towel, no less! ;-)",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "I know I’m being dramatic, but I’m just imagining this towel to be completely full with blood dripping down off her hand while she walks around the house",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Like some disgusting bizarro Linus!",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 101,
                  "content": "Included with the cheeky little addition of (… - clue is in the name)",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Absolutely. There is no way a grown woman hasn’t come up with a period management system.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": ">This kind of behavior is teetering on the edge of performative \n\nYeah, I was thinking more \"WOMEN have PERIODS, we BLEED regularly, do YOU HAVE A PROBLEM WITH THAT?!\"\n\n&#x200B;\n\nAnd yes, I shit regularly, but I don't want anyone else shitting in my presence, thanks anyway. Like, I'll put up with it from my toddlers, but I'd prefer they didn't TBH.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "It’s this. Guarantee she’s got some political spin on it.\n\nI’ll never understand free bleeders because I’ve had to use pads before and it’s so gross to just like, cough and have a bunch of blood and tissue squirt out of me. Laugh at something? Blob of blood. I can’t imagine then letting it clot up my pubes which are painful to clean dried blood from, and then let it soak through my clothes. I mean… just the smell alone would make me feel so unsanitary\n\nI’m wondering if OP is shaving her pubes which would greatly contribute to the rashes she gets.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "It's not teetering. It's THERE.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 938,
              "content": "My first thought was that she could wear two pairs of underwear with a pad in the middle. \n\nSomething...anything!",
              "id": 70,
              "comments": [
                {
                  "score": 268,
                  "content": "Wow that's genius! I have a bad reaction to the most available brand of pads in my country and I can use this idea if I'm in a pinch, thanks!",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Very clever indeed.  She's already wearing them, so she knows for sure that she won't have an allergic reaction. \n\nI'm giving her the benefit of the doubt, but being allergic to EVERY type of period product seems unlikely.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I was just telling my husband this! Our newborn was allergic to several big brand diapers and when we took it to our pediatrician he already knew what would maybe work for us and did. Finding it super hard to believe her that ALL brands are harmful.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Ooh that’s clever!",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Yep. That's exactly where I went too. Or a layer of cotton wool inside to act as a barrier to the pad. \n\nAlso, frankly, if someone is having periods that are so traumatic, surely you would try to track them, consider a form of birth control that would reduce to pain OR regulate the occurance.\n\n I've bled through pads, tampons, jeans. I've done the tp emergency effort. I've tied a scarf around my waist, I've approached strangers to borrow products from in the ladies. We have all been caught out now and then. But this is disgusting.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Seriously. I’ve been on birth control since the age of 14 because of my periods. I needed it to regulate the frequency and flow as well as the symptoms (cramps and migraines). Once I was done having kids I had a hysterectomy. I find it hard to believe that someone with such severe symptoms who is also allergic to apparently every man made product out there isn’t doing anything to help control their periods.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Oh man, that’s so smart! I never even though to try that! I also have a bad reaction to some pads. If I’m ever in a pinch and have to use one I’ll remember this!",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 796,
              "content": "Is the idea that she bleeds through her undies AND pants/skirt and just sits/sleeps on a towel? The state her clothes must be in at the crotch area my goodness.....\n\nThe constant wetness from the blood against her skin (esp inner thighs) must also be causing issues, seriously?!\n\nThe more I think about this the more I'm convinced it's either a super troll or a super moron. Like wearing a pair of undies before putting on a pair with a super maxi pad on top so the pad isn't against skin....or even the pad stuck directly to the pants. Literally ANYTHING is better than just bleeding everywhere.",
              "id": 78,
              "comments": [
                {
                  "score": 460,
                  "content": "I agree. Free bleeding is such a controversial and let's be honest, gross idea, that it is perfect rage bait. I can not believe any grown woman would sit in crusty bloody pants chafing against supposedly blistered genitals. Dried blood is not pleasant on the skin. If you were used to menstruation and in this kind of pinch, you would put a rag or towel inside your pants, not drag a blood soaked towel around the house. This is 100% fake.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I will free bleed sometimes, for similar sensitivity reasons. The difference is that I have light periods and I only do it at night, in my own home, and I immediately wash the towel and myself in the morning. Sometimes it’s just the only way I’m going to get sleep.\n\nI am looking at getting period panties, because I also don’t like it, and it’s not ideal.\n\nAnd I’d also die before openly doing so anywhere but my own home.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Agreed. I thought free bleeding was found to be created by trolls in the early 2000's. https://knowyourmeme.com/memes/free-bleeding",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Re: being fake\n\nThere was definitely another free bleeding story on here in the last year where I think OP had a friend who was a free bleeder and refused to clean up or pay for cleaning of OP’s upholstery because “it’s natural” and they were “shaming” her.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "She's either bleeding through her clothes onto a towel, or she's not wearing underwear and pulls up her skirt to sit directly on the towel. Not sure which is worse.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "The smell.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yeah, considering how period blood can absolutely reek with pads and such already, imagine the smell without them…",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I really don’t get it. The only time I have ever “free bled” is on my super light first and last day. For some reason the cramps seem to be worse for me on the lighter days. So I’d just not wear a pad or tampon at home and go to the bathroom a little more often and wear the period underwear, not the ones made for absorbing, but the ones like every lady has that you keep around for this specific reason. And even then I wasn’t bleeding enough to bleed through anything. I also used wet wipes to clean up any blood that got on me during this time. But I’d be damned if I went to anyone’s house without at least a liner on. My sister has pretty severe period cramps and has big issues with tampons and anything inserted and is just very uncomfortable in pads, and she has found ways to keep safe and sanitary. \n\nLike what I’m wondering is what does she do in public? Like does she just stay at home all day? What about work? Does she carry a towel around there? I don’t understand how this woman lives her life. If you have found solutions for outside of the house situations while on your period, then you can apply them to your MIL house. The husband either enjoys the bloody nonsense, upsetting his mom, or is some odd saint because as far as I can see there is no “damage control” to be done",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "She complains about the extra laundry that cloths make in another comment but what about all her own bloody clothes? Unless she is walking around bare-assed in her MIL’s house sitting on her bloody towel.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I didn't tme even think of this! I'm a heavy bleeder and sounds like she might be too, wouldn't the blood run down her legs/pants too?!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 333,
              "content": "Attention. That's why",
              "id": 89,
              "comments": [
                {
                  "score": 20,
                  "content": "This is exactly it. Is she even suffering if she doesn’t make everyone else acutely aware of it?",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "100% OP wants attention. This is a mental disorder not a physical one.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Right-I think we found her “disability”. \n\nImagine sitting down with a snack and here she comes, “thwap!” With the towel, then the scent wafts to you and you hold back the gag, get up and go…she smirks and grabs your bowl of pretzels bc that’s what she wanted all along…",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 303,
              "content": "Well, technically, they used to call it \"being on the rag\" so yeah, why not go back to the old methods and cutting up a towel to make an absorbent rag in your panties?",
              "id": 93,
              "comments": [
                {
                  "score": 7,
                  "content": "There was a girl I went to middle school with who had to literally use cloth rags on her period bc she didn’t have a mom and her dad refused to buy pads/tampons. She was very, very socially awkward as well and never asked to even borrow pads or tampons or take the occasional free ones that would be left in the bathroom sometimes. The only reason we even knew she had to use rags was bc the gym teacher kind of spilled the beans; she made a point of making this girl leave the girls locker room before telling the rest of us how we don’t know what’s going on in other peoples lives, we should put ourselves in other peoples shoes, and to be nice to her (I guess bullying happened before, not that I ever saw personally tho, and even still I would’ve thought the teacher telling us such sensitive details would be more bully material???). Additionally, more than once someone had found bloody rags in the trash of the girls locker room (and naturally almost everyone would go look) so we had already known someone was using actual rags. \n\nI felt bad for her because I could not imagine having to deal with my heavy period on just rags. I constantly worried about bleeding through bc mine was so heavy, even with those thick ass pads and a tampon.\n\nThat said, they *worked* for that girl, so I don’t see why OP didn’t just do that.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 280,
              "content": "Because it’s power play. I guess she doesn’t like her MIL and wants to create this weird drama.",
              "id": 95,
              "comments": [
                {
                  "score": 10,
                  "content": "Like a literal animal",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 162,
              "content": "This was my thought too. Like why can’t she just go buy a cotton rag/fabric/towel etc??",
              "id": 97,
              "comments": [
                {
                  "score": 22,
                  "content": "I’m sure if she’d have asked her MIL she would have happily given her an old towel or sheet to cut up rather than have her bleeding everywhere & sitting in bloody clothes the whole visit!",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Cloth diapers are readily available and work well for this situation.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I cut up all kinds of old stuff when I lived a long way from town and had a breakthrough.  \n\nI kept a fire going and burned the pieces as I finished with them.  After that period, I saved all the old towels and sheets for next time I was caught out.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Yeah, that’s where I went too. I was kind of with her until the phrase “carrying my bloody towel everywhere”. \n\nThat is genuinely disgusting. Not in a misogynistic *if you hold your pee how come you can’t hold your period* caveman way, but in a *MIL would have no fucking idea you’re even on your period if not for the bloody rag over your shoulder* way. \n\nJust, yuck. Even if a towel is the solution and if she thinks she can’t rip said towel up and use it inside her underwear for discretion there’s nothing stopping her from cleaning the soiled towel and using a clean one in a cycle so she’s not actively sitting in an ever expanding blood pool all day. As a woman I just cringe at the thought of gathering at the dinner table and her slapping down a blood soaked towel right before eating.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Oh god I hate to say this but my mom gave my sister and I no menstrual education growing up (90's so wtf) and would shame us if her pads went missing so we'd use old shirts/towels/toilet paper. A lot of things work that aren't pads. I'm lucky now as an adult cups are a thing and fit my body well (I get that's not a luxury for all tho). This comment just brought me back lol",
              "id": 102,
              "comments": [
                {
                  "score": 15,
                  "content": "That sounds horrible tbh. I'm sorry.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I mean, when my period was so heavy that only towels would contain it, I put them in my panties like a pad and wore old black sweats that wouldn’t get ruined. There’s no reason for anyone to be exposed to it besides you and maybe the person you sleep next to, if things go awry in the night.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 876,
          "content": "Agree, as someone who also has heavy, irregular menstruation on top of other chronic illnesses. Also, putting health first would mean seeing ob/gyn about this combo of heavy bleeding and skin sensitivities/allergies impeding hygiene.\n\nOP, why are you staying at your MIL's home? If it is remotely about celebrating others' birthdays, you are clearly making that difficult for the host and other family, while bleeding on to furniture. Either go home with your spouse (be a team committed to free bleeding), or layer up. For myself, I learned that heavy days require period underwear (a few pairs of Thinx to switch out between washes, with maximum coverage preventing leakage), with a thick overnight adhesive winged pad, and super+ cotton tampons I change frequently. I also gently wash myself with water and a light soap (external parts) every few hours during heavy days because period blood can have a strong scent. \n\nHygiene is a social agreement, so you have to decide if you want to be around others (not free bleeding in their home) or return to your personal space. Demanding others to accommodate your practices (bloodborne pathogens exposure, furniture stains, etc) would make YTA.",
          "id": 105,
          "comments": [
            {
              "score": 31,
              "content": "I would guess it's a power play. Poor her, her husbands family treats her like garbage and she's only ever been kind to them. FFS, she needs to use her brain",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Seriously I’m wondering if she has seen a doctor about this yet, both for the extremely heavy bleeding/pain and also for the skin sensitivity to pads. I feel that should absolutely be the first step because there has got to be more options. I always had suuuuuper heavy and long periods where I usually had to double up every day, and my cramps were so bad the first couple of days I’d be bed bound and popping ibuprofen like candy. If my period came early and I was anywhere but my own home, I would immediately be peacing out and running to my bed lol. Seriously why wouldn’t her husband bring her home? And idk how far away his family is but he could even go back on his own for the rest of the week.\n\nAlso I love your username haha",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 364,
          "content": "Agree! Also if you in the US they sell the period underwear in stores like target, Walmart and most drug stores now. You could've easily purchased some. \nAlso if you knew it was coming but thought it would be at the end of your trip, never risk being unprepared, periods don't care for your schedule. I've been on vacation and my period started way earlier than I expected but had stuff to tide me over/my travel set.\nYou say you can't use cups is it a fit issue? Cuz if so my life has changed since changing to a menstrual disc, a lot easier and you can wear it for 12 hrs without removing it.",
          "id": 108,
          "comments": [
            {
              "score": 139,
              "content": "Right? In Australia you can buy period undies in most supermarkets. It's not some niche, difficult-to-source product at all these days.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Literally every Western country sells period underwear at all department stores. It is now a standard item of sale.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "The menstrual disc is great.  Never tried a cup, but can’t say enough about the disc.  That said, I was on a trip a few weeks ago with no car and even the Walgreens had period underwear.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "[deleted]",
          "id": 112,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "Agree very much.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "THIS! And she even admits she 'only brought a couple small ones \\[pads\\] for my trip as I wasn't due on until days after we got home,' *but somehow had the foresight to PACK EXTRA TOWELS TO FREE-BLEED ON?* \n\nGirl, NO. You are the biggest, most disgusting, disrespectful AH.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Something doesn't add up to me in this story. She washed her towels in the MILs laundry machine but hasn't washed her few reusable pads that she brought? Why haven't those been washed and reused? Even if they were small she could double up. Wash the first pair in the sink/tub and let it air dry while you wear the second pair. There seem to be many more options than just free bleeding. \n\nI call BS on this story.",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Absolutely. I don’t have endometriosis (I feel for you) but I am allergic to pads. I never used to be I just became allergic in my 40s. I’ve never been able to use Tampons because they’re uncomfortable for me. Now I use washable bamboo pads. There are also period panties on the market. If she wants to free bleed at home that’s her prerogative but it’s highly disrespectful to expect others to tolerate it in their homes. The level of entitlement some folk have is astounding to me. Period blood smells unpleasant and varies in pungency from woman to woman.  I’ve used puppy pads too when I’ve run out of my washable ones. There are so many alternatives she could use that can contain it without it irritating her.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Totally. I’m in the same boat. Even sitting on puppy pads are an option, not ideal but it sounds like the only option that won’t give OP a bad reaction while also respecting someone else’s home.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "OP read this whole comment thread and you will find at least 10 ways to be rash free and still not do free bleeding ..Women have been mensturating since the dawn of time but i dont think any woman bled freely after they came out of the caves(untill I guess now..)",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11972,
      "content": "YTA.  What in the hell did I just read?  You can’t just bleed all over someone’s house.",
      "id": 119,
      "comments": [
        {
          "score": 4299,
          "content": "Seriously - WTF\n\nI would not be OK “free bleeding” in my own home let alone a guest doing it.\n\nThere are so many other viable options other than the bio hazard OP decided to go with.\n\nOptions I can think of:\n- travel better prepared \n- leave\n- hand wash the few pads she did bring \n- have hubby go buy some period undies\n- make more pads out of the towels she brought\n\nOP you are the AH. You should feel bad.",
          "id": 120,
          "comments": [
            {
              "score": 1374,
              "content": "I’ve literally seen period panties at Target and Walmart. If you can’t go out due to pain, DoorDash yourself some supplies. \n\nFor future, look and see if an IUD or something might be an option. While free bleeding might work for you at home, what about work? Even then, why suffer if there are options?",
              "id": 121,
              "comments": [
                {
                  "score": 712,
                  "content": "They even said they went out and got disposable pads so why didn’t they just buy period panties or more disposable pads if they know that’s what works? I don’t understand their reasoning at all",
                  "id": 122,
                  "comments": [
                    {
                      "score": 652,
                      "content": "Disposable pads with a cotton cloth over them so there’s a barrier. Or two pair of underwear so the pad doesn’t touch their skin\n\nSo many options that don’t involve turning MILs house into a biohazard",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "Yeah, it sounds like OP was intentionally provokativ. If she really has such bad problems with pads she should 100% know that she could get period panties at any store and have gotten those instead...",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Target sells multiple brands of period underwear. Always even makes period underwear. And if push came to shove, OP could have bought depends.\n\nOP they do sell all cotton pads. My kid who is severely sensitive and easily breaks into rashes, uses all cotton pads and has never had an issue.\n\nOP free bleeding, in some one else's home, is so rude and disrespectful. It's completely unsanitary. Do you absolutely hate your MIL? I would have sent you home if you decided to free bleed through my home. This is just gross. You knew you were within the time frame of your period starting. You should have packed all the supplies you needed in case you did indeed start early. You are not a victim. Stop being a martyr. This is entirely on you. You could have been prepared. You chose not to bring your period supplies. And then you started early. Even tho you did not pack your supplies, you could have made a trip to the store to buy what you needed. If you were in too much pain to go, you could have used Instacart, Door Dash, or you could have ordered directly from Target or Walmart (Walmart does deliver). Or you could have sent your husband. Being in pain does not make you helpless. You had options. Instead you chose to be dirty and completely unsanitary. Your MIL has every right to be upset with you. You owe her new bedding, at the minimum.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Honestly, I find that those bladder leakage pads are much better than normal period pads if you have heavy periods.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "DIY period underwear for people who get rashes: wear two panties with a pad in between them",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Yes blood is definitely a bio hazard. Nauseating behaviour.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Another option is just using pure cotton instead of pads",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1203,
          "content": "I’d be so fucking embarrassed to carry a towel around someone’s house and bleed all over it and their furniture because I’m too lazy to take care of myself.\n\nLike just leaking by accident makes me want to melt into the floor and disappear lol.\n\nI know it happens and it’s natural, but an accident is one thing.  This is just disgusting and uncalled for - think of the smell.\n\nI have a sensitive nose so even when I’m bleeding if gotta keep the trash emptied daily because I can smell the used tampons.",
          "id": 130,
          "comments": [
            {
              "score": 52,
              "content": ">Like just leaking by accident makes me want to melt into the floor and disappear lol.\n\nThis is what gets me. I panic if I'm stuck somewhere and i MIGHT leak. I carry an arsenal of jic items, including a clean pair of panties,, when its that time of the month. I power bleed for the first 2-3 days. Like soak through a super plus in 2 hours or less. I think i would die if i bled so bad i got it on my in laws furniture or sheets. I feel dirty just reading this post. Op, YTA. And gross.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "YTA, Omg i hadn't even thought about the smell cus I was too caught up in thinking it was disgusting and disrespectful",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "[think of the smell ](https://youtu.be/yJYKpJ7ur9M)",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 276,
          "content": "OP is TA for leaving all this bait all over the subreddit",
          "id": 134,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "She absolutely wouldn’t be allowed back in my house after this visit.",
          "id": 135,
          "comments": [
            {
              "score": 13,
              "content": "Agree! And what is wrong with the husband for tolerating this disgusting behavior?",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I don't get how she is doing it . Like when u stand, it comes out bad, and if she has bad periods, as she says, it must be coming out a lot . So is she holding a towel to her while she walks around or just letting it go all over her legs and floor . How can she do that in front of people .",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6565,
      "content": "YTA-if you want to free bleed, that’s fine, just do it in your own home. It is disgusting to do it in someone else’s home. It is rude and inconsiderate of you.",
      "id": 138,
      "comments": [
        {
          "score": 1479,
          "content": "That part. I'm tired of people acting like periods aren't disgusting. Sure, it's something that happens to you that your body can't control but Jesus, do something to control the bleeding. I don't blame her mother-in-law, I'd be pissed too. She would never be allowed in my home again. Also, she's probably damaging her relationship with her husband because she's causing drama in his family.",
          "id": 139,
          "comments": [
            {
              "score": 1191,
              "content": "Of course it’s gross it’s blood. I mean nose bleeds happen to people but no one says they are a beautiful thing a person goes through. As a women I think girls should be brought up to know periods are natural and will happen and to not be ashamed of them but you need to be prepared and sanitary with them because as I said you wouldn’t just let a bloody nose drip everywhere neither should a period for their own health and others. Again periods are natural and shouldn’t be shamed but they are gross and you need to take precautions to be hygienic.",
              "id": 140,
              "comments": [
                {
                  "score": 429,
                  "content": "Totally agree! If I cut my finger and bleed at someone's house I'm not gonna just let it bleed all over. Periods are not shameful but blood (and all body fluids) are literal biohazards for a reason. I would not want someone free bleeding all over my house carrying around a bloody ass towel either! Is OP washing their hands every time they move this towel? (Probably not...)\n\nI also have a womb and very sensitive skin, the un-bleached un-scented disposable pads don't make me break out like others do. I know this might not be the case for everyone just my 2 cents. They don't have to be the expensive organic ones either, Walgreens has a store brand that I prefer.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Poop is also natural. Jizz, too. I don’t want either randomly around my house.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "That part. She keeps claiming that she's allergic. Now, I have had pads that irritated my skin but you switch to something else. Find something that works for you other than just bleeding everywhere. That is gross. I don't care what anyone says and I'm tired of the people who are saying that we're just shaming her for having a period.\n\n That's not it at all, we're saying control it. You can't just have one bad experience with a pad and go well I'm allergic, that's it. I won't be surprised if she's posting a few months later saying that her husband filed for divorce. She's causing drama in his family and most people don't take well to that.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 227,
                  "content": "I do think the MIL is overreacting about the washer but the rest I agree with. \n\nHell in a pinch use puppy pads instead of your blood towels on her furniture. Why not cut your blood towels into temporary pads until Amazon or something can deliver new cotton pads? Why for the love of god wouldn’t you just go home on day one of pack a month’s worth of pads just in case?",
                  "id": 144,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yeah, the only way OP isn’t the asshole is if the MIL refused to let her leave the house to buy more cloth pads, AND refused to let her wash her cloth pads AND refused to let her go home. \n\nBut if MIL refused to let her wash her pads then she’s a bit of an AH too. But if she’s washing her towels I cannot for the life of me work out why she can’t wash her pads??",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Yeah, a cleaning cycle with bleach or a half gallon of cleaning strength vinegar will sterilize the machine just fine",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "People think natural = beautiful and good.  \n\nBut then you go around shitting all over the place and everyone gets into a huff!",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "Menstruating is natural and shouldn’t be shamed. But blood is a biohazard. Whether if comes from a sliced knee, nose or vagina, it is disgusting. It stains, it’s unsanitary and just frankly yucky.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Nosebleeds do not smell nearly as foul as uterine lining.  There's that too.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Yeah I understand why free bleeding has been used as a political statement, but that’s where it should end. It’s not okay as a day to day thing. The whole point is that you shouldn’t be shamed for bleeding, not that you can share your blood with the world.\n\nI climb as a hobby and finger cuts are very common. No one, absolutely no one, will shame you if you cut yourself and accidentally get blood on the hold or wall. They will check you’re okay first and foremost. However, if you don’t treat and cover the cut to avoid getting anymore on the wall, yeah people are going to chuck their tape at you till you get a clue. Accidents are accidents but biohazards are biohazards.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I agree. This whole discussion reminds me of when my dog had her first season. She had little doggie panties but the house still looked like a crime scene. We limited her wandering and managed it, but I can't imagine free bleeding in someone else's house.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 10,
                      "content": "We used to put kids panties on our dog with a pad or panty liner on the inside when she would bleed. We cut a hole in the panties for her tail. Before we would take her for a walk, we would take off her undewear and put the pad in the thrash. When we got back from our walk we would put a clean pad in her undewear and put it back on. There are also special underwear things for periods for dogs but they are expensive and the kid underwear is cheap, fits better and is easier to wash.\n\nOur dog never free bled in our home and this was such an easy solution. She would ne comfortable in those panties and be allowed on the couch (on a blanket just to be safe) and we rarely had to clean up blood.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I'm a woman too and agree with your last sentence especially. We shouldn't be ashamed of when it's happening, but we need to be hygienic about how to handle them. I don't understand how any adult woman can go on a trip without bringing whatever hygienic products she needs in case her period begins not on the exact date it should. I'm lucky that I just need a few days worth of pads and then either me or someone else can go to the store to get me more, but this one who knows she needs very specific undies or fabric pads? They don't expire or take very much room and they're traveling by car so she could easily have a big make-up bag or a tiny suitcase full of them. If not the husband could do damage control and buy more thinx for her in the supermarket. Smh.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I have been mocked before by female friends for carrying round pads in my bag when it's not specifically my period time. I don't know what goes through their head that I can't carry some just in case of anything! People can get really funny about the whole process.\n\nMy favourite was someone mocked me then needed one later that day cause she'd come on early. If I was more spiteful I'd have said no.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 340,
              "content": "This.  This. This.  Periods are nothing to be shamed about.  Sanitary pads/tampons should be easily accessible to anyone.  But much in the same way that I don't show up to your house and take a massive poop on your living room couch, you shouldn't bleed all over mine.\n\nAccidents happen.  once you know you are on your period and continue to leave biological mess around the house it's a you problem.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 220,
              "content": "There are plenty of natural bodily functions that are gross. Boogers are gross, and it would be rude to leave used tissues around someone's house. Poop is gross, so we flush the toilet. While it's good that periods are no longer a completely taboo topic, being free to talk about it is very different from other people having to share your bloody experience with you. I may complain to my sister about my period, and even describe it, but I'm not going to go over to her house and bleed on her couch. That's nasty and extremely inconsiderate. OP is definitely YTA.",
              "id": 156,
              "comments": [
                {
                  "score": 16,
                  "content": "Post orgasm a dude just wandering about someone else’s home with jizz dripping and wiping on stuff 🤢",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I think that's her goal. This whole post is giving me energy vampire vibes. \n\nShe absolutely cannot use any forms of feminine hygiene products whatsoever? What exactly is she allergic to in pads? Is she actually allergic or \"allergic\"? Why can't she use tampons? Why can't she use diva cups? Why did she not bring enough cotton pads if she knew she was going to start her period around then? A couple of days later is still absolutely that time frame. Why isn't she using the period products she brought down?\n\nSome people just need to make others uncomfortable and feed off of their discomfort. They always have a million excuses of why they absolutely need to do whatever it is that is causing so much discomfort to other people. This really reads like that is what is happening here.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Lmao all the people defending her…all I’m imagining is that bloody towel and the smell it must create",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It’s like pooping. Completely natural and literally everyone needs to do it. But there are standard sets with sanitation and how to go about pooping. You don’t just wear adult diapers and shit while watching tv at someone else’s house on their couch.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Right? If you had a horrible nosebleed would you also just let it drip all over the place because its natural? Uh...no.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah. I mean specifically here there's a difference between treating the person like a pariah or with shame or banning them from entering a temple or whatever BS was in the old testament, and clothing or other articles soiled with bodily fluids.\n\ni.e People shit but you don't ban them from your house for that or make them feel bad because they shit and tell them it's because God is punishing them.\n\nBut equally you don't want used toilet paper being carried around your house and put on your furnishings or someone carrying a towel they use to mop up after them \"because I've got a touch of diarrhea and then a long list of excuses why they can't behave like a functioning adult. \"I'm allergic to this, I can't use a bathroom, we can't leave...the only option is to sit here and defecate on your sofa - \"but don't worry, I've got a towel and some air freshener\"\n\nThe whole idea, for grown ups, is dealing with your bodily fluids in a hygienic manner - not the least because these fluids are a vector for human pathogens. Our disgust reflex isn't triggered because 'patriarchy' or whatever. All that stuff dating back to the old testament is now flawed but it was basically bad hygiene advice. Now we have a better understanding - but that understanding isn't 'period blood is great, let's all spill it over the couch and bathe in it'",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Of course it’s disgusting. We all shit too, and that’s a natural function but we don’t wallow in it.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "THANK YOU! I hate that people say periods aren’t disgusting. I’m a woman who gets a period, and my own period blood grossed me out. I don’t care that it’s natural. Pooping is natural, it’s still gross.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Also, very curious: is OP not wearing anything from the waist down?",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5958,
      "content": "YTA.\n\nYou are carrying a bloody towel around at a family event. Free bleeding on furniture, sheets, etc and your only only response is to acknowledge that it isn't super sanitary but to continue to do it. On three days you had plenty of time (or your husband did) to explore local options for reusable pads, period underwear or other alternatives and haven't done it.\n\nThe walking around with a bloody towel would have been the end of it for me. It's attention seeking behavior as it not being properly prepared for your menses when you know you have unique needs during that time.",
      "id": 166,
      "comments": [
        {
          "score": 1759,
          "content": "This whole post is giving me energy vampire vibes.\n\nShe absolutely cannot use any forms of feminine hygiene products whatsoever? What exactly is she allergic to in pads? Is she actually allergic or \"allergic\"? Why can't she use tampons? Why can't she use diva cups? Why did she not bring enough cotton pads if she knew she was going to start her period around then? A couple of days later is still absolutely that time frame. Why isn't she using the period products she brought down?\n\nSome people just need to make others uncomfortable and feed off of their discomfort. They always have a million excuses of why they absolutely need to do whatever it is that is causing so much discomfort to other people. This really reads like that is what is happening here.",
          "id": 167,
          "comments": [
            {
              "score": 785,
              "content": "What’s absolutely insane to me as a period haver is not bringing enough supplies so close to when you were actually starting your period. I personally go for overkill every time. I went to prom and brought 10 tampons even though I wasn’t even on my period! The vice principal was checking bags and she looked at me like “wow you’re really prepared huh” because what really did it hurt to dedicate a few square centimeters to my preferred way of dealing with my period? I’m on a month trip right now and my periods are generally every 32 days, so by the math I’d only be bleeding once, but I brought enough for two periods because that’s just common sense. OP absolutely boggles my mind with the lack of forward thinking.",
              "id": 168,
              "comments": [
                {
                  "score": 320,
                  "content": "Or finding a store nearby that has cloth pad or period panties. Surely there must be some in the area. The bloody towel shouldn't be the go to.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Yeah the period towel could be the emergency while they wait for their husband to go get some supplies. Not a long term solution. I’m pre-med, so the idea of blood doesn’t disgust me, but it’s also unsanitary and therefore not something you can just leave around on furniture. MIL probably can’t disinfect her couch with bleach.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Like, there's gotta be an old T-shirt or something somewhere. This is where you get creative and do everything possible to AVOID BLEEDING ALL OVER SOMEONE'S HOME WTF",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I haven't had my period for over a year (blessed birth control), and I literally have period products EVERYWHERE. I have a stash of tampons in my bag, in my car, in my bathroom, etc, because in the incredibly unlikely scenario that I do get my period, I would like to be considerate to both the people and furniture around me and not bleed all over them.\n\nLike, everybody I know that has periods overpacks for any trip. Even if it's not due for another 20 days, we'll still pack enough for 10 days for a 5 day trip because it takes very, very little effort to do. I genuinely do not understand why just taking 1 minute to pack extra pads is somehow worse than risking bleeding everywhere in someone else's home. \n\nAlso, the AUDACITY? When I visit somebody else's house, I follow their house rules, not the ones I have in my own. It's basic decency.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "And in a last case resort, most GPs here in the UK (and I imagine you could do the same in the US) will give you norethisterone. It stops them within two days and lightens the two days you are still bleeding. Perfect for trips.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I keep an entire unopened package of my favorite pads in the storage compartment of my car with the spare tire.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "So much this!  When I was still having my period I *never* traveled without supplies just in case, it's just not an option! You have that dedicated pouch of supplies that is ALWAYS STOCKED. Heck I had supplies everywhere, at work, in the glove box of my car, in various bathrooms. I'm still discovering stuff squirreled away and I haven't had a cycle in 2 years.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I could have just finished my period and I always pack for a period \"just in case\". Even if I know it's not coming. Because what if by chance it does surprise me for some reason you never know! Lol",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 520,
              "content": "It’s giving me the same vibes as men who claim they just CAN’T POSSIBLY use condoms.",
              "id": 177,
              "comments": [
                {
                  "score": 30,
                  "content": "Nailed it",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 281,
              "content": "I get horrible rashes when I use pads, because of this, I explored other options. I switched to cloth pads and eventually switched to menstrual cups (one of the best decisions I've made in my life). I haven't bought a new menstrual product in 6 years. I freaking love my cups.\n\nOP could've tried period panties. A menstrual disc is also an option since she can't use a cup. Also, why isn't she washing and reusing her cloth pads????",
              "id": 179,
              "comments": [
                {
                  "score": 86,
                  "content": "Medical grade silicone cups are also hypoallergenic. Take a bunch of period panties for backup or overflow. This whole situation is absolutely unhinged.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I found that the products you can get from the big box stores caused me issues. Idk if it was some chemical mixed in or what, but it caused issues. I found organic products worked for me. I also used to use a cup, but when I do bleed during a period, it's  barely enough for a Jr lite tampon anymore. If I bleed like OP, I wouldn't even free bleed in my own home. That's  just a big nope.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "How do you handle cups at work? I’m at work for 8-10 hours a day. The bathrooms are public so dumping rinsing reinserting isn’t feasible due to time constraints and due to students using the same restroom. This has been a major reason I haven’t tried one. That and the fact that sex has informed me that I really don’t like anything in contact with my cervix.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I used a cup for over 25 years, there's so many things you can do. If you are in the \"must rinse\" camp you can get collapsible plastic cups with lids where you just remove your cup, dump the contents and put the dirty cup in the collapsible cup and then you can carry it to a sink and rinse and then go back to the stall. Or in cases where I couldn't rinse you can either use toilet paper to wipe out the cup (remove any stuck paper bits) or bring in wet paper towels to wipe it out with. Dispose of any paper towels the way you would a used pad or tampon by using the trashcan. Mostly I was trying to rinse it enough so that it wouldn't become a slippery projectile, and technically you don't HAVE to rinse it, just empty and reinsert. But I got pretty good at timing insertion and removal to minimize having to empty it at work, you become pretty familiar with your cycle after a while LOL!  \n\nCups are awesome and so freeing, I still have mine just in case it turns out Aunt Flo was on sabbatical rather than retired to Florida.  There are some great websites with resources out there these days like \"put a cup in it\" and \"period nirvana\" that I wish we had years ago!!  Good luck!",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "For me,  cups can last me about 15 hours on my heaviest days. In addition to the tips by the other poster, you could always get two cups. Partway through the day, empty it and put it in a container and add in a new one.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Oh, I've had 24h shifts at the hospital and I had no problem. If I'm on Day 1 & 2, I empty it every 6h. On day 3 &4, I empty it every 12 hours. Our employee bathrooms have a sink beside the toilet so it's easier. But when I was still in school, I just use the bidet to rinse my cup. The bidets we had were the shower nozzle ones, not the one attached inside the toilet. When I travel to places with no bidets, I just use my portable one. You could buy one online.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Same. I have a very heavy period and I'd probably fill a cup in 8 hours. I assume you'd get blood on your hand from removal and dumping since there'd be blood on the cup?  \n\nWalking out of a bathroom stall holding a bloody cup with a bloody hand just doesn't work for me. Lmaoooo \n\nThis is one of the main reasons I wish it was common for bathroom stalls to have their own sink.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Try menstrual disc! Google “menstrual disc auto-dumping” and be ready to have your mind blown. I switched to the disc this year and I haven’t looked back at all.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": ">What exactly is she allergic to in pads?\n\nNot defending OP at all but allergic reactions to the bleaching agents used in pads and tampons is not unusual.  \n\nHappily there are many alternative solutions available (diva cups, period pants, reusable pads etc). Unhappily, OP apparently lacks the most basic sense of hygiene, problem solving, and social awareness.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yup this 100%. The fact as well that she's got excuses for why medical treatments don't work as well but seemingly hasn't explored any of the alternative treatments is mind boggling. \n\nPretty convenient that the only thing that \"works\" is the most disgusting solution for everyone else and let's everyone know she's on her period.\n\nComplete attention seeker it feels like. I felt exhausted just reading the post.\n\nHow could you be an adult and behave like this???\n\nYTA OP.",
              "id": 189,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "tbf, disposable pads and tampons make me very uncomfortable and itchy, have done ever since my first pregnancy. I realised once i switched to cloth/cup that disposables had also been encouraging bouts of thrush. Allergic could just be a cover-all word to describe the horrible dryness and itchyness that results.\n\nShe is still YTA tho, most woman have mcgyvered some sort of pad to cover emergencies, and a cut up towel would have done the job for a few days.  \n\n\nMy MIL is a lovely woman but i got embarrassed enough by her washing my post partum pads while helping out after my csection, i couldn't imagine thinking free bleeding all over her house is ok, it's just nasty.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah, while I do understand the pad problem, since most of them are scented in a way and I personally find the feeling of the material kinda icky, and I also am apparently way too dumb to use a cup properly, there are definitely other options. The easiest way would be period underwear, but not the only one. It’s ok to free bleed in your own home, and I’m all for choosing the most comfortable way to get through your periods, but if someone else starts to free bleed in my home and carries a bloody towel around, I will show them the door. Sorry, not sorry.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Paper products and personal hygiene products are made of a variety of things that don't have to be listed on the label, including anti-bacterial and anti-fungal agents to keep the product from getting funky in storage/shipping. Some of these chemicals are natural, some are synthetic. There are others that help with odor control. Even many things that are \"unscented\" will contain something to mask the natural scents of the ingredients used.   You can get allergy patch testing to identify which ingredients you're allergic to, but since the companies aren't required to disclose what chemicals they use on their product, reading labels can be pretty useless. Some companies are really responsive to consumer inquiries and will take the time to tell you if something's safe for you (shout out to the Kleenex division of J&J) but others never reply. \n\nThe other issue you mentioned is with cups and tampons and the like. OP doesn't say so, but it sounds like she has endometriosis or adenomyosis -- periods aren't really supposed to be super painful (unless I'm mis-reading and the pain is from the sores that resulted from the disposable products).  In that case, anything you insert can make the cramping worse and should definitely be avoided. \n\nNot defending OP'a decisions here -- they are absolutely, egregiously unacceptable.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This is what I was thinking too. Really allergic or drama queen allergic?",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Your response is spot on. There is definitely a \"I aM sO sPeCiAl bc I can't use any of the normal products, I have no option but to free bleed no matter where I am. That makes me a victim of my periods, and periods are natural! Why are you looking at me like I have three heads?\" vibe about OP. \n\nAnd I am woman with painful periods. I would never think it's ok to free bleed in someone else's home and carry that blood-soaking towels around. It is also not about replacing the sheets etc. It's the way OP thinks that her behaviors are justified and ok as long as she buys some new sheets after the fact that is fucked up. She is also going to replace it *\"IF MIL wants\"* omg. Blood is biohazard material. You can't be so casual about it ESPECIALLY in someone else's home! \n\nHuge YTA, OP. Your behavior is disrespectful, entitled, and disgusting.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 219,
          "content": "She could have even order some online by now.",
          "id": 195,
          "comments": [
            {
              "score": 70,
              "content": "Right? You telling me there's absolutely nowhere that does next day delivery? If not on cotton pads, then on literally any other kind of cotton fabric you can cut up and McGuyver? \n\nWho among us has not as some point wrapped toilet paper around her knickers and hoped for the best?",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Yup. Surely when her period started early, and she realised she hadn’t brought enough cloth pads, she should have immediately went online to order some on rush?! In the few days it would have taken to arrive she could be constantly washing out her cloth pads?",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I just went to look that up because I was thinking the same thing and you can get them delivered same day with Amazon prime. If I were her and even if I didn’t already have a prime membership I think it would be worth signing up to avoid bleeding all over my MIL’s house",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Honestly though. I feel like OP is one of the people that made my ex certain he could smell when people were on their periods",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Goodness. I had no idea anyone would even contemplate free bleeding in public or at another persons home etc. Mind blown.\n\nCannot imagine how the other family members felt seeing this.",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4063,
      "content": "YTA. Let me start by saying that I do not believe that periods are something to be ashamed of or hidden. But your period should be treated like any other bodily fluid. You don't go around showing people the snot in your tissue after you blow your nose. You don't poop in the backyard so everyone can go look at it. You don't bleed all over your clothes and a towel, then carry them all over the house with you to keep bleeding on.\n\nI'm sensitive to the bleaching agents used to sterilise pads. I use cloth pads or period underwear. And because I know I can't just pop out and buy a packet of pads I take enough self care items with me any time I go away just in case. I take steps to ensure no one else has to deal with my issue. You didn't.",
      "id": 201,
      "comments": [
        {
          "score": 960,
          "content": "> And because I know I can't just pop out and buy a packet of pads I take enough self care items with me any time I go away just in case.\n\nI can't get over this. If I'm going on a trip and my period is due to start within a few days of me arriving home, of COURSE I bring supplies on the trip just in case. My cycle is pretty regular but there are still months when it's just not. It's for my own comfort and convenience, and I don't have any problems with easily accessible products. If you can't use what they sell at the closest convenience store, why wouldn't you better prepare?",
          "id": 202,
          "comments": [
            {
              "score": 350,
              "content": "My cycle is pretty regular, but even if I've literally just finished and I'm going away for 2 nights, you better believe I'm ready for a spontaneous bleed.",
              "id": 203,
              "comments": [
                {
                  "score": 277,
                  "content": "Same. Because if there is anything guaranteed to start a period, it is being on vacation with no supplies.",
                  "id": 204,
                  "comments": [
                    {
                      "score": 36,
                      "content": "My life has led me to believe that every uterus has a desire sensor in it. The more you really don't want to have your period, the more likely it is to show up. I've had so many vacations ruined by a 10 day early period showing up to send me to cramp hell for no fucking reason other than to make me suffer lol",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This is one of the truest statements I’ve ever heard on Reddit. Every. Single. Time. I would go on vacation or an overnight trip, I’d get my damn period. Whether it was supposed to come or not. Happened on a 3-day trip to New Orleans (after I had had my period two weeks earlier). My honeymoon. A trip to Ireland, after my period ENDED THE DAY BEFORE WE LEFT. It just got to the point that I always assumed I was going to get my period whether it was due to arrive or not, and 9 times out of 10 it did. 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️ But bottom line, being prepared for a period sneak attack was something I learned veryveryvery quickly. As in, when I first got my period at the age of 10 (yeah, that was loads of fun).\n\nWho are these grown ass adults who don’t bother packing supplies for their periods, especially when they KNEW they were going to get their period on a trip? This absolutely boggles my mind.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 163,
                  "content": "Same. I got caught out in Iceland once. Do you know the Icelandic words for pads or tampons? I sure didn't. And while the 17 yo boy at the supermarket was fluent in English, those were words he didn't know - and having to creatively convey what I needed left us both bright red.\n\nNever again. Now I bring pads *everywhere*.",
                  "id": 207,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I just got flashbacks to being in a Spanish speaking country and gesturing to my crotch in a bus stop ladies bathroom trying to figure out the word for tampon so I could get through the trip",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Omg that’s hilarious. I would watch that teen drama show 💯",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "Mine was NEVER regular so I always brought supplied.\n\nI can't get over free bleeding being a thing.  So damn disgusting",
                  "id": 210,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "When I was on birth control and could almost count to the hour when I'd start, I *still* carried products with me. Even if I don't end up needing them on a trip, someone else might and deplete my carry stash.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I haven't had my period in over a year (birth control), and I still always pack twice the amount of period products that I'd need for a trip just in case. It takes a few minutes max to do it, and it means I don't ever have to worry about... whatever this woman is doing, lol",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Ah yes, your uterus pulling the old \"you thought we were finished? Surprise!\" Been there :-(",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "I am 45. My periods were all over the place for the first 10 years or so. Want to know what I learned? BE PREPARED! I always carry 2 pads, 6 regular tampons, and 6 super plus tampons in my work bag. It became an inside joke at my last office that if you were unprepared, go see Jaded she could spot ya. \n\nIf I am going on vacation, I used to take a full package of each. I am super picky about the products I use, so better safe than sorry.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "When I was menstruating, I kept a large stash of products in my overnight bag and suitcase.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "I just did a quick Amazon search for period underwear. There is at least 1 option that will arrive today and several that will arrive Monday (tomorrow). There are exactly 0 reasons that OP could not have obtained a solution in the last couple of days.",
          "id": 216,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 92,
          "content": "This is the truth. I can’t use disposable products either (the last time I used a tampon I got WELTS inside my vagina like…fucking awful) so I use a cup. Even when I’m literally in the middle of my cycle and only going away overnight, I keep a cup with me in my bag (and the little sterilising case) and I have a spare in my car.  It’s not hard to be prepared even when you can’t just nip to the shops to pick up pads.",
          "id": 217,
          "comments": [
            {
              "score": 32,
              "content": "Exactly. Even though I'm pretty regular I live my life as if my period might start at any moment. I *always* have something at hand.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Most major chain grocery stores sell 100% organic unbleached cotton pads now in their natural products section. Surely if cotton reusable pads and period panties work, those would be an option as well? Even Walmart sells period panties now.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "[removed]",
          "id": 220,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Like I don’t get why ppl don’t realize there are other options like you have mentioned here with cloth pads. My mom told me when she was young she and her sister had to make their own pads with old clothes.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Damn. This makes sense as to why no one wanted to come marvel at my outdoor poop garden when I invited them over last week.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "To be honest, all bodily excretions are unsavoury at best, unhygienic in the majority. Except tears I guess?\n\nBut even wiping your tears on random furniture would be a deeply weird thing to do.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It is like blowing your nose on the tablecloth. “I’ll replace it!” Like… just don’t do that…",
          "id": 224,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2013,
      "content": "Yes, you're in the wrong. You do not knowingly risk getting bodily fluids on someone elses furniture. YTA. Stay home with that bullshit.",
      "id": 225,
      "comments": [
        {
          "score": 580,
          "content": "\"we only have 1 car\"\nHUSBAND TIME TO DRIVE HER HOME AND COME BACK YOURSELF.\nWtf?? How is it a better idea to bleed all over someone else's house???",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 120,
          "content": "Blood is a biohazard, it's absolutely vile and I would never have her over again tbh",
          "id": 227,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1281,
      "content": "Soft YTA. Sure, if this is how you want to do it,  I get it. Yes, your health matters, no one is saying otherwise. \n\nHowever, \"it's not super sanitary\" - correct, blood is a biohazard. And it's totally reasonable for another person to not be OK this happening in their home. You got lucky nothing stained and such but it's not OK to be willing to permanently damage someone else's belongings. And, not everyone is as comfortable with blood (even people who have periods). \n\n(If you haven't tried period underwear, I HIGHLY recommend it. Game changer. more comfortable, everything. Knix is a terrific brand.)",
      "id": 228,
      "comments": [
        {
          "score": 373,
          "content": "I hope OP is willing to buy a new mattress cover and potentially a new mattress in addition to the sheets.\n\nFrankly if someone had the notion that their comfort came before my possessions to the degree that they felt just fine about ruining them instead of taking reasonable precautions, they wouldn't be allowed into my home.\n\nCarrying around a bloody towel and contaminating the washing machine with blood, a biohazardous bodily fluid is worse than peeing in your water glass at night because you don't want to get up to go to the bathroom.",
          "id": 229,
          "comments": [
            {
              "score": 382,
              "content": "Carrying around a bloody towel is pretty gross, but contaminating the washing machine? If you get a nosebleed or your kid scrapes his knee, or you cut yourself while cooking.... and blood gets on those clothes, do you just throw them out? Is that not what a washing machine is for? Sure, rinse it out and use a pre treater so it doesn't stain, but then you toss them in the wash.",
              "id": 230,
              "comments": [
                {
                  "score": 248,
                  "content": "Doesn't period underwear go in the washing machine?",
                  "id": 231,
                  "comments": [
                    {
                      "score": 112,
                      "content": "Yup. As do cloth nappies, and cloth pads. Anyone kicking up a stink about that particular detail of the story is being ridiculous (as is the MIL on that particular detail) - washing machines are literally designed to wash things, including heavily soiled items. As long as they're being washed appropriately it's fine, and washing machines should have a tub clean (either a hot wash or with diluted bleach) once a month. A \"professional clean\" is totally over the top. The sheets can also be cleaned and sanitized in the machine too (contrary to popular belief, blood absolutely can be washed out in a warm/hot wash with good detergent, and booster if needed).\n\nBut, everything else is pretty gross. Accidents happen, but this wasn't that. MIL might be being ridiculous about the washing machine, but she has every right to be utterly livid about the rest given that it's 100% intentional on OP's part.",
                      "id": 232,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Yes. It does",
                      "id": 233,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "Agree. Having to get the washing machine “professionally cleaned” is being a bit over dramatic IMO. Most washing machines will have a tub clean cycle. Surely using that after they leave with a bit of bleach should be enough to sanitize the washing machine.",
                  "id": 234,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I'd say it's probably due to the volume of blood. I'd guess OP is putting towels/clothing SOAKED in blood in the washing machine. My mom always taught me to soak anything I bled on with hydrogen peroxide and rinse in cold water before putting it in the washing machine, so I may be biased, but I can't imagine just tossing something covered in blood in the machine is the best.",
                  "id": 235,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah, I use reusable pads and I rinse them out till the water runs clear before I put them in the wash. Then disinfect the sink. It OP is just yeeting the towels in the washer that’s so so gross. No wonder MIL is pissed off.",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1154,
      "content": "YTA.\n\n\nWow. Get a cup, SOMETHING. Ten entitlement to think you  an MENSTRUATE ON SOMEONES FURNITURE ON PURPOSE and somehow not be TA is kinda… amazing.\n\nYTA",
      "id": 237,
      "comments": [
        {
          "score": 111,
          "content": "Mobility issues aren't an excuse either, can't the husband help if it's an absolute emergency?? This is wild",
          "id": 238,
          "comments": [
            {
              "score": 26,
              "content": "I usually would never say something like this but given the rest of OPs story and explanations, idk how much I’m buying “mobility issues”. If it’s anything like how she ended up carrying a literal bloody towel around her MILs house with no other attempt to try anything else, it makes me wonder what kind of “mobility issues” we’re really talking about here. And that’s not even to say a cup is the only option!",
              "id": 239,
              "comments": [
                {
                  "score": 13,
                  "content": "She's marking the MIL's house like a puppy! Lol",
                  "id": 240,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 947,
      "content": "YTA.\n\nPeriod panties are a thing! Buy them! I have endo and VERY bad, debilitating periods. Period panties completely changed the game for me and they’re also super cute!\n\nEDIT: If you can handle regular underwear, you can most likely handle period panties. There are tons of options and materials too.",
      "id": 241,
      "comments": [
        {
          "score": 30,
          "content": "Also, if they are super bad, you can get medication. It’s easier for me in the UK because I have the NHS so it is free, but here are your options:\n\n1. The pill or another contraceptive. \n2. Tranexamic acid. \n3. Norethisterone\n\nI’ve also been given the minipill and normal pill to take together to control it.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yeah, there are shorts and leggings versions from at least one brand.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}