{
  "post content": "I've seen a lot of narc mom validation posts on here...and I hope this isn't one.\n\nI had my twins when I was 17. I dropped out of school and moved in with a friend who was helping me support them-no rent. I got a job, earned my GED, and over the next few years I started college and got another job to pay for it. For most of their early childhood, I worked two or three jobs and took classes at a community college. Some bad events took place at my friend's house and I was forced to move into an apartment. Good news? A classmate with a boy my girls' age was looking for a place, so we became roommates and kinda co-parents. Worked great, we lived together until I was almost out of uni.\n\nStill working two jobs, I usually had night and early morning shifts and she had day shifts. Someone was always with the kids, and when she started working more we got a babysitter. At this point we were still very poor-we wore bras and underwear with holes in them because we didn't have money for new ones. She got engaged, moved in with the guy, and I was forced to find a cheaper apartment I could make on my own. I graduated, got work as a bookkeeper in a legal office, and started earning enough to confidently stay afloat and afford a reliable babysitter. We stayed in the apartment until my kids had moved out and I saved enough to move to a house in a small town (years later).\n\nNow, my girls are posting mean spirited comments on FB and complementing each other. One will post something about 'I didn't know how poor I was until I realized how big a yard can be' and the other one will say 'I always knew, other kids with competent mothers had huge backyards and we had an apartment'. Complaining about yards, being 'raised by babysitters', always moving...I got sick of it. I replied on one of their posts saying they always had a safe home with food and at least one adult around to protect them which is more than other children and they shouldn't be whining like this when they were competently cared for. My daughter deleted it, and some friends have pointed out that growing up poor still isn't easy and they were likely bullied and felt some uncertainty for the future. I've been told a good mother would let them vent now so they can come to terms with their past. While I see the reason, I also feel calling me incompetent as a mother is mean and uncalled for.\n\nEdit: I should have put this in long before now, but the \"bad events\" at my friend's place had nothing to do with my kids. My friend's parents had serious health and financial problems and could no longer house me for free. The rent they needed to supplement lost income was too high, so I had to leave so they could rent to someone else.\n\nAlso, thanks to everyone who left advice. I was expecting a lot of YTA, but I was surprised by the direction they're taking. It's opening my eyes to this, and I know I have to actually talk to my children about this. I'll try and handle it better than I have so far.\n\nAITA for replying at all?",
  "id": 1,
  "comments": [
    {
      "score": 3188,
      "content": "NAH I understand why the comments hurt you but they also have a right to feel however they do about their childhood. The competent mom comment is harsh but I think you also know it was true. You were a teen when you got pregnant. No teen mom is competent. The consequence of getting pregnant young is things like this. Mistakes were made, the kids did pay for them. I'm not trying to be too harsh with you, you did your best, but being a teen mom had it's ramifications even beyond being poor. I can understand feeling neglected because much of your time growing up was spent with a sitter.",
      "id": 2,
      "comments": [
        {
          "score": 2033,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 1050,
              "content": "This. My parents went through bankruptcy; We walked 3 miles from school when they moved us to Maine, blah blah. They would have been perfectly within their rights to take offense if I complained about them on Facebook because all things considered, they were great parents. They didn’t have a yard? Boo hoo. Try living near a crack den.\n\nEdit: NTA.",
              "id": 4,
              "comments": [
                {
                  "score": 493,
                  "content": "The backyard comment is what made me kinda laugh too - we didn't have a backyard either but we had fun at the parks.\n\nWhat's ultimately important is that you're in a safe house, fed and clothed while growing up.\n\nThe fact that they talk about a backyard shows me that it couldn't have been that bad - if their childhood was bad I'm sure they'd have more complaints than that no?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 210,
                      "content": "Honestly, shit like this makes me wish people would work with Foster kids. \n\n Not trying to gatekeep, but if moving a lot and having no yard is their biggest problem in their childhood then maybe they need some perspective? \n\nIts good to acknowledge some things that they could improve upon if they want kids, but don't wallow in self-pity over little things that can't be changed or really couldn't be helped.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 111,
                      "content": "We had a back yard but we also had a raging alcoholic and an enabling mother. Broke but loving single mom sounds pretty good.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 45,
                      "content": "Yeah the \"I didn't know how poor I was until [comparing myself to those better off than me]\". Not knowing how poor you are is usually a good thing for kids. As is not knowing how rich you are (in certain ways). If you don't know how rich/poor you are due to being too in your bubble that isn't great. But if you're in public school, for example, and your friends with other kids and don't notice what you lack or what they lack, that's a great thing. Kids being kids and having fun.\n\nSaying you saw someone had a big yard just comes off as entitled jealousy to me. OP has her faults, in sure, but if they didn't know how poor they were until they were grown, then she did okay.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Plenty of kids with backyards had absent or abusive parents. It's fine to comment about growing up poor, but acting like they had a terrible mom BECAUSE of the backyard thing is weird and over the line.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Not really no. I was abused by my parents but when I complain about them, I don't always go STRAIGHT to the \"one of my earliest memories is my mother going into such a rage with me that she picked me up and hurled me across a room\" or \"I was pushed out of a moving car for being a little slow getting ready for school\" or \"my father secretly fed me food that broke my medically necessary diet, lied about it to try to prove I liked it after the doctor said otherwise, and then accused me of faking when I got very sick\" because that's a bit heavy for normal conversation, yknow? Like that's a bit too dark to be bringing up all the time? Sometimes I complain about having to wake up early on a Saturday to do the laundry, and I hate when people assume \"oh if that's all you have to complain about, it can't have been that bad\". It's not all I have to complain about, I've got more, but do we have to get into all that every time...?\n\nEdit: of course not saying this mum was anywhere near like that, just saying it's not a valid argument to hear one complaint and assume it is the worst one.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It also makes no sense, You go tell the people living in downtown penthouses that they are actually poor",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "Exactly!  My BFF was the sole caretaker for her dying mother since she was 10. Her mom died 8 years later, they had no support but for an old grandma who died before them mom did, I think the girls should reconsider what they're talking about. Sure everyone has a right to feel a certain way, but to shame their mom like this publicly is uncalled for and mean.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "The point still stands though, they have the right to feel upset, just because you didn’t feel upset at growing up a certain way doesn’t mean they shouldn’t or can’t. \nI find it interesting though because usually when kids grow up poor but they grow up in a loving family, they’re actually closer to their family and tend to help them out more. These kids moved out the second they could and complained about their situation which makes me believe OP isn’t sharing the whole story.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Nobody is saying they don't have 'the right' to feel whatever, what we're saying is that their feelings are ridiculous and unjustified. Just because you feel something doesn't mean that your feelings are valid.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "It’s how they chose to express that. Venting to friends or one another, a counselor or therapist, family and so on is one thing. Publicly doing it on fb is pretty shitty.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 169,
                      "content": "She wasn’t neglecting them; they maybe didn’t have the Leave It To Beaver experience but they had someone to look after them, and they had a pretty decent setup for someone raised poor. It’s fine to joke about being poor but don’t diss your mother who clearly busted her ass to provide for you.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "As far as I understand they are not complaining they were born....  fb is not really place to do this.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 169,
              "content": "Yeah... I mean sometimes my mum would take us to work and have us just sit in her office or in the car because she couldn’t afford care and my dad was useless.... sure it’s not fun but what was she gonna do?\n\nthese kids should be old enough to realise it was a sacrifice for their benefit from someone trying their best and if they must feel some type of way about it, do it off Facebook?? Unless the situation was unsafe/unstable apart from money issues",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "Yeah wtf? There is no excuse for posting on Facebook that your mother was incompetent and basically giggling about it with you sibling for all to see. That’s fucked up. They sound like a couple little ungrateful shits. Their mom was in a tough situation and worked really hard to get to where she is now.  Good children would realize that and be thankful for their hardworking single mother, not blast them online.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Fuckin A right. Shit happens, you can be salty about growing up poor, but publicly shitting on the mom that raised you in a safe environment and made sure you were clothed and fed is supremely shitty.   \n\n\nNTA",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": ">mom that raised you in a safe environment and made sure you were clothed and fed is supremely shitty.   \n\nYou mean the bare minimum every parent is supposed to provide? OP is YTA.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Yeah fuck that. I grew up in an apartment, I love apartments, I couldn't give a shit about a yard and have bought a perfectly nice townhouse without one and have never had one or felt the need even though I can afford it. \n\nI've had serious issues with my mother - ones that got ugly and caused rifts between families and persisted since childhood and whatever but no fucking way would I ever publicise that shit on FB. That said, I won't call them assholes for feeling underwhelmed with their upbringing - god knows they aren't alone, but why a social media site where presumably their dirty laundry is being aired to all their friends and family? And if their FB is full of randos like most people's are, then it's especially inappropriate.\n\nI don't think you can control how they feel overall about their childhood regardless of your attempts to provide. I apologise for how that might make you feel, but you have no control over that and they will probably never truly understand the hardships you went through to bring them up as best you could under the circumstances. That's not unusual and I don't blame them if they found it lacking, lots of people do due to various circumstances. People can feel however they want and discuss it with whoever they want. The problem is the scattershot FB venting and the lack of consideration for your feelings when it's broadcast to a bunch of whoever.\n\nThe yard isn't the problem and the meme isn't the problem either. Relatable memes are a big part of FB. If it was just the yard thing without the personal commentary then there's not a whole lot to be upset about, memes are relatable for a reason. But the competent mother comment took it from NAH to NTA for me.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My mom was straight up abusive and I still at least choose an anonymous platform to vent about it.",
              "id": 24,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Exactly. I feel like people have two choices (if they want to be decent human beings): a) don't talk shit online about a person if you've chosen to continue to have a relationship with them and instead vent in private or to a therapist, or b) cut ties and talk as much shit as you want. \nShaming their mother while keeping her as a FB friend is incredibly immature and cruel. They can have their feelings without being dicks about it.\nAbsolutely NTA.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly, so why is that the top comment? This sub can be so annoying.",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Doesn't matter mother or not. Not everyone has a great and loving mother. All we know is what OP told us. There could be A LOT more to the story.",
              "id": 28,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 414,
          "content": "Shit, my parents were teen parents. My mom worked years as a teacher's aide and when I went to school we had one car so we had to stay late everyday. Since she always stayed late she was always running around getting things done meaning I was often alone for 3+ hours after school. Sometimes I would get sad, lonely, or scared because she was gone so long that I would go to the front office asking if they knew where she was and they'd use the intercom to call her.\n\nNot only that but because she was a teen parent a lot of the other teachers judged her so I was never allowed to play with the other teachers with kids, who were my age, after school. The one time I did the teacher apperantly talked smack about my mom and me so my mom never let me go over anymore.\n\nI rarely got new underwear. Usually waiting until they all had holes in them. And I rarely got new clothes. There's some skirts I got in 1st grade that went to my knees, that I still had in fifth grade that went to mid thigh because they were the only skirts I owned. I'd get two pairs of pants a year. Less if I didn't outgrow the ones from the previous year. \n\nI actually was bullied. \n\nHowever I would *never* call my mom or dad incompetent. Nor would I say mean jokes about my childhood sucking and then blame my parents for \"not doing enough\" even though I knew they did the best they could. \n\nNTA op, your kids kind of suck. Especially for posting on a sight where you're friends with them ffs. What did they expect you to do?",
          "id": 29,
          "comments": [
            {
              "score": 91,
              "content": "This sounds like you’re preaching to me I mean clearly you are so to be quite plain my mom was literally OPs age when she had me. I know what it’s like to have a single teen mom, I had one. \n\nAnd I wouldn’t make these comments either but just because this is not how you deal with the stress or neglect in your childhood doesn’t mean that they cannot? I’m not going to dictate how these young girls process their childhood. Is it mean to vent this way? Sure. But they get to feel how they want.",
              "id": 30,
              "comments": [
                {
                  "score": 97,
                  "content": "I'm not saying that they don't get to feel how they feel. But as someone else said, if they were in their teens then they're lashing out and it's more or less ok, but if they're in their 20's then they're just entitled brats who are blaming OP. (OP says they're in their 20's) \n\nIf they really cared about not being poor then they could have gotten jobs as soon as they were able to to help contribute to the household, or even to buy the luxuries they wanted. (Unless OP wanted them to focus just on school, my parents were like that and refused to let me get a job so I could focus on grades to get scholarships) \n\nAlso if their childhood really was that bad then they should be in therapy. Not putting their mom on blast on a sight where she can see what they're saying. \n\nMy mom was also the same age as OP when she had me too.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": ">I’m not going to dictate how these young girls process their childhood. Is it mean to vent this way? Sure. But they get to feel how they want.\n\nThis isn't a healthy way of processing, it though. Of course they should be talking it through, but with mature people who can help them process it. Blasting it on facebook is not helping them deal with it, IMO. If anything, it might cause the wounds to fester.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "They get to feel how they want, but they can find a more appropriate way to express it.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah, you don't really control how you feel. But no one gets a free pass on how they act on those feelings.\n\nNTA",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "How about not drag kids into your shitty situation. If you are that poor, you shouldn’t be having kids. It’s incredibly selfish and not deserving of any respect.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "I have a lot of problems with this response.\n\nFirst, I assume that it's difficult to be a teen mother but I cannot agree that no teen mothers are competent. Throughout the ages women from all parts of the globe have given birth in their teens and some of those mothers have been and will be competent. And I'm giving major Kudos to OP because it sounds like she simultaneously fed and clothed her kids while fighting to achieve a better life. I consider that competent. Does that make her mother of the year? For those who grew up with dead beat parents this woman probably sounds like a star.\n\nSecond, it is estimated that [43% of children](http://www.nccp.org/topics/childpoverty.html) live in low-income families. Being poor doesn't make her kids special and complaining about it on FB to their tone deaf friends make them seem extremely ungrateful for the sacrifices their mother made to get them to their current lifestyle.\n\nThird, and this is a note for the OP, you've raised ungrateful kids and you're going to have to deal with it. If I were you I'd consider blocking them on FB and other SM until they get themselves together. And take faith  that they too will fall short in life and at some point look back and value your sacrifice.",
          "id": 36,
          "comments": [
            {
              "score": 21,
              "content": "Hey it’s tone deaf, not tone death! Don’t mean to be on my high horse about it, just thought you’d wanna know hahaha we all have things we heard wrong and stuck with.\n\nAnyways I fully agree with your comment. The daughters are kinda shitty, especially to be doing that on FB of all places. NTA.",
              "id": 37,
              "comments": [
                {
                  "score": 2,
                  "content": "Thanks. I'll adjust accordingly.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 149,
          "content": ">other kids with competent mothers had huge backyards and we had an apartment\n\nThat comment was bratty. I don’t think that criticism was called for at all, and it makes me wonder how much of their other complaints were actually about the hard realities of being poor or if they just wished they were rich",
          "id": 39,
          "comments": [
            {
              "score": 67,
              "content": "Kids who complain of “no back yard” should chat with the millions and millions of children who have been raised in New York City and turn out...JUST FINE. When you don’t have a yard, you walk to a park!",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "We dont actually know if they said that, do we?",
              "id": 41,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "OP mentioned they were complaining about not having a yard not that their mom was too young to have them. They're selling out their mom for attention and pity. You think every kid who grew up in an apartment deserve to publicly trash talk their parents for not giving them a fucking yard?",
          "id": 42,
          "comments": [
            {
              "score": 27,
              "content": "My kids are growing up in an apartment because housing costs in our area are absolutely insane. I hope to get them a yard sometime but right now at least they have a large apartment and two big parks within a short walk.",
              "id": 43,
              "comments": [
                {
                  "score": 30,
                  "content": "The park is just fine! Don’t feel guilty. I just had the same conversation with my brother who had to move into an apartment after a bad divorce. Feels his kids “deserve a yard.” Millions and millions of children raised in New York City co-ops, apartments and condos - from poor to multi millionaires - all had no back yards and all go to the parks for playground and fresh air. \n\nI raised a child in a high rise condo, and now as a college student my kid still goes for walks in the park every day, volunteers with the non-profit clean up crew and nature conservancy, and loves nature and fresh air. Can identity the birds and the fish in the park’s river, and chats with the elderly who come to volunteer. I have no concerns over not providing a yard!",
                  "id": 44,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That's awesome! Yeah we are outside all the time, and my parents have a large yard for when we want to set up a sprinkler etc.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If you live in a metropolitan area most people are living in apartments. Only the very rich have homes where I live.  If you have to commute an hour away you might have a backyard but it would take more time for you to be  with your kids. That's all kids really care about is being with their parents.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "This insane, the kids are entitled shits. Lots of people are poor and it has nothing to with competence or being a teen mom or anything else.",
          "id": 47,
          "comments": [
            {
              "score": 4,
              "content": "It's seen as irresponsible to decide to have children if you haven't got sufficient means to raise them, though \"sufficient\" is debatable I suppose.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I would not even say they were poor. The mom ended up getting an average middle class job. She was a single parent so they were left with a baby sitter.",
              "id": 49,
              "comments": [
                {
                  "score": 2,
                  "content": "Correct me if I'm wrong bu a single middle class job in america is fairly poor between 3 people is it not?",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "People are poor because dumb people have sex in bad situations. If the parents were more responsible, kids wouldn’t be forced to deal with their parents bad choices.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 53,
          "content": "Excuse the fuck out of me I had a couple of kids in my teens and I will have to disagree with you that teen mothers can’t be competent.",
          "id": 52,
          "comments": [
            {
              "score": 36,
              "content": "Exactly, it's a fucking sweeping generalisation. Plenty of parents are less than competent, no matter their age, it's not just something that affects teenagers. \n\nBesides which, parenting is a learning curve and you'd struggle to find any parent who never makes a mistake, I think that whenever a younger mother makes one it gets blamed on her age (with the snide insinuation that she was irresponsible for having kids so young), when it could happen to anyone. Plenty of teen mums do a great job in difficult circumstances so to say they're all incompetent is bang out of order.",
              "id": 53,
              "comments": [
                {
                  "score": 10,
                  "content": "I totally agree with you. I know women that I went to school with who just now are having children (we are in our 30’s now) who are shit parents (unstable, heavy drinking around the children). I had my first kid at 17 and while I made mistakes like every parent does, being a mom changed my life and 14 years later I still live my life for my kids. They have never wanted or hurt for anything. They definitely had WAY more than I ever did at their ages. \n\nThank you for saying something because it’s not right that people get passes because they are out of their teens when they get pregnant more often than not, the same damn way us teen mothers did, on accident. I don’t regret my children at all.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Don’t take offense, I think it’s pretty objectively true to say that yes some teen moms may be competent, BUT those same moms are always going to be more competent 5-10 years later than they were as teens. And most teens frankly aren’t mature enough to handle a kid at all.",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 51,
          "content": "I’m also curious about the “bad events” that took place at the first place they were living at and if the events affected the children in any way. Seems like they might have some unresolved trauma and don’t know how to cope.",
          "id": 56,
          "comments": [
            {
              "score": 21,
              "content": "I think this is really important. OP says they grew up in a safe environment, but this comment seems to imply different.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I’d say NTA. The kids do have a prerogative to feel however they want about their childhood but it’s a pretty asshole move to diss their mom publicly on Facebook for being “incompetent” when I’m sure they know she was doing the best she possibly could under the circumstances. It’s one thing to be sour about growing up poor, but I think it’s pretty immature and cold to blame it on their mom for lack of trying. If that’s really how they feel then I agree with other commenters that maybe they should try therapy, or even just having a conversation with their mom if they really don’t know WHY they were left at home with a babysitter all the time. I personally just don’t think Facebook is the place to vent about or process something so personal for all of them.",
          "id": 58,
          "comments": [
            {
              "score": 1,
              "content": "The mother brought them into those circumstances. I fail to see how their mothers poor choices are worthy of respect just because it was hard to deal with the consequence.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I think you are making a rather generalised comment there about no teen mum being competent. I was a teen mum and I have been a very competent mother. My daughter has always had what she needs and has always had my time and love. Some teen parents aren't competent but not all!",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1115,
      "content": "I'd probably go with NAH.\n\nYou seem to have tried your best based on what info you've given and, while this lifestyle may have been tough for them, they aren't reacting very graciously. The only thing that maybe should've been done differently on your end is that maybe instead of commenting on social media in a public way, maybe you should've just talked with them directly.",
      "id": 61,
      "comments": [
        {
          "score": 506,
          "content": "I agree. I think a reply on a public post was acting rashly at this point, and I'm not upset they deleted it. I'm hurt they made the post, but I should know better than to comment when I'm emotional.",
          "id": 62,
          "comments": [
            {
              "score": 118,
              "content": "Everyone makes mistakes in times of emotional instability. So I don't think that's a big deal. But an offline conversation is definitely needed.  Best of luck! Hope you're all able to see eye to eye",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "To be fair, if they're so upset by their deficient childhood and incompetent mother, there are therapists for that. Facebook is absolutely the wrong place.\n\nMy mother had me at 27, with her second husband, after cheating with him on her first. She then abandoned me in a foreign country with her third husband to run off with a boyfriend. Bad decisions are not the exclusive domain of teenagers. Do I blast that shit on facebook for everyone who knows her to see? No.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "[deleted]",
              "id": 65,
              "comments": [
                {
                  "score": 19,
                  "content": ">brings kids into the world at 17\n\n>struggle to survive and provide because OP brought kids into the world at 17\n\n>both kids feel bitterness towards their childhood and OP\n\n>one even calls OP an \"incompetent mother\" in a public setting\n\nYes, OP sounds like the best mother ever. \n\nShitty analogy time:\nIf I shoot myself in the foot before a big race and then I limp and crawl my way across the finish line are you going to be proud of me for overcoming hardship? Then someone points out online that I really shouldn't have shot myself in the foot in the first place and how it has negatively affected their growth as a person that I shot myself in the foot and I see all this truth about me and it hurts. So I respond, publicly, that I made it across the finish line so who cares if I shot myself in the foot and negatively affected your growth as a person, don't be ungrateful. Then I'm going to tell only my side of the story and have strangers on the internet call me a fantastic mom despite the evidence pointing to the contrary.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 21,
                      "content": "You forgot all the other people online who also shot themselves in the foot yelling about how not everyone who shoots themselves gets a bullet wound.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She sacrificed shit. She chose to have kids in a bad situation. They didn’t ask for it. They certainly are under no obligation to be grateful for it.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "[deleted]",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Give them some time, 17 year olds are in a weird stage of life where they see how great it can be, but they don't see the realities of what it takes to get there and how hard it is to achieve that massive suburbia yard.  \n\n&#x200B;\n\nYou put yourself into a shit position by becoming a teen mom, but you did your best.  Your kids will see that when they are faced with their first big bills or tough life choices.  Every young adult goes through an unrealistic phase where the biggest worst person is their parent, but in most cases that resolves with time or never happens.  Continue to be there for them and love, protect and guide them and I promise they will come back to being your little girls.",
              "id": 70,
              "comments": [
                {
                  "score": 4,
                  "content": "The daughters are in their 20s. OP was 17 when the twins were born.",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Why should they be gracious for being forced to deal with tough situations due to their parents poor choices? They didn’t ask to be born to a financially unstable mother. The mother chose to have them in bad circumstances.",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 870,
      "content": "A 17 year old having twins??? Do they not realize how lucky they were not too be dropped into the system? You were a competent mom, you made sure they were provided for. I don't think they have any conception of how hard it is for single parents. They should be singing your praises! NTA",
      "id": 73,
      "comments": [
        {
          "score": 628,
          "content": "Twin infants probably would have been adopted by an eager family who had the $35K+ it takes to adopt. \n\nAlso providing for your children is basic parenting. I wouldn’t even call it competent. Feeding and clothing them is expected.",
          "id": 74,
          "comments": [
            {
              "score": 283,
              "content": "Or they could've been stuck in the system, living most of their childhood in various foster homes.  Weird to assume that they would get the best possible outcome.",
              "id": 75,
              "comments": [
                {
                  "score": 295,
                  "content": "No.  The waiting list for newborns is immense and only the most qualified get on it.  Twin insane would have been snatched up, they would have not even touched the system.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 403,
                      "content": "Assuming OP isn't black.\n\nNot trying to make this a thing, but that's kind of the make-or-break for newborns being put up for adoption.",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 270,
                      "content": "Your statement is only true if the twins are white.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "No, peaches, the waiting list for white healthy newborns is about 2 years if you go through the state.  You're presuming a lot.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 189,
                  "content": "God, please stop spouting this bs. Research first. *Black* babies and *older kids* don't get adopted. I don't know the stats on native or middle eastern babies. For every other race in the US, there are dozens of adoptive parents for each single baby, waiting to grab up a fresh one untainted by the system. The first big adoption rate drop-off is at two years of age.\n\nMy sister was a black baby in foster care, and adopted at 3. She went through hell in just that brief time in the system.\n\nBut I really hate seeing this misinformation spread, because infants are *the exact case* where there are more parents than kids waiting. People get discouraged from giving infants up for adoption because of this type of comment. If you're black or your baby will be, then i would think about the system some. But statistics show us white, asian, and Hispanic babies overwhelmingly get adopted.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Native babies are in a weird legal loophole in many states because native americans get first pick and if a kid has even a minuscule amount of native blood it gets really difficult to adopt them. \n\nAs for your sister in foster care, it's a completely different situation than being adopted through an adoption agency. \n\nhttps://www.npr.org/2013/06/27/195967886/six-words-black-babies-cost-less-to-adopt\n\nSo I found this article and you're right that the demand is less but that doesnt mean that there aren't still waiting families for black babies. \n\nIn summary, people still want to adopt black babies, just not as many.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 80,
                  "content": "Twin kid babies being stuck in the system? \n\n\nThe system goes wrong for small children up until 18, black babies and sick babies. Babies under 1 years old get snatched up.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "No way. They’d have been adopted before even completely out of OP. Twin infants would be a jackpot.",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Or you know, the mother could have chosen not to have kids when she was a teenager... she chose to drag kids into her bad life choices. It drives me nuts when people think it’s worthy of respect just because she is a parent. Having sex doesn’t automatically grant you respect.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 78,
              "content": "Being forced to give your kids up for adoption due to poverty is better? Only rich people should have twins? What are you trying to say?",
              "id": 85,
              "comments": [
                {
                  "score": 60,
                  "content": "In this case yes. If she couldn’t afford them then it’s better they don’t starve or suffer homelessness. OP got very lucky and could’ve ended up homeless and the system snatched her kids. Not many people would want a pair of newborn twins in an apartment  rent free",
                  "id": 86,
                  "comments": [
                    {
                      "score": 66,
                      "content": "They didnt starve, and parents arent required to adopt out their babies in order to ensure they have a large yard.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 39,
                      "content": "You're making a ton of assumptions based on nothing. The kids were never homeless OR hungry. You're making wild speculations on what could have happened instead of of judging based on what did happen.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "Yes? Why would you ever wanna have children when you can't afford to properly care for them? It's irresponsible and selfish to have kids when they can't even properly grow up in normal conditions. Giving them away for adoption in cases of accidents is the best option if you're poor, as the adoptee's parents likely have the means to raise them since they are looking for it.\n\nOnly people who can properly care for their children should have children. Don't put your child through misery from the get go solely because you wanted children.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Not being rich != misery.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": ">Also providing for your children is basic parenting. I wouldn’t even call it competent. Feeding and clothing them is expected. \n\nExactly. We don't praise people for doing the bare minimum",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 181,
          "content": "Providing for your children is the minimum you do for them. No, they're not \"lucky\" she didn't put them in the system. She chose to keep the pregnancy and not put the babies for adoption.",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 140,
          "content": "To be fair though, it sounds like they had a tough childhood. Maybe they feel their mother shouldn't have got pregnant so young to start with.",
          "id": 93,
          "comments": [
            {
              "score": 43,
              "content": "But she can't change that now, nor can she improve upon the past. \nThey have a need to reflect on their childhood, but the real problem is airing dirty laundry on FB and sacrificing their mother in the process.",
              "id": 94,
              "comments": [
                {
                  "score": 51,
                  "content": "While I definitely don’t think they should have plastered it all over Facebook but there are some things you will always be bitter about.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "They're ~~17~~ *in their twenties*, who would they have on FB besides friends and immediate family? I don't see how it is so much worse than just venting to your friend group IRL, which I'm pretty sure every teen does?\n\nEDIT: I misread the twin's age. Apologies. I still kinda feel like it is normal to vent to your friends about such things?",
                  "id": 96,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I’m 25 and have all sorts of friends on Facebook I wouldn’t feel comfortable complaining about my childhood to. Coworkers, bosses, former teachers, people you met at a party once and drunkenly added, friends of friends, classmates you added for assignment coordination... venting to one friend is very different to venting to 400+.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "They’re not 17, they’re in their 20’s.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "They didn't chose to have a single parent. OP chose that, and they had to live through it. Of course it was hard for OP, but like... You can't force people to come along on a hard ride and then expect them to be grateful it wasn't worse. Everything can always be worse, doesn't mean it isn't bad as it is though.",
          "id": 99,
          "comments": [
            {
              "score": 21,
              "content": "I'm sure the baby's father had some choice involved here. Where was he?",
              "id": 100,
              "comments": [
                {
                  "score": 14,
                  "content": "> I'm sure the baby's father had some choice involved here.\n\nI mean yes but also no as if she knew he'd be absent then she still made the choice to keep them, I do not think OP is the AH but she did in a way 'choose' to be a single mom\n\nEdit: Never mind, she fully made that choice, it seems she forced the father out of their lives",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Op said she cut him out because she thought he was a loser, so no, not really.",
                  "id": 102,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "she chose to bring to children into this world while obviously not being able to provide a good childhood for them - NAH at best, though depending on the actual childhood OP might be the asshole",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Yeah! It's the kid's fault their mom got pregnant!",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "*Thanks mom for not adopting us out to competent parents that had all that was needed to provide for us during our childhood, and instead forcing us to struggle our entire lives. So brave. So thoughtful. Much praise.*\n\nReally, this is dumb as shit.",
          "id": 105,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "It’s not like they asked to be born to a teen mom. OP is the one who made that choice. Things can always be 100x worse than they are - that doesn’t mean we’re all “lucky” to not be in those situations. A child deserves a baseline of being born to parent(s) who can adequately provide for them while still being able to spend quality time with them, and they should never have to experience the sense of stress and instability that comes with being extremely poor. “How hard it is for single parents” is not the kids’ problem. No one gets a gold star for barely getting their children raised with clothes on their back and food in their mouths. That is the lowest of low standards.",
          "id": 106,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "this is a load of bullshit. single parent or not she abandoned her kids for nearly their entire childhood. you’re the type to tell kids to deal with abusive parents because “they could have it worse.” get your head out of your ass and face the facts.",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Yeah, that's not how it works. They would have immediately been adopted by a family of the mom's choosing if she wanted. Couple's build profiles essentially that a pregnant woman can go through to pick the family they want the kids to go to. The couple would fly out if necessary during the labor and be there when the baby is born to immediately assume responsibility. \n\nI really hate ignorant comments like this. There is like a 10+ year waiting list for competent couple who have 10s of thousands saved up to handle an adoption, they are just waiting for babies. \n\nThat being said, I'm not saying OP should have put them up for adoption, just that they aren't \"lucky\" they weren't put into foster care given their situation.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "NAH \n\nIt’s understandable that you feel bad about what they’re saying but.. they really didn’t have the most reliable childhood. Growing up poor with one parent and babysitters isn’t the easiest thing in someone’s mental health, and while I’m sure you did your best to keep them safe and happy, they could very easily have been bullied for being poor etc.\n\nI don’t think them sharing memes on Facebook about their upbringing is particularly harmful and might help them realize their upbringing was more normal or common than they thought.",
      "id": 109,
      "comments": [
        {
          "score": 65,
          "content": "Backing this up, with the additional: i think that they should stick to less public convos about their childhoods, where people involved don't get their feelings hurt and don't get named (real names are compulsory on fb unless you have a good fake one, so their posts do trace back to you, which is not fair and they should have thought about that).",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "As someone who did grow up with less because I was raised by a single mother, etc etc, I think you’re absolutely wrong. Yeah, those girls have affects from their upbringing, but damn their mother tried. I work in part with care and protection cases out of juvenile court in my state, and trust me their life as the children without every luxury could have been MUCH worse. Yeah they have a right to feel how they feel, but trashing their mom like that? Super uncalled for. Yeah, the memes are hurtful, to their mother, who worked really hard to make sure they had food and shelter etc etc. And how will these memes help them realize their upbringing was more normal or common that they thought?? How?? That makes no sense. \n\nNTA op. Your kids can be sad they had a tougher childhood, but degrading you crossed the line.",
          "id": 111,
          "comments": [
            {
              "score": 58,
              "content": "you can be appreciative of your parents and the sacrifices they made for you while also being critical of some of their choices at the same time. i appreciate everything my mom did raising me but i also think she made some questionable choices that really affected me growing up that i'm just now coming to terms with. it doesn't mean op is a bad mom but she shouldn't invalidate their feelings either. to me it sounds like they're just trying to use dumb memes and humor to cope with things.",
              "id": 112,
              "comments": [
                {
                  "score": 2,
                  "content": "I hope you wouldn’t post about your deep relationship issues online.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I agree. Nothing I said contradicted that. But “my mother was incompetent” crossed a line.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 356,
      "content": "All these people talking about how the kids should be grateful for an absentee mom like they chose to be born... You brought kids into your life when you weren't prepared to give them a high quality of life, you can't now bitch that they didn't enjoy it. They have a right to their opinion and to voice it to people in their circle. You got upset and I can understand the reflex to be defensive, but they aren't lying. You weren't a super mom and they did spend most of the life they've had in poverty and dealing with you be away. That's on you, you chose to bring them into that.\n\nI think the best thing you could have done would have been to call them privately, let them know that their words hurt and that despite all the hardship that you always loved them and did your best, help them see your side. It would probably go a long way into deepening your relationship with your children and helping them understand the reality of how hard parenting is. Communication is key and those are your kids. Love them enough to understand their pain and to try and relate with them, help them relate to your struggle and work on making the future better for all involved. \n\nYTA",
      "id": 115,
      "comments": [
        {
          "score": 173,
          "content": "They don't have to be grateful but they also don't have to act like she intentionally ruined their childhoods.\n\nAre you seriously calling this woman an asshole not for how she handled a personal family matter on Facebook, but because she made a poor decision as a 17 year old and then had the determination to see it through to the end?",
          "id": 116,
          "comments": [
            {
              "score": 140,
              "content": "Not an asshole, but you could see it coming from a mile away. If she got pregnant at 17, and have absolutely no means of providing for them, why on earth would you wanna keep them? Aborting or giving them up for adoption, in the latter, would probably ensue better living conditions for the kids.\n\nEven if she worked her way through it, which is very commendable, she ended up sacrificing her children's childhood in order to get there, and being a teenager, being grateful for a normal life now is harder than resentful for all the things you were robbed of since you were born.\n\nESH",
              "id": 117,
              "comments": [
                {
                  "score": 90,
                  "content": "> 'I always knew, other kids with competent mothers had huge backyards and we had an apartment'\n\nThis is not a joke, this is an insult disguised as a joke. They had a bad childhood, but OP made a point: they always had a roof above their head and food on the table. They can be sad, they don't even have to be grateful, but was it really necessary to insult their own mother who gave everything for them and tried to raise them? If it was such a ''traumatic experience'' they should see a therapist. Not complain about it on Facebook.\n\nNTA",
                  "id": 118,
                  "comments": [
                    {
                      "score": 44,
                      "content": "They are definitely shitty to vent out their frustration on fb and taking jabs at their own mother, but I also understand the resentment towards her as it was their entire childhood spent in poverty and sub optimal conditions. OP was 17 and in no shape or form ready to raise them, and it translated into the lifestyle they had. The entire thing came from a mistake, so there would be no truly good outcome. Between giving them for adoption and maybe have a better life or working to achieve normalcy and sacrificing their childhood, its not something that can easily be judged with assholes or no assholes. Both were wrong and both were also right in some sense.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Generational poverty is a huge thing and OP (who sounds like she did her best) obviously lacked resourced to take care of them.  I highly doubt they can afford to see a therapist, even most middle class people consider it a significant expense and given their age and upbringing its unlikely that they have significant financial resources.  I would say ESH, you don't get to drag people on a hard life and then yell at them about being upset and not grateful for the little they got.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "That line kills me. Oh no, not an *apartment*!",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Every person deserves a roof and food, you don't get brownie points for keeping your children alive and not-homeless.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Abortion is nearly completely inaccessible in many states and I’m sure it was even worse 25 years ago. People act like you just pop around the corner and your pregnancy is ended but there can be hundreds of factors that limit women’s access to abortion for women who WANT it.\n\nAnd adoption is in no way a guarantee of a higher quality of living. There are many different variables involved and there are many sketchy agencies out there.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I never said adoption was guaranteed better living, but considering that people who wanna adopt are generally people with the means to raise, and thus could provide better for the children. That's why you can't always rely on agencies to make decisions, contact people, talk to them, do what you must...",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "[deleted]",
              "id": 125,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "The determination to see it through to the end? You’re acting like deciding not to get an abortion at 17 is a commendable thing. (I’m obviously not saying you need an abortion if you have a child at that age but you shouldn’t pretend they’re heroes either for literally just dealing with it.)\n\nShe was not some warrior on a mission to have a baby. She made a mistake and had children too early and had to deal with it her full life.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "They resent her for their childhood and I can't blame them. OP made the decision to raise them in poverty for majority of their childhood. This is the result. Growing up in poverty stays with you for a long time.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": ">but they also don't have to act like she intentionally ruined their childhoods.\n\nThey were just making jokes and looking at it from the bright side. How is that \"acting like she intentionally ruined their childhood\"? She decided to make them go through poverty and they have the right to atleast joke about it. She is TA for blowing it on Facebook.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "She's TA for having kids when she wasn't in a place in life to properly support them. She's TA for putting her own selfish desire to have kids over the understanding that you're forcing a bad childhood on two conscious living people.\n\nI don't get why we always give a pass to people who chose to have kids when they obviously aren't ready to, just because LiFe iS a MiRacLe",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Why wouldn't you? She made a stupid decision. Some stupid decisions are worse than others and she happened to make an extra dumb one.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 52,
          "content": "This! As much as I want to be symphatetic with the mom the kids have their right to be upset. She is TA for booming it on Facebook. They are just making jokes and seeing things from a bright prospective and she feels \"offended\". She did her best but blowing them on Facebook and calling them ungrateful is just A-hole move.",
          "id": 131,
          "comments": [
            {
              "score": 23,
              "content": "> They are just making jokes and seeing things from a bright prospective\n\nThis could maybe be a joke:\n\n> 'I didn't know how poor I was until I realized how big a yard can be'\n\nIt's a statement that other kids had stuff you didn't, but you didn't really comprehend it until you were older. I can see it as sort of sad, but not intentionally hurtful.\n\nThis is *not* a joke:\n\n> 'I always knew, other kids with competent mothers had huge backyards and we had an apartment'\n\nThat's a personal attack, and the mother deserves an apology for that. What kind of a terrible person do you have to be to bitch about how your mom wasn't rich enough for your personal tastes? Fuck that arrogant kid. This is the same type of behavior as rich kids bitching because they got a Ford instead of a Tesla, just moved down the socioeconomic ladder, and we should scorn people like this.",
              "id": 132,
              "comments": [
                {
                  "score": 3,
                  "content": "Actually I agree with you I didn't pay attention to the second one. The second one is just rude. You are right it was a bitchy move **espeacially** one Facebook. But I don't like the way she handeld it by with responding on Facebook and all. I lean more on the ESH...",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 134,
                  "comments": [
                    {
                      "score": 6,
                      "content": "My new favorite seriously fucked up thing I've seen on the internet is \"Your parents should apologize for not aborting you because you lived in an apartment as a kid.\"\n\nThank you for that, I suppose.",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Agree.\n\nI think the deal breaker on this being YTA for me was OP talking about how \"maybe\" her kids were bullied. I get working a lot to support your family, but you don't know if your kids are being bullied or not? What else *don't you know* if happened? Sounds like she was actually neglectful, at best.",
          "id": 136,
          "comments": [
            {
              "score": 34,
              "content": "And the whole unspecified bad things Op won't explain in more detail.  Like, sexual abuse?  Witnessing drug use?  Witnessing violence in the home?  That's serious shit for a little kid.",
              "id": 137,
              "comments": [
                {
                  "score": 24,
                  "content": "Yeah I caught that too. I'm betting it was some pretty bad stuff since she's so detailed when talking about everything she sacrificed and everyone who let them stay with them and all that but suddenly gets vague when she's talking about potential trauma and shit her kids had to go through.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 3,
                      "content": "The \"good news?\" of now sharing a home with another mother who has a son. That's great for you OP, glad things are convenient but did your girls get along with the other child? It's mentioned as a saving grace but who knows what the environment was like. Hell, OP might not even be aware.",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Thank God I saw one of these near the top.\n\nOP made a mistake.. her kids suffer for it. And now she's mad they didn't enjoy the suffering. What an LOL.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Best response here.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I think parents being absent even if it’s in an effort to provide for the family is a legitimate thing for kids to be upset about. But not having a yard isn’t a hardship. I mean, shit, even rich kids living in million dollar apartments in urban cities don’t have yards. I understand these kids weren’t rich and living in poverty does a number on people but calling a parent incompetent for not providing a house with a yard is over the top. I grew up with parents who were poor immigrants who worked themselves up to middle class only to then declare bankruptcy and we had to move our whole family to a one bedroom apartment. No yard. It wasn’t that big a deal. Even as a bratty stubborn teenager I didn’t think it was that big a deal.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Facebook is not \"in their circle\". Facebook is extremely public and even if their posts were \"private\" that means that even that woman you met at that restaurant 5 years ago and friended on Facebook sees it. The world is smaller than you think.",
          "id": 143,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "After seeing everyone else's comments but finally looking at yours, you pushed me from NTA to finally ESH. Thanks man, alternative viewpoints help everyone.",
          "id": 144,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 354,
      "content": "YTA \n\nAnd this is totally a validation post. It's all about you and your sacrifice, with next to no mention about what the girls were doing/feeling. I've heard people talk more passionately about their plants.\n\nFine, you worked a lot, but it doesn't sound like you mommed very much. Add in depriving them of a relationship with their dad (they're pissed about that even if they don't tell you) and some murky \"bad thing\" that occurred in their home, it sounds like a recipe for a boat load of resentment on their part.\n\nAnd, honestly, how often is your response to them about any complaint how much you worked and sacrificed? The holes in your underwear don't have any bearing on your ability to mother your children. You're looking for pity with comments like that.\n\nGet over it. You had kids, you choose you raise them the hardest way possible because of the dumbest reasons. Spent next to no time actually with them (I'm sure you'd have thrown in some examples of it had it been more important to you). And now you've got kids who sound like they're coming into an age where they're really learning how the rest of the world works and have figured out not everyone had a mom like you. \n\nFine they had food, good job. Congrats, you meet the bare minimum. You don't get a pass on the rest because of it though.",
      "id": 145,
      "comments": [
        {
          "score": 115,
          "content": "Great reply. Sums it up pretty well. I find it annoying when others complain how much they had to sacrifice for their kids, but the kids didnt ask to be born.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "> Fine, you worked a lot, but it doesn't sound like you mommed very much.\n\nNailed it. Literally *every single word* in OP's story was about what she was doing to financially provide for her kids - and don't get me wrong, it sounds like she did an incredible job given the circumstances - but there is literally not. one. single. word. about what she did to provide for them emotionally, about what OP's relationship with them was.\n\nEither she has nothing positive to say that wouldn't be a lie, or she doesn't even consider emotional involvement with her kids important enough to be worth mentioning, which is itself pretty damning. This story sounds like she was distant/absent at best, and at worst the rare occasions where the kids interacted with their mom could have been her taking out her stress from her jobs on them and guilt-tripping them over how much she sacrificed. We don't know, because for *some reason* OP doesn't want to tell us.",
          "id": 147,
          "comments": [
            {
              "score": 24,
              "content": "That's exactly it. I had to read the post a couple times over. But yeah, she left out ANY mention of making sure they knew they were loved. Head over to r/parenting and see how often you see that. You don't. She didn't care enough about that for that to be a defense for her. Or she'd have told us.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Agreed. YTA",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "It feels like when I was a kid and my mom would tell me all the time how ungrateful I was because I had food, a roof and clothes, she'd even say the same things about how old and worn underwear was because she couldn't afford anything new while taking care of my brother and I. It made me feel a ton of guilt as a kid and once I grew up a bit I started questioning why she even had me if I was such a burden. Like she didn't have to have children, why did she bring me into this world just to make her life harder? She always acted like she wanted an award for doing the absolute bare minimum as a parent while I was an ungrateful brat because I was still miserable because of all the other bullshit she put me through.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Harsh, but completely accurate. Because of OP's bad decision to have kids at 17 as a single mom, she deprived them of a father, was an absentee mother, and put them in living situations where they were vulnerable to \"bad things\". \n\nThen they got older and started to see what intact families that don't struggle to pay rent look like and became keenly aware of what they missed out on. Can't blame them for feeling resentment.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Exactly! YTA. I’m sooooooooooooo over people thinking giving kids a shitty ass life is better then abortion or adoption and preventing the suffering. Make better fucking choices.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I had to scour for some sense within these validating comments. Thank you for speaking your mind, no matter who might not agree with it. Because at the end of the day, it's the hard truth. 100%",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 261,
      "content": "YTA. The title of motherhood doesn't protect you from criticism. My mom raised me and my sister on her own, she stayed with us until we were old enough to go to school, because early childhood development is so important with young children, all while going back to school to get her GED.\n\nAfter we started school, then she started working full time and she worked a lot. But she always made sure to be home with us in the evening.\n\nYeah, we were very poor. But if I'm being honest, my fondest memories were of being with my Mom and sister in that shitty little trailer, playing, learning and bonding with my Mother and sister.\n\nGrowing up poor is hard, but the quality of your family bond can greatly change how it's viewed later in life.\n\nIt sounds like you were so obsessed with making a better life for yourself and your children you completely missed the fact you weren't there for it.\n\nYour children are completely entitled to vent their feelings.",
      "id": 154,
      "comments": [
        {
          "score": 72,
          "content": "But they aren't complaining about the amount of time she gave them. They are complaining about the size of their yards and how competent mothers could get it.\n\n>It sounds like you were so obsessed with making a better life for yourself and your children you completely missed the fact you weren't there for it.\n\nTo me it sounds like she was \"obsessed with\" making ends meet being a 17 year old drop out with twins and no support.",
          "id": 155,
          "comments": [
            {
              "score": 89,
              "content": "They're most likely not mad about that specifically. They're probably not airing out note personal grievances in public, and instead using things other people can relate to on a broader scale.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "It's almost as if a 17 year old dropout has no place bringing children into the world.... It's almost as if they should have listened to logic and reason, understanding they are in no place to support kids.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "That's one example op used. They also made posts complaining about their mum being absent and being \"raised by babysitters\" - I'm not judging OP on what she did, she did what she had to do to provide for her children, but they're not in the wrong for complaining about missing a vital part of childhood, as in a parent that is there for you",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Could it be that OPs financial stress caused them to be hyper aware of the financial situation and blame their feelings on it? Can you blame them for being materialistic when growing up poor with a single (mostly) absent parent? Maybe they're blaming her for the wrong thing but it doesn't sound like they have no reason to be bitter here.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "> But they aren't complaining about the amount of time she gave them.\n\nAs far as we're privy to. I strongly doubt those complaints OP shared with us are the end of it.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 206,
      "content": "I'm gonna say YTA. Simply for the fact of because you wernt always around you didnt know how those two girls felt or what they had to deal with. Their comment of \"being raised by babysitters\" just screams that they wanted their mother . And god knows they would have been bullied to all high hell for being the \"poor kids\" . But now as adults you are trying to shut them up and not let them vent about how they feel? They are aloud to have emotions and be upset with the childhood they had. \n\n>they always had a safe home with food and at least one adult around to protect them which is more than other children\n\nNo this isnt something special you get to hold agaisnt them. Having shelter, protection and food are the bare minimum of what a human needs . It isnt some grand gesture or something that somehow they should be grateful for",
      "id": 161,
      "comments": [
        {
          "score": 109,
          "content": "Also, how safe was it actually if she vaguely alludes to “bad things” happening?",
          "id": 162,
          "comments": [
            {
              "score": 86,
              "content": "I’m willing to bet those “bad things” were some form of abuse that she conveniently glossed over.",
              "id": 163,
              "comments": [
                {
                  "score": 45,
                  "content": "Does OP ever say in the comments what these bad things are?  I wonder if her children have lots of reason to be angry, but don't want to out themselves as victims of something terrible on social media, so they're focusing on the less terrible stuff to complain about.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Sounds about right. She never said what the “bad things” were. The fact that she felt the need to mention that bad things happened but then completely gloss over it and go on about how much of a martyr she was makes me suspicious. I’m guessing something serious happened that she could have stopped/prevented/not done but she only wants to focus on how hard she worked. There is definitely more to this story.",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "That's exactly it! They're making fun of the few things they know others will relate to. But this is far from the end of it, I'm sure.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 82,
              "content": "Yea she was vague as shit which makes me think it isnt as safe as she says",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "^ exactly. OP did the bare minium and wants a platinum achievement for it.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 157,
      "content": "YTA, you brought not 1 but 2 kids into this world before you were in a position to take care of them, and then you're mad they're upset about your shortcomings? Sure, you busted you ass off, but you still brought them into this world before you were ready. Their childhood was probably significantly harder than those who grew up with parents who were ready, and they should be allowed to speak their mind about it.",
      "id": 169,
      "comments": [
        {
          "score": 2,
          "content": "> YTA, you brought not 1 but 2 kids into this world before you were in a position to take care of ~~them~~ yourself",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 139,
      "content": "YTA and its not even close.  \n\nLets examine why you left the father, didn’t tell him where he could find his kids, and made it so he couldn’t have a relationship with him.\n\n\"Their father wasn't a great guy. He had no job, he couch surfed our entire relationship, and he was in his early twenties when I was in high school.\"\n\nSo he was poor and young like you?\n\n\"When I got pregnant I decided the best thing for my children would be to leave him. That's why I moved in with a friend, it was out of town and he wouldn't know where I was.\"\n\nSo you denied a daughter a relationship with their father because he was “poor”.\n\nThey've never known their father, and I'm sure that's another thing they resent. Growing up without a dad is hard, but in this case it was safer. They can't really call him out-they don't know much about him.\"\n\nSafer because he couch surfed?\n\nYou cry about your daughters making a judgment about their poor ubringing, but you did the exact same thing to the father.  Sounds like you are getting a taste of your own medicine.",
      "id": 171,
      "comments": [
        {
          "score": 83,
          "content": "i would agree with you if a (minimum) 21 year old wasn’t sleeping with a (maximum) 16 year old girl. this seems potentially “unsafe.”",
          "id": 172,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 66,
          "content": "In many places he would be a rapist for impregnating her. She was a minor and he was an adult with no job and no apartment.",
          "id": 173,
          "comments": [
            {
              "score": 18,
              "content": "In most states the age of consent is 16.  Plus depending on the ages Romeo and Juliet laws mean he was in the clear in some other states.  Judging from her post she would have mentioned it.  She seems to relish in the fact of how hard she had it.\n\nPlus it seems like she never even tried to get child support which is a complete failing on her part.  Its owed to the child not her.  Her children had holes with underwear in them.  I wouldn’t be suprised if other things like food, checkups, and medical care was also lacking.  She was more concerned with her own martyrdom  then the well being of her children.\n\nI agree being poor doesn’t make you a bad mother.  Nevertheless being poor and working a lot of jobs doesn’t make you a good mother either.",
              "id": 174,
              "comments": [
                {
                  "score": 2,
                  "content": "Actually that's not true, you're hilariously wrong about age of consent. In most states it's 17.",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "> Lets examine why you left the father, didn’t tell him where he could find his kids, and made it so he couldn’t have a relationship with him.\n\nAlso that is called kidnapping by most people",
          "id": 176,
          "comments": [
            {
              "score": 2,
              "content": "I'm wondering if some of the resentment felt by the twins stems from the fact that they were denied any chance to have a relationship with their father.\n\nOP has a lot to answer for, beyond the poverty and leaving her children in the care of babysitters.",
              "id": 177,
              "comments": [
                {
                  "score": 2,
                  "content": "I couldn’t agree more",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}