{
  "post content": "Am I the Asshole for getting my mentally abusive mother a flask that says f*ck you on it for Christmas??\n\n My mother never wanted kids, and she should have never had kids. She would constantly tell me that children ruin lives. She would always take me places so she could drink and party with friends. She would leave me at home during the summer with only cans of beans in the pantry and wouldn’t let me go to my dads house. She would call me fat, but wouldn’t buy me nutritional snacks because it “ wasn’t in the budget” and then go out to concerts, get wasted, and get tattoos. She would constantly say stuff like “ oh your cute clothes obviously aren’t comfortable”. When I told her I was depressed and felt like my life wasn’t worth living anymore, she told me to suck it up. She said I was faking it for attention. She would constantly complain about having to take care of me like it was a chore. Keep in mind I’m a 17 year old who doesn’t need someone hovering over them every minute of the day. \n\nWith my mental health destroying my life, I decided to move out and live with my Dad full time. She was obviously hurt, but I couldn’t take it anymore. Living with her made me feel like absolute garbage. I tried to see her once a week and be civil, she would always try to guilt me into moving back in by making herself the victim.  On Thanksgiving, she accused me of not loving her in front of our whole entire family and then said “ I have all of your shit in boxes, what do you want me to do, throw it away?” in a snarky tone. At this point, I have completely given up on being civil with my mother. I have tried and tried to just have a normal, functioning relationship with her. I wasn’t going to get her anything for Christmas, but I saw a flask that said “ f*ck you” on it, and decided that’s what I was gonna get her.  I admit that I did stoop down to her level, but am I the asshole??",
  "id": 1,
  "comments": [
    {
      "score": 118,
      "content": "ESH. She's obviously an asshole. But you are instigating her. You are not an asshole for not wanting anything to do with her. Just for antagonizing her.",
      "id": 2,
      "comments": [
        {
          "score": 50,
          "content": "Don't turn into your mother OP, you're better than that.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 76,
      "content": "NTA\n\n&#x200B;\n\nIt's maybe not the best plan, but I also can't blame you.  Your mother abuses you for years, but suddenly you're on her level for a mug?  Nope.",
      "id": 4,
      "comments": [
        {
          "score": 29,
          "content": "I agree with this. Cannot see how giving someone a mug that says \"fuck you\" is the equivalent of stooping down to years of emotional abuse. NTA.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 52,
      "content": "ESH - You should go no-contact with your mother. The relationship doesn't sound healthy for either or you in the state that it's in.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "NTA\n\neveryone who’s saying you stooped to her level is wrong. she abused you for your entire life, buying her a flask that says fuck you isn’t anywhere near her level. obviously it’s not a good thing to do, but it’s not the same as what she’s done to you. she deserved it, and much worse",
      "id": 7,
      "comments": [
        {
          "score": 13,
          "content": "^ This. can y'all please stop fucking morally guilting a young abuse victim for a small, petty jab as though they're somehow now just as bad as their neglectful, shitty mother who caused them years of emotional trauma? No, they shouldn't have done that, but if you honestly think this is \"on her level\" you need to have a good, long think about where your moral compass is at.",
          "id": 8,
          "comments": [
            {
              "score": 2,
              "content": "yeah holy shit. i hope op sees our comments and realizes that they aren’t in the wrong, people just have a hard time with nuance",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "ESH. Your mom is abusive, and that's inexcusable. But cheapening yourself to try and make her feel bad is toxic. She's toxic and so is your relationship with her. If you aren't looking to try and mend things with her, which is fine for you to do, then you should go no contact. You're just making each other miserable.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA lol i mean of course you were a ahole, you shouldn’t have done that cause its not moral and bla bla bla but hey, if you feel better now after 17 years of psychological torture f*ck her",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "ah, this makes me nostalgic.\n\nwhen i was in late middle school i stopped seeing my dad because he was abusive, and decided i was going to stay with my mom. the only thing was my *stepmom* still did substitute work at the school i was going to, and the teacher she was substituting for (my teacher, it was a small school and we only had one teacher per grade, which meant she was *in charge of me for 8 hours*) was also the teacher who watched the kids after school. sucks, right? especially when the school im going to is nowhere near my moms house because my dad picked it out, and my mom worked late, so i was often the only kid left waiting to be picked up for about 15-20 minutes.\n\ncut to one afternoon where its just me and her, and she tells me, completely unprompted, like theres-been-silence-for-at-least-five-minutes-and-its-the-first-thing-she-says unprompted, \"you know we boxed and sold all your stuff right? your room is storage now.\" like what am i, 13 years old, supposed to say to that? nothing. so i said nothing. next time she subbed for our class and it was just me and her after school she was watery-eyed and told me how much my dad missed me, and how hes been so sad since i left, and that i should come back \"home\", as if i hadnt been told i no longer had a place to stay there. that time of my life was absolutely wild, and i know where youre coming from.\n\ni was the last of three kids to leave him, and from what ive seen in bits and pieces his life has majorly gone downhill. any time me and my siblings were in the same room as him + stepmom for holiday stuff we just pretended the other people werent there. a relationship with him is just unfeasible at this point, and that took a while for me to come to terms with.  its insane what people will tell you to gaslight + manipulate you under their control. im glad youre out of there and safe, focus on healing yourself right now.\n\nTL;DR is that sometimes parental relationships just arent viable anymore, and while a f\\*ck you flask definitely is an asshole move on its own, i know where youre coming from and in the bigger picture its justified. being kinda rude is in no way comparable to years of physical and emotional neglect and, in turn, physical and emotional abuse. you mention trying to keep that relationship, and thats reasonable to still feel that attachment. it sounds like this fuck you flask is equal parts retribution to your mom and also a way for you to affirm to youself that shes no longer in control of you, and thats just how it is sometimes. youre NTA.\n\nedit: changed flash to flask, 20 years old and i guess i still cant read",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA- don't even get her a gift. She's hurt you chose your dad? you should have chosen your dad a long time ago.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA - Sounds like the perfect gift for her.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. Getting her a dumb flask that says eff u isn't the equivalent of years of emotional abuse. You haven't stooped down to her level by finally taking a stand.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    }
  ]
}