{
  "post content": "My daughter is 5 years old and my mother has had full custody of her since she was four months old. Being a young teenage mom with no money, no car, no house, really no support was extremely difficult and I felt the most selfless thing I could do was to sign my rights over to my Mom. Since then, I have way more stability in all areas of my life. Financially I contribute A LOT! I buy all her shoes (she has like 150 pairs not kidding) I buy all her clothes, I bought all the booka on her teacher's Amazon Wishlist.. I also create wonderful memories for her.. We fly kites, get our nails done, go to Barnes And Nobles, paint, etc. When we arent together I read several stories to her over Facetime and sing four or five songs every night that she always  falls alseep to. I love her very much! She is my pride and joy!\n\nIt is my character to bless others as I have been blessed! I taught my mother my legit totally legal side hustle and helped her generate 60k in passive income this year. My family tries to rip me off any chance they get! My little brother just stole $15,000 from me and I just have to suck it up and smile because if not, my mom wont let me see my princess. Period.\n\nMy aunt has been estranged from my Mom the last ten years because she is an extremely vane, manic, botox Queen who will do nice things for someone then demand the money back. (10 yrs ago she bought my mom wooden floors after my parents divorced then demanded repayment.) Eventually they made up and talk on the phone like 8 to 10 times a day.  A couple times I have heard her say really rude things about me. The first time was when they were on the phone in the car and I was riding passengar. They were talking about their brothers exwife who starts with a T. (and so do I) She kept saying over and over, THERE IS NOBODYYYY I want to talk w that starts with a T. Like hmm ok.\n\nThis weekend my daughter spent the night w me and now Im doing laundry I noticed this old pilled up pajama dress that says \"DRAMA QUEEN (like my mama)\" I remember my mom said she bought it for my daughter used off Poshmark. It is really tacky looking and nothing like she would normally buy. I feel it was a joke on me. WIBTA to say something to her?",
  "id": 1,
  "comments": [
    {
      "score": 85,
      "content": "ESH\n\nYour entire family sounds weird. You talk about your daughter like she's a little sister until it comes to declaring ownership over her. Your familial relationship with money on all counts is abnormal. Your mother threatening to keep your daughter from you is weird, and you not regaining custody once financially stable is weird. Pajamas are the least of your issues",
      "id": 2,
      "comments": [
        {
          "score": 12,
          "content": "Well said! MTE what a mess. The entire family needs intervention from a family therapist.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Technically, that is their little sister.",
          "id": 4,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -34,
          "content": "When you sign your rights over its not a temporary thing. A new birth certificate is issued. I will never be able to re gain custody of her becausd of a decision I made during the worst time of my life.",
          "id": 5,
          "comments": [
            {
              "score": 17,
              "content": "Talk to your own lawyer about that. Not one who has represented your mother.",
              "id": 6,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Guys OP is right once you sign over your rights you cant get the kid back. Its more like an adoption.",
              "id": 7,
              "comments": [
                {
                  "score": 1,
                  "content": "Thank you.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 59,
      "content": "Is this a pyramid scheme post?",
      "id": 9,
      "comments": [
        {
          "score": 30,
          "content": "Yeah I was gonna say… one part of this sticks out with extreme clarity…",
          "id": 10,
          "comments": [
            {
              "score": 12,
              "content": "Same thoughts.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -66,
              "content": "What? That I taught my mom a totally legit side hustle? Yes I did. She got to sit on her bum and collect 60k. What is your point? No I will not tell you what it is! I included this information because I am a huge blessing to everyones life and to not be treated as such is insulting!",
              "id": 12,
              "comments": [
                {
                  "score": 46,
                  "content": "OP: I AM NOT A DRAMA QUEEN! \n\nAlso OP: I am a huge blessing in everyone’s life and to not be treated as such is insulting!\n\n….I think a bit of self reflection is in order OP.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh my god that was just great. Thank you OP for you dramatics, I needed a good laugh.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "OP: *Insults strangers on the internet*\nAlso OP: I am a huge blessing to everyone’s life.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -3,
                      "content": "Oh... not the lady that wants to keep asking about my daughters shoes and acts as If my daughter is so deprived from Educational Services.\n\nOn some real shit, I make in a month what youd be lucky to make in 5 years. Your opinion is for the fkn birds too",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Because it wasn't really relevant or needed for the story? I am confused why you added it.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 11,
                      "content": "> I am confused why you added it.\n\nHoping you'd ask about it!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -2,
                      "content": "Its completely relevant and if you fail to see why stop being an AH. This is my life youre picking apart. Did I ask why your mother was illiterate and spelled your name with a Z? Im confused why she added it",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -16,
                      "content": "Thank you",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Me and my partner thought the same thing.",
          "id": 21,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 44,
      "content": "What 5 year old needs 150 pairs of shoes? Good for you that you have money to contribute to caring for your sister / biological child. You need to get over yourself!",
      "id": 22,
      "comments": [
        {
          "score": 21,
          "content": "It sounds like everyone is failing that little girl on every single level. She's a tiny human being, not a dress up doll. And everyone is being materialistic and petty just to spite each other.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I was stunned at that too. My kids have 6 pairs between the three of them. A main pair and a back up.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Ikr? The planet is dying and some people are lucky to have a single pair of shoes and you buy *150* pairs for a child who will grow out of them within a year or two??",
          "id": 25,
          "comments": [
            {
              "score": -2,
              "content": "These shoes will last her through out her entire elementary school career. \n\nTheyre $12 knock off converse in various colors that will last until 5th grade. They were selling out quickly so I got it while I could. Not that big of a deal.",
              "id": 26,
              "comments": [
                {
                  "score": 8,
                  "content": "So you spent more than $1500 on shoes for a 5 year old? How do you know she’ll like them when she gets older?  What a waste of money. Next time put it in a college fund",
                  "id": 27,
                  "comments": [
                    {
                      "score": 0,
                      "content": "She has a 529 fund! Thank you!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "Theyre a timeless classic",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "You do realize kids feet can grow quite fast, especially at that age. If you want to buy them 150 shoes wait till they are at least 10/13, then they'll have a better chance be able to wear them for many years.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Even if that was true, that’s still way too many shoes. I’m 24 and your kid has more shoes than I’ve owned in my entire life - and I don’t want for shoes.",
                  "id": 31,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Oh looks like youre deleted your comments huh lol",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -4,
                      "content": "Why are you deleting your comments?\n\nYour opinion is for the birds!",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "[removed]",
                  "id": 34,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "[removed]",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "This has to be a joke right?",
      "id": 37,
      "comments": [
        {
          "score": 6,
          "content": "I wouldn't be so sure. I worked through college as an assistant for a family lawyer and this story is relatively normal compared to all the stuff I saw on the job.",
          "id": 38,
          "comments": [
            {
              "score": 2,
              "content": "Story time?",
              "id": 39,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "If she’s an MLM hun, then I can definitely believe it’s 100% real",
          "id": 40,
          "comments": [
            {
              "score": 1,
              "content": "Yeah I do feel some MLM vibes from this",
              "id": 41,
              "comments": [
                {
                  "score": 1,
                  "content": "Excuse my ignorance but what mlm means?",
                  "id": 42,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Multilevel marketing, a fancy name for pyramid schemes",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "Nta. Your whole family sounds awful as fuck. 15k stolen from you and if you do anything you wont see your daughter? Jesus. \n\nYou should probably find a lawyer if you haven’t already",
      "id": 44,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "YTA- you lost me on my mom raises her but I buy her 150 pairs of shoes. When you call grandma mommy and your mother Charlotte, there is going to be problems.",
      "id": 45,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "I’m just sitting over here wondering why a 5 yo needs 150 pairs of shoes.\n\nActually, wait…since your mother legally adopted your daughter, isn’t the shirt actually referencing herself and not you? \n\nI guess I’ll go with INFO",
      "id": 46,
      "comments": [
        {
          "score": -16,
          "content": "Well in all fairness the shoes are not in one size. They vary in sizes all the way up to like size 6 which Id assume is like 5th grade? Amazon had these really nice knock off Converse that are super comfortable and affordable with a wide color variety. They were selling out quickly so I kinda splurged bc I was afraid they wouldnt restock. I recently went to try and find that same shoe again and theyre history!! The whole listing is a different shoe. So no regrets on the 150 shoes truly.\n\nShe says she has 2 mommies.",
          "id": 47,
          "comments": [
            {
              "score": 30,
              "content": "I’m sorry, that still makes no sense whatsoever. You said it as if it’s a thing to be exceptionally proud of. It just sounds excessive and I’m wondering where tf you put 150 pairs of shoes anyway. \n\nBtw, if you store them in an attic or garage, the heat is going to break down the rubber and glue long before she’ll grow into them.\n\nI realize this isn’t the point of your post, but that is what struck me, so there you go.",
              "id": 48,
              "comments": [
                {
                  "score": -14,
                  "content": "In comparison to her father who lives in the bushes (and contributes absolutely nothing) this is absolutely something I am proud of. If I would have stayed with him, I would probably be shoeless myself! She has dead space above her closet theyre stored in.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yeah, but some had to sleep with bushman and get pregnant by him. People make mistakes and some cost more then others but you have to own it.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "YTA and you should stop calling the child your daughter because she is not your daughter, you have her up and your mother is her mother no you",
      "id": 51,
      "comments": [
        {
          "score": -3,
          "content": "I am thrilled a 5 year old is more open minded than you are. You act as if I had a choice! Like let me drag her around to homeless shelters. Great plan!",
          "id": 52,
          "comments": [
            {
              "score": 4,
              "content": "It is a fact that in the eyes of the law she is not your child and never will be. You had a choice and you chose to give her up, unless of course you were forced to give her up",
              "id": 53,
              "comments": [
                {
                  "score": 1,
                  "content": "Yes I was forced to give her up. Thank you.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 6,
                      "content": "How were you forced? In your post and comments you say it was your decision but now you are claiming you were forced.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "ESH. Your kid doesn’t need 150 pairs of shoes, your little bro should be made to repay the $15,000 he stole, your mom shouldn’t stop you from seeing your child and there’s nothing wrong with used clothes. \n\nIt’s petty that you want to get a shirt that says “God doesn’t like ugly” in retaliation for a pyjama dress that says “drama queen”. It’s also really petty that your aunt demands money after giving gifts (they’re not gifts if she wants paying for them) and doesn’t want to talk to anyone whose name starts with T. You can confront your mom about the pyjama dress that says “drama queen” on the front but what’s the point? If your mom is petty enough to stop you from seeing your kid over $15,000 that’s rightfully yours, then there sure ain’t nothing stopping her from doing the same thing over a pyjama dress. \n\nDoes your kid call you “mom”, or call your mom “mom”? Either way it doesn’t matter. Kids clothes with statements like that are supposed to be light hearted, fun jokes. \n\nStop teaching your mom totally legal side hustles when she won’t let you see your child if you ask your little brother for the $15,000 he stole. Your family are all toxic and have no loyalty to you at all. I’m no lawyer but I’m sure your mom can’t stop you from seeing your child, it’s not illegal to buy a kid a pyjama dress that says “drama queen like my mama” and I’m sure that it’s illegal for your brother to steal money from you.\n\nCut your mom off for encouraging your brother’s theft. Cut your brother off for theft. Cut your aunt off for saying rude things about you and seek legal advice over getting custody of your daughter seeing as how your better off financially now.\n\nAlso, the title of the post says that your post says your aunt put your kid in the pyjama dress but the body of the text says that it was your mom. Who was it, I’m confused?",
      "id": 56,
      "comments": [
        {
          "score": 6,
          "content": "And stop buying shoes. First, because there’s nothing worse than a completely spoiled, materialistic kid, and because your totally legal side hustle may not last.  Save as much of your money as you can.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "OH please DO tell me what made you and your mother's totally-legit-legal-for-real-super-easy income-secret is!!!!!\n\nThis is a scam/pyramid scheme for sure lol",
      "id": 58,
      "comments": [
        {
          "score": 4,
          "content": "I don’t think OP knows what a pyramid scheme is 🤣🤣🤣",
          "id": 59,
          "comments": [
            {
              "score": -1,
              "content": "\nI was born at night but not last night 🤣🤣🤣🤣\n\n\nE Commerce is hardly a pyramid scheme.",
              "id": 60,
              "comments": [
                {
                  "score": 1,
                  "content": "Yes it is",
                  "id": 61,
                  "comments": [
                    {
                      "score": 0,
                      "content": "If you cant beat em join em!",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "No. Its none of your business. Im glad my life is so amusing.",
          "id": 63,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}