{
  "post content": "I (17f) am a high school senior who just started my last semester. The only credit I need to graduate is a government/econ credit, which I completed at a different high school, but the credits didn’t transfer so here I am staying in hs for an extra semester for a class I’ve already taken. So I can tell after one period with this teacher that she sucks. She puts on videos for us to watch and our assignments are to collect info from the videos. When she lectures she reads from a powerpoint she got off the internet,  clicks through it too fast and doesnt tell us what we should be writing down for our weekly tests. During class I’m thinking to myself, I was forced to stay an extra semester for this lazy teaching and third grade level work? Today she was teaching in her way and assigned us a word search to do after. School is all online so she just posts a picture of the word search, with no instructions on how to edit the picture so that the words could be highlighted. Several students voiced complaints and questions and her responses to all of them were “haha i have no idea” So I take it upon myself to ask a concise question so all of us can have a clear answer: “This isn’t working for me, what program do you want us to use to be able to edit this picture and do this word search?” And she responds to me “I really don’t care, that’s up to you” just dismissing me and leaving us all to fend for ourselves. A girl unmuted herself to give me some help. And then a couple minutes later the teacher asks “Did that work?” I’m pissed at her at this point and so I mutter to myself “Eat my ass, don’t ask me anything”  and look up to see MY MICROPHONE IS UNMUTED SO THE CLASS DEFINITELY HEARD THAT. I closed my laptop after it happened, thought about it and realized that I didn’t feel that bad about it. Am I an asshole?\n\n\nEdit: Guys I didn’t unmute the mike to tell her to eat my ass💀💀 I muttered it to myself in frustration and the mike happened to be on\n\nAdditionally, this word search was clearly busy work, there was no “search for definitions and find the thing” it was literally here is a word. look for it in this scramble. does that sound like work 12th graders should be doing? and all of the work shes given us are pictures of what we’d normally be doing in class, word searches, coloring all that kind of bs; the pandemic hasn’t hurt her teaching style. I see though that my anger was justified but my disrespect wasn’t. It wasn’t meant for her to hear so the my move going forward is to apologize,explain my frustration and hope for the best lol",
  "id": 1,
  "comments": [
    {
      "score": 234,
      "content": "ESH. That sort of disrespect will get you nowhere. If you feel the teaching methods are incompetent, gather evidence and take it to the principal. There is no excuse for losing your temper.",
      "id": 2,
      "comments": [
        {
          "score": 49,
          "content": "Yeah... At the same time you're doing that, you could ask about alternatives you may have, like switching teachers or potentially testing out of the course. But I will also say that the lecture style at least sounds a lot like how many college professors teach class, so you're probably going to have to focus on other problems than just “she shows us videos and slides and expects us to take notes and figure out what's important for ourselves\". Like “she goes through the slides too quickly, it's really hard to keep up\", or the other busywork she gives and particularly the word search thing and how no one could figure out what they were doing.\n\nEdits: to clarify things after OP posted clarification of their own",
          "id": 3,
          "comments": [
            {
              "score": 22,
              "content": "ESH: \nCompetent college professors really don’t assign busywork word searches or coloring. This sounds like a shitty teacher; of course there are also terrible college profs, but this is not what a good government class looks like. The only absurd suggestion here is that the teacher tell them what notes to take. But teachers who read quickly off slides are mocked by those of us who actually want to teach students things.\n\nIf OP talked like that in my class even under his breath I’d boot him immediately. That’s a horrifying way to speak aloud during a class, and I’d either need a real apology or some sort of mediated disciplinary conversation. OP also obviously has no leg to stand on wanting to be told what notes to take, and needs a real attitude adjustment on that before college.\n\n(Source: am college government professor)",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 154,
      "content": "Enjoy not graduating.",
      "id": 5,
      "comments": [
        {
          "score": 33,
          "content": "This doesnt really make sense to me. Why won't op graduate? I've said worse to people in higher places than a teacher in a school and can still graduate fine. If this teacher fails OP for any reason other than failing then I'd hope that the teacher gets fired immediately.",
          "id": 6,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "This subreddit truly is the blind leading the blind. What kind of school doesn't let a kid graduate because of a rude comment?",
          "id": 7,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 110,
      "content": "ESH. Lazy teaching is bad, but telling the teacher to eat your ass is also bad. I get it we all think we’re muted and our dog barks or we swear. It happens. Let just hope nothing more comes of this",
      "id": 8,
      "comments": [
        {
          "score": -6,
          "content": "I'd argue the lazy teaching is much worse as it affects the future of all kids involved tbh. OP is right to be angry.",
          "id": 9,
          "comments": [
            {
              "score": 28,
              "content": "Angry, yes. Disrespectful, no.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 102,
      "content": "Lol at 17 you expect the teacher to tell you what to write down for the test? You're going to fail your first semester in college if you expect someone to directly tell you how to take notes. You should long since have been able to do that yourself. \n\nYTA. All I see here is your average college professor type teaching (though the word search is a little weird but eh) and you getting pissed she won't hand hold you to the point of *telling you what photo editing software to use*. Take some responsibility and figure stuff out yourself. You're 17, not 7.",
      "id": 11,
      "comments": [
        {
          "score": -53,
          "content": "it wasn’t a test it was just an assignment. i’ll give you your comment about the notes, but me and several other students were just asking how we were supposed to complete a picture of a word search on a piece of paper. she just posted that and gave us no instructions on how we were supposed to complete it and when I asked she dismissed me. I get that I was wrong for losing my temper and i should have made sure i was muted but I wont cede that she’s a shit teacher lol",
          "id": 12,
          "comments": [
            {
              "score": 31,
              "content": "She sounds like some of the profs I had in college - ambiguous instructions or no guidance on how to do stuff, sink or swim. Learning how to navigate this sort of stuff without being handheld is important.  Knowing how to learn from very different profs with very different styles is also important. \n\nHold your temper in check. If you think the teacher is doing something wrong, talk to the principal.  \n\nAnd yes, you’re a jackass in this scenario, but you’re also 17, so you’ve got time to sort things out by the time you’re ready to be released into the wild.",
              "id": 13,
              "comments": [
                {
                  "score": 8,
                  "content": "It sounds like a lot of jobs I've been given.   \nHere do this.   \nOkay, what exactly do you want from it and how do you want it done?   \nFigure it out.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Literally any editing software, could paste that shit in Word and use the tools in that. Giving a specific software limits options. How are you 17 in today's world and unable to highlight or underline a picture?",
              "id": 15,
              "comments": [
                {
                  "score": 5,
                  "content": "Right? God damn, just use MS Paint. Load the image, draw all you want on it. It's not hard.\n\nThere's so many options. But OP is too lazy to put in the effort, and too stubborn to accept the help the other student offered. Instead, she just wants to double down on the teacher being the problem.\n\nOP sounds insufferable from this post.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’m around your age. Look, I understand that you’re angry and frustrated. Although, being disrespectful isn’t it. Even if it was accidental. \n\nNext time make sure you mic is muted.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 36,
      "content": "Ngl I don't see how people think you're an asshole here. You didn't intentionally address it to her.",
      "id": 18,
      "comments": [
        {
          "score": 11,
          "content": "Yea I’m going with NTA it’s not like she was trying to talk to the teacher the teacher just happened to hear it in a moment of frustration it happens",
          "id": 19,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 16,
      "content": "ESH though I will say you only mildly - it's insanely frustrating to be given a make-work assignment (17 year olds should not be doing word searches!) and then having the teacher check out instead of even giving workable instructions.\n\nIt sounds like you didn't really intend her to hear you so it's a bit of an unfortunate outcome.\n\nThat said, obviously in college and the professional world these things are going to be taken very seriously so you need to keep an eye on whether you're muted.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA. Bad teachers deserve zilch in terms of respect because they can't even respect their jobs and their students enough to take it seriously. For the love of love, she didn't even answer the questions you and the others were asking. Just went \"lol idk\" and dismissed you all. And, it was an assignment! I don't know any decent teacher that wouldn't help answer questions on an assignment you don't understand. It's literally THEIR JOB. Take it to the higher ups. You aren't going to pass with this woman at the desk, especially if she's the type to retaliate. And, it's not like you said it directly to her intentionally; your mic was on and you weren't aware of it. Everyone saying you're the asshole or everyone sucks are clearly just pretending that's never happened to them or that they've complained about a teacher they didn't like. Newsflash: everyone's done it. They're lying if they say they haven't. Should you apologize? Yes, but I'd say only for her hearing it because you did nothing wrong by making the comment. She really doesn't sound like a good teacher at all. \"Sorry you heard that, \\[Teacher's Name\\]. I didn't know my mic was still on.\"",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA given that it was an accident that she heard you, but probably a good lesson to make sure that you don’t say those kinds of things in class from now on. I don’t know wtf the people saying “this is like a college class” are thinking — there is a difference between “giving less instruction and encouraging students to work independently” and “having no idea wtf you’re doing and making it up as you go along”. I’ve had both kinds of teachers, in high school and in college, and you can tell the difference. On the other hand, if you’re retaking a class you’ve already taken so it’s not like you’re missing out on learning important info, and if it’s public school that your family isn’t paying for, the class itself is pretty much busywork and not likely to be worth making a stink over. It sucks, but you can tough it out for a semester and look at it from the angle that at least it’s laughably easy busywork and not frustratingly hard busywork.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "[removed]",
      "id": 23,
      "comments": [
        {
          "score": 2,
          "content": "I’m guessing many students have told this teacher to eat their ass.",
          "id": 24,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": "Going that far was pretty immature :/ Thanks for the input",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "YTA\nLazy teaching is intolerable, but exhibiting a lack of respect for authority figures isn’t going to get you very far in life. Would you behave the same way if your boss gave you an unsatisfactory answer to a question? (Pro tip: if you do, your employment likely won’t last long).",
      "id": 26,
      "comments": [],
      "relation": "Attack"
    }
  ]
}