{
  "post content": "Married to my husband for just over a year now and I think we have an awesome thing going. He is in the military and is currently deployed overseas which really sucks since it's the first one I've been through but it's what I signed up for. So to be totally upfront, I guess like a lot of guys, my husbands number one fantasy is to be with two girls. We've \"pillow talked\" about it a lot and he has said clearly \"if you ever get the chance to fuck another girl, do it, even if I'm not there.\" \n\nI was at a party on Saturday and after some drinks I started dancing with just about everyone but a friend's sister really got aggressive with me and before I even really knew what was happening she had her hands literally all over me. At first I was playfully dancing back but it was one of those moments where I knew in my head that if I didn't leave something was going to go down and I've never had that with a girl before. She asked me if I wanted to go for a walk and after some heavy kissing in a park (where all I thought of how my husband would love this) next thing I knew we were in an uber heading for my house. I asked the driver to take a picture of me kissing her with my hand on her bare boob which he gladly did. So we got to our house and literally yada, yada, yada and in the morning she left with a kiss and if I ever wanted to do it again to call her. I told her maybe but wanted to make sure she knew I was married, she said she loved married women. \n\n\nI sent the picture to my husband and instead of being excited he texted back \"what the fuck is this?\" that pissed me off and was like \"what do you mean? isn't It obvious?\" then he asked who took the pic and who's car was I in so I thought maybe that was his issue that he though there was another guy there and I wasn't being safe, when I told him it was the uber driver he text back \"holy fucking shit Sam you cheated on me!\" He pretty much ghosted me all day yesterday and I was sick to my stomach.\nHe skyped me later that night and we got in a huge screaming match with him saying over and over that I cheated. I tried explaining to him that while I enjoyed it, I really did it for him and his fantasy and that I couldn't wait to describe it to him in detail and I said what about ALL the times he told me things like \"if you can ever fuck another girl, do it?\" he responded that I was an idiot for not understanding that was just pillow talk. I asked him if he would have been ok had he been there and to my TOTAL surprise he said no that I should know that monogamy is monogamy. I told him in that case I was really sorry and I misunderstood him. He said well my misunderstanding led to a situation he doesn't know how to deal with and he needs some time to sort things out.\n\nAm I the asshole here? I swear to god if he had never said those words, I wouldn't have done this. I'm not really a lesbian (no insult to lesbians at all) and while I enjoyed it, this wasn't something I was itching to do.",
  "id": 1,
  "comments": [
    {
      "score": 59,
      "content": "ESH.  You were both monumentally stupid.  \n\nYour husband should not have told you to sleep with another woman if he didn't actually want it to happen.  And you shouldn't have done it on the basis of pillow talk without confirming he was okay with it.  Adding non-monogamy to a relationship without it seriously fucking things up is something that takes a ton of discussion and careful planning.  You two did none of that.  It's going to take some serious effort, from both of you, to repair what you fucked up with your carelessness.",
      "id": 2,
      "comments": [
        {
          "score": 29,
          "content": "Hijacking this top comment to say that I’m pretty sure that this is a shitpost. This is eerily similar to a post made awhile back where OP was deemed TA. What really tipped me off is that the usernames are somewhat similar:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/b53j2u/aita_for_hooking_up_with_another_girl_at_least_in/",
          "id": 3,
          "comments": [
            {
              "score": 5,
              "content": "Thank-you, I knew I’d seen it before.",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "YTA - this is such a shitpost",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "[removed]",
          "id": 6,
          "comments": [
            {
              "score": 8,
              "content": "Ironically, he's the one who understood the rule correctly and you're the one who tried (and failed) to get around the ban.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "\nYour comment has been removed for being unhelpful and offtopic. Please report posts that you believe violate our rules and do not comment on them. \n\n#**[Follow this magical link for more information.](https://www.reddit.com/r/AmItheAsshole/comments/b9d9xl/meta_blitzkrieg_shp/)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
              "id": 8,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -4,
          "content": "YTA for ignore the rules.",
          "id": 9,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "ESH - him for not being honest with himself/you, and you thinking you could really act on such things without verification.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "YTA, sorry OP. I think if this had been out in the open and talked about while not just \"pillow talk\" you might have a case but all sorts of crazy stuff is said in the throes of passion that we don't want to act on. I don't think this is like a divorce worthy offense because you were confused but you guys really need to talk this out with a neutral party.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA - he literally gave you permission to do it.  He probably didn’t expect it to actually ever happen.   If he wouldn’t have given a blanket OK in the first place, nothing would have ever happened.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA.\n\nHe said it to you multiple times. \n\nBut know that just because you aren't the asshole doesn't mean he will ever see it your way.  In his mind he thinks you should just \"know\" what he meant.  He isn't likely to get over it. \n\nBeing right doesn't mean it works well for you.  \n\nYou two need to have a big discussion over what consent is and to be clear with intentions.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "ESH I agree he gave you the green light by telling you multiple times that you should sleep with another woman even if he wasn’t there. But you also could have asked him about it in a setting that wasn’t pillow talk before engaging in that sort of thing.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "EIH - Everyone’s an Idiot Here",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "YTA. Opening up a relationship to any degree entails having a mighty long, mighty in depth conversation, not just \"pillow talk\". You should have gone back to your husband to talk about this seriously before making any moves.",
      "id": 16,
      "comments": [
        {
          "score": 6,
          "content": "You can't just tell your wife \"yeah fuck as many women you want\" then complain when she does it.",
          "id": 17,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "Ooof, this is a hot mess. I'm going ESH, for several reasons. \n\nFirst: You should not have put the Uber driver in that position. I don't care that you ladies were cool with it and apparently so was the driver: your husband could report it to Uber and that is the kind of thing that gets drivers fired. NOT COOL. \n\nSecond: I get that you didn't plan on having sex with this woman (or any woman) when you went out, so this wasn't premeditated in any way. And yes, your husband's \"pillow talk\" statements were not at all vague. BUT, as soon as you knew where things were heading, you should have shut the lady down and, in a sober and non-sexually charged situation, discussed this with your husband before moving forward. THEN you could move forward (or not) once you were both on the same page. \n\nBecause you did cheat on him, even though your motives were innocent. He obviously never thought his hypothetical scenario would ever come to pass. You don't mention telling him you'd be DTF another woman, either. \n\nFurther more and from a wholly practical angle: what if you got an STD/STI? I'm not implying anything about this woman, only that disease prevention changes from heterosexual to homosexual (to polysexual) intercourse and you likely aren't familiar enough with it to be fully informed about the appropriate safety precautions. Yet another reason to have worked out all the details ahead of time. \n\nYou're in a shitty situation, OP. Best of luck to you in finding a happy resolution.",
      "id": 18,
      "comments": [],
      "relation": "No"
    }
  ]
}