{
  "post content": "My boyfriend and I (both 24) live in a tiny 1bedroom 1bathroom apartment in the middle of the city. We moved in a month ago. \n\nA few days after we moved in bf informed me that his dad would be staying for an extended weekend. I was less than thrilled because as I said the apartment is tiny and his dad and I have very different ideas of cleanliness. I also would have preferred to be asked instead of informed. I let bf know but he said it was set and I'd have to deal with it.\nI decided that I won't be staying home that weekend as I needed privacy because I had a research proposal due the next week. So I booked a hotel room in the city. Nothing too fancy but also not a shit hole. Before I did this I told bf that I was very unhappy with how he handled it and let him know about the hotel. He seemed pleased with that. \n\nFil left yesterday and I went back home and as expected the apartment looked horrible. Piss all over the toilet seat, questionable stuff in the sink, spew next to the toilet and lots of beer cans all over the place. Bf was also clearly hungover. \n\nBf and I have a joint account for rent, groceries and other joint expenses but other than that we keep our finances separate. \nToday bf realised that I used our joint account to pay for the hotel room. He was furious. I told him that I had to leave so he and his dad could party and since I pay half the rent to the apartment that I was basically forced to leave I think it was fair for me to use the joint account.\n\nHe disagrees.",
  "id": 1,
  "comments": [
    {
      "score": 6550,
      "content": "NTA. And I’d be using money from that account for a cleaning service.",
      "id": 2,
      "comments": [
        {
          "score": 1362,
          "content": "NTA.  He didn’t let you know ahead of time, then his dad messed up the place.  He should be helping you clean, and it wouldn’t be out of line to hire someone to come in and clean the place.   Maybe that would get the message across.",
          "id": 3,
          "comments": [
            {
              "score": 1912,
              "content": "Agreed on all points except - he shouldn't be helping her clean. He should be cleaning, period.",
              "id": 4,
              "comments": [
                {
                  "score": 818,
                  "content": "Honestly it's even past that point. He should be cleaning and apologizing. Someone threw up and he was just like \"ah, oh well, wait for OP.\" That should've been cleaned when it happened, and at the very very very least, should've been cleaned after FIL left but before OP came home",
                  "id": 5,
                  "comments": [
                    {
                      "score": 303,
                      "content": "NTA, and also he apparently has no respect for you. He’ll keep treating you like a maid, and it will only get worse as time goes on. It’s insulting that he left that shitsty for you to see, and way worse if he expected you to clean it. You may want to rethink some life choices.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Seriously dude who just LEAVES vomit for an extended period of time? I had to mop my front bathroom last night because my kid vomited. I had a 103 temperature and the last thing I wanted to do was clean up a toilet and floor of vomit but the only other choice was to leave it and still have to use it covered in vomit. So basically not an option at all. The fact they left the vomit and still used the bathroom, just holy hell man that’s some next level gross.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "this",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "Why should OP help clean? It’s not their mess in the slightest.",
              "id": 9,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 143,
              "content": "“He should be helping you clean.” Why? It’s not the 1950s, he can clean up his own goddamn mess. Why does the woman have to be responsible for it?",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 100,
              "content": "No, OP shouldn't be lifting a finger to clean at ALL. Agreed on the rest though",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "NTA Yeah any chance of op being in wrong went out the window once that happend, with how bad/messy the fil was. Maybe if it was clean when they got back they're be be no A hole or the bf would be a little bit of a A hole but op's concerns were true as they wrecked the place.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Completely agree. SO needs to do the cleaning himself, or OP can hire a maid out of the joint account. Also, father should stay at the hotel next time. SO should clear with OP before inviting an overnight guest, even if it's his father. \n\nSO sounds massively inconsiderate and like he lacks basic cooporation skills. OP also needs to have a heart-to-heart with him about what living together and having a partnership actually means",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She shouldn't be cleaning anything at all. The two who trashed the place should have done so before she got home since they felt the need to be so messy.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 451,
          "content": "Moving service*",
          "id": 15,
          "comments": [
            {
              "score": 234,
              "content": "Yes! Dating is an application for a life long partner. This boyfriend failed with his demands and assumptions. It says a lot about him. \n\nAlthough they've just moved in together so if he pulls in his cohesiveness maybe they can work it out.",
              "id": 16,
              "comments": [
                {
                  "score": 88,
                  "content": "[removed]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 9,
                      "content": "They have been living together for 2 years",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 146,
              "content": "I normally hate when people immediately jump to the break up solution, but in this case it seems like a solid solution. He clearly doesn't respect OP. He put his wishes before hers and then expects her to be a maid. OP if you see this, you are worth so much more than this. Don't buy what he's selling and find someone who treats you like you deserve to be treated.",
              "id": 19,
              "comments": [
                {
                  "score": 98,
                  "content": "Cohabitation is a real big, fast eye-opener. The sole act of informing OP that his dad was going to be staying with them a few days after moving in is a huge red flag. Throw in getting upset when confronted and doubling down, then being totally cool with your partner feeling like they need to leave for a hotel, then trashing your brand new apartment and not cleaning it up before said partner comes back? Yeah, I'm getting out of that lease real quick. Maybe OP is lucky and only one of them is on the lease.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 21,
                      "content": "OP has mentioned a few times that they have been living together for two years.. this keeps getting lost because the post sounds like they just moved in together. I think that they just moved to a new place, but have been living together for awhile.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 237,
          "content": "NTA, and I second this.  Do NOT lift a finger to clean up their filth.  If he refuses to clean it, hire a service and use the joint account.\n\nHonestly, I'd also reconsider living with someone so inconsiderate.",
          "id": 22,
          "comments": [
            {
              "score": 16,
              "content": "Yeah I definitely agree with your response. NTA in this situation and she should not be cleaning up after the man children.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "The  cleaning fee should come from the boyfriend's personal account.",
          "id": 24,
          "comments": [
            {
              "score": 7,
              "content": "lol, yes!",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "NTA - no argument there, if I was OP, seeing as they have separate finances, bf and his dad trashed the place, by should pay for a cleaner out of his money",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "NTA and I'd be using money from that account for a new deposit... In my own place. This boyfriend sounds like an inconsiderate asshole, and I would bet my paycheck this will happen again any time the dad wants to visit. Boyfriend didn't value OP enough to discuss ahead of time and when told she was unhappy he told her to deal with it. She complies and leaves, he gets smashed and trashes the place with dad. No respect. I wouldn't be sticking around for the next time.",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "If anything you should have paid from his account. He got his dad in without your permission. Why do you have to pay for half of your room?",
          "id": 28,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "From his half too, I’d be making a point of telling him he needs to make an extra payment",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "NTA Second using that account for a cleaning service. That's disgusting!",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That was my first thought, too. If BF just tells OP to deal with what HE wants but wants to control what SHE gets, this long weekend might have been a very good preview of things to come. OP, please don't get married or pregnant with this BF. And keep your finances separate and BF unable to touch them.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2660,
      "content": "NTA and I would be reconsidering living with someone so inconsiderate",
      "id": 32,
      "comments": [
        {
          "score": 334,
          "content": "This!!! Also, his father may be him in a few years. Be careful OP",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "This! I know people on this sub are quick to judge... but do you want that guy as a father in law? Do you want to marry someone who behaves so rudely and entitled? Or who has such a different idea of cleanliness and respect? I think I’d be reconsidering this relationship if it were me.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Seriously! \n\nMy partner asks me, every single time, if someone can come over or stay the night. Even when he's 100% sure I'd say yes. It's just respectful.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I feel like every thread Reddit recommends leaving your BF/GF... But tbh it seems like only the worst cases post here on AITA so maybe it's justified.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Right? She says they JUST moved in together a month ago and that same week he was like LOL I invited my gross Dad to stay with us without consulting you.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -168,
          "content": "Never ceases to amaze me how quickly this subreddit recommends leaving your SO. Not defending his actions... just saying.",
          "id": 38,
          "comments": [
            {
              "score": 265,
              "content": "If someone doesn't consider your feelings now, they probably won't consider them later. People hardly change and with 7+ billion people in the world, there's not much reason to stay when you can find someone else.",
              "id": 39,
              "comments": [
                {
                  "score": -72,
                  "content": "It may be an old fashioned mentality, but I believe that if something you care about is broken, you should try to fix it before you replace it. We also know nothing about these two people outside of this single situation.\n\nedit: I suppose I shouldn't generalize and that this response is too vague... what I mean is that if your relationship is troubled, it is worth working on. I don't think people should blindly stay in unhealthy relationships, and I don't think major flaws should be brushed under the rug for the sake of old timey relationship norms. I'm just saying that we don't know enough about this couple outside of this one incident to pass such harsh judgement on their compatibility.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 96,
                      "content": "You can’t fix people.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 64,
                      "content": "Your old fashioned mentality is the reason why wives were popping valium like Pez candy back in the 50s, 60s, and 70s.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "You shouldn’t be with who a person could be, but who they currently are.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Certain issues can be fixed or worked through.\n\nOthers are not a partner's responsibility.\n\nCertain ingrained characteristics of a person are not going to change without professional help, and being in a relationship means being a partner, not a social worker.\n\nIt's up to every individual to decide whether these are issues that can and should be worked through, or if they are not.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "People, especially women, are not rehabilitation clinics. It’s not on them to fix somebody. And sometimes, leaving them ends up being the kick in the rear they need to realize that they need to change.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I agree.  Love is not just a feeling; it is a commitment.  If you just jump ship the moment your feelings are hurt you are never going to have a partner that lasts.  I have hurt my husband's feelings.  He has hurt mine.  We worked through it.  This couple needs to work through this.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 77,
              "content": "I mean, did you skip this part:\n\n> Today bf realised that I used our joint account to pay for the hotel room. **He was furious**. \n\nYou shouldn't leave someone if they were inconsiderate once, no one is saying that. But if you are being inconsiderate, refuse to understand why your girl may be upset and tell her to deal with your father coming in and she had no say in it, then when she pays for a hotel room from a joint account is furious with you? That's a whole different ballgame. That's the sign of a bad relationship\n\nAnyone normal here would, at the very least, offer to pay for the hotel room",
              "id": 47,
              "comments": [
                {
                  "score": 48,
                  "content": "Don't forget leaving piss, vomit and beer all over the apartment for her to clean up.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "To be be fair, I don't think him saying to rethink her situation is the same as leaving her partner. I didn't take it as that at least.",
              "id": 49,
              "comments": [
                {
                  "score": 0,
                  "content": "Fair enough",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "Someone who leaves his father’s vomit for his partner to clean is probably missing the basic requirements to be a decent partner.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "If this what happened after only living one month together... Yep, I would be reconsidering stuff. It doesn't mean OP has to leave the guy right now, but her bf's attitude is a red flag.\n\nIt's not just that he invited his dad for an extended week-end without warning OP. It's his attitude in this whole scenario. He was dismissive of OP from start to finish. If after one month of living with someone, that person has no problem inviting someone else into my home for several nights, not bothering to ask me, telling me to \"deal with it\" when I express my issues with this, offering no solution or compromise, getting furious for paying half of a hotel room after basically forcing me out of my home, and not trying to clean up when that was one of my issues with this house guest... Yep, I would be reconsidering things. Because I don't want this to become my life. \n\nAnd if the boyfriend is not apologetic, sees nothing wrong with how he treated this whole situation and OP, doesn't offer to clean up or pay for it, and is still mad about the hotel bill... I would be out of there.\n\n(This coming from someone who has been through a hell of a ride the past couple of years because of my SO, so I know about commitment and not leaving after things get rough. If my SO had the bf's attitude, it would have made my life much easier in a way.)",
              "id": 52,
              "comments": [
                {
                  "score": 1,
                  "content": "I suppose I have resorted to backpedaling because plenty of people are making good counter-points... and I have never disagreed with the judgement that OP's bf is TA. I just think it's an ugly trend that people are always suggesting that relationships must end based on a trivial amount of information.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You should probably have picked someone worth defending. This guy isn’t it.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Not living with someone and leaving them aren't necessarily the same thing.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 56,
              "comments": [
                {
                  "score": 1,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Well, this is AITA, not \"Check out my perfect SO\"\n\nSo naturally we see a disproportionate amount of red flag behavior in relationships (romantic or not).\n\nCourse sometimes people are a bit quick here, but it's only natural that we see such reactions a lot more than other subs. \nAlso, OPs BF behaved like TA, no doubt. And such kind of problems, so quick after moving in together rarely end well. They tend to get worse and escalate. Sure, it's possible that they figure it out, but it's serious red flag behavior and from experiance these kind of issues rarely end up with a satisfactionary solution.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I agree. These people are all fucked. They seem to think they know EVERYTHING about both people. They know as much as I and you do.\n\nYes. She isn't the asshole. But leaving someone over this? Get a fucking grip people.",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1643,
      "content": "NTA he was aware of the hotel and was happy to have you out, that's all I need as far as the hotel charge goes. Then he trashed the place on top of this? Make him clean it or use his own money to hire someone to clean.",
      "id": 60,
      "comments": [
        {
          "score": 53,
          "content": "I agree that it's a bill that should be shared but I lean towards ESH because you should discuss every purchase (that falls outside of the usual bills) prior to spending joint money.\n\n\nThat being said, him inviting a guest into a shared space without agreeing it with her beforehand is indicative of a really inconsiderate person whereas hers is more of a faux pas.",
          "id": 61,
          "comments": [
            {
              "score": 288,
              "content": "Discuss or tell? He didn't discuss with her if his dad could come over, he told her. She should have told him she was using the shared account for the hotel room, yes, but imo she was in her roght not to ask permission. NTA",
              "id": 62,
              "comments": [
                {
                  "score": -16,
                  "content": "Discuss. Being a dick to someone because they were a dick to you is not excusable in the grown up adult world. Be petty if you want but don't suggest other people do the same. It's an old adage but it is relevant: Two wrongs don't make a right.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 84,
                      "content": "I do agree with you on the 2 wrongs don't make a right. However in this situation I would take it as a given I would be using the shared account, as we share the rent too. I don't think this should be a conversation as he already agreed that she would book a hotel room.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Idk, he knew she was going to a hotel, I guess she didn't specify that she was using the joint account but I still don't think he can be upset about it, since she only did that because he invited a guest over without any prior notice (and again, he knew she was going to a hotel, he just didn't realize he was helping pay for it). So while I could see him being maybe a little surprised she used the joint account, he really doesn't have a leg to stand on and is still clearly TA",
              "id": 65,
              "comments": [
                {
                  "score": 7,
                  "content": "why couldn't the dad have just gotten a hotel? he's an adult and one bedroom apartment is small.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "He invited his dad to stay in their one-bedroom apartment without consulting her.  He then trashed said apartment.  It seems like her boyfriend only cares about the sanctity of sharing when it suits him.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "BF created a problem in a joint space. OP solved the problem with the joint account. BF didn't ask first. OP didn't ask first. BF abused. OP defended herself. The non-equality left to be dealt with is that BF needs to clean up after his party, by himself or at his own expense.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 633,
      "content": "NTA but it does sound like you two need a serious talk.",
      "id": 69,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 565,
      "content": "ESH - its both your money, you need to communicate when spending it on something you normally wouldn't.",
      "id": 70,
      "comments": [
        {
          "score": 372,
          "content": "This subredit bugs me. Of course it's ESH! You shouldn't spend hundreds of dollars of shared money without talking about it. Doubtless BF and his dad are awful, but this subredit doesn't seem to realise that just because something happens in retaliation, it doesn't prevent you from being the AH.",
          "id": 71,
          "comments": [
            {
              "score": 175,
              "content": ">You shouldn't spend hundreds of dollars of shared money without talking about it. \n\nSeems you missed/ignored the part in the post where OP brought up the idea of the hotel and BF was ok with it _before_ she booked the room.",
              "id": 72,
              "comments": [
                {
                  "score": 65,
                  "content": "Except that he clearly assumed that OP was using their personal money. So it's still very much a valid point...",
                  "id": 73,
                  "comments": [
                    {
                      "score": 118,
                      "content": "Ahaha yeah no. His assumption does not make her an asshole.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Even if I agree with you, then he failed at communication as well. Assuming is not communicating.  Personally I would assume that he should pay 100% of the hotel, since his guest caused the problem.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 132,
              "content": "yup this subreddit is always encouraging people to be selfish and acts like if someone has the moral upper hand then they get carte blanche to do anything they want\n\nAlso never seems to recognize how having a calm conversation with someone can solve a majority of the conflicts here (as opposed to just writing people off as the AH)",
              "id": 76,
              "comments": [
                {
                  "score": 14,
                  "content": "[deleted]",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Yes this, i was reading this wondering what was bugging me about so many of these comments \n\nESH",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "It’s always funny to see that the people saying this are the same ones always telling the OP to be a pushover",
                  "id": 79,
                  "comments": [
                    {
                      "score": 20,
                      "content": "If you think trying to have a conversation with someone makes you a pushover, then I'm sorry friend, but odds are good you're an asshole 👉 🍑.\n\nCaving, paying back the money and pretending everything is fine is being a pushover.\n\nHaving a reasonable conversation is being an adult.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "The OP was forced out of her home by the bf who expected her to user her own money to stay in the hotel he essentially forced her to stay in.. They would have saved this money if he'd had his dad stay in the hotel. The other option could be she pay for the hotel out of her own money but subtract it from what she would put in the joint account.",
              "id": 81,
              "comments": [
                {
                  "score": -1,
                  "content": "[deleted]",
                  "id": 82,
                  "comments": [
                    {
                      "score": 39,
                      "content": "She was forced out of her home if she said \"I can't live with this man here\" and her bf said \"too bad.\"",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My dude, if someone is coming over and pissing all over your bathroom and puking by (not in) the toilet... I don't think it's reasonable to expect anyone to live around and especially not work around that. That's no choice at all. She could have gone to the library, sure, but then come home to two completely wasted adult children puking in her bathroom and getting no sleep or rest? Yeah, no.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "And he shouldn't have left piss and vomit for her to clean up.",
              "id": 85,
              "comments": [
                {
                  "score": 15,
                  "content": "Which is why the correct answer is ESH. I'm glad we agree!",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Honestly, I think there's a lack of clarity on AITA that is exacerbating the problem here, which is that there's not a clear distinction between ESH and NTA when the other party is clearly the bigger asshole.  If someone's 99% the asshole and the other person is 1%, probably just about everyone would agree that NTA is warranted.  And vice versa if someone is 51% the asshole.  In between those, it's much more nebulous, and it wouldn't surprise me to find out that people are internally inconsistent based on which party they identify with more.\n\nI think just about everyone's on the same page that the boyfriend is the asshole, and probably that not communicating about the joint account wasn't the best way of handling it, but without a clear standard for how much parity there needs to be between assholes for it to be ESH, it's pretty hard IMHO to make a strong argument one way or the other.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "This sub is so insanely lost when it comes to actual moral judgement. I swear that 80% of the voters have absolutely no idea what a functioning relationship looks like.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I normally agree that retaliation makes someone an asshole, but I don't see this as retaliation. She didn't book a hotel as revenge, she needed a place to stay and was essentially kicked out of her home for the weekend.   Paying for the hotel is frankly more his expense than hers. His guest is the one that required it. It's not revenge, it's just a necessary expense.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Its grown too big for its own good. Life isn’t about constantly being technically correct and sticking it to everybody.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "I think this qualifies as a Justified asshole.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "Of course its ESH. But in this sub it all depends on how much you can relate to the person.",
              "id": 92,
              "comments": [
                {
                  "score": 39,
                  "content": "Except when people, such as those you're plying to, ignore the fact that OP stated in their post that they got approval from the BF _before booking the room_.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Approval to get a room, not to spend their money to do it.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Except it's for _rent_ due a need for work on a _work presentation_ after being displaced by the bf's father's visit.\n\nDid you not read how shitty a state the apartment was in when she went back? She had concern about getting work done, you know, the kind that brings in money for their collective rent; and it was entirely justified.",
          "id": 95,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 96,
              "comments": [
                {
                  "score": 2,
                  "content": ">My wasn't for rent. \n\nIt was for an equivalent. \n\n>She was still able to stay in the apartment, but chose not to.\n\nSo you _are_ going to ignore the reason(s) and justification(s) OP provided and which I have explained? \n\n>If she needed quiet, there are plenty of quiet places like the library, starbucks, etc.\n\nIt would seem that you have never had to work on a research proposal or the like on which you depend for your income. That etc? That's a hotel room.",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "\"I'm angry that my husband unilaterally made an decision that impacted me without consultation, so I made him pay for half my hotel room without consulting with him. AITA?\"\n\nThey deserve each other.",
          "id": 98,
          "comments": [
            {
              "score": 10,
              "content": "You could also say “I’m angry my husband unilaterally made a decision that impacted me without consultation, so I unilaterally made a decision that impacted him without consulting him.”\n\nYeah and you’re absolutely right.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "someone who made a decision without asking is exactly as bad as her partner who did the same thing while also trashing the house with their uninvited guest and leaving vomit next to the toilet until OP comes home to clean it up?",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "It's both of their apartment, too, but that clearly never crossed her boyfriend's mind.  NTA.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "She did.  She told him she was getting the room.   It's due to the boyfriend's lack of planning so obviously he would be on the hook for some of it.",
          "id": 102,
          "comments": [
            {
              "score": 5,
              "content": "Think you've missed the communication part of ops comment there lol",
              "id": 103,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -12,
          "content": "Seriously it was HER Choice to vacate the appointment so she can pay out of HER discretionary money to cover it. I don’t just decide to spend money that belongs to both me and my boyfriends money on stuff for just me because that’s not how this works.",
          "id": 104,
          "comments": [
            {
              "score": 9,
              "content": "She was forced to vacate because her boyfriend brought in a guest without even discussing it first.",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 286,
      "content": "Definitely NTA. The reason you needed the room in the first place was because of him. He didn't bother to consider you when he invited his father, so it shouldn't have been a surprise when you didn't tell him about using the account- that should've been a given though. You're not the asshole, and you were perfectly within reason to use the joint account. It's not like you just did it out of the blue to get a break from your bf- I wouldn't blame you for it.",
      "id": 106,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 202,
      "content": "ESH - as is so often the case in this sub, this problem could easily have been solved if you'd both COMMUNICATED. Tell him in advance that the hotel cost will come out of the joint account, or that his father can pay for it if he has a problem with that. Your bf should obviously have consulted you about a guest staying in your house that was going to put you out this much.\n\nOn a separate note, if you were my friend I'd tell you to dump his ass, neither he nor his father respects you or your home. But it's your life.",
      "id": 107,
      "comments": [
        {
          "score": 48,
          "content": "Hell no.\n\nIt's a rent-type situation, so it makes sense for it to come out of the joint account. It's also a situation created _solely_ by the brother's shitbird father who would think she's \"a piece of work\" if they put him up in a hotel for his visit.",
          "id": 108,
          "comments": [
            {
              "score": 41,
              "content": "I agree it makes sense, but you don't just decide that without at least telling the other person. I say this as someone in a rent-type situation with my boyfriend, who has a very similar financial set-up (without the douche-canoe FIL). It's the keeping it from him that I think has contributed to the problem.",
              "id": 109,
              "comments": [
                {
                  "score": 25,
                  "content": "She didn't deliberately 'keep it from him'. \n\nThey agreed that the money was going to be spent. That she used the joint account for (essentially) rent isn't in question. \n\nThere's no justified rationale behind objecting to the use of the joint account for _rent_; and even if there were it wouldn't make her the asshole for using that account for _rent_, that being the purpose of the account.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Mate, I'm pretty sure we're on the same side here. I agree the money should have come from the joint account. I agree that the bf is an asshole and that his objections are irrational, I just happen to think that the argument could have been avoided if she'd let him know that that was the deal beforehanf. Or maybe they'd have had a big row, she'd have realised what an arse her bf is and broken up with him...",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 173,
      "content": "Why didn’t you just get a room for the dad instead?",
      "id": 112,
      "comments": [
        {
          "score": 251,
          "content": "That's what I wanted but apparently FIL would think I'm a piece of work",
          "id": 113,
          "comments": [
            {
              "score": 121,
              "content": "So BF wants to tiptoe around his dad's feelings so his dad isn't offended about being banished from the apartment; and he won't tell his dad to clean up after himself. But he's not so concerned about your feelings at being sent away, nor does he feel bad about leaving you to clean up after your dad. \n\nThey should both be more concerned about keeping your good opinion.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "Is he your FIL or your boyfriends dad... I’m so confused",
              "id": 115,
              "comments": [
                {
                  "score": 22,
                  "content": "Both I suppose. We're not married but we've been together for 3 years so we're de facto.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 366,
                      "content": "Well, it's not de facto, at all, and if I were you I'd run for the hills while you still can.  Bf is totally inconsiderate, to an absurd degree, and his father is a disgusting pig.   So many nopes.",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Break up with him.",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "(Aussie here) I wouldn't rely on the term de facto too heavily, or consider it as a golden ticket as far as shared accounts go. I once asked my work's legal counsel for advice about whether I could call my partner my de facto spouse in a legal form (we've been living together for 4+ years), and even they said that it's a very confusing and undefined part of the law. \n\nMy takeaway is that it's a term that is used to define your relationship if you guys are in the family court looking at dividing BIG assets like a shared house, or if you were raising children together. Other than that, the term doesn't really have any power or influence over everyday life.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -23,
                      "content": "No, no you're not. \n\nYour BF is prioritizing his dad over you and your finances. That's a red flag, and something you two need to talk about.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 74,
              "content": "YIKES. Guess we know where BF learned from.\n\nDo you really want this kind of men in your life?",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "I give this relationship 6 months.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 95,
      "content": "NTA. Why are you with this man?",
      "id": 123,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA he should have offered to pay for the hotel for two nights so he could recover from his hangover and have the apartment cleaned before you came home. You need to work on communication.",
      "id": 124,
      "comments": [],
      "relation": "Support"
    }
  ]
}