{
  "post content": "I am the father of a one year old toddler. Recently, she started teething, as her molars have started to come in. First, it was the top ones for about a week, then we had a week’s break, and now the bottom ones are coming in. It’s clearly causing my daughter a lot of pain, especially at night. Before she was a good sleeper, but now it’s been rough. She’s been waking up around 1am and then 3am daily, screaming with her little fingers in her mouth. My wife and I have tried comforting her, bringing her in our bed (she sleeps in our room anyway and her crib is next to our bed, but normally she likes to sleep cuddled up when she’s uncomfortable), we’ve even given her baby Motrin to help with the pain but she still screams for about 10-20 minutes each time until we are able to settle her. It’s shrill and it sucks, but there’s not much we can do beyond what we are already doing. \n\nWe live on the ground floor of a new condo building. It’s made of heavy concrete and decently sound proofed, but not perfect. Above us lives a single woman in her late 20s / early 30s. This is an expensive part of town in a new building, so we can assume shes decently monied. She also keeps her balcony door open all day and night that faces into our courtyard. She has been “punishing” us during the day by blasting loud music directly into our unit by putting a stereo next to her balcony. We are on the ground floor and have a fully enclosed courtyard so it vibrates around. She’s got great music taste, and my daughter will dance to it all day long. So while my wife hates her intention, I think it’s worked out just fine… until now… \n\nLast night she came barging down at 3am and rang our bell 4 times while we were trying to settle our daughter. Motrin works for about 8 hours, so by 3am we have to give her another dose and wait through the cries, cradling her for 15-20 minutes for it to kick in again. My wife (a strong tempered petite woman, amplified by her first year of motherhood) wanted to go fight her then and there, but I said let’s just concentrate on settling the baby and ignore her. I also didn’t want to make the baby any more upset than she already was. So yeh, I just let her fume outside my door at 3am. AITA?\n\nUPDATE: I delivered a small care package to her door with a long letter and a bottle of wine and chocolates. She was not home so I put it next to the door. We are only here for a couple months (temp rental until we finish construction) but I’d rather offer an olive branch than see all the pettiness continue. Yes, it sucks to be woken up. Yes, it’s a shared building. Yes, people throw parties here until 3am on the weekends. Yes, babies cry and we try our best. For those who live in very big cities— mine has 22 million— this is what you experience. I’m listening to loud mariachi music from the neighbour across the way right now. ",
  "id": 1,
  "comments": [
    {
      "score": 10419,
      "content": "ESH. You comments about her are awful (especially that \"daddy\" is paying her way.) Her response with the loud music is childish.\n\nIs there some reason why you can't move the doses of Motrin so that it works all night? Maybe a dose at 11:00 pm? That would allow all of you to get a much needed night's sleep. Also, I think they make cold teething rings to help with pain. \n\nTry harder...for you, your child, and you neighbor.",
      "id": 2,
      "comments": [
        {
          "score": 5028,
          "content": "also go to a doctor how is the baby screaming loud enough to disrupt someone elses life in a from his words \"pretty sound proof\" building\n\nedit: yes ive been around babies yes i raised kids no they werent easy which is why i also know screaming can strain  and youre suppose to be ahead of the pain  if youre having an issue go to a doctor its not shameful if 1 doctor wont help find a new one. also i doubt neighbor has balcony open 24/7 but i guess that depends on what country they live in shes a women and alone no women is that stupid to have her door open wide at 1-3 am\n\n&#x200B;\n\nedit: yes i get op is doing his bes THATS GOOD HES A FIRST TIME PARENT GIVING ADVICE IS OK. his olive branch is kind. now my vote is NTA and well see how it goes from here",
          "id": 3,
          "comments": [
            {
              "score": 5376,
              "content": "And doctors tell you to stay ahead of the pain. They shouldn't wait until the kid is screaming to finally give her pain meds. They know she's teething.  Why are they letting her reach that level of agony?",
              "id": 4,
              "comments": [
                {
                  "score": 5797,
                  "content": "Unfortunately babies don’t tend to give you advance notice on when they’ve going to scream. Giving Calpol round the clock because you think they might need it is not something most people would be happy with",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4012,
                      "content": "Exactly this! \n\nIf I could schedule my daughters teething pain I would. Not just for my sanity but for hers as well\n\nWho seriously thinks parents are letting their children be in pain on purpose, even if we acknowledge the self intentions of allowing themselves to sleep through the night \n\nThere’s 0 motivation to allowing a baby to wake up in the middle of the night to cry",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 264,
                      "content": "Especially because of the terrible damage acetaminophen can do to the liver.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 120,
                      "content": "Okay, but since when is this \"give them drugs or give up?! I've never known a baby who just screamed through teething. What happened to frozen teething rings and teething gel and all the other stuff every baby I've known in my entire life has been treated with?",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 74,
                      "content": "[deleted]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "In addition, some kids just scream for any level of pain/discomfort because it's just so new and different for them. For a kid that's not had a lot of suffering so far, every pain they do have is one of the worst things to ever happen in their entire life so far, so they respond with a 10. That's not even including just individual personality stuff.\n\nI have twins. They each had their own things they'd scream about as babies. One was very clingy and would cry if not held enough or he was left alone for 10 seconds. The other was very chill, he very much enjoyed being held and cuddled but was also fine not to be and wouldn't cry or coming crawling after if you left the room to go pee or something. However, he did have a very low threshold for pain tolerance, so any head bump or accidental scratch or whatever had him scream-crying. When he got his his first vaccinations, I had to hold him and comfort him for 10 minutes as he scream-cried, calmed down, then scream-cried again, meanwhile his brother had calmed down within 20 seconds of his own vaccination.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Motrin every 6 hours and Tylenol every 4 hrs as needed .... thats what every dr I've ever had for my kids said. Why make everyone  suffer. Till them teeth pop in she hurts",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This! Even giving Calpol to my daughter before bed when she is teething, she will still wake up in the middle of the night screaming in pain. You cannot predict it.\nIt's a baby and it's teething! \nWe all know it hurts as hell...",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 650,
                  "content": "Never wake a sleeping baby lol they have her on a schedule if they woke her up ‘before’ she’d just be wailing at 2 and likely harder to put down",
                  "id": 13,
                  "comments": [
                    {
                      "score": 800,
                      "content": "Yeah, waking to give medicine is going to result in a helluva lot more screaming. I feel like none of the commentary have kids, lol.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 237,
                  "content": "Ehhhh... to an extent yes, but they'll also tell you not to wake the baby to give them more meds, just give them as soon as the baby wakes.\n\nYou don't wake a sleeping baby unless you *absolutely* have to, and Tylenol isn't an absolute need.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 129,
                      "content": "Absolutely plus all that medication is not good for their liver and kidneys.  I would personally never preemptively medicate my kids for that reason alone.  Some stuff with babies just has to pass and this is one of them.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I guess I don’t really understand why waking the baby to give them medicine (and the baby cries) is worse than waiting an hour for the baby to wake up screaming in pain. It seems like either way there will be a screaming baby, but one is going to be able to go back to sleep more easily because they aren’t yet and won’t be in pain.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "It's the middle of the night. If you give then medicine before bed time, you don't wake them up to give them more, you wait till they wake up, then you give them the medicine, as they might not need it/might not wake up",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "It’s not good to keep them on Motrin and Tylenol for weeks at a time. My daughter has gotten one tooth at a time since July.  She’s getting her molars now and the experience is similar to OPs.  If I had to stay ahead of the pain she would be on Motrin and Tylenol continuously for 4 months now.  That would be terrible for her liver and kidneys and stomach.  So\n\nWe see if she can go without and most of the day she can.  Some nights she can but some she cannot.  \n\nWhat’s the solution?  How do you stay ahead of the pain at all times without fucking the kids organs up",
                  "id": 19,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah I’m surprised not many comments are about long term use of a painkiller on a little kid… you don’t give it ‘just in case’ - you give it when they are not coping with the pain. So unfortunately no you shouldn’t wake the baby because ‘it’s time’. \n\nI have 3 kids. One is non verbal (she’s 14) so we do need to wait & see, not just load her up for days/weeks on end. \n\nSucks for the neighbour but she didn’t buy a condo in an adults only compound … \n\nOP is NTA",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Also, I was told to do ibuprofen and Tylenol because you can alternate every 4 hours..",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It sounds like the Motrin wears off in the middle of the night and then the baby wakes them up and cries for a little bit. I assume they give her more meds at that time. I don't know about others but my son's doctor told us not to wake him up at night to give him more medicine. If they wake up on their own and need it again, then you give it. That stuff works pretty quickly. There's nothing to be done about it, IMO. I would maybe try to have a conversation with the neighbor about how they're trying their best to handle the baby's pain and that the teething shouldn't last much longer.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I’m a pediatrician. Asking parents to give acetaminophen and ibuprofen daily around the clock at night is not a good idea. Teething is a normal part of infant life. Crying is normal for infants. Many young infants have colic and cry for hours despite everything parents try. It’s a normal part of life. Most apartment contracts state that tenants must expect the sounds of normal life. Reddit can be very anti child and anti parent (see any thread about children crying on an airplane for example). \n\nI’m not saying you shouldn’t give medicine if your child seems to be in significant pain, but crying is also part of infant life and doesn’t mean you automatically medicate. \n\nAlso, there have been mounting concerns about the possibility that acetaminophen and ibuprofen could have adverse developmental and neurological effects in children. No medication is completely benign and safe \n\nSource: \n\nhttps://stacks.cdc.gov/view/cdc/87058/cdc_87058_DS1.pdf",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 574,
              "content": "He said his neighbour leaves their windows and balcony door open all the time. She's contributing heavily to her own misery.",
              "id": 24,
              "comments": [
                {
                  "score": 153,
                  "content": "Exactly, maybe if she closed her doors and windows she wouldn’t hear the crying baby!",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "He didn’t say whether she was continuing to do this during the night while the kid has been waking up. That would literally the first thing I did, closing my windows before I went to sleep to try and mitigate it.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 28,
                      "content": "He says she keeps it open “all day and night” so I assumed that yes she has been leaving it open even when the baby is crying",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Right? This was my first\nThought",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 387,
              "content": ">She also keeps her balcony door open all day and night\n\nSoundproofing doesn't work if the door is open",
              "id": 29,
              "comments": [
                {
                  "score": 9,
                  "content": "This lady clearly doesn’t realize a fair number of intruders are happy to climb up a story!!",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 374,
              "content": "I love the smell of fresh bread.",
              "id": 31,
              "comments": [
                {
                  "score": 256,
                  "content": "Yeah, I don't get the whole \"take her to a doctor' thing.  For what?  Babies teeth.  Some cry about it more than others.  What's a doctor going to do besides tell the parents to keep doing what their doing?",
                  "id": 32,
                  "comments": [
                    {
                      "score": 156,
                      "content": "All the dr would say (where I'm from anyway) is \"that's some set of lungs on this baby\" and then they would offer teething remedies. It seems the OP and his partner are already doing all they can. Some babies teething is hellish and then some babies breeze through it.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "When I was a teen, 13-14, my neighbor had a baby that was truly colicky. She was an undersized critter who could out-wail a banshee.  You could literally hear her up and down the block at any hour of day or night.  She outgrew it and became a lovely young woman.  I used to take her sister, 2-3 at the time, to a fastfood place, park, etc... to get a break. No one complained.  It is life and babies are life.  Probably she had digestive issues.  Most parents are not prepared for it or can do much about it.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "*yep... she's teething. That'll be $4500 please*",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": ">Some cry about it more than others.\n\nMine didn't even cry. She's got all her teeth now, and we've had one night that was disturbed due to teething pain in her whole life.\n\nShe woke for a hell of a lot of other reasons, mind, but for teething we got off lightly. \n\n>What's a doctor going to do besides tell the parents to keep doing what their doing?\n\n\"Doc my baby is crying\"\n\"Yes, they do that. Can I actually help you with something?\"",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "One of our neighbors had one of those. We did.not need a morning alarm clock. Baby would b3 screaming. One day in a casual convo we mentioned it when we bumped into her and the baby. She apologized, explained and said she did not realize how loud baby was.  Guess they changed their methods because there was less noise in the weeks that followed.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I watched this baby in a daycare. Nothing was wrong with him but when he was born they thought there was because he had this insane high pitched loud scream. They ruled everything out. He just would scream for a half hour or so at a time, and when he was hungry, tired, or needed a change. The best way to get him to stop was to swing him back and forth in his car seat. You stop, he screams. So it was arms falling off or going deaf. I guess he eventually gave himself a hernia from screaming. We didn't keep him for long. \n\nSome babies just scream.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 263,
              "content": "You must have never had children lol",
              "id": 39,
              "comments": [
                {
                  "score": 236,
                  "content": "Lol right? Maybe this parent can just ask their kid to hold the pain in until the morning or at least ask the baby to be a little more respectful of other’s space /s",
                  "id": 40,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Or maybe they can force feed more than the recommended dose at more frequent than is safe so that this poor inconvenienced woman doesn't have to shut all of her doors and windows /s",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 132,
                  "content": "The majority of this sub is childless",
                  "id": 42,
                  "comments": [
                    {
                      "score": 26,
                      "content": "And with a serious hate-on for any child that dares to make them remember that kids exist and isn't a perfectly quiet obedient little mini-adult.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "The majority of this sub are *children*",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Often virulently so.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Often virulently so.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 241,
              "content": "I live bellow a family that has several small children. I dont know if some of them are foster care or are all their own but I think for the past 5-6 years they have had consistently at least one child under 2. I have no clue how many kids they actually have but more than 3, I am not social person and I avoid all social contacts as much as possible. But the kids do go through periods of crying at night. And little bit older they get temper tantrums in the morning and then they really scream, only teenagers getting a fit is louder, but that happens like maybe once a year, could be more soon the second oldest is probably approaching 13-14. He is at least as tall as I am already (I am 5'2)\n\nMy solution is good noise cancelling headphones, paired with white noise and earplugs. Works great for me and I have not been bothered unless the headphones run out of battery.  \n\n\nEDIT: To OP I would say NTA the woman could search ways to minimize the noise to her as babies do not have volume control. They cry when they need something.  I would choose live under family with small children over renovation enthusiast any day. That noise is unbearable. I would also not want to live under party house because with drunk people the problems rarely stop at just being loud.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Probably because the neighbour keeps their door open day and night?",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "Unfortunately most newer buildings are soundproofed for outside sounds but not that much within the building.",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Never wake a sleeping baby, also parents have no idea if the child will wake up bothered by their teeth. Pretty much comes and goes.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You don’t take a baby to the doctor because of teething pain. They hurt, then they scream. There is no rhyme, reason or schedule for it.",
              "id": 51,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1005,
          "content": ">This is an expensive part of town in a new building, so we can assume shes decently monied (or daddy is).\n\nIs the original comment OP made. He's since edited. To see it yourselves, go to comments ➡️ then oldest. The AITA bot posts an original version of the post",
          "id": 52,
          "comments": [
            {
              "score": 480,
              "content": "Yeah, even without this comment there's a certain *tone* the post has that always indicates to me that the post is super biased in favour of the OP. (Yes, I know all posts are biased, but sometimes you can really tell they're trying to skew the narrative instead of getting a true AITA verdict.)",
              "id": 53,
              "comments": [
                {
                  "score": 210,
                  "content": "Him being disrespectful toward her in this post literally *cannot* have any impact on who is in the wrong in the situation as described. And if we're going to invent details to justify impacts to the judgement, what are we doing here?\n\nEven if OP is the worlds biggest asshole, this isn't Am I **An** Asshole. It's Am I **The** Asshole, and we're being asked to judge the situation in front of us and who is in the wrong. It isn't a generalized assessment of their character, but a specific judgement of who is in the wrong in a specific conflict. Even if OP totally sucks in every other arena, I don't see anything to blame them for in this conflict.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 100,
                      "content": "Happens every time here. If someone rubs people the wrong way they'll make up any excuse to say they're the asshole, regardless of the actual details.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "If someone was the worlds biggest asshole, wouldn't it make sense to think they're more likely to be an asshole in any given particular situation?",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "“An asshole versus the asshole”……I love that! Perfect way of clarifying.  lol",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "I mean, look at the title of the post. He is already trying to garner support to his side by immediately calling her selfish in the title.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "If we're to assume that she's a rich spoiled brat because of where she lives shouldn't we assume that he is, too?",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "That's quite tame, considering you've had an inconsiderate person banging at your door at 3am demanding confrontation.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 607,
          "content": "Oh good. Comments from non-parents assuming that crying children must be a skill issue on the parents part. So helpful. OP is NTA",
          "id": 61,
          "comments": [
            {
              "score": 290,
              "content": "Raising a child, especially one who's in almost constant pain due to a normal part of development, is fucking difficult in the best circumstances. \n\nReddit: git gud",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I also said not the ahole, but I do think he needs to bite the bullet and send a peace offering before anything escalates.\n\nHis wife is already mad about the music, and this woman has the potential to make their lives miserable. Best to suck it up, send her some wine and some high quality earplugs for sleeping in, and a note explaining the baby is teething and the midnight-screaming should hopefully end soon.",
              "id": 63,
              "comments": [
                {
                  "score": 11,
                  "content": "This!\n\nThe neighbor is justifiably upset. You are doing everything you can. Maybe just go upstairs with a gift, explain the child is teething and this is temporary and apologize for the inconvenience and that you are doing the best you can. \n\nYou are  NTA for ignoring the banging on the door in the middle of the night...wise move...that confrontation would not have ended well.\n\nBut do go talk to her at a reasonable hour.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 380,
          "content": "The pain isn’t a miracle drug. Babies are going to teeth, they will cry, and they need to be soothed before they can self soothe.\n\nThe neighbor is an AH. OP just sounds tired and angry but their response was reasonable given the situation.",
          "id": 65,
          "comments": [
            {
              "score": 407,
              "content": "If we're giving OP grace for their response due to being \"tired and angry\", can we not give the neighbor the same grace for also being \"tired and angry\"?",
              "id": 66,
              "comments": [
                {
                  "score": 377,
                  "content": "Only people with children can be tired. Didn’t you know that?  No one else in the world is tired /s.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 79,
                      "content": "For sure! I don't have kids, but I have a large, older home, pets, and a mortgage. I also have a hospital job and a serious chronic and progressive illness. I guess I'm not supposed to be tired. Sigh. \n\nI sympathize with the parents to a degree but I also sympathize with the neighbor. If she has to work, it would be horrible to be woken up by a screaming baby in the night. Noise cancelling headphones is an idea, but I couldn't sleep with bulky headphones on my head - I'm a side sleeper. \n\nI'm not going to judge either way because it sounds like both the parents and the neighbor are in a crappy situation, but I wonder if the parents could try using additional soundproofing where the baby is so it may cut down on the noise? IDK if they've tried that idea. \n\nAlso, I'd just try to be a little more understanding to the neighbor and maybe just have a nice talk with her and apologize for all the crying at night. It may help her if she feels validated. \n\nJust some ideas. I don't have kids, but I've babysat a lot of them and have been around kids enough to have some general understanding.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Lmao reminds me of that one post a “mom” made rolling her eyes about “you just rolled out of bed to get coffee I’m a mom lol you don’t get tired. i deserve that coffee”\n\nOr something 😂 like bruh,",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 151,
                  "content": "The neighbour is hearing muffled crying for 10-15 minutes twice per night. It's not even remotely comparable to managing your own child in pain in the same room.\n\nI don't have kids. I'm a quiet person with quiet pets. I'm a light sleeper with insomnia. But I have enough self-awareness to know that living in an apartment means occasionally hearing my neighbours living their lives. Earplugs and melatonin exist. So does closing your door.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 78,
                      "content": "You're not a light sleeper if melatonin and earplugs work. You're just a normal sleeper. If I was woken up like this I wouldn't be able to go back to bed. Not everyone's body works just like yours.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "\"Melatonin exists\" so now we're at the stage where we're telling people they're not allowed to complain about excessive noise unless they're willing to abuse sleep medication on the daily? Fucking YIKES dude",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Some people aren't allowed to use ear plugs. Every time I have an ear infection the doctor always accuses me of wearing ear plugs. I don't.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 77,
                  "content": "i mean, i’ve had some really loud neighbors at really inconvenient times when i’ve been exhausted long before i had a baby. i was able to exercise self control and not go banging on their door like a psycho and have a mature calm conversation with them at a decent hour.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 18,
                      "content": "And what would banging on their door at 3am accomplish other than an expression of anger and distracting them from fixing the problem?\n\n\"Oh, just thought I'd let you know.  Perhaps you were not aware, but you might possibly have a loudly-crying baby in your apartment that needs some attention.\"\n\n\"Oh, really?  Gee.  Thanks for letting me know.\"  [closes door]",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I remember when my baby sister was cutting her first teeth. I was 14/15 and I literally cried with her sometimes. We alternated Motrin and Tylenol like clockwork, used the baby numbing gel, had multiple icy teething rings and teething biscuits. We even let her just \"chew\" on our knuckles so hard it hurt. Held and soothed her constantly. Nothing, and I really do mean nothing, prevented the screaming.\n\nI can barely tolerate the sound of screaming children most of the time, but damn do I know that it's not necessarily the parents fault and it's on me to manage and decrease my own stress reaction to it. My neighbor has a toddler, and I have nothing but compassion for her when I hear that baby screaming, even if it does drive me to put headphones on. At least I *have the option* to escape my pain.",
              "id": 76,
              "comments": [
                {
                  "score": 3,
                  "content": "Yep. It suck’s. No doubt about it. But getting mad at the parents and assuming they aren’t doing anything to help?\n\nThat’s insane.\n\nNow oP did cross the line by assuming the neighbor is poor or whatever. Not cool.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 336,
          "content": "You don't wake a baby up to give it medicine to prevent it from waking up... that's an extremely stupid suggestion",
          "id": 78,
          "comments": [
            {
              "score": 37,
              "content": "Depends on the kid. I could wake mine up for medicine, get a very satisfied \"ahhhh\" and she'd go right back to sleep. But my nephew was a completely different story. You do not disturb that kid while he is sleeping, it's not worth it, you're going to have him screaming and fighting.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Haha this reminds me of the time I had to get my antibiotics in the middle of the night. \n\nI was like 7 and my mom\nCame home from work late because she worked in a hospital. I was so sick and outing it I tried to put the pill in my ear. Lmao. \n\nNow I guess I could've waited until I woke up but whatever. Still a good story they like to tell. At Christmas. Probably my eventual wedding.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 177,
          "content": "eeeeh... you dont have children, do you?",
          "id": 81,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 147,
          "content": "Somtimes babies cry, my dude. You don't just dope them up more, smh.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "So if the baby is asleep at 11pm, parents should wake baby up to give Motrin?",
          "id": 83,
          "comments": [
            {
              "score": 139,
              "content": "These people seem to think toddlers don't go to bed until 11, so waiting til then for the dosage is fine. 🙄",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "LOL never wake up a baby. Ever.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 100,
          "content": "Is it also possible she's just playing music and not intentionally trying to \"get back at them?\"\n\nI'd say NTA (baby's cry... unfortunately it's what you sign up for when you live in an apartment\\_ except for the disdain absolutely pouring off of OP toward this woman who apparently hasn't done anything except play music and knock on his door when his baby woke her up once? Makes me think there's more to the story or OP is just an asshole in general.",
          "id": 86,
          "comments": [
            {
              "score": 33,
              "content": "Interestingly my apartment complex recently sent out an email saying that residents were responsible for everyone living in the apartment regardless of age, including noise levels. I’m convinced it is because the child next to me. It’s a newer family and this preschooler shrieks non stop. Our building used to be two single professionals and two retired couples. I’m certain that one of the retirees contacted the office.",
              "id": 87,
              "comments": [
                {
                  "score": 11,
                  "content": "Shared living really shows you the kind of weird fucking noises people can make. I still have no idea what my upstairs neighbors were even doing half the time at my old place. It sounded like they were pushing furniture across the floor half the time.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I had an upstairs neighbor that sounded like they were dropping bowling balls.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 58,
          "content": "I'm here 2 hours after the post, looks like OP edited it a bit, I don't see the daddy statement. 😬 Thankfully you're top comment!",
          "id": 90,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7754,
      "content": "Info\n\n>Motrin works for about 8 hours, so by 3am we have to give her another dose and wait through the cries, cradling her for 15-20 minutes for it to kick in again.\n\nYou mean there's another way than waking up the building at 3 am every single night?\n\nAlso, good job at deleting the daddy line which was causing you to gain some of the YTA judgements",
      "id": 91,
      "comments": [
        {
          "score": 3319,
          "content": "The daddy line is still in the auto mod comment for those who want to see it. OP is an AH for deleting it to make him sound less like an AH.",
          "id": 92,
          "comments": [
            {
              "score": 1238,
              "content": "I still felt like the OP used some pretty harsh and leading words to describe the neighbour, even after OP removed the daddy line.\n\nYTA. And I have 4 kids. I shared a wall with college students when I had babies. So I first hand have experience with the music vs babies conflicts.\n\nOP needs to extend an olive branch to all direct neighbours. Box of muffins, or a gift card from a local coffee place with a note apologizing for the nighttime baby noise. Maybe a comment about loving her taste in music during the day for this particular neighbour. Kill em with kindness.",
              "id": 93,
              "comments": [
                {
                  "score": 39,
                  "content": "Yes! Surprised I had to scroll this far down to see this. It sounds like they haven’t even talked to the neighbor. I think it would do a lot of good to say “sorry about the noise, she’s teething but hopefully it will be done soon, also we love your music and like sharing that with you” you know?",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I'd like to know if they've even mentioned that the baby is teething to the neighbor?\n\nETA also, the baby wakes up screaming at 1am AND 3AM??? \n\nAnd how do you know it was you upstairs neighbor at your door? And how do you know she was there to start a fight? Maybe she was legitimately concerned because your baby has just started screaming twice a night?",
                  "id": 95,
                  "comments": [
                    {
                      "score": 11,
                      "content": "We don't know if she was there to start a fight. The wife wanted to fight. That explains a little bit about OP and his wife.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is the way. Show the neighbors your sympathetic and I'll deal with it. But disdain? I'm petty as fuck, you will not be able to stoop lower than me.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is so weird. OP’s allowed to have an opinion on the lady. That has no bearing on the situation we’re judging: is he an AH for having a crying kid, and is he doing enough to quell the baby’s pain? That’s what we’re meant to be looking at…if he isn’t, sure, he’s TA. But the the answer is yes, he IS taking an active role as a parent and trying to reduce his baby’s pain. That’s literally all you can do. He’s NTA.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 613,
              "content": "The fact that he feels need to point out she’s “single” and “monied” while living in the building makes me question his claim of her blasting music intentionally to bother/punish them. She is living her life and it sounds like she was minding her own business until she hit her breaking point. Do I agree with how she handled it? No, but I strongly suspect this representation of what is going on is biased to a point OP isn’t actually interested in finding out if they’re TA— they just wanted to be validated and misjudged how people would react.\n\nOP YTA",
              "id": 99,
              "comments": [
                {
                  "score": 267,
                  "content": "Surely if he lives In the same building, he must be 'monied' too.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 372,
                      "content": "Seems he has some kind of issue with a single woman having as much money as he does…",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "Maybe monied but they don't sound very classy or mature since his \"strong tempered petite\" wife who is \"amplified by her first year of motherhood\" wants to \"fight\" the neighbor.",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I think it's hilarious that his reason for assuming she's monied is the part of town she's living in.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 323,
              "content": "Yeah I know, he can't hide that no matter how hard he tries",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "How do I find this?",
              "id": 105,
              "comments": [
                {
                  "score": 112,
                  "content": "Sort the comments by \"Oldest\" and then the first comment will be a copy of what they initially wrote.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 51,
                      "content": "TOTALLY not the subject, but I haven’t seen the sort option in the mobile app (I only use the mobile app) in a long time. Am I lame and just don’t see it??",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Really wish those comments got pinned automatically, mobile makes it a pain in the ass to find.",
              "id": 108,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 257,
          "content": "3am means she got her earlier dose at 7pm which is very likely bedtime.\n\nPlease tell me what else you expect them to do?",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 188,
          "content": ">You mean there's another way than waking up the building at 3 am every single night?\n\nPretty ignorant. you can't just continually dose a kid.",
          "id": 110,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 84,
          "content": "I did wonder where that comment was- now it makes sense and does change the narrative. Irrelevant how she pays her way. I’m going ESH though",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Standard 8hr dosing times in hospitals are 6a, 2p, 10p to allow the most time for sleep. Seems like it would work better here too.",
          "id": 112,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I was wondering why people kept mentioning that with the daddy line despite reading the whole thing lol.",
          "id": 113,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2813,
      "content": "[removed]",
      "id": 114,
      "comments": [
        {
          "score": 1172,
          "content": "All the shade about how the neighbor pays for her life is unnecessary and gives me the same feeling.",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1077,
          "content": "I mean, OP lives there *and* has the expense of a child, right, so he's clearly living there on daddy's money too, right?  He's totally not being sexist because his neighbour is a single woman without kids, RIGHT? /s\n\nIn all seriousness, people's children are only special to them.  Other people have a right to be pissed off if they are woken daily by screaming at 1-3am.  OP should be looking at trying to get better meds or time them better not just for the sake of his neighbours, but for his kid.  I mean, clearly she's suffering and would feel better with better pain relief and if she could sleep through the night.\n\nBlasting music in response is a bit childish, but as some have pointed out, perhaps she doesn't realize it carries so much out the open door, especially if she's new to comdo/apartment living.  I'd also suggest it may be to down out any screaming during these times...  And if it's during the day/at a reasonable hour, OP has no right to complain, really unless we're talking volume that is unreasonable at any hour.  Like wall shaking or something.\n\nHonestly, OP comes off as sexist and petty. Maybe even jealous that she isn't dealing with a kid.  Way worse than the neighbour who dared complain and *maybe* is playing the music in response.",
          "id": 116,
          "comments": [
            {
              "score": 235,
              "content": "I'd guess she's playing music most of the day to try and drown out the regualar screams of a baby downstairs.",
              "id": 117,
              "comments": [
                {
                  "score": 90,
                  "content": "I had an annoying, entitled single mom neighbor above me. She was entitled before she had that baby because she would blast her music all night and have a bunch of parties, but think everyone around her needs to mind and be quiet for her because she's a mommmy. And my complex is old, so I hear everything she does and where she walks. When she uses the bathroom, going up and down the stairs and when her baby would jump up and down and the mom laughing and encouraging it. And parents expect others to be a ok and not annoyed with this? Heck, she was vacuuming and using the blender like 630 in the morning, on a weekday. But when I play my music because I don't feel like hearing her, the baby crying all day, or that cocomelon, I'm the bitch.\n\nJust as they want us to be understanding of them having kids, they gotta be understanding of us still having a life. My thing is when you're not trying to be quieter when you can. Who encourages and think it's ok for your kid to jump up and down on an upstairs unit? And upstairs people never realize how loud they really being.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Absolutely. OP’s daddy must be well off if OP  was able to afford a wedding, a nice apartment, and still have enough left to create a whole additional person.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 329,
          "content": "Yeah the wife wanting to “ fight her” made me laugh. Fight her for what? The fact that she wants to get a decent nights sleep? Most places don’t have sound ordinances during the day so while blasting music during the day wasn’t the nicest, it in no shape compares to a screaming baby keeping who knows how many neighbors up all hours of the night. While I am sympathetic to the baby, If my neighbors were bumping music, or having a screaming match( or had a baby screaming ) multiple times a night for nights on end I’d call the cops for a sound disturbance  and tell my landlord. They’re lucky all she did was show up at the door, and imo they should have answered it and apologized.",
          "id": 120,
          "comments": [
            {
              "score": 32,
              "content": "How is banging on their door at 3am going to result in a decent night’s sleep? Do you think that’s going to make the baby *stop* crying?",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Yeah, I had a family with a small child living next to me for years at my last place. I never ever heard the kid scream. I straight up thought they moved out until we happened to leave at the same time one day and I was surprised how big the kid had gotten. At my old place quiet hours were 10pm-8am and I imagine if any of my neighbors didn’t do everything they could to help their kids not make noise at night, they would have gotten a warning. Yeah babies are a fact of life but unfortunately so is having to go to work every day as an adult, so compromises need to be made.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "I just feel sorry for the rest of their neighbours",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 168,
          "content": "Anyone who uses the word, \"Monied\" is an ass hole.",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 149,
          "content": "> Maybe her preference has nothing to do with you?\n\nYeah... this girl is supposedly blasting this entire courtyard of wealthy condo owners with music and 1) no one else seems to mind and 2) it's *definitely* because of OP?  I'm thinking not. If she hadn't come down and knocked on the door I'd assume she didn't even know OP existed",
          "id": 125,
          "comments": [
            {
              "score": 125,
              "content": "If she was doing it to be an asshole, she wouldn't do it during the day. She'd wait until their kid fell asleep at night and go to town right up until whatever time it was that she was legally able to keep her music up loud. Only doing it during the day suggests that she is actually trying to be, to a certain extent at least, mindful of other people's enjoyment of the space.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 100,
          "content": "First YTA that I've run across here, and I agree completely.  Calling her a \"selfish neighbor\" in the title of the post just because she doesn't want to listen to someone's precious little bundle screaming at 3am night after night gave me all the vibe I needed.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 92,
          "content": "Regardless of rest, I don't see why a neighbor shouldn't ring at 3 am if noise is bothering her at 3 am. I had a neighbor run his dishwasher all the time at 4 am which drove me crazy. So I knocked at 4 am and asked him if he can do it some other time.",
          "id": 128,
          "comments": [
            {
              "score": 62,
              "content": "I once had a neighbour ask me if I could use my treadmill after 9 pm and before 9 am.. Before that, mindful of the noise it would probably make, I only used it for one hour (from 5 to 6 pm), and I had a thick rubber mat, plus foam under it to minimize noise. I picked that time because I thought most everyone, even when doing shift work, would be awake. For some reason the woman below me preferred that I use it later at night, so that is what I did. Then I made her cookies.",
              "id": 129,
              "comments": [
                {
                  "score": 11,
                  "content": "you’re the good neighbor State Farm wishes they were like!",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "That was my prime sleeping time when I worked nights. I'd go to bed around 3pm and wake up at 10ish to go in.",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "And how can op schedule when his baby cries?",
              "id": 132,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2779,
      "content": "Info why aren't you staying *ahead* of the pain?  Why wait until the poor thing is hurting?????\n\nEdit- yta regardless of all the added info. What you're doing clearly isn't working. You chose to have a baby. Your neighbor didn't. Waking her up every night at 3am is a problem and the solution can't be 'she can deal with it!'",
      "id": 133,
      "comments": [
        {
          "score": 196,
          "content": "I'm so confused. I agree with you, but I've seen basically this exact post like 10 times in the past few years and most of the time \"she can deal with it\" is by far the most upvoted comment",
          "id": 134,
          "comments": [
            {
              "score": 122,
              "content": "I've seen it a few times also and I think the differnce is- the time its happening (crying at 3pm is annoying but at that time of day  the answer *is* deal with it) and op has tried only 1 solution, which isn't working.",
              "id": 135,
              "comments": [
                {
                  "score": 18,
                  "content": "almost as if context matters and you can't compare posts just because they deal with the same broad issue 🙄 it's the same reason people think that aita has a mIsAnDrY problem",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "> stay ahead of the pain\n\nLast I checked babies don’t have a way of letting you know before stuff starts to hurt.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I didn't realize that when someone wants a kid they have to get permission from everyone in a one block radius. And kids teeth and they scream when they teeth. It's just what happens and sometimes literally nothing can be done about it. LITERALLY NOTHING. Like parents snap and kill their babies because of how hopeless it can get. But sure, I'm sure it's entirely OPs fault because reasons. So fucking stupid.",
          "id": 138,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Have you ever lived in shared housing like an apartment building or dorm? There is nothing you can do about baby noises. That's just life in an apartment. Buy headphones or earplugs",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "People having children is part of life. I know redditors hate kids, but sometimes people need to grow up and realise they need to tolerate human beings existing at all life stages. It's a couple weeks while baby is teething. Their neighbor can close the door and wear ear plugs for a couple of weeks if necessary.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": ">Waking her up every night at 3am is a problem and the solution can't be 'she can deal with it!'\n\nOf course it can. It's actually the solution judges would enforce.",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "You know babies have tiny delicate livers so parents aren’t exactly jumping to overdose them on painkillers repeatedly for weeks, right? If the neighbour has a problem with hearing her neighbours - some of whom would obviously have kids - maybe they shouldn’t live in an apartment or should get earplugs.",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "It can be if she just refuses to close her doors and windows facing them as he said \n\nClosing her door at night is a way fairer expectation than for a teething baby not to cry at night",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2310,
      "content": "YTA for \"or daddy does\" comment.",
      "id": 144,
      "comments": [
        {
          "score": 420,
          "content": "op seems butthurt that the nieghbor can afford to live alone",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1458,
      "content": "[removed]",
      "id": 146,
      "comments": [
        {
          "score": 954,
          "content": "this one here \\^\n\nop and his wife sound unhinged\n\nthe neighbor 'retaliates' by playing loud music during daytime???? so hours that noise is alright lol??? they wake the neighbor up due to their child every night at 3 but get angry when she knocks on their door at 3? this post is a trainwreck",
          "id": 147,
          "comments": [
            {
              "score": 393,
              "content": "For real, I feel like he had to twist the story into a pretzel for her to seem like the jerk for, *let’s see,* knocking on the door of the neighbor that has woken everyone up for weeks and made no effort to curtail it in any way. Perfect. Yeah. Totally insane behavior, making noise when noise is perfectly permitted and knocking on the door of a loud neighbor. Sounds exactly like living in an apartment. What a monster? Perfectly reasonable to *commit actual assault* when subjected to this. Seriously, get a therapist.",
              "id": 148,
              "comments": [
                {
                  "score": 171,
                  "content": "OP must also be a mind reader or be really narcissistic to think the neighbor is listening to music just to annoy them.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 83,
                      "content": "OP is in Mexico I believe, and I can’t speak to how it is there, but at least in the US most apartments have quiet hours that allow noise during the day. So even if she is retaliating with the music, she’s doing it during reasonable hours and within expected rules of most complexes. She’s still being nicer than OP lol.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Also, and I feel this is what tell us how much of a twisted version of events we are getting, there is no mention of any complaints anywhere at all in his post, meaning this neighbor has gone weeks now getting her sleep disrupted at three am on the daily, and is still being nicer than OP deserves. Because me? I wouldn't even have asked after a full week, I would have gone straight to management or the landlord with a formal complaint, OP's neighbor is being entirely too nice given how much of an ass OP is showing himself to be.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 45,
                      "content": "I find it frustrating that this is considered somehow wrong, because I agree. She is within her right to report it to management. She has somewhat subtly (if we assume it is related), played music during allowed hours to give OP a hint that they need to respect quiet hours. Then she knocked on his door to try to settle it. Him and his wife are considering violence against her, but if she contacts management she’s the AH? No way. Absolutely not. OP and his wife are unreasonable and violent. She needs to go to management and she’s been too kind up to this point honestly. This is why neighbors aren’t “neighborly” and don’t try to talk things out before going to management. I’m not trying to be assaulted by people like this. \n\nOn another note, I mentioned I play an instrument. Before I ever played it in my house I took measures. I put up acoustic panels and play in a room with a lot of soft surfaces that absorb sound, panels, carpeting, etcetera. It is not unreasonable to expect the barest amount of consideration from parents and I won’t pretend it is. No one is telling me I can’t play, but they’re within reason to demand I take every step I can to prevent a disruption. You live communally, you have an obligation to do just that, if the noise is from a hobby or your children. If you refuse to take those steps, communal living isn’t for you.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 95,
          "content": "yeah, he is so butthurt that a single person can afford a family sized home, especially a single woman",
          "id": 153,
          "comments": [
            {
              "score": 47,
              "content": "Doesn’t she know that she needs a man??! I guess daddy will take care of her for now since she couldn’t possibly be just a normal adult managing her own life. Still, inappropriate tbh. Don’t know who she thinks she is. \n\n/s of course",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "[deleted]",
          "id": 155,
          "comments": [
            {
              "score": 7,
              "content": "Yeah, I don’t want to link directly to Amazon but I found a Rolling Stone article on the ones I own actually, [here](https://www.rollingstone.com/product-recommendations/lifestyle/best-acoustic-panels-for-sound-dampening-927358/). I have their number one pick, the hexagonal ones. I have a bunch on my ceiling and then decoratively placed around the room and I have them in several colors. Around my door and window I’ve placed a bunch as well because sound escapes those areas. I’ve had them up for about a year and the instrument I play is the violin, I also play an electric one with a small amp. No complaints and I did actually text my neighbors to ask, they didn’t hear anything, they aren’t above me though, they are to the side. I also have super heavy duty drapes and a rug in the room to assist further. I hope it works for you too!",
              "id": 156,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "[deleted]",
          "id": 157,
          "comments": [
            {
              "score": 3,
              "content": "If it was a guy he would definitely be a “successful bachelor”, women are spinsters or spoiled children for sure. He didn’t even need to comment on her finances at all. What a weird and inappropriate thing to bring up.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 966,
      "content": "ESH she could be more understanding and the stereo thing is stupid and childish. \n\nBut as a person without kids, why should she be awakened because your child is teething? It is not her fault? But you seem to have no sympathy for her position. You even go so low as to suggest her apartment is paid for by her daddy instead of her, which seems like a low grade passive aggressive insult. \n\nI am not suggesting that you should somehow force your child to stop crying nor am I suggesting that you are doing anything wrong. Teething is a normal part of child development. But that does mean your choice to have a child should infringe on other people's choice to get a good night sleep. \n\nWhy not go knock on her door and apologize for the night time crying? In fact, I would knock on all your neighbor's doors and apologize. Your unit started this, so take responsibility for it.",
      "id": 159,
      "comments": [
        {
          "score": 543,
          "content": "Honestly thinking that no one should be inconvenienced by anyone else at any time if they’ve not caused it themselves is such a bizarre way of going through life. Living in a community with other people you will experience things not if your own making from time to time. If you want to live without the possibility of being disturbed by a person who cannot help themselves (like a baby) you should live alone far from other people, not in an apartment building",
          "id": 160,
          "comments": [
            {
              "score": 455,
              "content": "When you live in an apartment setting, you expect a certain amount of noise. It is going to happen. On occasion, that noise will even wake you up at night. \n\nBut when you have a teething baby waking you up all the time, that is not what you signed up for. It is like having a neighbor's dog barking at night and waking you up. No, I am not comparing a baby to a dog, I am comparing noise to noise. \n\nOP's unit is literally invading other units around him. I get that it cannot be helped but OP could extend the olive branch and apologize for the noise. In fact, he should have already done so. Go to all the connecting units and apologize for the inconvenience and give them a plate of cookies or a coffee card. Acknowledge that there is a problem and that it is coming from your unit. Explain that you are doing your best to resolve the issue. \n\nBut to just say other people have to deal with their decisions is unfair. Alternately, some could say that because they have a crying baby, they should move out into the middle of nowhere so they are not infringing on other people's ability to have peace.",
              "id": 161,
              "comments": [
                {
                  "score": 8,
                  "content": "I wonder if closing her balcony door would help with the sound issue 🤔",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "The amount of people who treat kids as though they're just small tacky noisemakers and not like....humans with as much right to exist as anyone else is seriously disturbing.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "Why is everyone missing that she leaves her balcony door open all night? She could shut it and probably not hear anything, based on the fact that other neighbors don’t seem to be complaining about it",
          "id": 164,
          "comments": [
            {
              "score": 98,
              "content": "I lived in a shitty apartment where I had to have ALL windows open bc there was no AC. For about a week, the neighbours directly above us had a baby that would SCREAM for 5-20mins at a time, and it was never something as loud or disruptive to make me lose my sleep. If the noise travels from their ground floor bedroom, through her open balcony, and *all the way to her bedroom*, then she either has super hearing or the apartments really aren't as sound-proof as OP is making them out to be",
              "id": 165,
              "comments": [
                {
                  "score": 12,
                  "content": "It could also be a quirk of that particular section of the flooring, too. My bedroom is remarkably soundproofed all around the door and inner wall- my roommate has to shout pretty loudly to be heard if she's right outside my door... but I can hear raindrops clear as a bell outside the window on the other side, and hear footsteps and kitchen sounds directly overhead.",
                  "id": 166,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I feel you, my first post college apartment had no AC and I had to choose between sweating my ass off every night or having my neighbor’s cigarette smoke waft through my window and giving me a migraine.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I took that comment to mean that she generally leaves it open. Is he going out there every night at 3 am to check if it’s still open? That’s legit the first thing I would’ve done if screaming baby was waking me up, making sure to close the window before bed. But ALSO if the windows being closed affects the sound so much how is she hearing it through his supposedly closed windows? Want to bet his windows are also open?",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 889,
      "content": "So multiple weeks worth of a screaming toddler at 3am and you think your neighbor is an A H because she rang your doorbell at 3am, right. \n\nYTA and please do something about pain management for that poor kid.",
      "id": 169,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 580,
      "content": "ESH - but you suck more. Your neighbour sucks for how she seems to have handled the problem. IF her music is directed at you, then she’s taking the passive aggressive route and that’s petty. However I can understand why she’s so upset. She doesn’t have children, and likely needs to rest before work like most other people in existence. If her sleep if being affected every night, I’d be butthurt too. \n\nThat being said, you are a bigger AH. Firstly for not staying ahead of your child’s pain. If this is a developmental phase she’s been going through for some time now, you should be giving her pain meds before she gets to a level that continues to bother your neighborhood. Secondly you’re an AH for your daddy’s money comment. If it takes sooooo much money to live in the building, so much so that a single woman could not possibly be able to afford it on her own without daddy’s help, maybe you and your wife should think about moving. You know, since you’re so well off and can afford such an expensive apartment. It sounds like you can afford to not be an AH, you just don’t want to because you’ve made the choice to have a kid and now everyone must suffer along with you and your horrible wife. Wanting to throw down with the neighbour because YOUR screaming child is disrupting her sleep is pure trash behaviour. Do better, you’re raising a child.",
      "id": 170,
      "comments": [
        {
          "score": 30,
          "content": "To be fair, OP isn't doing anything when she goes with the direct route of knocking on his door, so I think going passive aggressive is justified.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "The music thing is bull. If the kid is bouncing around and dancing to the music, then she isn't a crying mess driving the neighbor crazy, so there's no reason for the neighbor to play the music during the day to mess with them. She probably just likes to listen to music, and OP and his wife turned it into something else. OP has no proof the neighbor isn't just listening to music. If OP said the neighbor was playing the music at 3 am to fight off the baby's crying but also keeping them up with the music, I would think then maybe that was something wrong to do, but that's not the case. OP and his wife - who wants to fight the neighbor because the neighbor bothered them at 3 am (funny since that seems to be what happens the other way around regularly) - have just turned themselves into the victims. It's all about them and their baby and no one else.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 489,
      "content": "You say she has been punishing you with stereo placement. How do you know it's a conscious effort to punish and not someone simply not realising what they are doing bothers you? Have you talked about it with her? Have you explained what the situation with the baby is? \n\nAlso how can one settle a baby to sleep when someone is signing the doorbell constantly?\n\nSomething doesn't feel quite like you've told everything related.",
      "id": 173,
      "comments": [],
      "relation": "No"
    }
  ]
}