{
  "post content": "Let me explain. So my little cousin lives about an hour away from me. Since he was a toddler he would always spend time at my house for weeks on end during holidays/summer. I am gonna be honest here, my cousin has a reputation of TERRIBLE behaviour. (for example, he ran up to my father and head butted him in the hip, 2 weeks after hip surgery when he was 4). As he got older his behaviour hasn't changed. My aunty (his mom) constantly calls me and complains about how rude, obnoxious, and inconsiderate he is all the time. I'll give a few main examples.\n\n1. He shits and doesn't flush the toilet, regularly. He's done it at my house and its disgusting. His response every time is \"my bad, i forgot\"\n2. He is extremely greedy. He will eat a pound of wings to himself that is meant to be shared without any thought that people around him are supposed to have some. Again, he's done this at my house multiple times and its pretty frustrating after coming home from a long day of work\n3. He is EXTREMELY LOUD when he plays video games. Loud to the point where the tenants who lived in his moms basement were forced to move out because they couldn't sleep at night. His response was that he didn't care.......he also does this at my house.\n4. Most of the times he will only talk to you if it involves him getting something (food, a gift, a favour). Other than that he will be in his room.\n5. He is extremely messy. He ate a plate of chicken at my house and literally left bones on the table. I walked in on him picking his nose and rubbing it on my bed (at 16 years old, not 6). Also, read my first point again.\n6. He destroys my wallet. He has his own money but when he comes over he views it as all inclusive or some shit. Always wants to eat out, always needs a new hoodie, always needs to get some expensive objective finished (last year i took him to get his drivers license, and he failed the test)\n\nIf my cousin was well behaved, I would love to have him over all the time. Sadly it isn't like that though. It's to the point where I dread the idea of him coming here, and tbh it makes me pretty sad.\n\nNow here is where it gets tricky for me. Recently his behaviour has been even worse, to the point where his mom asked him to go live with his father for a few weeks (they divorced 3 years ago). SO NOW that time is approaching for him to go back home with his mum, she calls me asking \"ohhh, can you please come and pick him up so that he can stay at your place for two weeks?? I feel bad for him\"......BRUH feel bad for WHAT?? SHE KNOWSSSSSS THAT HE DOESN'T BEHAVE HERE AS WELL, HE NEVER HAS. So the question I have here is ----\n\nAM I THE A-HOLE FOR NOT WANTING THIS ILL-MANNERED, TERRIBLY BEHAVED YOUNG MAN AT MY HOUSE FOR 2 WEEKS?\n\nEDIT: HERE'S SOME EXTRA INFO THATS PROBABLY IMPORTANT. YES I live at home with my parents....PAYING MORTGAGE, PAYING BILLS, DOING GROCERIES, MAINTAINING THE HOUSE, DRIVING BOTH OF MY ELDERLY PARENTS TO AND FROM APPOINTMENTS (because I am the only one at home who drives). My parents are at the age where they have given responsibility of the home to ME. ",
  "id": 1,
  "comments": [
    {
      "score": 5706,
      "content": "NTA- Tell her he’s not wanted at your house for the same reasons she doesn’t want him at home with her. That should work.",
      "id": 2,
      "comments": [
        {
          "score": 1729,
          "content": "Exactly. It's her fault she didn't raise him properly now he's too damn old smh NTA",
          "id": 3,
          "comments": [
            {
              "score": 781,
              "content": "This is what I was thinking as I was reading this. The fact that she complains about his behaviour is laughable. She is the reason he acts the way he does. He sounds like an absolute nightmare and more tbh. OP is so NTA for not wanting to deal with that (literal) shitshow.\n\nETA: I think that both parents are to blame for the behaviour of the cousin.",
              "id": 4,
              "comments": [
                {
                  "score": 352,
                  "content": "What she's really attempting to do is dump that ill mannered teenager with OP's ELDERLY PARENTS, and that's such an AH move. She probably just didn't realize that OP really could and would refuse to let the kid come and was completely willing to let his behavior disrupt OP's parents when OP appears to already be their primary caregiver. Good for OP and totally NTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 67,
                      "content": "the aunt thinking she could just \"dump him off\" to OP and her elderly parents sounds insanely entitled. the apple doesn't fall far from the tree...",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 116,
                  "content": "And so what about Dad? They only divorced 3 years ago and much of the teaching of manners and behavior should have been happening while they were all living together, so did the father leave it all up to mom to instill good behavior? \n\nEverybody still blames the mother when there are two parents present. Thanks patriarchy...",
                  "id": 7,
                  "comments": [
                    {
                      "score": 84,
                      "content": "Eh I think we’re just picking on the mother because SHE’S the one trying to pawn him off onOP.\n\nIt’s both their terrible parenting which created this",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "If the mother constantly caved to the bad behavior and takes away punishments, he won’t learn good behavior. The dad can be the best parent ever, but if the mother enables the bad behavior, the kid will never act mature.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I wouldn’t blame the patriarchy for everyone disliking a woman who calls her nephew up to talk shit on her own son lol people are blaming the kids mom because she’s behaving immaturely. it’s obviously not the rest of the family’s responsibility to be a revolving door of babysitting, and her behavior is incredibly entitled.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Well, the mother is getting all the blame here because she's the one trying to off load the 'problem' to other people.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "That slipped right past me. You're right! Dad plays a role in this also!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Christ mate, not everything is a gender battle.... Both parents are responsible for a child's upbringing obviously. \n\nHowever, seeing as it's the mum trying to dump her kid on OP, and she's the crux of the story that is why she is being discussed. Not because the strongly left wing Reddit has deep seated patriarchal leanings.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "The Aunt is an AH because she uses OP to complain about her badly raised son and expects him to give her a vacation from her choices. No way. He's 100% her responsibility. Even if she gave you $500 to pay for him, his behavior is so off-putting that I wouldn't let him come and control my household, especially with elderly parents. She just wants to dump him on SOMEBODY and you are the easiest target. She thinks she can bully and harass you into being responsible for her choices. NTA. I would tell the aunt to stop calling to complain because he behaves that way BECAUSE of her and you are not her therapist. It's all a guilt trip.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "I recommend not jumping the shark. It seems the aunt knows the issue is there, but we can't speak to what she has or hasn't tried. It's entirely possible she's done her best, and raised him properly, and... it just wouldn't take.\n\nIf a kid really and thoroughly doesn't want to you can quickly find yourself powerless to fix it. Raising a child involves a lot of time spent with the child respecting your existence.\n\nOr to put it differently, parents tend to only have as much power as the child gives them.\n\nAnyway my point here is that concluding \"she didn't raise him properly\" seems... pointlessly abrasive towards a woman who ain't done you any wrong that we know of yet.",
              "id": 15,
              "comments": [
                {
                  "score": 56,
                  "content": "I agree with you! I get tired of always hearing that it's the parent(s) fault. Some children have severe problems that can't be handled. People will suggest therapy, etc.  It doesn't always work. There isn't always a magic answer to changing someone's behavior.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 42,
                      "content": "While what you said isn't incorrect, children are still their parents responsibility. They aren't the responsibility of more distant and elderly relatives. There is absolutely nothing wrong with not wanting this young man at their house.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "This kid sounds narcissistic. That's a defense mechanism that he needed to get through his childhood. So something was going on. It's possible it wasn't at home (sexual abuse by a non family member), but most of the time, there's family dysfunction.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "Unless the child has ASD, this type of behaviour is 100% the parents' fault. \n\nSee also [**Don't rock the boat**](https://www.reddit.com/r/raisedbynarcissists/comments/77w8lf/dont_rock_the_boat/)",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Agreed. There are cases, albeit rare, where kids are just.... really bad. Almost always starting super young. They do sociopathic stuff barely out of toddlerhood- like in this case possibly. It COULD be a spoiled child, but it may not. \n\nI've seen it happen. My neighbor's other kids were kind, respectful, with good manners. They grew up to be good, hard-working folks in various careers. But one of thier kids? He was just... something was very, very wrong from about three years old onwards. He was very cruel towards other kids and animals. Eventually, after harming his siblings too many times and killing thier pets, he was sent to some sort of group home situation, because he was just getting worse and worse. Everyone was scared to live with him and he'd threatened to kill them and had even tried more than once. These parents had tried EVERYTHING you could think of. Tens of thousands on therapists and every medication and behaviorist. He just took joy in hurting others and would plan things for weeks in advance to be cruel \"pranks\". I don't believe there was ANYTHING more the parents could have done to change him. I believe he's in prison, last I heard.\n\nCases like these happen. It's not the parent's fault every time.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Kids that are kind, respectful and well mannered are not always the product of healthy home. In fact, kids that seem perfect, usually have stuff going on in their families. So, because the other kids didn't show aggressive tendencies doesn't mean they were brought up in a healthy environment. Defense mechanisms to get through childhood include martyr, the \"perfect\" kid and all kinds of behaviors that are deemed socially acceptable.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yep. I personally do think it's reasonable to assume aunt has erred, but... people are really aggressive and reaching to find a way to blame her for the kid being fucked up.\n\nI don't think OP should accept their cousin into their home, or owes anyone that, but I also don't think it's right to piss on the aunt, either.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "As a parent of a pita child - thank you! I know that my husband and I have doen and tried just about everything available to us to teach my oldest a better way to act/behave/exist. When she's in her \"no fucks are given\" state, there's no punishment she's not willing to endure to continue doing whatever the hell she wants.\nAdmittedly she's done a lot of personal growth recently after I finally just was out of options and sent her to live with her father. She's returned after 2 years of experiencing what living with what I've tried to teach her not to be is like. Still - sometimes, it's not the parents.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 6,
                      "content": "But do you dump your child off on others?  I have a PITA kid too but I would never expect another relative to deal with her for 2 weeks!",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Sometimes an asshole is just an asshole.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Very minor thing, but I think you mean jumping the gun not jumping the shark. Jumping the shark refers to when a series (like a TV show or comic) suddenly starts to have really bad writing and dumb plot decisions. Jumping the gun is when you make an assumption without having enough information.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "yeah, he might have an undiagnosed mental disorder. it seems like he is extremely autistic to me. and I have a lot of experience with autism, being autistic myself. this looks like he has an undiagnosed issue like autism or maybe even stuff like borderline personality disorder; I'm no psychologist but I do think something else is at play here.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I don't think autism. Not everything is autism. More likely something like ODD.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This sounds way more borderline or narcissism etc than just missing social cues. But yes I too am willing to ponder if there’s more than just his mama raised a brat involved here",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "He may have an undiagnosed issue but I’ve never interacted with an autistic person who tried to get me to pay for their stuff all the time. That’s quite manipulative.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "If someone “only” has power as a parent that kids give them… then those are terrible parents and have a kid quickly heading down the same path as OP’s cousin. There’s no excuse for having a kid with no respect for anyone, manners, hygiene and common decency unless they have a legitimate cognitive or development disorder. Literally if every parent thought like you, prisons in the U.S would be even fuller than they are now",
                  "id": 31,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You're forgetting that your child only obeys because they care. If they stop caring, and refuse to let you engage with them, your options rapidly shrink towards zero. Or to put it simply: You can have a child that is incorrigible.\n\nLet's take an example. The child decides they want to leave the house. Because you, uh, hadn't planned for that, the door was unlocked. They just wander off to wherever the fuck they were fancying. Their escape is noticed, you bring 'em home. Or rather... you try. They decide to do whatever it takes to not go home with you. \n\nHow fix?\n\nYes, the entire point here is that this is (a) an extreme situation, and (b) whatever you try to do, the child refuses to engage with you. There is no answer to this particular extreme, fictional answer without introducing something the child cares about enough to play ball with you.\n\nThere is, simply put, a limit to your power as a parent. And that limit is largely set by the number of fucks your child is willing to give. Recognizing that is important, if only to help you understand that you likely *have* power to take control of the situation (and without doing something abusive or otherwise illegal).\n\nThis isn't really specific to children of course. It extends to adults too. As an example: How effective will excommunication be as a punishment for a Jehova's Witness who already lacks family and friends, for example? A lot of the powerdynamic in the cult depends on being able to force compliance through others' compliance. If that falls apart the cult is quickly without the power to act.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "If he was doing this kind of thing at 4 years old then there was a bad hand from **nature**, and *nurture* had limited effective options. \n\nStatistically, you are probably correct, but not necessarily and I do not like to go directly to the unkind conclusion unless I am certain.  But OP probably has a better idea.",
              "id": 34,
              "comments": [
                {
                  "score": 12,
                  "content": "That's ridiculous. 4-year-olds are JUST getting to the age where they can show empathy and impulse control. A 4-year-old being a jerk doesn't mean he's somehow irredeemable as a human being, and there are SO MANY examples of bad parenting in OP's post (why does a kid who is keeping everyone awake playing video games still have access to a video game system?!)",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Babies start to be affected by their environment in the womb. The greatest impact is when the child is an infant because that's when they are the most vulnerable.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Didn’t raise him properly indeed. Either she just spoiled him rotten or she failed to recognize that he’s got an issue that needs therapy etc or perhaps a combo of a bit of both",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Kid has another parent. Don’t dump all the blame on mom.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 362,
          "content": "Agreed, except I'd tell the cousin, too.  He's probably living in some fantasy world where he thinks his behavior is okay, or even endearing.  \"Learn to take a joke, bruh!  But I'm family, bruh!  The ladies go wild for me, bruh!  Quit harshing my mellow, bruh!\"\n\nHe needs to hear how others view his behavior as juvenile and disgusting, and why it means that nobody- including his family- can stand to be around him.  Since he's already seventeen, though, be fully prepared for the possibility his behavior will not change.\n\nAlso, have a talk with his parents, particularly his mom.  They've been indulging his behavior for far too long, and maybe the reason they can't stand him is because of how they've raised him.  Perhaps they have a bit more work to do on that front.",
          "id": 39,
          "comments": [
            {
              "score": 60,
              "content": "This.  He's old enough to learn his behavior is alienating those who love him.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "He probably knows and doesn't care.",
              "id": 41,
              "comments": [
                {
                  "score": 12,
                  "content": "Right? Sounds like a sociopath with zero empathy or consideration of others.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 3,
                      "content": "A pretty stupid sociopath, if he is one. Smart sociopaths learn how to make people like them because it makes life easier when people like you.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Exactly! Maybe he should have the police called on him? I heard someone had a sister or something that kicked her in the stomach, and when the police were called, the sister ended up being a decent person.\n\n&#x200B;\n\nMight not work here, though.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "This! And if even that doesn’t work, point out to him exactly how unattractive he will be to potential romantic/sexual partners in the future. I’d imagine at 16 he at least wants to have sex, if not fall in love. But who wants to hook up with someone like that? The shit in the toilet is enough to make me puke on its own.",
              "id": 45,
              "comments": [
                {
                  "score": 51,
                  "content": "Honestly sounds like a stereotypical pre incel",
                  "id": 46,
                  "comments": [
                    {
                      "score": 21,
                      "content": "[deleted]",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "The really fucking nasty part is, if you wipe your ass, you remember to flush.  So there's another 'my bad, I forgot' moment rolled in there for you.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This. I was thinking similarly,  if he gets a dose of what people really think of him and consequences (like not being invited or allowed in OPs home), he may start to realize he needs to change his behavior. \n\nThen again, he is also almost 18. At that point, he will have to face whatever consequences come from the situations he creates and if he truly is a bad person, Aunt will have zero obligation to allow him to stay with her.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "Jumping on top to say: he's going to \"borrow\" your car and total it, so you won't even be able to get your parents to their doctor's appointments. There have been so many AITA posts about people like this lately that it was the first thing I thought of.",
          "id": 50,
          "comments": [
            {
              "score": 200,
              "content": "THIS. \n\nOne of the reasons for his supposed \"trip\" coming up is for me to teach him how to drive.....with my car...hell nah",
              "id": 51,
              "comments": [
                {
                  "score": 60,
                  "content": "Ohoooh, the only time he'll be in your car is if you drive him straight back to his parents house.\n\nActions have consequences. He's a terrible person? he doesn't get the privilige staying with you. His mom didn't raise him right? Well... he's not a well-liked person to hang out with. no matter 'family sticks together' or any other pinterest quote BS is going to change that.  \nYou don't have to suck it up and welcome him in your home while he's clearly a disrespectful and horrible person.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "The short version of what I'd tell your aunt:  No.\n\nThe long version:  fuck no.\n\nNTA, and please please please tell me she didn't try to pawn off the sex ed talk on you too...",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yeah, no. I lived through this exact situation when my cousin went to stay with his grandmother. Got furious at my dad for refusing to teach him, stole his grandmother's car, crashed the car, and also wrecked the kitchen plumbing the same night by putting metal down the garbage disposal repeatedly. Because he was \"the kind of drunk where you just need stuff to work, you know?\"\n\nHe went on to get in trouble for transporting his minor girlfriend across state lines, but that was the next summer. Real winner, that guy.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "His mother can teach him to drive.  Not your job.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Nope nope nope. Make it clear to your aunt that your car is the only one you have for work and taking your parents to their medical appointments. She sounds awfully entitled; sounds like you need to be firm with them/her.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Oh he'll no. That is her responsibility as a parent!",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Nope you are under absolutely NO obligation to host him for any reason.  No is a complete answer.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "He’s going to steal your car. Do you know someone who can take the car and hide it? Only use a direct neighbor if they can put it in the garage and out of sight. They also make small gps trackers for keychains and the like that work with cellphones. Planting one, like duck taping to the bottom of a seat, may be a good idea.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "NTA.\n\nMake it a group call, and tell both of them the same thing.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Make it clear to aunt and cousin why he’s not welcome.  Cousin needs to start to understand that his behavior comes with a cost.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Right. I can't even imagine calling someone else to complain about how poorly behaved *MY* child was. The fucking chutzpah",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I agree that OP is NTA, and that the mother shouldn’t foist her son off on the OP.  But the sons behavior might not 100% her fault.  He might have developmental issues.  I know of someone that had to deal with a similar behavior and it definitely was the case.  One son was well groomed, conscientious and well behaved and the other son basically behaved the same as OP’s nephew; with the arrested development of a me-me-me toddler.  We’re not talking about the usual teenage surliness or slovenliness; it was really bad.  It took until he turned 26 for him to finally mature.  I think the Mom needs support in the form of counseling.",
          "id": 63,
          "comments": [
            {
              "score": 0,
              "content": "yeah, I think so to.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly this. You’re NTA. It’s not your responsibility to deal with her bratty 17 year old",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "...and *tell him* why he is not welcome too! If the truth hurt that's his problem and no one else's.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'm not even sure why OP is asking.....  why would you allow him in your home?",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1374,
      "content": "NTA.... he sounds like a threat to humanity",
      "id": 68,
      "comments": [
        {
          "score": 724,
          "content": "lmaoooooooooooo im gonna start referring to him as that",
          "id": 69,
          "comments": [
            {
              "score": 253,
              "content": "But really..... he needs to be dealt with",
              "id": 70,
              "comments": [
                {
                  "score": 149,
                  "content": "The pause before you say \"dealt with\" makes me think you're referencing a, uh, rather permanent solution!",
                  "id": 71,
                  "comments": [
                    {
                      "score": 65,
                      "content": "But does neutering even have the same behavioral effects on humans?\n\n(I jest of course, but now I’m curious)",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "I mean, that would solve OP's problem... permanently. But no, NTA OP, don't allow this 17 year old nightmare into your home. Tell him he's welcome to visit once he's able to behave his age, not like someone who's 17 months old rather than 17 years.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Ummmmmmm",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "You mean put down?",
                  "id": 75,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Hmmm.... I was thinking something more destructive.... but in short yes",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "NTA. It's definitely time that the starts experiencing the natural consequences of being a shitty guest: you don't get invited back.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Nah mate, you need to stop that. Consider yourself John Conner",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Literally, I’m worried for your elderly parents and their stress levels if you let him in that house.\n\nA blunt “no, he is not welcome here. Gotta go, bye.” Should do it.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I had a cousin like your nephew. He’s a really standup guy now. He changed completely, overnight at a point in his early 20s. I asked him about it not long after and he said that one day he smoked some pot and got way too high had the sudden realization, for the first time in his life, that other people really are people too, that everyone wants and needs and feelings were just as valid as his own and that he’d been causing so much pain. He had never actually had empathy until that moment and had a terrifying panic attack. Woke up the next morning a different person. So there’s hope in the long run.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Probably will make him feel good. I would just call him an entitled lazy snowflake.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Keter class SCP",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No way. Your aunt just doesn’t want him at her home, NTA",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I am sadly inclined to foresee a passage in the local news media Court Reports where the Judge describes the little oik as \"A nuisance to society\".",
          "id": 84,
          "comments": [
            {
              "score": 2,
              "content": "I need to know this... when it happens",
              "id": 85,
              "comments": [
                {
                  "score": 1,
                  "content": "I'm definitely going to follow OP on reddit and hopefully he'll be generous enough to share the link to the missing link standing before us in the dock.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes me too",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 849,
      "content": "NTA, but to be honest I really do not understand why you and many others in situations like this just can't use there words.  \n\nTell his Mother \"I'm sorry but I'm not willing to have him at my place anymore.  Besides the ill manners and attitude, I keep forking out money due to destruction of property, he has no respect for me or my property and treats it like an all expenses paid holiday\"\n\nPeople need to be told so they can sink or swim.  If there are no consequences to someones actions, they will not change.  Obviously your family knows what kind of person he is and should educated out of him by his parents throughout the years.  \n\nJust let them know unless you see genuine changes in your cousin he won't be staying over again.  Nobody has to put up with that kind of behavior from anyone, life is too short.  People need to stop just accepting things you don't want in your life, especially from family.",
      "id": 88,
      "comments": [
        {
          "score": 498,
          "content": "I see what you mean 100% and I did do that one time in the past. I spoke to my Aunty about it but she immediately turned it on me and painted me out as a \"bad big cousin\" because I was being too \"judgemental and harsh\" on him.....she literally said \"wow....listen to yourself\" as I was explaining and it really pissed me off because of the hypocrisy of it.\n\n So now I just let her deal with that shit show and try to ignore the both of them completely when they ask for him to come over, hoping they would get the hint....but I definitely am just gonna have to accept the fact that i'll have to hurt both of their feelings and tell them straight up no eventually : (",
          "id": 89,
          "comments": [
            {
              "score": 459,
              "content": "If she points out your a bad cousin for not having him stay point out that must mean she is a bad mother for banishing her son to his fathers for 3 weeks and now trying to off load him to you for another 2 weeks. I mean a good mother would want her son home after he has been gone three weeks right?",
              "id": 90,
              "comments": [
                {
                  "score": 30,
                  "content": "Good point",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Yeah, OP’s argument is totally strengthened now that she met the end of her rope. And first.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "I mean, if she had dealt with the \"shit show\" when he was a toddler, maybe the part where a near-adult regularly forgets to flush the toilet wouldn't be happening.\n\nShe created the poop monster. She can live with him.",
              "id": 93,
              "comments": [
                {
                  "score": 40,
                  "content": "I think she's pushing him to every house until he turns 18 then it's all his stuff on the lawn and 'Bye bye, deal with it yourself!'\n\nAnd then he'll struggle in the pandemic with no skill or work ethic (or any ethic)",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "“I’m sorry you feel that way but it doesn’t change my answer. No - he’s not welcome at our home”. \n\nDon’t engage with her emotional nonsense when she’s the one who contributed to the problem of your cousin.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Then turn it back on her “I am taking care of two elderly parents, financially providing for them and keeping the house in order on top of working, I cannot sacrifice my ability to take care of my parents to take care of a third individual.”  Big bad cousin turns into caring responsible son who has his parents best interest at heart.",
              "id": 96,
              "comments": [
                {
                  "score": 3,
                  "content": "I don't know why this isn't top comment, honestly.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Aww thank you!!  Taking care of parents is a tough job. His sister needs a wake up call.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "Don't bother explaining. Just say no.\n\nDon't JADE.\n\nJustify\n\nArgue\n\nDefend\n\nExplain",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "What would happen if you just said, No, we don’t enjoy his company. Do not JADE (justify, argue, defend, explain.) You have zero obligation here, so “I don’t want to” is literally all you need to communicate. (Your aunt already knows the reasons, anyway.) Heck you might be doing her a favour by showing her what healthy boundaries look like.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Because she is feeling guilty.   \nPlease continue to stand up for yourself.  This is not a baby cousin, not even a child.  At 17, he can enlist with parent permission, get most jobs, etc.  He will legally be an adult soon and have adult responsibilities. \n\nIt is time for this young man to act like it.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It sounds like she was never harsh enough on him in the first place which is why he grew up to be the terrible, gross human being he is. Had she had any expectations or requirements of him and had set good examples for him he may have turned out to be decent. Now she wants to pawn her mistake off on other people. \n\nPoint out the hypocrisy and tell her she is being a bad mother. She says rude things to you, say them back.  NTA.",
              "id": 102,
              "comments": [
                {
                  "score": 1,
                  "content": "It's not about not being harsh enough. It's about not being LOVING enough to set good boundaries so he grows up into a proper human being.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yeah, if she’s giving you responses like that...then I don’t blame you with just sticking to responses like, “unfortunately that doesn’t work for me” when she asks you to host him.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It’s hard to have these discussions , but it’s necessary. I’m going to suggest you do this on a Zoom/Google Meet call that aunty and the cousin both have to attend, and his father, if that’s possible. If cousin doesn’t show, simply tell aunty to have a good day, and this conversation will only continue when cousin shows. \n\nWhen the call actually takes place, share a list with them of the behavior that excludes him from being in your home. Make it like the one you did above, only more extensive. Tell them both that until cousin can demonstrate exemplary young adult, socially acceptable behavior for an extend period of time (6, 12, 24 months-whatever you like), he is not welcome. Also explain that under no circumstances will you be teaching him to drive; that’s the responsibility of his parents. He is old enough to understand his actions have consequences, and his parents need to know you’re putting your foot down. Your parents’-and your- needs must be your primary concern. If aunty tries to DARVO (deny, attack, and reverse victim and offender) you, shut it down. Remind her that his demonstrated behavior will hold him back from being successful later in life, and you don’t want to be a party to crippling his life. \n\nOP, this is a very difficult conversation to have, but you need to do it, and they need to hear it. It’s not too late for your cousin, but if everyone keeps accepting his horrible behavior, he will never be a functioning member of society. More importantly, you owe it to your parents to not have this stress in your family’s home. I’m wishing you the best of luck.",
              "id": 105,
              "comments": [
                {
                  "score": 5,
                  "content": "thank you so much",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "> use there words.\n> \n> Tell his Mother \"I'm sorry but I'm not willing to have him at my place anymore. Besides the ill manners and attitude, I keep forking out money due to destruction of property, he has no respect for me or my property and treats it like an all expenses paid holiday\"\n\nLol that's more words than I would use. \"No\" is a complete sentence. \"No, thank you\" if you want to be extra polite.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 215,
      "content": "NTA\n\n&#x200B;\n\nWhy would you even consider it? YOu obviously do not want it.\n\nHe can stay at home, with his parents. He is their responsibility, not yours.",
      "id": 108,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 191,
      "content": "Just say no.  Can't do house guests, sorry.",
      "id": 109,
      "comments": [
        {
          "score": 45,
          "content": "And this word should be used with the kid!   OP is the only one to blame regarding his shrinking wallet.   The kid wants something.\n\nNo.  Cannot afford it.\n\nIn fact, if OP was less accommodating, I bet the kid wouldn't want to visit so much.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "NTA\n\nWhy would u have to take him in???????\nIn the middle if a pandemic with his hygienic habits! Why would u somehow be an asshole if u didnt do this??\nHow could you possibly think u were???",
      "id": 111,
      "comments": [
        {
          "score": 79,
          "content": "just cause he's family and my culture is big on that \"nobody gets left behind\" type philosophy so when you try and leave someone behind (even for just a bit, for a break) you automatically look like the bad one. From the perspective of my other extended family, I would be the asshole for not \"supporting him\". There's no room for space",
          "id": 112,
          "comments": [
            {
              "score": 69,
              "content": "If they judge you just could tell your other relatives the truth that you wont help a mother abandon her son for the second time. And you really hope she finally sees she needs to support her son by actually raising him.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Well, then his mother is the bad one. She's the one leaving her own son behind. I'd turn this back on her. How cold hearted can she be that she isn't desperately missing her son after he spent three weeks away from her?",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "If your family is judging you then they can offer their homes. It’s a very simple solution.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "“Nobody left behind” and “family” works on the assumption everyone treats everyone else in the family with a basic level of respect and kindness.\n\nIt shouldn’t be used to take advantage of family, which is what is happening here; and he’s so close to adulthood that this behavior is inexcusable.\n\nIf he wants the support of family, he needs to start treating people like family - which means not being an entitled, rude, gross asshole.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Sounds like they would be happy to have them in their home instead. 🤷‍♀️",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "NTA. She is failing in supporting you as family. He is failing to support you as family. All Aunty is teaching him is that when she has had enough of being victimized by him she will provide other people for him to victimize.\n\nThey are failing to support you in supporting your parents as family. Family only gets family support when they are equally supportive of family. If it doesn’t go both ways it’s not family, it’s just teaching him how to be a better parasite. Just no.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "How would you be the one abandoning someone elses child by not letting said child be abandoned by its mother?\nI still dont see the trail of thought behind that.",
              "id": 119,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "I would write out the rules and make him agree to them. Tell his mom to give you money for an Uber. If he breaks any rules his ass is on the way home immediately. This way you can support him until he screws it up. When he goes home your family knows it was his fault.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Why aren’t other family members stepping up to help this child “not be left behind”? Why is it your responsibility? \nNo, no, nopety nope!",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Nobody gets left behind means that you don't desert them when they are struggling, not that you put up with them no matter what they do to you.\n\nIf anything saying no to them today and explaining why would do them much more good than allowing to visit. It might be their first dose of actual accountability in all his life and that's something that he needs to learn for himself and others.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "I would not want that person in my house at all. The only argument they can make is 'family', which doesn't excuse any of the listed behaviour. Sounds like she's trying to dump him on you. NTA.",
      "id": 123,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "I don’t know that you’ll see this, but I hope you do. I have a nephew that I love very much, who I absolutely adored as a child. As soon as he was old enough he would spend a week or so with us every summer, play with the cousins, make memories...it was something I looked forward to every year.\n\nUntil he changed. He became sullen and smug, condescending to his cousins who just put up with it because they loved him. It wasn’t until he called my child a freak and me a bad parent that I finally stepped back and said that his visits weren’t good for any of his, including him.\n\nSo I stopped them. I haven’t contacted him in a couple of years. He’s an independent young man, not a moody teen, and if he wants or needs to talk he knows how to reach me. That door isn’t exactly open, but it’s certainly unlocked.\n\nYou get to choose the relationship you have with your cousin, but only in the context he allows. He will not be kind, or pleasant, or even moderately respectful. All you can do is choose to endure or avoid that encounter. \n\n“No, sorry, you can’t stay here this summer.” That’s all you have to say.",
      "id": 124,
      "comments": [
        {
          "score": 30,
          "content": "I saw this, thanks a lot. It's so hard to balance the love and discipline, especially when they are so much younger. \n\nThank you for the advice :) I like the notion of them knowing the door isnt exactly open, but its certainly unlocked.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA.\n\nThe fact that his mom can't deal with his behaviour is not a YOU problem, it's a HER problem.\n\nIf I were you, I wouldn't host him either.",
      "id": 126,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "NTA But if you’re living at your parents it’s probably not up to you. All you can do is talk to them and then refuse to go pick him up, but if they hear you and do it anyway then there’s not much you can do.",
      "id": 127,
      "comments": [
        {
          "score": 45,
          "content": "Thats the exact situation sis :( \n\nbig part of the reason why i'm moving back out hella soon, so I can make my own executive decisions on shit like this",
          "id": 128,
          "comments": [
            {
              "score": 21,
              "content": "Well, there is something that you can do, I know it isn’t much. Tell your parents that you are not going to be involved with him. So you can ignore I’m as much is possible. If you have more then a bathroom don’t share with him. Put away your money so he can’t take them and totally refuse to go out to eat or shopping with him. Your parents can get upset but they can’t force a 25 years old man to spend his money or go out with him. I know is not a solution but at least you will save money. I’m sorry for your situation.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I don’t blame you! I have no desire to ever move back in my mom/family - love em to pieces but I like to control my own space. I would not be ok with cousin coming over either. Good luck and hope move out day comes soon!",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "In that case tell them you are absolutely not participating.  Not driving to get him, not interacting with him, not buying him a single thing.  If he is there, he is 100% their responsibility.  \n\nI know that's harsh and will be hard on them, but if they are going to override you, they really need to understand that they have to handle him, not you.  That may cause them to back down.\n\nAlso, if he does come, get a good lock for your door and keep anything you value locked a way.  I really hope you have your own bathroom that he can't access...",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If you think your parents are going to push you, talk with them first. Be clear about how bad his behavior is and, considering he was sent to his father’s, as bad as it was before, it’s probably worse now.\n\nBe clear that if they want to deal with him, they can have at it, but you’re not going to have anything to do with him. And then find a way to make yourself scarce. Maybe see if you can couch surf at a few friends’ places, and a few nights in a hotel, so you’re not at home for most of the 2 weeks. I get that you still need to take care of stuff for your parents, but you can pop back for a few hours at a time for things you need to do.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -27,
              "content": "This changes the entire post. You can't say yes or no and should just tell your aunt to talk to your parents about it not you. Then if your parents have him over anyway, if you pay rent, ignore your cousin and let him be their problem, if you don't pay rent, do what your parents ask or move out.",
              "id": 133,
              "comments": [
                {
                  "score": 33,
                  "content": "It doesn't change a thing. My parents are not the type to kick their kids out as soon as they turn 18. I'm from a different culture where the kids stay at home and work to support their parents until its time to get married. The house is viewed as \"shared\"... yeah my parents names are on the legal docs, but we view things a bit differently. I have just as much of a voice as they do because I am the main bread getter. My own personal situation requires me to move out soon though.\n\nI'm not some bum sitting home mooching off of them. I work full time, I help pay bills, I do groceries, and I would be the one to go pick him up and take him home as I am the only one out of my parents and I that drive.. out of my own pocket. So I think I have the right to say yes or no. Also my parents tell me that its up to me......so... ya...thanks",
                  "id": 134,
                  "comments": [
                    {
                      "score": 10,
                      "content": "My reading of your OP was in line with what you just wrote in this comment, but the comment of yours that I replied to told another user that \"it was the exact situation\" when what they described was more in line with the bum you just described. \n\nSince you are the breadwinner and staying in the family home while contributing as an adult, yes, you absolutely have the right to respond as you see fit here without being the asshole. Especially with your parents backing your call. NTA",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}