{
  "post content": "My BF (33M) and I (29F) have been dating for 3 years.  He owns a house and lives there by himself.  I live in an apartment by myself.  We've talked about moving in together as that's the logical next step in our relationship and we both want to do it.  But I have some hang-ups related to moving into a house that I don't have any stake in.  \n\nI am refusing to pay any money that would go directly towards his mortgage.  I don't have any stake in the house, why would I contribute to his mortgage payments?  I'm ok helping with utilities, groceries, household items, etc. But paying his mortgage is a hard no from me.  I just don't think it makes any sense for me to pay towards his mortgage when I would get nothing from that if we were to break up.  \n\nHis argument is that I would essentially be living with him for free and it would cause an uneven dynamic in our payment towards shared living expenses.  Which, I kind of get, but at the same time he's the one benefitting from paying down the mortgage and gaining equity, not me.  He also argued that his mortgage is pretty much exactly what I was paying in rent, so by cutting that in half I am saving a lot of money on living costs compared to living on my own.  Which, yeah, that's nice too, but legally it's still not my house.\n\nI told him the only way I would pay money for \"rent\" is if he signs a contract with me stating that any money I pay towards his mortgage will be paid back to me, by him, in the event that we break up.  It would also allow me protection from eviction and other basic tenant rights, similar to a rental agreement.  He is refusing to sign anything like that because, in his words, I could break up with him for no reason and then take him to court for thousands of dollars.  Which, I suppose is true but I wouldn't just break up with him for no reason.\n\nThis whole situation is driving a wedge between us and he's pissed at me for \"being so difficult\" when all he thinks he is asking is that we split living expenses 50-50 if we are to live together.  To me, it's not that simple when he's the one owning the house we would live in.  If I were on the title, it would be a different story, but he's not willing to put me on the title because he's lived there for 7 years already.  \n\nMy lease at my apartment is up in 2 months and I know I need to make a decision sooner than later.  It doesn't help that my landlord is going to be increasing my rent, and similar apartments in our area are going for even more than I'm currently paying.  But I just don't feel right contributing money towards his mortgage.  I also know that if I renew my lease, it's pretty much a dagger to our relationship, which I don't want because I do love him and see a future with him.  I just want to make sure I'm protected.\n\nI can tell my BF's patience on this is wearing thin and he's upset with me for digging my heels in on this.  But for me, this is about protecting myself for the worst-case scenario while he's not really risking anything.",
  "id": 1,
  "comments": [
    {
      "score": 46706,
      "content": "You clearly don't have any problem paying your landlord's mortgage and you have no stake in that. How is this any different? You live there, you can help pay for the expenses. YTA.",
      "id": 2,
      "comments": [
        {
          "score": 11897,
          "content": "Yes, exactly this! OP is going to pay on someone's mortgage. Might as well be her partner's. And if their relationship continues, she truly could benefit longterm.",
          "id": 3,
          "comments": [
            {
              "score": 6019,
              "content": "Exactly! She has more chance of seeing a return here than her 0% chance of seeing a return renting.",
              "id": 4,
              "comments": [
                {
                  "score": 2810,
                  "content": "Yeah honestly she's just being combative to the point that it's actually hurting her in the process. Go live with him. \n\nContribute to the bills that you're responsible for. If you don't think you can afford $1000 or $2000 discuss with him what's reasonable for you to pay. Personally I think if I'm saving $500 or more a month, then just do that choice. Save up your money, and consider putting a down payment on the house, if you're not at the stage for marriage and you don't see a future for the relationship.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1585,
                      "content": "I’m not even sure this post is real, a month or two ago? (I think, I have no sense of time) there was a post almost identical to this. By identical I mean it had all the same complaints, the OP brought up the exact same idea of bringing a contract, the partner replied the same way, and OP had the same reason for not wanting it and stuff like that. \n\nThat or I’m having hella deja vu.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I appreciate this thread. I posted a while ago on a dating subreddit asking about how people dealt with this exact situation, and a few people basically told me I was a terrible money-hungry person for even considering having my boyfriend pay any amount to live in my house.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I don’t think she is seeing it that way. In her head she isn’t paying rent or for living in his house. She sees it as paying towards his mortgage and when it’s paid off he owns the house and she owns nothing.  She needs to separate the two.  Either move in and reduce costs so you can save more towards your own home and if it works out and you marry get on the deed or buy a new place together.  If it doesn’t work out you may have some nice savings.  Otherwise stay where you are ruin a good thing and don’t move forward or save money.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I would argue it's worse than that really, because not only will she never see any benefit from her rental money long term, it's also guaranteed rent will always increase overtime.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 827,
              "content": "When my then boyfriend moved in with me to my house, we split all the costs of living here 50/50. His effective rent went down, his standard of living went up, and he was able to contribute much more to his retirement. Twenty years later, my house is paid off (we are married, the house is still in my name, I do recognize that some of it is his now  due to community property), and he has a very nice retirement fund that he would not have had this early otherwise. Basically we each have each benefited the same amount - my home value and his retirement fund, which worked out well for everyone.    \nOP would have to pay to live anywhere, and her BF may well be saving her money AND offering a nicer place.",
              "id": 10,
              "comments": [
                {
                  "score": 260,
                  "content": "I'm in a very similar arrangement. We both benefit greatly. OP wants to cut off her nose to spite her face. I'm so glad you and your husband were smart about this from the beginning!",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "When my dude and I were looking for a house a few years ago, we went in with the agreement he was purchasing the house and I’d pay him rent. I told him what I could afford per month so regardless of what house he (we) picked, he knew what I could contribute. Ultimately, decision was up to him, but he wanted 50/50 input since it is “ours”. \nWe are engaged now and will reassess the title when we marry, but we are both in total agreement with our arrangement and everyone is happy. That’s pretty much what it boils down to. \n\nIf OP and her SO can’t / won’t agree on the solution for this kind of commitment, it might not be time to do it.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Op's rental expense will be half if she lives with her bf.\nEdit:typo",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Boom 💥 THIS!!! I wish my Bia**ch Mother could read this as she has always said our house was HER HOUSE , when fighting with my Pop about money. Down payment put down by mommy and daddy when she was almost 40 and it was the third house that had happened on. \nIShe regularly benefited by being on his insurance and all kinds of other things. People just bite off their nose to spite their faces. They’re dumb stupid faces\nPlease forgive my typos I am on auto dictate and very very tired",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "[removed]",
              "id": 15,
              "comments": [
                {
                  "score": 9,
                  "content": "Yeah. This is an analysis and ethics and relationship fail. YTA, definitely. It’s a bad indication of how she will likely react to future financial issues that they may face as a couple. \n\nHopefully her bf has had enough and breaks up with her. No one wants this misplaced resentment and selfishness in a relationship, especially since she seems way more focused on it failing than on working for its success.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Honestly - if this was my partner and they viewing things this illogically - this would be a red flag in terms of tackling finances together in the future. \n\nSeriously. Like what bizarro logic the OP has. \n\nEspecially this nugget of a statement:\n\n\"He is refusing to sign anything like that because, in his words, I could break up with him for no reason and then take him to court for thousands of dollars. Which, I suppose is true but I wouldn't just break up with him for no reason.\"\n\nYeahhhhh.....you have zero trust in him but you want him to just take your word that you would't screw him out of thousands...and this is AFTER you explained to him your bizarro world logic as to why you don't need to pay rent in where you live if that home just happens to be bf's mortgaged home. \n\nBest of luck in life finding a partner that will go along with this logic.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "How much of her current living accommodation does she own? Or has she gotten a return of any kind from her current landlord?",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "There's this weird thing that happens with people that would rather give more money to and get less out of a stranger than they would their romantic partner because they are somehow thinking of the worst case scenario in the future and how they would feel almost taken advantage of and pouring salt on the wounds of a possible and maybe likely break up.\n\nIts weird as fuck and logically makes no goddam sense, but it seems to be common enough and they're willing to spend more money and save less to die on this weird hill.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5022,
          "content": "There is one difference - her landlord can’t break up with her and leave her homeless without following the legal eviction process, which seems to be one of her concerns. But the answer to that isn’t “don’t pay rent,” it’s “put it in writing.” Become a legal tenant.\n\nEdit: Wow, thanks for the awards! Even though it seems what I thought could happen is illegal in a lot of jurisdictions. I still think it’s a good idea to consider it rent and put everything in writing. It would protect both parties.",
          "id": 20,
          "comments": [
            {
              "score": 1876,
              "content": "Nope, boyfriend couldn't kick her out without proper notice either. If you reside somewhere for longer you become a tenant regardless if you signed anything or not.",
              "id": 21,
              "comments": [
                {
                  "score": 916,
                  "content": "Yeah but imagine the stress and general unpleasantness of living with someone who wants you out of there. At least your landlord doesn't live with you usually.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 501,
                      "content": "Good point, but it may be better than being homeless.\n\nOP, YTA. Pay him some rent. Carry your weight.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 292,
                      "content": "Since the rent she would pay her boyfriend is literally half of what she currently pays for her apartment, if I was her, I would just keep setting aside the monthly savings into a rainy day fund.  If she ever had to cut and run, she would be able to dip into that savings immediately and still come out ahead.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 178,
                      "content": "Yes, but that would be an issue whether it was the boyfriend’s house or if they were to get an apartment together. Whether or not the boyfriend owns the place doesn’t make a difference with that issue",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 111,
                      "content": "This would be true of any couple that lives together in any type of housing though. It's almost worse when you're renting because you have to worry about when the lease term ends.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Serious question to your thought… if they rented together, wouldn’t she still be living with someone who doesn’t want her there?  The only difference is she has an equal playing field for who is forced out?  \n\nI guess the real question is how she can protect herself from being kicked out in case of a breakup.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I've heard many stories of an ex-couple that are still sharing the same apartment (usually in different rooms) because they can't break the lease and are holding out until it ends.  At least with this arrangement she'll hold all the cards.  He can't force her to leave until her lease arrangement ends, but if she wants to leave, he'll be unlikely to prevent it.  Besides, she could easily write up a lease agreement where she's allowed to leave any time but he has to give a certain amount of notice.  That would seem much more agreeable than trying to horn in on equity she'd never be entitled to under any other circumstances.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "the simplest solution for op is to buy her own house. that way she can make her own rules.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yeah, but it also sounds like op would be paying less than current market rates for rent. She can save money in case they ever break up and she needs to rent again.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "How would this be any different if she didn't pay rent? There are other solutions, but her not paying a fair share of the rent isn't one of them.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "But she wants it in writing that she can produce that stress in the event of a breakup.\n\nIt's not about rent, it's about being vindictive in the event of a breakup.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Protections are depending on jurisdiction and usually completely different when cohabiting with your landlord.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This is not true everywhere",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Not sure that's the case in every state...",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Depends where you are. Some places consider it a roommate situation if you share a kitchen or a bathroom with the owner and can be removed by police immediately.",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "This is not entirely true. Riles for eviction are much less strict if the person you're evicting lives in the same domicile as you vs in a separate one you own.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "It really depends on where you live what proper notice is. Where I live, if I were in OP's shoes, I'd have to be given 90 days notice (the owner occupant wishes to remain in the home, so they wish to use it for exclusively personal use; tenants (anyone who has resided there for more than 30 consecutive days) must be given 90 days written notice to vacate). In many places in the world, it could be much less than that. Obviously, this is a \"lesser included\" concern for OP, but getting at least some notice to vacate in writing sounds like it would go a long way to easing her mind.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 280,
              "content": "Actually,  if the person lives in a home (this could also depend on the country and state but from my experience) in order to kick someone out you still have to serve an eviction notice.  And to determine residency is simply by if they stay and receive mail.   It’s not a commonly known thing so I encourage people to look into it for their area to know their rights.  If I even wanted to kick my kid out when he reaches adulthood I would have to give him an eviction notice (not that I would do that to my kid)",
              "id": 39,
              "comments": [
                {
                  "score": 73,
                  "content": "Yes! The flip side to that is if op’s boyfriend did decide to give her eviction notice in court instead of breaking up with her and the 2 of them deciding a good move out day together, that court process will show up on her application and ruin her renters credit.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 147,
                      "content": "Or..... OP could just leave within the legally required time frame after BF gives notice?\nThe first step in an eviction proceeding is not straight to court eviction on your record. Generally the LL asks the person to leave first.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "[removed]",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "This is not true in most countries in the world. Anyone should be careful allowing a friend or family member to \"just stay a few weeks\" for this reason because they can absolutely claim tenancy and you will be required to go through the entire legal eviction process lol.",
              "id": 43,
              "comments": [
                {
                  "score": 12,
                  "content": "In most parts of Canada you are not a legal tenant if you share a kitchen and bathroom. \nYou are a lodger with few rights even if paying rent.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It's the same in the UK.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "> There is one difference - her landlord can’t break up with her and leave her homeless without following the legal eviction process\n\nNeither can the boyfriend.  He would have to legally evict her even without a signed lease.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "If she pays him monthly and lives there she gets the same protections to eviction as she would in a month to month contract. He is still her landlord even though they’re in a relationship.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Then OP and boyfriend should create a \"renters agreement\" for her, where she is basically agreeing to pay rent every month in order to live there, and in any event they break up she has X amount of time before she has to vacate the premises.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "But also, her landlord doesn’t have to pay her back if she ends the lease and leaves. She’s not asking to be a legal tenant, she’s asking to have the legal rights of a tenant without paying rent. \n\nYTA - you can’t have it both ways OP. You also don’t have any leverage - it’s not like you own your apartment and are giving up equity elsewhere so asking to go into a property together. \n\nYou’ll be paying half the rent you are now. Save the other half to save for your own home deposit. Your point of view right now is nonsensical.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Her boyfriend can't legally do that either...",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 914,
          "content": ">stating any money I pay will be paid back to me if we break up\n\nYeah, good luck ever getting that in a rental agreement. YTA.",
          "id": 51,
          "comments": [
            {
              "score": 400,
              "content": "Yeah, that's the wildest part to me. She just wants to live for free.",
              "id": 52,
              "comments": [
                {
                  "score": 54,
                  "content": "I wonder if OP would be willing to pay all of the house expenses, up to the cost of the mortgage, then 50/50 after that. Not far to expect to live for free. If, like she said, just doesn't want to pay the mortgage but is willing to pay the same in household bills, then it's a wash. They will both save money but she gets to feel like she gets her way, even it's if petty.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 72,
                      "content": "That just feels like accounting for accounting’s sake. She is reducing her rent by 50%, be happy with just splitting everything down the middle. Unless they want to do some percentage based on how much each make, it doesn’t really matter.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 207,
              "content": "Agreed, YTA. Owning a home is an expensive endeavor. At only 7 years into a mortgage (assuming it’s a 30 year note), very little of that monthly payment will go towards the principal anyway. Then there’s all the maintenance and upkeep. Not to mention the initial down payment, points, inspections, PMI, earnest money, commission and other closing costs. You’d be paying rent regardless. What difference would it make to whom the money goes?",
              "id": 55,
              "comments": [
                {
                  "score": 38,
                  "content": "Exactly.  \n\nShe doesn't want to contribute to his mortgage payments but is fine with contributing elsewhere then ok.  Think of your rent as going towards the taxes, insurance, maintenance and upkeep, utilities, perhaps PMI/HOA, etc.  All of that combined could easily be more than the mortgage.\n\nAnd she is wrong that he doesn't have any risk.  There is a big opportunity cost for his money used on the down payment and closing which could have be invested/spend elsewhere.  Even with insurance (which is limited in what it covers), he risks losing his investment in the event of certain disasters.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "LOL what landlord would pay back her already paid rent if she STARTED banging him, much less if she stopped?",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 320,
          "content": "The only thing where she is in the right is a protection against eviction. That's one risk that I was never willing to take on, hence I never lived with any of my BFs. But otherwise she's getting a really good deal to pay lower than market rate and live in a nice house. If the 'idea' of paying his mortgage is the problem and she's willing to pay the equivalent amount monthly in living expenses than it's a wash and they both should be okay with that. But no, she can't expect to be paid back if they break-up!",
          "id": 58,
          "comments": [
            {
              "score": 101,
              "content": "Those protections already exist. Even when living with a friend, family, etc, once you have lived there for 30 days they have to go through the standard eviction process to remove you.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ultimately it really shouldn't matter if some of her money goes to the mortgage but yeah a good compromise would be to make her pay equivalent elsewhere. Maybe some kind of agreement if things go south that give her some protection but nothing crazy like getting all her money back. Though honestly she would be indirectly helping him pay the mortgage if she did that, she really cannot escape that but if that's what it takes to make her happy then I suppose so.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 214,
          "content": "100% he needs to tell her it isnt mortgage she's paying, it's rent and he decides where the money goes. people get so weird on here about \"ill give them X amount but it HAS to be used to pay utilities, not the mortgage\" like they don't understand how it makes 0 difference where your specific digital numbers go. either way mortgage is paid and so are utilities and half of it is cuz of you.",
          "id": 61,
          "comments": [
            {
              "score": 27,
              "content": "Exactly.  The people who think this makes a difference are really dense.  It drives me crazy, but you explained it better than me who just wants to say, \"That doesn't matter!\"",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Absolutely. Someone else kept trying the money-is-fungible argument. Their advice was a separate account *just so OP can be appeased the money never touches*. Im still trying to get my eyes to unroll.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It's so arbitrary, I don't know why she's so hung up on it. If a boyfriend moved in to my house with me, the \"rent\" $ isn't necessarily going to the mortgage. It's helping heat the place, it's paying property taxes, paying for repairs and maintenance...",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "Plus rent doesn't just cover the mortgage. It covers maintenance so the building remains habitable. That costs a lot more than most renters realize.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "This is exactly what I was thinking",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "[removed]",
          "id": 67,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Thank you for being reasonable!!\n\nThere have been so many posts on here about this topic and the homeowner always gets blasted for not letting someone live for free in their house. \n\nI don't know why the person with a mortgage to pay is the bad guy because they want to be paid when someone is using their property. If I owned a private jet and my friends wants to use it - I wouldn't eat the cost of fuel, staff, and wear. And if my friends paid for their trips fuel, staff, and wear they don't get to own part of my plane. They paid for their use. They don't own part of the airline's plane when they buy a ticket. \n\nThose posts have actually made me pause in considering a serious relationship. Wtf am I supposed to do? Let someone live rent free in my place?\nOr if they pay a rent, do I risk losing my house because someone I am starting to get serious about thinks they own part of my house because they paid reduced rent?\n\nGenuinely wondering what the proper respectable relationship and legal set up is? \n\nAt this point, I wouldn't let a boyfriend move in with me. It seems like a big point of fighting for couples and it risks the biggest investment of my life.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "\"any money I pay towards his mortgage will be paid back to me, by him, in the event that we break up\"\n\nI couldn't help but laugh at this. This sounds like a relationship contact not a rental agreement. Not only that, but it sounds like she wants all her rent money back even if she breaks off the relationship. HAHAHAHAHA 😂 \n\nHow does she not see this as unfair to her BF? She should pay the full amount of rent that she would normally be paying if she stayed where she is and get reimbursed half if he's at fault in the break up. She gets nothing back if she's at fault. Or, just do what most reasonable people do and both pay half and they both save.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14411,
      "content": "?\n\nIf you were moving in to an apartment together would you refuse to pay rent?\n\nI don't know if it makes you an asshole, but he's definitely right and you're definitely wrong.",
      "id": 70,
      "comments": [
        {
          "score": 1367,
          "content": "She would be protected from getting kicked out the very next day and her living there without it anything written wouldn’t ensure her safety. I would be anxious too if he demands me to move out the next day but naturally you can’t find a new place the very next day and need time to find for a new apartment. Time he might not grant her depending on the reason of the break up and time she absolutely needs.",
          "id": 71,
          "comments": [
            {
              "score": 1674,
              "content": "Laws vary by state, but once she’s established tenancy he cannot kick her out the next day.  He would have to give her the legally required notice period , typically 30 days.",
              "id": 72,
              "comments": [
                {
                  "score": 617,
                  "content": "Whether or not she is paying rent to him she will be a tenant with effectively no written lease.  Her state laws lm eviction wi apply.  She can't get kicked out on a whim.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 328,
                      "content": "Unless they, you know, get a lease drafted. Why doesn’t anyone ever just ask a lawyer? That’s the entire point of them.",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "That and they could still have a contract saying he needs to give her 30 days notice without him having to pay back the full amount of rent she’s paid because that is completely unreasonable",
                  "id": 75,
                  "comments": [
                    {
                      "score": 7,
                      "content": "she doesn't need the contract after 30 days of continuous living there. By the way, after 1 year of living there she basically had 6 months rent free compared to her current situation, with that money she could live in a hotel for a whole month with breakfast included if it was really necessary. And we're not even talking about the fact that she was able to live in a house compared to living in an apartment, while making that giant saving.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "In my state of you receive mail it’s a 30 day written notice",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 645,
              "content": "Then couldn’t they just draft and sign a lease? The money back if they break up request is absurd",
              "id": 78,
              "comments": [
                {
                  "score": 122,
                  "content": "but then she would spend money towards his stake in the house!?!? its so unfair /s",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 43,
                  "content": "This is the way. My now husband/then boyfriend drafted up a lease for me and my brother when he bought the house we were all renting together. My credit was shit at the time so I wasn't able to get a loan with him which was a total bummer, but us having a lease with him helped him to qualify for the loan in the first place, which was really the reason we did it. I was paying more renting from the landlord than I am now paying 1/3 of the mortgage as my rent instead. \n\nIf we had broken up, I'd have just been stoked on how much money I saved during this time he's been my landlord lol. Now we're married though so this shit is half mine regardless of what happens. Guess he's stuck with me 😂",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "If there's a chance he might break up with her at the drop of the hat and make her homeless, she shouldn't be moving in with him in the first place. Ive known plenty of couples who break up mid lease and cohabitate until they can move out. Yeah it sucks, but if you're a decent human being you're not gonna force someone onto the street.",
              "id": 81,
              "comments": [
                {
                  "score": 47,
                  "content": "Some people act very different when they break up, especially if they're the one who got dumped. This type of behavior isn't predictable and I've seen genuinely nice people turn vindictive especially if cheating were involved.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Then his point is just as valid, that she could break up with him for no reason and take him to the cleaners. She claims she wouldn't do that, but how does he know if we're saying there's no way to tell if someone will be vindictive in the future?",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 131,
              "content": "So sign a lease",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "They could easily draw up a tenancy agreement",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Then they sign a lease. But her wanting repayment if they break up is ridiculous. She pays her current landlord’s mortgage. They won’t pay her back for it all if they break up.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She can’t be kicked out once she moves in and has established residence. She will have to be legally evicted",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This is an argument for them to draw up a tenancy agreement, not for her to live there for free.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Oh but she would never break up with him just to get money back, but he would certainly kick her out the very next day she moves in... after 3 years.  None of her fear-based logic makes sense.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "That’s the one thing I agree with OP on - it wouldn’t hurt to have something in writing confirming her ability to continue living there for a time certain in the event of a break up, which is something she would have under normal tenancy laws and that can get murky (depending on jurisdiction) when she’s just living with boyfriend. But she’s dead wrong on the financial side of it.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": "This was exactly the situation when I moved in with my now-husband. We immediately started a shared household account and split ALL expenses 50/50. \n\nIf a couple is going to live together, presumably you love and trust each other and are committed. If not, live alone and pay your own bills. OP is YTA.",
          "id": 91,
          "comments": [
            {
              "score": 71,
              "content": ">If a couple is going to live together, presumably you love and trust each other and are committed.\n\nThis. I suspect that's the crux of the problem right here. I suspect they aren't really ready to be living together.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "[deleted]",
              "id": 93,
              "comments": [
                {
                  "score": 20,
                  "content": "Came here to say this - share expenses and pay him rent.  He is responsible for repairs and upkeep, taxes, etc.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I suggested the same above. And that rent is likely to be way less than independently renting something as the rent market is so expensive these days. But yes, pay rent, all maintenance is on boyfriend, split utilities. Insurance though ... she should probably contribute if she can't get a separate renters policy.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Exactly. This suspicious approach and fear of getting screwed seem more like an unwillingness to commit due to lack of trust. If, after 3 years of dating you are unable to trust your partner to take this leap then either 1. There is a reason to not trust him-and it’s time to move on 2. You lack of trust is unfairly being placed on him and you aren’t ready for this kind of relationship until you can deal with why this is. I have a hunch this is your general defense - to try and ensure you will never get hurt- all the while damaging someone who loves you and deserves your trust. \nMonetarily, pay your rent. This comes off as greedy and controlling. Don’t dwell on where your dollars go once they’re given. Obviously, he will pay his mortgage and obviously rent paid to him would be mixed with the rest of his money. Were you planning to mark your dollars with your name and put them in a piggy bank for cash-only groceries? Get real.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm looking for houses with my boyfriend of 8 years, but won't be on the mortage as we're looking at multifamilies with his brother, so we'd live in one unit and him the other. I didn't even think I wouldn't be helping pay because like... I'll live there?? We want to get married, it's our collective financial situation it affects lol. If he's paying all the mortage, I'd just be paying all the other bills and it's literally no different because that's our collective pool of money that needs to be spent on our collective living expenses. \n\nReading this I was just like wow, you definitely should not be moving in together lol. It reads like shes only moving in bc her lease is up and she'll be up shit creek without a place to stay, so shes rushing into living together with a guy she's super not 100% on. And then decide she shouldnt pay rent bc she doesn't plan on being there long lmao",
              "id": 97,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "It does make YTA, OP. It does.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Her demands are delusional. Imagine telling your landlord that you're getting all your rent back in case you move out.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "yeah i don’t really get her argument. think about it as she’s just paying rent. yeah he’s getting value he’s the landlord and she’s getting value from living there",
          "id": 100,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I don’t think she’s an asshole but very wrong and I would take this as a red flag if I was her bf.  She mentions building something with him…. Umm paying money together towards something is how you do that!",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "\"best why should he benefit with equity if I'm not benefiting by building equity too?!\" /s\n\nAnswer: OP there's nothing stopping you from going and buying a home, renting it out, and building equity,  while you are living with your bf!\n\nShe's obviously never owned a home or paid into a mortgage or she'd realize how little of a monthly payment after only 7 years on a standard 30-year note is going to principal after interest, taxes, homeowner's insurance, private mortgage insurance (PMI), and of course maintenance costs which tends to eat up most landlords profits)!",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11114,
      "content": "[removed]",
      "id": 103,
      "comments": [
        {
          "score": 1695,
          "content": "[removed]",
          "id": 104,
          "comments": [
            {
              "score": 116,
              "content": "[removed]",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1099,
          "content": "[removed]",
          "id": 106,
          "comments": [
            {
              "score": 333,
              "content": "[removed]",
              "id": 107,
              "comments": [
                {
                  "score": 158,
                  "content": "[removed]",
                  "id": 108,
                  "comments": [
                    {
                      "score": 46,
                      "content": "[removed]",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "[removed]",
              "id": 110,
              "comments": [
                {
                  "score": 6,
                  "content": "[removed]",
                  "id": 111,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 282,
          "content": "[removed]",
          "id": 112,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 76,
          "content": "[removed]",
          "id": 113,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 59,
          "content": "[removed]",
          "id": 114,
          "comments": [
            {
              "score": 6,
              "content": "[removed]",
              "id": 115,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "[removed]",
          "id": 116,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "[removed]",
          "id": 117,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I tried to click through and had trouble, for anybody else - https://www.unddit.com/r/AmItheAsshole/comments/wcv0fs/aita_for_refusing_to_pay_rent_to_my_boyfriend/",
          "id": 118,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "[removed]",
          "id": 119,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8141,
      "content": "YTA. Ask yourself: Would you ask your landlord for the money back you paid when you move out? Or ask your landlord if he put your name on his house because you paid rent for a couple of years?  \nIf no: why would you expect your boyfriend to do so?",
      "id": 120,
      "comments": [
        {
          "score": 1910,
          "content": "No matter how she tries to justify her position, it’s clear as day that she’s greedy!!! He needs to count his blessings and run. \n\nYTA Op because you want to be part owner because you would be paying rent. You know it makes no sense unless you think your bf is a sucker. People are so entitled these days. It blows my mind 🤯",
          "id": 121,
          "comments": [
            {
              "score": 845,
              "content": "I'm not sure if she's greedy or accidentally misapplying advice about buying a house with someone you aren't married to.",
              "id": 122,
              "comments": [
                {
                  "score": 328,
                  "content": "That’s what I’m seeing. I can see she’s taking what if’s into consideration but she’s not making reasonable negotiations.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I think \"reasonable negotiations\" are the thing, here.\n\nBF (of about a year) stays with me about half time. Right now, he just pays the difference between my utilities when I live alone (I know what those are because I lived in this house alone for an entire year during the pandemic) and now. He has no tenancy rights because he's never spent more than 30 days consecutively here.  It's a super-favorable arrangement to him because I live A LOT closer to work, so he's saving hundreds, maybe even thousands with how gas prices are right now, of dollars a month commuting, but he is maintaining his own residence (both physically and with payments...he also owns) and I'm out nothing, so it works for now.\n\nWe've talked about what the future looks like. If he lives here full-time, at first, it would be half the \"non-buying\" costs. So taxes, insurance, maintenance (based on the way things work around here, that's 1% of the home's tax assessment per year and half of anything that needs done and the pot saved up doesn't cover), and utilities, split down the middle. He gets no money back and no ownership stake. If we get married, he intends to buy a stake in my house (and me his, which he already partially rents as it's two units and would fully rent if we went full time...so we'd just settle up the difference *on purchase value*) and we both go halvsies on all expenses and gains. Both on titles, both co-owners. I would make out better in this because it's on purchase value and not mortgage balance (I put a lot down on my house), but that's agreeable to both of us.\n\nI think the \"full time cohabitating, not married\" is where OP is. And for my relationship, that means not paying toward principal or interest, but splitting ALL the other costs of the place we live. But with an expectation that there will be a lump sum moving one direction or the other (we both know what direction that's going) once and if the papers are in place. The taxes, insurance, maintenance, and utilities are more than you might think...if we went full-time cohabitating, BF would be paying me almost $700 a month for half the bed (he can also do whatever he wants in the rest of the house, of course) and all the utilities he uses...whaddya know...that's about half my PTI (I don't have mortgage insurance because I put a lot down, and also no HOA) mortgage.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 179,
                  "content": "I think you nailed it, a lot of her points are use the same lines of logic but she failed to recognize that she is not in that position so the logic is void",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">accidentally misapplying advice about buying a house with someone you aren't married to.\n\nA lot of people had the idea that you are a partnership, you should merge finances and share everything. But this died down a few months ago on AITA.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah that's for after marriage when you have protections if you decide to separate.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "But they aren't buying a house, he already has it. It would essentially be her paying rent.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Hence why she is MISapplying the advice.  Perhaps it's something she half remembers being warned about the importance of being on the title when paying a mortgage with a non-spouse and has forgotten the detail that it's about having a significant amount of money tied up due to contributing to the down payment.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "i dont think she is greedy i just dont think she understands how relationships or finances/houses work.",
              "id": 130,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Exactly and she is SAVING half her rent!!! So it is already a win for her!!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Does she truly think he’s just gonna add her to the title of a house he’s owned for 7 years? Then they break up and she’s entitled to a part of it… hell no. \n\nBut also, does she think it’s ok for her to just live there for free? No dude, you have to pay rent. And yeah, sorry that rent goes towards his mortgage but it’s hard for me to understand why that actually bothers you so much.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5020,
      "content": ">I told him the only way I would pay money for \"rent\" is if he signs a contract with me stating that any money I pay towards his mortgage will be paid back to me, by him, in the event that we break up.\n\nSo you could cheat on him, and if he dumped you he'd owe you money?\n\nLMAO. That is ridiculous and he should have dumped you on the spot.   \nYTA",
      "id": 133,
      "comments": [
        {
          "score": 931,
          "content": "Is your landlord paying you back for the money you’ve paid into your current apartment?? Yaaaa. Didn’t think so.",
          "id": 134,
          "comments": [
            {
              "score": 269,
              "content": "The missing piece here seems to be that OP doesn’t realize that landlords have mortgages, too. Same situation as her boyfriend she’ll just be living with her landlord which doesn’t change anything about the financial situation.",
              "id": 135,
              "comments": [
                {
                  "score": 17,
                  "content": "No she respects her landlord more than her boyfriend. It's OK that her landlord actually profits off her. \n\nWhen her landlord changes to her boyfriend she thinks that by virtue of having a relationship with her he should be paying her.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yup. She complains that his financial situation improved while hers doesn’t it. What the hell does she think happens to a mortgage? Under this “deal”, she gets all the money back…. But if it’s going in to a mortgage how does he pay it back? Either he has to pull double duty and save the equivalent amount every single check(which equals out to him effectively paying the whole mortgage) as well as a contingency OR he takes out a loan against his home equity at time of break up and be even more in debt. It’s literally 100% in her favor. What about if she cheats. What is the burden of proof on that. What if he has no proof but of course a week later they’re in a whole new relationship. Y’all know exactly what I’m talking about there. That’s not a “deal”. She’s a damn free loader",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": ">So you could cheat on him, and if he dumped you he'd owe you money?\n\nListen I wanna barrow your car. I will pay you for letting me drive it. But if i crash the car you have to pay me what I gave toward the car.\n\nYou know I am actually thinking OP shouldn't play rent.\n\nInstead pay asshole tax. \n\nThough for OP I am sure that tax would leave them broke.\n\nOP -YTA",
          "id": 138,
          "comments": [
            {
              "score": 28,
              "content": "[deleted]",
              "id": 139,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Being an owner also means taking on risk (and depending where this is, real estate can have real risk!). Suppose the market is down at the time they break up -- think she'd be willing to take on some of that risk by contracting with him to pay him MORE than her rent to reflect the decrease in value? I doubt it -- she wants a guaranteed upside with no risk of downside!",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I love how she brings up valid insecurities related to him breaking up with her leaving her without a place of her own.\n\nBut then acts like expecting him to pay back all the money when they break up is somehow fine. The ridiculousness of people never seizes to amaze me.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This is what happens when homes are primarily viewed as long-term financial investments, rather than, you know... 'homes'.\nOP doesn't 'get nothing' if she pays rent and they eventually break up. She gets 'somewhere to live and store her stuff and to exist as a functional member of society for many months, or years'. She seems like someone who'd demand a refund for a used airline ticket because she didn't get to keep the jet",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "But don't worry she isn't planning on breaking up with him yet LOL",
          "id": 143,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "If this is a real post, I seriously hope this dude dumps her. What a entitled leech",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2689,
      "content": "YTA and you don't make any sense.  You rent right now.  \n\n>I just don't think it makes any sense for me to pay towards his mortgage when I would get nothing from that if we were to break up.\n\nWell, isn't that the exact situation you're already in?  You're paying towards your landlord's mortgage, and you get nothing from that if you move out.   So, it's okay to pay towards a landlord's mortgage but not your boyfriends?  That's kind of the definition of renting.... paying to use something you don't own.  What difference does it make who you're paying rent to?",
      "id": 145,
      "comments": [
        {
          "score": 370,
          "content": "Yea it’s weird. I feel like she sees it as helping pay her boyfriends debt (mortgage) and she doesn’t want to contribute to something he will benefit from if they break up.",
          "id": 146,
          "comments": [
            {
              "score": 519,
              "content": "It benefits her because it’s HALF what she is paying right now. That’s immediately money she can bank for herself for as long as they are together. She’s insane if she doesn’t see that as a major benefit for her. She should date someone who isn’t a homeowner. “Renters only!!  We want landlords to make a profit, not the person we love!”",
              "id": 147,
              "comments": [
                {
                  "score": 105,
                  "content": "Yeah this was my argument. OP would be able to put into savings half of her current monthly rental payment. So in the event of a breakup, she should have thousands of dollars in savings that she wouldn’t have if she continued to pay rent on her own apartment. THAT is her benefit. She doesn’t get equity in her boyfriend’s house, but she does get a nest egg that will put her in a better position for whatever her next living situation is.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 80,
                      "content": "She’s so petty she will shoot herself in the foot to avoid helping someone else lol",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "People who think like this would not put the half into savings. This is what financial illiteracy causes.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Yes but she sees it as helping pay her boyfriends debt, which she doesn’t want to do because in the event they break up…his debt will be lower thanks to her contributions. She’d rather pay more to a stranger.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Wildly immature. If I were her bf, I would withdraw the offer and find a renter. OP needs to find someone who doesn’t own their own home. Is there an app for Renters Only?",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "> his mortgage is pretty much exactly what I was paying in rent, so by cutting that in half I am saving a lot of money on living costs\n\nOP would prefer to burn more money just to have the satisfaction of.. having paid off more of her current landlord's mortgage.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "While ignoring the benefit she gets of a place to live.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Right? Like this isn’t the same as helping him pay off his credit card. There is a tangible benefit to her each month.\nWhat also puzzles me is that she dreamed up such a weird back up plan with the contract. Couldn’t she reason that if it is a weird thing people don’t do, that benefits her greatly to the detriment of her bf in the event of a breakup, then maybe the idea is an AH idea? \nNo, the normal thing people do is split expenses either 50/50, or proportional to income, or one party handles finances while the other tends to the house and kids. \nWeird breakup contracts really aren’t a thing. Makes you wonder what kind of prenuptial agreement OP would dream up!",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ten steps ahead of her petty future. Good to know she is already planning how to be a nightmare ex and ensuring no one can benefit from her contributions she has made if there is chance she won’t. So why bother doing anything right?\nWould you remove the wallpaper too if you break up? Dirty up the bathrooms and kitchen you had cleaned? Take all the food from the cupboards if you’d been the one shopping?   God forbid …",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "I have a feeling OP is straight up allergic to logic.  The fact she thinks her stance makes any sense is so laughable that it’s embarrassing.  She would rather pay a landlord and help him pay off his mortgage, than HALF the amount and help her boyfriend??  Fucking pathetic/selfish  and not a good partner to her bf.",
          "id": 157,
          "comments": [
            {
              "score": 66,
              "content": "It’s less than half! Landlord is gonna increase the rent, and similar apartments are more expensive! She’s cutting off her nose to spite her face.",
              "id": 158,
              "comments": [
                {
                  "score": 8,
                  "content": "Absolute madness. Also, this is the second time she has posted on AITA. She was voted TA and I guess she thought she would get a different outcome this time. LOL!!  Once and asshole always an asshole.",
                  "id": 159,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I also 100% don't get OP's logic. They are using some mental gymnastics to try to manipulate and swindle the BF. \n\nBasically, OP would rather pay a stranger more than double in rent opposed to paying their BF rent. And, if they move in, they would want the BF to agree to pay them back every dime that they pay in rent if they ever move out? Did I understand that correctly?\n\nOP, you didn't contribute anything to your BF's home. You didn't come up with the down payment. You didn't pay any fees. You didn't do the groundwork. You don't have ant risk. You are entitled to nothing. You would just be paying your BF rent. It sounds like you should stay in your own apartment and pay your increased lease because you aren't being fair or logical.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1632,
      "content": "YTA\n\nYou would rather pay more than anything to him.\n\nBreak up with him so he can find someone smarter",
      "id": 161,
      "comments": [
        {
          "score": 5,
          "content": "Facts. He definitely needs a new partner that gets it",
          "id": 162,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1601,
      "content": "These always crack me up.  Paying rent you pay towards a strangers mortgage plus a profit with no stake.\n\nYta",
      "id": 163,
      "comments": [
        {
          "score": 217,
          "content": "Was just about to say the same.  Willing to pay rent for a stranger’s mortgage, but not rent towards partner mortgage.",
          "id": 164,
          "comments": [
            {
              "score": 43,
              "content": "And double the rent for a stranger",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "Right?!\n\nIt’s a no brainer OP YTA. He’s your partner not your sugar daddy. Ask your landlord if he’s happy to pay your rent back as you’ve split up with the house\n\nJust pay your bloody way and stop trying to leech off your partner. If you truly see a future with him then the house will be yours too?!",
          "id": 166,
          "comments": [
            {
              "score": 5,
              "content": "exactly! the way she’s talking it sounds like she thinks they’ll definitely break up, so why move in with him at all? like, if you’re dating someone who after a potential  future breakup you would regret having helped THIS much then you need to break up",
              "id": 167,
              "comments": [
                {
                  "score": 5,
                  "content": " Because her lease is nearly up and the price will increase - she’s already done her homework about similar places. I just can’t fathom why she isn’t super happy to be able to just pay half of everything with a partner she supposedly wants a future with. \n\nTrying to get that cheap rent but then get it back at the end of the year when the rents are more stable I guess",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 777,
      "content": "YTA\n>I don't have any stake in the house, why would I contribute to his mortgage payments?\n\nYou don't have any stake in the house, why would you get to live there for free?\n\nOr to put it another way: you have no problem paying rent to a landlord (which landlord likely puts towards the mortgage on the place you live in) but you have a problem doing the same in this situation?",
      "id": 169,
      "comments": [
        {
          "score": 45,
          "content": "Following from this make it a formal rent agreement with your BF. Sign an agreement with him about how much and put in how much notice he must give you or you him should the relationship go south and you need to move out. \nYou’re right that your current rent agreement is different from your BF living arrangement in the sense it has more legal protection for you. But that’s easily solved and if this relationship lasts look at it as an investment for you’re future children if not yourself.",
          "id": 170,
          "comments": [
            {
              "score": 6,
              "content": "Exactly, I have no problem with her idea of drawing up some formal agreement, it's just that the one she mentioned is insane. If they're going to go formal like that it needs to be more in line with a standard rental agreement where they live. leases protect BOTH parties, the one she suggested only benefits her while completely screwing him over.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 728,
      "content": "YTA\n\nQuestions. He owns the house. What is his job and does he earn more than you?\n\nDo you have a job and is your income more or less than his?\n\n> But for me, this is about protecting myself for the worst-case scenario while he's not really risking anything.\n\nHe’s risking his 3 year relationship sour into resentment and alienation, that’s what he’s risking.",
      "id": 172,
      "comments": [],
      "relation": "Attack"
    }
  ]
}