{
  "post content": "\nMy GF and I got take out from an Indian restaurant we like and order from usually when our budget allows us. This place is really the only good Indian place anywhere near us  but it is very pricey, and so we try to keep our order small (1 entree for me, 1 entree for her, and a side of naan bread that we share). The thing is, the side of bread isnt very much, and the entree just isnt the same without it. So it seriously annoys me when she eats the bread without dipping it in her curry. Its such a waste of the little bread that we get. I told her this before but says its not my concern how she eats her food. Except it is my concern because she is wasting a SHARED side. Whatever, I let it go each time. \n\nThis time she didnt order curry like she usually does, she got biryani (rice and meat) so I was happy that I would get the bread to myself. While we were eating, she reaches over for the bread and eats a piece on its own. I got annoyed and moved the bread away from her and told her she doesnt need the bread  since she isnt eating a curry and doesnt need bread whereas I am eating a curry so I do need bread, also that her entree comes with rice and she can eat that. She got offended and ended up threatening not to pay her share for the food next time. She also called me a greedy asshole and took her food and ate the rest in our bedroom.\n\nMy friends are split, one of them says I'm in the right and it's too much carbs for one meal for her to have bread and rice, but the  other friend essentially also called me a greedy asshole. Its been hours and she's ignoring me. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 81353,
      "content": "You are a gigantic AH.  You don't get to decide for someone how they eat their food.  If you are splitting the bill she gets to eat some bread.  Regardless of if you think it is being wasted as eaten.  Go say you're sorry before you're single.  YTA",
      "id": 2,
      "comments": [
        {
          "score": 20320,
          "content": "This.   You don't get to decide how a person eats their food.",
          "id": 3,
          "comments": [
            {
              "score": 27849,
              "content": "And he has his friends volunteering about how this is \"too many carbs for her\". Wow, what a piece of work.",
              "id": 4,
              "comments": [
                {
                  "score": 12391,
                  "content": "Right? Mind your own business, you armchair nutritionists.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7208,
                      "content": "🤭 I like you!\n\nLike, \"The bread has so many carbs! Oh, the horror!\"\n\nGo get a damn hobby.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 979,
                      "content": "It's *naan* of your business!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I have an actual graduate degree in nutrition-dietetics and this is literally a \"who gives a shit\" moment. This is a treat meal and you can eat as many goddamn whatevers of whatever macronutrient you want. Not to mention some Indians literally eat biryani ON naan or other bread sometimes.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Naan does have a lot of carbs, but I don't remember how that is anyone else's business.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 519,
                  "content": "You know that this friend is THAT gym « nothing but unseasoned rice, broccoli and boiled chicken » guy/gal",
                  "id": 10,
                  "comments": [
                    {
                      "score": 257,
                      "content": "Ah yes, the friend who is a wealth of \"nutrition\" advice, yet has zero credentials on the subject except for what they pulled up on Google.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "The one that is actually really unhealthy and has no strength behind the build. It's all looks.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I hate those people. They are miserable eating that so they dont want anyone else to actually enjoy food.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "nah the friend is the “wait can i have a hug too” guy",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Carb-obsessed people neeeed to shut up about what others are eating. We’re not all terrified about carbs.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Come to the UK. Lasagne with chips and garlic bread is a thing 🤣",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Corrrection: OP has exactly two friends. One is a dipshit, to your point.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That's because he almost certainly spun it to them as that, because he knew he would sound pathetic and petty if he told them the real reason why he doesn't want her to eat it. \n\nHe mentions nothing about it being a carb issue, and it would be utterly bizarre for friends to bring that up as a central issue to this tale if he hadn't broached it. \n\nRice and naan is standard with an Indian. He's making shit up.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2178,
              "content": "Can you imagine how he is about other things if he’s gatekeeping naan?",
              "id": 19,
              "comments": [
                {
                  "score": 1337,
                  "content": "Right? And so ignorantly. She paid for half, she can eat her half however the fuck she wants. If he thinks he’s entitled to her share of the naan because of the type of entree they each have (which is completely asinine, zero percent doubt he is the massive AH here), I cannot imagine how he goes through the rest of life. \n\nBeen a minute since we had this obvious of an AH that doesn’t feel like a troll for once.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 181,
                      "content": "I was thinking of all the things I’ve read here, this one is definitely a thing that happened.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "Just the fact you are that greedy and they're complaining about how the restaurant is pricey, to begin with... either you get enough for everyone (and some people eat more than others!), or think of different options. Stop being a greedy hoarder, not to mention the \"carbs\" part, really tells that they are probably the type to make their partner feel awful about their appearance and self-conscious about their weight.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "I truly can’t believe what an AH this guy must be!!  Her half is her half however the hell she wants to eat it. Next thing he’ll be telling her what order to eat her food in, 1 bite of veg, 1 bite of meat, then take 1 sip of water.  I hope she dumps him fast",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Right, if it's a shared side then she gets half of it and she can eat it however she wants. If he wants an entire order of naan to dip in his curry then he can pay extra to have two orders of naan and keep one to himself. It makes my head explode when people think something as simple as *food* has one specific \"purpose\" and can be used \"wrong.\"",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 374,
                  "content": "Oh yeah, like maybe she uses too much toilet paper, toothpaste, and GAWD FORBID way too much lube!!!",
                  "id": 25,
                  "comments": [
                    {
                      "score": 787,
                      "content": "Well to be fair, I would definitely need an entire tube of lube if for some reason I still wanted to have sex with him after he tried to tell me how to eat like a 5-year-old.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I can imagine this after reading ops post. \n\n\"Oh yay, my partner took a dump on the way home from work so I can have the toilet paper all for myself\"\n\n*Walks in and sees partner blowing nose with toilet paper*\n\nFreaks the fuck out.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "But he can’t spare a square!  He doesn’t have a square to spare! 🤣",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 291,
                  "content": "GATEKEEPING NAAN! Lol",
                  "id": 29,
                  "comments": [
                    {
                      "score": 8,
                      "content": "#gatekeeping naan needs to trend! A new classic",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "My dad also doesn't dip his naan into his curry and he also eats naan with biryani, and it never even crossed my mind to be *upset* at his habits. Who cares!!!?",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Can we also talk about how a side order of naan is like, $4.95 and maybe they could throw in the extra fiver for two orders so she can eat in peace? \n\nLike, I get that getting take out is a splurge for them, but lets not ration the cheapest item like it's made of gold.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Oh no!  She used 3 squares of tp to wipe her butthole and she scrunched!!! \nI am horribly offended as I only use 2 and I fold",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Unfortunately, I can.  If she gets him to stop with the naan, he’ll find something else to pick at, in the guise of wanting her to do it *the right way* or wanting to *educate* her.\n\nIt won’t get better.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1050,
              "content": "Nor is he more entitled to her portion simply because he doesn’t agree with how she uses it. It’s HERS to do with as she pleases. She could throw her half in the garbage or light it on fire and it would be 100% her right to do so because she paid for it and it belongs TO HER.",
              "id": 35,
              "comments": [
                {
                  "score": 288,
                  "content": "I have lit naan on fire trying to reheat it under a broiler..  I cried because it was the last piece I had from takeout 😭",
                  "id": 36,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I feel your pain!\nIf you've got your heart set on that last piece of naan an then it goes up in flames...! Nothing else will do then!",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Next time, flip it on a burner. That way you can keep an eye on it.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "There's your mistake. We never leave any naan for the next day because it's so good fresh. Must eat it all now!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Here, have some of mine! We accidentally OVERordered naan and we have WAY too much for two people! \n\nYou can eat it however you like and i won't judge.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "She should just keep it as a pet and name it, carry it around, get it a small bed, talk to it.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This is exactly what I would do.\n\nI'd take my share of naan and, while looking him straight in eye, I'd hold the naan up in the air over the garbage can with both hands, open my fingers, and let it drop straight into the can.\n\n(Then the second he stormed out I'd snatch the naan out of the caan and cradle it in my arms and whisper 'I'm sorry I'm so so sorry\" while petting the naan and rocking back and forth and crying.)",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 954,
              "content": "He's an over controlling AH!\n\nI often don't dip my naan. Nobody forces me to dip. The chef doesn't come over and berate me because once I bought it, it's mine to do with as I please.\n\nYTA\n\nEdit: removed the word \"bread\".",
              "id": 43,
              "comments": [
                {
                  "score": 368,
                  "content": "Naan tastes nice by itself too, also don't say naan bread, just say naan. Naan means bread so you are basically saying bread bread 😅",
                  "id": 44,
                  "comments": [
                    {
                      "score": 316,
                      "content": "TIL naan means bread. It joins the chai tea madness lol",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I broke up with a bf because he had this sort of behaviour towards food and what I ate. He was a gym bro who ate the most disgusting meat dishes with fuck all veges or seasonings, and once pulled a McDonald’s bag out of my rubbish bin and gave me shit for eating Maccas after a night on the town with friends. I cook extremely nutritious seasonal and seasoned food and have perfect cholesterol. No man is going to tell me what I can and can’t eat.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2862,
          "content": "“Go say you’re sorry before you’re single.”  *chef’s kiss*",
          "id": 47,
          "comments": [
            {
              "score": 2381,
              "content": "If it’s not too late. Even if he says sorry he can’t all of a sudden put his true misogynistic, selfish and controlling colors back in the box. She saw them loud and clear.",
              "id": 48,
              "comments": [
                {
                  "score": 1218,
                  "content": "I noticed\n\n>too much carbs for one meal for her to have bread and rice\n\nWas thrown in at the end too just to make sure we know part of the reason he doesn't want her having her share of naan. What an AH. Apologise, and be less controlling to your GF while she's still your GF.\n\nAlso, I was all set to make and eat something cheap tonight, but how will I resist ordering Indian food now?",
                  "id": 49,
                  "comments": [
                    {
                      "score": 378,
                      "content": "I am going to be able to think about NOTHING ELSE today. I'm kill for a butter chicken and naan.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I doubt a “friend” said that, OP just didn’t want to admit that is what he thinks.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "If he has an issue with having too many carbs, here in the Philippines, there’s coffee and pandesal prior to breakfast. That practice is called Pampainit which means “to warm yourself” or your stomach) in preparation for breakfast which usually includes rice, bread, and or rice cakes in one meal (sometimes including pancakes) accompanied by a viand (or other people call them “side dish”). Yet we don’t complain about too many carbs. There’s even Unli Rice.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 209,
                  "content": "I mean, it's *bread* you try taking mine and see if you have skin left on your hand. OP deserves everything he gets.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "Yea. She needs to leave his sorry ass.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "The initial impression that the title gave me was that something was wrong with the naan (i.e. OP noticed it was covered in mold and his girlfriend thought he was being an ass before realizing the reason why he was withholding it). Ok, I was ready to give him the benefit of the doubt should that have been the case.\n\nNope, 100 percent a moron who drives himself up a wall about proper food pairings and being mindful of carbs.\n\nI can't wait to go to dinner at OP' Michelin star apartment where I'm going to experience a lecture about which food pairings ruin meals and diet advice. \n\nAsshole alllllll the way.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "This bread is mine, I choose the bread over the relationship🤣🤣🤣",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yeah. It's speculation at this point, but I feel like it's very unlikely that someone who gets this upset and righteous over A PIECE OF BREAD isn't controlling in other ways. Can't imagine this person is a lot of fun.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Nothing is wasted if it’s being eaten dipshit",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Yta. Other friend is right, you’re a greedy asshole",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "But all those carbs... /s",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Right? Coming between a person and their naan is a pretty serious dealbreaker. I wouldn't dream of doing that to anybody I cared about...and if they did it to me? They weren't who I thought they were.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1436,
          "content": "Naan is also incredibly easy to make.  Fuckin just make a batch and freeze the rest of the dough to make next time you order if you’re that frugal.  If you’re splitting the side, each person gets an equal share regardless of how they choose to eat it.  Naan isn’t only eaten with curry.  Massive YTA, if you’re that food possessive sharing shouldn’t be offered in the first place- you have real ass resentment towards your gf over this shit.  It’s bizarre and greedy.",
          "id": 62,
          "comments": [
            {
              "score": 345,
              "content": "Actually this is a great idea. Just buy it at the store, even non-Indian stores have it now. And you can warm it up with butter and it's much cheaper than getting it at a restaurant.",
              "id": 63,
              "comments": [
                {
                  "score": 147,
                  "content": "Yeah, my other thought was Costco naan (which I do like too- though homemade roti and naan is so easy and yummy).  \nYou can def warm up, I like to add a little garlic- and use ghee instead of butter if possible.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Frozen parathas... They're amazing. Got mine from the freezer section of my big local supermarket (UK). They even give naan a run for their money *chef's kiss*",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Trader Joe’s naan is pretty good.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Thats what i just typed out. MAKE IT YOURSELF AND FREEZE IT. i do and then you have plenty for any time. I make garlic butter.",
              "id": 67,
              "comments": [
                {
                  "score": 43,
                  "content": "Cackling bc I just read your comment and it’s giving me ~*me*~ vibes. \n\nHope your commenting is as cathartic as mine is sometimes 🙏",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1026,
          "content": "He’s also a huge AH for calling it “naan bread.’ It’s just naan",
          "id": 69,
          "comments": [
            {
              "score": 592,
              "content": "“Chai tea??? Chai *means* tea, bro. Would I order a coffee coffee with a side of cream cream?”",
              "id": 70,
              "comments": [
                {
                  "score": 246,
                  "content": "\"Why do people say 'ATM machine?' The M stands for machine.\"",
                  "id": 71,
                  "comments": [
                    {
                      "score": 142,
                      "content": "VIN number. The N in VIN literally stands for number!",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "Smh my head.......",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 202,
                  "content": "If this means I get extra coffee, I'm there for this. Please, more coffee.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah, I’ll have a coffee with extra coffee and then instead of cream, more coffee.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 96,
                  "content": "You mean, with the salsa sauce?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 7,
                      "content": "do people really say \"salsa sauce\" instead of just salsa???",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 88,
                  "content": "Ramen noodles. What other redundant food we got?",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Ever heard of Torpenhow Hill? Name translates to hill hill hill hill if you know Welsh, Norse, Olde English, and English.",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "What's your problem guys, I love enjoying my bread bread dipped in sauce sauce, with tea tea on the side, while relaxing by the lake Ness lake",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Oh, I love chi tea!",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Oh mate if you want to police tautology in language the UK is gonna have to rename like half its places and a fair whack of its food too.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Indian here from India. Wtf is OP on really? Let her eat the bread whatever way she wants to. YTA food police!\n\nOrder an extra naan then if you are so concerned. Between my husband and I, one third of the naan is for me whenever we order in. Nobody cares how we eat our portions.",
          "id": 83,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "I honestly can't believe he wrote this thinking he wasn't a major AH!! If she wants plain bread, she can eat plain bread! I eat plain Naan. I don't even eat it with curry. \n\nOP, this is the definition of AH behavior. Get another side of bread and go apologize.",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Plus if he can't afford  a second  price of Naan bread maybe they shouldn't be ordering out at all. The Naan breast isn't what makes it expensive. The entrees are. Or you know, learn to how to make it himself, it's not that hard",
          "id": 85,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "OP would hate me. I eat the bread straight up. I order my own and I eat it with everything. I loooooove it.",
          "id": 86,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Like she’s literally eating it, how is that wasting it?!",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This is so funny to me . I am an Indian and sometimes I don't dip my naan in the curry because I like it better that way . Op YTA, let the woman eat however she wants 😭. You can eat Indian food in any fucking way you want",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 27260,
      "content": "YTA... do you know that naan, roti, and other indian flat breads are often eaten on their own... just order some more and quit complaining.",
      "id": 89,
      "comments": [
        {
          "score": 5886,
          "content": "I one time had Naan used as the bread for a butter chicken grilled cheese from  a little Indian place in Northern Ontario. It was mind blowing",
          "id": 90,
          "comments": [
            {
              "score": 1008,
              "content": "That sounds mind blowing! I’m no where near Ontario but what was the name of the place ya know just in case?",
              "id": 91,
              "comments": [
                {
                  "score": 1124,
                  "content": "Butter Chicken Naanwich\n$15.99\nButter chicken, sauteed veggies, mozzarella and pico sandwiched between two Panini pressed naans, served with raita and chutney.\n\nThat's what I got but they have a ton of other options",
                  "id": 92,
                  "comments": [
                    {
                      "score": 193,
                      "content": "Thank you! It’s amusing that it’s in Thunder Bay I had a college roommate from there lol",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "I have slid off my chair and melted into a puddle of happiness just reading that description.  Thank you for sharing that with us.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I see your butter chicken naanwich and raise you Dishoom’s bacon naan. Streaky bacon, cream cheese, tomato chilli jam and coriander (cilantro) leaves.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "homie came back with the most detailed description LOL",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Australia thanks you for the recipe.",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 212,
                  "content": "Curry up now in Thunder Bay!",
                  "id": 98,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Happy to see my hometown being mentioned on Reddit for something good for once lol and not just persians",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "There is a Indian buffet restaurant in Woodstock, Ontario, that is soo good! Not a huge selection, but the lady who I think is one of the owners kept bringing out freshly made Naan. It was so good! I ate more of the Naan than I did the entrees, lol.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "A restaurant chain in the U.K. (Dishoom) are famous for their naan bread bacon rolls. Last time I was in London I had their bacon and egg naan roll. Delicious!",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1701,
          "content": "YTA. My Godmother is Indian and we used to go to her house afterschool and for a snack, she’d give us plain, warm naan with butter. It was amazing. In fact, I grew up eating her and her family’s homemade Indian food and didn’t have Indian takeout until i was an adult. I knew it was part of Indian culture to eat with their hands and use the naan that way, sort of how black people (i’m Black) would use a biscuit or cornbread to sop up our food. But i used a fork, and never got chided or reprimanded for not eating properly. And if i wanted plain naan, its what i got. I bet if she or her sons saw this, they would also think you’re a huge asshole.",
          "id": 102,
          "comments": [
            {
              "score": 330,
              "content": "My grandmother would give us hot roti or paratha with ghee and buknu masala",
              "id": 103,
              "comments": [
                {
                  "score": 22,
                  "content": "Now I gotta find Indian restaurant asap\nEdit: I mean this made me hungry",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Regardless of the nationality, fresh bread made by mom or grandmother is one of the greatest memories of growing up.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I mean if you look at European culinary history, the vast majority of it is EXACTLY THIS. My family tree goes back further than the invention of forks, let alone when they actually became normalised in areas where my ancestors were.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I’m as white as they come and I do that too.  Anything bread like is great for this…it just makes me happy",
              "id": 107,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Not my grandmother but my best friend's grandfather did that (warm naan with butter) and STILL to this day, it is the ultimate comfort food. This comment brought about a very welcome piece of nostalgia for me.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1060,
          "content": "He’s greedy, controlling, entitled, judgmental, AND cheap. What a winning combo.",
          "id": 109,
          "comments": [
            {
              "score": 601,
              "content": "You forgot insufferable and pedantic",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "And soon single! I can hope gf dumps his cheap ass :)",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 991,
          "content": "I adore naan and my partner and I always ordered extra because we'd just snack on it! \n\nOP strikes me as one of those people who talks about the \"proper\" way to eat ramen. Saying you have to have certain ingredients at certain times and you have to use chopsticks whether that's difficult or not. Dude, it's food. Let people eat without trying to control it. (I do use chopsticks but have friends that struggle with them, and eventually it's likely I won't be able to use them anymore either)",
          "id": 112,
          "comments": [
            {
              "score": 172,
              "content": "My friend always feels embarrassed when he asks for a fork when we go out for ramen. And sometimes wait-staff look at him a little funny before they cover up the surprise. But food is food! So long as you're getting it from source to mouth and enjoying it, you're doing fine!",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Yes! Stop gatekeeping cultural food! Getting annoyed because she doesn’t eat HER HALF of the naan that she PAID FOR the way he wants her to and thinks is ‘proper’. Good grief.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I'm pretty good with chopsticks and use them whenever I order east Asian food. But, if I cook ramen at home, my Italian side comes out, and I twirl those noodles around a fork. If eating food is wrong, I don't want to be right.\n\nAlso, naan is awesome. This post is making me hungry.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "OP reminds me of the people who lack melanin telling me how to eat Korean food because allegedly I would be eating it \"wrong.\"\n\nSpoiler alert, I'm Korean.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "OP is just eating whole Indian food wrong. You share the curry and eat your own bread and order more bread if you want. Carb is the filling portion of an Indian meal.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Honestly I think my chopstick game is weak af, but ramen is the one food on earth I have an easier time eating with chopsticks than a fork. It's really hard not to grab too many noodles with a fork.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 570,
          "content": "My mom asks me to order extra naan when I get Indian food specifically because she likes to eat it on it’s own. It’s just insanely tasty bread it doesn’t kill anyone to get a second order",
          "id": 119,
          "comments": [
            {
              "score": 320,
              "content": "Mf is ordering out and then sweating over the $0.99 naan, lol",
              "id": 120,
              "comments": [
                {
                  "score": 111,
                  "content": "Oh it can be like £3.50 in the uk.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 22,
                      "content": "For a single naan? That’s bonkers.",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "I’m sending $4 to the gf so she can get her own naan and eat it while she stares at him.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I definitely think OP is the asshole regardless, but where I am even plain naan is at least $3 (Ottawa, Canada, restaurants are so freaking expensive now)",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That was my thought when reading this too. Naan is delicious on its own. And he expects his gf to pay for half of the naan so he can fucking greedily eat it all?? Learn to share little piggie.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "I sure do. Garlic naan is DELICIOUS. I will quite happily eat just that, and I love rice, so I'll have naan AND rice with my Indian food. Because it's yummy.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Wait ..\n\nPeople actually eat roti on its own? ~ an astonished Indian. 🤯 Damnnn",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21975,
      "content": "YTA 100%. Who gaf if she eats it with the curry or not?\n\nAnd “too much carbs” ???? So you AND your friend are now trying to dictate your girlfriend’s diet? I hope she gets out of there. I can only imagine how you are about everything else in your lives when this is such a smaaaaall thing to react this negatively towards.",
      "id": 128,
      "comments": [
        {
          "score": 4934,
          "content": "Can you imagine acting like the food police over some naan?",
          "id": 129,
          "comments": [
            {
              "score": 1909,
              "content": "Woop woop that’s the sound of da police",
              "id": 130,
              "comments": [
                {
                  "score": 1593,
                  "content": "\"PUT DOWN THE NAAN!\"\n\n\"Cuff her; write the citation up for 'neglecting to dip naan in curry.\"\n\nEdit: thanks for the award! It's nice to have a chance for us all to be able to have some light-hearted humor here!",
                  "id": 131,
                  "comments": [
                    {
                      "score": 96,
                      "content": "😂",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "And take the naan from him. It’s evidence now.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "You have the right to not eat your naan. Anything you eat can be used against you in court. You have the right to dip your naan in curry, if you cannot afford curry, one will be appointed. If you decide to eat yur naan without curry, it will be confiscated. Duh.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "So anyway, I started blasting",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "IM NOT GOING BACK TO JAIL *clicks safety off*",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Naan for you!",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "What is the charge? Enjoying a meal? A succulent Indian meal?",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Protect and serve (naan)",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 952,
                  "content": "Eating naan on its own? Jail. Eating curry without naan? Believe it or not, jail. Too much carbs? Also jail.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 196,
                      "content": "Strong naan rules in Venezuela",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Not enough carbs, straight to jail, right away.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "/r/unexpectedpawnee\n\nLove it!!",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Woop woop put it down that's my yeast",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 296,
              "content": "Yes. If I were the food police I would confiscate all the naan and eat it, I mean, dispose of it appropriately.",
              "id": 145,
              "comments": [
                {
                  "score": 24,
                  "content": "Exactly, dispose appropriately, In the bin. \n\nHello, my name is Bin.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "And that's how Zeugma888's career as a drug enforcement officer ended.\n\n-Morgan Freeman",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "So when we took possession of the defendants naan there was 3/4 left.\n\nSorry, I meant 2/3",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Put the Naan down and WALK AWAY!(pulls gun, fires warning shot)",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Four naan, Jeremy? That's insane!",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 898,
          "content": "Guaranteed the “friends” eat a lot carbs and red meat. \n\nThe dudes that are worried about their girls gaining weight usually have terrible diets themselves. Double standards.",
          "id": 151,
          "comments": [
            {
              "score": 431,
              "content": "My brother is like this. Whenever he's pissed at me he brings up my weight and how he weighs less than me like it's some trump card. Nevermind the fact if he wasn't cooked vegetables with dinner or given fruit in his lunchbox he'd never consume a single vegetable or piece of fruit. Or the fact he'll down a 1.25L coke and family bag of salt & vinegar chips in 30 mins - an hour. Or even getting a whole ass large big Mac meal with a coke as a \"snack\" after school. Sure buddy, you might weigh less but your arteries are screaming for dear life. \n\nPeople like that suck major donkey dick.",
              "id": 152,
              "comments": [
                {
                  "score": 231,
                  "content": "That will catch up to him eventually. My husband and I both used to be able to eat 3/4 of a pizza each plus several cans of Mtn Dew and some cookies during gaming sessions and never gained a pound. Then we passed 25 years old and...yeah we can't eat that way anymore.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 118,
                  "content": "Good to see that even kids who still get lunches packed by their parents are still adhering to the same old bigoted thought patterns and weaponisation of women's weight and bodies. \n\nHoped we would have moved on a bit, but alas.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Teenage metabolism doesn't last forever, it'll ssssoooo catch up with him.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Well OP was planning to eat a double serving of carbs when he ate her half of the naan",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Never understood why men criticise their GFs eating habits. If she is too fat for you, then why are you dating her in the first place?  \n \nWe are in 2023 and fat acceptance is here. We accept their weight but you do not get a say in what she eats. That's what they want, to be whatever size they want and be left alone.  \n \nIt's not your problem to deal with that, you leave her and date someone who is your preference.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 253,
          "content": "If there is one thing that I hate, it is a person who polices the food choices and portions of the person they are in a relationship with. Usually it is an indication that said person is controlling other aspects of the relationship. That is seriously concerning.\n\nNot only is OP monitoring what foods are to be properly paired together, but *how* much she should be eating*??* It is infinitely better to be alone than to be with someone who thinks that they are doing you a favor by literally keeping food from you as if you are a child trying to sneak cookies before dinner.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "I like how it’s not too many carbs if he eats all of the naan by himself but it is too many if she eats some of the naan along with her rice. \n\nOP has such a limited view of how to eat if curry *has* to have naan with it and you can only have one carb or the other. When I eat at my favorite place, they offer free naan (and bring you as much as you want), and rice is always included as a side with any curry. It’s almost like people are supposed to… I don’t know… enjoy their food?",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I'm just glad no one's counting my carbs. At the restaurant I order from, curry's come with a side of rice. I always order garlic naan, too. Just had lamb vindaloo with rice and garlic naan for dinner last night.\n\nI, a complete stranger, was feeling bad about my dinner after reading this post, I'd hate to be the gf. \n\nYTA.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": ">this is such a smaaaaall thing to react this negatively towards\n\nHe's making a huge naan issue out of a non issue, in other words.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "If one of my friends said that my wife had \"too many carbs\" in her meal, they would not be my friend anymore. OP is a huge asshole, not just for trying to dictate her food consumption but for not standing up for her. YTA",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Just imagine going thru all this and then being like \"I bet reddit is on my side\"",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Sounds like OP is an AH with AH friends!",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "As someone who has been raised on srilankan food which has the same kind of format as indian food, his carbs argument is bullshit, we eat rice everyday as the base for our food and roti is often eaten in indian households with curry so obviously he doesn't know shit about how much carbs are normally eaten 🤣🤣",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13586,
      "content": ">So it seriously annoys me when she eats the bread without dipping it in her curry. Its such a waste of the little bread that we get. I told her this before but says its not my concern how she eats her food. Except it is my concern because she is wasting a SHARED side. Whatever, I let it go each time.\n\nHow gracious of you to \"let it go\" that she enjoys her food differently than you enjoy your food.\n\nYTA",
      "id": 166,
      "comments": [
        {
          "score": 2393,
          "content": "Yes he’s a saint for letting it go. How unbelievably nice of him to accept that she eats her food differently /s",
          "id": 167,
          "comments": [
            {
              "score": 936,
              "content": "Yeah, it totally sucks that she would want to eat something she partially paid for.",
              "id": 168,
              "comments": [
                {
                  "score": 342,
                  "content": "Well not dipping it clearly=wasting. /s",
                  "id": 169,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Right!?? Might as well throw it away if it’s not dipped into anything /s",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "even the very title is gross...\n\n\"I didn't let X do something.\" is up there with \"Chastising my wife for...\" \n\n\ndon't people communicate at all? aren't they interested in each other? don't they want to know more about who they choose to spend their time/life with?",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1204,
          "content": "How can it be wasted if she always eats it? She must enjoy it, plus don't you just love the irony of him putting the word SHARED in capitals...one for r/woosh I think !",
          "id": 172,
          "comments": [
            {
              "score": 335,
              "content": "Shared means the man gets all of it right?",
              "id": 173,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 234,
              "content": "Ah, yes, but you see, she must enjoy the bread in the way *he* sees fit, and that way only. Otherwise her enjoyment is actually not physically possible in his mind at all! \n\nAlso, note the toxic-ass friends trying to police how many carbs she should or shouldn't be having? Puh-lease.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Right I was shocked as fuck. She's still eating it. I don't like getting my naan soggy so I don't dip it. I guess I'm in trouble!!",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 715,
          "content": "I wanna know where OP lives that they can't afford to order two naan's with their meal. Maybe it's because I live in an area with a large Indian population with a variety of Indian restaurants, but naan ranges from $2-$8 depending on size and flavor. If OP wants to gatekeep naan that badly, maybe he needs to order his own, or buy it from the grocery store.",
          "id": 176,
          "comments": [
            {
              "score": 554,
              "content": "But then she’ll waste a WHOLE naan by not dipping it! The horror!",
              "id": 177,
              "comments": [
                {
                  "score": 48,
                  "content": "Good Lord! My delicate disposition!! Won't somebody _please_ think of the children?!",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Or maybe OP can learn how to make it. Then it would cost cents per serving.",
              "id": 179,
              "comments": [
                {
                  "score": 15,
                  "content": "Yes! It’s really fun to make. But he’ll probably say she’s using too much flour. \n\n($8 US? That does seem like a lot for naan)",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "You can't make good naan without a tandoor.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Does OP strike you as someone who could distinguish tandoor-made naan from naan made in an ordinary oven? The restaurant probably doesn't make it themselves but buys it ready-made and only warms it up.",
                      "id": 182,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I’m confused too because I’m pretty broke and my boyfriend and I still get a few orders of naan when we get Indian food. OP would probably have a fit if he saw how much naan I order. But takeout is a treat and life is too short to ration naan.",
              "id": 183,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "It’s the cheapest thing on the menu",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This was my thought - naan is probably the cheapest part of the meal - I do understand that he likely doesn't want to \"run out\" of naan before his curry is done - I am a sally for spice and would want to eat curry alongside naan as well, but dude - there is a simple solution here. YTA.\n\nalso - going to add naan to the grocery list because yummm",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That's what i was thinking. How much does naan cost? Ive never bought it take-away for more than a few dollars.",
              "id": 186,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 311,
          "content": "This part made me SO MAD. What a freaking hero to let it go each time. Or maybe it’s her who’s the saint for letting go every time he comments about how she eats her food. What an AH. Ugh!",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Wtf does wasting a shared side even mean? Eating it???",
          "id": 188,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "This must have been going on for a while.  No ideas to came to his mind to try to fix this reoccurring issue. His solution was to post on AITA and to spin it like he's the understanding one.  Yeah, the lady needs to take her half of naan and leave.",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "His majesty was too kind! How dare this peasant abuse his kindness?! \n\n/s",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Does OP not understand the definition of the word SHARED? He gets his half, gf gets her half, and it's none of OP's business how gf eats her fair share. Why does he think that he has the right to be \"outraged\" at all?",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Sounds exactly like my narc ex lol if it is not done to his arbitrary \"standards\" then it is WRONG and it is actually a huge deal about what I am doing wrong and we will have insane days/weeks long arguments over things that wouldnt even occur to a normal human. I feel so bad for his gf, this is the very very tip of a HUGE iceberg.",
          "id": 192,
          "comments": [
            {
              "score": 7,
              "content": "I hate when they use the standards card. And imagine if the standards is something you can’t argue much.. The Church/the mosque says .. I will never understand the audacity of someone wanting to decide to someone else what to do. And manipulate them by using something that is supposed to be good like this guy’s fake concern of her Carbs intake.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "And he physically moved it away from her!!!",
          "id": 194,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6969,
      "content": "YTA. She wants to eat the yummy naan and she's allowed to eat it however she damned well wants to (with or without dipping). It's not up to you to decide whether she's eating it correctly or not.",
      "id": 195,
      "comments": [
        {
          "score": 10,
          "content": "And biryani is my favorite and i will use my naan like a tortilla, load it up with biryani and raita and wrap it up. Op’s head would explode if he saw me do this.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6237,
      "content": "OMG…are you actually policing the way your girlfriend eats her food?!?\n\nDefinitely, YTA. You both paid for the meal.  You both paid for a main and a side of naan.  Unless you paid extra to have that naan bread all to yourself, you’re being a massive AH to assume she doesn’t get to have her half **because she didn’t order a traditional, dip the bread in it meal.**\n\nYes, you’re being a greedy asshole.  You want more naan?  Order an extra side of naan.  You don’t get to cheat her of half a side that she paid for just because you don’t approve of the way she eats her bread.",
      "id": 197,
      "comments": [
        {
          "score": 2648,
          "content": "Like literally how expensive is an order of naan.\n\nBro's showing his whole ass and throwing away a relationship over like 3.99",
          "id": 198,
          "comments": [
            {
              "score": 818,
              "content": "Excactly. If he wants that damn bread so badly he should drink one less coffee each day or replace the lemonade with much cheaper water or whatever and order extra bread. It would also be healthier for the AH, since he's so concerned with HER carbs. I'm usually calm, but this just makes me so angry.",
              "id": 199,
              "comments": [
                {
                  "score": 262,
                  "content": "They may simply not have the money. Maybe they already don't drink coffee out or order other drinks. And that's fine, because it doesn't change that OP is wrong for trying to weasel his way into getting all the naan.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 386,
                      "content": "If they are so short money, wouldn't it better to order less frequently but order 2 naans the few time they do?",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "If she paid for half the naan, half the naan is hers. If she wants to wear it as a hat while eating her rice- it’s her naan.",
                  "id": 202,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "For real tho, the amount of family members I've had attempting to police my food choices over the years meanwhile they guzzle down soda after soda... It's like some people don't think liquid calories count.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "Meh I've seen some of the good ones like garlic naan go for upwards of $6 at the most but it's still ridiculous, the naan isn't the real issue here.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 289,
          "content": "I wonder how he'd feel if she turned the tables and yelled at him for eating naan with curry, since it's supposed to be dipped in Tamarind sauce.  That's the way she likes it so he's not allowed to enjoy his half any other way.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "He wanted some of her food too, if he didn’t he wouldn’t have cared to add she took it and ate it away from his naan police nonsense.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Ohhh this is so weird, how do people turn out so weird??? I don’t know if i want to laugh of cry it’s so ridiculous. Maybe it is just to early in the morning for this shit I don’t know. A clear case of YTA",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "So I think a the cost of a biryani would be equal to the cost of the (naan + curry) total. So I think OP means the naan should count as *his* half. However the problem here is much deeper than the naan. \n1. OP does not love his gf enough to give up some of his naan or order an extra naan. He should stop wasting her time and just leave her.\n2. OP is those insanely controlling types and GF should cut her losses and run away now.",
          "id": 208,
          "comments": [
            {
              "score": 21,
              "content": "Not where we live.  Biryani and rice is the same as most curries.  And most Indian places include rice with the curry.  It’s unusual to have a restaurant not include rice as it’s so cheap.  So I suspect OP may have left out some details…maybe he doesn’t care for rice?\n\nAnd I agree…there are bigger problems than naan bread.  I just got stuck on his asinine judgements about how she eats her food.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I laughed so hard that he’s framing it as a threat that she doesn’t want to pay „her part“ of the naan when she isn’t allowed to eat it. What does he thinks someone’s part means? She either can eat it or it’s not hers. 😂",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3677,
      "content": "YTA, and sound controlling AF with your too many carbs comment. \n\nAlso, it's just called naan, not naan bread. Naan means bread, so you're essentially saying 'i am an asshole and didn't let my GF eat the bread bread'. \n\nSo, you are not only an AH, but also not particularly intelligent either.. what a catch 👌",
      "id": 211,
      "comments": [
        {
          "score": 516,
          "content": "I knew OP was going to be the A H as soon as I saw \"naan bread\". Then continuing to call it \"bread\" ... That's like calling a bagel \"bread\". Like... Yeah, technically, but also no.",
          "id": 212,
          "comments": [
            {
              "score": 414,
              "content": "I’m also assuming since he calls it “ naan bread” that he’s not even Indian, so he’s gatekeeping food from a culture that is not even his own.",
              "id": 213,
              "comments": [
                {
                  "score": 119,
                  "content": "Probably gets upset when they get sushi and she doesn’t use chopsticks to eat it.",
                  "id": 214,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I doubt OP knows how to use chopsticks. Probably would get upset she doesn't put soy sauce or Wasabi on it, though.",
                      "id": 215,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Also FWIW the people whose culture it actually is often DGAF. My husband is a first-Gen Pakistani immigrant, and I see him and his family eat naan without dipping it in anything all the damn time.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 23,
                      "content": "That's because dipping isn't required. It's merely another way to eat it. They eat it without dipping all the time because it's *fucking normal*.",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I am indian and I eat just naan occasionally. Even if he was indian just let people enjoy food as they want.",
                  "id": 218,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Fun fact: no one in India would classify naan as 'bread' (unless they're catering to a Western audience). It would probably appear in a menu under 'Roti.' And just like the West has breadified 'naan.' We've rotified bread. In certain regions of India, regular bread is called 'double roti.'",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Also, naan’s purpose is not to “dip”. It’s meant to be used to pick up the food. So he’s doing it wrong anyway if he wants to be tiresome about it.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "> So, you are not only an AH, but also not particularly intelligent either.. what a catch 👌\n\nTo be fair, this is an instance of (cultural) ignorance, not lack of intelligence.\n\nMost people in North America (if not elsewhere, too) who love Indian food (and don't have Indian friends) refer to it as \"Naan bread\". All three Indian restaurants in my small city here feature it as \"Naan bread\" on their menu...because said city is jam packed with like 85% white people who would not know Naan = bread, otherwise, probably wouldn't even ask, and then not order it...and that would be CRIMINAL, missing out on the glory of naan as a vehicle for rich and delicious gravies and meats.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "His girlfriend is also not allowed to have a oreos because she just eats them like a sandwich without twisting them apart and licking the frosting off first.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3086,
      "content": "YTA.\n\n\"So it seriously annoys me when she eats the bread without dipping it in her curry.\" - wow, you feel like you're entitled to tell her how she must eat her food?! WTF is wrong with you? \n\nThis is petty AF.\n\n1. Not everyone eats foods the same way you do; dip it in the curry if you want! There's no law saying it has to be eaten that way.\n2. \" she is wasting a SHARED side\" - so, she's eating the side but it's being wasted? No, not how that works. \n3. \" I was happy that I would get the bread to myself.\" - wait, did you express that? because seems like you assumed it and took it for yourself.\n4. \"she doesnt need the bread since she isnt eating a curry and doesnt need bread whereas I am eating a curry so I do need bread, also that her entree comes with rice and she can eat that\" - yea.... that is controlling AF. Also, you DO NOT need bread, you WANT bread, bro. There is a difference. \n5. \" it's too much carbs for one meal for her to have bread and rice\" - LOL, so, your friends are the food police?! Gross. \n6. Why do ANY of you think you get to tell an autonomous human what or how they are allowed to eat? \n\nLike, order a damn second order of bread. One for each of you. That's literally how easy this is to solve. And since you don't see that as an option, then it really is about judging and controlling her. \n\n\"says its not my concern how she eats her food\" - she is correct. \n\n\"She also called me a greedy asshole and took her food and ate the rest in our bedroom.\" - also good. \n\nYou are immature, you are irrational and you seriously are a red flag.",
      "id": 223,
      "comments": [
        {
          "score": 650,
          "content": "Right? If 2 side orders of naan are too expensive, maybe you shouldn't be ordering at all...",
          "id": 224,
          "comments": [
            {
              "score": 6,
              "content": "He’s probably a shitty tipper along with being a shitty boyfriend.",
              "id": 225,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 446,
          "content": "Her eating half the side of naan is too many carbs, but him eating the WHOLE order to himself isn't? Wow.",
          "id": 226,
          "comments": [
            {
              "score": 291,
              "content": "Also I’m guessing his curry comes with… rice? All the Indian places I’ve ever gone to in the US give you Basmati rice with any curry.",
              "id": 227,
              "comments": [
                {
                  "score": 151,
                  "content": "Why aren’t more people saying this!!!! It’s literally infuriating that he doesn’t mention this as it’s his entire argument. What a loser!!!",
                  "id": 228,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Tbf this hasn't been the case in a few Indians I've been to. You get the curries on their own and then order either bread, rice or both seperately.",
                      "id": 229,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "My local has a choice of nann or rice with curry",
                  "id": 230,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Mine comes with rice, and the Naan is ordered separately as a side.",
                      "id": 231,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "The Indian places near me do not, unless you're sitting down to eat and ordering a pre-defined meal. If you get takeout you pick your components and none of the curries inherently come with anything. A side of rice is typically pretty cheap though. Like, $3.99 CAD tops for a 16oz container which is enough for 4 people to have a decent share with their meal, or for two people to stuff themselves. \n\nNaan and rice are both 100% necessary when ordering Indian takeout imo.",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 371,
          "content": "I seriously hope this is rage bait. When we get Indian (pretty often), the first thing I do is tear into the fresh naan, no dipping or anything. It’s so good! I eat like half a piece just plain, enjoying the steamy fluffy carby deliciousness. \n\nWhen we go to the Iranian place nearby, I will and do eat two servings of Barbari in a matter of minutes without dipping it. \n\nFresh bread slaps. Who cares if it’s dipped?",
          "id": 233,
          "comments": [
            {
              "score": 74,
              "content": ">When we get Indian (pretty often), the first thing I do is tear into the fresh naan, no dipping or anything.\n\nNah mate you're doing it all wrong. That's it, I'm eating your naan. /s",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": ">3. \" I was happy that I would get the bread to myself.\" - wait, did you express that? because seems like you assumed it\n\nHe definitely just assumed it, and it's the dumbest fucking assumption ever. \n\nA) She normally doesn't dip the naan in her curry but just eats it by itself. \n\nB) She doesn't have curry to dip it in. Therfore:\n\nC) She won't eat the naan by itself like she always does. \n\nHow the fuck does that add up? He obviously just doesn't want to share, so why does he act like he is okay with sharing?",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1657,
      "content": "Order two sides of naan bread.\n\nProblem solved.",
      "id": 236,
      "comments": [
        {
          "score": 1279,
          "content": "I mean, duh. Which shows how ignorant he is. But also, that means he wouldn't get to control how many carbs she has, and judge her. He sucks.",
          "id": 237,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 391,
          "content": "Nonono you don't understand. Op wants his girlfriend to pay for half the naan and then give all of it to him because he Needs it for his curry!",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "This!! I’m so confused, a side order of naan is almost never more than $2 or $3",
          "id": 239,
          "comments": [
            {
              "score": 27,
              "content": "I was just thinking that. Our local Indian takeaway’s naan prices range from £2.99 to £3.50 and they’re absolutely fucking huge, plenty big enough to share. Cheaping out on bread is just weird, and if they can’t afford an extra naan they probably shouldn’t be eating takeaway at all.\n\nIf my husband and I order from our local place we get two naan, mostly because I am so greedy for carbs (sorry OP’s alleged friend…) and if there’s any leftover it’s just used as bread the next day. I will often just reheat it and eat it on its own.",
              "id": 240,
              "comments": [
                {
                  "score": 8,
                  "content": ">Cheaping out on bread is just weird, and if they can’t afford an extra naan they probably shouldn’t be eating takeaway at all.\n\nThat was my takeaway from this \"story\" too.\n\nAt least buy out half the time and get a nice meal with no drama! It isn't rocket surgery!",
                  "id": 241,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Are you suggesting OP's problem is a naan-issue?",
          "id": 242,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "*bUT thEN ShE WoULd bE eAtiNG EvEn morE CaRbS*",
          "id": 243,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1129,
      "content": "I agree with your friend and your girlfriend - you're acting like a greedy AH. \n\nYou have no business telling her how she can enjoy her food, or if she's eating \"too many\" carbs. If you split a side, you split it. If you want more naan... order more. You can be cheap OR be entitled... only an AH is both.",
      "id": 244,
      "comments": [
        {
          "score": 206,
          "content": "Also, I’m not even kidding, I live in a Hella expensive city, and the most expensive naan I’ve seen was £5, they’re usually around the £2,50-3 range. Unless their naan is £10 per portion, surely getting a second serving won’t destroy their bill (or he can get a cheaper main)",
          "id": 245,
          "comments": [
            {
              "score": 25,
              "content": "The Indian place at the mall near my place gives you two Naan per person, unless you have a kid and then a third is added. And his Naan are the size of small pizzas. Dude knows how much his regulars loves his Naan.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I just want to jump on this to lament the fact that a local Indian to me charges £1 for a single poppadom....",
              "id": 247,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}