{
  "post content": "So my 20 year old daughter is currently a college student. She lives in my house free of rent. I only ask her to do a few things around the house from time to time, like cooking and cleaning. Typical things you're expected to do on a daily basis anyways. Occasionally she has to watch over her younger brothers since I may be busy with work or when I need a break to hang out with my girlfriend. \n\nMy daughter recently spoke up to me about how she feels I'm putting too much of a workload on her back which I don't see how. She told me she's okay with cooking and cleaning around the house, but having to watch over her siblings was annoying & stressful and that it's taking away from her studies. That pissed me off because I myself went to school while having to pay bills & take care of her as a baby alongside my ex-wife. I told her she was acting very privileged and that if I could do it, so could she. She didn't like that very much and stormed off into her room. \n\nWell she went behind my back and told my sister about how \"bad\" I was treating her. My sister is very kind & gullible at times, so she called me and said the least I could do was give her an allowance for the chores I make her do. I explained why I felt that wasn't necessary and she told me not to compare my situation to my Daughter's since apparently I put myself in the position I was in back then which I guess is a fair argument. But since she is living in my house rent free and I'm paying for her college, I feel that in of itself should count as an allowance. So I just wanted to ask whether I'm wrong for not wanting to pay her extra money to do basic chores.\n\nEdit: So in regards to how often I ask her to babysit, it's usually 3 times a week. I don't see how that's too much to ask of her. It's usually only for a few hours until I get back home. My boys are twins & they're 5 years old. They aren't crazy kids by the way, they're more mature than the typical one's you'll see.",
  "id": 1,
  "comments": [
    {
      "score": 32293,
      "content": "YTA\n\n\"because I myself went to school while having to pay bills & take care of her as a baby alongside\"  \n\n\nThat was your own baby and your own decision, same as now. You daughter has no kids, it's not her responsibility.",
      "id": 2,
      "comments": [
        {
          "score": 6999,
          "content": "She’s living there rent free…that’s her allowance for these chores.\n\nEDIT: based on OPs edit, 100% YTA. You should be paying her for babysitting, you don’t need to pay her for the other chores though.",
          "id": 3,
          "comments": [
            {
              "score": 9567,
              "content": "I agree she shouldn't get an allowance for doing chores, but she absolutely should get paid for watching children she didn't choose to have - since they're her siblings, not children.",
              "id": 4,
              "comments": [
                {
                  "score": 4580,
                  "content": "I think if she’s asked to babysit once every few weeks, that is the equivalent of a chore. If it’s multiple times a week, that changes things.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3804,
                      "content": "INFO: OP, name ages, genders, and how many times a week she is expected to babysit, and for how long each time.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 404,
                      "content": "I think it also depends somewhat on the circumstances and on the timing.  If it's \"asked\" that she do it with no option to say no and without regard for her own schedule (midterms, big project, prior plans, whatever), that's also a problem, particularly if it's not for an urgent situation and simply OP saying \"I need a break to hang out with my girlfriend.\"\n\nI'm a little concerned about the frequency and overall workload because OP elaborated on  \"I only ask her to do a few things around the house from time to time, like cooking and cleaning\" with \"Typical things you're expected to do on a daily basis anyways.\"  The average college student is not cooking for or cleaning up after a household of at least four, at least two of whom are still young enough to need a babysitter, on a daily basis \\[edit: or near-daily or even weekly\\] -- and yes, doing so would take time away from their studies.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 391,
                      "content": "That’s my thought as well. I also feel like there’s a difference between her watching them when his work is running late vs for him to go on dates. \n\nWatching them while dad finishes work occasionally is pitching in to help the household. Watching them so dad can go on dates is babysitting",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 191,
                      "content": "He didn't say he asked her to babysit; he said she has to babysit. \n\nShe lives in the house, so it's fair for her to do a bit of housework, but those aren't her kids & it sounds like OP pawns their care off on her more than once in a while if she had to come to him & tell him it's affecting her studies.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 133,
                      "content": "And watching them while you run a quick errand is completely different than going out on a date with your girlfriend.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 120,
                      "content": "Nope, babysitting is never a \"chore\" if it's your child it's an obligation if it's not your child it's not an obligation.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 87,
                      "content": "I kind of agree with this….also depends on how much of the cooking and cleaning she is doing.  I am getting the feeling she is doing 95% of the household work, for a place to live….seems over the top for a parent to expect this.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "I also personally would like to know if he providing money for her to go out with friends, clothing, makeup, etc. If OP still finances all that plus her living rent free I don’t see what the big deal is to have her watch the kids once in a awhile. But if OP has her doing it on a more consistent basis than she needs some sort of payment at that point since she is more of a nanny than an occasional babysitter.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "NO!!! Babysitting is different to sweeping.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I disagree. She needs a way to acquire spending money — not a lot of it. She can do chores like cooking and cleaning on her own time. But the childcare comes with rigid time constraints and can actively prevent her from finding her own work. It very much depends on how often it’s happening, but since she says it’s getting in the way of her studies, I would guess often.\n\nHe can’t deprive her of financial independence and of a way to find work.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 126,
                  "content": "It depends. If it's like once a month for an hour or 2 and they're old enough so it's like \"make sure they don't die\" that's like \"shit you do for family\"\n\nIf it's once a week and it's like entertain them and make dinner and don't let them out of your sight that's different",
                  "id": 16,
                  "comments": [
                    {
                      "score": 40,
                      "content": "According to the edit, it's three times a week, a few hours on each occasion. Twin 5 year old boys, so needing full supervision.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "He's doing it whenever he wants to hang out with his girlfriend.\nSo on the low end its at least a full night once a week.\n\nBut, lets be honest, he probably \"needs\" to get laid more often then that.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Wouldn't it make more sense to just agree on the number of \"chore hours\" she's expected to put in per week? Then it doesn't matter if she's required to babysit the kids or clean the bathroom, as long as the tasks stay within the allotted number of hours.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 91,
                      "content": "Seems great on paper, works well with reasonable people - but the tones of entitlement in this post make me think he'd just start accusing her of \"deliberately working slowly\" to try to demand more out of her.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 383,
              "content": "It doesn't sound like she is complaining about the basic chores - just having to take care of the kids. I wonder how often she is asked for childcare.",
              "id": 21,
              "comments": [
                {
                  "score": 249,
                  "content": "If she’s asked to do childcare multiple times a week I’m 100% with her. But if she’s asked to babysit a few hours once every few weeks, to me that is a chore. It really depends on the frequency.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 314,
                      "content": "I suspect it’s too often because she did complain that it’s eating into her study time. Chores I understand, but the sibling watching is often abused by parents. I was given my youngest brother to take care of at 9 because my parents had marriage problems and my mother was depressed. The task became so overwhelming that I grew up never wanting children of my own and I’m happily childfree now. Parents who make children and expect their older siblings to raise them can just respectfully fuck off as far as I’m concerned.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "Yes, and we don't know the frequency, so it's hard to judge. It also wouldn't hurt to know the number of children and how rowdy they are. One or two well-behaved boys are one thing, but three or four mischievous children can truly be stressful, even for a young adult.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I disagree, it's not a chore either way. Your children are not free labor.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "And whether it’s scheduled or Hey, we’ll be back in a few hours. See ya!",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yes, how often is \"occasionally\"  watching her siblings? If it's a couple hours every week, then the OP is correct... rent-free housing would be covered, but if she's being asked to watch film multiple times each week, then I agree with her.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": ">ance. So I just wanted to ask whether I'm wrong for not wanting to pay her extra money to do basic \n\nI bet dad has her watching his children so he can see his girlfriend, more than she gets to see her boyfriend.  I bet dad has her more of a mom, than a sister.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 61,
                      "content": ">  I bet dad has her more of a mom, than a sister.\n\nThat's my suspicion.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Well yeah, as soon as the only reason he actually gave for needing her to babysit was so that he could fuck off and hang out with his girlfriend it was pretty clear that OP is just using her so he can pretend to be single and childless with some young thing that probably goes to school with his daughter.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I think this information would be a quick determining factor between y t a and n t a",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 269,
              "content": "Maybe it’s a cultural thing or a American thing but in most of Europe and my household kids stay rent free at their parents for a while parents don’t take money from their kids…",
              "id": 32,
              "comments": [
                {
                  "score": 161,
                  "content": "[deleted]",
                  "id": 33,
                  "comments": [
                    {
                      "score": 8,
                      "content": "LOL, and for many years beyond. 33% of adult children still live at home in the US.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 60,
                  "content": "In Belgium, parents get childcare allowance from government up to the point where you finish studying (whether this is at 18 or 23, as soon as you are no longer a student, govt. stops giving money, and maximum until 26) so that's why in Belgium most people don't ask their children rent up until the same time. \n\nAfter that, it's very normal for a parent to ask €300 or even more from their children in order to cover the necessities. Depending on the situation, some parents choose to 'save' this money for their children to help them move to their own place or they just spend it privately.. There is much variety in this, but I don't know many young people that are working, living at home and not contributing financially to the household.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "It’s definitely a cultural thing. In the States, most people move out when they go to college or after they graduate high school. With the economy now, more and more people are staying home because they can’t afford to move out but a lot of time those people either pay a reduced rent or are expected to help out around the house more.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I am also in the states and what you are saying is decidedly false where I live. Almost no one can afford to move out after high school unless they go straight into a full time trade job and get married very young and a lot of people move back in with their parents after finishing their college degrees until they can land a job that pays enough to support themselves solo.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Every time I read “my kid lives in my house RENT FREE” it rubs me the wrong way. Like ok, it’s your kid, you’re their parent, not landlord?? Even if they are young adults it’s really weird to put this over their head",
                  "id": 38,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My dad always told me that he brought me into this world so a long as he is alive his biggest goal would always be for me the have a easier life then he had he is a firm believer that if you choose to have kids to help and take care of them until the very end (but I might be a weird case since I have a lot of health problems)",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Indeed. In Spain most children live at home (rent-free) while at university, and parents pay for their studies. Universities, on the other hand,  are far less expensive than in the US - and the government offers scholarships to help. And if parents are divorced and one of them pays child support, it has to be paid while the kid is studying full-time (until 25, I think, so as nobody decides to keep studying forever while their parents foot the bill).\n\nSo, expecting children to pay rent or move out the moment they turn 18 is not as universal as some people here seem to think.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "In my opinion it’s a shitty American thing. (I’m American)",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "In America over 50% of people age 18-29 live at home due to the fucked economy. \n\nBoomers just love to Lord it over their kids, it's honestly disgusting to me, like you should be grateful that your parents aren't forcing you to be homeless?",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 248,
              "content": "She’s also HIS child and in college. I would not make my own child, who’s in college, pay rent. Especially when she helps out around the house. I could see charging her rent if she was like 30 years old with a full time job or something like that.",
              "id": 43,
              "comments": [
                {
                  "score": 90,
                  "content": "Agree! Do you not want to set your kid up for success? Why wouldn’t you want her to focus all her time on her schooling? It isn’t like she is going out partying all the time.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 5,
                      "content": "yeah, right? plus i’m assuming OP’s daughter would give a vastly different version of the situation if asked",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "That's how I think too.  After I graduated from high school,  I continued to live at home (rent free) and worked part-time and attended the local community college. I would cook dinner about twice a week, and of course help keep communal living areas clean (sweep and mop the kitchen floor weekly, clean one bathroom weekly, mow the lawn, etc).  That's part of sharing a living space.  But my parents didn't expect me to act as a free babysitter,  housekeeper,  etc.  OP YTA.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I had to pay rent. Plus all my university costs. Still unimpressed about it.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 5,
                      "content": "You have every right to be unimpressed. I guess I can understand having to pay your university costs, assuming your parent(s) didn’t have the money. But making your child who’s doing the right thing and going to college pay rent to live in your home is kind of mean and miserly.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "My parents in high school never made me do chores, besides making your own bed and keeping your room clean sort of thing. They always preferred I study than doing chores. In college, they paid my tuition and I didn't have to do chores(for them, obviously I cooked and cleaned for myself) because my uni was far from home. When I got a job, finally I started paying rent because I always wanted to do something to pay them back and starting cleaning the house, helping around. But when I started paying rent, the same month my dog got sick, my dad's car broke down and something else happened that needed money.\n\n\nMy dad go superstitious and was like ok no don't pay rent, things just go wrong. I really didn't mind paying but it got to his head. Anyways, I just clean every inch of the house, take care of the dogs and run any errands. I'm half saving for a house and half saving up for a new roof for them(but it's a secret). I insist on paying grocery bills, but my mom keeps saying \"As long as I'm alive and earning, I can pay for myself.\" It's definitely a cultural thing, kids could stay with their parents until marriage.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "Maybe there's this weird thing in some cultures where people have children and then act like they're doing them a favor by providing basic necessities like housing but OP's child is a student living at home. Her job is to study and contribute to housework. Based on mom's reaction the babysitting is probably a regular thing.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Euh this is her house duh, of course she is allowed to stay in her own house rent free wtf???",
              "id": 51,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "If that were her job to pay for it, sure. But she is also cooking and cleaning, and presumably helping out with other stuff that her mother doesn’t notice. If her daughter is this upset, she might have a point: her mother is comparing it to her own experience and thinks her daughter should have something similar. Deciding to live without rent at your parents is in no way a similar life choice to having a kid.\n\nWhen my wife gave birth, I literally didn’t have time to sit down I was so busy on her and the babe’s behalf. She then would start to say bs like “you aren’t doing enough, I’m suffering here” without recognizing that I literally *couldnt* do more. It took a big conversation (read:fight) for her to recognize she was being unreasonable with expectations. Like the daughter, whose job is school, I had other shit to do, and I wasn’t getting a chance to do any of it because she was being unreasonably demanding.\n\nWhich is all to say: not enough information here, but the idea that “my house my rules” trumps everything is laughable. If you are directly contributing to your daughter’s grades falling, which you paid for yourself, that’s just lose lose for everyone.",
              "id": 52,
              "comments": [
                {
                  "score": 14,
                  "content": "I agree, my house my rules is laughable and OP should 100% listen to their daughters concerns and have a conversation. I am withholding judgement until OP gives more info around frequency, etc.\n\nHowever, my comment was solely about the allowance piece. If OP is paying for tuition as well as all living costs, they don’t need to pay an allowance for chores.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 474,
          "content": "Literally OP chose to have a baby while they were in school that was their brilliant thinking not their daughters it is not her responsibility to watch OPs children. I already have maybe an unfair bias when people say, and “they live in my home rent free” because they didn’t ask to be born. They didn’t ask to be put in this world you brought them into this world. It is your job to provide for them. Yes, as they get older, you want to teach them independence and to be able to live out in the world on their own. However OPs daughter is 20 years old and going to school. Yes OP daughter should clean and cook in her home. She’s 20 years old. She’s old enough to take care of herself, but giving your child a leg up in life when did that become a bad thing and like a point of contention. OP is TA absolutely. OP chose to have more kids if you can’t see your girlfriend because you have to take care of your children sucks to be you, but that was the decision that OP made.",
          "id": 54,
          "comments": [
            {
              "score": 240,
              "content": "Yeah I absolutely can’t stand parents who have this transactional thinking with their kids. \n\nYTA OP. You can’t expect your oldest to be responsible for your younger kids while holding them hostage with housing.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "It is also so baffling to me that OP would willingly force something that clearly caused them distress on their daughter. \"I went through it and survived, so can you\" is not a good reason to force her to go through it. Don't you want a better life for your daughter? Don't you want her to succeed?",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "100%. This is a big reason why my mother and I are NC now. Everything was transactional with her. \nStill is. She still frequently tried to tell me “after **everything** I did for you” (meaning house me, feed me, buy me clothes and *occasionally* toys and other things) before I completely cut off contact. \n\nOmg just an example, actually, as an adult. I was kinda broke at the time and she invited me to a water park. She told me I could pay her back when i got paid. Okay, cool. I brought some snacks/drinks from home so I wouldn’t need to pay ridiculous park prices. This woman goes and buys me a water bottle. Only $2. I thank her. She says “I’ll just add that to your tab”. Excuse me?! I say “I have drink in the car. I can just drink that. I don’t need this.” She gets upset and says that’s ridiculous, i don’t need to go to the car, and she already bought it for me. I got really upset and said “okay but I didn’t ask for this; you don’t **nicely** buy someone something and then decide they’re going to pay you back when they didn’t even **want** it….she did stuff like that all the time. \nSorry just remembered that and got frustrated all over again lol\n\n\nAlso I was parentified, like OP’s daughter. I was forced to start babysitting my sister by myself, for free, **every night** starting around 12 or 13. Also was forced to help with her from birth. Started with my mom would always *yell* “I need your assistance!” just with changing diapers, bath time, etc….turned into me changing diapers **by myself** (at 9-10) and other things. \n\nI’m all for asking siblings to help occasionally but having them full on **take care of** their younger siblings, absolutely not.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Full time college student living at home should help with chores, not babysitting 30-40 hours a week for free.\n\nFew hours here and there isn't unrealistic.   3 days of work and the occasional outing is a live in maid and deserves a living wage.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 286,
          "content": "Also (and I’m going to get downvoted into oblivion for this) school is harder now. There’s more for us to learn. Furthermore: what was your degree and what was hers? Were you telecom to her biomedical engineering? If so the work load isn’t even remotely comparable",
          "id": 59,
          "comments": [
            {
              "score": 42,
              "content": "Maybe it depends. I did my first degree 15 years ago and struggled. I went back for another this past year and breezed through. I honestly don't think the difficulty level was changed much - sometimes it all comes down to your head space. And of course, as you mentioned, your area of study!\n\nI'm also a teacher and am very familiar with changing curriculum etc! Things have CHANGED a lot but I wouldn't classify them at all as \"harder\" now",
              "id": 60,
              "comments": [
                {
                  "score": 43,
                  "content": "Definitely depends on the area of study. \n\nI did some semesters in an animation program and most of the professors, even ones who were still fairly young, admitted that they could probably not have handled the workload we had. They said that there were so many more classes and skills to learn nowadays than when they went to school, due to the advances in technology and the switch these bought in the industry. That nowadays, graduates need to know more in order to even enter the workforce as a \"well-rounded\" employee.\n\nThat probably applies to most areas of studies, due to more knowledge in the fields, advancements in technology, and overall more rigorous demands by employers (less willing to train on the job) for graduates that are immediately ready to work.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">There’s more for us to learn.\n\nYep. Profs I've had have said the same thing. \"If I was going through this same degree in today's age it would be much harder\". Because the information we have on any given subject is exploding exponentially every single day. We have so much more info to absorb now but degrees are still only 4 years long on average. The information density is what makes it hard. \n\nPlus the fact that with hyperconnectivity intruding into our lives more and more with time, the demand for our attention has skyrocketed and ability to focus has sharply declined. The technical term is \"continuous partial attention\" and it's been a phenomenon since the late 90s, but has progressed significantly in recent years, especially among millennials and zoomers. It's unfair to say that the responsibility and blame rest entirely on the individual to block out all distractions. Nowadays, colleges expect students to download apps that will notify students of changing course info, new locations for lectures and labs, reminders, messages, and everything else. Lots of lectures involve doing polls and quizzes from your phone. Add on to the fact that social interaction and networking plays a massive part of the college experience, and disabling social media is an unrealistic expectation. In fact the social damage caused by blocking out social media would be arguably worse than the effects of its distraction. But the fact that we have to manage that additional layer of responsibility, while carrying around devices that constantly scream for our attention, is something that previous generations of students didn't have to manage. It was so much easier to separate work from play, and valuable info from noise.\n\nAnd finally the flexibility of degrees has also changed dramatically. When my mom's generation was in school, most families were not sending their children off to college. So the predominant societal model was to enter the workforce and begin your \"adult life\" directly after high school. Colleges offered a lot more \"work while you study\" type of arrangements, like night classes and prolonged degrees (i.e. programs explicitly designed to allow you to juggle your college workload with raising a young family). Nowadays, post secondary education is basically non-optional, so the predominant societal model is that you continue to live off your parents into your 20s, and continue to be a full-time student for at least 4 years after high school. Because of this, the flexibility of degree programs has shifted. Yes there are still online/night classes, but the quality of education will not measure up to that which is obtained from being a full-time student. The most in-demand degrees are taught during daytime hours and have very little flexibility for alternative arrangements. And now more than ever, it DOES matter that your degree is in-demand, because a couple generations ago, having ANY degree was what made you stand out in the workforce. Now that so many people have degrees, it's the SPECIFICS of the degree that matter most. If you don't fully commit to the strict requirements of the \"right\" program for your field, then it's almost as bad at not having a degree at all. So many young people can't find work after graduation for exactly this reason. So OP expecting their daughter to sacrifice their schooling in this way could severely impact the rest of her life. It's a generational difference that's not very well understood, in my experience. \n\nMy parents didn't understand when I was going through it, and expected me to hold down a full time job and \"just take classes at night\" like they did. Ignoring the fact that my degree was accredited and therefore only offered certain courses during the day, all my project groups operated in the daytime, and lab work had to be done during daytime lab hours. I barely had time to take care of myself let alone try to hold down a job, and the intensity didn't lessen for the entirety of my 5 year program. My parents response was that I should just go to a more flexible school, then. Well, the majority of my peers who went to those schools couldn't find relevant work for nearly 5 years after graduation. Being 5 years behind in your career progression is a LOT.\n\nTimes have changed. And it would be great if older generations would listen instead of insisting they know better.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 214,
          "content": "This, YTA for the comment comparing it to your experiences when you chose to have a child, as your sister explained. Yes, it's very reasonable to expect her to do chores in return for living there rent-free, but if she's not comfortable baby-sitting and it's eating into her study time, you need to find a compromise or at least listen to her instead of being dismissive.",
          "id": 63,
          "comments": [
            {
              "score": 10,
              "content": "Being dismissive is not ever the right answer.  Listening is.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "And he also had an ex-wife to help!",
          "id": 65,
          "comments": [
            {
              "score": 183,
              "content": "Probably made the wife do everything and that’s why she’s an ex now",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "My guess is she did a LOT more...",
              "id": 67,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "This is the problem I have with OP’s attitude. His situation was 100% a result of his choices and 100% his responsibility as a parent. The daughter is absolutely not responsible for them and shouldn’t be forced or expected to watch the kids.\n\nIf the dad expected these things from her in lieu of paying rent, OP should have laid out these terms when she first moved in. That way she would be able to decide for herself what was/wasn’t worth it to her while she tries to juggle schoolwork and her personal life. It’s not fair to simply expect it without proper communication then try to shame her into going along with it.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "I just don't understand it, the whole point of generational wealth etc. Is to work so your children have a better life than you had, so that they don't face those hardships, but boomers/gen-x just turn around and want everyone who comes after them to face the same problems they had, on top of everything else?",
          "id": 69,
          "comments": [
            {
              "score": 12,
              "content": "Actually, if OP's daughter is 20 and he had her in college, op is likely between the ages of 38-42. Making him solidly an older millennial, not even gen X let alone a boomer. Signed - a 29 year old Millennial.",
              "id": 70,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "YTA  and u feel entitled to others things, like their time. Do you think she is an extension of u?",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "\"Apparently\" that was his decision was the most laughable part of his own post.",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "did you catch the \"since **apparently**\" he put himself in that position...\n\n**apparently** dude didn't know what his dick was getting up to either 😂",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10634,
      "content": "You're not the asshole for not giving her an allowance. She is living rent free, after all. You are the asshole for your diatribe about how if you can go to school, pay bills, and take care of a family, she should also be able to. What may have been easy for you, may not be for her. People have different stress thresholds. If she's telling you that babysitting is too stressful on top of school and chores, I think you should listen. And it's not like she's complaining about chores and doesn't want to do anything around the house. She's simply telling you that adding babysitting onto her chores is overwhelming for her, which it may very well be. Also, her siblings are your kids, not hers, so they're also your responsibility.",
      "id": 74,
      "comments": [
        {
          "score": 5009,
          "content": "Also, key point, OP chose to become a parent. His daughter did not.",
          "id": 75,
          "comments": [
            {
              "score": 2226,
              "content": "Also OP had the partnership of daughter's mother.",
              "id": 76,
              "comments": [
                {
                  "score": 1984,
                  "content": "I’m willing to bet her mother did the lion’s share of the childcare, not OP.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 932,
                      "content": "That is what I was thinking. Mom likely did the bulk of the work while dad took out the trash, played with the kid once a week and called it good. I mean the guy is prioritizing his girlfriend over his daughter’s education.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "I was going to say this as well!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Good point!",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 718,
          "content": "It seems like a very common theme in these posts that parents often don't understand the workload that comes with college. In a lot of these posts I see (at least implied, if not outright stated) that the kid in college only has class a couple hours a day, and thus is free for chores, housesitting, petsitting, childcare, a full time job, etc for the rest of the time. It's a first generation college student challenge that isn't talked about enough.",
          "id": 81,
          "comments": [
            {
              "score": 1400,
              "content": "My son's in his junior year of college.  He did his freshman-sophomore years at a local community college, and his freshman year was almost 100% remote learning due to COVID.  He lived at home, rent-free, while in college.  He'd spend HOURS on the computer every day for school.  Sometimes, I'd just see him as a blur running into the kitchen for food before his next lecture began.  \n\nYes, he had chores and responsibilities.   \nHe has 4 younger siblings and has ALWAYS been a big help to me.  If I asked for help, he'd drop everything to help.  But that's also who he is as a person.  In return, he knew that if I asked for help, it was important.  I very rarely bothered him, as I feel that his education is his full-time job.  We had a schedule of chores we both agreed on, and whenever he was available to help more, he'd offer.  If he told me that he was burdened by what I asked of him, I'd take his concerns seriously and try to address them. I have a wonderful kid, BTW.  \n\nBut he also deserved downtime and a way to decompress from the day/week. To assume that a student's down time is free time is wrong.  They are stressed just as much, if not more than we are.  They need time away from responsibilities just like we do.\n\nAnd not for nothing, if I'm paying for college, I believe in my child and would like to see a ROI of them being a happy, successful adult at the end of this.  Why would I stress them out by forcing chores/babysitting duties on to them that they cannot handle?  That's a bit counterproductive to my investment.  Their grades might slip, they could lose a scholarship that's essential to their education, they could become depressed and begin to suffer mentally.\n\nTL;DR:\n\nOP: YTA for the way you spoke to your adult child, who is only trying to communicate her feelings on babysitting.  They aren't HER kids; they are YOUR kids.  Would it be nice if she helped?  Sure sure.  And perhaps, if you weren't such an asshole, you could have had a good conversation about when/where you need help, see if you two could come to an agreement on it, and show your child she's a valued member of the household while making sure she recognizes your contribution to her future financially.  \nBut no, parents do what parents do and use the whole \"When I was your age\" BULLSHIT LINE that NO ONE WANTS TO HEAR.  That's basically telling someone to STFU and deal with it.  That's not a solution, that's a damn guilt trip.",
              "id": 82,
              "comments": [
                {
                  "score": 277,
                  "content": "You sound like my mom and OP sounds like my dad. Your post makes me miss my mom so bad. Your kid is lucky to have you.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 87,
                      "content": "I'm sure your mom saw what a wonderful person you are too :)",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "OP take notice on how only one parent was missed",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 156,
                  "content": "[deleted]",
                  "id": 86,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Exactly that will happen, the household will collapse",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "One of my jobs in high school was to babysit two kids three times a week. It was my damn job and I got paid for it. It even sounds like her hours were comparable to mine. She’s literally working a part time job and not being compensated in any way for it. \n\nI was really hoping he was asking her once a week or less because that’s more reasonable. But no he’s asking her to work for free. Ridiculous.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My MIL kicked my wife out of home at 18 because she didn't approve of our relationship (well, she presented it as a choice - she could either break up with me or move out. I suspect MIL expected her daughter to get rid of the girlfriend, and was angry when her power play didn't pan out. This was 17 years ago).\n\nYou know what she did the very next weekend? DEMAND that the pair of us come over to do the weekly household chores.\n\nFor a household my partner had been booted from and I'd never been part of.\n\n(My MIL is a narcissist, and I am so glad my wife cut contact with  her a decade ago...)",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": ">To assume that a student's down time is free time is wrong.  They are stressed just as much, if not more than we are.\n\nSo true, and the reasons for that is:\n\n1. They don't get paid, so no fun to compensate the work (study)\n2. The whole effort is up in the air / on the line until they get the degree\n3. Uncertainty about what they can, want and will do after the graduation\n4. Exams",
                  "id": 90,
                  "comments": [
                    {
                      "score": 9,
                      "content": "And most of them have the knowledge of future crippling debt hanging over them, too.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 245,
              "content": "Also, different degree paths and different universities will have different workloads.\nI had way more classwork than my roommate who did civil engineering as opposed to my aerospace engineering. But that can be different at other universities or with different professors.",
              "id": 92,
              "comments": [
                {
                  "score": 163,
                  "content": "Regardless of the college workload, there's also a point to be made that you're not entitled to your adult child's time just because it happens to be free. You occasionally see this in posts about working adult children too. Instead of \"you only have a couple hours of class\" it becomes \"you need to do X because you don't have pets or kids taking up your time\".",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "This is what I'm wondering about, because degrees are wildly different dependant on subject (also workload will have changed a fair bit since he was studying anyway).\n\nPlus he chose to study and have kids, she chose to just study.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Yah, I have a daughter who is a student. She has no college student life to speak of, she has no time for parties, shopping or any of that fun stuff, that students traditionally do, if she wants to succeed she has to work every day all day. The first year in her group had like 1/4 success rate. You work hard or you drop out. Think I want to tell her that she lives in my house \"rent free\" and has to do chores? Sometimes she'll help with something but most of all we want her to succeed in her studies, she needs all the support she can get for that. What is it with people like OP?",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I tell my students to expect 3 hours outside work for every in class hour--which is considered the norm.",
              "id": 96,
              "comments": [
                {
                  "score": 6,
                  "content": "That was standard when I got my 1st degree. For every credit, expect 3 hours of outside work.\n\nWent back for Music Therapy. Music Degrees are completely different! Mandatory major ensemble which was required for 7 semesters (orchestra, band, choir) meets 5 hours/week plus performances, 1 credit. Applied piano, expect to practice 1 hour/day, required 5 semesters. Same with main instrument. 1 credit each. If main instrument is piano, 2nd instrument/voice required.  Then add in your regular classes. It was hell!",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My uncle told me starting out that however many hours I spent in class is how much time I should spend studying, excluding homework. That's why 14 hours is considered \"full time\".\n\nWhat he didn't know what that I'm an art student which means my hours say they are full time, but are actually far, far more. Yaaaay.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 348,
          "content": "Yep. Hello burnout induced depression.\nAnd no one listened or took her serious.\n\nAnd next year she asks how her daughter failed her studies, lost all drive and can’t even get out of bed anymore….",
          "id": 99,
          "comments": [
            {
              "score": 23,
              "content": "Her trying to communicate her needs \"pissed him off\". What a great dad. :/",
              "id": 100,
              "comments": [
                {
                  "score": 9,
                  "content": "Ngl, I thought this was MY dad until I read about the kids/babysitting. My dad pulled all the same shit with the exact same attitude. Haven't spoken to him in 5 years. \n\nIf this guy's anything like my dad, honestly, he probably doesn't want her to succeed. He wants her dependent on him, but not too dependent, just enough so he can get free labor and a nice little prop in his life who can show off what a great single dad he is. He's selfish, self-centered, and given his attitude toward her even expressing her feelings... a hot-headed self-centered AH.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "And the economy when OP went to school was vastly different than the current one.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": ">You are the asshole for your diatribe about how if you can go to school, pay bills, and take care of a family, she should also be able to.\n\nYeah, that has a seriously annoying, \"You kids nowadays don't know how good you have it!\" vibe.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Plus if she is stressed and struggling to balance the study and the babysitting, that may impact her ability to be a good babysitter. OP should be mindful that there is a risk that she may sneak off to her room to study when she is meant to be watching the kids.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Exactly - the daughter isn’t complaining about daily chores that she’s expected to do - she’s old enough to be responsible for some chores in the house. In his own words she approached him expressing the difficulties she’s having with the added babysitting duties and that it’s negatively affecting her ability to do schoolwork. That’s very specific, not blanket entitlement from her. Expecting his life and abilities to be her standard is what’s unfair here. I’d also guess that it’s not only eating into her study time but also prohibiting her from getting a PT job. As another commenter said, holding her hostage with housing is just unfair, particularly because the added time and responsibility of babysitting makes it impossible for her to change her housing situation even if she wanted to.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "OP wants his college age daughter to act as a SAHM so he can continue to act like a college student now.",
          "id": 106,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "> She is living rent free, after all\n\nAmerica is a really strange country. This idea of asking rent from your kids once they are adults, even if you own the house is so evil IMO",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "> … so they’re also you’re responsibility \n\nI disagree. They are *solely* OP’s responsibility. They aren’t the daughter’s at all. \n\nOP, YTA. You chose to have kids… so take care of them.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5811,
      "content": "Info: what is ‘occasionally’ realistically?\n\nYou chose to have a child and study - the situations aren’t comparable at all.",
      "id": 109,
      "comments": [
        {
          "score": 1942,
          "content": "I have a feeling we’re not getting the full picture here.",
          "id": 110,
          "comments": [
            {
              "score": 1047,
              "content": "we dont even have the age of amount of siblings. Which also has a big influces. I would still say OP is responsible for her own kids, not ~~her~~ his daughter, but it feels odd to be left out.\n\nEdit1: pronouce\n\nEdit 2: forgot to vote YTA, and a mayor one at that when the siblings are 5 y/o twins",
              "id": 111,
              "comments": [
                {
                  "score": 300,
                  "content": "Exactly! Are we talking 8-16 yos or are we talking 1.5-7 yos? The amount of care those age groups need is vastly different",
                  "id": 112,
                  "comments": [
                    {
                      "score": 707,
                      "content": "5yo twin boys. 🙃\n\nBut it’s okay, because they aren’t “crazy kids!” They’re mature for their age! And it’s *”usually”* only for 3 nights a week, and *”usually”* only for a few hours!\n\nOP is a total AH here.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Probably his own kids…along with an ex wife",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I was a 5 year old twin and my brother and I drove our older sister crazy",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 377,
              "content": "Definitely not especially since he makes sure to throw in that his sister is gullible so he can downplay daughter’s side even more",
              "id": 116,
              "comments": [
                {
                  "score": 165,
                  "content": "Yeah the sister comment was completely unnecessary",
                  "id": 117,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I was on the fence before that, but once he said that I knew for sure he was downplaying everything.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Unnecessary, but VERY telling. Dude probably mimizes *anyone* who tells him he's in the wrong. Watch as we get an update about how mean everyone was and some blase update about how he \"got his daughter to agree\" to 2 nights a week instead of 3 and he proceeds to change nothing. I am  WAY too familiar with this type of person.\n\nLowkey hope the daughter or aunt find the post. Just so they can see what he REALLY thinks of them.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Exactly. \"Oh my sister is gullible so don't take her opinion seriously guys.\"",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Worse yet, he lumped kind in there with gullible as if they belong together. Very telling about his worldview, imo",
                  "id": 121,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 139,
              "content": "He probably thinks we’re gullible too.",
              "id": 122,
              "comments": [
                {
                  "score": 19,
                  "content": "Take a gander at his edit.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 36,
                      "content": "\"they're more mature than the typical one's you'll see\" \n\nI know everyone thinks their kids are the greatest and all, but like.. really. His 5 year olds are mature but his grown daughter who doesn't want to be overwhelmed with college, 2 children, and all the other challenges being a 20 year old has, is selfish and lazy lol wtf\n\n\"Just take care of my kids, fuck, what are you even here for, I had to raise you, I even tried to give you a better life until I wanted a break, SMH ungrateful, they aren't even normal 5 year olds, so very unlike every other 5 year old in human history, they are mAtUre 5 year olds\" lmfao",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Yeah, I’m gonna call bollocks on all that.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "No kidding - sometimes I ask for dinner - things you are expected to do daily... OP is pulling back the truth to make himself look better and is still the AH",
              "id": 126,
              "comments": [
                {
                  "score": 4,
                  "content": "yep. let’s hear the daughter’s side of it",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "We pretty much lack more information than that we were given.\n\nHow much of the household chores does daughter do?  \nHow many children are there?  \nWhat are their ages?  \nHow well behaved are they?  \nHow often does she need to babysit them?\n\nAll of these are pretty important to give a reasonable answer to this question. She's already doing a full-time job with college so what more does she have piled onto her plate by OP?",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Yea, there's a big difference between \"please watch your 12yo sibling who's going to play video games all night and you just have to be around and feed them frozen pizza\" and \"watch the 2, 5, and 7yo who need help with everything and will be up your butt the next 4 hours\"",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Also if she is watching them 3x/week does that mean she’s cooking those 3 days too? Plus cleaning after twin 5 year old boys? YTA",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 462,
          "content": "The definition of \"occasionally\" is really the crux here.  If she's watching the kids once a week for 4 hours, well, that's a pretty good deal for free housing and school.  If she's watching them every other day from the time they get out of school until they go to bed, that's a whole different story.",
          "id": 131,
          "comments": [
            {
              "score": 234,
              "content": "[deleted]",
              "id": 132,
              "comments": [
                {
                  "score": 230,
                  "content": "He said daily cooking and cleaning in the original post",
                  "id": 133,
                  "comments": [
                    {
                      "score": 265,
                      "content": "Daily cooking and cleaning (possibly the whole house) could be hours a day, especially if the kids are young.  That's plenty worth free rent to give your child a boost in life.  I'm guessing he has never done cleaning and she's been doing it her whole life.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yeah he basically turned his daughter into his maid lol",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "An edit says 3x a week for a few hours. Add in daily cooking and cleaning and it sounds like the daughter is way more a parent than OP is. \n\n> They aren't crazy kids by the way, they're more mature than the typical one's you'll see.\n\nThis also means they’re hell to deal with, I’ve never heard a parent describe their kid as “more mature” and had it be an accurate description",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "He's said 3x per week for several hours at a times which is actually a fuckton. It is every other day and several hours is probably from when she's home from school until bedtime.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 377,
          "content": "He tried to play it off as occasional chores and babysitting but i have a feeling daughter is playing mommy",
          "id": 138,
          "comments": [
            {
              "score": 242,
              "content": "He said the cooking and cleaning are “from time to time” and immediately followed that sentence with what you’d be expected to do daily anyway. Like, which is it? \n\nHe also argues that she should be able to babysit (on top of taking care of the house and going to school full time) since he was able to do the same *alongside his ex wife.* So his daughter is supposed to do the work of two people for kids that aren’t even hers? \n\nYTA, OP. Hire a babysitter so your daughter can focus on her studies or at the very least pay her to do it. You’re an adult so I’m sure you know how to cook and clean, too. If not, maybe your girlfriend can do it since I’m sure that’ll be her responsibility if you ever live together.",
              "id": 139,
              "comments": [
                {
                  "score": 24,
                  "content": "Time to time. You know, one 24 hour period of TImE to the next.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 78,
              "content": "Yea I was getting that impression from this as well, which is pretty messed up just so he can around town with his gf",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 336,
          "content": "‘Typical things you would expect to do on a daily basis anyway.’\n\n🤨",
          "id": 142,
          "comments": [
            {
              "score": 353,
              "content": "Gotta wonder, does he do any of those things on a daily basis? She's 20 now, how many years had she been providing childcare, cooking, & cleaning up after OP & their children, on top of her own homework? \n\nOP - YTA",
              "id": 143,
              "comments": [
                {
                  "score": 187,
                  "content": "I suspect he does absolutely none of the cleaning or the cooking.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "Also I assume its cooking and cleaning for a whole family, vs just herself. Which is a hell of a lot more. At least 4x more i would assume. A college student would happily eat ramen noodles which are ready in 5 mins. I bet OP wouldnt be happy with that. Also,  this might differ depending on the family, but it is assumed for many that you will help your kids through college, if thats what they choose to do. Now he is lording that over her for complaining about \"helping\". He essentially wants her to be a live in nanny. I would assume in this situation none of this was talked about before hand. Like he told her you can live with me during college and save money. She thought oh perfect, then OP was like btw you live in my house for free you have to do XYZ.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I mean, I'm a student cooking just for myself, I generally cook like 2 times a week, for a number of days. That probably isn't going to work when you are feeding an entire family so you'd need A LOT more time just for cooking.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 210,
          "content": "OP posted an edit that his daughter is watching his two 5 year old twin boys for a few hours 3 times a week. \n\nPoor daughter has been turned into her dad's replacement housewife while he goes and hangs out with his girlfriend. She's babysitting for free on top of doing the cleaning and cooking while being a full-time college student. \n\nAbsolutely appalling behavior OP. YTA.",
          "id": 147,
          "comments": [
            {
              "score": 39,
              "content": "sounds like big man didn't want to put on his big boy pants after his wife left him and instead passed on all the \"motherly\" jobs to his daughter. Totally TAH",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 74,
          "content": "[deleted]",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "yeah op, ‘occasionally’ ≠ 3 times a week",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "And how predictable is the babysitting? Because I see others comment that she should get a part-time job if she wants money, but if she’s expected to drop her own work whenever OP wants free childcare then she’s unemployable and probably can’t plan her schoolwork either.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah also I’m going to need clarification on the cooking and cleaning because it sounds like she cooks and cleans every day? Is the pouring the kids their cereal, packing their lunches for school, making their afternoon snacks and then cooking a dinner for like 6 people with varying levels of fussiness, then doing all the dishes after each meal plus cleaning the kids’ bathroom, doing their laundry, cleaning the common areas and changing everyone’s sheets?because when I think of daily cooking and cleaning that’s what comes to my mind. And that’s enough on it’s own to cover her board. She shouldn’t need to also raise his children on top of that. \n\nIf I were her I’d move tf out and live my own life. I’d rather work and pay rent than be the live in maid for my father",
          "id": 152,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4705,
      "content": "YTA. Your kids are not her responsibility. She’s doing you a FAVOR by watching them so you can fuck around with your girlfriend. When your daughter inevitably goes no contact with you, don’t come back asking why.",
      "id": 153,
      "comments": [
        {
          "score": 1366,
          "content": "It's so funny to me when parents on this sub are like \"am I the asshole for treating my kid like shit?\" And they NEVER think their kid is going to completely disregard them once they're old enough.",
          "id": 154,
          "comments": [
            {
              "score": 471,
              "content": "“My kids are treating me like shit for holding me accountable for treating them like shit before they were capable of emotionally handling it. Why won’t they talk to me anymore?”",
              "id": 155,
              "comments": [
                {
                  "score": 204,
                  "content": "Why do people even have kids, if they're not going to give them a better life than they had themselves? Did this dude have kids just to do his chores?",
                  "id": 156,
                  "comments": [
                    {
                      "score": 149,
                      "content": "Probably? That’s what my parents did.\n\nAnd then some people feel that because they suffered, they must make other people suffer. They sound exactly like OP.",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "> And they NEVER think their kid is going to completely disregard them\n\nTo be fair, that’s because of our society. I cut my dads side of the family out. I occasionally tell stories IRL about how they destroyed my self esteem, tried to convince me that anything I do couldn’t be good enough unless it falls in line with their vision for me, how they destroyed any ability my sister and I had to form a relationship by constantly putting us against each other, and how they genuinely made me want to die. The response online to these stories is overwhelmingly supportive and understanding. IRL though? It’s a 50/50 between those who understand, and those who fight tooth and nail to convince me “but they’re your faaaammmmiiillyyyyy they tried their beeessssstttttt.” It is delusional, but it’s a delusion that’s pretty mainstream to believe.",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 110,
          "content": "Anyone is an asshole for using “I was miserable so they should be miserable too” mentality. Household chores fair game, but she hasn’t asked to be a parent.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "He basically is expecting his daughter to fill in as mom. Clean house, cook food, watch kids. The whole \"I did it you can too\" bit is just asinine. He CHOSE to have a child with a partner. His daughter did not ask to be anyone's mom or nanny. I can understand helping around the house if you live there but his kids are not her problem.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1785,
      "content": "INFO: This all depends on how often this happens. Does she have to babysit the kids one night every few weeks, or is more a multiple times a week thing? Also: do you expect her to drop any plans she already has, or do you get someone else if your daughter already has plans?\n\nIt's not unreasonable to ask her to help out, but she also has her own life and plans and she shouldn't always be expected to drop her plans to do something fun just so you can do something fun instead.",
      "id": 161,
      "comments": [
        {
          "score": 411,
          "content": "Same.\nKey questions: \nHow often is she expected to babysit?\nFor how long?\nHow many kids and how old are they?\nHow does the conversation go regarding babysitting? (Ie are you taking her availability and schedule into account, are you \"asking\" her or \"telling\" her?)\nWhat happens if she can't babysit on the day you'd like?\nWhat happens in case of an emergency?\n\nThe answers would really dictate my judgement.\nEdit: three times a week?? Yeah fuck that. YTA.",
          "id": 162,
          "comments": [
            {
              "score": 151,
              "content": "Also, when she moved back in (or decided to continue living there), did she know that \"watching kids\" was one of the chores? Picking up after yourself is normal but anything extraordinary like babysitting should be discussed prior to the living situation.",
              "id": 163,
              "comments": [
                {
                  "score": 24,
                  "content": "This is key. Was it a predetermined agreement? Or did OP pay for college and allow rent free living without explicitly telling her there was a trade off? My mom constantly “does nice things” for us but it’s always implicitly got strings attached, and when we least expect it she will use “well I did this nice thing for you so you can do this for me now” against us. I’m getting these vibes from OP but I may be jaded.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "Also, it's not unreasonable to *ask* but it sounds like OOP doesn't ask as much as he tells and threatens if she says no. If daughter wants to go out to school club, or with friends, or to network with other people (which is a huge part of the value of college in a career), and OOP wants to go on a date with his girlfriend that same day, does the daughter have room to say \"no, I can't do it this time?\"\n\n\nHow much heads up is the daughter getting about these babysitting days? College students have to jump through hoops sometimes because professors or departments move things around without much warning; if you're giving less than 2-3 days of notice that she has to babysit young children for an entire evening that's a huge issue to her schedule.",
          "id": 165,
          "comments": [
            {
              "score": 70,
              "content": "I have a two daughters, 5 year gap. So I would hope she might do one evening a fortnight with 3 days notice and if she said “no sorry, I’m doing x that evening” then I would respect it 100% - It isn’t her responsibility to raise her sibling.",
              "id": 166,
              "comments": [
                {
                  "score": 10,
                  "content": "I have a 20 yo daughter and a kitten (plus adult cats). Because the kitten needs extra feedings, Ive asked my kid to come over and kitty-sit for one evening every month or so. I usually give at least 2 weeks notice. And though I don't pay her, she gets free stuff from us (we do give her money sometimes). - also if she said no, I'd work it out. I offer it to her because getting an evening with a baby cat can be fun without feeling overwhelmed by the responsibility of buying stuff/food and vet bills, etc. \n\nI realize this isn't the same, but I was thinking about how much notice I'd give and what I'd ask of her and whether even what I asked was asking too much or not. I even feel a little bad about asking it of her, but she has said she enjoyed it, and I certainly hope she'd tell me if she felt differently. And this is just my anxiety about babysitting a kitten for a single evening in a month (just so the hubs and I can go out). I dont think I could ever impose on someone else, especially my own child, with such demands as babysitting 3 times/week. It's insane to me to do to a student.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "I feel like if she is concerned that it’s impacting her studies, it’s not just once every few weeks.",
          "id": 168,
          "comments": [
            {
              "score": 43,
              "content": "Especially if it seems like she does all the cooking and cleaning.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "[deleted]",
          "id": 170,
          "comments": [
            {
              "score": 9,
              "content": "On average, 3 times a week for \"a few hours\" and the kids are 5-year-old twins but don't worry, they are really mature kids.\n\nAll per OP's edit",
              "id": 171,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 77,
          "content": "Same. How often is she “asked” to babysit?  I also want to know how much she is cooking and cleaning, because I’m starting to suspect she is expected to do all the cooking and cleaning, not just contribute to it.  If you are going to school full time, doing all the cooking and cleaning for 4 people and keeping kids a few times a week, there is no time to do anything else, including studying or fun. She’s said she’s having a hard time keeping up with studying and OP isn’t hearing her. Unless we get answers that contradict this, I’m going with YTA.",
          "id": 172,
          "comments": [
            {
              "score": 48,
              "content": "Apparently the cooking and cleaning she does daily",
              "id": 173,
              "comments": [
                {
                  "score": 25,
                  "content": "I was all for the occasional babysitting since she gets college paid and lives at home\nBut I draw the fucking line at daily cooking, JFC what a way to parentification or whatever it is, this poor young woman. \n\nOP it’s okay to ask to cook a couple days a week and to have the standard chores a child has continue into their young adulthood and the occasional babysitting(as long as you are checking in with her that she isn’t falling behind at school) but WTF is up with cooking daily!! Even me and my husband hate that we have to cook dinner every night and we split that task.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "OP edited that it's around 3 times a week, which is a FUCKTON, even more when talking about 5 year old twins. A fucking nightmare, I pity your daughter.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I’m interested in this too. I like to think my daughter would babysit her younger sister occasionally when she is 20, few hours once a fortnight for a date night I feel would be reasonable?? Multiple times a week means you need to source proper childcare.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1500,
      "content": "Cooking and cleaning are certainly things you have to do on a regular basis anyway, but cooking and cleaning for an entire family vs just cleaning up after yourself is a major difference. \n\nywbta if you don't listen to her when she's saying it takes too much time away from studying to add the babysitting. Don't pay her, pay a babysitter so she can keep the study time.",
      "id": 177,
      "comments": [
        {
          "score": 318,
          "content": "Yeah. Why would “cooking for the whole family” ever be a chore for her? That’s the responsibility of the parent. She’s going to resent being the oldest and having all this undue responsibility slapped on her. She’s staying with her parent for the free room so she can get through this moment in her life… and then she’s going to leave and never look back because she felt undervalued and her needs ignored. My middle child is home from college for winter break right now, working FT and cooks his own food, cleans his own room, and that’s it. He should enjoy his few free moments before having to become a working adult.",
          "id": 178,
          "comments": [
            {
              "score": 89,
              "content": "My parents did this to me and now that my sisters are having kids, they’re always buying my lunch and presents to make up for how much I took care of them as kids (I love my sisters and it wasn’t their fault). Our parents now think that when they retire, they should just divide their time evenly between staying with each of us every year and not have to own a home themselves. Why do people make their kids their retirement plan? This is why some of us don’t have kids and want to go live on Mars.",
              "id": 179,
              "comments": [
                {
                  "score": 16,
                  "content": "Same. My mom is mooching off someone else now. We’ve been no contact for so long, I doubt she would try to stay with us. Good luck with your parents. Yikes.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Why do some parents assume they can just live off of their kids, sure their kids did it to them but they were kids and couldn't get a full-time job. But with the state the world is in on average every younger generation has been worse off than their parents.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Because, by their logic: they invested all that time/money/energy into YOU, so they should be able to get that back... nevermind that as parents they're legally/morally/ethically obligated to do that. \n\nA lot of parents think of their kids as property/extensions of themselves. It's super unhealthy, but no one wants to really call that out because \"how DARE you tell me how to raise MY kids\" or whatever. What they seem to forget is those kids grow into adults and THAT'S when they realize they reap what they've sown.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "They call them the “me” generation for a reason.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "If either of my parents nonchalantly assumed they could make my home their retirement destination, they'd get a hard shock to the system.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I adopted 7 cats to deter them, lol",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Seriously, there a lot of entitled behaviors that I've noticed from parents over the last few years, but the entitlement of \"be my retirement plan\" takes the cake. I know some cultures, it's a given, but in those cultures there's also a huge understanding of the parents investing everything they can to give their kid a good start. In many of those cultures, the kids live at home as adults (sometimes until they're married/graduated college and working full-time), their needs and expenses are taken care of. A LOT is put into that.\n\nThe amount of entitlement of parents being like \"Hey, I bitched and moaned about having to pay for everything for you, you'll be my retirement plan, right?\" Is astounding. I also get a bit of a chuckle because I've been NC with both my abusive parents for years now. If they came at me with that, they know I'd be laughing them all the way to a care home.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 887,
      "content": "YTA.  It sounds like you are putting the full responsibility of a full time SAHM on her. \n\n> “..a few things around the house… like **cooking and cleaning**… expected to do on a **daily basis**…”\n\n>> “…watch over her younger brothers… when I need a break to hang out with my girlfriend.”\n\nSince you have not clarified the many requests re: how often, I’m going to assume based on the words in your original post that you are being wildly unreasonable.",
      "id": 187,
      "comments": [
        {
          "score": 291,
          "content": "precisely the parts that were screaming out at me. daily cooking for a whole family, childcare duties so OP can \"hang out with my girlfriend\" are you kidding meeeeee",
          "id": 188,
          "comments": [
            {
              "score": 24,
              "content": "That just makes OP sounds like a teenager trying to get out of chores. Which might just make this worse, as OP is supposed to be the parent.",
              "id": 189,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 249,
          "content": "Yeah, a break from what exactly?  Cause he isn't cooking or cleaning.",
          "id": 190,
          "comments": [
            {
              "score": 136,
              "content": "Or taking care of his kids…",
              "id": 191,
              "comments": [
                {
                  "score": 18,
                  "content": "You don't understand the burdens of a man who has a job!\n\n/s",
                  "id": 192,
                  "comments": [
                    {
                      "score": 8,
                      "content": "How much you wanna bet OP tries to show off what a hard-working and great single dad he is to people like his colleagues?",
                      "id": 193,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Yeah, if he won't clarify, you can bet it's multiple times a week, if not daily.  If it was once every couple of weeks, he'd have lead with that to make himself look better.",
          "id": 194,
          "comments": [
            {
              "score": 7,
              "content": "Lmao u were right",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "His edit says he has her babysit 3 times a week, absolutely insane that he thinks that he's in the right",
          "id": 196,
          "comments": [
            {
              "score": 7,
              "content": "I can see it amount to a full workday easily, and other chores on top. If I was paying someone’s education I’d want them to succeed, this seems almost like sabotage.",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Exactly if she’s just their mom and also going to school that’s a load of responsibility. How many kids is she having to take care of too? He compared his taking care of her with her taking care of multiple boys from the sound of it. It’s already more work there.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 717,
      "content": "YTA. Just because YOU struggled, doesn't mean other people should. And you should also know how difficult it is. She is not a parent, and should not be treated as the 'mother' in the house. She's your child and if she says that she is finding it difficult to juggle everything, you are the parent, you need to suck it up! Or at the very least offer her something in return. What would you do if she moved out? You'd have to hire someone. Just because she is in the house, doesn't mean you can just expect her to do stuff for you in her time, especially when she has highlighted that she is struggling with studies. If she's already contributing to the household by doing a share of the cleaning, then she is doing enough.\n\nAlso, this notion of living in your parents house 'rent free' is madness. You and your ex birthed this girl, to use that she lives there 'rent free' as an argument against her is really shitty. That's her home and I wouldn't be surprised if she moves on quite quickly after college. \n\nHire a nanny.",
      "id": 199,
      "comments": [
        {
          "score": 366,
          "content": "Is it me or am I missing a huge chunk of culture here because even though I’ve been here for 26 years, I didn’t grow up in the US? I know people prefer to leave their home young and I know it’s normal to charge your staying children under market value rent just as a contribution, but the number of parents who are trying to nickel and dime everything that their child owes them as soon as they cross an arbitrary age (18) is astounding on this sub. Sure, it’s good to instill a sense of discipline and duty in your kids, I kind of wish we had this where I came from, but a lot people sound downright cruel about it.",
          "id": 200,
          "comments": [
            {
              "score": 348,
              "content": "I consider this resentful “you’re living rent free at my house” mindset towards one’s own children to be one of the most low-class things imaginable. I had no idea that it was so prevalent until I started following this subreddit. It’s one thing to ask that your adult child keep a job or contribute to expenses; it’s another thing entirely to hold it over their heads constantly and, as you put it, nickel and dime them for trivial shit. In my opinion it is extremely trashy and makes it seem like you want to sandbag your kids.",
              "id": 201,
              "comments": [
                {
                  "score": 140,
                  "content": "I think the worst attitude is 'I suffered  so you should too'\n\nI hate it. I cannot stand people who think that because they had it hard in life, everyone else should as well.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Seriously. Why would this dude want his daughter to go thru the same incredible difficult early adulthood he did? It certainly didn’t make him full of generous character, that’s for sure. The goal of parenting is to stop the cycle of generational trauma, not keep the train going.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "THIS. I agree, it baffles me every time someone uses the argument \"well I never received X benefit, so why should anyone else receive it?\"",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "It’s the transactional attitude that baffles me. Sure, instill your child with a sense of responsibility by telling them to work and contribute a reasonable, sensible amount, it builds good character and money management skills. But to make a random list of things you’re entitled from them simply because they didn’t move out the day after their 18th birthday is the attitude of an employer, not a parent. OP would be paying rent/mortgage anyway and it doesn’t cost that much more to put an extra plate on the table. Treating your child as an adult whom you support and who supports you is fine but a lot of stuff I read on here is downright cringe.",
                  "id": 205,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Yes, it’s exactly the scorekeeping aspect of it that bothers me. It’s like these parents have been compiling grievances against their own kids and act like they would be getting taken advantage of if they were to extend some grace to their children.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "We were poor, not poor poor, but no you can't get yogurt unless it's on sale.  My mom never held it over my head but I knew people who did.  I had free rent, but was also working full time and going to school full time.  50 hours a week my senior year.  My mom saw me working and didn't want me to take out a loan.\n\nMy husband went to a private college.  His dad would always say I am paying for your college, I pay taxes.  He never got it.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Some people are just shit parents.",
              "id": 208,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "It's definitely not consistent in the US. Neither me or my brother *ever* paid rent while in school full time or working. \n\n I lived with my parents until I was 27, I worked a full night shift job, with benefits.  I asked my mom if she wanted me to move out.  Her answer was 'why?  It's smarter to live here and pay off your student loans as fast as possible.  Then save for a down payment'  \n\nGranted, I also voluntarily cleaned a lot.  She joked about 'the cleaning fairy' cause she'd go to bed and wake up to a clean house.",
              "id": 209,
              "comments": [
                {
                  "score": 9,
                  "content": "That’s exactly how I approach it. I am living in a home where I can afford all of the payments and bills by myself. I can’t send my kids to college for free, but I can afford to help them save on their cost of living so they can pay off their student loans and set themselves up with a nice savings. It’s the best I can do. They don’t owe me anything. I’m always their mom and their place to land without guilt or shame or reciprocation. I grew up poor. You’d think other people who struggled would approach it the same way. Give the next generation an incremental step up instead of making them suffer too.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "I think if the kid is working a full time job, it's not unreasonable to ask for a small contribution towards household bills, especially if the household is struggling. I don't judge people for that but it's not something I would do as I would prefer them to save to be able to move on.\n\nBut if the kid is in college full time, expecting them to pay rent or contribute towards the house financially is ridiculous and there's a lot of people on this sub who shouldn't be having children.",
              "id": 211,
              "comments": [
                {
                  "score": 39,
                  "content": "The whole idea that college isn't seen as a full time job is also pretty asinine. Like, you're working 40 hours a week on it generally, if not more.",
                  "id": 212,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I double majored in college in just 4 years. My workload was insane, and there were weeks I barely got 10 hours of sleep because I was either attending class, working on projects/assignments, in necessary lab meetings, and working at my part-time job so I could buy food. My reason for this, I got a full ride that only paid for 4.5 years worth of undergraduate education and I wanted to make the most of it (housing was included in my scholarship). \n\nMy room was always a mess and I often fell asleep in the shower. I can’t imagine being expected to watch kids during this time.",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 693,
      "content": "You say occasionally but immediately follow up with the cooking and cleaning typically being done on a daily basis - so is your daughter doing all your cooking and cleaning on top of the frequent childminding, and college? Because if so you are taking advantage. A live-in nanny/chef/housekeeper would be entitled to pay on top of room and board. Good pay at that for that role. Without the stresses of college. \n\nJust because you struggled, you think it’s ok to make your daughter struggle. That makes you a bad father. A good father wants to improve their children’s lives. Wants them to succeed and have it better than they did. You don’t. You want to use your daughter, want to see her struggle, and you ignore her completely when she voices how she’s finding things difficult. It’s all about you. So yeah, YTA.",
      "id": 214,
      "comments": [
        {
          "score": 178,
          "content": "I have the same concern about the cooking and cleaning. \n\nBased on the tone in OP's post I am concerned he has parentified his daughter and is treating her more like a co-parent or housekeeper/nanny. \n\nThere is emotional and physical labor that goes into being part of a family household but it shouldn't be to the detriment of the kid. Not in a healthy home...",
          "id": 215,
          "comments": [
            {
              "score": 21,
              "content": "Yep, that is the key absolutely. It should never be to the detriment of the kid. And he’s been told clearly that it is, and doesn’t care. Horrible.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I'm hoping the daughter ran to her room packed and moved in with a friend. See were op's at then lol",
          "id": 217,
          "comments": [
            {
              "score": 11,
              "content": "Having to actually properly parent his 5 year old twin boys, and doing his own cooking and cleaning. I think she’ll have the better of that deal :)",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "OP updated the post and looks like the poor girl needs to babysit 3 times per week. Definitely TA",
          "id": 219,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 501,
      "content": "French student here. For me, YTA, but i would admit it's probably a cultural difference. It would never be acceptable for my parents to make me pay the fact that i'm staying at their house during college by doing a lot of chores and by watching my siblings. She opened herself to you, not saying that she shouldn't do any chores, but saying that watching her siblings takes time an effort, that she can't put in her studies. I think you need to more communicate with your daughter and maybe find a compromise",
      "id": 220,
      "comments": [
        {
          "score": 219,
          "content": "Sadly this is not a cultural difference nearly so much as OP lacking in empathy or even a degree of critical thinking (how much does he think a live-in cook/maid/nanny would run him??)",
          "id": 221,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 68,
          "content": "Nah, he's just a dick",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "It's a weird cultural disconnect in American generations. Because it used to be that for our parent's generation, it was cheaper to do everything- buy a house, start a family, go to college. We used to be expected to just be able to have shit together at 18 and otherwise were a burden. But nowadays it's getting harder to get a job, harder to graduate, and the housing market in  America is for shit.\n\nSo we have this disconnect where our parents think we're being lazy and not doing things how they did it, but we literally can't with how the world works today.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}