{
  "post content": "First off, I'm definitely not implying that anyone else would be the AH in this situation so it's kind of YTA vs. NAH...\n\nI (18F) recently finished my first year of University and made a new friend group with two Indian girls and an Indian guy. Both of the girls really like BTS, and one of them has a poster of them on her wall. I'm not interested in BTS for two reasons: a) I like to know all the lyrics and sing along in my head when I listen to music so I only listen to music in English (yeah I know parts of a lot of their songs have some English but I also don't really like those lyrics) and b) I'm usually not a fan of pop in general.\n\nWe were in the girl with the poster's room and talking about BTS. At one point we were talking about the poster and she asked me who I thought was the hottest. I looked at the poster for a couple seconds, and without thinking I said \"They all look the same\". Instantly regretted it. I know this is a very common stereotype for east Asian people and I really don't want to be contributing to it (I am white). I could tell by the look on their faces I'd said something lowkey offensive but as I told them, I'd never seen BTS other than this poster and I'm not that good with faces.\n\nEdit: When I say not that good with faces, I mean reallyyy bad with faces. I work in a deli and very regularly have people order sliced meat and step away, and 30 seconds later I'll forget what they looked like and who tf this meat is for. I may be digging myself into more of a hole here but honestly, most people look the same.",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "NAH.\n\nThey all kinda look the same to me, too. (I'm Southeast Asian btw).\n\n&#x200B;\n\nedited for grammar",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "S a m e.\n\nI'm SE Asian too, living in Japan. I can totally tell normal people on the street apart, people I've worked with, kids at school.\n\nBut put any Japanese or Korean idol group in front of me and I don't know who is who at all. They all look the same to me.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "YTA, but she asked so I dont blame you too much.... but yeah, crappy word choice. As a fan, I get if someone doesn't recognize the differences in the members easily, it comes with the territory. I recognize the assholes when they start defending why they said it then follow that up with 'they all look like girls too'. At least you knew it was crappy and to never say it again.",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "NAH, you did not intentionally say that to offend her. You said that because it was your honest opinion, although you shouldn’t have said it out loud.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA ( this is coming from an asian) lol when I first get into a new group. It’s hard for me to distinguishes them since they are either dress the same or have similar styles. Most of us fans girl will agree because when we first get into a bands. All of them look similar to us. Like 80% chances that happens to most of us so that’s why we take time to learn about them. It might come of sounding like you’re racist but it’s a honest mistake.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. It is proven that people from one ethnicity have problems distinguishing faces of another ethnicity.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "YTA \nwhen you say something racist, accidentally or not, apologize and move on. you know that what you said affected your friends. you saw it in their faces when you said your remark. trying to justify it in any way is self-defeating. \n\noffer your friends a brief apology. don’t make them responsible for your feelings. don’t bring it up all the time. apologize once and let it go. and be more careful about how you say things in the future. \n\nfor the future, you are allowed to like or not like something for any reason. you can say, “it’s just not for me” or “i don’t know. it just doesn’t appeal to me.” if people keep badgering you, “we’ve talked about this so many times. you know how i feel. [introduce new topic here]” or “i know how much you love [thing], but i’m not into it. can we talk about [mutual interest] now?”",
      "id": 8,
      "comments": [
        {
          "score": 3,
          "content": "> “i don’t know. it just doesn’t appeal to me.”\n\nConsidering they were asking me which one was hottest, I don't think they would be very happy with me saying I don't find any of them hot lol. I get what you mean though.\n\nIt happened a few months ago and none of us have mentioned it since... I brought it here because I still feel guilty but I don't think it would make things any better to apologize now",
          "id": 9,
          "comments": [
            {
              "score": 5,
              "content": "you can totally say they don’t appeal to you! i get it. it is a life long project to be comfortable liking what you like and not liking what you don’t and expressing those feelings without being a dick about it. it is hard sometimes! i try to live by the motto of “not yucking anyone’s yum.” you can say you’re not attracted to someone without going so far as saying they’re ugly or whatever. \n\ni agree that if they haven’t brought it up, don’t make your feelings their problem and make them help soothe your guilt. you can do the work on your own of letting those guilty feelings go while also working on doing things differently in the future. if it happens again that you step in it and say something shitty, apologize immediately and move on. in this example maybe, “whoa that was a super racist way of saying i’m not into any of these guys. i’m sorry, friends. i’ll be more careful about phrasing.”",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA you didn’t say it on purpose as a racial stereotype and you realised the second you said it that it was rude. It was a genuine mistake",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA. Anytime you say something racist you are.",
      "id": 12,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "There’s no such thing as being accidentally racist. YTA",
      "id": 13,
      "comments": [
        {
          "score": 5,
          "content": "Would I be wrong in saying there's a difference between being racist and saying something racist? Ask me who's hottest of Imagine Dragons and I'd probably say they all look the same too",
          "id": 14,
          "comments": [
            {
              "score": 0,
              "content": "Non racist people don’t say racist things. Non racist people may slip up and say something racially sensitive but when that occurs and someone tells them what they said was inventive they promise to better and more sensitive in the future instead of getting defensive. \n\nSounds like you know full well you’re an asshole so not sure why you are here and being difficult.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA - And you know it was a microagression yet here you are asking if it makes you racist. For what?",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    }
  ]
}