{
  "post content": "So I (16f) have 5 brother (21, 20, 18, 14 and 11). I’m unfortunately the only girl in the house. though I have a great relationship with my older brothers they’re the best big brother ever and I love them so much. I also have a great relationship with my younger brother(14). He’s such an angel, he has literally fallen out of heaven into our family. I love him so so much. We do everything together and we are inseparable. \nMy other younger brother(11) and the rest of my siblings don’t get along with him. I can’t say how the rest feel about him. I tend to avoid him. He’s annoying, he’s destructive, in general awful to be around. \nMy dad is the most amazing dad ever I love him so much. He’s calls me the princess of the house and we love shopping together. It kinda suck I don’t see him often because of his work.\nMy mom is great. She is really strict with everyone except younger Bro(11). \n\n\nI’m a perfume fanatic. I have like 30 perfumes, I recently received Lost cherry by Tom ford as a gift from my dad. It has become my favorite perfume. The scent is so delicious I love it.\n\nThree days ago my brothers 14, 20 and I decided to go to an arcade. My younger brother was at his soccer practice so we couldn’t ask him to go and other brothers had to do other things. We arrived home, I went upstairs to see the door of my room open. I found my favorite perfume on the ground in pieces. I asked him(11) if he did it. He didn’t want to admit it at first but after repeated questioning he ended up admitting to it. I ask him why he felt the need to destroy something I love, why he always had to ruin everything and make our daily lives so much harder. I told my older brothers(21, 20,18) and they scolded him and ask him why he can’t respect our stuff. Mom heard the commotion and immediately took his side as usual. He told my mom some non sense story about how he was just trying to spray my perfume so he could feel closer to me because he feels left out he dropped it by accident he didn’t mean to blah blah. Excuses he knows better than to touch my perfumes. I made it clear that if they ever broke one of my perfumes there would never be a peaceful day in this house ever again.\n\nWe all had to apologize to my brother and are now forced to take him to the arcade and hangout with him. My dads pissed that mom took my brothers side since the perfume he broke was $500. Everyone is having a bad time now because of him\nMom is of course angry with me the most told me it was out of line what I said. I strongly disagree with her it was bound to happen if it wasn’t me it would’ve been my older brothers. She coddles him too much that why he’s like this. My brothers agree with my dad agrees with me she’s the only one that is telling me that I’m in the wrong. Am I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 49,
      "content": "gods, to be in a household where you can gift a teenager a $500 bottle of perfume.\n\nESH but also, he's eleven and all of his siblings dont like him. cant imagine how hard it is to be so young and *none* of your siblings like you. id act out too\n\nEdit: changed my judgement to esh",
      "id": 2,
      "comments": [
        {
          "score": 20,
          "content": "I mean, I feel like this kind of makes her an AH. She sounds like she's literally never experienced being disliked. Her father calls her \"the princess of the household\" and gifts her $500 of perfume at 16 years old, and she's surrounded by brothers, older and younger, who apparently adore her and treat her like exactly that: a princess. I can't image being an awkward preteen boy in that household, making mistakes or just . . . being awkward. She sounds like she has absolutely no sympathy or empathy for error or imperfection, or for a youngest sibling who just gets things wrong. She hasn't even accused him of being malicious or nasty, just of being error- and accident-prone, it sounds like, and getting into the usual tween mishaps, and she seems unwilling to give him ANY benefit of the doubt or leeway to be imperfect, or even to include him in things except really reluctantly.\n\nI'd say the Princess of the House is a bit of an AH, considering all of that.",
          "id": 3,
          "comments": [
            {
              "score": 5,
              "content": "True. The kid prob just wants to be included and even though everyone went to the arcade they didnt take him? How is an eleven year old suppose to know the value of a *three ounce* perfume bottle that smells like candy?",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": "Three of them went to the arcade, not \"everyone\". The little bro was at soccer practice. Why are you acting like he was standing there begging to go and they laughed in his face and left him behind or something? That's not what happened. \n\nAlso he didn't break any of his big brothers' belongings, only hers.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "He even said that's what happened, he wanted a spritz because it made him feel close to OP. He didn't smash the bottle maliciously, he just wanted to do something with one of his siblings.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Idk I feel like your take is a tad hard on OP. Like I don't know where you extrapolate that she's \"never been disliked\" (and why would that make someone an AH?) You then point out that her dad calls her a princess - is that OP's fault or her dad's? (not to mention it's p common for people to refer to their daughters as princesses and once again what's so terrible about that?) You point out that her perfume is expensive. Once again, the fact that her parents choose to buy her nice things doesn't have anything to do with whether or not she's an AH, they probably buy nice things for her brothers as well.\n\nThe little bro wasn't excluded maliciously, he was at soccer practice. Is that a good reason for him to go in her room and break stuff, purposely or not? Of course not.",
              "id": 7,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "To be in a house of eight people, six children, and have the discretionary funds to buy one person a $500 bottle of perfume, that person having a big perfume collection. OP describes herself as a perfume fanatic, that can't be cheap and the way OP presents herself I doubt she goes in for the budget options or a job. In a family that size (the older ones would likely be at university), odds are there's not a lot of money going to that youngest boy.",
          "id": 8,
          "comments": [
            {
              "score": 1,
              "content": "You don't think it likely that the family is just well off and spends on all the kids? That's weird",
              "id": 9,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I love perfumes and got a bit of a collection. But only a few are really expensive and it’s usually because they are bigger bottles, probably bc it’s her favourite. They last me quite a while and I got them for special occasions when I was younger (I use the same once since I was 15). If it was an IPad or something similar a lot of people would probably react differently, even through it’s more expensive.",
          "id": 10,
          "comments": [
            {
              "score": 0,
              "content": "an ipad is a computer. also a camera. and a phone. not comparable at all to smelly water.\n\nits fine that op has a hobby she's passionate for but paying $500 for a measly three ounce bottle is *insane* for a teen to have. https://www.sephora.com/product/lost-cherry-P436489?country_switch=us&lang=en&skuId=2251148&om_mmc=ppc-GG_13747609399_122963862943_pla-418254179266_2251148_531290557634_9007654_c&gclid=EAIaIQobChMIp4i97or39wIVKdSzCh1lFQ0EEAQYCiABEgJyrfD_BwE&gclsrc=aw.ds",
              "id": 11,
              "comments": [
                {
                  "score": 4,
                  "content": "So what? I don’t have an IPad and no desire to ever use one, it’s not a necessity. But do enjoy my perfume collection that I use pretty much every day. Just because she has something she enjoys that you don’t understand doesn’t mean it changes the situation. What if it was an action figure? Pretty useless, but if it was a special gift for a birthday or Christmas, so what? Aren’t teens allowed to have something special and valuable to them and be upset when it gets destroyed? Playing mobile games on an IPad hardly qualifies as a hobby either.",
                  "id": 12,
                  "comments": [
                    {
                      "score": -1,
                      "content": "bully for you, but you missed my point. an ipad is expensive because its everything in one, whereas a bottle of perfume is... perfume. how much you like something doesnt justify its costs. and buying a fifteen year old a $500 action figure just cause they \"like it\" is stupid too. (i play mobile games on my ipad *and* do my job on it as well. perfume cant do that)\n\ni never justified the kid breaking the bottle. im pointing out that op calls herself \"princess\" and gets unbelievably expensive gifts yet calls an eleven year old spoiled is hypocritical. the kid breaking the bottle is bad. however his only sister openly hates him.\n\n*hates him* and *threatens him* with \"never a peaceful day in this house.\" maybe the kid is a little terror, but op should also step back and look at herself and take that crown off her damn head before throwing stones in glass houses",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NTA\n\n\nYour mom sucks she's literally rewarding his shitty behavior. Can you get a lock for your door?",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "ESH. From your post it's pretty clear why your brother acts out. Imagine being in a house where they only people that like you are your parents. All of his siblings don't like being around him. It makes sense that he acts out because any attention is better than being ignored. Maybe he did break your perfume on purpose because he was left out. Maybe he sprayed it because he likes the smell. The only one who knows the truth is him. Your mom probably takes his side all the time because she's trying to make up for the lack of a healthy relationship with his siblings. It's probably hard for you because he gets away with things that you never would or did. At the end of the day he shouldn't have broken your perfume. You shouldn't have said those hurtful things. Your mom should have listened to both sides and given him a punishment for breaking the perfume and you a punishment for saying cruel things. You and your siblings need to make more of an effort to bond and include him in activities.",
      "id": 15,
      "comments": [
        {
          "score": 11,
          "content": "Agreed. Quote from post: \n\n>why he always had to ruin everything and make our daily lives so much harder\n\nOP's words are incredibly harsh to say to an 11 year old, and I get the feeling this isn't the first time he's heard them. Of course his mom is defending him. It's still wrong to break other people's stuff, but this is definitely a symptom of a larger problem.",
          "id": 16,
          "comments": [
            {
              "score": 3,
              "content": "I wonder how much of the other incidents were him genuinely wanting to be part of the camaraderie his siblings have but he got clumsy. OP is already predisposed to not liking his general presence when ironically he is trying to give her attention (which her princess persona would enjoy).",
              "id": 17,
              "comments": [
                {
                  "score": 1,
                  "content": "We don’t leave him out of things at all. \nHe could’ve asked for attention in a different way.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don’t even think both parents like him. Sounds like his mom is the only one that genuinely loves him",
          "id": 19,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA.  He ruined an expensive bottle of perfume, and I can only imagine whatever else.  Your mother has a rude awakening coming when she gets that phone call that her \"sweet little boy\" has stolen something or even worse.  And of course, she'll make excuses for him and soon he'll be leeching off her and your dad, assuming he doesn't file for divorce.",
      "id": 20,
      "comments": [
        {
          "score": 2,
          "content": "he's 11.",
          "id": 21,
          "comments": [
            {
              "score": 10,
              "content": "So what? Does an 11 suddenly not understand not to touch things? This is really weird.",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Exactly.  He's testing the waters out on his parents to see who will let him get away with what.  And Mommie Dearest lets him get away with everything without consequences.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "Thank you finally someone that understands our situation.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "He's an eleven year old his siblings give the cold shoulder to, and he just wants to do stuff with them. That's why he had the perfume, to connect with OP. I wouldn't be surprised if the arcade trip was planned to coincide with his soccer practice so that was the excuse for not inviting him. Being the youngest of six, one of whom is spoiled (any 16 year old with at least 30 bottles of perfume is definitely spoiled) and frozen out by everyone except his mother, it can't be easy.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "Yta- did you really have the audacity to say ‘he’s coddled too much’ when you’re being gifted perfumes that cost $500? And not only that but you have ‘like 30’? He obviously feels left out and considering he’s the youngest you should be more inclusive and try to set a better example",
      "id": 26,
      "comments": [
        {
          "score": 21,
          "content": "Ah, so it’s ok to destroy stuff if it’s deemed too expensive for the person who owns it?",
          "id": 27,
          "comments": [
            {
              "score": 1,
              "content": "I never said that. It’s not okay but he’s only 11 and it was an accident. It’s not op’s responsibility to try to dish out a punishment and be verbally abusive",
              "id": 28,
              "comments": [
                {
                  "score": 15,
                  "content": "It’s not the kids job to go into rooms he’s clearly not welcome in and destroy shit",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Bullshit\n\n1) What 11 year old boy is spraying his sister's perfume?\n\n2) If it was an accident why would he deny it and not immediately apologise? \n\n3) he is old enough to know boundaries and shouldn't be going into his sister's bedroom",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": ">you should be more inclusive\n\nHe wasn't left behind maliciously. He was at soccer practice. It's there in the post.",
          "id": 31,
          "comments": [
            {
              "score": 0,
              "content": "‘We are now forced to take him to the arcade’ and ‘he’s awful to be around’ and then Princess says ‘I made it clear if they ever broke one of my perfumes there wouldn’t be a peaceful day in this house ever again.’ She’s really something. So yeah I was saying that they should try to befriend him. It’s really obvious when ppl don’t like you. To me it seems like they are all ganging up on him. And as the older sister she should try to be more gentle and accepting",
              "id": 32,
              "comments": [
                {
                  "score": 0,
                  "content": "Do me a favor and stop by the perfume section of Sephora and look at the thickness of the glass of the bottles and tell me if you think one would break if it was **just** dropped.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 0,
                      "content": "16 yo trying to school me on what a bottle of Tom Ford perfume looks like. Yeah it could easily break if it were dropped. Also I would never invest in something that smells so terribly and is also toxic. https://alitura.com/blogs/skinsupport/the-top-10-toxic-chemicals-in-perfumes-and-cologne",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -2,
          "content": "She says she's a perfume fanatic very matter of fact. In two years when she leaves home and goes to university she's in for a very rude awakening.",
          "id": 35,
          "comments": [
            {
              "score": 1,
              "content": "What's that have to do with the topic at hand",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "[deleted]",
              "id": 37,
              "comments": [
                {
                  "score": 1,
                  "content": "I doubt she personally paid for them as well. Cosmetics can be an expensive thing to collect, and I'm not expert but a teenager with that much perfume sounds highly unusual.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "No judgment given.\n\nI had a younger brother that was many years younger than me. He use to get me in a lot of trouble because he would get into my stuff. He died almost 10 years ago and I miss him every day.\nForgive your brother.",
      "id": 39,
      "comments": [
        {
          "score": 0,
          "content": ":(((",
          "id": 40,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA. none of the kids really have a big age gap so age definitely isn’t the issue in this. in fact, most of the time the 14m and 11m would be the closest cause they’re the youngest and we’re raised more together. of course the sister is included cause she’s only 16 but she’s going to be treated slightly different since she is female so the next closest to them is 18 but an 18 yo isn’t really going to want to hangout with a 14 and 11yo. however all the siblings seem close EXCEPT for the 11yo. there has to be a reason and OP states that the 11yo is spoiled/coddled by mom. OP has a hobby which is collecting perfumes. it’s what she likes and what she does. it’s not stated that ALL her perfumes cost $500 just one does. you can get cheap perfumes that still smell really good. they didn’t go to an arcade without the 11yo maliciously. they were probably bored being home alone without mom or dad and wanting to get out of the house and do something fun. it’s not their fault they were bored and didn’t want to wait around for baby bro to be done with soccer practice so all of them could go to the arcade. the family seems pretty well off so i’m definitely not going to assume that OP is coddled by dad cause she has a $500 perfume. if all of your siblings dislike you there is an issue with you and not them. just cause he’s the baby doesn’t mean he gets a get out of jail free card to being an AH. the BS of “i just wanted to be closer to my sister” is just that BS. I understand feeling ostracized but he’s 11 and knows how valuable her perfume collection is to her especially that one bottle so why touch it?? he could’ve just sat in her room or something. he never mentioned wanting to “be closer” to her until mom came on the scene. i’ve had my fair share of entitled/spoiled cousins. i’ve seen the whole “i’m mommies favorite so imma play into it and be cute and sad” it’s annoying. that’s exactly what he did/is doing. everyone else sees through it except for mom. that also tells you she’s blinded by him cause he’s her baby boy. OP is not TA. he’s old enough to know right from wrong stop acting like an 11yo is a toddler that knows nothing",
      "id": 41,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "I actually feel sorry for your little brother.  As the youngest your mum spoiled him to the point where he has become such a brat that his older siblings ostracise him.  He senses this estrangement and subconsciously is desperate to be included and loved by them, but being only eleven has no idea how to bridge the gulf between him and his siblings.  Instead he acts out to get attention and communicates the only way he knows how and this toxic behaviour is enabled by his mum.  Ironically, this worsens the relationship with his siblings, it’s a vicious cycle and he’s too young to break out of it.\n\nESH.  Mainly your mum for spoiling your brother and your dad because it takes two to parent.  It's wonderful that your dad treasures you, but does he have an equally good relationship with your little bro?   Yes, you’re an asshole for what you said, but deep down your little brother knows his siblings feel that way about him.  He uses negative emotions to express his feelings and get your attention.  Your negative attention is better than no attention.\n\nWhen I was 15 I was acquainted with a little 9 year old boy who I disliked and the feeling was mutual.  He was a little bit of a brat, but one day I realised that he was just a kid and didn’t have the power to change our relationship dynamic, but being 15 I did.  I used positive reinforcement, hung out with him when he visited, joked around and talked about things he liked.  We turned that relationship around.  It’s not your responsibility, but if you want to change your relationship with your little bro give him some positive attention and praise him when he does well.  It will work if your mum doesn’t undermine your efforts by spoiling your brother.\n\nEdit:  $500 dollar perfumes, your dad calls you his princess and you haven’t made any replies.  I just got trolled hard.",
      "id": 42,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "I'm really puzzled as to why so many people are feeling sorry for the little brother bc nobody likes him. *There's a reason nobody likes him, folks*. Sure, it's possible his siblings are scapegoating him. But it's unlikely; sibling dynamics don't usually work that way unless parents are encouraging it. What's far more likely is that he's his mother's golden child and she spoils him and he acts out. So the siblings dislike him and he acts out more and it becomes a vicious circle.\n\nI don't think OP is TA, I think the parents are.",
      "id": 43,
      "comments": [
        {
          "score": 2,
          "content": "I agree and I think it's weird how many people are faulting kids for the actions and choices of their parents",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA. He's eleven and the majority of the people in the house, those who are closest to him in age, don't like him. Also, you have a perfume collection that's at least 30 bottles and the latest cost $500, your father treating you like the golden child. You calling your youngest brother coddled is you throwing stones in your glasshouse. Your mother is the only one seeing what's really happening, your youngest brother trying to fit in with the rest of you and getting grief for it.",
      "id": 45,
      "comments": [
        {
          "score": 1,
          "content": "We all get treated equally by dad. My mom is the one treating my brother like he’s the most special child in the world. My dad is the reasonable one here",
          "id": 46,
          "comments": [
            {
              "score": 1,
              "content": "How is your brother treated like the ‘special one’?",
              "id": 47,
              "comments": [
                {
                  "score": 0,
                  "content": "Well he went in his sister's room and broke something and ended up having all his siblings apologize **to him** and then take him to the arcade, what do you think?",
                  "id": 48,
                  "comments": [
                    {
                      "score": 0,
                      "content": "After they all (21, 20, 18 &16 yo) were chastising him, an 11yo. So yeah someone needs to take his side bc that’s messed up. Ppl make mistakes and it didn’t seem like he did it intentionally",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "[deleted]",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}