{
  "post content": "So, first things first, I (F17) do *not* know how to play the piano. Never took a lesson in my life. My father was a musician, so I have plenty of musical instruments in my house. They were mostly taking dust after he died ten years ago, so I started playing them. I have a good ear and I'm a quick learner, but I mostly focused myself on the clarinet and the guitar. I did learn to play a few songs on the piano, though. Not very complicated ones, but they are nice to hear and I'm quite good playing them. But I learned through piano tutorials, I have no technique, I just learned what keys I had to press and tried to do it over and over again until I could. I guess, though, if you happen to enter my house while I'm in the piano room playing, I can pass momentarily for someone who knows how to play the piano, and that's what happened to my aunt and uncle.\n\nThey have 2 children and a buttload of money, they make three times what my family made when I was growing up. My cousin (F9) wants to learn how to play the piano, and has been asking multiple times for lessons. But my lovely aunt and uncle, who own a last-generation gaming system, every possible gaming console the kids are not even allowed to play with, a two-storey villa, a house on the sea, apparently don't have the money to pay for her expensive lessons.\n\nHowever, yesterday they came to visit and I was playing the piano when they arrived so I didn't hear them. The barged in the piano room and started saying that they didn't know I could play the piano and that I was extremely selfish for not offering to teach my cousin since I knew how much she wanted to learn and that they don't have the means to afford lessons. I politely explained that I do not, in fact, know how to play the piano. They called me a liar. I calmly explained that I am in no way qualified to give lessons since I'd need lessons myself. They attacked me, saying that I had obviously already taken lessons and I was refusing only because they couldn't pay me. I explained how it is I can play some songs on the piano, and assured them that if I knew how to play it I'd gladly teach my cousin for free. They insisted I should at least teach her the few songs I know how to play so that she could see if she still liked it and at this point I had enough and here's where I might be TA, I told them I didn't know how to play the piano but if she wanted to learn that much they could stop be some cheap a\\*\\*holes and pretending they don't have the money when they spend thousands on things they enjoy and never a cent for their children. They left and aren't talking to my whole family until I apologize and my family says I have to but I don't want to. AITA?\n\nEDIT: Thank you so much for all the answers and awards! I'm reading everything! ",
  "id": 1,
  "comments": [
    {
      "score": 23789,
      "content": "I can play \"Hot cross buns\" on a lot of instruments. According to your Aunt and Uncle, I play a ton of instruments and should be teaching. \n\nGoing to teach like this....\nPick 3 notes. 3 represents the highest, 1 the lowest.\n\nPlay this: 3,2,1,3,2,1,1,1,1,1,2,2,2,2,3,2,1. Poof. Now you can play.\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 8219,
          "content": "I wish I had an award to give you",
          "id": 3,
          "comments": [
            {
              "score": 3498,
              "content": "Let me give him a free Award",
              "id": 4,
              "comments": [
                {
                  "score": 2285,
                  "content": "Your aunt's here, OP.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 370,
                      "content": "This is underrated xD",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 155,
                      "content": "Loved this",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 423,
                  "content": "Only award I can afford.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 243,
                      "content": "I can afford this emoji ⭐, but not the premium one 🌟.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 332,
              "content": "I had one and gave you it by accident! I'll give them one too and we'll put this down to you having a stellar idea that people needed to see!",
              "id": 10,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Watch for me on one of the talent shows. I'm going to show the world I can play beer bottles too.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "I gotchu. FREEEEE SILVER AWARD CARD ACTIVATE.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Ghetto Gold works wonders 😂\n\n🏅<---",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I gave them my free one",
              "id": 14,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I will give him a free award representing you",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’ll give them an award for you. But it’s free.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1307,
          "content": "Well, OP said they knew a *few* songs. Here's Mary Had A Little Lamb for all the aspiring all-media musicians out there:\n\n32123332223333212333322321\n\n*Now* you all are experts!!",
          "id": 17,
          "comments": [
            {
              "score": 837,
              "content": "I would throw out Twinkle Twinkle little star, but I need to save it for my paying expert class.",
              "id": 18,
              "comments": [
                {
                  "score": 1509,
                  "content": "I took up cello as an adult beginner... and let me tell you, some of the twinkle twinkle variations are really hard.\n\nAnd nothing quite beats the experience of showing up to a recital as a grown up with a real nice cello surrounded by 8 year olds. All the adults sit up straight when you take the stage and prepare for something good...\n\nAnd then you play twinkle twinkle little star in the first three variations with your heart pounding the whole time and a baby tells you you did a very good job and almost no one heard all those flats\n\nEdit 0: You guys are just making my whole month with these awards, thank you so much!\n\nEdit 1: Thank you [/u/GreenEyesBlackHeart](https://www.reddit.com/u/GreenEyesBlackHeart) for the Wholesome award! As tax, please accept this picture of my cats making it V E R Y hard for me to practice: [https://imgur.com/a/DeNYLVs](https://imgur.com/a/DeNYLVs)\n\nEdit 2: Thank you [/u/MomofanAvenger](https://www.reddit.com/u/MomofanAvenger)  for the Wholesome award! As tax, please accept this picture of Theo being very supportive of my latest challenge: [https://imgur.com/a/KxKPFz8](https://imgur.com/a/KxKPFz8)\n\nEdit 3: Thank you [/u/CharmingParamecium](https://www.reddit.com/u/CharmingParamecium) for the Wholesome award! As tax, please accept this picture of my little cat being very firm about practice: [https://imgur.com/SPPUWpT](https://imgur.com/SPPUWpT)\n\nEdit 4: Thank you Anonymous Redditor for the Gold! :o As tax, please accept this series of pictures, showing the work my uncle put into fixing up Misha, my cello: [https://imgur.com/a/kR3dV](https://imgur.com/a/kR3dV)\n\nEdit 5: Thank you [/u/ApprehensiveHalf8613](https://www.reddit.com/u/ApprehensiveHalf8613) for the Helpful award! As tax, please accept this picture of Theo being a very attentive audience while I practice this semester's pieces: [https://imgur.com/a/oYI2IzE](https://imgur.com/a/oYI2IzE)\n\nEdit 6: Thank you  [/u/smileymelodee](https://www.reddit.com/u/smileymelodee) for the Hugz award! As tax, please accept this picture of the time I went to the park with my cello to work on my stage fright but chickened out and hid around the corner where no one could see me: [https://imgur.com/a/npqksqq](https://imgur.com/a/npqksqq)\n\nEdit 7: Thank you  [/u/alarxez\\_12898](https://www.reddit.com/u/alarxez_12898) for the Hugz award! As tax, please accept this picture of the time I took my cello out for a romantic dinner to celebrate our first anniversary:  [https://imgur.com/X5Ws8fW](https://imgur.com/X5Ws8fW)\n\nEdit 8: Thank you  [/u/1503chelsea](https://www.reddit.com/u/1503chelsea) for the Helpful award! As tax, please accept this picture of Theo, making sure none of my music is hiding under the rug: [https://imgur.com/a/O3NfqS1](https://imgur.com/a/O3NfqS1)\n\nEdit 9: Thank you  [/u/Marshmello03](https://www.reddit.com/u/Marshmello03) for the Silver award! As tax, please accept this picture of Theo making sure I take breaks from practicing by taking me for a walk: [https://imgur.com/a/Pq26Art](https://imgur.com/a/Pq26Art)\n\nEdit 10: Thank you [/u/tacosalpastorplease](https://www.reddit.com/u/tacosalpastorplease) for the Stay Calm award! As tax, please accept this picture of Noel being very calm and relaxed: [https://imgur.com/a/Mv9vR6v](https://imgur.com/a/Mv9vR6v)\n\nEdit 11: Thank you [/u/alotofcolors](https://www.reddit.com/u/alotofcolors) for the Helpful award! As tax, please accept this picture of Theo reminding me to stop goofing around on the internet and get to work: [https://imgur.com/a/NQZNOzo](https://imgur.com/a/NQZNOzo)\n\nEdit 12: Thank you /u/Venusflye for the Wholesome award! As tax, please accept this picture of my full size cello next to my favourite duetist's 3/4 size cello. You can tell it's mine because there are little pieces of tape to help me remember where the notes are and his has none. [https://imgur.com/a/eauwWEu](https://imgur.com/a/eauwWEu)\n\nEdit 13: Thank you  [/u/johjo\\_has\\_opinions](https://www.reddit.com/u/johjo_has_opinions)  for the Wholesome award! As tax, please accept this picture of the pretty blue hand warmers my other cello teacher knit to keep my fingers warm during winter lessons: [https://imgur.com/tEa3gxz](https://imgur.com/tEa3gxz)\n\nEdit 14: Thank you  [/u/CBots](https://www.reddit.com/u/CBots) for the Silver award! As tax, please accept this picture of the time my cello teacher, during a skype lesson, asked me to remove the cat from the room and not only did Theo refuse to go but he stared into the camera with this Q U I T E  O F F E N D E D look the whoooole time: [https://imgur.com/a/IpZTguu](https://imgur.com/a/IpZTguu)\n\nEdit 15: Thank you  [/u/CrinosQuokka](https://www.reddit.com/u/CrinosQuokka)  for the Silver award! As tax, please accept this picture of Theo sorting through my cello music: [https://imgur.com/a/EUohaLe](https://imgur.com/a/EUohaLe)\n\nEdit 16: Thank you  [/u/ShineCareful](https://www.reddit.com/u/ShineCareful) for the Wholesome award! As tax, as requested, please accept this picture of my boyfriend's cat, Nelly, who isn't sure if she approves of this whole cello thing at all: [https://imgur.com/a/YFUlqwP](https://imgur.com/a/YFUlqwP)\n\nEdit 17: Thank you  [/u/DearYJ](https://www.reddit.com/u/DearYJ)  for the Take My Energy award! As tax, please accept this picture of Noel who really, really needed that energy today: [https://imgur.com/a/5dykCLX](https://imgur.com/a/5dykCLX)",
                  "id": 19,
                  "comments": [
                    {
                      "score": 489,
                      "content": "Oh lord this was an adorable read. Also that last part with the little one telling you that you did a good job. Kids can be so encouraging even if they unintentionally point out the issues at the same time.\n\nQuick edit meant to write adorable not amazing.\n\nEdit: thank you kind stranger for the award I feel so honored!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 127,
                      "content": "Heck, Mozart wrote a set of variations on the theme \"Ah, je dirais-vous, Maman\" - which is the same tune as twinkle twinkle.\n\nCheck them out!\nhttps://youtu.be/G0mnPCi5lS8\n\nThis is to say, Arienna, that you are awesome for taking up the cello as an adult, and that Mozart himself did not shy away from Hot Cross Buns! (... Or from many buns, for that matter...)",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "I'm also a cellist (14 years or so playing) but I had started on piano when I was 5. I remember having the exact opposite experience at a recital in elementary school.\n\nI did 4th and 5th grade at a music magnet elementary school after my other school closed. The school offered piano lessons to students where you could leave during class to go to them. They were group lessons and I had already been playing several years and taking private lessons so I basically just practiced my lessons material while the teacher taught the other students hot cross buns and other basic pieces. \n\nNear Christmas we had a recital. I think there were 15 of us in that piano class and about 11 of them played Jolly Old Saint Nicholas for their piece. You could see all the parents falling asleep after the 5th or so rendition. Well I got up there and introduced myself and told the audience I'd be playing \"Prelude in the romantic style\". Parents still basically being asleep did not stir. Well I sat down and hit these these huge chords and just took off with this really showy sounding piece. My mom still laughs that she saw a bunch of people around her jump awake.  \n\nHow long have you been playing cello now? I think it took me about 4 or so years before I thought I started sounding remotely good. It's a hard instrument to start but so beautiful and rewarding when you get into the really fun pieces :)",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I took up painting as an adult beginner, and my kids are so ceaselessly impressed that Mom is really bad at something, but goes to classes every week (online right now obviously) and keeps practicing, and is actually improving with time. It's certainly given me more credibility when I tell them they just need to practice a particular skill for school or sports. And, weirdly, they brag about it to their friends all the time, that I'm a mom and just started and I'm taking lessons, they think that's so crazy.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I played the violin from 3rd grade up until 10th grade when I switched to saxophone because my high school didn’t have orchestra. I’ve always wanted to play the cello! Do you love it? Or do you wish you picked something else? Would it be cheaper to rent one or to just buy one outright?",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I am in love with your edits and your pet tax!!!!!! So wholesome",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Someone told my parents that making your kids learn how to play the violin at a really young age made them like super smart (or something like that). Twinkle Twinkle Little Star was the first song we learned how to play. How young was I, you ask? I was fucking 3 years old. Try giving a bunch of 3 year olds tiny violins and make them play a song and it not sounding like the worst thing that's ever happened.   \nTL;DR- it's all Suzuki's fault.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I love your cats!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I'm laughing so hard, thank you, here's my poor people award 🌟",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I wish I had an award to give you. I just gave my last one before I saw your post. But here are some awards for your little helpers for being so good. 🏅🏅🏅🧶🧀",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 314,
                  "content": "Don't forget, Twinkle twinkle, ABC's & baa baa black sheep all have the same melody, charge triple for that one!\n\nEdit: Thanks for the award!",
                  "id": 30,
                  "comments": [
                    {
                      "score": 45,
                      "content": "How I am today years old and just now know those have the same melody I do not know. Mind blown.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "You beat me to saying the same thing! Hahaha",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Coming soon to Patreon? Learn How to Play Piano the Reddit way!",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "You’d have to reach all the way to 6 to play Twinkle Twinkle Little Star, so that would be an “advanced” piece!\n1155665 4433221 5544332 5544332 1155665 4433221",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "I used to play this pressing the numbers on my landline phone. Experimental music ahead of its time. All hail the pre-internet era, where you were bored af and had to find ways to entertain yourself!",
              "id": 35,
              "comments": [
                {
                  "score": 75,
                  "content": "When touch-tone phones first came out the phone company made songbooks that people could use to play music.  Though it turns out that certain combinations of tones could effect the phone system, so they stopped doing that.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I remember having a book of 'polyphonic and monophonic ringtones' that you could input on the old Nokias, way back when. It was essentially morse code with the available keys to hit different notes and make a song. It was really cool when it came together!",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "That's really interesting, thanks for sharing!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "The woman I accidentally called when playing 321-2333 was extremely upset with me. It also turned out to be a local toll number so my parents were also very upset with me about 3 weeks later when the bill arrived.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 65,
                      "content": "I was too young to remember, but my mom says I long-distance called some random person in New York dialing like that. The thing is, the phone bill showed that the call was something like 15 minutes long by the time she caught me and hung up...the guy had stayed on and chatted with toddler-me!\n\nBetter that than my littlest brother, though - he liked to dial 911. Did you know they're required to send someone to the home every single time, even after the dispatchers all recognize your address and the kid's voice? =/",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I see that you, too, were a fan of \"Mary Had A Little Lamb\".",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "That was so fun omg. We didn't have any instruments until I was 10 or 11 but I was always very musically inclined, so I used to compose some epic songs on the landline or with water glasses filled to different heights. Good times.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "We would push buttons and the person on the other line would try to guess the number.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Ha. I did this too! Good times.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "OP can charge extra for Frere Jacques, since it uses 5 notes\n\n12311231345345",
              "id": 45,
              "comments": [
                {
                  "score": 17,
                  "content": "Woah, nothing too crazy now. This is a beginner pianist we're talking about.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "The next part is 565431, 565431, 151, 151 (second two 5s are lower)",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "123212323693699#96319#9631171171\n\nThere's the expert phone musician notes for here comes thumbkin.  It's a polished work of art.",
              "id": 48,
              "comments": [
                {
                  "score": 2,
                  "content": "Ok wait I am actually in awe.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 6,
                      "content": "1199##96633221996633299663321199##96633221\n\nTwinkle twinkle little star",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Genuinely impressed. I recommend this person for your Aunt and Uncle. Just played the goodness out of my phone.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "How sad is it that i just sang that while 'reading' it.",
              "id": 52,
              "comments": [
                {
                  "score": 2,
                  "content": "No it's a good thing haha, your brain is musically inclined or something",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I thought I was the only one who memorized songs like this. My music teacher was a prodigy and I’m sure it would have killed her to realize this was the only way I could sneak by and squeak out a song.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "Loool! I think I only know the bday song and one song from when I tried to learn.\n\n>They left and aren't talking to my whole family until I apologize and my family says I have to but I don't want to.\n\nSo, they leave you alone until you do something you don't have to do? The trash did, indeed, take itself out :D!\n\nNTA.",
          "id": 55,
          "comments": [
            {
              "score": 2,
              "content": "Exactly! They did the hard part for her. They are entitled assholes and there’s no reason at all to cater to their tantrums. NTA.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 139,
          "content": "As a musician, I love this, and I'm just going to point out that depending on which notes you pick (ie which combination of whole steps and half steps), you could have some extremely interesting-sounding Hot Cross Buns!\n\nFor nice predictable Buns, pick notes that are all a whole step apart. ! If you play this with D-C-B on the piano, for example, you will instead obtain Locrian Mode Buns. (This is because C to B is a half step, even though they are both diatonic keys on the keyboard.)\n\nYou could also have Dominant Phrygian Mode Buns, but that would require a chromatic key.\n\nYay, new and interesting Buns!",
          "id": 57,
          "comments": [
            {
              "score": 28,
              "content": "I was gonna say that this could easily go wrong lol you could just pick three half steps on guitar or piano",
              "id": 58,
              "comments": [
                {
                  "score": 31,
                  "content": "Right?! But you could have Mournful/Minor/Aeolian Mode Buns (say, C-B-A), also, which would at least sound tuneful. Fully Chromatic Buns would sound like Stravinsky got into it or something.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Phrygian buns, G F E is my preference",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Music jokes!  OMG!  Loving this 😂 As an adult, hearing local kids practice playing their wee Recorders with varying degrees of success, I have a new level of respect for the Music teachers. I wonder how many of these \"delightful\" youngsters will attempt to audition for one of those \"talent\" shows.... 😬",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "What if I just want Warm Non-Denominational Rolls?",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "and if you're in E, it's \"Mexican Hat Dance\" cross buns.\n\n(old Music Theory joke. After 95% of our class described E phrygian as \"the Mexican hat dance mode\" on an International Baccalaureate Music Theory exam we were collectively proud to own the examiner's exasperated note to instructors to avoid 'cutesy' nicknames during teaching.)",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I was thinking if it's any three notes they don't even have to be \\*next\\* to each other (technically nowhere did it specify consecutive notes) and was trying to pick the most interesting chords to pick, like a semitone and then a seventh or something weird like that.  Spaced out buns.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "Maybe OP should do this, I bet aunt and uncle would beg for their child to learn something else from a qualified teacher once they've heard Hot Cross Buns for the 10 millionth time in a row.",
          "id": 65,
          "comments": [
            {
              "score": 95,
              "content": "No they can't afford a piano, OP will obviously ~~babysit for free~~ let her access her piano to practice.",
              "id": 66,
              "comments": [
                {
                  "score": 49,
                  "content": "Gift cousin with a recorder to practice at home. I bet your could figure out a way to justify it, training your ear or something.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 18,
                      "content": "One of the worst things about distance learning has got to be all the virtual music classes. \n\nI can't help but laugh and cringe at the thought of all these kids blasting on their recorder while their parents are trying to have very serious work meetings on zoom. 😂",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "How dare you? This is truly evil. XD",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "This one also sounds amazing\n\n12345\n54321\n15 45 35 25 15 45 321\n15 45 35 25 15 45 678\n\nLevel: Expert",
          "id": 70,
          "comments": [
            {
              "score": 43,
              "content": "Did I assume key of C, 4/4 time, and tap that out on my desk while silently singing it to myself? Yes, yes I did.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My choir teacher in middle school/high school used that as a warm-up every day--we even sung the numbers! Keep moving up a half-step until no one can hit \"8\" anymore.",
              "id": 72,
              "comments": [
                {
                  "score": 2,
                  "content": "I sang it out as I typed it lol",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "omg i forgot this warmup existed wow!",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I can play the chorus for Smoke on the Water, but that doesn't make me Eric Clapton",
          "id": 75,
          "comments": [
            {
              "score": 58,
              "content": "Nor does it make you Ritchie Blackmore, lead guitarist for Deep Purple.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Especially because Eric clapton wasn't in the group Deep Purple",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I can too! On the radio, that is...\n\n\nETA: forgot an o.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Oh come on, banging out the riff to Enter Sandman means you’re a real Eddie Van Halen!",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I taught myself how to play tennis in college watching youtube videos and can play at intermediate level, never had a single in-person lesson. so wouldn't know the best way to teach someone else especially a preschooler. \n\nYet my co-workers wanted me to travel 2hrs each way to their town and teach their kid instead of his regular tennis lessons. I just laughed it of saying I'm not good enough to teach. They brought it up a few times before finally dropping the topic.",
          "id": 80,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "Wow, you just saved me THOUSANDS of dollars that I was saving up to go to learn-20-instruments-a-semester school. Thanks!",
          "id": 81,
          "comments": [
            {
              "score": 9,
              "content": "Happy Cake Day!",
              "id": 82,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Now I, too, can play \"Hot Cross Buns\"",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4548,
      "content": "Although I think its a little harsh to call them cheap assholes... I'm going with NTA. They sound like assholes.",
      "id": 84,
      "comments": [
        {
          "score": 2380,
          "content": "Call a spade a spade. They brought the aggression first and way harder.",
          "id": 85,
          "comments": [
            {
              "score": 391,
              "content": "The mods on this sub are petulant children.",
              "id": 86,
              "comments": [
                {
                  "score": 238,
                  "content": "You don't like gardening??",
                  "id": 87,
                  "comments": [
                    {
                      "score": 106,
                      "content": "Was mostly making a Plutarch joke but I uh, guess AITA doesn't like that kind of comment. See you in a few hundred more downvotes lmao",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 183,
                  "content": "While I applaud your decision to avoid terms loaded with racist connotations, the phrase \"call a spade a spade\" actually predates the use of the word as a slur against people of African descent. \n\nAs [This piece, by NPR's *Code Switch*](https://www.npr.org/sections/codeswitch/2013/09/19/224183763/is-it-racist-to-call-a-spade-a-spade) explains, the term made its way into English in 1542 and refers to the gardening tool known in North America more commonly as a shovel. The use of the term \"spade\" to refer to African Americans was first recorded in 1928. \n\nDoes that mean that we should ignore the racist and derogatory meaning that the word has taken on and unthinkingly use it? No, I don't think so; language changes and evolves over time and the sullying or reclaiming of words is a real thing of which we should be aware. \n\nBut to falsely state that the origins of a phrase are racist unnecessarily burdens it without context. When Oscar Wilde or Charles Dickins used it, they were doing so in an entirely different context than we experience it today.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I feel like you could have saved a good amount of effort by refreshing the page or just the chain with my comment first, but the effort is appreciated!",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I think it's funny that the article basically concludes the phrase is not racist but we still shouldn't use it just to be safe.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As a non-American and a non-native English speaker I have never heard \"spade\" being a racist term and only know it as a tool. How is it supposed to be a slur?",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "lol, fair, but Erasmus is cool, so I think the fact he changed the phrasing makes it fine. Fuck Plutarch and his fig and trough metaphors.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 23,
                      "content": "+1 for Erasmus :D",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "In a technicality, the origins are in Ancient Greece \"call a trough a trough\", and when translated became \"call a spade a spade\", as in the gardening tool. \n\nThat being said, because spade became a racial slur in the US, the term can be viewed as racist. But the actual origins were not racial.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Fuckin’ racists gotta ruin everything.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Literally everything is racist.",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "So the true origins of that phrase actually have nothing to do with race, and only in the last century has it even been tangentially linked. I don’t think anyone who says that is being racist",
                  "id": 98,
                  "comments": [
                    {
                      "score": -1,
                      "content": "One might say that \"only in the last century\" is still going to encompass the majority of people saying it. There is likely not ill intent behind using the phrase, but it's such an easy one to avoid.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "What's the origin?",
                  "id": 100,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Did a quick check on Wikipedia. Looks like the word “spade” is an ethnic slur in some areas. Wiki said the phrase predates the slur, and I’ve never heard the word used as a slur in my area, so YMMV",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "I looked it up out of curiosity and it seems there's nothing wrong with the origins but the implication of the word \"spade\" [recently evolved](https://www.npr.org/sections/codeswitch/2013/09/19/224183763/is-it-racist-to-call-a-spade-a-spade).",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "But shouldn't you like the origin then because it's a story about shitting on Plutarch?",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "What are the origins of this saying?",
                  "id": 104,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Its from Greek antiquity and when translated, the word spade literally meant the gardening tool. BUT spade also became a racial slur in the US in the 1920s so it can be considered racist but the origins were literally referring to the gardening tool",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "What's it from originally?",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I am super unfamiliar with individual philosophers. So now I want to know what makes Plutarch TA (to use relevant abbreviations lol)",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "Totally don’t disagree re: them being the aggressor, but I feel like it’s fair to point out that some people can fall on hard times without the ability to easily liquidate assets. To borrow the old cliche, “appearances can be deceiving.”\n\nE.g. my aunt and then-uncle owned two houses, generally pretended to have money (which, they had a good amount, but not really considering their spending habits), but when the housing market crashed fifteen years ago, a lot of things changed.\n\nSuddenly their vacation home’s mortgage was underwater by six figures, their house underwater by five figures. And then one of them lost their job, like many did. As I mentioned, they had some extravagant spending habits, and that’s usually a nice way to say “not insignificant amount of debt.”\n\nNow they faced a predicament: they need money/to reduce costs, but if they sold the vacation home they’d still be paying a mortgage for a house that they no longer owned.\n\nAnd, let me just stick this in right here: my aunt and her ex-husband fucked themselves, hard. This was entirely a problem of their own creation, and I’m *far* from defending them. The desire to live up to a higher standard of living was a significant (and, in most/all of the family’s opinion, extraordinarily stupid) decision. It’s not that they didn’t have savings, but they planned their savings on X years of reasonable living expenses, *not* what their *actual* baseline expenses were – meaning they didn’t include debt. Their (again, stupid) logic was that they put enough down on the second house that they could short-sell it at a loss and still pay off the mortgage with cash leftover – a reasonable conclusion, if you didn’t think it possible for the house’s value to drop 200k+ practically overnight.\n\nAnyways, back to the topic at hand – you can *appear* rich, and still struggle financially. It’s nice to think you can just “reduce costs”, but often the largest costs are not reducible, or at least not *easily* reducible. Property isn’t exactly liquid, and selling a house isn’t free, either – you often still need to pay for a listing agent (if you want to eke out as much money as you can), inspections, etc.\n\nMind, none of this says OP’s TA or her aunt and uncle aren’t – just saying that because someone *appears* to have money doesn’t mean they *actually* have money. They may not be “cheap”, they may just not be able to realistically afford it.\n\nOf course, they may well not have the money for it *after* paying for all the shit *they want for themselves*, and that’s not really “cheap”, that’s a whole other level of narcissistic, egocentric bullshit.",
              "id": 108,
              "comments": [
                {
                  "score": 29,
                  "content": "Yeah, I totally get what you mean about this! But yeah, the issue is their behavior. Lots of People struggle to tread water and don’t make demands like this aggressively.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Oh, for sure. Sadly, the people who most frequently end up in these kinds of situations have often internalized a mentality that they’re *entitled* to a wealthy lifestyle, and get hyper-aggressive about reinforcing it. They spend money they don’t have, and then any financial setback drives them to become even more aggressive about reinforcing their desired perception for observers. They become exasperated that other people – particularly family – won’t participate in helping with that, because it seems pretty obvious (to themselves) they *need* this for *the lifestyle*.\n\nLike I said, egocentric, narcissistic bullshit. They forget other people are independent creatures with their own experiences, wants, needs, perceptions, etc.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Barging into a 17 year olds room who isn’t even your child and demanding their unpaid labor I think at least warrants being called an asshole lmfaoo",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "They own multiple houses, yet they barged in and demanded OP teach their child for free AND called her selfish for not having offered already. They are cheap fucking assholes and there's nothing harsh about saying it.",
          "id": 112,
          "comments": [
            {
              "score": 46,
              "content": "They could just fucking sell one of their houses to pay for a lifetime of piano lessons.\n\nThey are cheap. And they’re pissed because someone finally called them out.\n\nOP is definitely NTA",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Rich people don't get that way by spending their own money.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Another thing about entitled rich people is that while they're often super niggardly about their own money, they can be very, very generous with other people's time and resources.  About one year after my BFF got married, her super-rich mother in law called her up to say that her church friend's granddaughter wanted to try to get a job in their town, so MIL had told the granddaughter that she could have free room and board with my friend and her husband for as long as it took her to find a job.  (This was back during a time of notably high unemployment, as well.)  \n\nSo my friend told her MIL, uh, no, sorry, you can't just tell randos from your church that they can move in with us.  Her MIL kept insisting that the granddaughter would be there on such and such a day, so they would need to get \"the spare room\" ready for her.  Eventually my friend got so upset that she said fine, I'll move out and your friend's granddaughter can sleep in my bed with my husband.  She had to threaten to move out of her own home and go back to her parents' house before her asshole MIL backed down.  Crazy!\n\nThen my friend's cousin-in-law, the MIL's niece, told my friend that \"we're looking forward to your help with the children at family holidays.\"  This cousin has 4 kids who act like they were raised by wolves, I met them at BFF's wedding, and CIL just informed my friend that she expected her to spend family holidays playing au pair for them.  So my BFF just never goes to the same events as this cousin and her family.\n\nI used to envy my friend that she had married into a wealthy, prestigious family, but after hearing some of her stories about how arrogant, high-handed, entitled, and demanding her snooty in-laws can be, I'm pretty happy as a single lady.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "I'm right here too. You behaved less than ideally, however in the larger scheme, NTA.",
          "id": 116,
          "comments": [
            {
              "score": 4,
              "content": "Nah. Their personal space was invaded and they were called names in their own home. Fuck their cheap, asshole relatives.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "That’s literally what they are. A cheap asshole. Even putting aside the fact about how much money they have, the audacity of trying to demand free lessons from OP makes them a cheap asshole.\n\nIf you don’t want to be called a cheap asshole, don’t be one. It’s that simple.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Harsh? Yes. True? Yes. A realistic response from a teenager being harassed by adults? Also yes.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "If they make a habit of buying themselves all sorts of luxurious things and truly never buy their children anything the want (I don't mean everything they want) then I would say they need to be called out on it.",
          "id": 120,
          "comments": [
            {
              "score": 23,
              "content": "I agree. I don't think that went too far. They sound like terrible parents and deserve to be called out.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "They sound like the type of parents that use the child tax credit to buy toys for themselves instead of using it on their kids or on something that benefits the whole family.",
              "id": 122,
              "comments": [
                {
                  "score": 2,
                  "content": "I would've suggested the little girl use her allowance to buy lessons, but I bet they don't give their kids an allowance.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "They are cheap assholes. They did not even ask or say please. They just called her selfish and made demands. SHe said they have lots of gaming consoles and don't let their kids use them. They make 3x what her family makes and won't pay her. \n\nyes they are cheap assholes. When you want someone to do something first thing you say is please...",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Truth is a defense to defamation.",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Harsh? The truth hurts, eh? Ain't and uncle are clearly delusional *and* accusing OP of lying. They can go take a flying leap.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3318,
      "content": "NTA. Giving your entire family the silent treatment because you stood up to them?  Sounds like a true gift.",
      "id": 127,
      "comments": [
        {
          "score": 618,
          "content": "The best gifts are free.",
          "id": 128,
          "comments": [
            {
              "score": 249,
              "content": "Just like piano lessons",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "except chlamydia",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 284,
          "content": "Maybe OP can teach them to play the worlds smallest violin",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "That sounds like my aunt and uncle. My aunt is blood but my uncle is simply her partner. He is rude to me, nan and mum but we are not allowed to stand up for ourselves or we get a 6 months silent treatment.",
          "id": 132,
          "comments": [
            {
              "score": 5,
              "content": "> or we get a 6 months silent treatment.\n \nSounds like a reward.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2255,
      "content": "NTA, and problem solved! they aren't bothering you anymore! Also I would definitely say that even if I could play the piano, I definitely wouldn't teach the piano for free, lmao, you crazy?",
      "id": 134,
      "comments": [
        {
          "score": 681,
          "content": "I think that's what gets me. Beyond the fact that OP said that they are by no means an expert at piano and just know a few songs, even if they were, they should be paid for it. They would be if they were to teach anyone else.\n\nMy cousin taught piano to a kid in his church when he was a teen(cousin is in his twenties now), because he's always been so talented at it. The kid's family wasn't the richest and my cousin did do it for free, but that family still liked to pay him in some way(like a pie or some kind of dessert. A meal at their house).",
          "id": 135,
          "comments": [
            {
              "score": 140,
              "content": "Those people think that just because OP is family, they can get away with taking stuff and not having to give back.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Nothing worse than devaluing people's labor, in my eyes.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "\"But familyyyyyyyyy\"",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "For real. I probably wouldn't charge much for lessons, since they're my family, but nobody is getting ***shit*** for free from me.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And your cousin CHOSE to do that because he wanted to, he wasn't scolded to do it because of someone  else's supposed financial woes. \n\nNTA \nI play the piano the same way. Before I was in high school I really wanted to play Fur Elise. Mom put me in piano lessons, and my teacher was this extremely odd misogynistic woman whose entire home was decorated in frogs - to the point when it was Christmas she put up a white plastic tree with ONLY frog ornaments.  She made me watch her blood draws for insulin tests (this was a while back, not as innocuous as it is now) and didn't even let me touch her piano for 6 weeks. \n\nI decided that wasn't for me, got sheet music and penciled the letters over the notes one by one, then sat and coordinated it with keys. Enough repetition,  and you can remember it, but I can't just sit down and play whatever  is on the stand. \n\nWhen I play it around other people,  they think I can play piano! In 30 years I haven't learned another song.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "right?  I am taking lessons again after 30 years and my teacher is probably the best I have ever had.  He charges 1 dollar per minute so my 45 minute lesson is $45.  Honestly he probably should be charging more because he is concert pianist.\n\nedited: minute for hour",
          "id": 141,
          "comments": [
            {
              "score": 94,
              "content": "Buddy, I think you're being ripped off... $1/hr comes to $45 for 45 minutes doesnt add up! The madman!\n\n/s\n\nThat sounds like a decent rate though, $1/min.",
              "id": 142,
              "comments": [
                {
                  "score": 50,
                  "content": "Oops, I did mean $1/min.  I am such an airhead today!\n\nedited to add: thank you kindly for the award.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 16,
                      "content": "It's all good! I hope I was able to make you chuckle",
                      "id": 144,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "A dollar an hour, every minute!",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Wtf $1 a minute? How expensive are music lessons in 'murica they are like <nope> a minute here (rough calculation I can't actually remember how much mine are but they aren't that much)\nEdit: I'm grade 5. Also I get that skill level impacts it - idrk what level my teachers at but he's pretty good I guess. Also my calculations were way off so I removed them",
                  "id": 146,
                  "comments": [
                    {
                      "score": 22,
                      "content": "With the fact that a lot of people have to work 2 jobs just to have an emergency fund in America, free time isnt as available. Makes sense to me. 🤷‍♀️ but I dont know how to play piano.\n\nTypically I think it's done on an hourly rate, or it was when I was looking into lessons. It's been a while.",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "That’s about right for a skilled tutor. Tutor is a concert pianist, so this checks out. I’m assuming the student is at the level where a concert pianist tutor is a good investment. My niece (12, started lessons herself on YouTube a year ago) has a tutor now only a few steps ahead of her and is charged $25 an hour that I pay for. I imagine if she keeps playing eventually she will need a better tutor and price will go up with skill level.",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 149,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I am in Canada but it's about the same. My mom used to pay $40 per my piano lessons (45 minutes) but we had a friends and family discount. My teacher was a concert pianist and a really fantastic music teacher. Nowadays, I have a bass teacher who I pay $40/hour, which is an amazing price.",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Oh, man, I just did a quick fact check because in my head, one pound is about two dollars. It's now $1.36. Tanked in 2009 and then again in 2015/2016. Sorry about your savings.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "If you want a professional musician to give you lessons who has a degree in music, it is about $1/minute. If you want a high school kid or someone without a degree who’s never taught before to teach you it will be less.",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I don't really know how much concert pianists charge for lessons (though I know people who do, and I will ask them), but that sounds low. Professional string players (violin, viola, cello) charge $80+ per hour. Someone who is a titled player in a symphony orchestra will charge at least $100 per hour.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 903,
      "content": "NTA What you said was true. Don't teach your cousin even if you properly learn how to play - these people seem like the type who would leave your cousin there for hours to get free childcare out of you, too, expect you to feed her, pick her up, and drive her home, and then sue you or your parents for compensation because they're not satisfied with her progress.\n\nNo one is entitled to your free labor under any circumstances. No excuse is necessary from you beyond \"I don't want to do it.\" Don't apologize because you did nothing wrong, and, trust me, no matter how you word the apology, you could have a lawyer craft a letter for you, they WILL interpret it as \"you promised to give her lessons.\"",
      "id": 154,
      "comments": [
        {
          "score": 159,
          "content": "I was thinking \"oh, that's a bit extreme\" and then I remembered that OP is close to 18 and that the aunt and uncle are convinced that she is capable of teaching their daughter and saving them lots of money they actually have. If they're petty enough, they might sue for... the money to pay for it? IDK, there's no way any lawyer would help them sue with the goal of forcing her to teach their kid.\n\nThough I feel like someone willing to sue for that would also be the type to still want the person they sue to teach their kid after being effing sued over it.",
          "id": 155,
          "comments": [
            {
              "score": 49,
              "content": "I feel like people who try to get whatever they can for free will also try to get money any dishonest way they can. There are people petty enough that in this scenario they would claim they're \"not satisfied\" and sue for \"damages\" and make someone's life hell, even if they have no case, until they crack and cough up some money.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This needs to be higher up - everyone is saying nta bc they're bugging her when she doesn't know how to play but op shouldn't have to do it for free even if she did",
          "id": 157,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 845,
      "content": "NTA!\n\nI am professional flutist. I teach privately. \n\nYou know what people don’t realize? If you play an instrument incorrectly, you will hurt yourself. You can develop lifelong impairments and injuries. You can even do that playing it correctly. \n\nIf you were to teach piano to this 9 year old, I guarantee that they’d have SEVERE consequences, especially if their parents are pressuring like this and they’re this interested.\n\nNo, no, no, no, no! There’s a reason we take lessons and get degrees in this.\n\nNerve entrapment. Carpal tunnel. Ulnar tunnel. Tendonitis. Repetitive motion strain. Focal dystonia. Osteoarthritis. Ligament damage and tears. The list goes on.\n\nYou are not a piano teacher. You shouldn’t be a piano teacher.\n\nForget not knowing how to really play- the bigger issue is that you don’t know how to prevent the lifelong injuries!\n\nEdit: An award? Thank you! I merely speak the truth. I hate seeing people hurt by something they love- their instrument.\n\nEdit 2: Ah, more awards! Y’all are kind. Lots of comments too. I’ll try to answer haha.\n\nEdit 3: Oh my gosh, gold, thank you!",
      "id": 158,
      "comments": [
        {
          "score": 232,
          "content": "This happened to me with flute. Did school band for years, never got privates, got really serious about practicing on my own, and ended up in 6 weeks of PT for tendonitis. I had to switch to piccolo for a year to give my arm a chance to heal (ended up falling in love with pic anyways and continued to play it in college) but mannn recovery was no fun.",
          "id": 159,
          "comments": [
            {
              "score": 109,
              "content": "Yup. \n\nI'm so sorry that happened to you. I also love piccolo, but having the choice to play it or not play it is nice. \n\nI hope that the tendonitis doesn't give you problems anymore! I have seen instances where it re-occurred periodically, so I hope that doesn't happen to you! \n\nI have a nerve entrapment in both arms from flute. Yay.",
              "id": 160,
              "comments": [
                {
                  "score": 23,
                  "content": "Oh my goodness, I just noticed your name! <3 <3 <3",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "That's something non musicians don't understand.  Holding certain instruments properly while playing is one of the most important things and why you get trained teacher.  Guitar teachers are constantly adjusting students fretting hand to make sure they have a proper grip on the neck so they can play with minimal strain on the delicate parts of the hand",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "NICE NAME :D",
              "id": 163,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "[deleted]",
          "id": 164,
          "comments": [
            {
              "score": 45,
              "content": "This is what I generally tell people: if it's uncomfortable or hurts, it's wrong. Playing an instrument should not hurt or cause discomfort. The amount of musicians, especially young ones, who don't realize that is absolutely heart breaking.\n\nDon't feel bad. You can know it but it can take a long time to get it to be second nature. I spent many, many hours in front of a mirror.",
              "id": 165,
              "comments": [
                {
                  "score": 17,
                  "content": "[deleted]",
                  "id": 166,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I swear, you really do get used to it. It's weird at first, staring into your own soul, but after a while you just accept your fate.",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "That's not necessarily true. When first learning, there is some pain to be expected. With a woodwind or brass instrument, you need to develop your emboucher which can result in some soreness or pain in your surrounding mouth muscles, or lips where they meet the instrument. With guitar, your fingers will most definitely hurt as you develop the necessary callouses.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 5,
                      "content": "No, it should not hurt, outside of maybe guitar callouses, and even then, I subscribe to the \"frequent breaks and rest\" as you build up the necessary body changes. \n\nFor wind instruments, you need to stop practicing before it gets to the point of hurt. I never had pain when learning a new wind instrument, even as a child (outside of issues with my autoimmune disease, long story). The most I had was weird tingles on my lips from getting used to reed vibrations. \n\nIf a child or beginner is telling you it hurts, you need to tell them to take a rest. The idea is to stop before that happens. Too much too quickly can do some nasty stuff. Did you know you can get focal dystonia in your face? That's what happens, largely to brass players, who do too much too quickly. \n\nI've never had a student tell me it hurts unless there was something else going on, because I go to great lengths to prevent any pain.\n\nThis is a harmful myth that we need to stop perpetuating as musicians. It's ruining bodies and careers and love of music.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "My first piano teacher would rap my knuckles with a ruler if my wrists dropped and fingers flattened. She'd also rap my back if I wasn't sitting up straight. It sounds cruel, but it was never painful. Instead, it was a gentle reminder to correct my posture without making me stop and restart the song every time she had to remind me.\n\nTBH, I actually deserved a hard smack on the back of the head for how long it took me to finally play with proper form. My parents even offered to do it for her but my tutor was a sweetheart and said no. God, I'm thankful for every second she taught me as a child because I must have made her suffer that first year, but she was always my biggest cheerleader.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "I’m a voice teacher and it’s SO easy for people to damage their voices permanently with poor technique. \n\nThere are plenty of people who haven’t had lessons and sing beautifully, but that doesn’t necessarily mean they should teach it to someone else. I could sing decently before taking private lessons but there was a LOT I was doing poorly, both in the quality of singing and quality of healthy technique.",
          "id": 171,
          "comments": [
            {
              "score": 27,
              "content": "THANK YOU!\n\nMy secondary instrument is voice.\n\nI have so much trouble with pop singers, youtube/tiktok stars, children that sound like adults, talent shows, etc... You can just hear that they won’t be able to sing in a decade. \n\nIt’s so sad.",
              "id": 172,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah, and unfortunately a lot of young singers listen to pop stars with terrible technique and try to imitate that...",
                  "id": 173,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It hurts my soul.\n\nThey don’t realize a lot of pop stars can’t sing.\n\nAnd not to mention, what you hear on the radio is impossible. It’s all processed. It isn’t a human voice. Doesn’t mean it isn’t catchy or a good song- it does mean that it’s not real though.\n\nPart of what makes the human voice so beautiful though is the unique imperfections. A radio voice is processed to sound perfect- stripping it of all the lovely nuances a voice should have.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": ">Nerve entrapment. Carpal tunnel. Ulnar tunnel. Tendonitis. Repetitive motion strain. Focal dystonia. Osteoarthritis. Ligament damage and tears. The list goes on.\n\nJust noticed the tendonitis I had chalked up to taking too many notes in class could actually be related to this lol. I should probably either stop or take lessons.",
          "id": 175,
          "comments": [
            {
              "score": 13,
              "content": "I will always advocate for private lessons. They're for more than just learning to play your instrument. I find that they're good for life skills, confidence, general musicality, life advice, comfort, etc...",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Consider this comment a symbolic “*Helpful*” award.\n\nI took guitar classes until I couldn’t afford them anymore, and while most of my guitar and general music knowledge is self-taught, those classes helped me with posture and technique.\n\nOf course I’ve forgotten it all and just lazily strum some tunes on weekends, but if I were to actually do concerts or simply spend hours holding an instrument like I did when I started learning, those classes with professionals are essential.",
          "id": 177,
          "comments": [
            {
              "score": 14,
              "content": "Yeah, it's the long hours where you really need to know what you're doing.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You may have forgotten the specifics from the lessons, but you haven't forgotten it all- your body remembers most of the posture and technique even if it doesn't remember why.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "As a life-long flutist who refuses to teach others to play--I am glad to see this comment honestly. Well, I have played for about 15 years and since I am only 25, I will still consider this lifelong. \n\nBut even as someone who *can* play the instrument, I do not know how to *teach* the instrument. There are techniques and certain skill orders, etc. I didn't even think about injuries! When I was young, I was taught how to the third piece of my flute because my pinkies are so short to prevent injury and **never thought of it again.** I just do it now because that is how I play my flute and I learned how to tune it with the last piece turned sideways! People are crazy",
          "id": 180,
          "comments": [
            {
              "score": 3,
              "content": "Often people who are good at something aren't good at reducing it to the basics for newbies",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "TBF flute is particularly notorious for it. My mum still has issues with her pinky from playing flute as a teen, but she's played piano all her life and never had problems. \n\nEqually I'm clarinet and saxophone and never had issues with worrying about doing myself a harm.",
          "id": 182,
          "comments": [
            {
              "score": 13,
              "content": "You can have it happen with any instrument. I know a variety of musicians who all play different things and have playing-related health problems. \n\nI used to study clarinet and sax too. They tried to teach me piano and guitar in music school, but... I suck at them.",
              "id": 183,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "It can happen with any of them. I play sax semi professionally and I have issues with some of the nerves in my thumbs from playing tenor. No issues when it’s sop or alto, but I started playing tenor regularly much later and when I was out of professional lessons, and I’ve picked up some bad habits with it.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah, teaching her what she already knows is going to just set the child up with possible bad habits to correct when they finally do invest in lessons. There’s a reason why you have to reach a certain level before you can be recognized as a teacher by conservatories.",
          "id": 185,
          "comments": [
            {
              "score": 4,
              "content": "Yeah, I get lots of students who should not have been taught by the people they were. It's often worse than someone with no lessons at all. Breaking bad habits is frustrating and time consuming.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yes!  And this is why I have carpal tunnel from getting piano lessons from “teachers.”  My form was so mucked up for years and when I got into college and took professional lessons, I was already losing feeling in my fingertips.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Thank you! There are SO many things that go into playing an instrument with the proper posture, hand shape, and so on that most non-musicians don’t think about. You said this better than I could’ve.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 448,
      "content": "NTA\n\nI know how to play piano, and learning violin. If someone, even in my family, asked if I could teach for free, I'd tell them off. You expect me to take time out of my schedule to teach someone and get nothing in return? I am a full time college student AND I'm working two jobs, if you really want me to take what little free time I have and teach then you will have to pay, and no family discounts. Luckily no one I know is looking to play any musical instruments.",
      "id": 189,
      "comments": [
        {
          "score": 114,
          "content": "This! Even if OP could properly teach their cousin piano, including proper form and posture, it would be all the more reason to pay them. Like I didn't spend several years learning my instrument to have someone who has no idea what they're talking about demand I give up my time for no compensation",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Idk, I'd add a family discount.  The going rate + 50%, because fuck you, you know how busy I am.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "But faaaaamily 😭",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 149,
      "content": "NTA, they insulted you first by calling you a liar.  I’d tell them if they wanted a favor, their approach sucked.  When they can ask you nicely, you might consider generously telling them how you learned, because your nine year old cousin isn’t at fault.  It would be unfortunate if your cousin felt responsible and had all this adult conflict weighing on her shoulders.  It would be a kind thing to do, even if it’s not your responsibility.",
      "id": 193,
      "comments": [
        {
          "score": 13,
          "content": "Not to mention they called her selfish for not offering. Who in their right kind considers that selfish",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "The liar thing I can see.\n\nIf you walked into a room and someone was juggling only to tell you they couldn't juggle you'd think you'd had crazy juice.\n\nOnce OP explained though and all the rest? Yeh huge arseholes.\n\nBesides being able to play and being able to teach are different skills. Teaching is haaaaard. Done it myself.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "NTA.\n\nFuck em. I knew a well-to-do couple like that once. Barely did *shit* for their kid beyond the minimum of food, clothes, and school, up to 18. Always had money for fancy vacations just for mom and dad though and that huge house.\n\nIf you aren't gonna do anything beyond the minimum for your kids then people like them should just consider donating to a sperm bank if they want to maybe *eventually* reproduce.",
      "id": 196,
      "comments": [
        {
          "score": 48,
          "content": "Yeah, I was wondering when someone was going to mention that the parents sound emotionally abusive to their children",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "NTA.\n\nAlso: Well done.  Sounds like they don't like the truth.",
      "id": 198,
      "comments": [],
      "relation": "Support"
    }
  ]
}