{
  "post content": "I worked for 5 years at a company in a city's downtown area. This year, the company moved offices to a suburban area about 25 minutes drive outside the city.\n\nA lot of people were not happy with the move, we live in a very walkable city with good public transportation, not a lot of people have cars. \n\nThe company did a few things to ease the transition, that I'll list out here\n\n1. Free bus passes, which were not that practical because the only bus going near the new office leaves only once an hour from downtown. For most people, that would mean taking one bus to get downtown, transferring to another, and then going to work. \n\n2. Organized carpools; if one person in a neighborhood had a car and was willing to drive carpool, the company would connect them with others coming from the same area who needed a ride. The driver would get compensated for their gas, and their time. \n\n3. Discounts arranged with local car dealerships for employees. Hardly anyone used them because even a discounted car is a lot for someone who hadn't been planning on getting a car. Plus, the discounts only applied to brand new cars.\n\nSo anyway, I had a car and wanted the extra money. So for almost a year, I drove a carpool. It was a pain sometimes, organizing with people, getting to the pickup point at 8:10 each morning, waiting on people instead of going straight to work, etc.\n\nDuring this time, I got more and more into cycling. I got a nice bike, used it for almost all my errands and social life in the city, and really enjoyed the workout. \n\nI wanted to start riding into work; it would actually take me about the same amount of time to ride as it takes to do the carpool. 40 minutes. It would be way more fun, keeping moving rather than sitting in traffic.\n\nPlus, my commute was really the only thing I was using my car for, I was biking literally everywhere else and it wasn't making sense to keep the car. The extra money I got for  driving carpool didn't make up for all the costs of registration, insurance, inspections, maintenance, parking permit, gas, cleaning, etc... \n\nSo I told the group last week that I was planning on selling my car and biking into work, starting this Monday.\n\nAnd almost all of them (i drive 5 people) were annoyed at me for bailing on the carpool. They didn't have other good options, none of them had cars. And we all know the bus sucks. Most of them wouldn't be able to bike into work either, out wouldn't want to. It is a strenuous ride and it's cold out this time of year.\n\nI said I'd give them the first dibs on my car when I was selling it, my price was 11,000, and everyone said no, that was too much, my car wasn't worth that, etc. I think it was, I was just following Kelly blue book.\n\nAITA for quitting driving carpool?",
  "id": 1,
  "comments": [
    {
      "score": 220,
      "content": "ESH. Hot take inbound. You don't suck because you're selling the car. You suck because you told them that the change was going to happen the upcoming monday. Maybe if you told them that you started biking and that you were thinking about selling your car, that would have given them more time to find a change of ride. \n\nOn the other hand, they shouldn't complain that much, just go back to the company and request a new carpool driver",
      "id": 2,
      "comments": [
        {
          "score": 90,
          "content": "I agree that the short notice was inconsiderate. It would be understandable if it was due to circumstances beyond OP's control, but given that this is purely a matter of preference I think 3-4 weeks' notice would've been reasonable. It can take time to make alternate arrangements.",
          "id": 3,
          "comments": [
            {
              "score": 15,
              "content": "Yeah I'm on your side. But I'm saying the people shouldn't really be affected because it was the idea of the company. They can just go back to the company and request a new carpool assignment. I think 3-4 weeks notice is the perfect amount of time",
              "id": 4,
              "comments": [
                {
                  "score": 26,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": -14,
                      "content": "If it was voluntary he wouldn't be getting compensation from it",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "What if OP was quitting his job instead of just quitting the carpool? The most notice he'd give is 2 weeks, plenty of time to find alternate arrangements, and I don't think anyone would judge TA. Giving 3-4 weeks seems excessive to me.",
              "id": 7,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "NTA, but the notice was quite short.",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 94,
      "content": "YTA only because of the short notice.  You're not under any obligation to carpool indefinitely, but If you don't have a car or easy access to public transportation, one week is not much time to figure out a new 25-~~mile~~  minute commute to the burbs.\n\nThey are relying on your (compensated) help to get to work, and it would not burden you to have given them more warning about your change of plans.\n\nJust like your employer did, an offer to sell them a reasonably-priced car isn't very helpful.",
      "id": 9,
      "comments": [
        {
          "score": 16,
          "content": "I agree, the short notice would definitely be difficult to work around if you don't have a vehicle of your own. Not sure if it makes a difference to your judgement, but it's 25 minutes, not miles. Still tough to plan a commute around though.",
          "id": 10,
          "comments": [
            {
              "score": 3,
              "content": "Oh, 25 minutes, duh.  I should have realized when OP said they could bike it in 40.  Still, I think it's a mild YTA because of the timing even if it is only 25 min.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[deleted]",
          "id": 12,
          "comments": [
            {
              "score": 1,
              "content": "OP's reason for not driving is he doesn't feel like it, and he could easily make someone else's life easier just by planning ahead a little.  Hypothetical situations like being fired or whatever are irrelevant.",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If somebody is relying on you for something, especially something important like getting to work, and you take away your assistance on short notice, when you could have given a lot more notice at no cost to yourself, that makes you the asshole.  Not sure how to explain it more clearly.  \n\nNothing you said is wrong, but it is all irrelevant to the question of AITA.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "Maybe a little bit YTA. Not for quitting carpool, but for not giving much notice.",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 27,
      "content": "NAH.  I can understand why they'd be frustrated, but you should not be committed to being the carpool driver in perpetuity.  You could have given them more notice, but that's definitely not asshole territory.  You gave them first shot at buying your car, which you were shouldering the responsibility for, it was their choice to pass.  Enjoy cycling and not having to sort out all the responsibility of owning a car.",
      "id": 17,
      "comments": [
        {
          "score": 7,
          "content": "\n>you should not be committed to being the carpool driver in perpetuity.\n\nYeah, what if OP got a new job? Or the car broke down? This carpool idea is only good in the short term.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "NTA for wanting to bike but you didn’t give them enough time to find an alternate mode of transportation. So mostly YTA\n\nYou should have given them more warning even with selling the car that’s not enough time for them to make that kind of decision.\n\n11 k is a lot of money and if they didn’t know very far in advance I’m not surprised nobody was willing to shell out the money then and there\n\nEdited for clearer judgement",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "NTA.  The only bad part I see was the short notice.  That could've put some folks in a tight spot.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "YTA for short notice, and a little bit for trying to sell the car to them. They were already offered the option to buy a car. If they were going to they would have. Also telling them with such short notice wasn’t kind. If you’ve been thinking about this for a while a quick “FYI I’m thinking of selling my car soon so you all might want to look into other options for transportation to work” wouldn’t have hurt at all, and would probably have taken the flack off of you. Also what makes you say it will be for sure gone by Monday? If you’re offering it up to them to buy then you don’t already have a buyer. Whats the harm in still driving the car while you’re trying to sell it? That gives them more time to find another ride.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA You aren't the asshole for quitting the carpool, but you didn't give them much notice. Most people don't have enough money to buy a car just lying around, but if you had given them warning, maybe they could have bought it. Maybe they could have gotten the right stuff to bike into work or asked friends if they could carpool or basically anything else. You gave them almost no notice.",
      "id": 22,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "Uhhhh NTA easily. You’re just trying to save money like everyone else.",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA \n\nMaybe they were annoyed at the new situation but not you personally? If they take this personally that’s ridiculous.",
      "id": 24,
      "comments": [],
      "relation": "Support"
    }
  ]
}