{
  "post content": "I woke up at 5am craving pancakes while on vacation with my in-laws, so I decided to quickly make myself and my son some since we were the only ones awake besides my husband who doesn’t eat pancakes. My sister-in-law’s daughter came downstairs just as my son was finishing up and started crying because there were no more pancakes for her. \n\nI did try to comfort her but I have really bad morning sickness after I eat and I was starting to feel sick so I had to take her to her parents who were still sleeping.\n\nLong story short my sister-in-law was upset I only made pancakes for myself and my son when there were others in the house who also needed to eat breakfast. She said I was selfish and I should’ve known my niece would’ve wanted some too so I could’ve made extra just in case.\n \nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 16682,
      "content": "YTA-My question is how did you manage to only make pancakes for 2 people? Whenever I make them i can easily feed 6 kids.\n\nEdit: forgot a verdict.",
      "id": 2,
      "comments": [
        {
          "score": 5649,
          "content": "This was my exact question! I’ve been making pancakes since I was 12, and every recipe makes enough for like 4 lumberjacks.",
          "id": 3,
          "comments": [
            {
              "score": 3294,
              "content": "Yall follow the recipe?? I just scope some mix and slowly add enough water to get the right consistency.",
              "id": 4,
              "comments": [
                {
                  "score": 1140,
                  "content": "Lol some take eggs so I don’t just wing it. \n\nBut guessing is how I end up with enough pancakes to feed an army.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2143,
                      "content": "I use bisquick. Half the recipe calls for one egg, and is enough to make 4 large pancakes or 8 small. I could see a hungry adult and kid polishing that off\n\nOh, and NTA. Wouldn’t have been a big deal to have made extra but if everyone was asleep, I’d have probably done the same depending on the hour and not knowing when everyone else would wake. I would however offer to make extra the next time now knowing that niece would have liked them, even if they aren’t fresh off the griddle and is allowed to have them. Sounds more like this was just an impromptu thing, not done intentionally to slight anyone. \n\nWe personally try and limit sweet breakfasts in our home, so I would not have been thrilled about my kids being fed pancakes without my okay, though I also wouldn’t complain over a nice gesture, esp since it would be my fault for not being up to see to my kid’s meal.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "I use eggs when making waffles. However if I only want a couple pancakes I definitely just wing it.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "The egg doesnt matter. Just use milk and pancake mix, it's fine. I just did it this morning to make exactly 1 pancake for the kid who wanted a pancake. \n\nNTA OP.  They can make their own kid a pancake. It would be different if the child was awake and present while you were cooking, but you'd already wrapped up by the time they asked.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I put eggs in mine but I still just wing it. My grandma taught me to measure with your heart. 😁",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 329,
                  "content": "Every time I use this method I find myself falling down a slippery slope of “oh, just a little more water”…”oh shit, too much water, more mix”…”ugh more water…” into a pile of pancakes sufficient for a platoon",
                  "id": 10,
                  "comments": [
                    {
                      "score": 22,
                      "content": "It took me years to be able wing 😂",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Which is good because I somehow always burn the first one. So I have a built-in strike one in my calculations.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 185,
                  "content": "[deleted]",
                  "id": 13,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Same. I just don't make pancakes frequently enough to take up precious space in my pantry with mix. So I follow a recipe and still make enough to feed 4 adults.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Pancakes to me are what Americans call crepes. I never bother with a recipe, throw some flour in a bowl, mix in some eggs (the number depends on how much flour) then add the milk until it reaches the right consistency. Fry in butter. We have them every Saturday morning except during lent, sometimes one of the children will make them, sometimes I do. I would need a recipe for American pancakes the first time anyway.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 86,
                  "content": "I make them from scratch. There is no way I could make just enough pancakes for 2 people.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I don't know what I must be doing wrong then because I barely make enough for me alone",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "I make mine from scratch, but I go by proportions and not a recipe.  I usually make just enough for two.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Go to allrecipies.com you can select your recipe and on most can change how many servings you want it to make and you can print it out.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 59,
                  "content": "Same! My husband measures everything like he’s in a lab.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Oh thank god I’m not the only one that does this. I’m not OCD but something about cooking makes me OCD and I measure everything lol my wife always laughs at me doing this.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Next time mix in some vanilla sugar. It is great!",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not everyone uses pancake mix... I've only ever made them using eggs, flour, milk. Normally I do use a recipe to get proportions right.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Mix? You don't use eggs, milk and flour?",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 201,
              "content": "Exactly! Even if you cut it in half it’s still more than enough for 2 people. \n\nTodays tip if you didn’t know, save them and toss them in the toaster for tomorrow’s breakfast lol",
              "id": 25,
              "comments": [
                {
                  "score": 112,
                  "content": "OH MY GOD how have i never tought of that, i toast stuff everyday. You may have changed my life, good sir or madam.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 12,
                      "content": "You can even keep them in the freezer and then toast them when you want them. I always make a huge batch when I do pancakes, waffles or French toast because it’s so easy to save extras for a busy morning.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "You can also freeze them, and toast from frozen like an Eggo.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I do this with waffles, and French toast too.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "You know you can halve or third a recipe, right?",
              "id": 30,
              "comments": [
                {
                  "score": 101,
                  "content": "How do I third an egg?",
                  "id": 31,
                  "comments": [
                    {
                      "score": 236,
                      "content": "Beat it, pour in one third and drink the other two thirds? Get some problem solving skills, pal. /s",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "My default pancake recipe didn’t involve eggs even before I stopped eating them.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "If it's 1 cup mix and ½ cup water, then 2 tablespoons of mix and 1 tablespoon water will make you 1 pancake. You just have to keep the proportions the same.  Google can help you with the math",
              "id": 34,
              "comments": [
                {
                  "score": 3,
                  "content": "But the egg? How do you proportion and egg?",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You never heard of division?",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "What recipe u just throw the mox in add the water or milk and then add more mix in because u added too much milk or water then add more water or milk because u added to much mix and end up with enough pancakes to build a small village",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2077,
          "content": "Seriously? \n\nNobody in my house is up for the day before 8:30. If I woke up at 5 and made a couple pancakes, it would be on the same level as making a midnight snack. Imagine someone waking up and getting pissed you didn’t prepare them a plate of olives and cheese. \n\nAnd OP is pregnant? Got morning sickness? And was going right back to bed? How the hell is she an AH, here???\n\nNot to mention I make pancakes from a box, just add water, so it’s very easy to make a tiny batch of batter for only me and my brother. I do it all the time.",
          "id": 38,
          "comments": [
            {
              "score": 731,
              "content": "Yeah, this is so weird. Like, OP explained they were feeling ill and could not physically make more pancakes. So they didn't make more pancakes... because they couldn't. How does that make them wrong? I am totally confused by the verdict on this one.",
              "id": 39,
              "comments": [
                {
                  "score": 371,
                  "content": "I can only hope that verdict was a joke. Whenever I make pancakes, it's always for myself or me and one other person. I make enough for 1 or 2 people, not 6. Are people not aware it's possible to make fewer pancakes? And why is OP expected to magically know when the niece is going to wake up? It's not like she made the pancakes with niece already awake and purposefully excluded her.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Exactly. Not to mention her niece threw a tantrum as well. Can’t understand why OP is wrong here.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Freakin Richie rich over here with your midnight snacks of olives and cheese.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yea this verdict is kind of blowing my mind.  It's 5am.  Who makes everyone breakfast at 5am? And there is no magical wand that makes morning sickness better.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I wish I could upvote this more.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Hmm, if you’re serving olives and cheese, I’ll join you.",
              "id": 45,
              "comments": [
                {
                  "score": 3,
                  "content": "Okay but you have to get them yourself.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1347,
          "content": "so OP is an asshole because you don't know how to measure ingredients?",
          "id": 47,
          "comments": [
            {
              "score": 704,
              "content": "lol I was thinking exactly this, if OPs 5am go-to is pancakes she's probably used to making exactly the right amount for her and her son",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Thank you, someone said it",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Right?? Like this comment is so irrelevant. Who cares if bro doesn’t know fractions? Clearly OP knows how to make pancakes for two because that’s exactly what she did.",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 995,
          "content": "[deleted]",
          "id": 51,
          "comments": [
            {
              "score": 22,
              "content": "I agree on anything except for \"Not her kid, not her problem\": if the niece *had* been awake, it would have been an AH move to only make breakfast for herself and her child.",
              "id": 52,
              "comments": [
                {
                  "score": 16,
                  "content": "Isn't the \"not their kid, not their problem\" the motto of this sub?\n\nEvery now and then, someone posts a variation of the same story: that their sibling asked the poster to babysit their kids for free, they refuse and the family calls them the AH\n\nAnd the sub response is always \"NTA, not their kids not their problem\"\n\nWhy here and today it's OPs problem? She had pregnancy cravings at 5 am. Nobody is entitled anything",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yes she is NTA. Why are this peoples saying a pregnant person who is having morning sickness a asshole for not knowing other's child will also wakeup and want a pancake? It just a pancake, can't the child parents cook it for her.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Exactly that!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "In regards to point E \nShe could have very well said no I don’t want them after op made her some \nAlso I feel like she only wants them because she saw that someone else had them",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 943,
          "content": "By only making as much batter as you need",
          "id": 57,
          "comments": [
            {
              "score": 502,
              "content": "You are NTA. \n\nSIL can feed her own kid.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 272,
              "content": "Lol, for real, I don't understand how this YTA comment is getting so many upvotes. \nIt was fucking 5am in the morning with everyone else asleep, AND you were done by the time the kid walks in. If she still wants some, her mom can make 'em. Fuck 'em. I hope those pancakes were delicious.",
              "id": 59,
              "comments": [
                {
                  "score": 85,
                  "content": "And she still would have made more pancakes if she hadn’t had to go throw up. \n\nUsually this sub is a little nicer to pregnant women than this. Like WTF sorry, do you actually want vomit in your pancakes?\n\nAlso maybe the 7-year-old’s parents should have taught her how to start regulating her own emotions by now?",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "NTA It was 5am and you were feeling sick after you already finished. SIL should make some pancakes themselves.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "You are definitely NTA, I am baffled at this being the top verdict. \n\nWhy would you have made a bunch of pancakes presumably nobody would eat for hours, that’s such a waste of food. It’s not like box mix pancakes are complex to make, if at a reasonable hour other people wanted pancakes, someone could’ve made a big batch no problem. Possibly even you after a few hours of sleep if you didn’t feel sick still. People are acting like you saw your niece was awake ahead of time and you just decided to exclude her.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Exactly. I've got four big teenagers and often have a passel of nibblings wandering in and out (also mostly all big teenagers, now), so I typically make enough for an army and stash any leftovers to be toasted later. However, my kids were also taught to be self-sufficient from a young age, and there is often batter in the fridge so they can make a quick snack or breakfast if needed before school although they're all team waffle so the iron has a permanent home on the counter. Whether you made just enough batter for your specific needs or made extra batter and placed it in the fridge because no one else was awake (on vacation I'd want my pancakes fresh and piping hot and not want rubbery reheated leftovers no matter how good they are with nutella) you are still NTA even without the addition of your morning sickness and I don't understand all those saying you are. \n\nI expected you'd be saying you and your son had this amazing pile and  ate them in front of her while refusing to make more even though you could have easily done so which is not the case at all and is actually beside the point. Especially considering how early it was. You were ill, but they expected you to take the time to not only make more batter but actually cook them AND serve her because they hadn't gotten up themselves? How old is she? Had anyone actually even discussed dietary requirements and expectations? Was it expected that anyone cooking would make enough for everyone? Even if it had been discussed, I'd still say NTA with the morning sickness. You didn't ignore her and woke them for help. What more could they want?",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If it was 8am, you’d be an AH, not who expects that any kid at all would be up at 5am?  At 8am, I’m sue god know better and would have made more, right?  Hours earlier is a different case.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 676,
          "content": "I make pancakes for 1 on a very regular basis. It’s pretty easy and something a lot of parents get used to.",
          "id": 65,
          "comments": [
            {
              "score": 120,
              "content": "For years my mom and I were the only pancake eaters the rest were team waffles. We got used to making pancakes for 1 or 2.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Same here but I make enough for our two boys. I’d rather run out than put them in the fridge until I have to eat them myself or toss them.",
              "id": 67,
              "comments": [
                {
                  "score": 15,
                  "content": "Put them in the fridge? I don’t eat pancakes myself, not a fan. But I’ve heard they don’t heat up well, which is another reason why I’m team NTA on OP making pancakes for everyone really early, and then everything going cold while people slept. Sounds super gross.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 351,
          "content": "See that's actually very easy all you need to do is know how to cook",
          "id": 69,
          "comments": [
            {
              "score": 38,
              "content": "Or how to Google",
              "id": 70,
              "comments": [
                {
                  "score": 30,
                  "content": "Thank you!!! This thread is bonkers! It's like no one knows you don't need an egg or 6 cups of flour to make pancakes 🤦‍♀️ I make vegan pancakes all the time when I run out of ingredients.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Pro tip - applesauce",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Can't believe the amount of idiots on this site who can't do basic measurement lol",
              "id": 73,
              "comments": [
                {
                  "score": 3,
                  "content": "Honestly, I'm shit at measurements and often have to Google when cooking cause I'm only ever cooking for myself. That being said it's so easy to eyeball pancake batter and make just enough for what you need.",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 178,
          "content": "It’s not hard. I easily make pancakes for one, lol.",
          "id": 75,
          "comments": [
            {
              "score": 5,
              "content": "Same. I made pancakes for just me many times while I was single!",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 119,
          "content": "I cut my recipe into 1/4s",
          "id": 77,
          "comments": [
            {
              "score": 100,
              "content": "But when I try to make just enough, my kids decide they need 17 pancakes instead of the normal 1 or 2 lol",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This is my last resort",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 98,
          "content": "Feed 6 kids? Must be nice to make a decent amount of pancakes. I always accidentally make enough pancakes for the whole neighborhood! But I have some very hungry hungry hippos in my home so it is alright..",
          "id": 80,
          "comments": [
            {
              "score": 8,
              "content": "Take my upvote for referring to your family as 'hungry hungry hippos.'",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "6 kids = 1 teenage boy when it comes to pancakes!",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13253,
      "content": "NTA - I’m shocked another mother got upset at a pregnant mom who got up, made pancakes for her and those that were awake at the time, and then got too sick with morning sickness to make more before her own daughter could get any. That seems pretty selfish. I’m sorry she made you feel guilty. That’s a reflection of her character flaws, not yours.",
      "id": 83,
      "comments": [
        {
          "score": 3017,
          "content": "In this situation one would make a large batch of batter knowing others will want some as they get up. I can’t imagine not doing this.",
          "id": 84,
          "comments": [
            {
              "score": 2695,
              "content": "Maybe cut her a break because she's pregnant and has morning sickness? NTA",
              "id": 85,
              "comments": [
                {
                  "score": 2494,
                  "content": "At 5 in the morning no less!",
                  "id": 86,
                  "comments": [
                    {
                      "score": 1826,
                      "content": "Yeah, I’d be asleep until at least 8, maybe 10. I don’t want pancakes made from batter that’s been sitting out for 5 hours.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "At 5 am WHEN EVERYONE ELSE IS ASLEEP. How was she supposed to know the kid would wake up?\n\nIf she could make it for just two people it was probably a premade mix that wouldn't have been very hard for her sister to make. Her sister is probably just annoyed she had to wake up early and be a parent.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "And they were all on vacation. I wouldn't have expected other people to be up for at least a couple hours. She's not psychic, she probably wasn't expecting her niece to get up so early.  Either OP or the SIL should explain that it wasn't personal, but OP wasn't feeling well, etc- NTA.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 215,
                  "content": ">and has morning sickness\n\nThought that was *after* she eats....",
                  "id": 90,
                  "comments": [
                    {
                      "score": 21,
                      "content": "She had no idea what time her niece was going to be up",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 867,
              "content": "What's funny is that I can't imagine making a giant batch of batter just because other people who aren't awake might want pancakes later.  In all seriousness,  the idea sounds ridiculous. I'm up at 5am, all is quiet,  just me and my son awake.  We're hungry,  I make breakfast for the 2 of us.  It would never occur to me to make a giant batch of batter just incase,  2-5 hours later,  people want pancakes.",
              "id": 92,
              "comments": [
                {
                  "score": 421,
                  "content": "What I can't imagine is someone making a big deal out of it too.\n\n\"Oh, you didn't make extra breakfast at 5am in the morning? That's alright, we'll take care of ourselves, don't worry about it!\"\n\nLike, how does this not just pass over the issue?",
                  "id": 93,
                  "comments": [
                    {
                      "score": 83,
                      "content": "Had the niece not woken up at that time I doubt anyone would have even known!",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 176,
                  "content": "It could be anything she made. Just strange the amount of people who think OP should of made MORE pancakes ....just in case someone wanted what she craved at 5am.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Exactly, plus what if they woke up at 9am? Then they would have to eat 4 hour old pancakes lol",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 37,
                  "content": "Specially since in one of her comments she mentioned since they are on vacation the family usually goes out to eat for breakfast.",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Exactly. 5 in the morning is still practically the middle of the night IMO--the sun isn't up for like 3 more hours in many latitudes at this time of year. And she's on vacation so it's not her kitchen or ingredients; why would she assume the rest of the house is all going to want pancakes from batter that's been sitting around 3 hours later? What if they wanted to use those eggs for omelettes, or make waffles instead, etc.? I would've done the same thing as OP.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Exactly! We visit my in-laws quite frequently and they have a tendency to stay up until 3-4 am some nights. I can’t hang past 11-12, so I go to bed. I wake up much earlier than them and always make myself breakfast and not one time has anyone complained that I didn’t make them something for them when they wake up at noon. This is ridiculous. NTA",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Right her own husband doesn’t like pancakes why should she assume everyone else will want it too. Sounds like SIL/sis was just hoping for someone else to take care of her child.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "This. Also it takes 30 seconds to make a pancake batter, if OPs niece wanted pancakes it wouldn't take long for her (presumably, non-pregnant) mother to make her some.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 625,
              "content": "Why is she responsible for feeding everyone? She fed herself and her son.  Nieces mom can get out of bed and cook for her own child.",
              "id": 102,
              "comments": [
                {
                  "score": 113,
                  "content": "And anyone else who wants breakfast while she’s there since she thinks OP should have!",
                  "id": 103,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Or Dad, right?",
                  "id": 104,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Like how the hell did I read these many comments and no one has pointed out that there was another adult awake who is not pregnant, and could have made the pancakes.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 600,
              "content": "Then when nobody wants them, it gets wasted. To me it makes more sense to just make batter as people want them.",
              "id": 106,
              "comments": [
                {
                  "score": 209,
                  "content": "Just ignore this argument, no one would be saying you should have prepared 10-15 bowls of cereal if that’s what you were making 🙄",
                  "id": 107,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Wait you don’t pour 10 bowls of cereal fill them with milk and let them sit out in case someone wants some…?",
                      "id": 108,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "100% this. NTA btw, hope you feel better",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "You’re NTA nieces mom is an idiot who doesn’t wanna cook for her kid.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": " The other mom just didn’t want to cook. NTA.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 334,
              "content": "but then she'd get complaints of them being \"cold\" (even though they can be heated up).\nand how would she know that the niece would want them? did they talk about pancakes the night before?",
              "id": 112,
              "comments": [
                {
                  "score": 9,
                  "content": "All I'm learning from reading these comments is that redditors have never made pancakes lol. Y'all don't even know about batter.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 309,
              "content": "And then when not everyone wants pancakes, you end up with a bunch left over. Really not a big deal to make them as people get up and want them. She got sick. She took the parent's hungry kid to them to feed her. It shouldn't have been a big deal.",
              "id": 114,
              "comments": [
                {
                  "score": 236,
                  "content": "It's 5 am, she's got pregnancy cravings, and you all want her to calculate the number of people, whether they would want breakfast at all, how many pancakes they might want, whip them up or make them and then go be sick? I'm pretty sure she didn't use up all the ingredients.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I can see the post...\n\n&#x200B;\n\nAITA for waking up at 5am and making 3 dozen pancakes for EVERYONE even though only me and my son were awake and everyone else was asleep?",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This. I regularly host my in-laws, and they are always buying/making extra food for later. I appreciate the gesture but 90% of the time it means plansI’d made to take my wife out to a restaurant have to get cancelled so we ‘don’t waste food’ - and we have to eat whatever they felt like at the time rather than what we want at the time.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 243,
              "content": "If I am awake at 5am and caring for my child while pregnant there isn’t any way I’m standing there making more food for people that are literally sleeping.\nShe made enough batter for those that were awake and hungry. It was literally 5am??",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "So at 5am with everyone else asleep you'll make enough pancake batter for them all? I'm seriously wondering what's up with this thread that people are insisting the mother should have somehow known the little girl would also wake up at 5am and want pancakes. It's bizarre.",
              "id": 119,
              "comments": [
                {
                  "score": 12,
                  "content": "RIGHT??? My god. NTA by any stretch of the imagination. Get up and make your own kid pancakes. It was FIVE AM. 👀",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 154,
              "content": "Pancakes are a pain in the as to cook in large batches unless you have a decent sized griddle and there were multiple other adults who could whip some up",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "If she was using the instant stuff then she could easily make enough for two. I mean, she made it as a pregnancy craving for herself, then her son was awake and made him some. I don't think she's responsible for feeding everyone unless she volunteered. The girl's mom could make some.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 548,
          "content": "SIL was sleeping but expected OP to cook for her kid?? \n\nNTA. SIL should wake up to take care of her obviously young child and not expect others to.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 296,
          "content": "Is the husbands arm broken?",
          "id": 124,
          "comments": [
            {
              "score": 211,
              "content": "I mean, really. What is going on here. Was there a Rapture that took all the mens out of the house?",
              "id": 125,
              "comments": [
                {
                  "score": 8,
                  "content": "Brilliant! 😂",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If there was a rapture it at least left the sexists behind, as evidenced by this post.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I don't know why this isn't being asked more. Your husband could have made some pancakes for the niece so nobody had to be woken up.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 132,
          "content": "NTA If the niece is young enough to need an adult to watch her, the entitlement includes watching the kiddo while Mom & Dad sleep, in addition to preparing breakfast. OP was up and cooking before 6AM; who expects others to be awake that early during vacation?",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Exactly.  I’m sorry. I didn’t realize you wouldn’t get up to feed your kid and that I was responsible for feeding her. NTA",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I agree. NTA. How could she have known that others were going to wake up so early, when everyone else was asleep? Just get up and make your kid some pancakes…. That poor woman. I remember my roommate being pregnant and we had to keep certain smells out of the house, but when she was hungry, the woman needed to EAT. I could imagine that it’s really hard to plan for every other person in the house when that hits.\n\nI’m my family, if we’re all together then you get food if you’re awake, and you have to make it for yourself/your family if you sleep past then. I don’t think that’s super unreasonable.\n\nAlso, I get why the kid is upset. Poor kid. But it’s really mom’s job and not pregnant SIL’s. My uncle and his wife always drop their kids on the rest of the family as if they’re our problem. We’re happy to help, but it’s not our responsibility. I understand needing a break, but that’s something you ask for, not something you automatically expect (especially someone with pregnancy brain. I have AuDHD, and forget stuff all of the time… it’s not personal… I try to be super aware of others and their needs, but sometimes it just happens. I try to be better but it doesn’t make me a shitty person, and definitely doesn’t make pregnant OP an asshole).",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "She was apparently expected to be psychic and know that more people were gonna be up around 5 in the morning. \n\nHer SIL didn’t just want a free babysitter in the early morning hours but someone to make pancakes for breakfast for her daughter as well. \n\nIf OP has morning sickness maybe the SIL can get out of bed and make some pancakes for her daughter. \n\nNow that they’ve learnt from this experience they can plan breakfast going forward so that the adults can take turns waking up early and cooking for everyone.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Also everyone saying that when they make them they make enough for 5 people or more, I’m assuming they are from America, because other countries recipes can have smaller portions. In australia if I were to make pancakes to feed 4 or more I would have to double or triple the recipe. NTA op, my motto is if they weren’t there or didn’t ask then they don’t want it.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Also sounds like SIL would like to sleep in while you provide child care for her despite having morning sickness and having woken up at 5. NTA—maybe vacation with better people in the future!",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I feel like the lady is much more \"upset\" that the OP didn't acknowledge that \"shit you are right i should have made more and will next time.\"\n\nNothing about the post seems to say that \"shit i totally should have made more and if not for the morning sickness bc of pregancy i would have\"\n\nwtf is the point of even alluding to the pregnancy when there is no \"if i want not pregnant I would have done it differently\"",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4546,
      "content": "NTA. Fuck all these commenters imposing new information onto the situation.\n\n\"You knew the others would want pancakes\"\n\n\"Who only makes pancakes for themselves?\"\n\nBro, the information OP had at the time was \"my family is awake\" and \"my family is hungry,\" so she fed them. How do you know the others aren't on a keto diet? How do you know they aren't celiac? How do you know the others don't already have breakfast plans that pancakes beforehand would ruin? You fucking don't, and neither did OP, so she worked with the information she had.\n\nMy god, some of these comments are dripping with so much righteousness that people are slipping over themselves to add enough new details to justify calling OP an asshole. Y'all should be ashamed of yourselves.\n\nEDIT: Two things\n\n1. Thanks for the awards!\n\n2. Some of you people STILL seem to be suffering from poor reading comprehension based on how you're replying to both the post and my comment. You're criticizing a pregnant woman with morning sickness for vomiting instead of cooking. Seriously, fuck y'all.",
      "id": 136,
      "comments": [
        {
          "score": 973,
          "content": "Right? A lot of very, very entitled people making comments and judgments here.\n\nMorning sickness sucks ass and I would have done the same thing. OP is definitely NTA.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 686,
          "content": "THANK YOU. I cannot believe all these Y T A responses. Where is the empathy for a pregnant mother with morning sickness who is trying to just feed her family and subside a craving at 5 in the morning. I know I’m more on the groggy side if I have to be awake that early and i’m certainly not thinking about feeding people who are not awake to eat it.",
          "id": 138,
          "comments": [
            {
              "score": 18,
              "content": "There is zero empathy for the pregnant mother. Not even a drop. OP is NTA, but there are a lot of entitled AHs making judgments here.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "At 5am if I woke up wanting pancakes (also pregnant) I go to IHOP instead bc cooking makes me hurl. NTA at all. You actually made breakfast instead of going out for it (which inevitably would have been more trouble for you from SIL) and bravo for eating the food you made too. That shits hard to do",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 437,
          "content": "Also... As a person who sleeps in I would not be upset missing pancakes if they were being cooked at 5 in the fucking am",
          "id": 141,
          "comments": [
            {
              "score": 304,
              "content": "I think people are straight up not reading the first sentence that says it's at FIVE FUCKING AM.",
              "id": 142,
              "comments": [
                {
                  "score": 144,
                  "content": "Also forgetting the little girl came in after they were done. They act like she cooked and ate in front of her like bffr",
                  "id": 143,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Fr",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 89,
                  "content": "Right? Like if the pancakes were being cooked at 10 am maybe make a extras cause people are gonna be awake....but 5 am???? Nah that's too early for most people",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 305,
          "content": "Totally agree, big entitled parent energy here.  Why didn't you make pancakes for MY kid who may not have been awake for 5 more hours for all you knew?",
          "id": 146,
          "comments": [
            {
              "score": 29,
              "content": "Sounds like a lot of these people didn't get pancakes as a kid once and are still mad about it.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "More like big entitled children energy.  I get the feeling they're looking at it from the snot-nosed niece's perspective, because they're closer in age to her than OP.\n\nNTA",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 236,
          "content": "This comment! I don’t understand all the Y-T-A comments here. They’re inserting new information that wasn’t even there.",
          "id": 149,
          "comments": [
            {
              "score": 29,
              "content": "Just for information, when you put your Y-T-A like you have it gets counted by the bot as an asshole vote. If you hyphen it it as above it doesn't count as an asshole vote.",
              "id": 150,
              "comments": [
                {
                  "score": 15,
                  "content": "I fixed it! Thank you!",
                  "id": 151,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Right?! Someone was trying to say it was SIL’s kitchen when it was pretty clearly a vacation home or rental of some sort.",
              "id": 152,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "And the one comment about how obviously she had batter because no one can make the correct amount of pancakes??",
              "id": 153,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 202,
          "content": "And people keep saying \"it only takes 5 minutes to make more or make more batter,\" while simultaneously acting like it would have been a terrible burden to place on niece's mom. \n\nIt's early, niece wasn't awake until they were done eating, and OP got morning sickness and couldn't cook for niece, so rightfully woke niece's mother to take care of her. I get that everyone is family here, and cooking for more than just herself and her son might have been a nice gesture -if it was something discussed beforehand, but it shouldn't just be expected that someone taking care of their own child is automatically responsible for someone else's. I have 8 niblings, and I wouldn't feed them anything without at least running it by one parent first anyway!\n\nEdit: dang autocorrect",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "Completely agree. People are forgetting that OP already has at least three people (herself, baby, toddler) on her mind at any given time. Doubt she has space to think about extended family when all three are hungry. She’s on holiday, give her a break. Definitely NTA.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "And it's totally not normal to assume a child will wake up on their own at 5am.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "I don't understand the comments \"if you make food for yourself you have to make food for everyone. It's easy to make more pancake batter\". It's also wasteful if everyone else is asleep. It's unfortunate the other kid woke up and cried, no one's denying that, but if it's so easy for op to make that kid pancakes then it's easy for that kids parents to do it too. \n\n\"Others in the house who also needed to eat breakfast.\" Want me to wipe your butt too? Damn. I'd rather you not make me pancakes cause then I'm gonna feel obligated to eat them even if I don't want to. You don't know how people like their breakfast. I personally don't eat em for breakfast cause my stomach goes straight through em and an hour later I crash hard. I need protein and fiber else I'll have a shit day. \n\nMy opinion: It would have been a nice gesture of op, but they're not the asshole for not making everyone pancakes, and calling op the asshole makes SIL the asshole.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "seriously I want to go on vacation with all of these people who apparently think it’s no big deal to cook for other people in the house WHO ARENT EVEN AWAKE 🤦‍♀️",
          "id": 158,
          "comments": [
            {
              "score": 17,
              "content": "Typically if someone makes food for me they'd come and wake me up saying \"food is ready!!\" which I HATE!!!! Let me fkn sleep on vacation. So that would be a nightmare for me and many others like me.",
              "id": 159,
              "comments": [
                {
                  "score": 6,
                  "content": "Not to mention the pressure to eat food you never asked for or wanted…",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Right I don’t even eat breakfast but when people make it I feel obligated to",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2595,
      "content": "Info:  Is this a common problem where you only do for your kid? \n\nI just don’t see why you’d not make enough pancake batter to cover everyone. Or why your husband couldn’t make a pancake for niece if you had to go lie down. \n\nIt just seems like there’s some part of the story missing.\n\nBased solely on what you put in the OP, YTA.",
      "id": 162,
      "comments": [
        {
          "score": 3386,
          "content": "Because OP and her son were the only ones up at the time? Unless she had agreed to make breakfast for everybody, why should she make enough pancake batter for everyone on the off chance that someone else would want what she was craving? Is OP the only one who can cook in that house?",
          "id": 163,
          "comments": [
            {
              "score": 836,
              "content": "It’s not like you can’t put the extra batter in the fridge to wait for everyone else to get up. \n\nYou haven’t vacationed with a bunch of little kids and relatives lately, have you? \n\nI don’t have kids and I don’t even eat breakfast (unless it’s at 10am or later) but I know that if I’m the adult who is up, I am on the hook to feed the kids.",
              "id": 164,
              "comments": [
                {
                  "score": 1741,
                  "content": "This is one of those posts that makes me feel crazy. \n\nIf you want to just feed yourself and your kid -- cereal. \n\nIf you are going to make something complicated that will also create odors that will likely have little kids waking up thinking a VERY EXCITING FOOD has been prepared, then also expect those little kids to be very upset at the uno reverse. And expect their parents to be annoyed with you. Because you have done something unnecessarily annoying and created a problem they now have to deal with.\n\nIf this story was reversed I can't imagine OP wouldn't have been feeling a bit hard done by, having to deal with her pregnancy and her kid being all wound up that there were pancakes and he didn't get to have any.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 483,
                      "content": "IKR? \n\nAnd don’t forget the “magic” of someone other than your own parent making the food. That makes it extra special. LOL\n\nI was on vacay with my fam in late summer and there were 6 little kids. As the fun auntie, you better believe they wanted me cooking for them. I was usually the only adult up early so I was pretty much a short order cook to a bunch of littles for a week. LOL",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 111,
                      "content": "Pancakes are not complicated.",
                      "id": 167,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Why would they have to be stuck with just cereal? If OP wanted pancakes she has the right to make some for herself and her child, THE ONLY PEOPLE AWAKE AT THE TIME.",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Pancakes are not complicated. For fucks sake what is wrong with you people? She got up at 5 fucking AM. Why the hell would she make for everyone on vacation when there's no way of knowing when they will be up or who will want pancakes and who won't. Pancakes take 5 minutes to mix the batter and two minutes to cook. If they want them when they get up, they can make them.",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Side bar, my mother had this candle that smelled like fresh blueberry muffins and she used to use it to wake me up when I was a teenager. I don't think I've ever forgiven her for the bamboozlement",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "> If you are going to make something complicated \n\nbro if you think making pancakes is complicated, you need to up your cooking game lol",
                      "id": 171,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Y’all are making me crazy. Can you just maybe consider some family’s operate different (and that it isn’t necessarily a bad thing) and therefore maybe this is something she’s used to doing and it genuinely did not occur to her to make food for everyone else in the house that was to her knowledge still asleep.\n\nMy family does this. I cannot eat pancakes first thing in the morning, my mother and step father can. They get pancakes and I don’t, simple concept and prevents the cook from wasting time and energy making food for someone that wouldn’t want it. \n\nNobody in my family likes cooking and when we do we usually only make something for ourselves unless we are asked. \nPeople can love pizza but maybe they don’t wanna eat it every time you want to and you shouldn’t just assume that they do. \nMy mom loves pancakes but she won’t eat them after they’ve gotten cold cause she doesn’t like them that way, therefore if step father gets up and makes them he only makes enough for him.\n\nI really don’t see how OP is being an asshole.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Yes, I’m sure standing in front of the hot stove when you’re puking is going to be very good for making a kid pancakes. OP never said she didn’t make extra batter, just not extra pancakes.",
                  "id": 173,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "How much fridge space do you have? I literally have tape holding mine closed and there’s nothing expired in it! Like if someone made pancakes at my house I would say “pour the extra batter out, no room in my fridge”\n\nIt takes less than five minutes to make pancakes from scratch. 30sec with a shake and pour mix.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It’s 5 am bro. I’m not making extra in the off chance someone else wakes up.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Why would it matter if she made more, from the post it seems the kid came down before mom so what, was the kid gonna make some. The kids just crying because there weren’t pancakes for her ready even though no one knew who would be waking up",
                  "id": 176,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 168,
              "content": "This needs to be higher up. When my family meets up somewhere on vacation unless someone specifically says they're making breakfast for everyone, the rule is you want it you make it.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "Pancake batter keeps, she could have made batter for everyone knowing people would eventually want pancakes and then everyone could have made some fresh at their convenience. It isn’t significantly more effort. Whenever we’ve done multi-family stays it’s just common courtesy to make breakfast for everyone if you’re going to make breakfast. I’m not judging this situation, just saying it’s weird to only make enough batter for two.",
              "id": 178,
              "comments": [
                {
                  "score": 169,
                  "content": "Even if there was still batter, she still was experiencing morning sickness and could not have made the pancakes for her niece. She did the right by sending the child back to her parents. She needed to take care of herself, not someone's child. \n\nThe niece's mom appears upset that her child was not made a priority over the morning sickness. \n\nNTA",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "She DIDNT know that other people would want pancakes though. Some people don’t like pancakes. Her own husband doesn’t like pancakes. She could have made a big batch of batter that just sat in the fridge the rest of the weekend and that’s wasteful. When you’re up at 5am with a hungry kid, you’re really just thinking about feeding that kid.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "> knowing people would eventually want pancakes and then everyone could have made some fresh at their convenience.\n\nDepending on what foods they have available, it might be presumptuous to assume others are going to want pancakes.  Maybe everyone wants bacon and eggs, french toast, etc.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "The pancakes still would have been cooked if she had made more batter though. She wasn't going to be able to cook them either with morning sickness.",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "OP's husband was also awake, he just didn't want any pancakes. Could've fried up a couple for his niece, though.",
              "id": 183,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Hello, this message was deleted due to Reddit's new API changes. These changes will affect the work of our Volunteer Mods and remove some of the best mobile apps for Reddit, including third-party apps that offer features lacking in the stock Reddit app.\n\nAdditionally, I chose to remove my comments in response to comments made by the Reddit CEO. Referring to dedicated volunteer mods as 'landed gentry' is inaccurate, as these individuals perform their roles without receiving any compensation from Reddit.\n\nFurthermore, I have decided to delete my comments to prevent the further monetization of my data by Reddit. Recent changes seem to prioritize profit over user experience, and this action is my way of protecting my privacy and limiting the use of my data.\n\nDeleting my comments underscores the importance of user privacy and the need for platforms to prioritize user interests and transparency. Users and volunteer mods invest their time and effort in building communities, and their trust and well-being should be paramount.",
              "id": 184,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "The dad was up too.",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 711,
          "content": "No. \n\nI only made the amount of batter I needed because I wasn't sure if the others would want pancakes as they usually woke up a lot later than me and made whatever they wanted or went out to eat when they were hungry.\n\nMy husband was showering and if he made the pancakes they probably wouldn't have been edible.",
          "id": 186,
          "comments": [
            {
              "score": 496,
              "content": "Completely reasonable. If whipping up pancakes is soooooooooo easy, then her mom could also do it for her. Morning sickness sucks. NTA at all.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 431,
              "content": "People are sure being dicks to you over this. I'm sorry. \n\nYou woke up at 5am and wanted pancakes. If they aren't going to wake up until 8-9am or even later, how are you responsible for cooking for everyone hours ahead of time, on the off chance that they also want pancakes? I'm living in the twilight zone here, I guess. \n\nIf I was your SIL, I couldn't imagine being pissed that you didn't feed my kid pancakes when you didn't think my kid would be awake, we don't typically make breakfast together, and we had never talked about it ahead of time. Jesus Christ. \n\nI stay at my inlaws with my husband's brother and his family a couple times a year. Generally, we eat whatever we want for breakfast. Once during the trip, we have a planned brunch where we are eating at a specific time. Otherwise, we just fend for ourselves. \n\nBe psychic next time, OP, I guess?",
              "id": 188,
              "comments": [
                {
                  "score": 134,
                  "content": "People are like outraged that she didn't know to make more pancakes and it is so weird. also assumed the niece was a toddler. she's 7. I was making my own pancakes 8 or 9 (I was obsessed tho so not typical). I was certainly able to compute that there were no more pancakes for the time being and comfort myself if my aunt was green around the gills.\n\nIt's an odd thing to get this intense over, reddit!",
                  "id": 189,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I have commented twice on food issues and will never do so again because I got some of the most vitriolic responses ever, where value judgements were made about me to include I couldn't possibly be in a relationship (because my standard of \"don't throw insults or name call your partner\" is unrealistically high, apparently) and hilariously, that I must not wash my legs because I said you shouldn't wash chicken before you cook it. That one still blows my mind.",
                      "id": 190,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 37,
                  "content": "Seriously. Is it because OP is a mom, and therefore expected to cater to every single kid in the household at all hours of the day, even when- no, especially when- sick? \n\nOP woke up early to eat knowing that everyone else likes to keep later hours. She then felt sick when someone woke up unexpectedly. WTF do y’all expect her to do? Martyr herself? \n\nIf pancakes are soooo easy then niece’s mom can handle it. Water, mix, boom. Vomit free, even.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Or the 7! year old could have waited for the person to not be sick, and she’d probably have made her pancakes afterwards.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Your husband can’t make pancakes ffs?",
              "id": 193,
              "comments": [
                {
                  "score": 68,
                  "content": "Apparently pouring batter onto a skillet and flipping it is too hard for him.",
                  "id": 194,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "My bf screwed up making jello once so this seems possible to me. And I screwed up Kraft Macaroni and cheese when I was 10. If someone isn’t taught to cook or just doesn’t know how it’s very easy to make mistakes with basic dishes.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Don’t keep questioning yourself or defending yourself because you didn’t do anything wrong.  You already said you were willing to make her more pancakes but that you couldn’t because you were going to be sick.  She needed supervision so you took her to her parents before you went to throw up.  If they can’t be understanding of that and are making a big deal out of something this minor, then they are the As, and need to work on themselves.  You don’t have to listen to anybody in here giving you a hard time about making extra batter or they would have done this or that.  You did what you did, had good intentions and morning sickness happened.  You sound like a nice person who is even trying to figure out where you went wrong because now you are being given a hard time.  Maybe just apologize they took it the way they did, tell them that wasn’t your intention and then don’t engage about it anymore.  It’s not worth the mental stress to you especially while you are pregnant.  You got this!!",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 304,
          "content": "It was **5AM** when OP woke up. It’s not usual to be starting breakfast at 5AM on vacation. Maybe if it was 7-8 o’clock she’d be TA but again: it. was. 5. AM.\n\nEdit: typos",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "She’s pregnant and quickly made just enough for her and her son. I disagree. NTA",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "Making a large batch of pancakes takes time, AND, lest we forget, pancakes get cold fast. If it’s 5 am and I am making pancakes, I’m just going to make enough for the moment. I’m not going to stand over the stove for 25 minutes making a large stack of pancakes. My own pancakes will be cold and the extras will likely go to waste because no one likes eating cold pancakes or pancakes that are warm but rubbery. \n\nIf I’m the parent of the little girl, I would have made sure to have some quick breakfast options if I know my child will wake up early and I’ll be sleep. That way if someone else is up in the house, they can give her something without much effort. I wouldn’t expect others to make a full spread for my child unless we were ALL eating. Family or not. \n\nCut it out and go touch grass folks saying YTA. OP, you are NTA.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "They weren’t even awake! These replies are baffling to me. Who wakes up at 5am hungry and thinks…wow the whole household will be up in 3-4 hours I better get breakfast ready for them NOW. If she was baking muffins or something intensive to make that also would keep I can imagine thinking that way. But they are pancakes. The batter takes 30 seconds to whip up and they are better hot. Like why would she be even thinking of people who are asleep, will wake up God knows when, and when they do want to eat God knows what? She could make a huge breakfast and have it totally go waste",
          "id": 200,
          "comments": [
            {
              "score": 19,
              "content": "I feel like it is a case of \"Damned if you do and damned if you don't\".  If she had made the pancakes, they would have gotten cold by the time the rest of the family came down for breakfast and someone would have complained.",
              "id": 201,
              "comments": [
                {
                  "score": 8,
                  "content": "“AITA for using all the eggs and milk in the house to make 10-people’s worth of pancake batter at 5 am, preventing anybody from having fried eggs or cereal for breakfast?”",
                  "id": 202,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "What if other people don’t want pancakes? What if more people want eggs, but there aren’t enough now because OP made pancake batter nobody wanted? Same for the milk.  It doesn’t make sense to make batter that might not be wanted using ingredients that might be needed for something else.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Why do you think she owes everyone else breakfast?",
          "id": 204,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "Why would OP make breakfast for everyone in the house?  OP made enough pancakes for the people who were awake. She is not the designated cook. And it's wrong to expect \\*\\*anyone\\*\\* to be the designated cook when on vacation.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Why would she make pancake batter for everyone when they are asleep? She can’t ask if they are going to want pancakes. Maybe they want waffles instead and then all the pancake batter gets wasted.",
          "id": 206,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2366,
      "content": "NTA. No one else was up when you started.  And secondly their child woke up and was hungry. What would they have done if you weren’t there? It’s their obligation to feed them.",
      "id": 207,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1989,
      "content": "NTA- if everyone was up when you were flipping pancakes, you would’ve made them. The SIL could’ve just made them herself.",
      "id": 208,
      "comments": [
        {
          "score": 393,
          "content": "I agree. besides if SIL woke up to bitch at OP, she could be productive and feed her own child and make them pancakes. if OP had been in charge of every child in the house, yeah, it would seem super messed up to only give her kid pancakes, but nobody else was awake but them!",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Seriously. I had 4 months of morning sickness and I could watch a commercial that made me run to the bathroom. Having a craving at 5am and getting out of bed for it(!) Then, puking off of it and being called an asshole. Wow. That's fkd up",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1405,
      "content": "Its 5 am, you didn't know. Let her mother get her butt out of bed and make her pancakes.\n\nNTA and what a weird argument.  Do people often mistake you for a servant or are they just that obnoxious?",
      "id": 211,
      "comments": [
        {
          "score": 287,
          "content": "There's a lot of people in the comment section that believe she should be",
          "id": 212,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "Fr. It would have been a nice gesture to make everyone pancakes but all these comments acting like it's not acceptable to take care of yourself without also serving everyone else are out of line.",
          "id": 213,
          "comments": [
            {
              "score": 17,
              "content": "Yeah I feel like I'm missing something. OP was sick, I'm sure they would have got some food for the niece if they weren't. Sounds like sil is just annoyed at having to get up early to deal with their own child.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 614,
      "content": "nta i guess, i wouldn't call you an asshole over it, but common... Getting up to a kitchen that smells like pancakes would make everyone want to partake...it probably wouldn't have killed you to make some extra for the people still sleeping. That's what i or anyone in my family would automaticly do tbh.\n\nedit:words",
      "id": 215,
      "comments": [
        {
          "score": 261,
          "content": "This is the sensible answer.\n\nIt is a loving and normal thing when visiting to make food for everyone. Even just extra batter that can be put aside.\n\nThis doesn't rise to AH territory, but like, out of love for your family? Because it's nice? Because you love your niece? It's like everyone's forgotten that everything is better when we help each other.",
          "id": 216,
          "comments": [
            {
              "score": 34,
              "content": ">It’s like everyone’s forgotten that everything is better when we help each other.\n\nThis is r/AITA lol. Legal and/or contractual obligation is required for someone to be helpful, otherwise NTA is the default judgment.\n\nI’m going with ESH, because confronting you and calling you selfish was pretty bold. If I were in SIL’s shoes I would probably just think to myself that it was kind of dumb that you didn’t make, what, two extra pancakes? And move on.",
              "id": 217,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "But what if they don’t want pancakes? \n\nThis is the thing with the “just be nice and thoughtful and make some extra”. They’re on vacation. They might be eating loads of snacks, lots of treats, going out for dinner, etc. \n\nIf breakfast is their one meal at home they might want to eat something lighter and more healthy. They might want to make sure their daughter is eating something lighter and more healthy. \n\nMaking extra batter is forcing them to have pancakes for breakfast or risk wasting food or having their child go into a meltdown because they want pancakes and they’re being given fruit. \n\nPancake batter is very easy to make. It takes like three minutes. They can make some if they want to.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Short sighted at worst. No where close to being an asshole though. \n\nThere are other adults that can get to and make the kid pancakes (unless she used all the batter).",
              "id": 219,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "[deleted]",
              "id": 220,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "The whole situation is a nothing burger. SIL is being dramatic",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This. Although I wouldn't say AH move but I couldn't imagine not offering anyone some breakfast any time I make some when camping or if we were on vacation.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agreed like I get that it was 5 in the morning and morning sickness sucks, but anytime I am vacationing with other people we take turns making breakfast. It seems kind of obtuse to not think that other people might want any. I am sure OP could have just made extra batter or something.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 579,
      "content": "NTA. \n\nThey can make pancakes if they want some. You didn’t know when they’d be up. You’re not obligated to feed them. \n\nWhat would they have eaten for breakfast if you hadn’t gotten up early?",
      "id": 224,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 472,
      "content": "NTA \n\nYou were up at 5am and the rest of the house was sleeping.  You aren’t a short order cook for everyone else vacationing in the house.  They want pancakes they can make them.  \n\nAs a parent with 2 kids when we go on vacations with other families it is known that you are responsible for your own child.  I would never expect for everyone to cook & feed my kids because I’m too busy sleeping in.  Do we pitch in when we can,yes we do, but we also don’t want to do someone else’s parenting.  \n\nPlus you had morning sickness after eating.  I’m sure you would have made pancakes if you didn’t feel like you were going to puke your guts out.  For people who haven’t had morning sickness take the worst hangover you’ve had and multiply it by 10.  For months, every single day.  Now think about cooking while trying not to vomit.\n\nEdit to add: why isn’t anyone telling OPs husband he’s an ass for not cooking for his niece!?!  He was up to, and not dealing with morning sickness.",
      "id": 225,
      "comments": [
        {
          "score": 119,
          "content": "Honestly! I feel like people are completely missing the  fact that it was 5am. \n\nThis isn't a situation where OP could have reasonably assumed that everyone would wake up within the next 20 minutes as it was only 5am. Why would you make food for people who won't be awake to eat it and who might not even want any?",
          "id": 226,
          "comments": [
            {
              "score": 11,
              "content": "I'm more baffled that people are getting worked up over pancakes; if OP had made something super labor intensive that the other parents couldn't make themselves then, sure;  she'd be TA for not making extra for everyone.\n\nA 10 year old can make pancakes.  It takes like 5 minutes.  It would be stupid to make extra batter or extra cakes since they don't keep well and the batter takes zero effort to make.  The girls mom could have made a couple and gone back to bed while barely disturbing her sleep cycle.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I scrolled way too far looking for this. Hubby should have offered to help niece with breakfast when OP got sick!",
          "id": 228,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}