{
  "post content": "I (53m) have a daughter (17F) who I recently bought this big storage container for that locks. The reason being our daughter has a job and likes buying her own food and snacks for herself.\n\nThe problem is that her mom invites her aunt, uncle and cousins over all the time and even since she started buying her snacks and leaving them in the pantry they'd eat them without consulting her, she's asked them many times to not eat them but they don't listen.\n\nFor reference she likes to order snacks from other countries as a way to broaden her horizons, she's also linguistically gifted and liked to try and read labels to help expand her vocabulary. These snacks can take weeks to get after she orders them again and by then her current snacks are gone.\n\nMy wife didn't do anything, saying that since our daughter kept them in the pantry they're for everyone. She moved them to her room and her cousins would go in when she wasn't and take them.\n\nI went to a hardware store and bought a big container with a lock and for extra measure I bought extra locks and drilled holes so that they could be used.\n\nOur daughter cried and thanked me because it was pretty expensive and not something she could afford.\n\nOf course the cousins went to get more snacks and threw a fit when they saw it and realized the snacks where in there. They told their parents and they told my wife and she's not happy with me, saying that our daughter should share her snacks with family and she's being selfish and will get fat.\n\nOur daughter is incredibly fit, does multiple sports and exercises all the time, she's far from unhealthy.\n\nI told my wife she could order her own and our daughter was happy to tell her where to order them but she didn't like that either and told her that the chest needs to go and that I should've consulted her on buying the bin in the first place.\n\nAITA?\n\nedit: the relatives are our daughters cousins and aunt and uncle. They are my SIL, BIL and Nephews, and SIL is my wifes sister to clear up any confusion\n\nThe pantry i also fully stocked with food, no one is going hungry and eating our daughters snacks because they have to",
  "id": 1,
  "comments": [
    {
      "score": 19921,
      "content": "Your wife is well out of line. How dare she take your daughters things?! Your daughter works for these treats, your wife has no right to steal them, and has no right to advocate her other family members steal them.\n\nAlso, the fat remark. Just, ugh.\n\nYou did the right thing. You are NTA.",
      "id": 2,
      "comments": [
        {
          "score": 6793,
          "content": "It cannot be emphasized enough how important it is that OP’s daughter has a parent like him in her corner. Especially since his wife clearly isn’t.",
          "id": 3,
          "comments": [
            {
              "score": 5504,
              "content": "Yeah.\n \nHijacking comment for OP to see this :\n\nMaybe also a lock for your daughter's room? Why are they allowing themselves in there when she is not here, thats not ok.",
              "id": 4,
              "comments": [
                {
                  "score": 1144,
                  "content": "agree 100% on the lock.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 327,
                      "content": "Right?! No boundaries.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 781,
                  "content": "That's what I'm more concered with. I will bite my tongue if parent's really can't trust their kid into puberty and keep no lock, but no lock at fucking 17, WITH family that you NEED a lock for? throw one on there too.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 651,
                      "content": "Here is the thing.\n\nAs a parent teaching and training and preparing my kids to be independent adults is a big, big, big responsibility.\n\nA piece of that is ownership and respecting boundaries.\n\nThis snack thing makes for a great ownership moment.  We can teach her boundries by demonstrating how everyone else respects hers.\n\nOh wait, that isn't happening here....neither is the ownership thing.\n\nIt is time for Dad to Dad and go to the mat for his daughter.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 139,
                      "content": "The thing is, her door MAY have a lock (most houses use a B&B lock for interior doors) you can unlock them with your finger nail. But it might be time to upgrade to a keyed doorknob for her room.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "NTA. Yeah. Sharing by force is THEFT. Taking without asking when told not to specifically is THEFT.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 394,
                  "content": "And daughter should be reimbursed for the snacks they stole. I like to order snacks from around the world and while it’s a really fun experience it doesn’t come cheap.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 174,
                      "content": "Exactly, ordering snacks from different countries is not like ordering them from your local supermarket. It's the price of the snacks plus shipping and packaging costs too and and that really adds up, especially if you choose the fast track option. \n\nPlus you also have to wait a while to get the snacks too, and I'd be livid if I had to wait a whole month for the snacks to arrive only to not be able to enjoy them because someone already ate them.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 122,
                      "content": "Of xpurse they're not cheap. That's why the mother didn't like the idea of the daughter showing her how to order her own. The mother probably also treats them as the fancy snacks that only get brought out for company or herself.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Agreed",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Do you mind sharing some of the fun things you order?",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 210,
                  "content": "Firstly: NTA.  Also:1000 times THIS.  When I was young, my younger brother helped himself to my room and things and it drove me nuts - I put a lock on the door myself... my parents insisted on having a key and my mum would let him have it anytime he liked... as an adult now with two children of my own, I hold their possessions and rooms as sacred - I constantly drill into them that they have to respect one another's privacy and belongings.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 93,
                      "content": "And.ironically, when we do this.... They don't seem to need the locks!\nRespect is f'ing MAGIC.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My sister and brother used to do this and my mother wouldn't do anything because she was never home and i pretty much raised us since 11. Then my sister would still my clothes I bought with my own money. I'd been buying my own stuff since I was 11 and baby sat. My sister was a sickly baby and could do no wrong and my brother was the youngest so the baby and his dad died when he was really young so my mother let him get away with everything. I'm 45 now and in Nov of 21 finally went no contact with all of them after my sister died and found out that I still didn't matter even this late in life. Hurts my heart but the best thing I'd ever done.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "Agree.   I was wondering why these people are even in her room??",
                  "id": 19,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Right, I can understand family is over, grab her stuff from the pantry, and mom MIGHT not want to restrict guests. But once the girl has moved it from public area to her BR??   Are they just browsing through her things to see what they might want? That’s so wrong.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Excellent add on.get a lock on her door..talk about an invasion pf privacy..you are a damn good dad but sorry to say your wife is a major ahole. Your daughter should bring her friends over and eat all the things your wife bought and see how much she likes it. I guarantee she would throw a major hissy.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Better still, daughter could take the friends over to the aunt's/cousins' place and raid their food stocks.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Her friends need to go the her mothers room and use her makeup and perfume.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "So your daughter’s cousins are entitled AH to the point they snuck into your daughter’s room SPECIFICALLY to find out where her snacks are.  They went through her things to hunt down for HER snacks that admittedly takes a long time to get to her.  \n\nGet a lock for her room.  And if you are feeling feisty with your wife, ask how did the cousins come up with the snacks were in the locked bin? Is it okay for them to go in someone else’s home and purposefully seek out something that’s hidden away by snooping? I get your wife hasn’t made your SIL and BIL hold their children accountable, but you are AMAZING in your support of your daughter.  She cried.  She cried out of sheer appreciation that someone understands her and was willing to help support her.  \n\nBut util the cousins can be held accountable to not snoop and understand No means NO…..get a lock for her door.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "In 5 years the wife will wonder why the daughter never calls or comes home.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This^ \n\nThey have no business waltzing into a 17 year old girls room and taking whatever they want, if younger cousins stumbled upon a used pad/tampon they’d be all furious about having to see it",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes I was going to suggest this too\n I'm surprised other things haven't gone missing after their visits.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 308,
              "content": "OP is a champ. I'm straight envious of people with good parents.",
              "id": 28,
              "comments": [
                {
                  "score": 94,
                  "content": "well in this case at least 1 good parent. Huzzah!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 52,
                      "content": "I’d settle for 1!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Not \"at least one\", it's exactly one, mother enables aunt's and Cousins' entitlement.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I had one terrible parent and one \"ok\" that I managed to tolerate at them. \nI'm still envy and astonishing that some people had good parents growing up.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 254,
              "content": "[removed]",
              "id": 33,
              "comments": [
                {
                  "score": 128,
                  "content": "NTA and exactly this!\n\nShe's got clear evidence her space is being invaded. Give her some more security!\n\nI grew up with an addict sister but dad was cool with me buying a lock for my door, he kept the spare key for emergencies but never let my sister or enabling mother into the room.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 34,
                      "content": "And a recording camera  in her room  with cloud  storage op. Nta",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Absolutely agree.  All of this is a huge invasion of the daughter's privacy, let alone her snacks.  NTA.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "[removed]",
              "id": 37,
              "comments": [
                {
                  "score": 11,
                  "content": "Comment stealing bot! \n\nStolen from u/EstablishmentOld9928",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "This needs to be upvoted. OP buy your daughter a deadbolt or a new doorknob with a key lock that only she has keys for. If your wife won't stop invading her privacy she doesn't get access to her things period.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Copy-pasted bot comment.",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "NTA, Indeed, why is the wife allowing relatives to blatantly go into your daughters personal space.  What an invasion to privacy!!!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "NTA and the mom sure is.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1211,
          "content": "You nailed it. It's not about the chest, it is about OP's wife showing everyone that she has complete control in her household. \n\nBetween encouraging her family to steal from her daughter and being mad that OP bought a relatively small household item for his daughter... not a nice picture being painted.",
          "id": 43,
          "comments": [
            {
              "score": 861,
              "content": ">daughter should share her snacks with family and she's being selfish and will get fat.\n\nI can say with the authority of lived experience that telling a 17yo girl that she is or will \"get fat\" by snacking, and using that as a way to take control of what she consumes away from her is a fantastic way to give someone an eating disorder.",
              "id": 44,
              "comments": [
                {
                  "score": 328,
                  "content": "Yes. Every part of this story makes me terrified for this poor girl. This is not the first conflict she has had with her mother- I wonder how much damage she sustained every other time.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 18,
                      "content": "[removed]",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Given she has such a good dad, probably not much.  Because I'm betting the dad makes a point of telling her she's not going to get fat.\n\nIf I were him, there would be a conversation with my wife and her family about why they think they have a right to my daughter's room and things she probably buys with her own money.\n\nAnd because I'm me, it would be a very loud conversation, with a \"Shut the fuck up, I'm talking\" thrown in here and there.\n\nBecause I KNOW I'm the asshole.  But sometimes you need one.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "OP this is also definitely the first time your wife tells your daughter she's going to get fat. Your wife has some serious issues and is hurting your daughter. Is your wife jealous of her or is she just a bad person?",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yup",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 502,
              "content": "You're right.\n\nPeople don't get angry about boundaries unless they're trying to cross them.\n\nThe chest is a good boundary.",
              "id": 50,
              "comments": [
                {
                  "score": 433,
                  "content": "Mom: \"If she puts them in the pantry then they're for everyone!\"    \nDaughter puts food in own room.    \nMom: \"How dare you not put then in the pantry!?\"",
                  "id": 51,
                  "comments": [
                    {
                      "score": 286,
                      "content": "And it didn't even stop the cousin's from stealing the treats anyways. They'd just go into her room when she wasn't there, according to OP. These people sound entitled AF, and seriously obnoxious.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "Start offering your wife's clothes and expensive toilette/makeup items to guests. Oh, and her shoes and books too.",
              "id": 53,
              "comments": [
                {
                  "score": 119,
                  "content": "Nah. Boy's poker night/football night and ABSOLUTELY clean out the pantry...esp. if you know her relatives will be there the next day. All snacks all gone. And continue to do this until the lesson sinks in. Your friends will appreciate all the good snacking they get, after all :) And they're yours to share as they are in the pantry and bought with family money, so go for it.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Poker and dress the boys in wife's clothes & stuff. Sounds like a hoot!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yes! She can let her friends go shopping in mom’s closet. Go to the cousin’s house and help herself to all their stuff.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "LOL\nLet them go through her underwear drawer looking for candy, etc. I bet she has a secret stash.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 381,
          "content": "I wonder if the fat remark is at the center of this...\nA. Encouraged cousins to eat her snacks so daughter would not get fat.\n\nOR\n\nB is jealous that daughter can eat snacks and not get fat.",
          "id": 58,
          "comments": [
            {
              "score": 293,
              "content": "Before my disability, I used to run. A lot. \n\nPeople would say \"you get to eat anything and never get fat\". What they forget was that I was running every day, not just for exercise, but because I was training to be an athlete.  \n\nMy mum used to comment on my weight all the time because I would eat a lot of pasta. Again, she forgot that I ran it off but no, I was just greedy. \n\nSince my disability and especially since my husband was killed in action 17 years ago, I've gained so much weight that I'm in danger of dying. So now I'm back to healthy eating and am slowly starting on working on my mobility again so I can start walking again (I also used to walk almost everywhere, for miles). But in my head I can hear my mum saying \"I told you, you would get fat\". She said that to me the last time I saw her, twenty years ago.",
              "id": 59,
              "comments": [
                {
                  "score": 140,
                  "content": "Good luck on your journey to get healthy. I am sorry your mom is still in your head. I am also.sorry about your husband's ultimate sacrifice. ♥️",
                  "id": 60,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Thank you, that's most kind. I'll get that horrible woman out somehow soon! :D",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "I had a similar experience - I was a competitive swimmer as a teenager and could eat a huge amount of food because I was training so much. Once I quit, I struggled to figure out what a healthy amount of food was for the level of exercise I was doing and ended up gaining a lot of weight. Luckily, my parents were sympathetic, but I’m still struggling to lose weight and keep it off 10 years since I quit swimming",
                  "id": 62,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yeah that's part the issue I had and then I just lost it when my husband died so I just developed binge eating disorder. I'm trying to get help with it now, but I thought while I'm waiting, I'll start making my own changes.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "[deleted]",
                  "id": 64,
                  "comments": [
                    {
                      "score": 35,
                      "content": "[deleted]",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "It's amazing isn't it? I was shocked! But now I'm going into reverse and making sure I eat good quality healthy food without depriving myself and it's working slowly but surely. Once I can start walking again I'll be so happy!",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": ">Get better. Get healthy.   \n>  \n>:)",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm so sorry all of that happened to you. Your weight does not determine who you are as a person, your strengths, your character. Congrats on your journey and deciding this is the best thing for you at this time. Just know that you are already so, so strong!",
                  "id": 68,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thank you. It's been hard but I know I have to do something. I also would LOVE to be able to walk along the river with my dog. At the moment my mobility scooter is beyond repair and I'm awaiting a new one. In the meantime I've not left the house in months. It has to end. I need my life back so I decided now is that time to grab it back with both hands!",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Sending you lots of hugs and support on your journey.  Small steps count.  You’ve got this ❤️",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 141,
              "content": "Another big thing: the cousins are male. So it could be a sexism thing to allow the 'more important' boys to steal from Op's daughter.",
              "id": 71,
              "comments": [
                {
                  "score": 84,
                  "content": "WTH are the males doing in a daughter's room to start with??? Unless they are little kids, this is a no. On the plus side, she can hide the candy in a tampon box ;) Just got a mental image of the tampons in the plastic bags being mixed in with the candy. Some candies I've seen from overseas do have a very plain thin wrapper, so a thin plastic wrapper with blue writing would not immediately stand out. Oh, the potential humor :D",
                  "id": 72,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Even if they are little kids they still shouldn't be going into OPs daughter's room without permission from her, that's her private space.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Still another thing as a lesson to the thieves of the candy and snacks is for your daughter to order a box of foreign Choco-Lax with foreign writing on it. That way the thieving cousins and other family members would get a big surprise after gorging themselves with it.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "That's a good one. I used to hide candy from siblings in my underwear drawer because i knew my siblings would never go there.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "OMG daughter needs to do this! That way if the cousins get the snacks, I’d ask IN FRONT of aunt and uncle why the boys went into a tampon box underneath the sink? Or something like that to show the level of snooping they do.  And say that’s where I put those specific snacks, did you not like the ready available snacks in the pantry? Like I’d full on make a sting out of it to embarrass the hell out of the parents (aunt/uncle). Because though they may try to gaslight the daughter (“why would you put it there”) it sounds like the OP would step in to keep on track why were the cousins snooping there?",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "And/or that thing where boys being fat or getting fat is less relevant/less of a Problem than a girl getting fat.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "Mom is maybe overweight.",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "And maybe C is that this lady is self-centered and immature and would use literally any defense to win the argument/evade responsibility.",
              "id": 79,
              "comments": [
                {
                  "score": 4,
                  "content": "That's\nno\nlady.",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 278,
          "content": "I'm really appalled at mom here. I'm not originally from the US and so I buy a lot of the snacks op describes. Things that should be $5 that you pay $30 for and then wait 6 weeks for them to arrive. I keep all my \"mom snacks\" in a separate draw, mainly so that no one else has to keep track of what's what. No one in my family would take anything from that drawer without checking. My daughter loves some wafers that I get, and at 9, limits herself to eating one because the rest are mine and they are important to me. \n\nIronically, I also found that this was LESS likely to make me gain weight because when your snacks are expensive and hard to get, you don't tend to pig out on them like you might a thing of Oreos.\n\nOp, your wife is so far out of linr that she is being shown up by a 9yo with more manners. Don't budge.",
          "id": 81,
          "comments": [
            {
              "score": 91,
              "content": "> she is being shown up by a 9yo with more manners.\n\nThis had me rolling. Tell your daughter that people think she deserves a gold star and a high 5 for being an awesome people.\n\n&#x200B;\n\nNTA OP, your wife is an absolute AH and if there are other ways that she smashes your daughter down or prioritizes her relatives over your family unit then you may have stayed in this marriage too long and if you want contact with your daughter after HS you may need to go her own way. If your daughter tells others how your wife treats her, you can bet they're telling her to go NC as soon as she can.",
              "id": 82,
              "comments": [
                {
                  "score": 6,
                  "content": "Kids are really accommodating if you tell them you value something and then share it. I’m a teacher, and I also have a weird obsession with pencils. I’ll have kids like just take pencils from my free pencil bin every day and just leave them in the hall or on the floor. But if I say— hey, I’ll let you use this, but it’s MY pencil and I value it because I ordered it from another country or I like the way it writes— I’ll ALWAYS get it back. \n\nAnyway to make this more relevant, fuck this woman. The child deserves her own fucking food. The wife is going to cause the daughter to become uncomfortable with food both with this “she’ll get fat” dialogue and also just letting people eat the child’s food if the child doesn’t get to it soon enough. I’m being hyperbolic, but this would be like a divorce hill for me.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Everyone over 6 years should have a lockbox for candy or Snacks. Voluntarily rationing candy that was recieved as a gift or like from Halloween, is a big part of developing self-control and mindfulness around eating, and that only works if kids/people actually reliably get to enjoy the reward, free from having other people's self control or lack thereof being a factor. The opposite, insecurity, cases eating disorder, which are what makes people fat, strastistically.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Also would like to add that those snacks are made with better ingredients and not full of preservatives, etc like snacks from the US. I used to get a box of snacks before Covid happened.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "And the mom didn't just take them - she told the rest of the family to help themselves. NTA",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "The \"weight\" crack is almost a red herring. Mom is outraged that she can't treat her relatives to her daughter's 'exotic', fun snacks anymore. Not sure why/how, and don't honestly care, but clearly Mom is still primarily loyal to her family of origin over her married family and actual child, which is kind of sickening.\n\nOP is NTA, but I do hope Mom doesn't just throw away the whole box because she's big-mad she's not in control...",
          "id": 87,
          "comments": [
            {
              "score": 72,
              "content": "> Not sure why/how, and don't honestly care,\n\nI've seen this enough that I have a good notion on why it is. The parent (as it usually is in these cases) simply gets moral feel-goods and a feeling of status and being seen as generous....by giving away other people's stuff. Any easy, low-cost way to present oneself as being selfless.",
              "id": 88,
              "comments": [
                {
                  "score": 42,
                  "content": "Related, some sort of reputation/\"face saving\" of being \"selfless\" could be at play. I could see this being related to the fear of getting a reputation for being selfish, and some families can be super toxic about it. (My own mom is pretty awful about it toward members of our extended family and also worried about her own reputation a lot. I wonder why...)\n\nI had to tell my mother off after she recommended a contractor, who was her friend, but she would not let me tell him all the things that he did wrong/needed to fix, or be too critical because she was too worried about the gossip he would spread at the church they both went to. (Churches!) \n\nI finally told her I was tired of her worrying more about her reputation than my well being (including the fact he used caulk instead of grout between my tiles and apparently non-waterproof backer board in the shower). Apparently she got the message and feels pretty bad about it now. Though it helps that she had other unpleasant interactions with him.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 5,
                      "content": ">Related, some sort of reputation/\"face saving\" of being \"selfless\" could be at play.\n\nTbf you could have a point. If OPs wife's family was a \"you must share everything you have with your family or you're selfish/greedy\" mentally or if SIL was the Golden Child who got her own way all the time that's a really hard mentally to break, but she must try to break it for her daughter's sake and the sake of her relationship with her daughter.\n\nIt's pretty obvious that OPs BIL and SIL have no problem with boundary stomping seeing as they encourage their son's to break into OPs daughter's room to steal her snacks and OPs wife could be very well going along with it to \"keep the peace\" aka avoid arguments and temper tantrums but by doing so she's harming her relationship with her daughter.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "this. I’d tell the wife that the box will go but from henceforth she will be referred to as The Thief. If she wants to steal her daughters snacks then she can be appropriately labeled as someone who steals. NTA",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Exactly, NTA. But, OP, that wife of yours just does not sound like a nice person. I’d have a talk with her if I were you and I’d also make sure she  (and the rest of your freeloading family) doesn’t do anything to that chest.",
          "id": 92,
          "comments": [
            {
              "score": 5,
              "content": ">she  (and the rest of ~~your~~ ***her*** freeloading family) doesn’t do anything to that chest",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Honestly it sounds like the mom doesn't even like her daughter",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also who tf let their relatives rummage through their own daughter's room? Seriously, NTA.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4454,
      "content": "NTA, seems like you did the right thing here. Let your wife buy snacks for the family she invites over!\n\n> saying that our daughter should share her snacks with family\n\nDoes this \"family\" bring snacks to share with her? Sharing works both ways.\n\n> she's being selfish and will get fat\n\nUgh. This definitely makes her TA, no way around that one.",
      "id": 96,
      "comments": [
        {
          "score": 891,
          "content": ">she's being selfish and will get fat\n\nOh dear God I hope that kid doesn't gain any weight. I can imagine how her mother would treat her",
          "id": 97,
          "comments": [
            {
              "score": 225,
              "content": "Ikr, it's so sad when mom's talk like this about their children. Thankfully OP seems to be an amazing dad, I am sure daughter will trust OP way more than she'll ever trust mom.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Right?  what a fucking awful thing to say about your own child.  This statement isn't one coming from a place of concern, its coming from a place of judgement.\n\nNot to mention that this offhanded statement was clearly about daughter \"hoarding\" snacks and not concern for her child's health.  Also, the kid isn't even hoarding snacks as an eating disorder, its clearly been established by their discussions that shes \"hoarding\" the snacks to keep others from eating things she bought herself. (note: I'm using \"hoarding\" loosely here, because this is clearly not hoarding, but the wife thinks it is because shes being a judgmental asshole.)\n\nIf wife was *actually* concerned about her daughter gaining weight, she'd talk to the daughter about healthy eating habits and help her understand the health risks.  Instead she sounds like shes just like \"you're gonna get fat and look like shit\" which I cannot overstate the toxicity and pure awfulness of talking about/to your children like this.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 195,
          "content": "Even if they did bring snacks, it doesn't sound like they would be equivalent in effort, time, or probably money to get. Overseas snacks may not always cost more, but unless there is a supplier in your country the shipping is more, plus the time for them to arrive is obviously longer than just going to the store.",
          "id": 100,
          "comments": [
            {
              "score": 67,
              "content": "Yup. I’ve been browsing an international snacks website (planning to treat myself for my birthday or something) and that stuff ain’t cheap. Like $5 for a small bag of chips. This isn’t a Kroger snack food haul, it’s more the potato chip and candy equivalent of a nice bottle of wine.",
              "id": 101,
              "comments": [
                {
                  "score": 6,
                  "content": "what’s the one you’ve been using? i’d love to check one out!",
                  "id": 102,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I’d also like to know 👀",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Right? Do these greedy, entitled relatives ever BRING snacks, or do they just come over constantly and mooch?",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Sharing does indeed go both ways. \n\nA good host allows guests to share the host's bounty. \n\nA good guest brings gifts to the host so there is balance. \n\nIt's one thing if the guests were being considerate about eating Daughter's special snack. However they are not, they are actively stealing the food.\n\nI am making a hard assumption that neither mom nor extended family are bringing Daughter gifts to thank her for sharing her special treats. Boundary enforcement is absolutely warranted.\n\nBad guests should be insulated from taking advantage of minors. Mom should order international snacks if she wants her extended family to be able to share in the experience so badly. Teaching her daughter to share is not worth teaching her daughter that boundaries don't matter.",
          "id": 105,
          "comments": [
            {
              "score": 3,
              "content": "Also, isn't 17 a bit late to be trying to teach a child to share?",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3113,
      "content": "NTA, but I would take it a step further and get a deadbolt lock for her room to lock it when she isn't there, that way the cousins can't get into her room and will have something else to complain about.",
      "id": 107,
      "comments": [
        {
          "score": 2331,
          "content": "I'll consider that, thank you for the suggestion, they've always had a nasty habit of going in her room and snooping",
          "id": 108,
          "comments": [
            {
              "score": 1455,
              "content": "It would be a good move. It would give everyone involved the message that your daughter has a right to privacy and to have her boundaries respected.  Why does your wife think it's ok to openly steal from her? Sounds abusive.",
              "id": 109,
              "comments": [
                {
                  "score": 1420,
                  "content": "I have also tried telling them all that they should respect our daughters privacy and that she works hard to buy herself snacks.\n\nMy wife is of the belief that since our daughter is \"under her roof\" she needs to share anything she buys with the family",
                  "id": 110,
                  "comments": [
                    {
                      "score": 1532,
                      "content": "Yeah, that's super abusive to disallow your daughter from having boundaries or personal possessions. It tells your daughter that others have a right to what is hers which can lead to self esteem issues and people taking advantage of her even after she moves out. This behavior from your wife needs to be stopped yesterday. This is a hill to die on.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 238,
                      "content": "So if the aunt were to go into your room and take some of your wife's clothes or beauty products, that would be fine with her, right? After all, you're supposed to share with family.\n\nI have to admit that I might have a little bias towards your daughter because I also love snacks from other countries and know what a pain it can be to obtain them! But even if it was just normal snacks - your daughter STILL shouldn't be forced to share. You're being a good dad!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 145,
                      "content": "If your daughter just stopped buying things and didn't have anything to share, would her mom feel entitled to \"share\" her paycheck? You say you're kitchens full, why is everybody so bent on those particular snacks? It's not even the same snacks ever ytime, so it's not that they just really like that particular snack. This just teaches the cousins it's okay to take what they want from family, no need to respect boundaries.\n\nGood on you for standing up for your daughter.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 75,
                      "content": "All that is going to do is to give your daughter an unhealthy relationship with food and resources where she thinks she has to use up whatever she has immediately so no one else will take it. Not a good habit to get into at all and outright dangerous later in life as she's exposed to things like alcohol and gambling.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "HER roof? So she is the primary breadwinner of the family and pays for everything? Give me a break. \n\nPlease buy a lock for your daughter’s room and make sure your wife can’t access her bank account.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "My mom did stuff like that too you should read some of mine. She thinks her daughter is an extension of herself and therefor has no rights. Your wife kinda sux.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Ohhh in that case. Daughter will likely move out at 18 and then your wife will 100% lose any control she has over the situation. She can pick her battles or lose the very big one",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Does your wife mind people going through *her* things and eating her snacks?",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "You’re wife needs to realize that as a minor your daughter is required to live with family but that doesn’t mean she doesn’t deserve privacy and autonomy. You are NTA and your wife needs to respect your daughter as not just a person but the young adult she is. Your daughter is not a 6 year old who needs to share the cookies mom and dad bought her, she’s a working teen who knows how to share and when and that she is not required to. Your wife is being very unreasonable. Thank you for sticking up for your daughter and fighting for her.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "And with that kind of attitude she will ensure that her daughter leaves as soon as possible and goes LC with her.\n\nChildren, even little ones, deserve privacy.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Not sure how old the cousins are, but nobody should be snooping in any rooms without permission. Those cousins need to be taught some boundaries, but based on what I’m hearing about your wife and her family it doesn’t sound like they know what boundaries are. \n\nAlso, I’m just re-reading that it’s your wife’s cousjns? Now I’m really curious how old they are to think it’s ok to go into a 17 year old’s room without permission.",
              "id": 121,
              "comments": [
                {
                  "score": 139,
                  "content": "I may have made some mistakes, they are my nephews and my daughters cousins, english isn't my first language and I may have worded that wrong. They are 10 and 12",
                  "id": 122,
                  "comments": [
                    {
                      "score": 68,
                      "content": "All good. I think i got confused myself as to which “her” you were referring to. You’re a good dad and NTA. You might need to have a talk with your wife before putting the lock in about how much this means to your daughter and the impact if is having on her. Being your daughter is 17, I can’t imagine this is the first time you and your wife have not seen eye to eye on parenting and family decisions?",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "You're an awesome and supportive Dad. Your wife's thinking, on the other hand, is seriously flawed. She says that when your daughter put food in the pantry, it meant that it was for everyone. What needs to happen for something to *not* be for everyone? Riiiiight... it gets put somewhere private. And when that fails due to nephews invading even that private space? A lock. And then she moved the goalposts, claiming that \\*everything\\* in the house is \\*everyone's\\*. Any \"escalation\" in your daughter being forced to protect her possessions is solely your wife's fault, since she completely failed to set any boundaries with her sister and her kids.",
              "id": 124,
              "comments": [
                {
                  "score": 3,
                  "content": "Everyone's EXCEPT the daughter's apparently, since they steal her snacks and devour them leaving her without.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Why have solid rules not been enforced over this? They are relatives but they're guests and you need to talk to their parents about this.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Really recommend that OP, you are definitely NAH and did great to stand and protect your daughter. Both your wife and her relatives decided to be AH to your daughter and they have no reason to be upset.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That infuriates me so much. My parents always taught me that it's super rude to go into someone's room unless invited. We all had locks on our doors. They were especially strict about my friends' parents' rooms. People are entitled to their privacy. \n\nMy parents were cool and trusting people. But they drilled courtesy into our heads. Shit like this should be a default.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Maybe have her start sending her snacks to you as well in case her mom wants to intercept her packages?",
              "id": 129,
              "comments": [
                {
                  "score": 15,
                  "content": "I doubt that will happen, my wife isn't a monster",
                  "id": 130,
                  "comments": [
                    {
                      "score": 56,
                      "content": "She *is* the AH here, though. You're being a bit willfully blind.",
                      "id": 131,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 50,
                      "content": "Literally abusing her child. Sorry dude she kinda is",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "If you do this only get a key for your daughter and yourself. Your wife has already proven that she can't be trusted.\n\n\n\nFor reference, my mother went into my room all the time and snooped through my shit. I don't talk to her much any more.\n\n\n\n\nGood dad.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah, absolutely not ok. She deserves privacy",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Use an electronic lock with keypad and fingerprint reader. That way your daughter can always lock her door and not have to carry a key.\n\nLet it be her choice if she wants you or her mother to have a code. These often have memory and separate codes. So, if the mother takes up to snooping and abuses her code. The daughter can check the records, know and delete the user. She’s old enough for this level of privacy.\n\nI know you may think. What about an emergency, if neither mother or I have the code? It’s a bedroom door. If this is a true emergency. They are easy to kick open.\n\nNTA\n\nAlso wouldn’t a locking storage bin just be a lockbox, chest or trunk? Depending on size and design.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Please listen to this good advice, OP. I grew up in a home without boundaries, where extended family would go and take, use, destroy things that were mine - even things brought with my own personal money. It's very disheartening to know  your privacy and property aren't respected by your family. My father never stepped in and stopped it. If he'd have let me put a keyed lock on my door, it would have meant a lot to me.",
          "id": 136,
          "comments": [
            {
              "score": 13,
              "content": "Same with me and it truly would have made all the difference in the world to me if at least one of my parents advocated for me to have any right to privacy or respect of my own personal possessions.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Also, those cousins seem like the really classy type(/s) that, when they don’t get *their* snacks that *they deserve to eat*, would then “accidentally“ break stuff in daughter’s room. “Oops!”\n\nNTA & YRD(You Rock, Dad!)",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I just commented the same thing! Nobody should be invading HER space. That's disgusting on the Moms part to allow. WTH kind of family does she have? Like has she always been like this?",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That's what I was concerned about. Mom says stuff in the pantry is for everyone. Daughter acts accordingly and puts snacks in room, signaling they are NOT for sharing. Cousins respond by invading her room. Messed up.",
          "id": 140,
          "comments": [
            {
              "score": 5,
              "content": "And apparently they constantly go into her room.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1975,
      "content": "NTA - You wife sounds like a nightmare, with no respect for others.  The cousins sound like entitled whiners.  They can buy their own snacks, if it is that important to them\n\nCONGRATULATIONS on standing up for, and showing respect for, your daughter!",
      "id": 142,
      "comments": [
        {
          "score": 595,
          "content": "So your wife believes your daughter has the right to earn money and buy things, but no right to keep anything she's paid for, no right to privacy, and no right to control what she eats or does with her own body.  What's next, pimping her out?  She's teaching her that she exists for the enjoyment of other, more important people.  At the moment she's her relatives' free snack bar; next she'll be telling her if a guy spends a lot for dinner...",
          "id": 143,
          "comments": [
            {
              "score": 80,
              "content": "😭😭😭 this hit. That’s so true…",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "You know even if I was paying for this stuff specifically for my kid, I might ask them to share, but never expect them too. But if they bought it? Heck no they can do whatever they want.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Thr audacity of everyone getting mad because they can't take advantage of her!",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Agreed. He should divorce",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I wish I had a dad like this. This warms my heart. Yes Dad! And screw the cousins!",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 463,
      "content": "NTA. Good on you for sticking up for your daughter. Why is your wife insistent on taking her things though? I think her reaction is some amount of guilt/embarrassment for having been found to be stealing from your daughter (all the excuses, that she’d get fat, that she has to share even though the goal post has now moved multiple times from her moving her snacks out of the pantry and into her room to now even in a locked box). \n\nDon’t let her throw out that box.",
      "id": 149,
      "comments": [
        {
          "score": 509,
          "content": "My wife hates spending money and is a cheapskate, the shipping prices for my daughters snacks are too much for her and she doesn't want to spend that kind of money on food. We are quite well off so expensive shipping isn't close to the end of the world for out financials but that doesn't matter to her, she's always doing this and that to save money despite us not needing to",
          "id": 150,
          "comments": [
            {
              "score": 534,
              "content": "So she’d rather steal from your daughter than pay for shipping? That’s messed up",
              "id": 151,
              "comments": [
                {
                  "score": 83,
                  "content": "this is just... like a bait post, right?\n\nsurely OP knows his wife's entire family are assholes for stealing his daughter's shit that takes weeks to arrive and costs extra money for shipping?",
                  "id": 152,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Not necessarily. I can see why you think that but sometimes when you’ve been in such a situation for so long (guessing 17 years and maybe she’s their only child) you can unintentionally become sort of numb for lack of better word to these behaviors. Posting this shows he’s just wanting to make sure he’s not in the wrong because many people can manipulate you into feeling like the bad guy. Be gentle and understand not everyone lived your life and had experiences like you. The good thing is he has his daughters back.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 136,
              "content": "Have you been paying your daughter back for the items taken or is your daughter losing both the joy of using the item she bought and the money she paid for them?",
              "id": 155,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 98,
              "content": "Your wife needs therapy. Her behavior is irrational.\n\nShe hates spending money and is punishing your daughter for what she sees as wasting money. This isn't about wanting your daughter to share. It's about wanting her to stop buying expensive snacks.",
              "id": 156,
              "comments": [
                {
                  "score": 30,
                  "content": "This needs to be higher. You hit the nail on the head. The stepping over boundaries is about exerting punishment. Punishment and control.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Therapy only works if youre honest and put in the work. Somebody more deserving could use that therapist's time slot. Op's wife sounds evil, she just needs to be cut off.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Therapy also only works if you've admitted you have a problem, and I'm not sure the OP's wife will ever do that.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "Okay, I get that she’s trying to save money. I just want to make it really super clear that your wife is abusing your daughter financially.",
              "id": 160,
              "comments": [
                {
                  "score": 4,
                  "content": "And mentally. She’s setting this poor girl up for a weird relationship with food. One with the obsession with this poor teenager’s weight and two by literally teaching this child that if she doesn’t eat the food she buys right away, someone else will.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "My mom is the same way. She can work miracles feeding a family on a hundred bucks but when the tides change she has absolutely no idea what to do with a large sum. Every conversation with her is about money and fairness when I frankly don’t care if my siblings get bought a house and I don’t. We’re all happy in our careers and are never worried about being “fair” with eachother.\n\nThe tight on spending thing makes me resent my mother. Maybe your wife should get therapy because college is coming up and you know it’ll strain her brain financially, even if it doesn’t strain your wallets.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "So, NTA obviously, but it sounds like you could just solve this whole problem by asking your daughter to double her orders, reimbursing her for half, and putting the other half in the pantry for everyone to enjoy? Seems like that would even save your daughter a bit on shipping costs if you're paying for half of it.",
              "id": 163,
              "comments": [
                {
                  "score": 5,
                  "content": "It probably would not solve the problem. The moochers would probably clean out the pantry items within a few days of it being restocked and then would be looking to get into the daughters supply.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Did your wife grow up poor?",
              "id": 165,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "But it's not her (hers and yours) money that the daughter is spending, it's her own. As your daughter matures and moves out on her own, she may decide that the expense isn't worth it and stop on her own. She might put buying overseas snacks into her budget. It's your daughters choice and not her mothers.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Can your wife give the daughter extra money to buy more of said snacks for herself to share with her side of the family? That would cut down on s+h costs then.   \n\n\nThen again, she could just buy locally and have them eat that, I don't know why she insists on taking them from her daughter, other than a power play.",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Then she's a mooch. Who's mooching off her *daughter*. That sure is some AH behavior.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "If the box gets thrown out, she gets a lock for her room",
          "id": 169,
          "comments": [
            {
              "score": 44,
              "content": "Should get a lock even if she keeps the box imo",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 428,
      "content": "NTA. Thank you for sticking up for your daughter and protecting her. Your wife is out of line. A 17-year-old should not be feeding the extended relatives. Sure, if she and her cousins are hanging out and she wants to eat a snack, she should offer them some, but they shouldn’t be raiding her pantry.",
      "id": 171,
      "comments": [
        {
          "score": 61,
          "content": "The mom sounds emotionally abusive.",
          "id": 172,
          "comments": [
            {
              "score": 24,
              "content": "The mom *is* emotionally abusive",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 203,
      "content": "NTA\n\nHoly moving the goalposts Batman, by your wife. First since it was there were in the pantry, so they are for everyone. Then she moves them to her room and has her snack stolen without repercussions. Now that she has them locked up her Mom and cousins get all verklempt. Good on ya for helping your daughter.",
      "id": 174,
      "comments": [
        {
          "score": 69,
          "content": "like what did she think she was going to do after she said \"If they are in the pantry they are for everyone\"? that seemed like a clear message of \"don't put snacks in there you if you don't want other people to eat\"",
          "id": 175,
          "comments": [
            {
              "score": 35,
              "content": "Exactly, then she gets shocked pikachu face when she moves it and tries to stop the moochers.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "\"since she kept them in the pantry they're for everyone\"\n\n*removes snacks from pantry and locks them up, indicating they are not for everyone*\n\n\"you're being selfish and will get fat\"\n\n???",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 175,
      "content": "Your daughter sounds like a fun kid!  Let me know if you want recommendations for Asian snacks - particularly if she wants to try Japanese potato chips or KitKats. If you are in the US I can send you websites where you can order them. Some are delicious others are horrifying. They are all a lot of fun!",
      "id": 178,
      "comments": [
        {
          "score": 130,
          "content": "please do, she'd love that",
          "id": 179,
          "comments": [
            {
              "score": 69,
              "content": "tell her to try snack crates. i actually went to highschool with the guy who started it. Super cool",
              "id": 180,
              "comments": [
                {
                  "score": 21,
                  "content": "My brother gets these and he enjoys it a lot",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yes @snackcrate she should definitely subscribe to this. I get it for my granddaughter and I. We love it. You get a box every month from a different country with some of their best snacks in it. It's pretty awesome. Oh and NTA btw.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Since you said English isn't your first language, I'm not sure where you live, and I don't know what countries it's in besides the U.S., but there's a Korean grocery store chain called H Mart which has a TON of Asian and European snacks and candies.  I have to limit how often I go there because I *would* actually get chubby from all the snacks there!  They have a website, not sure where they ship to but your daughter could at least get some new snack ideas from there if they don't ship that stuff to where you guys live!\n\nhttps://www.hmart.com/snacks",
              "id": 183,
              "comments": [
                {
                  "score": 20,
                  "content": "[Uwajimaya](https://www.uwajimaya.com/) is similar to H Mart and also has a ton of really awesome snacks, candies, and foods.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Ohh yea we have H Mart in Canada too and it's awesome.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Thanks for the info on HMart! Shipping isn’t bad and they have lots of new things to try!",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Here's a website for Australian Snacks! https://theaustralianfoodshop.com/",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Honestly, for some stuff you could even hit up World Market. But if she's been doing this for a while, she's probably had most of the stuff that they carry.\n\n[World Market International Food and Drink](https://www.worldmarket.com/category/food-and-drink/international-favorites.do)",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "For NZ snacks, I recommend this site. The Whittakers chocolate is the best.\n\nhttps://kiwicornerdairy.com",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Here is a good link for Japanese candy.  https://www.japancandystore.com/\nAmazon is surprisingly good for Indian snacks. My family that isnt near any large Indian grocers use Amazon:  https://www.amazon.com/indian-snacks/s?k=indian+snacks\nI’m not in the US right now and can’t find my source for potato chips but there are some wild flavors. \nI second the H-mart link someone provided below.\nI hope your daughter has a fun time. I hope you continue supporting her adventurous spirit",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Also right now with Lunar New Year around the corner lots of stores that don't normally carry specialised snacks put out asian treats. I was just at costco today and they had a whole section of asian deserts and treats. I've seen other grocery stores carry stuff around Lunar New Year too. So she may be able to stock up on some favourites without spending an arm and a leg on shipping (if it's asian snacks that she likes).",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Bokksu, from Japan, has great stuff.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Go check TokyoTreat and Sakuraco! They have the best Japanese subscription boxes <3",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "They are a lot of fun! My daughter loves doing the Japanese or Korean ones. We get a kick out of trying all the cool snacks. Some are definitely better than others. I’ve had the Kit-Kats, they were good!",
          "id": 194,
          "comments": [
            {
              "score": 6,
              "content": "I love Japanese snacks.  My favorite are the [mixed rice/seaweed arare crackers](https://www.amazon.com/Greatland-Japanese-Cracker-Arare-Snack/dp/B00LSQZVCC).  They're addictive!",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I know I'm not who you were talking to, but, could you send me the links for the kitkats and potato chips? I love trying new things from other countries and cultures.",
          "id": 196,
          "comments": [
            {
              "score": 5,
              "content": "Sure!  Here is the link I use for KitKat.  You can get pocky, pretz and all kinds of other stuff too.  https://www.japancandystore.com/\n\nI didn’t bookmark the potato chip site as I buy those more as a novelty but I will try to dig it up when I am back in the US",
              "id": 197,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 159,
      "content": "Your wife and her family need to learn to respect boundaries point blank.\n\n\nYour daughter was told if her stuff was in the pantry it was fair game so she moves it, that didn't stop her greedy cousins from boundary stomping into her bedroom to steal her snacks so you took the initiative to help her protect her stuff, kudos to you.\n\n\nYet your wife is backtracking saying the daughter must share...yeah she can go pound sand.\n\n\n\nNTA",
      "id": 198,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "NTA but your wife and her family are.\n\nWell done OP",
      "id": 199,
      "comments": [],
      "relation": "Support"
    }
  ]
}