{
  "post content": "Where I live, real estate developers have started snatching up family homes, bulldozing them and building enormous 2 million dollar houses on the plots of land. The houses also stick out horribly in terms of aesthetics – think single level brick homes with a 3-level gigantic white and black box in the middle.\n\nMy home’s been in my family for several generations. We have always been known for having a large, beautiful garden. We invited over kids to help with gardening, we gave away so many veggies, we’d hold parties, etc. It’s been a neighborhood treasure for years.\n\nUntil developers snatched up the lot next door, bulldozed and erected an enormous house that blocked out the light to most of the garden. Many of us tried to fight it with the city but everything was denied. It was heartbreaking. Our neighborhood has been changed forever. This was a link to my family and I almost have had to go through a grieving process for it.\n\nThe new owners moved in and were not welcomed warmly by people in the neighborhood. I avoided them for as long as I could, other than politely waving or nodding. It was a young couple in their early 20s.\n\nWe finally came face to face and the woman asked if we could chat. She said that they felt like maybe they’d done something wrong when they moved in, or if they aren’t pulling in their trash bins or something, being too loud, etc, because people haven’t been very friendly. The guy says that he’s surprised considering it felt like a “nice” and somewhat “affluent” neighborhood, and given the price, he was expecting friendly neighbors.\n\nI asked if they had done any research about the area. They said that they moved from California, so no. I said that maybe that was their mistake?\n\nThey said they didn’t know what I meant, so I asked if they’d ever looked in our backyard. They said yes and said they think the garden is cute.\n\nI said “Yes, the garden that now has about half less sunlight than before that house was built was a neighborhood treasure.\"\n\nThe guy said “Well it’s not our fault you built the garden there, is it?”\n\nI said “Well, you guys got what you paid for. 2 million dollars for a house that everyone in the neighborhood hates.” I said that I hoped it was worth it and wished them a nice day.\n\nWhen I told another neighbor about the exchange, she told me that she does feel bad for them moving without having any idea what they were getting themselves into.\n\nAITA for telling them that they got what they paid for?",
  "id": 1,
  "comments": [
    {
      "score": 47303,
      "content": "So you unloaded your pent up anger at the developers on the couple who unwittingly bought the house? YTA. \n\nThat couple did nothing wrong--they bought a house that was on the market. Now, if they had been the ones to buy the house/land from the previous owner, bulldoze it down, and then build their million dollar mansion, you might have a leg to stand on. But from what you say in the post, the neighborhood is taking out their frustration/anger on an innocent couple.",
      "id": 2,
      "comments": [
        {
          "score": 18389,
          "content": "Yeah but I do get why he'd be angry if instead of \"oh we're sorry, we didn't know about your garden\" they decided to go with \"it's not our fault you built your garden there\".\n\nETA: I didn't mean \"we're sorry\" as in they should apologize, I meant it the same way as you'd tell someone \"I'm sorry your cat died\". It's a statement of sympathy, not apology.",
          "id": 3,
          "comments": [
            {
              "score": 10661,
              "content": "I get why they said what they said though. It may not have been right, but OP was literally attacking them for buying the house. They were reacting to the attack. Most people don't say the right thing in those situations.",
              "id": 4,
              "comments": [
                {
                  "score": 3768,
                  "content": "This is happening in several neighborhoods around me.  On a neighborhood website (ND) someone started complaining about the developers and how big the houses were…the whole “we raised out family in 1000 sf so everyone should do that” idea.    It started with being angry at the developers but then devolved into making fun of the buyers…’they bought a $2M house but put up Ikea blinds’ kinds of things.  And they also talk about how wonderful their neighborhood is…really?  Doesn’t sound that friendly to me.  Note that these are 70 year old ramblers that were part of a giant development at the time and many haven’t been renovated since then.  And the sellers are getting top dollar plus the lots are mostly good sized so these aren’t lot line to lot line houses.  Same thought process as OP…forgetting that her house probably broke up some family farm 75 years ago when it was built.  It’s called progress and it can’t really be stopped.  I would agree if the old houses I question had architectural or historical value but most likely they don’t.  OP…YTA. And taking it out on the poor buyers…you and your neighbors…is abhorrent!  Wow…just wow!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1929,
                      "content": "A number of neighborhoods around DC had this happen, and it stinks. There should be height restrictions on new homes in an existing community. Place matters. It affects how we feel and how we behave.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 286,
                      "content": ">It’s called progress and it can’t really be stopped.\n\nUgh. I hate this attitude.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 265,
                      "content": ">It’s called progress and it can’t really be stopped.\n\nActually it's called change, and while it's true that it can't be stopped, it can absolutely be directed in a way that benefits the majority instead of a few individuals.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 171,
                      "content": "Idk if “progress” is buying up cheaper homes and replacing them with multi-million dollar ones",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Yes your right the home that came down was probably not a craftsman’s dream but I think the thing the neighbors are having a problem with is that it sticks out like a soar thumb. The developer made no attempt to try and blend in with the neighborhood. I live on the edge of Lake Michigan and this is starting to happen, problem is our lots are smaller most of the houses are 1500 square feet bungalows, so the builder builds lot line to lot line 3 stories up and very contemporary they look so out of place that they ruin the look of the street",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Pretty sure it’s only “progress” if the people affected benefit in some way and want it to happen.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It's not progress, it's development.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1259,
                  "content": "This just in: nobody likes gentrification. Not just poor people.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 253,
                      "content": "\\^ This.\n\nI wouldn't be very warm towards gentrifiers, either.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 112,
                      "content": "And nobody likes tacky McMansions except for tacky people I wouldn’t be nice to, either",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Not in the suburbs. You can’t stick a big apartment between two homes. You can put a three story home there.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1061,
                  "content": "Exactly. What was OP expecting? Them to apologize and immediately move out in shame?  The house would still be there.\n\nI'm sorry about your garden OP but it's not their fault.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 201,
                      "content": "Maybe OP expected them to tear down the house. 😂",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Also what are the chances that the neighbors just don’t like the house and are wary of gentrification, and not spilling tears over OP’s garden? So self important lol.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "And if nobody ever dared move in? It would be so much more infuriating for it to be sitting there empty.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "OP has the option of planting things that do well with less/no direct sun. Those of us in condos have been doing this for Ever.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Exactly. House ain’t going anywhere, anytime soon.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 587,
                  "content": "Yeah I saw it like this too. OP was acting hostile and sarcastic from the get go when all they did was naively ask. I would be curious about the hate we're getting too. I mean OP says that they made it a point to avoid the couple bc of how much anger they had. Meanwhile, the couple has done nothing wrong. And that's why the couple didn't let themselves get attacked for something they had no control over. I don't blame the couple, but I do OP in this case.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 69,
                      "content": "OP needs a therapist like 6 mo ago when the build was going on to learn some coping mechanisms and how to be cordial and polite under the circumstances.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "And OP went from saying they completely blocked the light, to the house covered some of the garden",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "We bought a house that had been in the same family for three generations. The owners moved to a bigger house nearby. We’ve lived in this city for >20 years, our kid goes to public school, and we volunteer in the community. When it comes time for a neighborhood meeting about something important there’s still always that guy saying we don’t belong, that we’re new here after almost a decade in our house. Attitudes like this do not build community. \nYes, gentrification sucks. It sounds like op lives in the burbs and is experiencing what one of our affluent suburbs has over the past several years. People tearing down the 70s homes and building modern. Not my aesthetic, but not illegal. And certainly they would be pissed if someone told them they couldn’t do something with “their” land",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Maybe they should direct their anger at the former neighbors that cashed in!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Avoiding people is sometimes the most courteous you can be. Neighbors could’ve asked anyone but they decided to track down and ask the people who were going out of their way not to interact? Naw there’s no call to have done that. OP answered the question, if it were me seeing those neighbors would be a constant reminder of the garden their house had ruined after it was such an integral part of OP’s life and the neighborhood, and not engaging would be a perfectly fine way of coping. Especially while I was still taking the time to work out what if anything would grow in my suddenly partially shaded garden, when before I’d had so much sun to work with! A garden takes months at minimum to bounce back from that shit.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Agree. It’s natural to respond to snark with snark.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I agree. It sounded like they started out nice and friendly but once OP let out on them they got defensive and made that garden comment.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "He simply answered their question.  They were feeling  the whole neighborhood hostility and wanted to know why. So he told them.  ????\n\nCurious why all the anger about the big house is aimed at the developer but nobody has mentioned the great neighbor who sold to a developer for extra profit.  How was that any different from the profit motivated developer who I presume did not like ve in the neighborhood.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 965,
              "content": "I am gonna guess that OP was not exactly polite in how they answered the question. I would agree with you if it did not sound like OP was blaming them in the conversation right from the start. OP's behavior was likely more \"it's your fault our garden is gone\" than, \"it's a tragedy our garden is gone\". The second one gets the \"we're sorry\" response, not the first one.",
              "id": 32,
              "comments": [
                {
                  "score": 434,
                  "content": "I'm also going to guess that the neighbor didn't actually answer in that exact manner, or became defensive as a response to OP's hostility.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 184,
                      "content": "I don't think they did either. It stuck out as a thing you put in when you realize you're looking like the AH. I could see it like dusted above though. Its your fault my garden is gone might get an it's your fault you put it there. They just wanted their neighbors to be friendly to them. I guarantee I didn't understand gentrification when I was in my 20s. I also don't know anyone who researches a neighborhood's history. Besides unless their garden was talked about in the paper or online how would anyone know that? There aren't just random stories online about neighborhoods that I'm aware",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "Yeah this is exactly what I got from this post as well.  OP felt hostility towards this young couple before they said a single word to OP.  I get why OP is angry ; this same thing is happening all over my neighborhood too. The generations old homes are being sold off one by one so new, taller, more snazzy homes can go up in their place and it's changed the whole look of our once sweet little neighborhood with the individual flower gardens and its a shame. But who do we blame? The people who bought a home in our neighborhood because they've been told it's safe, the schools are great, there's both skiing and watersports 15 mins from us? Or the people who bought our neighbors home and is flipping it for double the price? How about blaming your dear old neighbor who sold it in the first place? Surely they could see what was happening around the neighborhood and knew their property they were selling would likely end up like all the other new homes?\n\nPoint is: OP is angry at the wrong person. These new owners only bought a good home in an excellent neighborhood,  can you blame them for that? Seriously,  if you are going to be angry at anyone, be angry at your old next door neighbor for selling out.  I think it's crazy OPs neighborhood are taking their anger out at the new neighbors rather than the old ones. As soon as you see that For Sale sign go up, go speak to your neighbor and address your complaints and concerns. They can probably find buyers who aren't  going to tear the entire home down to build a metal monstrosity in its place, if the neighborhood is that hot. I think these new neighbors deserve an apology from the OP and the others who are holding them responsible for their home taking 1/2 the shade. Blame the person who initiated this process, not the ones who unwittingly bought a house in a good neighborhood that was up for sale. How were they supposed to know their house was blocking the sun from OP beloved garden? You owe them an apology OP, YTA",
                  "id": 35,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I agree there is a lot of misplaced anger by the OP and the rest of the neighborhood. Once the old houses were demolished and the new one was built, there is nothing that can be done. You can either sit there and hold your breath until you turn blue or make an attempt to make the best of it. It is not only the adults that are effected, but also the kids as they pick up on what is going on. The new neighbors kids are going to be pariahs at the school because their parents made the mistake of buying a nice house. \n\nThe gentrification of neighborhoods is a terrible. It raises the cost of rent property taxes and it raises the cost of rent among other things. Neighbors have to be proactive to make sure this does not happen. \n\nI don't envy anyone in the situation.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "That, and the couple may not have understood that their house was built quite so recently and that the garden had been there for generations.  Misunderstanding about that may have been compounded by their fairly young age.   If their house \\_had\\_ been there (or construction was underway) at the point the garden was being laid out, they would've been right in calling it a poor choice of garden location -- but the garden so far predated the house that their response was very out of touch.  They certainly weren't wrong to buy a house that was listed for sale there, nor was OP (and nor were other neighbors) right to have been annoyed with them for doing so, so my vote is YTA.  \n\nThat said:  Their house is there and not going anywhere unless OP somehow wants to buy them out and raze the place, so OP's only recourse at this point may well be to move the garden.\n\nEdit:  Added a missing word...",
                  "id": 37,
                  "comments": [
                    {
                      "score": 10,
                      "content": ">so OP's only recourse at this point may well be to move the garden.\n\nWhere? It's a three story building casting a massive shadow on their property. I doubt their land is large enough that the garden could be moved far enough to solve the issue.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Even from what they said, the issue wasn’t explained well. OP just said the house blocks their garden’s light. Not that the house was recently built by tearing down the old one and the new mansion killed half their garden due to light blockage.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 215,
              "content": "Maybe because OP came at them aggressively? \n\nLike?? \n\nOf course people are going to respond with hostility when you show them hostility first. What did you want them to do? The neighbors are being ostracized by the entire community and when they ask their neighbor *why* in an effort to fix whatever they’ve done wrong, said neighbor jumps down their throat due to a situation they had no control over? I would’ve responded like an AH too.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "If someone is being so rude to you, I don't think you have much of an obligation to be polite or diplomatic back. They didn't start throwing hands, but they gave OP exactly back the energy they gave them.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "They were probably bewildered by the accusation. Old neighbor to new neighbor \"your home blocks my garden\" new neighbor who has no idea it was a long standing garden \"well why'd you put it there?\"\n\nI feel pretty terrible for the new owners",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yeah it sounds lame the neighbor approached OP in good faith if somewhat oblivious, and it also sounds like OP came for them first so I don’t think they were out of bounds at all to give it back a little.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "How would you expect someone to react who has been shunned by an entire neighborhood for committing the horrible sin of *buying a house*? I mean, sorry, but did you expect them to be nice about it?",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I’d imagine that OP was being a little more hostile towards them than is being reflected in the post, which may have caused that defensive answer.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Somehow i doubt the quote is accurate given OP's attitude",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I feel like this more of a defensive comment than OP is letting on.\n\nThey said to their new neighbors who were trying to be friendly \"you're house is blocking our garden light. I'm holding you personally responsible, you should have (apparently) done research and realized we would hate you. It's not our fault you bought the house.\"\n\nThen the neighbors \"It's not our fault you put the garden there\" because what the hell else are they supposed to say? They moved to a new house and tried to be nice, they didn't personally bulldoze and block out their neighbors. They bought a house, and the neighbors are like \"yeah, but we don't like it. You should asked us all if personally if we would approve of you buying the house.\"",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1438,
          "content": "Eh. They bought an obnoxious house that very obviously conveyed that it wasn’t part of the surrounding community. They’re rich enough to have other options. They can’t be shocked when it causes people to form an impression of them. Instead the guy said “why’d you plant a garden there” (self-absorbed, stupid) and “we expected nice neighbors because the area is expensive” (asshole).\n\nThey didn’t decide that housing was going to be commodified in a way that tears communities apart. But I’m not torn up about them being disliked.",
          "id": 48,
          "comments": [
            {
              "score": 649,
              "content": "This. I’d be very cognizant of buy a mini mansion in a sea of normal homes. Common sense. If you don’t care? Ok, but they are the ones crying about it.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 308,
              "content": "Yeah. Saying you love the neighborhood, then buying a house that doesn’t fit the neighborhood, then expecting the neighbors to be happy you’re there and feel like you fit in … You didn’t come there to fit in. You bought a huge house because that’s what you wanted and you could afford it, and you know that’s going to keep happening until the people there now get pushed out.\n\nYou can’t expect those nice neighbors with their nice neighbors to be happy about that.",
              "id": 50,
              "comments": [
                {
                  "score": 66,
                  "content": "This is happening in my neighbourhood right now. It's a leafy suburb, with lots of wildlife and native birds. Nearly every lot has a few old growth native trees.\n\nSo... People buy in the leafy suburb, then immediately clear fell the block to build a bigger house. \n\nAs far as I can tell they want other people to provide the atmosphere. One day all the trees well be gone and they'll wonder why their property value has fallen.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That’s interesting, because it seems like they do want their neighbors to provide the atmosphere and aesthetics. They’re gonna be pissed when the entire neighborhood looks like their house. But will just go on to ruin a new neighborhood!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Subdivisions, too. Clear cut, first thing. Then build cookie cutter houses. Owners plant new trees to try to make it not look so barren.\n\nRidiculous cycle.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You’re right. Overbuilding for a lot is just obnoxious.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Our neighborhood from the late 50s/early 60s hasn’t been hit with this yet, it’s pretty much just flippers who rip out the walls and paint everything gray. Makes the painted brick exteriors both hideous and causes maintenance issues, but doesn’t change the footprints of the homes. But nearby neighborhoods that are a little older and have smaller houses on larger lots are being absolutely destroyed. “Oh look! What a quaint neighborhood! I love it! Let’s build a hideous modern barn box over the entire lot (who needs a yard?) and completely destroy the aesthetic of the neighborhood!”",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Exactly.\n\nI don't know why people are saying OP 'attacked' these people. They asked and they got an answer they didn't like and then proceeded to make that stupid comment.\n\nIf they didn't want the truth, they shouldn't have asked.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "The expecting nice neighbors because it's an expensive area thing is such bull, too. My job requires visiting people's homes and I always feel judged and looked down on in fancy neighborhoods",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I find it funny that he thought that higher priced neighborhood ment nice neighbors. I've lived in million dollar subdivisions and they are the most obnoxious people I've met.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "EXACTLY. Thank you. How could they have viewed the house before the buy and not understood that people wouldn’t like whoever bought that house? “Why’d you plant a garden there” to a guy living in a 70 year old house when you live in a huge new one blocking the light, I mean is this Ralph from the Simpsons, all grown up?",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I can’t even wrap my head around a couple in their 20’s being able to afford it. No way they paid for it themselves, and no way they have any clue what life is like for the 99%",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "You know, I was gonna say I totally understand OP's frustration but it's not the neighbor's fault, they just bought the house. But then I thought about it a bit more, and in a way, it IS the neighbor's fault. Because these developers who bulldoze cute, affordable houses to build ugly mansions that ruin nice, average neighborhoods are only able to get away with it BECAUSE people like the neighbor are willing to buy them. If there wasn't a demand for awful ostentatious houses they wouldn't be built. If people like the new neighbors put more consideration not just into the house itself, but the neighborhood dynamic, and chose to buy houses that suited the neighborhood rather than obvious money-grab house flips, this wouldn't happen nearly as much. It's actually a pretty significant thing where wealthy people COULD make a difference with how they choose to spend their wealth if they actually wanted to.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 319,
          "content": "I don’t really get what OP and the other neighbors are doing wrong though? Like okay say that I agree with the people who bought the place have done nothing wrong, what have the rest of the neighbors done aside from being “not very friendly”? What does not very friendly mean? Because that doesn’t suggest outright hostility, just that people don’t wanna associate with them. They aren’t entitled to their neighbors being their friends especially considering the circumstances. They asked a question, OP answered that they should have done research. When you move somewhere you SHOULD do research into that place. Especially if you’re sinking 2mil into it. OP explained about the garden and how that is the reason for the lack of friendliness, which is an answer to the question they asked. They then got rude at the answer to their question. I don’t get how that’s OPs problem? And I don’t agree that the people that bought the house did nothing wrong because in order for gentrification to work someone has to buy. They are contributing to gentrification which has and continues to demolish communities.",
          "id": 62,
          "comments": [
            {
              "score": 222,
              "content": "Obviously they're doing something to make the new couple feel unwelcome or ostracized if they sought out OP to specifically ask if they had done something wrong. Granted the garden response was not the best, but the neighbors have no idea when OP put his garden in. \n\nAs for OP's statement that the couple \"should have researched\" before buying the house, what kind of research should they have done exactly? I doubt OP's garden is so well known that it would show up on an internet search.",
              "id": 63,
              "comments": [
                {
                  "score": 147,
                  "content": "See the difference in the houses in the area and realize that gentrification is happening? Talk to the neighbors? Google the neighborhood to see if there’s anything in the news about it since OPs complaints went up to city level so there likely is an article in the local paper about it? And I don’t get the impression that there is hostility. Just that they’re maybe being cold? I think automatically expecting your neighbors to be warm and welcoming is strange but I also never had neighbors that did more than that little nod hand wave thing so maybe it’s a cultural difference or something.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 75,
                      "content": "This happens. It happens everywhere. For all they knew, it was a falling down shack before a developer built a modern house on it.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "If this was several years ago, I would agree.  But the housing market is insane right now.  In my neighborhood, houses sell within a week - a few have sold within hours.  Maybe the couple didn't have time to do that kind of research.\n\nAlso, OP doesn't specify how many houses were torn down and replaced with McMansions.  My best friend lives in a neighborhood like OP describes and while her house is original, almost half her neighbors aren't.  So maybe the couple saw that several houses were replaced and reasonably didn't think it would be a big deal.\n\nAlso, I doubt it made the local paper.  It seems like it was just OP running to the city to complain.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Yeah. OP is mad at the wrong people. Their anger should be directed at the municipality that is allowing this. \n\nThis started to happen in areas where I live, buy up \"starter homes\" for the land, bulldoze and then build mini manisons that don't fit the rest of the neighborhood, until the county realized that it was driving up home prices and people couldn't afford to live the county, so they were moving out. Now, your house has to be condemned by the county and it has to fit the overall aesthetic of the neighborhood.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Fair but I will add that this couple is a bit naive to think they'd be welcomed warmly after buying a home that is changing the anesthetics of the neighborhood and increasing property taxes for neighborhood.\nYou have to really have your head up your butt to not know that people get heated over this and don't want to be friends with the people buying these houses.\nI live in a former small town that is being developed and the original Townies hate the newbies and blame everything on them.  I can see both sides but there's a huge us vs them mentality.",
          "id": 68,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Nah fuck em",
          "id": 69,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Neighbor and people like them create the demand for those houses. Without that demand, they don’t get built. Screw them.",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "No. They asked. OP answered. They just didn't like the answer. That's not unloading. \n\nAnd yes, they bought the house. Along with the house, they intentionally bought the negative feedback. They could have done any research, talked to a neighbor, etc. They didn't. Their lack of preparedness is not OP's fault. \n\nAnd they still think their neighbors should love them by default.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "As someone who made money in California and then moved somewhere cheaper, I'm a version of the neighbors. But OP is right, the demand created by the buyers is what caused the bulldozing. You can't buy a knife with a handle made of rhino horn and claim that it's a perfectly fine thing to do because you're not the one who shot the rhino.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "They may not have built that house, but they are the owners.  There is something in being able to read the room, and if you are looking at a house in a neighborhood that is the new monstrosity that is 3x larger than all of the other houses in the area, you need to realize you might not be welcomed with open arms, as the neighbors probably aren't happy about it.  \n\n\nAnd in the end, houses like this are built because people like them will buy them, so they do share some of the blame.",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19389,
      "content": "YTA. They just bought a house. \n\n\"did you research the neighbourhood\" Is your garden a big thing so well known it's in papers?? That people could know about it without having talks with the neighbours before moving in. And specific talks.\n\nAnd even then, they did not design the house. Just bought it. It is not their fault, and you are being angry at them as if it is.",
      "id": 74,
      "comments": [
        {
          "score": 5037,
          "content": "Even if they researched, it’s not like the house being on the market or someone else buying the house would have changed the fact that the house existed. No matter who bought the house, or if it sat empty it was blocking the garden.",
          "id": 75,
          "comments": [
            {
              "score": 4643,
              "content": "Imagine researching houses with the keyword “does not block a garden said to be a neighborhood treasure”…",
              "id": 76,
              "comments": [
                {
                  "score": 2151,
                  "content": "I rolled my eyes so hard at this comment on researching the neighbourhood. Like, I was rolling my eyes a little at OP describing their own house as a neighbourhood treasure (I'm *so* sure your neighbours treasure your garden) but then when it got to researching the neighbourhood it was clear how obnoxious OP was being. Are there tribute sites to your garden or something? Where were the neighbours going to come up with this information in their 'research'?\n\nBasically, this is OP punishing an innocent couple who were probably really excited to move to a nice neighbourhood only to find out their neighbours are AHs.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 713,
                      "content": "The number of fucks any the neighbours give about the added shadow in OP's garden: 0\n\nThe number of times any the neighbours have referred to OP's garden as the neighbourhood treasure: also 0",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 233,
                      "content": "I feel that. \n\nNow live in a red state where people complained everyone moving from CA and people in sub Reddit will tell people who are interested to move in go back to your state. \n\nExactly like OP’s attitude. No wonder this city  feels so old and won’t attract young folks.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Those people are the AH its not the couples fault that their neighbours are people like that they brought the house with their hard earned money in one one its better they don't talk with people like that",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Right? It was so cringey how she could call her house a \"neighborhood treasure.\" Like, really? Just because you have a nice garden doesn't mean the entire neighborhood treasures your house. Rolled my eyes so hard I saw the back of my head.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I live in the Midwest, specifically Nebraska, and one of the things that draws east or west coast \"money\" here is the stereotype of how friendly we are. It is true that Midwesterners for the most part are extremely friendly and helpful. That being said, holding grudges is a house specialty here. This couple didn't do anything wrong. I've also lived in California and neighbor interaction is very rare there as another commenter said. This couple probably did check out the neighborhood, but it's possible that the current neighbors didn't realize that they were the prospective homeowners and treated them wonderfully. So they thought that was the neighborhood for them, they buy the house, they move in, and...they are completely ostracized. YTA, OP. They are not at fault for buying a house and then reacting to your hostility with hostility. They are new and asking why you would plant a garden in the shade is a perfectly reasonable question when they don't know how long the garden has been there.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": ">this is OP punishing an innocent couple who were probably really excited to move to a nice neighbourhood only to find out their neighbours are AHs.\n\nThe neighborhood is full of AH's because they hate Californians, and has nothing to do with OP's \"special garden\". Almost everyone in the rest of the country (mostly Midwest) complains about \"Californians moving into their area, and ruining it for us\". Colorado is famous for complaining about it, Texas if famous for it, Florida, Illinois, and many others. \n\nSo yea, that's why the neighborhood hates this new couple. Their new house does suck by comparison, but it's mostly where they're from.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Also shade gardens exist.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "\"said to be a neighborhood treasure by the owner\"    \n\nI bet the rest of the neighborhood is sick of hearing about the garden.",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "I mean that was the first filter I used when starting my house search!",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "We bought sight unseen. We knew nothing about our neighbors.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Fool! You should CLEARLY have polled your neighbours and checked they were happy with the design of your home first!",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "ive lived here 5 years and still don’t",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Yeah, I checked that box in Zillow every time I look for a house. It’s right below the box, “No one with a YTA designation in a three block radius.” Clearly I’m not buying OP’s neighbor’s house any time soon.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "OP came in hot with the sarcastic “DID YOU LOOK IN MY BACKYARD TO SEE WHAT WAS THERE” as if their yard is the dealbreaker for the couple to buy the house, so I can understand why he responded in kind.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yaah this is a real case of “old man yells at cloud”",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly, someone would have bought it, so why be mad at the people that did buy it? Also, as someone else pointed out, it was the developer that built that house on that lot.\n\nOp probably wouldn’t be happy unless the couple bought the house, tore it down, then built the same house that was there before…",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Builders build what sells, if gaudy, 3 story monstrosities build in older neighborhoods didn't sell, or took longer to sell, the developers would stop building them.\n\nIs that really so hard to understand?",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 843,
          "content": "I suspect that \"research the neighborhood\" is more about how the giant house sticks out and may cause issues (like the light) not about the garden, specifically, being famous",
          "id": 95,
          "comments": [
            {
              "score": 617,
              "content": "Meh, having lived in exactly that kind of neighborhood, if they did their research they'll know their house price will go way up as more tiny houses get torn down and more $2m houses get built.\n\nIt broke my heart to sell because I knew my beloved house and rose bush were going to be razed ... but it's just the way it is. It's not the buyer's fault and all the passive aggressiveness in the world won't change that.",
              "id": 96,
              "comments": [
                {
                  "score": 609,
                  "content": "But then they can’t complain that the attitude of the residents in the older tinier homes aren’t nice because if they did their research, they know that their home is part of a long term plan to price all the nice people in the neighborhood out of their homes.\n\nYou can’t expect a neighborhood to maintain its character when you are actively contributing to changing its landscape and demographics.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 127,
                      "content": "Exactly. No, they didn't build the house, but it's entirely to be expected that the people who've been living there for upwards of several generations aren't going to be their best friends.\n\nOn a broader scale, the reason neighborhoods get gentrified and hideous multi-million dollar homes get put up is because people buy them. That couple may not single-handedly be the reason neighborhoods get ruined and people get driven out of their homes, but they're absolutely part of the problem, and if they can afford a $2 million house, they can also afford to live somewhere else.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I mean…you could have sold to someone who wanted to live in the house.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That would imply someone wanted it. We didn't even have a single person look at it who wasn't planning to tear it down. I don't think there was a house sold in the neighborhood that wasn't torn down for 2-3 years before we left.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I mean, it is not directly the buyers fault. But the truth is that if buyers like them didn't exist, the developers wouldn't be doing what they're doing.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yup. It sounds like OP’s neighborhood is in the middle of gentrification and the gentrifiers can’t figure out why people aren’t happy about them moving in.\n\nYou have to be pretty out of touch to not foresee that.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah I think OP is the asshole but the researching part kind of makes sense. I saw an amazing house when I was looking that was newly built on a lot. The house was built all the way along the edges of the lot with a super cool courtyard garden in the middle. Would have been perfect to let the kitties out safely, and the house was absolutely gorgeous. However, it was in a historic neighborhood and because it had been built all the way along the edges of the lot, the neighbors on all three sides were now basically looking at a huge two-story wall without windows. \n\nI would have loved to live in that house, and I still think about it years later, but I did not make an offer on it because I suspected every neighbor around us would detest us for the way the house was built.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Man, I’m researching how to buy a 2 million dollar home in your early 20s. 😳",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 601,
          "content": "In all honesty, it seems likely that OP is playing up the 'neighborhood treasure' aspect a bit much to try and elicit sympathy. Honestly, what kind of 'research' could they even have been talking about? Polls on residents' like/dislike of McMansions?\n\nSeems far more likely the conversation was just them being hostile and expressing anger at the sun blockage.\n\nEither way it's either YTA or NAH. I also don't like houses like that. But the fact is she doesn't personally set zoning laws, but she also doesn't have to like the interloper... She may be understandably angry, but she's still not being nice. I'd be interested to hear how she plans to treat people who may move in later if the house is sold again.",
          "id": 105,
          "comments": [
            {
              "score": 41,
              "content": "I think the definition of McMansion differs a lot too - I can imagine my grandparents calling my house a McMansion.",
              "id": 106,
              "comments": [
                {
                  "score": 17,
                  "content": "OP's description makes me think it isn't even really a McMansion, probably just a more modern design.",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "I think they’re also playing up the “well it’s not our fault you built the garden there, is it?” There’s practically nothing that sounds less natural there. Nice neighbor asking if they accidentally offended someone all of a sudden does an about face and says something nonsensical…. Sounds pretty made up.",
              "id": 108,
              "comments": [
                {
                  "score": 17,
                  "content": "I can see that actually, they went up to try to talk to one of their neighbors in a conciliatory manner and got ripped into over something that wouldn't be their fault in any reasonable way and got flustered.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah, but the natural retort would be something along the lines of “we just moved here” or “we didn’t build it, we just needed somewhere to live” not the thoroughly silly and hackle raising suggestion that the other people put their garden in the wrong place. It sounds fake af bc nobody would say *that,* not because nobody would defend themselves in that position.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "They are probably playing up the “neighborhood treasure” aspect but they are definitely playing up the ages of the new neighbors. OP says the new neighbors are “early 20’s” which just doesn’t make sense at all. Based on the snippet of information we are provided, they seem congenial and mature. If they truly were in their early 20’s, they must come from very wealthy backgrounds. Sure, they might be nice, rich, 24 year olds. But it’s more likely they are nice, well-off 30 year olds, and OP is exaggerating to make a point.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Focus group with neighbors to gauge if they hate you already is required before house purchase /s",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "> In all honesty, it seems likely that OP is playing up the 'neighborhood treasure' aspect a bit much to try and elicit sympathy. Honestly, what kind of 'research' could they even have been talking about? Polls on residents' like/dislike of McMansions?\n\nThere are comments suggesting they should be doing research on NextDoor and local (probably nonexistent or dead) subreddits.",
              "id": 113,
              "comments": [
                {
                  "score": 4,
                  "content": ">doing research on NextDoor\n\nSo they can hear about the \"sketchy youth\" who walked through the neighborhood last week, the highschoolers who drive too fast (above 12mph) through the neighborhood, and how the HOA should really do something about that dead patch of grass in the park by the neighborhood entrance?",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 85,
          "content": "But but iT’S a NeiGhBoRhooD tReaSuRe!",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Yes like what what the couple have found if they researched the neighborhood? The house would still have been there regardless of who bought it. Better that someone actually live there than for it to be an empty house that still obscures the garden. Also, OP points fingers at them like the garden is their fault. Did OP research? I'm sure they would have found that the developers have every right to build the house they want there. Everyone has the right to buy the lot next door and deconstruct/construct what they want as long as it's within city codes. It appears as though it was because it was approved. So it's not like OP was robbed of something. Op is mad about the fly above space. That is something Op has no right over as unfair as that may seem to the OP. But had the OP researched it they could accept it and move on. I'm sure that there are probably other places to put the garden. I don't think it would be physically possible to block the entire sunshine from all of your property. \n\n**YTA**",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I don’t even know what research OP expected them to do… I work in real estate and it’s not like agents are giving personal neighborhood descriptions. \n\nOP YTA, it’s not their fault they purchased a house in a bitter neighborhood.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yeah all this “neighbourhood treasure” - I think this may be somewhat over built up. I can’t imagine OP went in nicely-nicely.",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Fun fact, though not super relevant: my great-grandparents’ house/garden was in a weekend spread of both the San Francisco Chronicle and Sunset Magazine. They were something else. \n\nThey, however, wouldn’t have been rude to neighbors.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Clearly never worked a job where you come into the office to be told, ‘we’re closing this studio. If you want your job we will be relocating you to (fill in the blank). You have 3 weeks to be there and at the office.’",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "even if OP meant for the research comment to be about how the houses in the neighborhood that haven’t been torn down and renovated aren’t as “affluent” as the people living in $2m homes would be, that’s still not something you can always tell from looking at google maps!\n\ni grew up in an affluent area. i had friends who lived in 3 bed 2 bath single story houses and owned two vacation homes. i had friends who rented similar homes and lived paycheck to paycheck.\n\nyou can’t figure that shit out through “research,” OP.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13830,
      "content": "YTA, but you don’t have to be. You can fix this pretty easily. Make a pie, or buy a small housewarming gift, and bring it to your neighbor. Tell them, “You know, we fought against the builder who built your home, and it broke my heart when my garden lost its sunlight, but neither of those things are your fault. I should have been a better neighbor, and I’d like to fix that going forward.” And then tell your other neighbors that the new neighbors are perfectly nice, and that you apologized for the way you treated them.",
      "id": 122,
      "comments": [
        {
          "score": 1837,
          "content": "Such an awesome way to turn this around. You are a great dude for this suggestion.\n\nOP, they are your neighbor. They wanted to move, saw a house they liked in a neighborhood they liked, and bought it. Your anger is directed at the wrong people. From your description of the conversation, she seems very pleasant and friendly.\n\nWhether you like it or not, this is your neighbor. You would both be happier if you can be accept them and be a kind person. \n\nThere is so much change that happens in the world and we have so little control over much of it. Hell, my city has changed dramatically in the last 20 years. It’s better to accept change that you cannot control and learn to adjust with it. You’ll just make yourself and the people around you miserable if you get angry over the things you can’t control and direct your anger at the people who didn’t cause the change in the first place.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 357,
          "content": "I’ve seen The Help. I would not be eating that pie.\n\nSome non-edible housewarming gift would be appreciated, though.\n\nLol",
          "id": 124,
          "comments": [
            {
              "score": 39,
              "content": "Eat. My. Shit.",
              "id": 125,
              "comments": [
                {
                  "score": 71,
                  "content": "Omg. The notification popped up that someone replied to one of my comments and it showed me your comment. All I could think was, “what the heck did I say that someone is saying this to me?“\n\nI completely forgot about this comment here. Lol",
                  "id": 126,
                  "comments": [
                    {
                      "score": 16,
                      "content": "😂😂😂",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Ha, yep. I reported a neighbor whose unleashed dog bit me unprovoked (you’re required to report dog bites here and the laws favor the dogs over the owners, so I knew it wouldn’t have a negative consequence for the dog - it just got her a visit from the city). Anyway, she brought me dessert after that. Not after her dog bit me mind you, just after she found out I had reported the dog bite (and she was there when it happened).\n\nI didn’t eat it. It sounded really good though so I was tempted lol.",
              "id": 128,
              "comments": [
                {
                  "score": 8,
                  "content": "It would have been fine. I’m sure she used dog poop, not her own. No problems there!",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "I can only imagine a big cake with the letters spelling “sorry” on it. But I assume the OP will remain salty about this and will never apologise",
          "id": 130,
          "comments": [
            {
              "score": 8,
              "content": "She’s probably really mad at everyone on this post calling her TA. She’s now making a NEW post about it… AITA for being told I’m am TA for being an AH? Hahahahahaaaaa",
              "id": 131,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Why? Seriously? Why is it on OP to make nice with a bunch of people who at best don’t give a fuck about being gentrifiers? I absolutely do not understand the logic here.",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Also--as a gardener--there are LOTS of shade-loving plants you can grow? Your garden might have to change, but it could still be as big and productive as ever. Shade isn't the end of the world!",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6296,
      "content": "YTA you are mad at the situation and taking it out on the wrong people. They didn’t explicitly chose to give your garden less sunlight, the previous owner of the land chose to maximize his profit.",
      "id": 134,
      "comments": [
        {
          "score": 32,
          "content": "Yess. Profit always comes first for certain people",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5872,
      "content": "YTA I've seen a lot of NIMBY type folks on reddit but you take the cake today due to treating people like crap because they apparently stole your sunlight and you are big mad about it. These people likely had no idea about your garden or what was there prior to the house they bought being there, its not their fault the house was built there. You wanna be mad be mad at the real estate developers, that's the actual bad guy here not the people who bought the  house.",
      "id": 136,
      "comments": [
        {
          "score": 1403,
          "content": "Okay, but people from places like California moving to places that are smaller and cheaper building houses like this really is fucking up the market in some states.",
          "id": 137,
          "comments": [
            {
              "score": 2082,
              "content": "So? That has zero to do with why this OP is mad. What you described is happening everywhere, these new neighbors are not assholes for simply moving to a different place.",
              "id": 138,
              "comments": [
                {
                  "score": 998,
                  "content": "He is mad because developers are messing up the neighborhood. They can do that because people buy these houses up at prices locals can’t afford. Eventually they will be driven out. If you’re going to move somewhere do the research before you do.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 1455,
                      "content": "literally none of that is what this OP is mad about. They are mad that this random couple moved into a house SOMEONE ELSE built because it blocks the OP's sun. I don't disagree with your points but that's not what this post is about.",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1080,
                      "content": "You know why those people are moving to those communities? Because they're being driven out of their neighbourhoods already. \n\nThey're not causing the problem, they're already victims of it and a symptom of the bigger issue.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 328,
                      "content": "OP lives in such a close knit community that her neighbor, likely one of many, sold out for massive paydays from a developer, and thinks it’s not AH behavior for them and others in the neighborhood to shun and hate people they don’t even know? \n\nIt sounds like OP is pissed at their neighbor for selling out, and is now taking it out on anyone they can “justify”focusing that rage on. Mental gymnastics to hate people you know nothing about. \n\nOP’s attitude and entitlement are worse for the neighborhood then the neighbors new house.",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": ">because people buy these houses up at prices locals can’t afford. \n\nAnd that's probably the reason why OP's neighbors moved there in the first place - they probably couldn't afford the house that they want in their old neighborhood. You can't blame people for wanting to live in a particular location.",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "They can also do this because people are fleeing areas of the world experiencing the effects of climate crisis. I don't blame any Californian for wanting to leave wildfires behind anymore than I blame the wave of Americans who have fled to my country looking to escape American politics. Is it contributing to a massive housing crisis and some ugly developments?! Sure is! Am I gonna chew out my super kind, lovely new Texan neighbor about it tho? Hell no!",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "And how is that the new homeowners fault? They didn’t build the home.",
                      "id": 145,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "This is nonsensical. How will OP be driven out of a house that is likely owned free and clear as he states it’s been in the family for generations. What the Californians are doing is driving up his equity, so that he can sell, move to a cheaper area where he can piss of the existing neighborhood. Nimby is alive and well.",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Actually they do it because the town planning board allows it. People can’t build what isn’t legal. We have these discussions literally every day in my town because this is happening all over the town. Developers are going to push boundaries and they are going to try to get every penny they can from a deal, the town planning board Or whatever it’s called in your town exist to define the community planning standards. And in this community the OP lives in, the town has decided that this new building is OK. The anger should start with the town.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "“do the research before you do” I’m sorry but imo that sounds like a through away line from the type of person who validates “facts” from watching hours of conspiracy youtube “documentaries” as “research”…\n\nWhat do you even mean by that in this instance? The only research a prospective home owner should be making is into the affordability financially, structural survey into the property and a personal assessment/judgement on the area being safe in balance to what they can afford.\n\nBuying a home in this economy, in any country, is a nightmare due to the price escalation from decades of extortionate practises in real estate (and economy in general). \n\nTo suggest that on top of all the elements juggled that a prospective buyer of a property should some how conduct wide ranging personal interviewers from a wide range of local residents to gauge their potential opinions of a) the property’s social standing in the community and b) what it would mean emotionally to them if you (or anyone) bought the house is well, quite frankly, insane!\n\nPeople’s sense of entitlement to areas outside of the boundaries in the deeds to their own property is astonishing at times.\n\nIn this instance I sympathise with with OP, blocking sunlight from an outside space is frustrating, but that displeasure is for the planning authorities that ignored/over ruled the objections and no one else.\n\nI totally agree with outrage at housing developers in general milking the market, or to any constructors of buildings that degrade the area. Sometimes though personal opinions are mistakenly held/presented as some sort of regional view point. Local planning authorities can really drop the ball at times and other times some individuals can really get their knickers in a twist on evolving aesthetics fixed from solely their view point/taste.\n\nBut to extend unpleasant behaviour away from the developer/authorities onto new owners, purely because they exist and purchased the property, is bonkers.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "so we should shun our new neighbors because.. they can afford the nicer houses than us?",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 434,
              "content": "News flash, all those people moving to California during the dot com era really fucked up the market in the bay area and beyond.   That is when home prices started skyrocketing and why people are looking for reasonable housing elsewhere.  The door to California opens in both directions.",
              "id": 150,
              "comments": [
                {
                  "score": 31,
                  "content": "People have been coming to California - and people complaining about the absurdity of California real estate prices - for decades prior.  That only strengthens your general point, but it's worthy to note that it long predated the 90s.\n\nI was pretty sure OP was a xenophobe before that comment, but the comment seals it... and makes me wonder about the ethnicity of everyone involved.",
                  "id": 151,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "People move to smaller towns because they cannot afford anything in the big city. In my city to buy a detached home u need 2-3 million. Who has that kind of money??!",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This! I am a Bay Area native and it’s not the people born and raised in the bay who drove up the price, it’s all the transplants. Many people that are in the bay now are not locals",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's not just California, the same thing is happening in Boston.     Also, it's not all of CA.  If you only want one of the big coastal cities, yes, but in the eastern parts of the state, it's not nearly as bad.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 424,
              "content": "So people who can’t afford to own in California should be stuck renting forever and never own? If they can’t afford to live in California good on them for finding a solution that works for them.",
              "id": 155,
              "comments": [
                {
                  "score": 483,
                  "content": "apparently those of us from CA should just be homeless, god forbid a Californian move elsewhere and gentrify the place with their mere presence.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 100,
                      "content": "No no no, you are using the wrong angle.\n\nCA folks cant leave unless our governor puts us on a plane.\n\nOnce the governor ships us to states with opposite politics its justified.",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "You know, people are so mad about it, that when I’m out of state, I’ll meet people for the first time and tell them I’m from California that’s the first thing they say. How much they hate Californians moving to wherever they are. The last time was at a funeral!! The number one thing my husbands extended family had to say to me upon meeting me for the first time? How terrible Californians are for messing up the markets. I STILL live in California! Im not the one messing them up!!",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Exactly why we left our beach town. Landlady decided to move her kids into the place we were renting, and we didn’t have time to save up and find anything else.  We were paying $2,000 for PART of a house 2010.  We didn’t make $6,000.  We had 30 days to be out, and ended up homeless for three years.  We ended up in Oregon, and then Washington, and got on our feet and bought a house in 2016.  We’re blamed for the prices going us, but the thing is, we needed somewhere to live too.  We lived in a vehicle for a few years, with a very young child who still deals with trauma.  There are people who would prefer our daughter to still be homeless than for us to have left California.",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "I mean if we're not allowed to be racist anymore we have to be xenophobic *somehow*. /s",
                  "id": 160,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I promise the people who can’t afford to buy a house in California are not the ones buying 2 million dollar homes in newly gentrifying communities.\n\nThese are people that could afford to own in CA and probably did, sold it, and used that money to buy elsewhere. The kind of step up that would NEVER happen to someone who grew up somewhere cheaper.",
                  "id": 161,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 407,
              "content": "Everyone is mad that people from California are moving to other states when in fact it’s because so many other people from different states flocked to California and drove the cost of living to an insane amount. All of a sudden they don’t want people moving to their states but had no issue with everyone moving to California to begin with.",
              "id": 162,
              "comments": [
                {
                  "score": 86,
                  "content": "This is so true. I’m from the Bay Area, and so many of my friends are from out of state (or from out of the country) and work in tech. Most of the California natives that I know can barely afford to live here, and are flocking to other states or the Central Valley in droves.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I completely agree, I moved to the Central Valley from Ventura 14 years ago because we couldn't afford anything in Ventura. Now my home that I bought in 2009 is worth 3 times what we paid because of all the people moving here from Texas to work in the oil fields and the people priced out of other parts of CA.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "[removed]",
              "id": 165,
              "comments": [
                {
                  "score": 15,
                  "content": "They would prefer us to remain homeless as long as we don’t rent or buy in their back yards.",
                  "id": 166,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 142,
              "content": "I mean, this is exactly what happened to California in the 20th century with everyone moving there and driving up the cost of real estate so consider this a rebalancing of sorts.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "People from California are moving to cheaper places for the same reason - they are being priced out by foreign money buying up the real estate.  In Irvine, there are a significant amount of new houses sitting there unoccupied, because it’s safer for the Chinese elite to have their money tied up in real estate here than it is to have it in their own economy.",
              "id": 168,
              "comments": [
                {
                  "score": 14,
                  "content": "Same with Pasadena. Empty high end apartments everywhere.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "When we helped me parents sell their home in Silicon Valley, there were literally all cash offers coming from china. Insane.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It’s crazy too, because these areas are $2-3M properties, left vacant!",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Same thing with California, though. Some of those people can afford to live in California, but some were priced out themselves. Construction and greedy developers are not just in your state, they're in mine too (I'm a native Californian who grew up in the Bay Area and lives in LA).",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Increasing the value of the market is fucking things up? People arent entitled to control the rest of the neighborhood and never have things change around them. Thats not how life works.",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "You know how many people move to California? How many have been over the years? What do you think that did to our housing market? You get what you’ve done to us since forever.",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 407,
          "content": "100% this. How were they supposed to feel responsible for a garden that isn't even in their yard??  It's more than NIMBYs nowadays, it's BANANAS - build absolutely nothing anywhere near anything.",
          "id": 175,
          "comments": [
            {
              "score": 74,
              "content": "A lot of people in cheap and low developed areas are the worst. The want everything to be like the \"old days\" where houses were tiny and of a certain build style and nothing should ever change.",
              "id": 176,
              "comments": [
                {
                  "score": 11,
                  "content": "What Americans call tiny is likely still twice as big as what most other developed countries would call 'almost too large for my needs'.",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": ">tiny and of a certain build style\n\nAs opposed to the new houses, which are more space than most people need, all look the same, and are made of the cheapest materials..",
                  "id": 178,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I’d be more welcoming of change if it meant I wasn’t stuck renting where I’ve been established for most of my life.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Omg Never heard that phrase and dying of laughter!",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "OP lives in a house they didn't pay for, because their ancestor managed to pick it up for a song back when women weren't allowed to own property and black people weren't allowed to own *themselves*, but it's the new neighbors that are entitled because they actually had to pay for their house.",
          "id": 181,
          "comments": [
            {
              "score": 89,
              "content": "At the time the neighborhood was built, someone was probably mad about developers ruining perfectly good farm land or green space. I wonder if OP feels any regret about that or if they feel their family was entitled to their opportunity to build generational wealth.",
              "id": 182,
              "comments": [
                {
                  "score": 26,
                  "content": "Maybe OP should do his research.",
                  "id": 183,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I don’t usually say this to strangers but… I love you. Hahaha (no seriously ALL of this!!)",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 154,
          "content": "> You wanna be mad be mad at the real estate developers, that's the actual bad guy here not the people who bought the house.\n\nExactly this. Could you imagine OP’s response if *no one* bought the house? “My former neighbors sold their house for a huge profit. The developer tore it down and built a mansion on it instead. It hasn’t sold, so now it’s bringing my home’s value down. What should I do?” 🙄\n\nThose poor neighbors.",
          "id": 185,
          "comments": [
            {
              "score": 35,
              "content": "then they'd be here bitching about the run down mcmansion stealing the sun and running down their property value instead",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "On top of it I haven’t seen anyone point out that this person seems to have INHERITED their house. Sorry not everyone can be so lucky to come from legacy family wealth or a time machine to have arrived to the community when the houses were all the same.",
          "id": 187,
          "comments": [
            {
              "score": 15,
              "content": "True, but I'm pretty sure a couple in their early twenties buying a 2 million dollar house has some inherited wealth as well.",
              "id": 188,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 39,
          "content": "Also has OP ever heard of trees? Even if no one built a big house, someone could just plant some trees for privacy or something and there goes your sunlight. Nothing is guaranteed unless your house is on acres of land.",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Absolutely. NIMBY was the word I was looking for, thank you. OP inherited a huge property and garden. Wonderful good for them. Unfortunately we’re not all so lucky and maybe if we work really hard we get to have a huge mortgage on a tiny apartment in a somewhat nice neighborhood. I’m sorry that encroaches on OPs family estates",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I've never heard NIMBYism applied to $2,000,000 single-family homes lol.",
          "id": 191,
          "comments": [
            {
              "score": 16,
              "content": "Not in my back yard (literally) can apply to anything.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "OP is too busy being the neighborhood bully to act like an adult. Grow up OP, you’re behavior is embarrassing and rude. YTA and maybe you should move.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Reddit is killing third party applications, and itself.",
          "id": 194,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4708,
      "content": "YTA.\n\nI live rural. Unpaved road. I have a horse. So does my neighbor.  We see trees and pasture from our homes. Two years ago some young couple bought a vacant parcel, plowed down all the trees and built a 5000 sq foot monstrosity complete with enormous gate and color changing lights all over the house. It looks like a shopping mall. And it stares right into my horse arena and kitchen/dining and deck. I LOATHE that house.\n\nIt was only finished for about a year before those knuckleheads decided to sell it. I was SO EXCITED and then I realized they weren't taking the house with them.\n\nI now have new neighbors and they are very nice. I have no clue why they bought the monstrosity they did. It's such a weird location for that kind of house. And the wife is TERRIFIED of bears so she will hardly come out of her house. But they are human beings and I plan to be cordial and neighborly.  Life is just too short to be an asshole to people simply because you're pissed at some developer.\n\nThese people could be the ones who call 9-1-1 when they see smoke coming from your house or they could lend you freezer space when your chest freezer breaks or they could find your beloved cat after she escapes.\n\nEvery neighborhood has some bad neighbors and in this situation, that's you, not them.\n\nYTA.",
      "id": 195,
      "comments": [
        {
          "score": 397,
          "content": "This! I live in a rural town too. Lots of land is being bought up and massive houses are being built there. We hate it. It’s terrible. Lots of people moving in are from California. Most people don’t have an issue with them living there. There’s a few we hate because they’re trying to change the town but hats only a few.",
          "id": 196,
          "comments": [
            {
              "score": 32,
              "content": "What are they trying to change about the town?",
              "id": 197,
              "comments": [
                {
                  "score": 146,
                  "content": "I can only speak to the small, rural, central Illinois town I escaped from but “change” often means: brown people, women who want to be treated like people, people who don’t drive giant pickups, and (less stereotypically) folks who want things other than either mom and pop stores that are closed after 4pm and on weekends or the Walmart. And literally any coffee. Basically any change from mid-last-century. Even replacing condemned for decades houses with new identical-but-structurally-sound houses. Sadly I’m not joking.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 70,
                      "content": "That is part of why I asked, yes.\n\nChange around me usually means new/distant/young people moving in and having opinions.  Like not Openly firing people when you find out they’re gay.  And actually sometimes renting or selling a place to a not-white person (at a non-inflated price!).  Even calling for actually ticketing people for speeding/driving drunk when they’re related to a two hundred year resident family!  Imagine that.\n\nIt has improved over the past twenty odd years!  A bit.\n\nSometimes change means turning small sixty year old sfh into overpriced McMansions and gentrifying so much no locals can afford to stay - that I have sympathy for and would try to prevent.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Typically when people from the city \"move out to the country\" they bring strip malls and starbucks.  It sucks.  It happened in my rural town too.  But honestly that's life.  Things change.  I have a bit more pity for people who live in rural areas than in cities or suburbs since rural areas typically DON'T change that much.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Some people want more convenient shopping locations because driving 45 minutes to a bigger city is so terrible😂. I don't mind local shops and where I'm at there's about 6563 coffee huts and over 12 different locally owned restaurants. It's when they compain about the lack of a TJ max or whole foods. You want whole foods? Go to the farmers market or the 3 other grocery stores besides Walmart. TJ max? There 15 antique and good will/thrift stores within an hour. You don't move to the middle of nowhere where the moose walk down main street and expect it to be downtown LA.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I never have understood that.\n\n“I love this place!  It’s so charming and quiet and intimately small! We should move here!”\nProceeds to complain constantly about not having all he mid to large-size city things.\n\nI love visiting little cabins in the woods, spiders and all.  They’re great.  I’m not buying one to live in halfway up a mountain an hour from the nearest hospital and grocery store.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Not the other person, but these are ones I remember from my childhood:\n\n“We don’t need a fence for our dogs because we’re in the country!” (Gets angry when a neighbor shoots their dog for attacking livestock.)\n\n“Nobody needs a gun! How dare you buy such a thing/use the locally agreed upon field for target practice?!” (Cue the frantic calls for help when a few coyotes or a hog goes after their dog or their person.) \n\nGenerally snide comments about the guy the next street over that ran a processing plant, mostly during deer season. Apparently it was “barbaric” that they didn’t shield their toddler from it. \n\n“Ugh that manure sticks. Could you get rid of it?”\n\n“Are you sure your child should be allowed out alone at their age/in the woods/at this time of night?” Related: “You shouldn’t be teaching them to shoot a gun!” See also: “Why don’t you put a pair of shoes on that child?”\n\n“Your rooster is too loud in the morning. Do you have to have one? And your mule too for that matter.”\n\nMost of those sorts had moved into our area for the “rural experience” but had no respect for the actual rural lifestyle. Looking back as an adult it’s more understandable I guess. My children have a “where does bread come from” chapter in their first grade science books and the information is genuinely new for many of their classmates. In many ways the rural/urban culture differences can be almost comparable to moving to an entirely different continent if you’ve never experienced the other side. \n\nNot going to lie, a lot of us gloated hardcore when the 08 crash came and those neighbors lost their McMansions. But then the meth heads moved in en masse and that was even worse, so eventually most of the OG residents abandoned the area. Last I saw it was just a bunch of corn fields, some run down meth trailers, and abandoned McMansions that were slowly rotting. Truly depressing.\n\nEdit: Oh another fun one I just thought of! One of the transplants decided to plant some wisteria right on the edge of their property line. The family next to them pitched a huge fit of course. Then the transplant family dug in their heels and refused to get rid of it. Eventually they admitted that they were in the wrong after it got out of control, but by that point the wisteria was established. That family was permanently ostracized obviously.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "Not just happening In Cali either. Minnesota is also getting to be this way to. The neighborhood I grew up in had a horse farm across from the neighborhood. City purchased it and now it’s over 400-500k homes. My parents home was built in the 80’s that was around 200k. I can’t hardly recognize my hometown anymore as they’re pushing up apartment complexes and more retail places. The neighborhood I grew up in is hardly recognizable due to the urban sprawl. I moved 45 minutes away to more farmlands for the sake of my mental health. It’s slowly starting to crawl up here to after just being here for less than 4 years. Same thing will start to happen to the town I’m currently at. More apartment complexes and less affordable home options. I love the city I’m currently at but eventually I may have to move once more to get away from that urban sprawl.",
              "id": 204,
              "comments": [
                {
                  "score": 9,
                  "content": "> My parents home was built in the 80’s that was around 200k\n\nFor reference this is over 700k today adjusted for inflation, hardly affordable.",
                  "id": 205,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I’m really grateful that our town is zoned so that developers can’t come in and wreck our vibe.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "What does 'trying to change the town' mean?",
              "id": 207,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": "Yes thank you!! My parents are in a similar situation: they bought a lovely century old house in the middle of other century-old houses with big ass gardens, no neighbour behind them. Last year, a developer bought this plot of land and build multiple duplexes: big cubes, ugly things, all extremely close to my parents garden and destroying any sense of intimacy.\n\nThey fucking hate it. I fucking hate it and don't live there. But they are still cordial to their closest new neighbors, because it's *not their fault*. They just bought a house from a shitty developer.",
          "id": 208,
          "comments": [
            {
              "score": 15,
              "content": "100 years ago, a shitty developer built the house your parents live in.",
              "id": 209,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "> And the wife is TERRIFIED of bears so she will hardly come out of her house. But they are human beings and I plan to be cordial and neighborly.\n\nI'm now picturing you as a bear, wearing glasses",
          "id": 210,
          "comments": [
            {
              "score": 23,
              "content": "They're just playing the long game. They'll be acting friendly until the neighbors let down their guards. Then it's fair game to steal their pic-a-nic baskets.",
              "id": 211,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "If the neighbors ever move I would like to know where this neighborhood full of big hairy gay guys is",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1997,
      "content": "YTA. All they did was buy the house. They didn't buy the land, tear down the old house, and laugh in your face as you tried to fight with the city over it. They are not your enemy.",
      "id": 213,
      "comments": [
        {
          "score": 717,
          "content": "I'm kind of on this.  What do you expect the neighbors to do?  What can they possibly do? Tear down their house for your garden?  \n\nJust take it as an opportunity to find plants that grow well in the shade and make it a community thing again!",
          "id": 214,
          "comments": [
            {
              "score": 384,
              "content": "BUt iT Is A NeIgHbOrHooD tReAsUrE!",
              "id": 215,
              "comments": [
                {
                  "score": 27,
                  "content": "Yeah I feel a little iffy when I was reading the top bit of the post, and my iffyness was confirmed when they were just being outright mean to the wrong people. This is partly why there's so much conflict in this world, because people don't know how to direct their anger.\n\nOP is immature and OP YTA.",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I have been trying to tell OP that most plants grow best in half-shade, especially with the changing climate. But I don't think they want to hear that.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "Yes and no. OP did say developers have been knocking down and building homes, but are people buying the homes first and then having them build the mansions? Because that’s what it is like in my town. My street alone has 5 giant brand new homes go up in the last 3 years. But contractors aren’t buying them. Families are buying the homes and building their custom homes on the land.",
          "id": 218,
          "comments": [
            {
              "score": 192,
              "content": "It specifically says “developers” are buying not private people",
              "id": 219,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "so what? somebody built the house you live in as a “custom” home, why is a new generation not afforded that privilege if they can afford it?",
              "id": 220,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Not to mention, since OP inherited their house they could have bough the lot if they were really concerned.  Regardless, this couple who simply bought a house isn't responsible for anything that happened.",
          "id": 221,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1136,
      "content": "YTA. First, I'm really, really sorry this happened to you. I would be absolutely heartbroken if my garden were diminished that way. But you're blaming the wrong people. Have you ever bought a home? Did you do any research into what the garden situation was like for your neighbors? Of course not. It's not something anyone ever considers. The fault here lies with the municipalities that allow the construction of these type of monstrosities, not with the homebuyers.",
      "id": 222,
      "comments": [
        {
          "score": 44,
          "content": "I've got 4 separate gardens spread throughout my yard for optimal sunlight. Yes it sucks, but I love having fresh veggies, canning, making spaghetti sauce, etc. However,  between trees, neighbors and my yard in general, I had to find a compromise if I wanted to continue. So, hence my 4 separate, smaller gardens.",
          "id": 223,
          "comments": [
            {
              "score": 7,
              "content": "Hang on, does 'garden' mean something different in America?\n\nIt sounds like you're saying you have 4 gardens in your garden! But I suspect this means that you have 4 specific plant growing areas in your overall single garden/yard? \n\nEnglish eh, what a language.",
              "id": 224,
              "comments": [
                {
                  "score": 21,
                  "content": "Yes.  In America, because America of course,  garden would be your vegetables and such. For the most part, we use the terms front yard, back yard, flower bed/ pots, patio,  so on for what the rest of the calls a garden. Lol\n\nProps to the \"English\" as a second language crowd. Between speaking,  spelling and definition of American English, I imagine it's  difficult to navigate. 😉",
                  "id": 225,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Even if they had \"done their research,\" what difference would it have made?  The house was built before the couple bought it.  OP is being hostile towards the wrong people.\n\nYTA",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "If OP is telling the truth and their family owned it for SEVERAL generations, chances are decent that indigenous people were forced off the land under threat of being murdered specifically to build those houses.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1018,
      "content": "YTA\n\n\nHow were they supposed to research your garden before moving there? Is it famous? Was it featured in Better Homes and Gardens? Does it have its own social media platform?",
      "id": 228,
      "comments": [
        {
          "score": 352,
          "content": "Yes, I wondered this too. “Do your own research before you move in, not only on the house you’re going to buy but on the neighborhood houses too.” Excuse me? Uh, I don’t want every prospective buyer for the neighborhood looking up every minor detail on my house in the name of “research”, thank you.",
          "id": 229,
          "comments": [
            {
              "score": 81,
              "content": "Right? I look up neighborhood, schools, crime rates, local businesses, and amenities. Indoor and outdoor layout. That’s about all I can reasonably think of as someone tentatively looking at buying. Maybe I’ll get more through, but it never occurred to me to look over the neighbor’s fence before buying?",
              "id": 230,
              "comments": [
                {
                  "score": 6,
                  "content": "Exactly.  That’s being nosy.",
                  "id": 231,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "What are they expecting after someone does their research and discovers the house they want to buy blocks a \"special garden\"?\n\nHave the house sit unsold and the grounds starting to get overgrown for years (while still blocking the garden). Buy the property and spend hundreds of thousands of dollars to knock down a new building and then build a new place on it?",
              "id": 232,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "If OP had done their research, they would've realized they needed to get a deed restriction with their neighbor before they sold to protect the garden.",
              "id": 233,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "OP is acting like she owns the Boboli Gardens, lol. \n\nIt’s unfortunate that what other people do in their own homes impacts people much, but it is what it is. Being nasty to these neighbours who obviously have all expectations of getting on well with their neighbours (besides the fact the neighbours were obviously abrasive with them). Leave these people alone, all they did was buy a house to live in. Would OP rather it remain empty for years and become a derelict eyesore.\n\nIf I was these homeowners I’d be investing every cent I had to make my own garden a NatIONaL tREaSURe just to spite OP!",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "It better have its own Insta",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 876,
      "content": "NTA- developers build what people will buy. They bought a massive house, newly built, that doesn’t fit the character or style of the neighborhood. All things that were pretty obvious when they bought. \n\nWhy are people pretending the consumers aren’t part of the problem?",
      "id": 236,
      "comments": [
        {
          "score": 640,
          "content": "Whew that was a lot of scrolling to find a NTA. Yup, this young couple meant well but they are definitely complicit in the gentrification of a wholesome neighborhood becoming a McMansion hellscape. OP was polite and honest about how worse things are now.",
          "id": 237,
          "comments": [
            {
              "score": 465,
              "content": "Lots of gentrification apologists swarming the thread.",
              "id": 238,
              "comments": [
                {
                  "score": 218,
                  "content": "[deleted]",
                  "id": 239,
                  "comments": [
                    {
                      "score": 184,
                      "content": "People always overlook that part of the equation. \n\nThey have smoke for the developers, smoke for the new owners, but no smoke for their former neighbors who sold out to developers for a big payday instead of selling to another family even though they knew it would affect the community.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "They probably are mad at them. Can’t shun someone not there. My friends are selling and ensuring it’s going to I be used as a primary residence so no more homes are bought up by giant rental companies that are destroying neighborhoods every where, driving up home costs and ensuring the younger generation never owns. It’s not that hard to educate yourself and have some social responsibility. I’m telling other people I know who are selling to consider doing the same.",
                      "id": 241,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "It's weird seeing people being called NIMBYs over...not liking mcmansions?",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Its a NIMBY vs Gentrification battlezone",
                  "id": 243,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 228,
              "content": "It’s perfectly legal for them to buy whatever house they want, but it’s also perfectly legal for the neighbors to be as cold to them as they want. If they choose the individualistic option that hurts the local community for their own financial benefit, they shouldn’t be surprised when they’re not welcomed as members of that community.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I’ve found that 95% of AITA judgements on here rely on what’s “technically allowed” or “technically not your problem”, without any actual critical thinking needed. \n\nI.e. A landlord kicking out a family who’s main breadwinner just died is deemed a-ok by the ppl here bc “technically” the lease ended and he had the legal right.",
              "id": 245,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 397,
          "content": "The couple also asked why people are cold to them.\n\nWhether or not OP is justified in her feelings, she did give them a pretty honest picture of why it is.",
          "id": 246,
          "comments": [
            {
              "score": 160,
              "content": "This. They asked, OP answered. If they didn't want to hear it they shouldn't have asked.",
              "id": 247,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "What gets me is the neighbor could’ve reacted with empathy, “oh I’m sorry I didn’t know, that explains a lot” but instead just grumbled that he assumed money could pay for niceties. I’d be pissed at them too.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 363,
          "content": "This is similar to the gentrification issue obv. \n\nYou exist in a world. The things you do, the things you buy - it all affects others. Quit being willfully ignorant.\n\nIf you buy a huge house in a old neighborhood like this, the locals are going to think you’re an AH. Welcome to actions + consequences.",
          "id": 249,
          "comments": [
            {
              "score": 23,
              "content": "And OP inherited their house and their generational wealth along with it.",
              "id": 250,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 262,
          "content": "Because America is the land of “fuck you, I got mine” I guess. As the new neighbours amply demonstrated with their “it’s not my fault you built your garden there” comment.",
          "id": 251,
          "comments": [
            {
              "score": 91,
              "content": "That comment really pissed me off. They had to know damn well the garden was there before their ridiculous house.",
              "id": 252,
              "comments": [
                {
                  "score": 31,
                  "content": "It’s the kind of comment you might make when you’re feeling defensive, then walk inside and ask yourself “why the hell did I just say that?!”, but it’s also the kind of comment a complete jackass would make. Who knows which 🤷‍♂️",
                  "id": 253,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "This. If you buy into this white-washed gentrification, you’re part of the problem. There are lots of areas where these “affluent” homes are built that are planned in this way. Neighbors could have bought one of those. They are not absolved of any guilt just because they weren’t the ones who bought and developed the land. We all have to participate in this society but sometimes people act like that gives us a blank check to take part in bad behavior because it’s less convenient to do otherwise. We all have our own individual capacities to do good and act in accordance with our values, and it’s okay that that’s different for everyone. This isn’t an issue of flying commercial while saying you are concerned about climate change. This is saying you’re concerned about climate change and then using the “other people are using my private jet” line when questioned about your CO2 emissions.\n\nETA: NTA",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 234,
          "content": "Omg! Thank god for this comment cuz this thread was driving me crazy. No! Of course you’re NTA! This is one of the most frustrating things about gentrification. You did NO research on the community, you don’t know anyone in the neighborhood but you heard people were “nice.” You purchase a house that is significantly pricier and larger than a bunch of others around you with absolutely no regard for how that impacts this “nice” community you heard about. And then you have the nerve to act entitled to people welcoming you when you arrive. Gentrification does not only rely on developers, homeowners like these are absolutely a part of the problem. I’d tell those same neighbors to tell all their friends to consider the impact of their movements and the literal space they take up before repeating the same dumb move.",
          "id": 255,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "That took me too long to find a response and replies saying this.\n\nIt may seem like the garden is the only issue here but the main issue in the background is gentrification. I live in a state that you absolutely cannot expect to buy a house in, even if you make a “living wage” due to rich people outside of our state coming in and raising the property value.\n\nThe tip off in this post shouldn’t have been that the garden was essentially destroyed, but that a couple in their early 20s was able to buy a multistory house that OP said was worth, what, $2 million? Most people my age are barely scraping by, regardless of state they come from, California or otherwise. We can’t typically afford a starter house, let alone a $2mil mansion.\n\nIt’s not just about the garden.",
          "id": 256,
          "comments": [
            {
              "score": 23,
              "content": "That garden being destroyed lowers OP’s property value. Locally, we had people who won lawsuits because people had their view of the lake destroyed when small houses were replaced with McMansions.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "as someone that lives in a lower income neighborhood and sees people being driven out by situations like this, i agree. of course the neighbors aren’t the ones that built the house, and the developers are the biggest assholes here, but buying a 2 million dollar home without even researching the community is still a problem imo.",
          "id": 258,
          "comments": [
            {
              "score": 18,
              "content": "I would go so far as to say buying a 2 million dollar home is a problem in general, or at the very least in areas where that isn't at or below the average home price. It gives incentives for developers to focus on building a few homes for rich people instead of building enough homes for everyone else.",
              "id": 259,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "This guy’s still a dick imo but also why would anybody buy such an obviously out of place house and then be SHOOK that everyone in the neighborhood hates it??? Like they have eyeballs, they could see that they were buying a new build that was out of place in the neighborhood.",
          "id": 260,
          "comments": [
            {
              "score": 5,
              "content": "People like this are oblivious to the world and struggles around them",
              "id": 261,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Thank you.\n\nI don't feel sorry for them and I wouldn't be friendly to them, either. I mean, I wouldn't be an outright asshole, but no way in hell I'd be baking them a pie or inviting them over. \n\nLots of people licking the gentrifier boots in this thread.",
          "id": 262,
          "comments": [
            {
              "score": 31,
              "content": "Right? I would NEVER EVER be friends with people who would want to live in a house like that. I would probably say hi if I passed them on the street, but anything more than that? Hell. No.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Also the amount of people who seem to think buying a house means you DESERVE to be included in the community?? Community is a group project- there are consequences for harming the group, even if the harm was unintentional or they were unaware.",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}