{
  "post content": "Ok, so my brother (28) got engaged to his fiancee (26) about 6 months ago, they are expecting in June, and they just bought a residential lot with two houses on it. My brother Shay's said he never wanted kids, but once they got engaged he said he now wants 2. They found out they were expecting after 3 months of just no birth control, not really trying. Their property came fully furnished with brand new items like a King sized bed and leather lay-z-boy furniture, and a Jacuzzi!\n\nI am actually super happy for him that he has his shit together, isn't falling down the alcohol/drug hole that we were worried about happening, and seems to be genuinely happy. I would never wish for him to not have the amazing things in his life.\n\nMy life...is not in the best place right now. My DH (30) and I (30) had to sell my house and move in with my parents 4 years ago when we both lost our jobs due to the economy (1.5hrs from the city). We have our own area in the basement. \n2 years ago we gave birth to DD after struggling for 3.5 years to conceive!\nIn the last year DH has had 5 different jobs. DH now has a job in the city (2 months), and I work between three different communities (one in the city; 1 year). When we're working in the city we stay at the In-Laws place 20min outside the city. I sleep with DD on the 2nd floor across from MIL and FIL, husband sleeps in the basement with SIL (33) and BIL (29).  \nEven though both DH and I are employed now (I'm casual right now, trying to get full-time permanent) we have such a debt load ($2000+/mnth) that it would be impossible for us to move out for another 4 years. \nWe've been living pay cheque to pay cheque for 4 years now, but I am trying to figure out a financial plan that will help us move into our own place in about 4 years while putting money away for DD's future.\n\nMy mom has been telling me all these fantastic things going on in my brother's life, and while I am super excited for him, I am also sad that I feel like I'm drowning. My mom wanted to celebrate Christmas at his new house, meanwhile I had to scratch to try and get my daughter birthday/Christmas prrsents. So I asked my mom if she could try not to talk to me about it so much as I am trying to work through my issues. I reassured her that I am happy and excited for him, just really sad for me, but working through it.\n\nMy mom said she is disappointed in me not being able to just be happy for my brother. I won't go into the other points of the conversation, as I really just want to know: AITA?\n\nSorry if it sounds like I'm trying to justify myself, I'm just trying to give an idea of the situation and my personal thought processes.\n\nEdit: I want to thank everyone for commenting today. I finally got through all the posts that were here. I'm sorry if I didn't comment back, but sometimes I didn't have anything I felt needed to be said. Apologies if anyone took offense to anything I said in my post or my comments, nothing I wrote was said in anger.",
  "id": 1,
  "comments": [
    {
      "score": 482,
      "content": "I don't really have a judgement for you, but I just want to say please please don't compare yourself to your brother. We all have different journeys in life, and there will be times when your life is running smoothly, and times when it isn't (same for him). It sounds like you and your husband are both making strides with your new jobs, so hopefully this will lead to bigger and better things.\n\nThis time next year your whole life could look completely different, so try not to lose hope or be too down on yourself :)",
      "id": 2,
      "comments": [
        {
          "score": 28,
          "content": "This. I've had a very hectic few years, things have gone up and down so many times with so many unpredictable things happening(medical stuff, pregnancy complications, career changes after our children were diagnosed with autism, cross county move to care for my grandmother). We're at a precarious point right now and temporarily living with my parents as well, when a few years ago we were doing just fine. But it's not going to stay bad forever. Things change, it's possible to dig yourself out of the hole. I *know* it feels like this phase will last forever. It sucks. But 4 years from now who knows where you'll be! Fingers crossed this time will be a bad distant memory.",
          "id": 3,
          "comments": [
            {
              "score": 21,
              "content": "Thank you.\n\nIt sounds like things in your life right now are pretty hectic, but you sound like an amazingly positive person! I hope that things quickly smooth out for you and your family.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Thank you.\n\nI keep trying to have hope, but for the past 4 years it's been constant hope to have it dashed at every turn, hah. I'm still trying to hold out for hope!",
          "id": 5,
          "comments": [
            {
              "score": 8,
              "content": "Yeah it can be so hard, but just make a list of what you want and then think of the steps you can do to go about getting it. If you make a step by step plan it can make things feel more manageable. Having one big, far off goal just feels so insurmountable and like you can never get there.\n\nMy life has had a lot of turmoil over the last few years but it honestly looks totally different now from how it was even 1 year ago!\n\nI saw someone in one of the other comments mention about a local debt councillor to see if there’s a way to dig yourself out of the hole, I think that could be really helpful to look into as well :)\n\nAnyway I didn’t wanna seem super preachy haha I just wanted to remind you that we all have different life paths and no one thing makes us a success or a failure, there will always be ups and downs and it’s just about enduring the bad times before you can get to the good times. Plus it all tastes sweeter when you have some real shit to compare it to xxx",
              "id": 6,
              "comments": [
                {
                  "score": 4,
                  "content": "Honestly, I'm trying to read all the comments with an open mind.\n\nYour comments have given for advice and support.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This. OP, I feel you. I have a younger brother who has “accomplished” a lot more in life than I have already - successful career that paid his way through college, a home-business which is really taking off and will likely become one of his main sources of income, a gig part-managing something that is literally both of our dream lifestyle/jobs... owns 40 acres with a house (paid off), nice vehicle, and is getting married to a lovely woman.\n\nMeanwhile I have credit card debt and nothing of any real value to my name... but dang I’ve had a good life anyway and someday I’ll catch up.\n\nIt’s heart wrenching to compare sometimes especially when it’s constantly in your face, but just try to remember to focus on YOUR good... and if you have to distance yourself, so be it. Your mom is not being understanding or reasonable.",
          "id": 8,
          "comments": [
            {
              "score": 6,
              "content": "Thank you.\n\nIt seems like it brothers are doing well, haha.\n\nI know that I've had so many experiences in my life that others haven't, and I am fortunate to have had them. I'm really needing to overhaul my internal view of my life right now.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 182,
      "content": "NAH, it makes sense that you are overwhelmed and don't want to hear about it, but there's also nothing wrong with her being happy and excited for him. \n\nThe only exception, of course, is if you somehow looked down on your brother when *he* was struggling before with drugs. If that's the case, then you gotta eat your crow and deal.",
      "id": 10,
      "comments": [
        {
          "score": 37,
          "content": "I absolutely agree! My mom should be over the moon for my brother, she has every right!\n\nI was actually one of the very few people in my brother's corner who always believed he would sort things out, and was a supportive listener when he needed it.",
          "id": 11,
          "comments": [
            {
              "score": 16,
              "content": "So I hate to quote Louie CK but he once had a line that “you don’t look into your brother’s bowl to see if he has more, you look to see if he has enough”. I know it’s hard to focus on if you both have “enough” right now, but I would focus on some positives. You have a long hoped for daughter!  You have incredibly supportive family, including your parents and brother and in laws!  You have a husband you love and you know you can make it through the hard times together (many people can’t)!  You are both working again!  You are actually quite a bit richer than many. Sometimes it’s so easy to focus on what you don’t have that you lose sight of what you do have, and you have some great things going for you now, and the future is looking up. Don’t self sabotage with negativity.",
              "id": 12,
              "comments": [
                {
                  "score": 3,
                  "content": "Thank you.\n\nI will admit that while I was first really hurt to see so many comments saying \"YTA\" I will admit that not appreciating my own good fortune is being an asshole.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think it’s normal — or at least I do it, too — to compare and wonder “why them and not me” because, really, why NOT you?!  You’re a good person and a hard worker and you deserve a break. But that just gets (me, at least) into something depressive spiral of disappointment and frustration and I really do start to overlook what I have. It’s super lame, but I have to remind myself of some “inspirational” quote I saw online “There IS enough. I HAVE enough. I AM enough.”  No, it might not be a lot or what I want, but I am fed, I am healthy, I am loved, I have people to love. There is also enough of all of these things to go around, so my sibling or friend or coworker can ALSO have these things or more of these things, but I still get my rationing.  Anyhow, good luck in the coming year!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I'd say ESH  because the mother has supported the OP without question or demand for years at this point.  Not only the OP's own grown ass, but that of her husband and now of her child.  She's fucking lucky.  Most parents these days either couldn't do that financially, would refuse to do that because they wanted to actually live their own lives and even if they did at first would absolutely refuse to do it for 4 years, especially after the OP added a child into the mix.\n\nAbsolute and unconditional love.  The OP has been given more than just a roof over her head.  She's been given loving support despite what sounds like absolute heartbreak for her mother whilst dealing with her brother.  How much pain as her mother in, yet she sucked it the fuck up and was 100% there for her daughter.\n\nThe OP's mom is saddened that her daughter isn't showing that love to her brother.  I get it   from her perspective.  She is the type of person who just loves despite what's going on in her life.\n\nYet the mother doesn't understand that that's not where the OP.  And that the OP is butt hurt when she's been shown such deep love and refuses to reciprocate to her brother.",
          "id": 15,
          "comments": [
            {
              "score": 10,
              "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.\n\nI am exceedingly lucky to have my parents, I agree with you 100% on that.\n\nMy mom's heartbreak with my brother was from when he was 16-23 and kept having legal run ins with the law (sure to drinking when he was over 18). My brother is a fun time guy. When he's with his friends they party to excess and get up to stunts that are usually just stupid (climbing onto the roof of a store) but sometimes dangerous (DUI). \n\nI apologize if I made it seem like he was worse off.\n\nThankfully my mom has not had to deal with two problem kids at the same time.\n\nI'm going to end this by saying that I adore my brother and all beyond happy for him.",
              "id": 16,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 140,
      "content": "[deleted]",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.",
          "id": 18,
          "comments": [
            {
              "score": 20,
              "content": "That's great. However, having a baby in the house is not just about the money. Babies cry and scream at times that are not convenient. This does effect the people you ended up living with. That plus baby proofing and helping out (I would find hard to believe that never helped out with the baby). And it doesn't matter how short of a time you planned on being there. You still tried (and in this case succeeded) at getting pregnant while you where already there, making it their problem as well. Plus spending money on a fertility specialist, as well as the price of a kid while you where struggling financially is just all around not a smart thing to do.",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 110,
      "content": "YTA for being jealous. Your financial struggles are your own. It sounds like after losing your jobs and moving in with your parents you decided to have children.",
      "id": 20,
      "comments": [
        {
          "score": 147,
          "content": "Yea, I was surprised by that as well. Who purposely has kids when they don’t have stable jobs and are living in their parents basement?",
          "id": 21,
          "comments": [
            {
              "score": 48,
              "content": "Yeah, I did reread that, and while I understand the drive, they should’ve waited. But that isn’t what they’re asking.\n\nI don’t think OP is wrong for her feelings now when she has expressed happiness for her brother. She just doesn’t want her mom constantly pressing it on her.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "My ex husband just did the exact same thing. He's been living with his mom for a year and a half. Now has an 9 month old besides our 14 year old son. I can't understand why.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "In the US (from the spelling of cheque I doubt it) welfare system, more kids == more money, you can bet people abuse that... and their kids",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -31,
              "content": "People who had been actively trying at that point for almost 2 years and didn't know how long it would possibly take to have children? Someone who had hope at that point that it wouldn't take another 6 years to find jobs and become financially dependent? If we all had a crystal ball we'd be able to wait as long as it took, but you have no idea why they were struggling to conceive or when they thought they'd be able to move out. Life changes. Yes they are lucky they are able to stay with in laws and her parents, but that doesn't make her an asshole for wanting children and pursuing it. If you wait until everything is absolutely perfect in your life and finances, 90% of people wouldn't ever have kids.",
              "id": 25,
              "comments": [
                {
                  "score": 71,
                  "content": "Yea, no. That’s an extremely selfish mindset to have. I guarantee having a kid set back their ability to be financially stable, causing others to have to support them longer. Then OP is being sour that her mom is excited about her brothers achievements when she put her self in this position.",
                  "id": 26,
                  "comments": [
                    {
                      "score": -19,
                      "content": "If we go strictly by what she's said in her post, she's not \"being sour\", she's just asking not to get inundated with \"oh your brother is doing so well! Isn't it so exciting that everything amazing is happening to brother?\". \n\nYes, it probably did, but that's not what she came here to ask, and given that we have no idea the specifics of her situation, we don't know that they had every reason to expect to be out before baby came and then something else happened that was unexpected. We also don't know if they didn't talk to mom and dad about if they'd be ok with them trying given the circumstances and mom and dad said \"absolutely, the more the merrier\". As well, she's living at home to try to be financially responsible, but that doesn't mean that they couldn't move out somewhere less than ideal but that would still work if they absolutely had to. We don't know any of these specifics because that's not what she came here to discuss, and these types of posts always bring out the \"holier than thou I would never be so irresponsible\" types that seem to think they understand every single nuance from a 3000 character post that go into making that type of life altering decision. We don't have anywhere near enough info to judge, and if you've never been in that situation with infertility (I'm not saying you haven't, just that lots of people with that mind set have not) then you cannot possibly understand the decision being made. It's not as simple as \"oh we'll wait for 2 years until the timing is better\". If you thought that to get the thing you've wanted more than anything else in your entire life meant that it would set you back for 10 years but that if you didn't go for it now it would never happen, can you truly say you'd easily give that dream up because it would make things more difficult? I sincerely doubt most people would stop pursing a life long dream, perhaps even a defining part of who they think they are, if they thought it was now or never.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -1,
                  "content": "Thank you.\n\nI replied to the original comment of this little thread, but you're basically right.",
                  "id": 28,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Reddit is largely childfree and full of people who think you should have 50% equity in your home and a savings account that’s at least 5 figures before having kids, which is super unrealistic for like 95% of people if they EVER want children, let alone before they’re 45 or if they have any issues conceiving. Sorry you’re getting hate OP. Only you know all the details in your situation to be able to judge",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "I disagree. Jealousy isn't something that we control, so you can't be an asshole for feeling it. She could be an asshole if she were making snide remarks or what not. \n\nBut OP is just simply struggling to hear how good her brother is going compared to herself. I don't think that's unreasonable to be honest. \n\nChin up OP, things will get better",
          "id": 30,
          "comments": [
            {
              "score": 5,
              "content": "Thank you.\n\nI have never once said anything to the negative about all my brother's recent good news, I've actually yelled at others for making it seem like he doesn't deserve it, haha.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nMy financial struggles are my own, yes. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh in others.",
          "id": 32,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 72,
      "content": "YTA- your brother’s life choices do not reflect on your own. You were drowning in debt and unable to provide for your daughter before your brother bought a home, nothing has changed. You should be thankful that your parents and in laws are able to help you out, rather than be bitter about your brother’s good choices.",
      "id": 33,
      "comments": [
        {
          "score": 61,
          "content": "OP is happy for her brother and has expressed that. She doesn’t want to hear it constantly though. How is that a bad thing?",
          "id": 34,
          "comments": [
            {
              "score": 11,
              "content": "because folks on AITA hate nothing more than people who they think had kids under the ~wrong~ circumstances, or even just becoming poor despite having been in a good financial position in the first place, and that will apparently always trump anything else going on in a post lol",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You have no idea whether OP's struggles or her brother's success came directly from good/bad choices or not. It's easy and comfortable to be moralistic about who has a good life and who doesn't, but reality is stickier than that.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.",
          "id": 37,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 59,
      "content": "YTA. Why on earth did you have a kid when you are living like you do? It was your own choices that put you in debt, not your brothers.",
      "id": 38,
      "comments": [
        {
          "score": -16,
          "content": "Thanks for commenting, it's always good to hear others opinions.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.",
          "id": 39,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 50,
      "content": "YTA. Stop being jealous that your brother made good life choices while you have made terrible ones (who tf has a child when living in their parents’ basement?!) Your mother is proud of it and since she is helping you a lot/basically keeping you afloat you’re not really in a place to start arguments with her.",
      "id": 40,
      "comments": [
        {
          "score": -6,
          "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.",
          "id": 41,
          "comments": [
            {
              "score": 12,
              "content": "There are plenty of ways to avoid having a baby when you realize that your circumstances are not ideal. Put on a condom. Frankly it’s hard to have sympathy for someone when you’ve so knowingly contributed to many of your problems.",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 49,
      "content": "YTA - Your brother is allowed to be happy and your mom is allowed to be happy for them too. \n\nStop throwing a pity party. You moved into your parents house 4 years ago and 2 years ago you had a baby (while still living at Mom's).",
      "id": 43,
      "comments": [
        {
          "score": 1,
          "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nI've never said anything to my brother, ever, about not being 100% thrilled for him. I am over the moon happy for him, and I am lucky to get to see how ecstatic he is.\n\nI would never tell my mom not to be excited for her son! I hope that my mom is always excited for her children when they are doing well.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.",
          "id": 44,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 48,
      "content": "Definitely YTA. You don't get to be jealous of your brother, when the reason the hole you're in is so big is because of your own actions. You don't lose your job and move into your parents basement and then try for a kid. If I was your parent, I would have kicked your ass out the second you told me you were pregnant while living in my basement.",
      "id": 45,
      "comments": [
        {
          "score": 28,
          "content": "Yeah that's what the real problem is here. You dont bring a child into the mix when you're in such a bad spot. If were an accident, that's one thing. This they tried for for at least 2 years after they lost their jobs",
          "id": 46,
          "comments": [
            {
              "score": -4,
              "content": "Thanks for sharing in the discourse!\n\nI wanted to quickly help you out with your math: DD is 2 (24 months)\nBabies take 9 months to make\nWe tried for 3.5 years (42 months)\n24+9+42=75 months=6.25 years\n6.25 years-4years=2.25 years\n\nWe actually started trying to conceive 2 years and 3 months before moving in with my parents. We had our own house, and were both gainfully employed at that time. The process of dealing with fertility specialists is difficult to start, and to stop. We had already been dealing with fertility specialist for over a year before moving in with my parents.\n\nThank you again though!",
              "id": 47,
              "comments": [
                {
                  "score": 27,
                  "content": "[deleted]",
                  "id": 48,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This. I get that fertility issues make it less likely for it to happen but that doesn’t mean it’s entirely impossible. If I was living in my mom’s basement dealing with financial fallout, I sure as hell wouldn’t be cavalier about birth control. I get wanting kids but taking a break until life is back on track won’t be the end of the world. Seems pretty selfish of OP not to be mindful of that.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "Thanks for commenting, it's always good to hear things from other points of view.\n\nMy financial struggles are my own. I have never asked anyone for money, I help with groceries, I cook and clean, and I do administrative work for both my parents companies. I still feel like a leech, but I try very hard to help where I can.\n\nWhen we moved in with my parents we were well into our second year of working with fertility specialists to get pregnant. It's not an easy process to start or stop. We also never planned on having to live with others for this long. Unfortunately, due to unforseen financial issues, we have been with others much longer than we originally anticipated.\n\nI am trying very hard to ensure that my failures don't weigh on others.",
          "id": 50,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 38,
      "content": "That is a lot of debt, is it getting the balance down? I wonder if there is a local debt counselling charity you could speak to to see if there are any better options than labouring under it?",
      "id": 51,
      "comments": [
        {
          "score": 2,
          "content": "Thank you for this constructive response.\n\nI may seek out professional help, and have actually been debating teething to see a financial advisor. Of the debts we have I may be able to consolidate two together, but due to the nature of others there isn't anything I can do with them but pay monthly. My principal amount is decreasing, thankfully! The worst of the debt is actually student loans, because of the monthly amount you pay a very small amount of it actually goes towards paying down your principal (stupid teenagers signing contracts when they know nothing about interest rates).",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}