{
  "post content": "Hi, I (17m) texted here about a day ago.\n I have a lots of problems but past few months of living with my sister (28f) I’ve been wondering if I should tell her that she’s more mom to me than our own mom is? I understand i might 100% upset my mom (48f) with this but my mom isn’t really here for me or my siblings. Me and my boyfriend (15m) have been also thinking about our future and possibly future wedding which we would love to have when he’s about 30 if all goes according to what we’ve planned. Well due to us thinking that I’ve been thinking about who would walk me down the isle and my father is out of the picture and I will have to attend my wedding as she wasn’t invited to any of my sibling’s weddings but I don’t want her boyfriend to walk me so my immediate answer would be my sister’s husband as he’s more fatherly figure to me. I mean they treat me like I’m person and perfectly normal one but what if it hurts them and my mom that I don’t see my mom as my mom but just as a woman who provides food and water and roof over my head just because she has to? And my father is well no one to me just a drunk man who abused my sister brother and mom and me well practically just a sperm donor. So would I be the a-hole if I told my sister and her husband that they’re more of parents to me than my bio parents?",
  "id": 1,
  "comments": [
    {
      "score": 13,
      "content": "NAH but be careful making plans 15 years into the future with a 15year old.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": ">Me and my boyfriend (15m) have been also thinking about our future and possibly future wedding which we would love to have when he’s about 30 if all goes according to what we’ve planned.\n\nI don't mean to be belittling or to diminish you or your relationship. But your plans will not go the complete way you want it. That's not how life works. Personally, I don't think it's bad to tell your sister and BIL how much you appreciate what they've done for you. But I think you are pulling the cart before the horse a little too much at 15. You've got a long way to go to get to that point.",
      "id": 3,
      "comments": [
        {
          "score": 3,
          "content": "I get your point and thank you very much for your opinion I really appreciate it. Also my plans I meant our distant relationship as he lives thousands miles from me so our plan was wait for my bf to graduate and fly here get the citizenship here and wait till I finish my future studies as I would love to be a teacher then possibly go back to the USA and I’d get citizenship here and we would live there together but we do know and understand that it might not work and not go according to that",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Very gentle y t a if you bring your parents into the discussion. You can thank your sister and her husband for all their wonderful support, and just leave it at that. It'll sound more meaningful and sincere if you don't discuss your parents at the same time. \n\nTotally have a discussion another time about how you and your sister can get past the problems caused by your mother. But do that chat another day.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the a-hole because they could be upset or hate me for it and my mom can be super mad like she will not talk to me for a while I definitely feel like an a-hole but I can’t help it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi, I (17m) texted here about a day ago.\n I have a lots of problems but past few months of living with my sister (28f) I’ve been wondering if I should tell her that she’s more mom to me than our own mom is? I understand i might 100% upset my mom (48f) with this but my mom isn’t really here for me or my siblings. Me and my boyfriend (15m) have been also thinking about our future and possibly future wedding which we would love to have when he’s about 30 if all goes according to what we’ve planned. Well due to us thinking that I’ve been thinking about who would walk me down the isle and my father is out of the picture and I will have to attend my wedding as she wasn’t invited to any of my sibling’s weddings but I don’t want her boyfriend to walk me so my immediate answer would be my sister’s husband as he’s more fatherly figure to me. I mean they treat me like I’m person and perfectly normal one but what if it hurts them and my mom that I don’t see my mom as my mom but just as a woman who provides food and water and roof over my head just because she has to? And my father is well no one to me just a drunk man who abused my sister brother and mom and me well practically just a sperm donor. So would I be the a-hole if I told my sister and her husband that they’re more of parents to me than my bio parents?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    }
  ]
}