{
  "post content": "Ive been doing a program at my school which is called “the marine challenge” which is basically a fitness program. My parents asked if I wanted to do a program at Marine Military Academy over the summer and I said sure, thinking it was more of the same.\n\nBut I looked up videos of it, and while it seems fun, they make all campers buzz their hair off. I have long hair right now. I told my mom I changed my mind but she said she already put down the deposit and I am going. She asked why I didn’t want to go and I said I didn’t know they’d be shaving my head. She said it’s just a haircut, and it’s selfish to now back out and that I should have looked it up before saying yes.\n\nI guess in a lot of ways she’s right does that make me the a hole?",
  "id": 1,
  "comments": [
    {
      "score": 6640,
      "content": "NTA - if you don't want to join the military, don't put yourself what appears to be a prep programme",
      "id": 2,
      "comments": [
        {
          "score": 1180,
          "content": "Yes but he should pay his mum the deposit back... he agreed before looking it up and she must have thought he loves the work out so much he won't back down.\n\nIf he doesn't even think about paying the deposit back than he's an AH.",
          "id": 3,
          "comments": [
            {
              "score": 818,
              "content": "What?! He’s a minor.",
              "id": 4,
              "comments": [
                {
                  "score": 1260,
                  "content": "Do you think people just learn accountability magically when they turn 18? This is something that needs to be taught.    \n\nHe doesn’t have to go, but he does need to understand that if the payment has been made and he didn’t read the fine print beforehand, the consequence is losing the deposit. He should feel that blow, not his mom.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 187,
                      "content": "I think it would be more fitting for mom to pull back on a treat she usually pays for for OP. Sorry, no pizza out this month. Or something like that.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "What about the fact it was a light hearted commitment and OP didn’t know everything up front? My dad did the same to me, hey want my old car? Sure. Hey dad the 2,000 grandma gave me can we use that to get a laptop for uni? Sorry I used it on the car you said you wanted…. Coulda mentioned it was going to cost me before hand as I would have said no since it was a shit box I wouldn’t even want to pay for. \n\nThis doesn’t teach responsibility or accountability. Had mom sat down and gone through it making sure it’s what he wanted before committing to it then that’s different.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -4,
                      "content": "Yes, that's literally what being a minor means. They can't sign a contract because they aren't considered old enough to understand the full extent of the sub-clauses etc. (Not saying I agree; in high school I had friends who were emancipated minirs and they did fine) but his mother failed in making sure he understood what he was agreeing to. Which obviously he did not.\n\nShe probably doesn't like his long hair.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "And? I had a job at 16. As soon as it was legal in my state. It’ll teach them an important lesson about looking before you leap.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 90,
                      "content": "This is such an American thing that I just don’t get. Like just let kids be kids ffs. Child labour isn’t something to be proud of smh",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I didn’t mind having a job at 16 at all. It was after school and/or Saturdays and gave me my own money. Most of my friends had jobs at that age. Part-time, retail. Even the rich kids. But I am old.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -6,
                      "content": "But mom leaped from the sound of it. Unless she said “hey I’m about to enroll you, just checking that you definitely want to go” then she prematurely pulled the trigger",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "It’s a good life lesson though. Look before you sign up.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yeah, a minor can still pay his parents back.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "It doesn’t have to be paid back with all physical money either. Mom could have him do extra chores to pay off the deposit. The more important thing is that he learns that actions have consequences and I’m sure he will do more research before saying yes in the future.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "What's your point?",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "And?",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "If he is old enough for this program, he is old enough to pay some portion of the deposit, depending on how much it is.\n\nSaving one's freak flag from the clippers sometimes has a cost.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -68,
                  "content": "So what? Unless he's still an actual child of under 14 and not an adolescent than he should pay it back. (In rates as small as necessary obviously). Teenagers are old enough to take on some responsibilities of their actions... and if cutting his hair off is such a big deal... proof it. If he's not willing to pay the money back the hair isn't that important to him as he makes it out to be. (It's extremely easy to just shrug the money loss up if it isn't yours and your parents pay for it with their hard work while you don't have to lift a finger). \n\nI was doing summer jobs when I was 15+ each year... not because my parents abused me or didn't give me a monthly allowance or didn't cover my basic needs, but to save money for extra needs that were totally unnecessary... like a Football Jersey (European football, not American football mind me) or the new lego set - and I didn't want to wait until my birthday. Teenagers should learn financial responsibility... you don't just magically grow it once you turn 18.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I have no idea why you're being downvoted to oblivion for saying what half the people above you are saying. Maybe all the teenagers in the thread are freaked out by the idea of reasonable accountability for their choices",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 73,
              "content": "Why on earth would OP assume or know right off the bat that part of a voluntary camp for minors involves compulsory hair shaving, though? That’s nuts. \n\nThis isn’t an accountability issue on OP’s part and he shouldn’t be on the hook for this. It’s unfortunate that his mom put down a non-refundable deposit, but wanting to back out because of this is understandable and also not his fault.",
              "id": 21,
              "comments": [
                {
                  "score": 1,
                  "content": "> Why on earth would OP assume or know right off the bat that part of a voluntary camp for minors involves compulsory hair shaving, though? That’s nuts.\n\nBecause it's overtly for preparing to go into the military, where compulsory hair shaving is commonplace and immediate.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Why would he think they'd force him to change his physical appearance when he isn't actually joining the military? That's not even why he looked it up. That was something unexpected he came across",
              "id": 23,
              "comments": [
                {
                  "score": 28,
                  "content": "Exactly. Isn't your hair included in your bodily autonomy? I get why it's a safety issue in some situations, but the \"boot camp that's not a boot camp\" sounds like they want to brainwash you into joining the armed forces.\n\nNote: I'm a couch potato so likely biased against any over eager fitness program and its instructors hahaha",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 65,
              "content": "Yeah mom and dad wanted their own kid to be gone for a few weeks on end so they were eager to pay the deposit within seconds… \n\nI doubt even if they cancel now the deposit is not even still refundable it’s months till the summer",
              "id": 25,
              "comments": [
                {
                  "score": 120,
                  "content": "[deleted]",
                  "id": 26,
                  "comments": [
                    {
                      "score": -26,
                      "content": "One month, you get a whole month? I get like a day or two here or there and then POOF — it’s fall.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -26,
                      "content": "Well I calculated that it was only may 6th… so we have like the whole month of may left then only in the 21 Jun the summer starts which is basically at the end of the month… but mostly because the school holidays start in July. Here it’s mid July so I decided to go plural as it was about 2 months till our summer",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -29,
                      "content": "Whether you’re talking about the season or summer break, you are incorrect in thinking the whole hemisphere is in agreement. Summer at my university is about 3 months, the summer semester is 2 month. Other states have a summer break for a month. The season of summer in the southwestern US however, is at least 4 months.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "Most of the camps where I am are already in 50% or less refunds. It's May and camps start at the end of June in my state.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "With what income? Also a workout camp shouldn’t force a haircut. That’s totally not what OP signed up for. \n\nIt might be what Mom intended but NTA op.",
              "id": 31,
              "comments": [
                {
                  "score": 1,
                  "content": "He can get a part time job or a summer job, just like thousands of other teenagers... if he's old enough obviously, depending on local laws.\n\nA military camp can be expected to mimick the real deal... that's why it's a military camp and not a \"workout camp\". Even with no military background (and OP has military background) that one is [edit: is not us] an obvious \"I'll ask before I agree or assume anything\". Mum probably didn't know how important his hair are to him, unless they had that argument before.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 7,
                      "content": "He’s still NTA though. And as you don’t know that he’s old enough to get a job how can he pay for it?",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Mom should have researched it too and let him know this important detail.",
              "id": 34,
              "comments": [
                {
                  "score": 10,
                  "content": "But to her, it’s not an important detail. She doesn’t think a haircut is a big deal, but OP does.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah mom doesn't think bodily autonomy is a big thing, we get it.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -14,
                  "content": "Because it's not an important detail.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 15,
                      "content": "If your kid has long hair, it's a lot of work for them. They make a choice to keep it long. It's kind of obvious that something that would take away that choice from your child is kind of an important detail.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "No, that's on his parents for not being clear about what the program entailed. If they'd gone over what the program expected with him, it'd be fine. As it stands, they hid the details and pretended that it didn't matter. Clearly, it does. Hair is a pretty important thing for a lot of people.\n\nI wonder if the parents just don't like that he has long hair and hid it intentionally.",
              "id": 39,
              "comments": [
                {
                  "score": 59,
                  "content": "Clearly OP is capable of looking up things online, just like they eventually did to find out the head shaving thing. They should have done that before agreeing. That's an extremely basic life skill.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Sounds like his parents went \"Do you want to go to this camp that does more of what you like?\" without sending him details or such first and without giving him the option to go away and look it up. If your parents offered to send you away to, idk, videogame camp, wouldn't you say yeah at first?\n\nHe then DID go away and look it up. It's not his fault for not doing it first, it's on his parents for not being clear that there were hidden caveats. As adults you get stuff presented in a way where you can see these holes (like, literally that's what terms and conditions have. And contracts in general), but as teens, parents can hide stuff. It already says a lot that he didn't know this would be an issue until he found videos - not even the site itself.\n\nKid's smart. Just needs to keep advocating for himself.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "They “hid the details” ?!?! Are you joking?? Dunno how good of a job they did “hiding it” if OP was able to look it up and find out himself — AFTER the fact of mom paying a (expensive, I’m sure) deposit",
                  "id": 42,
                  "comments": [
                    {
                      "score": -2,
                      "content": "Informed consent. You can't consent without information, ergo he wasn't able to properly consent as they didn't tell him. They hid the details by apparently just not telling him it was that kind of camp. Him looking it up after the fact is irrelevant except as to the fact that he then knew he wanted to withdraw consent.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "He's already in a program that is similar so I think that's a far reach",
                  "id": 44,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Well, the one he's in clearly doesn't mandate appearance.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Why should he pay it back, the parents should have gone through the terms and conditions with him",
              "id": 46,
              "comments": [
                {
                  "score": 78,
                  "content": "He should pay it back because he's the one who said yes and then changed his mind. His parents didn't surprise him, they asked if he wanted to go. They spent the money with the understanding that they were furthering something OP was interested in and enjoyed. \n\nSummer camps aren't cheap. His parents are going to be out anywhere from several hundred to several thousand dollars because of him. He's clearly demonstrated that he's capable of looking up what all the camp entails, he should have done that prior to saying he wanted to go. We're only a few weeks out from summer break at this point and it is probably too late to cancel and find something new. \n\nI don't blame OP for not wanting to go -- but the offer should be made to repay what they've spent, either through working it off with chores or through a part time summer job, whatever. *Something.* They're out that money because he waffled on his decision.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 80,
                      "content": "I'm on the fence about the idea of expecting OP to pay back the money. The post said the mom paid a deposit, so hopefully that's only a fraction of the total cost of the camp. Also, I'm not sure OP should be expected to have known that going to summer camp would involve having their hair shaved off. That's not a normal thing that happens in a summer camp. Sounds like the mom and OP should have had more of a discussion about what this camp entails before mom handed over the money. From the post, it sounds like the mom was aware of this when she signed OP up, and surely she knows that a teenager would have an opinion about their long hair being shaved off?\n\nSo I kind of think mom is more at fault here for not communicating about the expectations of the camp. Still, offering to pay back the deposit might be the most diplomatic way for OP to back out of the camp.\n\nTbh I find the idea of sending your child to a military camp where they shave off children's hair quite disturbing, and maybe that's biasing my judgment here.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "The parents were the ones that pitched it to him and he didn't even look at any videos of the camp yet. They shouldn't have taken his tentative yes as a final confirmation.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "It seems very strange that they didn’t sit down together and look through what the camp actually was, literally just visiting a website together.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": ">Yes but he should pay his mum the deposit back...\n\nAbsolutely **not**. Like another commenter pointed out, OP is a minor. Mom jumped the gun.",
              "id": 51,
              "comments": [
                {
                  "score": 8,
                  "content": "We don't know \"Mom jumped the gun\" there's no timeline from when OP said yes to when OP watched videos online. It could be the same day then yes. It could be weeks to months later, then no.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "[removed]",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "And if you WANT to join the military....still don't go to what appears to be a prep program. I've been active duty for almost two decades and the kids that go through these are the most insufferable and arrogant people that end up joining. If they even make it through basic training, they usually end up shunned by their units pretty quick for not being able to adapt to the team mindset and usually only end up doing a single enlistment (or less).",
          "id": 54,
          "comments": [
            {
              "score": 16,
              "content": "Gotta say, having met some of those ROTC kids in high school, definitely agree. I spent most of my life jumping from academy to academy because it was easier with my mum’s stations. I thought I knew military kids. \n\nMeeting ROTC kids was the worst. Myself and two other students applied to West Point second semester of junior year, and my counselor thought it was a good idea to make a little application group out of it. I hated every second of it",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "[removed]",
          "id": 56,
          "comments": [
            {
              "score": 15,
              "content": "THIS is the most important thing! Never agree to something if you don't know what they are...",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 44,
          "content": "[removed]",
          "id": 58,
          "comments": [
            {
              "score": 44,
              "content": "I mean, if I have to put down a deposit for an activity for my kid, I'm not just going to say \"Hey, do you want to do this?\" I'm going to pull up the website to have them look at it, or explain what it entails, and then give them a few days or a week to think about it, before I actually sign them up and put money down.\n\nOP clearly didn't know what this was, which means their parents accepted their \"yes\" without leaving them a couple days to research and think about it.\n\nSo while, yes, OP should have said \"Maybe, sounds interesting, let me look into it and I'll get back to you!\" I also think a reasonable parent would have said \"Do you want to do this thing?   Let me know if a few days once you've looked into it!\"",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Yes. But also, if you did not, it is ok to back off if it turns out later program requires something you cant accept.",
              "id": 60,
              "comments": [
                {
                  "score": 8,
                  "content": "[removed]",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "[removed]",
          "id": 62,
          "comments": [
            {
              "score": 4,
              "content": "Not surprised, I know someone who in the UK was part of some form of RAF club and they were made to do so sorts of stuff as if they were formal recruits",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "There is no way OP didn’t know the camp wouldn’t require a buzz cut. A cursory glance at the camp online and it is clear that all the campers have buzz cuts",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Agreed, NTA, but those who say your should have investigated prior are also right--but then so should your mother and she should have made sure you were aware of the requirements before paying the deposit. You're a minor, she's your mother and programs like this come with risks besides a terrible haircut. No one did well here, but your mom is the adult and she fell down on the informed consent part of the decision making process. Nothing about this program should have come as a surprise to either of you. If you want to take the high road, make arrangements to pay the deposit back in small, easily managed amounts over a generous period of time and consider it the cost of learning that military programs exist to recruit, not provide exercise and comradery.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "\"Brainwashing center\" \n\nFTFY",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "This is the same post from the son’s point of view from a couple of weeks ago. We already told the mom she was TA.",
          "id": 67,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2043,
      "content": "NTA. You should have looked it up before saying yes, that's true, but if you can change your mind and if the summer military program isn't an obligation, then do whatever you want.",
      "id": 68,
      "comments": [
        {
          "score": 775,
          "content": "But you need to pay your parents back",
          "id": 69,
          "comments": [
            {
              "score": 181,
              "content": "I generally agree with this take but the other problem for the parents (I’m not sure how old OP is) is finding an alternate summer camp. They book up fast and there are a lot of bad ones to avoid, so figuring out an alternate plan will be part of the responsibility too",
              "id": 70,
              "comments": [
                {
                  "score": 411,
                  "content": "Is it essential that OP goes to summer camp of some sort?",
                  "id": 71,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Lots of parents use summer camp as child care so it depends on how old op is",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Mom (or OP) should check with the program. Sometimes deposits are actually refundable if there’s a waiting list and someone can take OP’s place",
              "id": 73,
              "comments": [
                {
                  "score": 35,
                  "content": "Yeah, my thought was that Mom needs to call the program and see what the options are instead of just saying \"sorry, deposit down, no options\"...  sounds like OP's Mom just really wants OP gone for awhile and this program was a nice was to do that.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "As a parent, no, not really, it is absurd.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I wouldn't even go this far, looks like OP's parents both served and are trying to pressure them to serve as well, which is super shitty of them.",
              "id": 76,
              "comments": [
                {
                  "score": 12,
                  "content": "I disagree, OP's mom asked them if they wanted to join the program. A parent who would force the kid would just enlist them without their consent. Op said yes.",
                  "id": 77,
                  "comments": [
                    {
                      "score": -1,
                      "content": "You do known you can't enlist another person... right? A 16/17 year old can enlist with parental consent. That means that individual first had to make the decision and then have their parents sign off on it (or wait till they are 18 then do it anyway). \nA parent cannot sign their child up for military service.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1701,
      "content": "It depends. NTA if you are still in high school, if your parents didn’t tell you about the deposit, or if the deposit is small enough for you to reimburse them in a reasonable amount of time. If you’re in college or older and they did, YWBTA if you don’t  follow through. \n\nThough, as the partner of a former Marine, I want you to know it’s important to be aware the Marines reinforce stuff like head shaving at their summer programs in part because they use them to “break” potential recruits and increase their chances of feeling like they don’t belong anywhere else, so that they will want to enlist. And if your family is trying to pressure you into Marine academy programs, they may well try to pressure you into actually enlisting. If that’s something you want to go into fully informed because YOU want to, then that’s your choice to make, but if not, I am BEGGING you not to do it. \n\nWhy? Partner joined up at 17 to one-up his abusive step dad, an Air Force guy who used his strength, violent tendencies, and fake superiority to terrorize my dude and make him feel worthless. And damn if he wasn’t crazy, stubborn, AND talented enough to shut the guy up forevermore with his exemplary performance (step dad couldn’t even come close). But even the experience of going through boot camp and the crucible created lasting trauma for him, and that’s not uncommon at all. \n\nCould he save me in a zombie apocalypse or if society collapses? Could he kill someone with a knife in hand-to hand combat? Almost certainly. But he’s also 50 and about to enter rehab again after a 12-day alcohol bender that nearly killed him (it would’ve had I not found him near death and sent his ass to detox), and the trauma he experienced in boot camp is part of the reason. \n\nThe military’s goal is to make excellent SOLDIERS— not healthy, whole human beings. The two are very often incompatible. If you are okay with this, then it’s not my business. But please, PLEASE understand: a summer program is one thing, but enlisting is NOT a decision you should let anyone else railroad you into. Type “marines crucible trauma recruits” and you will find some hecking terrifying horror stories. \n\nReally not trying to make a statement about the objective value of the Marines, but it’s SO important that you learn what you’d be getting yourself into if you are considering going farther with these people than a low-commitment exercise program. If this institution is not right for you and you enlist for the wrong reasons, it could literally still be jeopardizing your safety, life, and marriage at age 50. \n\nBe well.",
      "id": 79,
      "comments": [
        {
          "score": 274,
          "content": "My dad is in the military (not the US tho) and most of what you said is spot on. Thankfully, my dad had great counseling both during and after his service, so he is doing a lot better. But some of the things he went through... I just cannot imagine it. \n\nHe had to carry the casket of one of his best mates home. I don't even know what to say about it.\n\nI am sorry about your partner, I hope he gets better, and I wish him a good recovery. I wanted to say quick, but quick isn't necessary for the better. Take care!",
          "id": 80,
          "comments": [
            {
              "score": 181,
              "content": "Thanks for the warm remarks and really sorry your dad went through that. My guy tells me stories from boot camp and beyond, and it’s so upsetting to think they’d subject a young teen boy to that that I literally have to suppress the urge to vomit. He says he doesn’t even tell me a lot of the bad ones because I “can’t handle” knowing. I know I could, but I think it’s too painful for him to discuss. \n\nThe Marines in the US have a VERY consistent pattern of tempting teens away from abusive, authoritarian, or financially insecure homes with empty promises of free education, adventure, and “belonging” before they reach adulthood. They start wearing them down as young as 14. Then at 17 they try to get them to enlist, then they subject them to a huge amount of violence and brainwashing and deem them “adults” if they survive it. But just because your body leaves intact, that’s no guarantee the heart and mind are not mangled beyond recognition. Then the choice becomes sign the REST of your life away to stay in a familiar substrate or leave at the first opportunity with almost zero support and no idea how to live as an independent adult. And here the VA is a joke; they do NOT help those with mental illness or addiction at ALL. \n\nMy guy checks into rehab for about the 12th time in 8h, so I am having an especially hard time containing my utter hatred for the US military this morning. It’s really hard and overwhelming to talk  about, but if I can prevent even one innocent kid who’s rightly skeptical of signing away their bodily autonomy from getting sucked in against their wishes, it’s worth talking about what they did to the love of my life.",
              "id": 81,
              "comments": [
                {
                  "score": 55,
                  "content": "Yeah, the US army is something else. I had to fill out forms for drafting last year, and it gave me anxiety to the point I threw up. Thanks to my depression and suicide attempts, I was not drafted, and I have never been more grateful for my mental illnesses. \n\nIt's honestly disgusting that they force us to make such life-altering de at that age. My dad was 19, turning 20. But heck, he wasn't mature then either.\n\nBecause some people apparently doesn't read the entire comment thread: I AM NOT IN THE USA! I REPEAT: I AM NOT IN THE STATES. I WAS NOT FILLING OUT FORMS FOR DRAFTING FIR THE US ARMY.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Oh, you can enlist at 17 in the US, with parental consent. Because you’re not old enough to legally enter into a contract.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "The US hasn't used a draft since the 70's...  filling out your selective service card doesn't mean you would have been drafted.  It sounds like your mental health got you out of the requirement wholesale anyway...  but even if you had been found \"fit\" to stay on the draft roles, you wouldn't have been drafted anyway.  Congress has to enact a new draft for those lists to be used.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -8,
                      "content": "Homie you weren’t drafted because the US hasn’t drafted anybody since the Vietnam War.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "> My dad is in the military (not the US tho) and most of what you said is spot on.\n\nMy brother was air force (not the US) and got recommended by most people to leave before 30 or stay until retirement..\n\nHe left and is happily part of society now. But be sees how his former mates are disfunctional",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "The army is the same way. My husband has stated for years, had he known what he does now, he would have never joined. I've even heard him say that he wished he died in combat because that would have been a lot nicer and easier than living in fear and in constant fight or flight mode. He paid with more than his life. Those 10 years in were hell, but he has the rest of his life that he's forced to carry his trauma through.",
          "id": 87,
          "comments": [
            {
              "score": 23,
              "content": "I’m so sorry that happened to your husband. Your heart must hurt so for him. And the truth is, the trauma often begins before they’re even deployed, because they start with CHILDREN, remember. It’s one thing for a grown adult to be thrown in a gas chamber with 30 other people, tear gassed with military grade chemicals, and while blind and puking told to clear and don their mask. But imagine that person being a terrified kid who was already fleeing a shitty home life void of love, safety, or acceptance.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "> If you’re in college or older and they did, YWBTA if you don’t follow through.\n\nI strongly disagree here. It is not even like parents would gained something by OP going if he is at college. There is no reason whatsoever for OP to follow through. If anything it will be more expensive for parents.\n\nMaybe parents did not know about hair requirement and excessive militarization. In that case, it is ok to change opinion upon learning new information. Maybe they did - in that case they left it out intentionally and op should not let himself to be manipulated that easily.\n\nAnd I am parent, I am not college student seeking free money. If I paid deposit for camp and a collage aged offspring has good reason not to go, I am loosing nothing by the college aged offspring not gong.",
          "id": 89,
          "comments": [
            {
              "score": 16,
              "content": "I think I may not have been clear, but what I meant was: if the parents are still paying for a college age adult’s “summer camp” then that person has a responsibility to 1) inform themselves before saying yes and 2) reimburse the parents if they were aware of the deposit. But nobody is ever obligated to sign up for participation in military anything, ever.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "THIS\n\nMy father was in the marines for only 2 years back in the early 60s and it literally became his default personality. He was a good man who became a terrifying psychopathic monster when black-out drunk which was unfortunately often.\n\nWhen i was your age and not sure what to do with my life i thought maybe i should join.\n\nHe drove me to a military hospital and told me to go inside and ask them if they thought i should join.\n\nI got the point.\n\nNo offense but your(OP) parents are fucking morons.\nYou’re NTA, but do pay them back bc you almost signed yourself up for this shit through apathy",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "I’ve been in the military for 16 years, Marines. I don’t exactly agree with your assessment. I doubt your husband could kill someone in a knife fight in that condition. I also think the military has improved on creating well rounded individuals. It’s not a perfect system and not everyone is suited for service, but I agree with your overall assessment that it truly needs to be their decision. I also find no fault in OP not wanting to shave their head and backing out.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "I am sorry this happened to your husband but this is not universal true.  I have several family members plus by current boyfriend are all ex soldiers and are healthy productive adults.  The military does not necessarily create traumatized people.  I would certain support my kids joining a branch of the service",
          "id": 93,
          "comments": [
            {
              "score": 9,
              "content": "OP said don’t go unless you really want to, not that every person that joins the military ends up traumatised.",
              "id": 94,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 339,
      "content": "I’d advise you not to give up your bodily autonomy. NTA",
      "id": 95,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 328,
      "content": "https://www.mma-tx.org/admissions/tuition-fees/\n\n?? Is this it? \n\nThe summer camp doesn't show a deposit. There's a $150 application fee that is nonrefundable. There's only a reservation fee if you attend the actual school. Is your mom trying to trick you into military school or just a liar if this is the correct school. Or did she pay it all or buy uniforms?.\n\nTUITION & FEES SCHEDULE\n\nSummer Camp 2023 costs\n\nFOUR WEEKS\n\nApplication Fee (NON-REFUNDABLE):\n\n$ 150.00\n\nUniforms & Personal Care Items (Retained by camper):\n\n$ 600.00\n\nTuition, Room & Board:\n\n$ 4,500.00\n\nTOTAL SUMMER CAMP COSTS:\n\n$ 5,250.00\n\nWhy on earth would your parents agree to a $5K four week summer camp that isn't useful for anything? Don't go there. The school costs $47K a year to indoctrinate children.",
      "id": 96,
      "comments": [
        {
          "score": 178,
          "content": "> The school costs $47K a year to indoctrinate children.\n\nThe whole idea of military schools is creepy beyond belief. North Korea probably has them.",
          "id": 97,
          "comments": [
            {
              "score": 67,
              "content": "This is a school where rich people dump the kids they didn't bother to raise I would assume. Otherwise spending $47K a year to get your kid into the military that doesn't pay anything is uh...they are creepy. \n\nAs for North Korea, all men over 17 have to enlist in the military for ten years!! Women for three years. If what I looked up is correct. \n\nSouth Korea has service requirements as well. \n\n*South Korea maintains a strict policy of mandatory military service, which requires all able-bodied men between the ages of 18 and 28 to serve in the armed forces for about 18 to 21 months.*\n\nhttps://www.ndtv.com/world-news/having-more-children-could-exempt-south-korean-men-from-mandatory-military-service-heres-why-3895774/",
              "id": 98,
              "comments": [
                {
                  "score": 42,
                  "content": "> This is a school where rich people dump the kids they didn't bother to raise I would assume.\n\nThis from their homepage is quite suggestive. I can all too easily imagine the sort of parents who would buy into this, and the phrase \"warm, supportive upbringing\" is not involved.\n\n*Is your son prepared for college?  \nAre life's distractions limiting him?  \nHas he set appropriate priorities and goals?  \nDo you want him to stand out as a leader?  \nIs maturity or confidence an issue?  \nIs he bored and in need of a challenge?*",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -14,
                  "content": "It's quite common for civilians with no aspirations for the military to go to military schools. These schools are designed to reinforce positive traits to include discipline, which does work. However, a lot of people tend to go back to their old ways when put back in their old environment, making it functionally a waste of time, lol.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "If that's it, then mom is definitely the AH for claiming that he now has to go when they've put down $150.\n\nOf course, mom is also the AH for not checking again with the teenager before putting down $5,000, if that's what she did.",
          "id": 101,
          "comments": [
            {
              "score": 13,
              "content": "I think this was a bad idea to start with. My kid does this fitness program so let's send him to some kind of military related summer camp instead of any regular camp or a science camp or say...\n\nhttps://carnegiesciencecenter.org/summer-camps/summer-camps-2023-ages-12-14-survivors-guide/\n\nZombie survival camp.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Wow.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "That's the deposit... Some people have that kind of money....",
          "id": 104,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 278,
      "content": "You should check things out before agreeing to do them. But NAH. Unless you count ex military parents pushing you towards the military as AH behaviour (which I kind of do, but that may be because I'm not am American, and not in love with every service member!)",
      "id": 105,
      "comments": [
        {
          "score": 78,
          "content": "Or their parents should communicate as well and they should all look at the pros and cons of joining such a program.",
          "id": 106,
          "comments": [
            {
              "score": 44,
              "content": "Also I wonder how long it was between when they asked and when they paid. And how serious a convo was it? If they asked in passing they absolutely should have waited and made sure he looked into it more seriously before paying.",
              "id": 107,
              "comments": [
                {
                  "score": 22,
                  "content": "This!\n\nI mean, if my sweetie asked if I wanted to hear my favorite artist in concert, I'd of course say yes.  If she then told me that she'd spent $1,000 on non-refundable VIP tickets at a venue four hours away, so we'd have to stay overnight as well, I'd be a little pissed.  (Not that my favorite band would have VIP tickets like that, thank goodness.)\n\nBack in the day, I couldn't imagine my parents spending big bucks without running it by me first -- \"You said you were interested, but should we go ahead and put down a $1,000 deposit on it?\"  If the parents have enough money that they don't have to be careful with it, well, then maybe they can eat the deposit.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 158,
      "content": "NTA\n\n&#x200B;\n\nJust refuse. And if your AH parents forces you, arriving there state that you do not consent to having your hair cut, and you will call the police over it. Should be enough to get you kicked out.\n\n&#x200B;\n\n&#x200B;\n\nAnd: DON'T SIGN ANYTHING: No waivers, no consent. Just state you are here without your consent and anyone touching you will be followed up with a call to the police. Put 911 on speed dial, and if necessary do it. How old are you?",
      "id": 109,
      "comments": [
        {
          "score": 56,
          "content": "Why the pointless drama?  He can just tell his parents he's not going (and pay them back the $150)",
          "id": 110,
          "comments": [
            {
              "score": 40,
              "content": "Because no parent has ever forced their kid to go somewhere they don’t want to",
              "id": 111,
              "comments": [
                {
                  "score": 13,
                  "content": "the parents don’t necessarily want him to go though, they asked if he wants to go he said yes and now she’s mad because he agreed mindlessly and cost her money",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -2,
          "content": "This is such an asshole response.",
          "id": 113,
          "comments": [
            {
              "score": 12,
              "content": "This is arecipe for protection against assault. And cutting someone's hair without their consent is just that.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 87,
      "content": "Did your mum post here a week or two ago? I’m sure there was a very similar post but from the mum about her son not wanting a buzz cut. It sounded like a lot of pressure was being put on the son by his parents. \nNTA",
      "id": 115,
      "comments": [
        {
          "score": 11,
          "content": "I remember that post!",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I was wondering the exact thing upon reading this. 👀",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Do you have a link at all?",
          "id": 118,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 84,
      "content": "NTA. (I think your mom may have posted here about a month ago. Or someone a lot like her.) If you're a minor, it was your parents' job to research the camp and what was required. If they've put pressure on you before about the military, would bet they did and \"conveniently\" didn't tell you.",
      "id": 119,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "If it's just a haircut, will she do the same? Since it's just a haircut and all. Somehow I doubt it. NTA",
      "id": 120,
      "comments": [],
      "relation": "Support"
    }
  ]
}