{
  "post content": "Last Thursday, my girlfriend went to a doctor's appointment, and he mentioned her weight and all of the issues that come with being 122kg/270 pounds. She initially took it as the doctor insulting her and decided he was a fataphobic \" quack\" and that she's not going to follow his advice. That's what I got told Thursday afternoon over the phone. Thursday night I get a call from her about people being judgmental.\n\nTo make a long story short, she's spent, since Thursday, holed up in her apartment, binging. She's doing this I'll-Show-You to the doctor, that's my interpretation. I know she's binging because I can see on my phone where she goes. Grocery store, fast food place, fast food, fast food. She canceled date night as well. This morning, I sent her a text saying that I loved her, and that this current situation is worrying me. I told her that, while again I do love her & I'm not here to police her body, she needs to stop lying to herself and acting like the Dr. had some pre-planned plot to make her feel bad. I told her it's time to be honest with herself and about her weight. She texted back that I'm being unkind & judgmental.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 3726,
      "content": "NTA.  But if your gf is 270 pounds and apparently revenge-eating trash food, she may have some serious psychological problems and needs to, for her own health, change her relationship with food.  Assisting her will be really difficult but love and kindness will help.  Good luck to both of you.",
      "id": 2,
      "comments": [
        {
          "score": 787,
          "content": "Thanks",
          "id": 3,
          "comments": [
            {
              "score": 1202,
              "content": "She sounds like she has an ED but you need to listen to what she is actually saying. Doctors are notoriously awful at providing adequate care to people over a certain weight, one that has arbitrarily shifted many times, and ignoring real issues the human living with them asks for help with. Maybe listen to her before assuming that someone from a profession with a long and documented history of underserving people exactly like her is the better source. \n\nHighly recommend the podcast Maintenance Phase for a great scientific breakdown of how wrong much of our understanding about human weight is and the stigma that comes with that. \nhttps://podcasts.apple.com/us/podcast/is-being-fat-bad-for-you/id1535408667?i=1000542081632",
              "id": 4,
              "comments": [
                {
                  "score": 182,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 570,
                      "content": "Depends on what the issue is. I had a bad back. Told to lose weight- I had just had a baby. Lost weight. Still had pain in my back. Finally got an MRI and I have an autoimmune disease called Ankylosing Spondylitis. Doctors don’t bother running simple tests if you are overweight. There is actually tons of research if you look. Fat people know they are fat.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Second to this. I have an eating disorder and I’ve had it my whole life. More than one actually. I am well aware of how doctors treat women who are overweight. This woman is not those women. She is deliberately going against not just this doctor’s advice, but any doctor’s advice. If she doesn’t want this to be about her weight, she needs to not make it about her weight. And that means not deliberately hurting herself to “make a point”.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That’s pretty unfair. She could have any number of health issues going on and been chasing help for years and being ignored and this is just another spiral of “well you blame it on my weight and I’ve been great for 6 months, I give up”",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Exactly this, and fat people often receive poor (if any) support/treatment for disordered eating behavior. Even medical professionals have the opinion that it's about willpower and not a complex web of psychological, emotional, physical, and social factors that result in these behaviors and how they interact with the body itself over time. \n\nCan't know exactly what based off OP's post, but it sounds like the discussion with her doctor was weight-first focused and triggered something for her. OP, you need to actually talk to her about her feelings regarding the doctor, her body, etc. and treat her like an expert on her experiences without shame involved. Trying to do \"tough love\" regarding her health is is really not going to be effective because 1) she lives in her body all the time and is constantly reminded about it 2) it just builds more shame around it for her and she will feel less comfortable even approaching it.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "This! I've been \"obese\" since I was 14 and got a full figure. I'm really tall and built solid. The only time in my adult life I was barely in the normal weight range for my height and age was when my thyroid went hyper and I never felt sicker in my life. I'm now starting to push into the morbidly obese category based on my height and age due to my thyroid being hypo, but I don't look it. Anyone looking at me in passing would think I'm a little chunky, but not morbidly obese.\n\nThe charts do not take body type into account at all and it causes so many psychological issues. I'm really fortunate I put in the time when I was younger to educate myself about my normal and stop relying on other people's idea of normal.\n\nYes I could probably lose some weight and be healthier, but it's not that easy. A lot of bigger women have health issues that contribute to or cause their weight problems, but aren't adequately treated because the problem is obviously that they're fat. Diet and exercise isn't the answer to everything.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 31,
                      "content": "First time o ever thought I was overweight was when I was 15, 5'3\" and 130lbs because me bmi said I was\n\nThe difference in 3 months when I went from 110 to 130 was I went from a b cup to a d cup and my butt grew too to balance out\n\nbmi is crap and not effective for any sort of athlete",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "This. I had the same experience (only without the full figure) At 6 feet tall (female) I once weighed 125 lb (57 kg, or 9 stone) due to hyperthyroid. After the thyroid blew out, I ballooned up to 200 lb (90 kg, 14 stone). I had very little control over this, but the weight was blamed for an actual health problem that I had (back pain and sciatica). I'm back to a reasonable 155 lb (70kg, 11 stone) and guess what - I still have the pain. Now my physician has no answers other than surgery.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "I've always been big, the charts say I should lose 45kg, putting me to a weight I haven't been since the very start of puberty when I was barely a teen. I'm not sure that's even physically possible for me to do. I've gone from straight up and down to in and out and a waist in the middle. \n\nI've recently started having huge body image issues for the first time ever - I mean not looking after myself (not looking in a mirror, not brushing my hair or my teeth etc is a normality for me and has been for 15 years) is one thing but suddenly this....awareness and thinking nothing is going to look right ever and wtf is up with my skin and omg I want to hide under a rock.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I don’t disagree with you; as a fat, short woman I’ve been told for years that my weight was the reason for all my medical issues for years, ignoring the fact that my weight is partially the result of other medical issues that were ignored (thyroid issues, depression and genetic predisposition); however, I don’t try to get revenge on my doctor for suggesting I would benefit from losing weight and that many of my current medical issues are weight related.  High cholesterol, plantar fasciitis, back pain, high blood pressure, there’s no denying that losing 100 pounds would help these conditions.  His GF has chosen a very unhealthy (both medically and mentally) and potentially dangerous path that will definitely NOT do anything to fix any of her problems, and is firmly in the “cut off your nose to spite your face” family.  It won’t stop her doctor from suggesting she lose weight, and binge eating isn’t good for anyone.  Binge eating greasy junk food could land her in the hospital.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "270 lbs is obese and highly concerning !!!!!! Her heart is working so much harder \nto pump blood and all her organs are under more pressure. The doctor is right.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Omg! You should tell her she's fat then, otherwise she'll never know!",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -8,
                      "content": "What medical conditions does she have? Because I didn’t see where OP mentions what she went to see the doctor about. You seem very confident that whatever the medical problems are, they’re problems with her weight.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Weight aside, groceries, fast food, fast food, fast food is a very clear indicator that she is not eating a healthy diet and her body is going to reflect that in many unhealthy ways besides fat stores.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You should tell her that and explain how she's fat again. If only more people would tell far people how to live.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Love this podcast, it was incredibly validating to hear people talk about this subject in a real way that doesn’t make people feel shamed",
                  "id": 20,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Love my data queen! Really helpful to not just address attitudes, but the actual science and research that all the genius suggestions of \"just lose weight\" come from. Deciding being fat is bad and working backwards is way more sensical than our current claims about causality.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Thiiiiiiiiis. I am currently being ignored over unexplained weightloss because I am fat and they see it as a good thing. I'm literally wasting away in a short amount of time and soon I will be accused of either not eating purposely or something else. 🙄 american healthcare wooo",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Uhg, I feel you so much on this. I was having seizures constantly for a few years and during the \"bad periods\" I would tend to just sit on the couch and space out for weeks at a time, only drinking meal shakes to stay alive. One of these bad times, I lost 40lbs in a *single month* and since I was overweight to begin with, all any doctor did was fucking congratulate me for basically slowly dying. I even straight up asked a few \"does losing weight this fast when I am not eating or moving even concern you in the slightest?\" and they just shrugged at me. Then again they all shrug at my seizures too so fuck me I guess.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Oooh please make sure they check your thyroid thoroughly and also that they check for tumors on your pituitary and thyroid.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Doctors are so notorious for this, im a Hefty girl mainly because i have pcos (so it’s difficult to lose weight) they refused to help me at every twist and turn and are only now helping me because i got diagnosed with CKD at 25\n\nSeriously have a discussion that isn’t judgemental, ask what exactly the doctors have said, it doesn’t sound like an ‘I’ll show you’ it sounds more like she’s seriously depressed and crying for help because doctors are crap at giving it",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yes! I love Maintenance Phase!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Plus you can only really help those who want the help.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "Can’t emphasize this enough.  Your gf likely has trauma from earlier times in her life and food was her source of comfort.  For many people in this situation the basic idea of not having food as a comfort sends them spiraling.  I think you should really focus on getting her and you both into counseling.  The weight isn’t going to come off until she deals with the root issue of what’s driving the eating and the reliance on food.\n\nNTA, obviously.",
          "id": 28,
          "comments": [
            {
              "score": 38,
              "content": "This is incredibly good advice. And spiraling is normal in this matter.  It is a reality check.  I'm a bigger woman and while  OPs  GF is heavier than I am,  what worked for me was to focus on adding things to my life style rather than taking them away.   I've lost about 30 lbs adding walking to my daily life,  adding eating vegetables, adding drinking water.  I can still have other food.  I love pizza and I can still have it if I eat a salad and drink water with it.  I also don't care if I lose weight.  I'm trying to focus on how I feel.  Is it hard for me to walk anymore?  No, I'm actually able to run short distances again.  Do I enjoy the vegetables that I've added to my diet?  Yes because not everything needs to be steamed. You can roast and air fry with seasoning.   Etc.....   Approaching my own brain with kindness rather than shame.",
              "id": 29,
              "comments": [
                {
                  "score": 20,
                  "content": "I would like to wish whoever invented air fryers a very good life and afterlife. I love that thing so much.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It’s healthier and easier to clean.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Hmmm my husband asked if I wanted a air fryer for Mother’s Day I dismissed him because an appliance… now I’m reconsidering…",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Good for you!! What a healthy perspective!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is what Ive been doing. I was dignosed with diabetes so I cant just eat everything I want, but my doctor said \"less carbs, more veggies and fruits, no sugar, lots of water\" and it has worked so far. Of course I lost weight but that was not the main goal.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "OP I don't recommend going at her, especially right now. As someone who had a severe ED, she is going to be very defensive and to truly get over it, needs to think you're on her side. Obviously that doesn't mean encourage her or even be okay with it but she needs unconditional support rather than attacks. Just like she's doing an \"I'll show you\" because of her doctor, it's going to be easy to trigger that with criticism. \n\nJust based on what worked with me or what I would have wanted, I'd let her know you're absolutely not judging her and that you're open to talk if she ever wants to vent or needs support, and you will not criticize or judge what she tells you. That you care for her and if she wants or needs anything (idk, I always wanted to explain the negative thoughts and the reasons I had them but I didn't have good support) to let you know. I'm not aware of your diet, nor am I saying you need to change for her, but depending on circumstances you could offer to make dinners for a bit or whatever you feel comfortable with accomodating (taking over the shopping, temporarily taking out her number one trigger food out of the house, going on walks together, etc). Try to make passive statements; an example is instead of saying she needs to stop lying to herself and taking the doctors words as an insult, you could ask what part of the doctors statement did she feel wasn't appropriate, and better understand her that way. \n\nEDs have a lot of psychological aspects, and is very similar to addiction with the mindset. Just like an addict has to want to help themselves, it's the same with an ED. And that isn't placing blame or anything, just saying that the best way to successfully recover is to want to recover, which usually needs a good support system.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I also think people need to understand bro g FAT and OVERWEIGHT still exists no matter how much body positivity we preach. Yes, you do not have to be BONE skinny or look like a celebrity to be beautiful, but yes you can also be fat.\n\nI say this as I myself was about 60 lbs over my ideal weight last year. With hard work I lost maybe 12 lbs before my doctor appt. I told him that I thought I had a thyroid issue because my neck was bulging. He politely grabbed my neck and said, “your thyroid levels are normal, this is just fat!” I was MORTIFIED, but I could only blame myself. This was AFTER I tried on the scrubs they left for me and I couldn’t get the bottoms on.  I secretly had snuck another (larger) pair! I thought I was able to hide how much I’ve gained but NOPE. I needed to let reality in!\n\nI am very proud to say today I’m about 40 lbs down and continue to work on the last 15-20, but I’m happier than I was with the excess weight gone. \n\nPS My neck finally looks NORMAL again!\n\nNTA",
          "id": 36,
          "comments": [
            {
              "score": 1,
              "content": "There always have been and always will be fat people. I'm so sorry your internalized fatphobia has you feeling this poorly about your body. I hope you learn to love yourself and address your health separately from your appearance.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I’m the girlfriends weight and I can’t imagine the level of self delusion needed to be surprised it’s part of the issue. this is the heaviest I’ve been, and I am *struggling* I find myself running out of breath while talking, my knees kill if I’m standing too long, my feet throb, I get heart burn at least once a week, I’m having the worst sleep I’ve ever had. \n\nLoosing weight is *hard* coming to the realisation that you’ve done this to yourself and you’re the only one who can fix it, is *hard* but to go to a doctor a be SO shook by being told your weight is an issue? And then to lock yourself in your room and binge it for days? That’s a real problem and lack of self awareness",
          "id": 38,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 573,
      "content": "NTA- it seems like your GF isn’t just overweight, she has an ED. Sometimes we need tough love to face these things. You seem like you are doing your best to navigate this in a supportive loving way, without sugarcoating the truth.",
      "id": 39,
      "comments": [
        {
          "score": 425,
          "content": "Tough love is not a good course for eating disorders. Many eating disorders are caused by some form of shame. Notice how she began eating more after the appointment where her weight was mentioned. \n\nShe’s not eating more to spite the doctor, she’s eating more to cope with her feelings of shame. \n\nShe needs love, support, patience, and therapy to heal from her eating disorder. Tough love will certainly make it worse.",
          "id": 40,
          "comments": [
            {
              "score": 16,
              "content": "There is no one-size fits all solution for eating disorders, or any disorder for that matter. Tough love is not the same as shaming and can still incorporate patience, love and support. As someone who has had an ED in the past, I can attest to that. Thanks.",
              "id": 41,
              "comments": [
                {
                  "score": 107,
                  "content": "Tough love isn’t a good behavior recommendation though bc it’s not specific and could encompass a wide range of responses. When it comes to EDs, there’s a lot of reactions that I’m sure the people committing would describe as “tough love”, even if to others they’re clearly shaming or not best practice. I think that explains the different reactions you and the person you’re responding to had to that phrasing more than either of you being wrong.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Exactly what you said.  To pretend there's a magic formula for how to care for a specific person just because they fall into the huge category of people with EDs is naive at best.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It's hard to just say what \"tough love\" is\n\nDepending on who you are talking to, it could be anything from loving encouragement to abuse, shaming, degradation, etc.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "Sure, but her ED is not OPs responsibility at the end of the day. A professional expressed concern and OP agreed.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "I’ve seen this argument many times. How about a combination?\n\nBit tough love and a more empathetic, psycholigical approach?",
              "id": 46,
              "comments": [
                {
                  "score": 4,
                  "content": "Full disclosure: I do not typically work with EDs but am a psychologist. \n\nYou can’t really do both. \nThe Psychological approach would include cognitive behavioral methodologies most likely along with family/couples therapy. In addition to working with a dietitian and a medical team (at least in residential settings). \n\nTough love is not a good way to work with eating disorders as they tend to be triggered/stem from shame and a need for some aspect of control. \n\nAs a therapist I am all for direct, “tough love” mentality, it’s how I work with my clients. But for EDs it’s not best practice.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Thanks for your response. I appreciate your experience and views :)\n\nYeah, when I thought you should apply ‘though love’ is like:\n“Did you do the exercise already today?”\n- no\n“But the doctor made it clear. Please, it is important”\n- I’ll do it tomorrow\n“Thats what you said yesterday”\n- yeahyeah\n\nOf course this example is very simply put. However, sometimes you need to be tough and direct. Otherwise, if you dont have any consequences, they will walk all over you and ignore it. If you get my point",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Thanks",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I don't even think this is tough love to begin with. Calling a problem by its name isn't anything like that. Like how could OP have said that any less \"tough\"?",
          "id": 50,
          "comments": [
            {
              "score": 4,
              "content": "Yeah, that was not tough love. Telling somebody very kindly the truth is not 'tough love', it is simply telling them the truth like an adult when it's obvious that she is in denial.\n\nMany addicts are hell bent on destroying themselves to spite other people. They act like other people's rescue missions are the only way to prove love, but if you do it the wrong way then you don't love them at all.\n\nThis is pure addict behavior and as most addictions food addiction destroys lives.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[removed]",
          "id": 52,
          "comments": [
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 296,
      "content": "NTA, but your gf might benefit from therapy",
      "id": 54,
      "comments": [
        {
          "score": 70,
          "content": "agreed",
          "id": 55,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 258,
      "content": "NTA.\n\nShe clearly is binging because the doctor said something that hit a nerve. She probably was conscious of her weight and now that a medical professional has told her it's an issue she's responding with denial. \n\nBe careful with how you do phrase things though, because she's clearly in a very fragile state.",
      "id": 56,
      "comments": [
        {
          "score": 85,
          "content": "I'm trying to be as careful as I can",
          "id": 57,
          "comments": [
            {
              "score": 75,
              "content": "Also remember to seek help yourself if you feel out of your depth! Defo an intense situation.",
              "id": 58,
              "comments": [
                {
                  "score": 75,
                  "content": "what I'm battling with is, like, how much am I at fault? Like, I never intervened. If she was over and wanted pizza, we got pizza, if she wanted snacks afterwards, we got snacks",
                  "id": 59,
                  "comments": [
                    {
                      "score": 88,
                      "content": "You're absolutely not at fault for that. You just wanted to make her happy. \n\nJust try and navigate her to seeking help.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "That is up to her. You can't parent or police her. It's a different story if you were actively pushing the food on her.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Not in the slightest bit at fault. She's an adult. It would be worse if you tried to police her food against her will.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "As a woman that's 240 pounds and yes I have a problem with food you did nothing wrong. Honestly it would have made it worse if you tried to get her to eat healthy. I'm gonna be honest the healthy meals I eat are with my toddler and yes I need therapy because I eat my feelings and from the sounds of it so does your girlfriend, but she needs to accept that fact first on her own then ask for help on her own this isn't something that can be forced. Keep doing what your doing",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "NONE of it is on you. She’s an adult responsible for herself. You need to put your own mental health first. Think long-term what you want for your future and the type of person you want to be with. Don’t spend your life having to constantly take care of or reassure someone that should be capable of taking care of themselves.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "mantra for dealing with an addict:\n\nI didn't cause it. \n\nI can't control it. \n\nI can't cure it.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I used to struggle with an ED. I believe you never really heal from that, you just learn to deal with intrusive thoughts without acting on them. So I do know what I'm talking about to at least some degree. \n\nIt's not you duty to monitor and police your partner's eating at any time. She either makes the decision to eat every time or the urges may be (and probably are) compulsive in nature which on one hand means that it's not *really* her decision since she couldn't stop eating if she tried to but on the other hand this means that you would have absolutely no influence on that. \n\nI imagine that being the partner of someone with an ED would be incredibly hard. You can't do anything about it and if they refuse to get help or see the problem, all you can do is watch them kill themselves. Personally, if I relapsed, I wouldn't blame my partner if he walked away. It's not that I'm advising you to do that, I'm just saying this is an impossible situation for you and it's only natural that it's hurting you",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Speaking as someone with an eating disorder dating someone with an eating disorder, EDs are more like addiction than anything else. You cannot love someone into not being an addict. You cannot control another person’s ED. You can set boundaries and you can give each other support.\n\nMy GF has binge eating disorder. I have anorexia. I find it hard to be near scales without triggering disordered thinking. She weighs herself daily. She simply keeps them under the sofa and doesn’t weigh herself in front of me.\n\nShe finds cookies and cereal a huge trigger so if I have them at my house I put them away out of sight so she is less likely to find it hard to head off a binge at night because her trigger is just in eyeline.\n\nShe gets me to send photos of my dinner nightly to check I ate and ate enough. She asks me sometimes to portion out cookies or cereal and hide it so she can have one portion without triggering a binge. I always leave little notes in the bag or container to show support.\n\nBoth of us refuse to engage if the other is in self harm talk or exhibiting destructive behaviours like when she used to purge. I would go out and come back and then we’d snuggle or watch a show but I was not comfortable being around purging. She is not comfortable when I cook huge amounts to feed everyone but eat none of it as is a very anorexic trait. But it is pointless me taking the binge food out of her hands in the same way pouring out vodka doesn’t stop alcoholism. We both have to do therapy, recovery and put the effort in ourselves at heart. Support is just that. We have to self soothe first. And both of us have to pay for therapy privately as it is not available otherwise nor is the dietitian etc. We both have health issues directly caused by the eating disorder and we also have to manage those ourselves. We support each other but I am not making her lunch or doctor’s appts to sort a condition caused by her ED any more than she is doing the emotional labour for me. \n\nWe both had EDs before we met and so we can be a team but my anorexia recovery is as much mine to work on as my other disabilities. It is co dependent to have a partner or parent as an adult take all that on and no different to other active addicts. The fact Reddit can see partners should seek advice from orgs like Al Anon if with an alcohol or other addict but insists they must do it with food addiction or eating disorders is toxic. This enables the person with the ED and makes both miserable. It is on the addict and if it is not possible to have a healthy recovery dynamic then it is better to break up.\n\nMy GF and I have the understanding that should one of us relapse into refusing to address an ED then the relationship cannot continue. Same as if someone prioritises any addiction over partnership. You cannot stay in the hope they will see the light if they keep closing the door in your face. An ex BF broke up with me at my worst anorexic point for my refusal to accept it and do anything except get worse. I thought for years he was an AH for abandoning me when sick but with some distance I realise why he did to protect himself and that he was right because anorexia was not my fault but it was my responsibility. \n\nMy anorexia is linked to a lot of medical trauma in childhood and nearly every health issue I have is written off as my weight or my ED. And at times my weight was why I was that sick. At other times it was short sighted medical care and nearly killed me when serious things requiring emergency surgery were ignored because ‘anorexics are attention seekers.’ I am 43 and still having this medical trauma now to the extent I almost died in the pandemic when being thin meant doctors ignored appendicitis leading to sepsis and a collapsed lung. \n\nAll women in my experience get medical misogyny. At some point you have to self advocate to challenge it and you have to admit when they are telling you uncomfortable truths. I knew if I did not try to address my ED in my mid thirties I would likely not live to see 40 and while it hurt to have a doctor tell me that, medical truths hurt. It hurts to hear you have cancer. It hurt to hear I had sepsis and might die. Feelings cannot always be protected in medicine if you want to live. Life and death are blunt.\n\nNTA.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "That's the thing; you're not supposed to intervene by making food choices for her. EDs are shrouded in guilt and shame. If you tell her what she can and can't eat, it would probably trigger shame, and binge eating may result. She needs therapy, not a food cop, so you're doing the right thing so far. Suggesting to her that she get into therapy would be the right course of action. NTA.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -2,
                      "content": "Maybe don't approach her health and body as something that has a fault. Is your ideal gf a different person? If not, probably don't posit her body as something someone must be blamed for. If so, leaver her alone so she can find someone who doesn't want her in a fundamentally different package.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "One of the easiest ways to be \"careful\" is to talk about her *behavior*, not her weight.\n\nThink for a moment or 2 scenarios:\n\n1. You say \"Babe, the doctor isn't out to get you, you need to face that your weight is an issue\"\n2. You say \"I know that doctor upset you, but going on a binge like that isn't good for you. I think you should talk to someone. You should be able to feel good about yourself, no matter what anyone else says\"\n\nBoth methods address the issue. Scenario 1 addresses the symptom, but scenario 2 addresses the cause.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Sending a text was a mistake. At least call. Voice conveys emotions, text doesn't",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 137,
      "content": "NTA. 270 pounds is obese and she needs to get it under control. I'm a larger woman and I had to come to this realization too. She's lucky to have someone who cares enough to not let her self-destruct. \n\nI do think it's weird you follow her location that constantly though",
      "id": 72,
      "comments": [
        {
          "score": 65,
          "content": ">I do think it's weird you follow her location that constantly though\n\nYeah.  What's up with that?",
          "id": 73,
          "comments": [
            {
              "score": 44,
              "content": "It’s a feature in Snapchat.. lots of people have it activated as the norm.",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -68,
              "content": "kinda creepy right? and he’s already controlling about what she eats…",
              "id": 75,
              "comments": [
                {
                  "score": 39,
                  "content": "As someone else said, this is a feature snapchat and other social media have that most people use by default. How is he controlling what she eats at all? She's 270 lbs and binge eating because a doctor asked about it. That's not healthy and he's just concerned about his loved ones health. \n\nGet a grip.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "How’s he controlling her diet?? She’s 270 lbs",
                  "id": 77,
                  "comments": [
                    {
                      "score": 20,
                      "content": "If he’s controlling her eating then he’s doing an exceptionally poor job of it 😂",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Where do you see that “he’s already controlling about what she eats”?",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "If she consented to it, and he's worried about her, is it really that weird?",
          "id": 80,
          "comments": [
            {
              "score": -35,
              "content": "Yes",
              "id": 81,
              "comments": [
                {
                  "score": 22,
                  "content": "He said himself that she holed herself up in her apt and even cancelled plans they had. He is likely checking up on her bc he is worried, and rightfully so.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -19,
                  "content": "yes",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Other people have mentioned that it's a feature in Snapchat. It's also a feature on Apple phones - \"Find My Friends\" lets people who have permission view your location. I know a lot of people who have friends/family members/SOs on theirs & it's considered normal.",
          "id": 84,
          "comments": [
            {
              "score": 0,
              "content": "It’s considered normal for someone to follow your location all day? I don’t buy it. \n\nIt’s normal to check every once in a while if you need to know if they are home or something like that.",
              "id": 85,
              "comments": [
                {
                  "score": 1,
                  "content": "It doesn't say he followed her all day? It was posted Tuesday, and says \"since Thursday,\" before mentioning multiple food places as well as her apartment. To me that indicates he's been checking in periodically, maybe more than once a day, sure, but it doesn't seem concerning. I could be mistaken!",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Lots of women have this location thing in case they go missing. Your phone constantly share your location with the person of your choice.",
          "id": 87,
          "comments": [
            {
              "score": 1,
              "content": "I get that but she isn’t missing. He’s just following her around all day.",
              "id": 88,
              "comments": [
                {
                  "score": 1,
                  "content": "Some apps make a sound when you get out of the house. So maybe the thing rings and that's how he knows.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "That was the only part that weirded me out too. I’m assuming he was checking her location because he’d not seen her in a while and was worried? Still creeps me out but it’s a little less weird",
          "id": 90,
          "comments": [
            {
              "score": 23,
              "content": "It’s a feature in Snapchat..",
              "id": 91,
              "comments": [
                {
                  "score": 15,
                  "content": "This. I don't get all these people sketching out. It's not like he backdoored her phone or put a tracking device in. He's worried about his loved one and using a feature she's opted into using.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "My fiancée and I have each other's location live in Google maps, just in case of emergencies as well as knowing to start dinner and that sort of thing. Also helps in case one of us loses our phone.",
          "id": 93,
          "comments": [
            {
              "score": 1,
              "content": "Me and my husband do too, but this isn’t an emergency. He’s just following her around all day.",
              "id": 94,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 117,
      "content": "[deleted]",
      "id": 95,
      "comments": [
        {
          "score": 59,
          "content": "100%, I was a chubby teen with PCOS (which has a lovely side effect of making it hard to loose weight) doctors always blamed my symptoms on being overweight. Well I went from a size 16 to a skinny size 4 (UK idk what that is in US) and guess what I had more health issues than ever and my ovaries still hate me.\n\n(I'm a healthy weight now btw)",
          "id": 96,
          "comments": [
            {
              "score": 15,
              "content": "It’s difficult to rule out weight as the cause of a problem until the weight is eliminated. Doctors aren’t always right, that doesn’t mean their opinions are malicious or that they’re fatphobic.",
              "id": 97,
              "comments": [
                {
                  "score": 43,
                  "content": "I'm not saying to rule it out or not consider it, but dismissing issues as being caused solely by being overweight and in turn implying everything will be better if you lose the weight is damaging, and based on conversations with friends and family it's pretty common.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 8,
                      "content": "In my experience actually working in healthcare that’s almost never what the doctors actually say. It tends to be what the patients hear, and the use to dismiss the health advice that they were seeking in the first place. Doctors are ridiculously careful about what they say to patients because of litigation and Medicare satisfaction surveys. The whole idea that they are dismissing your problems by addressing your weight is classic evasion of personal responsibility. People get mad any time a doctor tells them something they don’t want to hear. I watched a woman scream at a doctor for asking if she was diabetic. He asked because her complaints were likely related to blood sugar. She heard “you think I’m fat.” Getting the patient perspective on these situations isn’t always the most accurate view.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "The problem is that doctors will often refuse to investigate or look for any other cause other than “you are fat”. Losing 100 pounds is not a quick process. While losing 100 pounds (assuming that’s something you’re capable of), you’re losing time to fix the problem.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That happens sometimes for sure. I doubt you have any evidence of it being “often”. Most health conditions have multiple contributing causes. Obesity is frequently one of them.",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 102,
          "comments": [
            {
              "score": 0,
              "content": "I was gonna say something similar to this. We already spend way too much money on healthcare precisely because so many Americans are obese. The last thing we need is to start doing a bunch of unnecessary testing.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -7,
          "content": "In fairness, if a patient comes in classifying as morbidly obese, a doctor might consider it a waste of effort to do tests to find out why her she is out of breath easily and her knees hurt walking to the fridge.",
          "id": 104,
          "comments": [
            {
              "score": 10,
              "content": "This attitude pretty much sums up the issue perfectly: the belief that fat people are worth “less” simply by being fat. Health care is a universal human right, regardless of what poor decisions contribute to illness, be it smoking, food, alcohol etc.",
              "id": 105,
              "comments": [
                {
                  "score": 1,
                  "content": "I seem to recall a bunch of people on Reddit arguing that unvaccinated people shouldn't be given emergency room care not that long ago.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yet they still get care, regardless of what reddit thinks.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 45,
      "content": "I’m 300 pounds at 5’4 and I know it’s a problem. I’ve got an amazing therapist to help me with my binge eating. I get on the treadmill every day. I talk with my family about healthier meals and then follow through with making them. She is going to eat herself to death and if she refuses to see that then there is nothing you can do but step away. NTA",
      "id": 108,
      "comments": [
        {
          "score": -7,
          "content": "Honesty, thank you for recognizing that obesity causes health problems and doctors aren’t trying to be mean to you. This has not always been my experience with patients, and your perspective is refreshing to say the least.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "NTA - She is in denial of the health issues that come with being overweight and doesn't want to hear it. She needs to speak to someone to help her with her binge eating. I don't have the right way to say what you're saying, but sitting back and watching someone eat themselves to death isn't the right thing to do.",
      "id": 110,
      "comments": [
        {
          "score": 18,
          "content": "no, it isn't",
          "id": 111,
          "comments": [
            {
              "score": 5,
              "content": "Good luck. She needs real help, but again, I don't know the right way to approach it to get to possibly consider speaking to someone.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "Hey 👋  I work with drug/alcohol addicts and don’t really have Involvement in ED specifically but just wanted to say a few things.\n\n1. Your GF doesn’t need to focus on her body weight. She should be focusing on her eating habits. The two can be related but often aren’t. \n\n2. You can’t change her habits. You can only control yourself. Staying with someone and watching them self harm is an incredibly painful thing. You might need to get therapy. You can’t make her be healthy. \n\n3. You can’t control anything but your own actions. Be prepared to walk away. Make sure you emphasize you don’t care about her body’s shape or size. She is going to say you are leaving “Because she’s fat.” But that’s not true. You care about her health. You can’t watch her make herself sick for the next 50 years. \n\nTry to phrase it like that. She’s sick and needs help. Therapy and a nutritionist. You can’t just ignore her having a chronic illness and refusing to get treatment. \n\nHope this POV helps.",
      "id": 113,
      "comments": [
        {
          "score": 4,
          "content": "All excellent points and advice.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "NTA, but that doesn’t mean she’s going to listen to you. \n\nDoctors can be really fatphobic, esp. to women. But that doesn’t mean that in some cases they aren’t right when they mention issues that come with weight. \n\nYour gf knows what she weighs. In the end, she’s the only one that can control what she eats. Pick your battles carefully, because it sounds like she’s not in a place to listen.",
      "id": 115,
      "comments": [],
      "relation": "Support"
    }
  ]
}