{
  "post content": "\nThrowaway because husband told me I was TA and want to know before I get home and argue. On phone format is bad.\n\nI was in a higher end department store today (rhymes with loomingtales) and happened to end up next to two teenage aged girls while shopping. One of the girls had picked out a pair of VERY expensive boots and they were both fawning over them. Second girl must have looked at price tag and asks boots girl if she’s really gonna spend that much on boots. Girl with boots says something along the lines of “it’s fine I have my dads credit card I’m not paying ” which instantly caught my attention because THATS NOT HER CARD. I’ve told my son multiple times he’s never allowed to use my card so I’m interested to see how this girl thinks she’s going to get away with fraud but had split up from the girls at this point because they had found something else.\n\nWe end up at the same register (me behind) and I see her total hit well over four digits. The girl is about to swipe her card when I decide that I can’t let her get away with something like this and someone has to parent this kid if no one else will. I tell cashier that isn’t her card but her father’s and I’m not sure she has permission. Girl and friend turn and glare at me giving me possibly the dirtiest look I’ve ever seen. I swear this girl was going to throw a tantrum right there, I don’t think she was ever told no.\n\nGirl tells cashier her father gave her the card to shop with because it’s the stores credit card and it gives him the points. Now that I’ve pointed out it wasn’t hers cashier tells her she can’t use that card. Girl tries to show ID to prove they have the same last name ( yeah that will help) and I tell her it’s still fraud. Girl says it’s not fraud because she has permission and tells me to mind my own business. I tell her that it is my business that she’s doing something illegal she needs to pay with her own card or I call the cops. Girl is pissed now and people are glaring at me. She uses her own card and leaves crying. Cashier looks mad at me and I tell my husband when I get home only for him to agree I was in the wrong. \n\nSo Reddit, ATIA?",
  "id": 1,
  "comments": [
    {
      "score": 48000,
      "content": "YTA\n\nDid it ever occur to you that she was telling the truth and her dad had given her his credit card? Mind your own business.\n\nEdit: Holy shit this blew up. To everyone saying that she could have taken the card without permission, you are right. But it is still none of OP’s business and there is no way to know for sure. \n\nIf the girl was an adult who said she was using her husband’s card, OP likely wouldn’t have batted an eye.",
      "id": 2,
      "comments": [
        {
          "score": 20811,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 13770,
              "content": "BuT iT wAS SomeThINg iLlegAl sO iT Is hER bUsIneSS. I thought the part about “soooomeone needing to parent this child” was bad, but this is some Karen bullshit. I just love the sense of self righteousness that she swooped in and FINALLY a martyr, nay, a SAVIOR has at long last arrived to tell this girl NO, NOT TODAY SATAN. Spare me. Entitlement was the perfect word.\n\nYTA op.\n\nEdit: nay not neigh",
              "id": 4,
              "comments": [
                {
                  "score": 7404,
                  "content": "Only once every thousand years does such a hero grace the Earth to do what all else have failed to do -- parent other people's children.  The mystics have foretold this legendary figure throughout the realms, anxiously awaiting her arrival.  Rejoice for she is here, Karen the Corrector of Children.  Marvel at her superiority.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2426,
                      "content": "I dont remember foretelling that",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 827,
                      "content": "Karen the Korrector of Kids",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 117,
                      "content": "Hahaha! I needed this today! :D",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2266,
                  "content": ">I decide that I can’t let her get away with something like this and someone has to parent this kid if no one else will.\n\nEspecially this line. She's not your kid to parent. Mind your business. Who do you think you are?",
                  "id": 9,
                  "comments": [
                    {
                      "score": 1099,
                      "content": "I know, this statement was so strange to me- makes me think this is a fake post. Or someone was a little jelly of the amount the girl was able to spend and acted out.  Even if the amount was not reasonable to the Dad, that is for them to sort out, and the boots can be returned.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 140,
                      "content": "That's the line that blew me away, it's so self righteous",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "Seriously....like, if the dad doesn't want her to use the card for that, you can bet your butt he can make her return the item/pay her back/ground her/etc. for her actions and misuse of his card. If it's over four digits, I'm sure the dad will notice and if he doesn't, then that's family business and he either has enough money to not care, doesn't pay enough attention to notice, or is fine with it.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Also, using a parent’s credit card means she isn’t being parented? My parents loaned me their card all the time to get school supplies or haircuts or whatever.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Seems like op mightve been a little jealous.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": " \"We end up at the same register (me behind) and I see her total hit well over four digits.\"\n\nNot to mention this one. She SOMEHOW ends up at the same register??? And then proceeds to look at how much this person is spending. \n\nFucking Karen.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "She was probably jealous that she couldn’t afford the boots herself. No way was she going to let a kid have them.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 859,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 1211,
                      "content": "THIS.\n\n\nShe didnt hear the girl say \"Its fine I have my dads card and he doesnt know\". She just heard her say she has his card. There was no mention or evidence of him not knowing or not giving the daughter permission. \n\n\nJust because you dont give your son permission to use your card, doesnt mean no other parent does. Shit, I'm 25 and still use my moms card sometimes",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 422,
                      "content": "Exactly!!! I hand my SO my card all the time and vice versa to buy shit. I always get kinda nervous that some nosey person is gonna try and stop us, especially since we don't have the same last name",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 413,
                      "content": "Imagine thinking it's out of the ordinary for a father (clearly wealthy if he has a rewards card to fucking Bloomingdale's) to let his teenage daughter borrow his credit cards to go shopping.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "Thats what I was thinking.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Almost every credit card allows you to add your children as an authorized user. Minimum age depends on the card. Some of them have no minimum age.\n\nAlso as an FYI to everyone- adding your children to your credit card as an authorized user can help jump start their credit.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Foreign students often use their parent's cards when they're abroad, since foreign cash transfers can be difficult to make regularly. I would've been quite pissed off if some nosey woman stopped me from using my dad's card, and made me dip into cash that is supposed to be reserved for other things.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 451,
                  "content": ">Of all tyrannies, a tyranny sincerely exercised for the good of its victims may be the most oppressive. It would be better to live under robber barons than under omnipotent moral busybodies. The robber baron's cruelty may sometimes sleep, his cupidity may at some point be satiated; but those who torment us for our own good will torment us without end for they do so with the approval of their own conscience.\n\n\nC.S. Lewis\n\nAlso, *nay*. Neigh is a horse's whinny.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Seems like she’s whinnying to me...but appreciate the correction!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "[removed]",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 48,
                  "content": "*nay\n\nlol at the neighing savior though :)",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Thank goodness a do-gooder finally stepped in to help Chase and Bloomingdales avoid this illegal activity!",
                  "id": 28,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Clearly the hero”loomingdales” always longed for. Someone FINALLY stopping that girl from using daddy’s card. You know..the clientele that probably has kept them in business all these years...",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1338,
              "content": "She’s acting like this kid is a felon because she used her dad’s credit card. I have no idea why “maybe her father gave it to her” wasn’t a reasonable explanation for her.",
              "id": 30,
              "comments": [
                {
                  "score": 1462,
                  "content": ">Girl tries to show ID to prove they have the same last name ( yeah that will help) and I tell her it’s still fraud. Girl says it’s not fraud because she has permission and tells me to mind my own business. I tell her that it is my business that she’s doing something illegal she needs to pay with her own card or I call the cops\n\nOP thinks it's fraud even if you use someone else's card WITH permission.\n\nEither OP is extremely extremely dumb or this is fake as fuck.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 258,
                      "content": "This may be different in the US, but I'm fairly certain that you aren't allowed to use another person's credit card *period*. No matter what the other person says to that.\n\n(Doesn't change the fact that this was none of her business and she's TA, though.)",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 430,
              "content": "OP is blatantly jealous.",
              "id": 33,
              "comments": [
                {
                  "score": 34,
                  "content": "Right??? The entire post reeks of jealousy and resentment *of a child* because she can afford to buy (financed by her parents) expensive things. What an asshole.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "This!!!!!! And also now I’m gonna go make some banana pancakes",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 283,
              "content": "OP is the TA.  Also seems jealous of the girl being able to make those purchases.",
              "id": 36,
              "comments": [
                {
                  "score": 27,
                  "content": "Can definitely see this. Pair of boots, in the 4 digits, OP can't afford them, but pissed that someone else can. Tries to fuck with them. Pathetic lol.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 31,
                      "content": "The best part about it is that the girl pulls out HER card and still buys the boots.. I’m not sure of too many people who have 1) that sort of money sitting in a bank account 2) THAT high of a purchase limit for a transaction!! \n\nClearly $$$ isn’t the issue here since she still bought them, just the hassle of not being able to use the store card for points!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "[removed]",
              "id": 39,
              "comments": [
                {
                  "score": 7,
                  "content": "And that she wouldn’t look as cute in them lol",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Yeah, OP, YTA. A giant asshole.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "She went out of her way to get in some shit that wasn’t even any of her business. It’s very common for parents to give their kids their credit cards to get stuff for them. I would walk away if I was her SO because this is Karen at its finest. Yikes.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4862,
          "content": "YTA\n\n\nWhat a fucking busy body. Before I had my first job my mom would regularly give me her store credit cards so that I could go shopping on my own and buy clothes for myself (and she would receive store coupons and points for my purchases that she could then use). Thank God I never encountered any morally entitled people like OP.\n\nAnd you threatened to *call the cops* on teenagers who you “suspected” of “fraud”? WTF is wrong with you? \n\n“I’ll step up and parent these girls if no one else will”\n\nUm like fuck all you will! It’s NOT your place! You are NOT their parent! Why did you even need to make this post? You are so clearly TA. \n\n**Mind your own damn business**\n\nEDIT: Thank you, kind strangers",
          "id": 43,
          "comments": [
            {
              "score": 1127,
              "content": "My parents even taught me how to forge their signatures 🤷🏻‍♀️",
              "id": 44,
              "comments": [
                {
                  "score": 490,
                  "content": "Same! My mom sat me down and showed me how to do her signature so I could use her card on the rare occasion she lent it to me. Now, if I spent 4 figures, I'd get reamed and forced to return the item in question. At no point would she have wanted the cops called on me!",
                  "id": 45,
                  "comments": [
                    {
                      "score": 243,
                      "content": "You can literally just scribble and it’ll accept it. I’ve never properly written my signature when prompted for a signature after a CC purchase. It seriously looks like an illiterate person trying to write what they think a signature should look like when I sign. Or how a doctor signs off on your prescriptions.\n\nFucking kills me when people make an effort to slowly sign their signature for a $5 coffee purchase.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Mine too! Even for minor shit like signing school forms-- \"eh, just sign it for me.\"",
                  "id": 47,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Same here too. My mom went to work maybe an hour or two after I got home and would often forget to sign something. So she just showed me how to do her signature close enough that no one ever contested it. Plus if they called her, she would have just said she signed it anyways.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Haha my mum and dad did the same for me and my siblings! But when I mentioned to my friends that our parents literally taught us how to fake their signatures, they thought it was bizarre. Then again, I'd say me and my siblings were (relatively?) good kids. Our parents were always good at staying on top of school stuff or whatever, so we only ever had to forge their signatures when they were genuinely busy and needed to sign something, but forgot to, so they'd tell us kids to sign for them. Other few times were to confirm identity in cases like this post, when they sent us off shopping without them.\n\nOne instance that comes to mind is spring break a few years ago. My (then underage) brother went to Florida and wanted to get a hotel room for him and a bunch of friends. To pay for the room, he needed a signed form that said he was allowed to use the credit card that my mum had given him for the trip. She and my dad were away on vacation at the time without access to a scanner or printer, though, so my mum emailed the form to me. I printed it, signed her signature for her, and scanned it back in an email, which she then forwarded to the hotel with a picture of her I.D. Everything was fine and dandy, and my brother got the room with his friends.\n\nTLDR; I've been in situations like the girl in OP's post, and my parents would be pissed off if somebody like OP butted their noses in unnecessarily, despite giving me full permission to use their card/money/whatever lol",
                  "id": 49,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I bet you and your siblings openly share what's happening in your lives with your parents still. Trust is so valuble and can be \"spent\" for future \"deeds\". \n\nMy daughter had friends whose parents were always suspicious and forced a \"toe the line because I know teens lie\" attitude and those were the kids sneaking around.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I give my daughter my credit card and tell her to sign it and she is 50 years old. Was it  because they were kids and you knew you could get away with it? What a shame. Mind your business.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 483,
              "content": "And even IF the father had an issue with it, how does OP know he won't have a discussion with her at least???",
              "id": 52,
              "comments": [
                {
                  "score": 318,
                  "content": "Right? Because he can't check his credit card statement and bring it up if the charge is an issue? Because returning stuff doesn't exist? Hell, I met plenty of kids in college with parents so rich they wouldn't give two shits about their kids spending this much on clothes. I worked with a kid who got $1000 a week as an allowance. He only worked with me for a month because he lost a bet.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I went to middle school and high school in a very middle-upper middle class area, and a classmate of mine decided it was a good idea to bring her Coach wallet to school in 8th grade with $200 in it. It got stolen and while her parents could afford it, they still grounded her for being stupid enough to take $200 to school",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Oh didn't you read the post? The girl has never been told no. OP can tell by looking... open and shut case.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Oh, yeah, you're absolutely right. I can't believe i didn't realize that OP can pick up on strangers' parenting styles by looking at their kids",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I let my girlfriend use my CC for some purchases too for the same reason the girls in this story said- gotta get them reward points.\n\nThe fact that they were able to throw this purchase on their own CC also seems to suggest they have quite a large line of credit for their age and lends credence to their story that they probably do have a wealthy father who legit doesn’t mind.",
              "id": 57,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeah, I was sharing this post with my boyfriend and that was the first thing he said. \n\n“If she pulled out her card and paid for it herself that just shows that her family has plenty of money. She shouldn’t be judging them for a purchase she couldn’t afford, sounds like she’s jealous about *her* not getting the nice boots.”",
                  "id": 58,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yeah, the store may have lost a wealthy patron on top of it because Karen decided to take it upon herself to fight crime as well. Really saved the day there.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I'm 28 and I *still* have my mom's card in my wallet! She gave it to me on my birthday and told me to use it to take myself and my friend out for a nicer dinner than I can usually afford and then refused to take it back. She told me to keep it in case of emergency. Of course I don't use it, but if there *is* an emergency I have that option. YTA OP.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "And the fact that she decides these girls aren't being parented. No Karen, giving your child money to buy clothes for themselves *is* fucking parenting. But OP's idea of parenting is probably keeping her kid at home, not allowed to do any adult things without her hovering. And then when he becomes an adult, he can't do anything for himself. *That's* shitty parenting. If OP doesn't trust her son enough to let him go to the store on his own, then she fucked up as a mother. And if she's entitled to act as parent, then maybe someone should step up and parent her kid to teach him some life skills? See what she thinks of that.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "The amount of times I’ve told my mom that I’m about to go shopping at Kohl’s and she replies with “you better be using my card so I get the rewards” makes me very annoyed with this woman. I can’t even count the amount of times I’ve used another persons card (with permission), and I currently exclusively use my husbands and just transfer him whatever I spent.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I wonder what OP would have done if she had caught me using my parent’s DEBIT CARD at the ATM to get cash out for myself as a teenager...",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1342,
          "content": "Yeah this is insane. When I was 16-18, my mom never gave me an allowance; she instead gave me her credit card and told me to buy whatever I want (I was a very responsible spender, so it worked for us). I would be infuriated if some noisy stranger decided to impose on my life like that. Mind your own business; YTA OP.",
          "id": 64,
          "comments": [
            {
              "score": 526,
              "content": "[deleted]",
              "id": 65,
              "comments": [
                {
                  "score": 520,
                  "content": "That was OP's jealousy spilling over. She mentioned the girls getting expensive shoes, fawning over them and the bill coming over 4 digits, multiple times. She was jealous.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 40,
                      "content": "* envious",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "\"Lol what a loser, this girl younger than me buys the same things that I want\"",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Not to mention having to name drop it in the description.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 201,
              "content": "Agreed my mom(disabled) would have me go into the store and buy things for the family with her credit card when she was hurting too much to go in herself and if someone ever did that I wouldn't even be able to say I have the same last name or I look like her I would be so embarrassed but my mom would probably try to fight or at least would yell",
              "id": 70,
              "comments": [
                {
                  "score": 29,
                  "content": "Same! My mom would have me pick up her medicine as a teen including pain management meds I cannot IMAGINE if OP had been behind me while I was picking up my mom's vicodin at age 16 🤦🏼‍♀️\n\nYTA OP",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I had permission as a kid too, and I would have been destroyed with embarrassment. Afraid to ever use it again. It would have hurt my family that I couldn't run out and pick up stuff. \n\nWe need a YTFA for this Karen. And you know what the F is for.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "I regularly give my daughter my card to make purchases for me or herself. If this person injected herself into our business like this, I'd be pissed! YTA for sure.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "My parents have always been a little tight on money, but my dad used to let me borrow his debit card so I could go shopping when it was time to go back to school. All he asked was that I don't spend more than X amount and report back to him with how much I spent.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right?\n\nI give my oldest son my CC all the time when he needs to buy something, is easier for me because i rarely have cash on hand, plus i get to see the receipt and make sure he spent the money on what he told me he was going to.\n\nYTA op\n\n&#x200B;\n\nETA.  If something like that ever happened to my kid I would be ROYALLY pissed.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I did the back to school shopping for my sister for years.  Heck, my dad wrote up a power of attorney so I could handle all the paperwork of changing her schools and signing things on their behalf (I'm *much* older and had a more flexible work schedule).\n\nI would have been upset at someone butting in to try and sabotage our schedule.  It wouldn't have been much of an inconvenience to have my mom write me a check later, but it would have been annoying for her to lose out on points or miles because some busybody was jealous of a child.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I had this same relationship with my mom well through college and even after my first job (when I still lived with her). Now, she added me as an authorized user so it was a bit different, but I basically did all of the grocery shopping for our family and had to be able to pay for it somehow.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1324,
          "content": "Pretty sure OP is just seething with jealousy because she's not buying 1000 dollar boots.",
          "id": 78,
          "comments": [
            {
              "score": 390,
              "content": "Not going to lie, I thought the exact same thing.",
              "id": 79,
              "comments": [
                {
                  "score": 128,
                  "content": "[removed]",
                  "id": 80,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I am getting the same impression.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "You thought that because it's the truth. The way OP mentioned the price and the way they were fawning over the boots and all excited. You just know she couldn't handle that some teenagers were getting expensive shoes they didn't have to work for. Except, it's none of your business OP so fuck right off.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 166,
              "content": "Yep, I'm getting this vibe too.",
              "id": 83,
              "comments": [
                {
                  "score": 219,
                  "content": "OP should stop parenting other people's children in the check-out line, take the Versace refrigerator magnet she found in the bargain bin, and go home.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 88,
                      "content": "OP is just mad that her dad didn’t give her a credit card to get boots with",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "haha versace refrigerator magnet AND the half-price control top pantyhose!",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This is a shit post. The “young girl” pulled out her own card and paid for her purchases and left crying. Yeah. Sure that happened. This is Karen Fantasy Revenge Porn.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Right? All I could hear while reading this post was, \"This entitled brat shouldn't be allowed to get nice things\". I really wonder if she would have this kind of energy if the girl was buying Starbucks or shopping at Target.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1107,
          "content": "Also OP stood close enough to see the total WTF??? I... dont think Bloomies checkout has a huge display like the groceries store so you can see your items )and at groceries stores you can't really see those displays while standing in line mostly.\n\nYTA.",
          "id": 89,
          "comments": [
            {
              "score": 795,
              "content": "This is actually overlooked. Who the fuck is this lady that she thinks she can look at the shit this young girl bought?!",
              "id": 90,
              "comments": [
                {
                  "score": 291,
                  "content": "And then decide that this TOTAL STRANGER is spending too much and had to step in. Whaaaaat?!",
                  "id": 91,
                  "comments": [
                    {
                      "score": 32,
                      "content": "\"I would NEVER let my child buy a pair of $400 boots, she MUST have stolen that card!\"",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 727,
              "content": ">We end up at the same register\n\nWilling to bet OP just followed them to the register so she could play hero.",
              "id": 93,
              "comments": [
                {
                  "score": 215,
                  "content": "*Guarantee",
                  "id": 94,
                  "comments": [
                    {
                      "score": 36,
                      "content": "OP probably wasn't even actually done shopping yet",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Oh, no doubt. “I lost track of them then happened to end up at the same register”, be fucked did she. She stalked those kids through the shop just to pull this shit. \n\nYTA, OP. A raging arsehole, and a Karen to boot.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "She got her I’m gonna watch these girls checkout so I can judge them haircut",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Absolutely she did",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 477,
              "content": "Thank you! That's next level noisy ass Karen. Who does that? \n\nAnd who cares if it's 4 figures, what if her dad told her to spend up to $5,000 on clothes for a trip or $10,000 for herself? She has zero knowledge of that family and their affairs and she stuck her busy body self into a scenario where she thought she'd come off as some sort of retail store hero, and then got pissy when that didn't happen.",
              "id": 99,
              "comments": [
                {
                  "score": 55,
                  "content": "Also, it seems reasonable to assume that she must come from some money if she was able to pay with her own card after OP demanded she not be allowed to pay with her dad’s card. Agree with you.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I think the message for the OP is 1-YTA and 2-Stay out of people's freaking business.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "And she acts like ending up behind them in line was a coincidence... okay weirdo",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 900,
          "content": "> Did it ever occur to you that she was telling the truth and her dad had given her his credit card? \n\nShe had to have been.\n\nShe ended up paying for it with her own card...given that she's a teenager we can assume her dad is paying for the purchases on her card. (Yeah, teenagers can be working, but not earning enough for this kind of purchase.)\n\nSo, if he's paying for hers anyway, why would she need to steal his? Unless she's telling the truth and he wanted her to use the store one for the points.",
          "id": 103,
          "comments": [
            {
              "score": 596,
              "content": "My thoughts exactly. If she could afford it on another card with her name, I doubt she was doing anything she isn’t allowed to do. I bet her dad was really annoyed about not getting the points for a big purchase when he heard this story.\n\nOP, YTA",
              "id": 104,
              "comments": [
                {
                  "score": 275,
                  "content": ">I bet her dad was really annoyed about not getting the points for a big purchase when he heard this story.\n\n100% correct. OP caused the father annoyance. Who do you think is paying the bill for the card that the girl had to end up using? Except now he's not getting points.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "\"Yeah dad, you missed out on $1000 of rewards because some weirdo thought I stole your card\"",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I didn't even think of this, but true. Daughter probably was just planning to go shopping, the dad handed over his card for the sweet points, and off she went before OP had to go and get jealous and not mind her own business.",
              "id": 107,
              "comments": [
                {
                  "score": 14,
                  "content": "As someone who loves those sweet sweet credit card points, OP really screwed him on this. OP, YTA on this one.",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I commented this exactly before I saw yours. OP is such a screaming asshole in this situation. If she didn’t have permission to spend that much, her dad would have caught it and made her return the items. But it’s back to school season- he probably gave her his card to go shopping for new school clothes.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 534,
          "content": "My dad wasn't rich enough for 4 digits, but he did give me his card when I was younger so I could shop for the things I needed. He told me they shouldn't question it since we have the same last name. \n\nOp YTA. It would be different if you heard them say they stole/found the card.",
          "id": 110,
          "comments": [
            {
              "score": 28,
              "content": "Same. My parents gave me a gas card while I was in high school and college. I used it within reason and when I was low on cash I bought snacks. Nothing expensive. I always tried to keep the total to a minimum. This girl OP bullied may have wealthy parents. A four figure total may be nothing for them.",
              "id": 111,
              "comments": [
                {
                  "score": 13,
                  "content": "Spending a grand or so isn't that crazy if it is your yearly or quarterly shop. Decent boots are also a pretty reasonable thing to drop money on from a long term perspective rather than buying cheap shoes that fall apart much sooner.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "> He told me they shouldn't question it since we have the same last name\n\nJust a related anecdote: I remember borrowing my dad's credit card to take my girlfriend to a fancy anniversary dinner, because he got mad dining points.  I was really worried that they were going to question it because I was obviously too young to afford such a nice restaurant, until my dad reminded me that even if they did question it we have *literally the exact same first and last name.*\n\nI doubt you care but this reminded me of a story so I told it.  Happy cake day!",
              "id": 113,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "Yeah the fact that she herself paid for the boots afterwards is a pretty good indication that she was telling the truth.",
          "id": 114,
          "comments": [
            {
              "score": 22,
              "content": "Yeah.. I mean 4 digits on her own card. What young teenager has 4 digits in their bank. A wealthy one!",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 280,
          "content": "Yes, exactly. When I was a teenager my mom would sometimes give me her card to go to the store and pick up some groceries (not the same, I know)\n\nEven though the girl in question seems like the stereotypical spoiled brat, that doesn’t make it okay to butt in. Parents give their kids the credit card to borrow all the time, it doesn’t mean the girl was stealing wtf. She had her dad’s permission ffs.",
          "id": 116,
          "comments": [
            {
              "score": 205,
              "content": "I’m an adult and my mom and I will still give each other our cards to grab things! \n\n“I’m going to store, need anything?”\n“Yeah, can you grab me x? Here’s my card”",
              "id": 117,
              "comments": [
                {
                  "score": 104,
                  "content": "I'm an adult who lives 1000 miles from my mom and I *still* have a copy of her card because when I left she wanted to be sure I had the means to get home if I ever needed to regardless of my tight grad school budget (ex: recently used it to evacuate ahead of a hurricane).  I cannot imagine if some nosy Nelly tried to make me justify purchasing an expensive plane ticket to my rurala\\*\\* hometown because \\*\\*fraud\\*\\*.  what an AH.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": ">and someone has to parent this kid if no one else will\n\n&#x200B;\n\nThis is a wrong mindset, it's not your kid OP",
          "id": 119,
          "comments": [
            {
              "score": 9,
              "content": "It's super presumptuous too. Kids with good parents do bad things sometimes (assuming she took the card without permission, but we don't know that either). It's called being human. \n\nYTA OP.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25107,
      "content": "YTA. Mind your own fucking business the girls dad probably makes money and she's spoiled and it absolutely isn't your job to parent her and embarrass her like that in a store. You also aren't a federal law enforcement officer investigating fraud, just buy your shit and go home.",
      "id": 121,
      "comments": [
        {
          "score": 5992,
          "content": "I wouldn’t even say she’s spoiled. What if her dad gave her the card to go shopping? OP just needs to stop being a busybody and mind her own business.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1113,
          "content": "She bought it too on her own card in the end so year probably a rich family",
          "id": 123,
          "comments": [
            {
              "score": 589,
              "content": "Yeah, it’s probably just the kind of money they spend on clothes and shoes. Maybe she’s spoiled, maybe not, but she’s probably just a different income bracket",
              "id": 124,
              "comments": [
                {
                  "score": 380,
                  "content": "And she even told the woman that her dad wanted her to use that card because he gets points on it at that store.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 312,
                      "content": "Wont lie, when I was a teenager I would have been too stupid/scared to come up with THAT lie, which makes perfect sense. I feel MOST \"oh shit I'm busted\" teens would have just given up or something. Then she uses her OWN card? Uh yeah she totally had permission imo. \n\nOp, yta.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "My mom would do this too. She’d let me use specific credit cards because she’d earn points instead of using cash or some other card that won’t earn anything at that store",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Right and OP is clearly insanely jealous and a busybody with no life of her own so she's one of those kind of people that has to inject her opinion into other people's business. I hate people like that. It's like nobody cares what your opinion is, mind your own fucking business. Get a life.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 458,
              "content": "Right - she clearly had a card in her own name she could use - which dad probably pays for. But as the girl said, this way dad got points or whatever. \n\nThe OP humiliated this poor girl, assuming she was an entitled, spoiled brat who steals daddy’s credit cards. No wonder the girl cried.",
              "id": 129,
              "comments": [
                {
                  "score": 106,
                  "content": "If this post is real it’s also awful that these girls were having pretty innocent fun and op swooped down to ruin that.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Granted, it's still July, but as a late teen, my mom would usually give me her card to go buy \"back to school\" clothes when she didn't have time to go with me. Usually in August, but we're coming up on that part of the year If OP had been there to stop me, I would've had to wait until Mom had time to come back with me to pick up the same stuff. I would not have had another card I could pull out to pay with. That girl almost certainly had permission to use the card.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Depending on where she is, where im at first day of school is August 3rd, so could very well be back to school shopping.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 164,
              "content": "Except now the dad loses the points hed get for a thousand+ purchase",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "OP sounds jealous they were obviously wealthy.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I always use my mothers credit card - it has 4% cashback on some purchases. And then I send the money over to her from my bank account.",
              "id": 135,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 523,
          "content": "Side note: don’t just call the cops every time you don’t get your way OP. I’d be really interested if this had more elements to it or if OP is just that much of a hall monitor.",
          "id": 136,
          "comments": [
            {
              "score": 122,
              "content": "[removed]",
              "id": 137,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "OP really reminds me of the Permit Patty type.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Really curious what the cops would say if you did call them about something like this.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Not to mention she's that young and has her own card with a limit above 4 Digits...  \nLikely meaning that she's an authorized user on a joint card with her parents, and did in fact have permission to use the other card.    \n\nI hope you used a condom when you fucked her dad out of over a grand in store points",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "As someone in Law enforncement who investigates fraud at times, I wouldn't even get involved.  I gave my daughter a card the other day to run in and buy something at a store and she's only 13.  Like WTF.  OP YTA.  Stay out of other people's business when it's not involving life or death FFS.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17122,
      "content": "YTA\n\nDo you usually make a habit of sticking your nose into other people's business?",
      "id": 142,
      "comments": [
        {
          "score": 4570,
          "content": "For real, OP sounds like a nightmare, I’d death-glare them too.",
          "id": 143,
          "comments": [
            {
              "score": 1347,
              "content": "Yeah, op even though it was none of her business threatened to call the cops on that poor girl",
              "id": 144,
              "comments": [
                {
                  "score": 693,
                  "content": "That's the part in the story where I went \"ok lady, it's really not that serious, Jesus.\"",
                  "id": 145,
                  "comments": [
                    {
                      "score": 300,
                      "content": "When even the CASHIER looks annoyed at you, you’re not doing a good deed, you’re being over the fucking top. Cashier can handle it, Karen. Kid goes to show that the cards have the same last name, op can’t stop jumping the fuck in so cashier can’t check and if they accept it as good enough, op will probably call the damn manager later. She sucks all the way around",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 68,
                      "content": "That's the part where I went \"Jesus, this lady is a psycho. That poor girl.\"",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Dragging the cops in was not only uncalled for, but also risks aggravating the situation. If it had escalated with the teenagers and police we all know the op would be sitting there watching with her thumb up her ass.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "For something that’s not illegal.",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Yep. Worst case scenario the dad could return the boots if it wasn’t legit",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 883,
              "content": "The fact that OP had to point out how expensive the bill was rather than the principle of using someone else's card suggests that there was some jealousy there. If OP was so bothered by the use of the card, the amount spent on it shouldn't have mattered at all. \n\nYTA OP, completely nosy and on a high horse. Your spouse is absolutely correct.",
              "id": 151,
              "comments": [
                {
                  "score": 160,
                  "content": "I was thinking this as well, in my response I was ready to type that she seems a bit jealous.  Why even mention the store?\n\nAlmost as if she feels like she deserves to ship there but rich kids don't.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 177,
                      "content": "You can literally see that from the way she started the story off with \"_I_ was in a higher end department store... interested to see how this _Girl_ thinks she’s going to get away with fraud...\". OP has a chip on her shoulder for SURE. The rest of the story even suggests that she followed her around the store until she was ready to pay, just so she could say something. \n\nOP's just a shit person. I actually want to believe the post is fake because I can't imagine someone putting themselves in this situation and then asking if they're the asshole because they're _that_ obtuse.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1573,
          "content": "I would be *so* embarrassed if my girlfriend came home telling me this story acting as if she’s the hero",
          "id": 154,
          "comments": [
            {
              "score": 329,
              "content": "Agreed. It was embarrassing enough just hearing about it, but imagine being there? I would drop dead from humiliation.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I dated a girl like this once. It was exactly the reason why I wrote \"dated\" in the past tense.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Omg, the cringe. I genuinely feel bad for OP's spouse. He's probably wondering how it's possible he married someone this obtuse.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 372,
          "content": "> I decide that I can’t let her get away with something like this and someone has to parent this kid if no one else will.\n\nIt sounds like she does. Get a life and mind your own business, OP.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Why the hell was OP paying attention to teenagers shopping?\n\nWhy the hell was OP then listening to the conversation about teenagers shopping?\n\nWhy the hell did OP assume that since her broke ass can't afford her son to shop with her card that means other parents can't either?\n\nWhy the hell did she decide that this teenager shopping expensively *was a cause for her to parent them \"because someone had to\"*???",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12780,
      "content": "YTA....you have no idea what agreement she has with her dad, and you had no reason to interject yourself.",
      "id": 160,
      "comments": [
        {
          "score": 5759,
          "content": "[deleted]",
          "id": 161,
          "comments": [
            {
              "score": 1332,
              "content": "Precisely! Unfortunately, OP seems to have a serious lack of critical thinking skills.",
              "id": 162,
              "comments": [
                {
                  "score": 1220,
                  "content": "[deleted]",
                  "id": 163,
                  "comments": [
                    {
                      "score": 372,
                      "content": "Ding ding ding!!! \nAlso, why people feel the need/right to parent stranger's kids?",
                      "id": 164,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 58,
                      "content": "Right. \"Well, no one's buying ME expensive shoes, and if anyone deserves them it's ME, so I'm going to make sure this useless little girl can't have them!\"\n\nShe sounds like the kind of person who makes petty, passive-aggressive comments when her coworkers go on nice vacations, and makes sure they come back to a mountain of busywork.",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "The girl obviously had the funds and/or credit to cover her purchase on her own but she might have been using her dad's card since it accumulates points at that store, with the intention of paying him back. I've done that with friends before if I am making a purchase somewhere that they can earn points and people have done it with me when I can earn points. u/aljsdhnrthrow is just a busybody trying to police other people in order to feel good about herself while making life difficult for others for no good reason. If the situation was as I described above and OP stopped someone from using my card, I would be pissed off for not only needlessly embarrassing my friend or family member, but also for costing me rewards.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "OP ended up shaming herself, not the girl.",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You voiced my thoughts exactly. $1000+ purchase is worth a lot of credit card points, so the part where the girl said her father allowed the purchase to get points makes sense as well. The fact that she purchased the item with her own card speaks volumes as well. \n\nOp, YTA. Take your judgement and accept it.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This comment made me feel else worse for the girl. The fact that she spent her own money when she wouldn’t have had to if OP didn’t butt in. It’s entirely possible her father told her to treat herself as a reward or for some special event. OP made so many assumptions here and is 100%, without a doubt the asshole.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "As someone who had a debit card with my dads name on it because I was underaged at the time, linked to an account with my hard earned money, who was once stopped from buying something by a cashier because I clearly am not male, OP YTA for sure I was so embarrassed and shaken by this interaction it was almost unsafe for me to drive home.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 261,
          "content": "[removed]",
          "id": 171,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "The reason seems to be jealousy or some entitled sense of “justice” because of how she treats her child. \n\n“If *ofher* parents don’t parent like *her*, she will remedy it with the flaps of her lips” -Everyone’s Parent Woman (to the rescue?)",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9062,
      "content": "[removed]",
      "id": 173,
      "comments": [
        {
          "score": 1207,
          "content": "I legit just laughed at the Karen at the end of the sentence. Idk why it was so funny to me\n\nEdit: it was funny for the first post I saw but now that they’re dozens in every comment train and got sequentially less funny",
          "id": 174,
          "comments": [
            {
              "score": 49,
              "content": "[removed]",
              "id": 175,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "Karen just seems to be everyone's go-to name for a shitty intolerable woman in a story, but now that I have a friend named Karen who is actually super fucking cool and pleasant to be around, the joke is slightly less fun now. lol",
              "id": 176,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": ">\tit was funny for the first post I saw but now that they’re dozens in every comment train and got sequentially less funny\n\nReddit in a nutshell",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "This story reminds me of a time when I was like 8 years old.  \nMy mom let me go pick out some candy and when I got back to the cart, my mom was was looking at eggs or some shit, so I threw my chocolate bar in the cart.  \nThis nosy ass lady walked up and said to my mom \"Did you know your son snuck candy into the cart?\"  \nI was like \"who the fuck is this bitch?\"",
          "id": 178,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Yeah, she may have been an authorized user on the card even though her name wasn’t on it.",
          "id": 179,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9043,
      "content": "YTA. Start minding your own business more and other people's less.\n\nEdit:  \n>I tell her that it is my business that she’s doing something illegal \n\nHoly shit I just noticed this. How the hell is it your business?  You need to explain that. \n\nYou are everything wrong with this country",
      "id": 180,
      "comments": [
        {
          "score": 3414,
          "content": "She probably felt so self righteous after too. Couldnt wait to go home and tell her husband. She is probably reading all these YTA and thinking that everyone is wrong and wish they could have her morals.",
          "id": 181,
          "comments": [
            {
              "score": 1675,
              "content": "> husband told me I was TA and want to know before I get home and argue.\n\nShe practically tells us flat out that she's a self righteous asshole in her very first sentence. Let us know how that argument goes, OP lol",
              "id": 182,
              "comments": [
                {
                  "score": 872,
                  "content": "Man I'd be fucking stoked to be the husband at home, waiting for my wife who:\n\n1. eavesdropped on someone's conversation,\n2. obviously followed them to the cashier, \n3. tattled on them to the cashier, \n4. is sure that accusing someone of committing credit card fraud for an amount over $1000 is on the same level of 'parenting' (read: publicly shaming) as reminding someone to say 'please' or 'thank you',\n5. did so without having any information about the circumstances of the purchase, \n6. refused the explanation of the other party with absolutely no indication that the explanation was false,\n7. is completely convinced that she was in the right, and \n8. is on the way home to start a fight about how she is 100% right on this.\n\nI honestly think I'd head out for a few hours.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 214,
                      "content": "OP is about to have one of those moments when you tell your parents about something thinking it was cool just for them to give you a life lesson.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": ">I honestly think I'd head out for a few hours.\n\n\"I'm going to Moe's.\"",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "She is why non smokers go to get smokes and never come back.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "\"I'm gonna go buy some milk from the grocery store I'll be right back.\"",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "Of course! Why do you think she came here? She came here for self-justification and praises to fuel her behaviour. She probably expected people to agree so that she can convince her husband that she isn't TA with reddit comments.\n\nUsually people here would be genuinely worried if what they did was wrong, but she straight up wanted people to agree with her choices",
              "id": 188,
              "comments": [
                {
                  "score": 27,
                  "content": "I could imagine her thinking the worker was gonna start clapping and yelling her all her stuff I'd free today for being such a good citizen. As the manager begs her to work at the store as super manager and fraud supervisor. Keep fighting the good fight op lol",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "\"Usually\" are you new here?",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 470,
          "content": "Plus. She's \"protecting\" a company that makes money off arguably predatory interest rates on credit lent. It's so backasswards.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 346,
          "content": "Lol, I'm a 35 year old woman.  Sometimes my 68 year old mom gives me her credit card to do her grocery shopping for her bc she doesn't like going out in public too much.  It's not fucking illegal nor is it fraud. \n\nOP is an asshole.",
          "id": 192,
          "comments": [
            {
              "score": 46,
              "content": "My mom manages my grandmothers money and uses her cards (for my grandmothers bills and groceries, etc) all the time. I use my moms credit card to pay for my dentist appointments. I’ve used my boyfriends debit card to buy food when I didn’t have my wallet on me. Explicit permission to use the cards was given in all these situations, it’s not even remotely unusually for someone to use a parent’s credit card. I don’t know where OP located a stick this large but she’s going to need to see a proctologist about it ASAP.",
              "id": 193,
              "comments": [
                {
                  "score": 12,
                  "content": "My parents foster 4 toddlers at a time. When I still lived at home, I was sent to the store to grab groceries for dinner or just something for the kids at least twice a week, always with my mom’s credit card. \n\nIt was never, EVER an issue.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I looked it up, It is fraud (it breaks the Terms of Service) but is not illegal.\n\nBreaking the TOS just means the card holder can't fight the charges, which if a person has permission to use the card, there would be no reason the person would.\n\nSo is fraud, just can't go to jail kind of fraud",
              "id": 195,
              "comments": [
                {
                  "score": 19,
                  "content": "If they didn't have permission to use the card then it's stealing, which is illegal. \n\nThere's still no way that OP could have known that the girls dad didn't give permission. Just because she says he's the one paying for it and she has his card doesn't indicate that she stole the card or he didn't agree to pay for her shopping trip.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Exactly OP doesn't know and its not their place to police.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Now I'm thinking of a grown ass man who makes hella bank telling his daughter to go buy him a pair of expensive booties that she likes.\n\nIf I was him I'd be very angry to see that some bitch humiliated my little girl and cheated me out of my rebate on those boots.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "OP thinks it's their business because they deemed the girl's dad irresponsible for giving his daughter a way to buy something she likes when out with friends rather than having to come back with her dad/meet with him. OP thinks that makes a bad parent, which it doesn't, it just means that her father trusts her and wants her to have a good time with her friends without worrying.",
          "id": 199,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I don’t think she understands the difference between her suspicions and legitimate illegal activity. If she saw someone trying to kidnap a child, it would be right to make it her business and intervene. That’s not the same as speculating whether or not the girl’s dad gave her permission to go shopping with his card.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5640,
      "content": "YTA. I understand where you’re coming from, but it’s a mind your own business kind of situation. The father let her have the card, you don’t even know if she’s allowed to use it or not. If she isn’t allowed to, he can deal with the situation as it is his child. It’s not like she said she found the card on the street and is racking up charges everywhere. Plus you’re making everyone’s lives harder by being an ass. Calling the cops for a daughter using her fathers card? You need to chill out",
      "id": 201,
      "comments": [
        {
          "score": 1638,
          "content": "Not to mention, I’m pretty sure the father wouldn’t want the police called on his own daughter for this. So who is she protecting here...",
          "id": 202,
          "comments": [
            {
              "score": 1083,
              "content": "Her sense of self righteousness.",
              "id": 203,
              "comments": [
                {
                  "score": 148,
                  "content": "I think you mean her jealousy that she can’t just throw some stacks and get a pair of boots",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 296,
              "content": "[deleted]",
              "id": 205,
              "comments": [
                {
                  "score": 19,
                  "content": "You would think. I know my dad would have told the OP to please not call the police on his daughter and that he would deal with it.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 99,
              "content": "> So who is she protecting here...\n\nHer sense of superiority over people who spend 4 figures on boots, and people who make different parenting decisions than she does. There is no other reason to mention  whether *her* kid is allowed to use her credit card, or how much the boots cost.",
              "id": 207,
              "comments": [
                {
                  "score": 18,
                  "content": "Bet she's also the type of person who drives the speed limit in the fast lane because no one needs to go faster than that.",
                  "id": 208,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Even if she did steal it if it was really an Issue I'm sure her dad would notice a 1000+ purchase, and then he can return it.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": "[deleted]",
          "id": 210,
          "comments": [
            {
              "score": 18,
              "content": "Goddamnnn that last line flames",
              "id": 211,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 141,
          "content": "This. YTA!",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "If she really didn't have permission, I doubt she would have bought the stuff anyway with her own card. She would have left.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Well said. After reading the title I was thinking OP saved some innocent person the migraine of dealing with identity theft and immediately thought she was in the right. Then I read the post and it’s just her trying to parent another person’s child. Clear YTA",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "If dad doesn’t like it, he can take her to the store and force her to return the boots. It’s not like the girl is robbing a store, it’s her parents job to raise her.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Yeah, one of my friends in high school took his dad's card and spent a bunch of money. They could easily afford it, they were more than well off, but the dad pressed charges on him for taking the card. It's not Karen's job to make that decision, she doesn't know the situation and it's not her kid to discipline. If she overheard that she found the card or something along those lines that would be a different story.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "You know whose probably gonna get the blunt of the fallout?  The damn retail worker.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This happened to me and my sister. She took my card without asking and made about a $20-30 purchase online without asking, when I checked my bank account and saw it and started to freak out. I called my bank told them I didn’t make that purchase canceled my card and got my money back. \n\nMy sister came home and I asked her if she had my card, and she said yes. I explained to her that I’m not mad she used my card but that I needed to know before she used. I told her that I thought it was fraud so I canceled my card and now I had to get a new one. She learned her lesson and it’s never been a problem since.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "And I don't know what police officer would want to waste his day dealing with that anyways. There's actual crime happening in the world and I'm sure officer Joe has more important things to worry about. If it's really that big of a deal couldn't the parents just return the boots anyways?",
          "id": 219,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5355,
      "content": "YTA. What the fuck dude? Plenty of parents hand over their STORE CREDIT CARD for their kid to shop in that store. It wasn't even a damn VISA or anything, a \"loomingdales\" card. I can't tell you how many times my parents did the same- I had permission to buy what I wanted or needed and to use their card. Some people don't have the same price constraints as you and a pair of shoes over $1k isn't a big deal. AND EVEN THEN, it's her dad's card, he would have seen the statement and known exactly what she purchased that was that expensive. The fact that this teen was able to pull out \"her own\" credit card and put it on there instead of walking away from the purchase shows that this girl is living in a very different world than you.\n\n&#x200B;\n\nOf course she walked away crying; you were mean, belittling, sticking your nose where it didn't belong, and causing a scene over a common occurrence. Adult and teenage me would have given you a big middle finger and then swiped my mom's card (that I'm a goddamn authorized user on).",
      "id": 220,
      "comments": [
        {
          "score": 1554,
          "content": "Her parents probably pay their credit card as well anyways. In the end, she just lost that dad some nice store points he could've gotten.",
          "id": 221,
          "comments": [
            {
              "score": 459,
              "content": "[deleted]",
              "id": 222,
              "comments": [
                {
                  "score": 34,
                  "content": "I don't have a bloomingdale's card, but I do have a kohl's card, and you earn $$ back in store credit. Hell, I just spent $100 in kohl's cash that I got because my husband went clothes shopping. We're going to use the same card for back to school shopping for the kids this month. I also get a % off my purchases based on my card history as well as extra sales/coupons in the mail based on purchase amounts.\n\nI end up cashing in the point and using them for Christmas present stash. I buy things I think they'll like or need, and then, when Christmas rolls around I buy the things they ask for. Win win for all of us. \n\nI bet her dad does something similar, collects the bonus amount and puts it toward something else.",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "Not just the points but the discount itself as well. The store card I have for a different brand gives 10% off plus points. A 10% discount when the purchase is in the 4 digits is a minimum of $100. And the points is worth a decent bit too. This girl probably went back and returned everything just to buy it on the store card as she should’ve be able to at the start.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "seems likely that’s what the kid was upset about trying to explain why she used her own card to her dad after the fact",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Exactly, my mother would have been frustrated with me for not using the store card - that's wasting free rewards!",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "*The fact that this teen was able to pull out “her own” credit card and put it on there instead of walking away from the purchase shows that this girl is living in a very different world than you.*\n\nThis is what I came here for! OP, YTA.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "And this is likely why OP injected herself.\n\nJealousy.\n\nPathetic.\n\nMake better life and financial decisions. Then it won't hurt when you see someone casually buying stuff out of your price range.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "My mom gave me her Mastercard all the time. Every time I used it I had permission. I'd definitely have told OP to fuck off and continued with my day.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3700,
      "content": "[deleted]",
      "id": 230,
      "comments": [
        {
          "score": 1820,
          "content": "To me it doesn't actually sound like she meant well, it sounds like she wanted to assert her \"moral superiority\" over a situation that didn't concern her whatsoever. \"Someone has to parent this kid if no one else will\" is so sickeningly self-righteous.",
          "id": 231,
          "comments": [
            {
              "score": 282,
              "content": "110% agree",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 245,
              "content": "Can you imagine what kind of a shit show her son must be being raised by this *ahem* woman.",
              "id": 233,
              "comments": [
                {
                  "score": 30,
                  "content": "He probably sells pot.",
                  "id": 234,
                  "comments": [
                    {
                      "score": 27,
                      "content": "That would be *illegal*, and mama bear doesn't tolerate *illegal*.",
                      "id": 235,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Not only that, notice how she reiterated SEVERAL times how she was in a \"higher end\" department store, and how what she chose was \"VERY expensive\", and how she noticed \"teenage aged girls\" \"fawning\" over boots.  Sounds like she's a little jealous that the girl can have nice things.",
              "id": 236,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "And she damn well made sure she was behind them at the checkout.",
              "id": 237,
              "comments": [
                {
                  "score": 15,
                  "content": "I’d bet money she followed them until they got to the register but it’s okay, the girl needed a parent to point out the illegal. 🙄",
                  "id": 238,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Yeah, since when does a dad wanting to buy his daughter new shoes equate to lack of parenting?? OP is wild",
              "id": 239,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "She was jealous this girl was buying more expensive boots than her.",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "It sound to me that she’s jealous of the price of the boots. If they were something cheap OP wouldn’t have cared. If she was trying to “do the right thing” price wouldn’t have mattered.",
              "id": 241,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "she was jealous of the girl buying shit she can't afford and viewed her as not \"deserving\" of it",
              "id": 242,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 251,
          "content": "Exactly. Growing up my father would give me his card to fill his truck up with gas, buy dinner, or grocery shop. I wasn't buying 4 digit shoes, but I still had his full permission to use it. If I was to abuse it and buy something unnecessary that would be between him and I. He sees his own statement and can question me accordingly. It's not up to a stranger to question my form of payment. This is especially true with a credit card. Even if it was stolen, most major credit cards have a way to dispute unauthorized purchases and deactivate the card.\n\nSo yeah, YTA",
          "id": 243,
          "comments": [
            {
              "score": 28,
              "content": "[deleted]",
              "id": 244,
              "comments": [
                {
                  "score": 23,
                  "content": "That's a good point on credit cards being better than cash because you can keep track of what your child spends money on. Drug dealers don't accept visa!",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Imagine how pissed the dad will be when he finds out he didn’t get the points for the purchase.",
          "id": 246,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3103,
      "content": "YTA. When a rich kids says \"my dad's credit card\" that usually means its a card for them that their dad pays. Mind your business.",
      "id": 247,
      "comments": [
        {
          "score": 724,
          "content": "[deleted]",
          "id": 248,
          "comments": [
            {
              "score": 492,
              "content": "additionally the girl offered to show ID of the SAME last name? op's a bitch",
              "id": 249,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "My mom owns a restaurant so when she was opening multiple chains she barely had time to see me anymore. She would drive my friends and I to the mall and gave me her credit cards as a kind of way to say “sorry I’m not around” \n\nMy budget wasn’t anywhere near 4 digits but I could see that girl going through a similar situation",
              "id": 250,
              "comments": [
                {
                  "score": 9,
                  "content": "I hope you guys have time together now! :)",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yeah, my parents gave me permission to use their cards when they needed me to run errands for them, didn’t want to go with me to buy what I needed, etc. They just told me to sign my own name.",
              "id": 252,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I'm too lazy to look it up but it's always been accepted near me to just use your relative's card and then sign your own name. Obviously with permission, but I've never seen anyone have trouble.",
              "id": 253,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "Seriously I’m nowhere near rich but my dad has given me his credit card in the past to buy clothes and whatever, he just wants to know what I charged after I purchased it. This is just a thing dads do because I doubt they want to be dragged around stores shopping with their daughters",
          "id": 254,
          "comments": [
            {
              "score": 8,
              "content": "Fr, sometimes my mom will be busy and tell me to go buy dinner with her card, it’s not a big deal. Also nowhere near rich lol",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Notice also how she ended up paying with her own card. \n\nYeah, that family’s got money. \n\nIf she had stolen the card and couldn’t afford it, there’s almost 0 chance she’d pay on her own. \n\nAnd most teens don’t exactly have “4 figures” just lying around they can blow willy nilly.",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}