{
  "post content": "\n\nParental dispute help here...... \n\nCaveat, I would NEVER leave my children in an unsafe environment EVER! But my wife insists that this situation is unsafe. I'll let reddit decide if I am an indeed an a**hole. \n\nOn occasion, I will leave my 3 and 5 year old strapped in their car seats while I go inside to pay for gas and get snacks/coffee. I do ask my kids every time if they want to come in with me and they sometimes do, but most of the time they'd rather stay in the van to draw, color, or read. I'm fine with that choice. As most parents would tell you, getting into and out of car seats can be a hassle. \n\nWhen at our gas station, I always make sure....\n-the kids are warned to stay strapped in their seats (they've never not heeded this warning).\n-the van is off, and I have the keys\n-the doors get locked \n-I'm at the nearest possible pump under the shaded awning\n-I can see the van the whole time from the windows of the station.\n-I'm inside 5 min. or less \n-the kids end up with a snack, too :). \n\nSo is this a reasonable parenting practice or, as my wife sarcastically insists, CPS is going to start an investigation into my daddy decisions, and some bystander is going to call me an asshole for leaving my kids in the car. \n\nAm I an asshole?\n\nClarification: Several have asked...... I'm in Michigan, and I've never gotten back into the car after my 5 min. inside and the temperature had changed by more than a couple degrees inside the van (hot or cold). Also, if I see a huge line inside, I don't wait. 5 min. is the max I am away from the van.",
  "id": 1,
  "comments": [
    {
      "score": 339,
      "content": "NAH \n\nBut she's right. Any bystander could call the cops, and you end up on the news.",
      "id": 2,
      "comments": [
        {
          "score": 26,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 40,
              "content": "What? Someone calling the cops? Yes. People in the US in particular call the police all the time over stuff like this.",
              "id": 4,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Unfortunately/Fortunately yes, and depending on context and situation the parents either end up fucked for leaving their kids for 5 min or parents that left their kids for 3 hours get away with it when no one notices :(\n\nTheres also been parents who were arrested and charged for their kids playing in the yard... \n\n:(",
              "id": 5,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -6,
              "content": "I've absolutely called the cops when I see kids left in the car and I absolutely will again.\n\nKids fucking die because of that shit, yo.",
              "id": 6,
              "comments": [
                {
                  "score": 39,
                  "content": "Not when you're popping into a gas station, jesus christ.\n\nThe amount of parents who do this every day without issue is immense.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I didn't say gas station particularly, the commenter asked if people actually called the police over kids being left in the car. The answer is yes.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 0,
                      "content": "The commenter asked if people actually call the cops when people leave kids in the car,\n\nI have never called the cops because kids were left at a gas station,\n\nbut grocery store? restaurant? Both are places I have called the police.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Correct. Know your state’s laws on when you can leave a child unattended. Friend in CT was charged and made the paper for a similar situation with an 8-year-old.",
          "id": 11,
          "comments": [
            {
              "score": 3,
              "content": "[deleted]",
              "id": 12,
              "comments": [
                {
                  "score": 5,
                  "content": "Actually - the kid was sitting in the car in his driveway. He was fined $500 and received a court date.\n\nFrom the police blotter: Leaving a child unattended: DELETING NAME, was arrested DELETING DATE after he allegedly left a child inside his motor vehicle unattended at his residence.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1,
                      "content": "What a ridiculous law. All it needs to be sensible is a short time limit.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -25,
          "content": "He's not an asshole he's just lazy. There are so many variables that could unfold that could put his kids in harms way. It is textbook legal neglect, though.",
          "id": 15,
          "comments": [
            {
              "score": 43,
              "content": "OP here, I appreciate your opinion, and maybe watching my kids in a van from 30 ft. away for 5 min. is considered legal neglect. But I reject the lazy assertion. If the kids want to come in with me, they do. I never make them wait in the van. I frankly have no problem if they want to come in, but most of the time the want to continue whatever car activity they are in the middle of. You also mention variables. Leaving them in the van has risks, but so does getting 2 small kids in and out of the van and shop safely in a busy parking lot with strangers everywhere. Both have a myriad of unfolding negative possibilities, but is one a safer option than the other?",
              "id": 16,
              "comments": [
                {
                  "score": 1,
                  "content": "Its selfish lazy parenting with a slew of justification (snacks for the kids lol really, man?). Do you have a medical condition? Is it possible something could happen to you that would prevent you from getting back to your car which would leave 2 toddlers unattended and noone knowing they're yours? It just makes too much sense to get the kids out of the car and bring them in to try to justify anything else. They're kids, its not about their preference any other time for you. You're the father and choose for them unless its convenient for you to allow them to make the choice and rationalize why its a good idea. It's not lol... \n\nAt the very least, you respect your partner enough to follow her wishes in regards to the safety of her children. If I told my wife to stop leaving the kids alone in the car at the gas station and she ignored me because she rationalized it to herself and got positive reinforcent from internet strangers, we'd have problems.\n\n\nhttps://m.youtube.com/watch?v=NXl7FYBgYUA",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "info - why do you wait to get snacks/coffee then? can you pay for the gas at the pump? \n\nseems like an easily remedied potential asshole situation with a safer option available. you will be ta is you can make different choices, don't, and get cps/911 called on your family.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Textbook legal neglect? So you are a Michigan lawyer now?",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 233,
      "content": "[deleted]",
      "id": 20,
      "comments": [
        {
          "score": 72,
          "content": "This thread is ridiculous.\n\nIt’s clear no one here has had kids or even been around them. Leaving a 3 and 5 year old to pay for gas is completely safe.",
          "id": 21,
          "comments": [
            {
              "score": 15,
              "content": "I personally don't have a problem with him doing it, but when my kid was younger I was hesitant to do it because of worrying about cps/police involvement. It sucked because my kid was totally capable of sitting by himself in the car for 5 minutes, but the risk of someone calling the police made it not worth it to me. I even looked up my states laws on this. Some states have a definite age limit. Of course mine was one of the ambiguous ones with no ages listed. Its frustrating.",
              "id": 22,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah it’s odd finding out how weird America is culturally about this. Where I’m from (and indeed most other places I’ve travelled) it’s standard procedure and no one bats an eye. If someone called CPS to report it you’d get laughed at.\n\nIt’s why I’d say NAH - the wife has best interests at heart, and the husband is being practical (albeit, like me, apparently ignorant about how nosy and annoying some people can be over there): there’s no risk to the kids, it’s really not a big deal. \n\nBut to call the husband an asshole is where I take umbrage, because it’s just ridiculous.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My family got in trouble when we left my 2 nephews unattended in the car for an hourish.\n\nContext:\n\nWinter. Engine was left on. 1 boy age 9. 1 boy age 14. And car was facing the store we were in.\n\nIn the cop's defense, the 14 year old looked like he was younger than the 9 year old.",
              "id": 24,
              "comments": [
                {
                  "score": -1,
                  "content": "As they should’ve. An hour is far too long,\nAnd not at all analogous to what we’re discussing .",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -28,
              "content": "I have 5 kids. I would never ever leave them alone in the car while I went into a building. There's too many variables, and I'm usually the most relaxed parent around when it comes to getting \"overprotective.\"",
              "id": 26,
              "comments": [
                {
                  "score": 31,
                  "content": "There’s no way you can call yourself the ‘most relaxed parent around’ with a straight face and also say you’d never leave your kid in a car, in full view of you, for a few minutes.",
                  "id": 27,
                  "comments": [
                    {
                      "score": -15,
                      "content": "I can when it comes to every other situation, I've also literally never seen anyone who does walk away from their kids in the car, even at a gas station. Of course its extremely rare for anyone to not just pay at the pump either.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "You know most service stations have massive windows so you can see the cars, right? It’s not like they could be carried off.",
                  "id": 29,
                  "comments": [
                    {
                      "score": -4,
                      "content": "There are news stories every so often with exactly that happening. And they're are tons of busybodies who would love nothing more than to call CPS and make my life even crazier for something like that. It's just not worth the risks.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I really do not see it as a problem as well. My parents did it with me as well. I never got with them if they just picked something up really quick.\n\nMaybe a cultural difference but NTA for me.",
          "id": 31,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 121,
      "content": "NTA.\n\nI am totally with you bud. They were safe.\n\nOur society has a culture of over protectiveness. So I'm sure this will be a very controversial topic",
      "id": 32,
      "comments": [
        {
          "score": 26,
          "content": "It is controversial. But I am loving the discussion. Made me think both positive and negative.",
          "id": 33,
          "comments": [
            {
              "score": 22,
              "content": "It’s not controversial, it’s a bunch of pearl clutching people with no grasp on reality mate.\n\nLeaving your kids alone for that amount of time is perfectly fine, especially when you’re locking doors and ensuring they have stuff to do - and asking if they want to come in.",
              "id": 34,
              "comments": [
                {
                  "score": 15,
                  "content": "I’d specify that it’s fine in *cooler* locations. But here in Florida 5 minutes in the car can quickly get dangerous.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I would just remote start the car to keep the ac running..but  what if the ac fails...starts fire ...oh the humanity...\n\nSeriously though, on a really hot day, id agree with you even 5 minutes it can get stifling..",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 86,
      "content": "YTA\n\nI totally understand why you're doing this, my parents did this when I was a kid, and obviously CPS getting involved is a joke, BUT the reality is that leaving your kids alone unattended in a car isn't safe. There are just too many things that could go wrong, especially as they get a little older and more able to get into things. Beyond their ability to cause potential damage to self/others, the car could be stolen/broken into or something external could happen. You might get hung up at the gas station for a variety of reasons and that 5-10 minutes turns into a half hour. You can't be certain they'll be safe.\n\nedit: I really can't believe so many people are defending leaving children in an off car in the summer (this was posted at a time of year when most of the world is above 70 degrees f). [More than 50 children died unattended in cars in 2018. The inside of a car can raise by 20 degrees in just 10 minutes; on an 80-degree day that could be fatal.](https://www.cnn.com/2019/07/30/us/hot-car-deaths-child-charts-graphs-2019-trnd/index.html)",
      "id": 37,
      "comments": [
        {
          "score": 61,
          "content": "Very valid points. However, is juggling my 2 children out of the van and across what is essentially an active roadway with multiple vehicles moving around, gas fumes, and a myriad of people we don't know necessarily safer than keeping them happily and safely locked in my van and in my eyesight the entire time?  I feel like the argument of \"What if something happens?\" is mute. Something bad can happen no matter what I do with them. Am I too old school to think that my decision to let them be happy kids in the car is anything but reasonable in this situation? I reject the notion that rational decisions are considered wrong out of the fear of \"what if\". And I certainly don't want that to be a lesson my kids follow in life either. Yes, caution is important, but over-caution harms quality of life. I appreciate the discussion! Thank you everyone!",
          "id": 38,
          "comments": [
            {
              "score": -13,
              "content": "If you’ve ever done this in the summer (since this post comes in early fall/late summer I assume you have), your children very literally could’ve died.\n\nedit: and the argument of “gas fumes in the parking lot!” seems even more reactionary than my initial points lmao",
              "id": 39,
              "comments": [
                {
                  "score": 17,
                  "content": "I hope you sensed my sarcasm with the gas fumes, lol. I was making the point that every decision has possible negative outcomes. But you should be able the make a rational decision one way or the other. Also, I very much think the idea that children in very public place with people all around, parked at a gas pump in the shade while I am just 30 ft. away, have an extremely low chance of \"literally dying.\" To me that is living a life of extremely irrational fears. If I worried that much, I'd might as well never let my kids leave the house.....",
                  "id": 40,
                  "comments": [
                    {
                      "score": -5,
                      "content": "I’m sure the parents of all the children who died in hot cars who thought they’d be fine leaving their kid in an off car for 15 minutes all thought the exact same way. They’re your kids, but heat damage is very real and comes on very quickly. By the time they’re experiencing visible symptoms that could prompt someone to get them from the car, it’s often too late.\n\nFor me, honestly, just the fact that it makes your wife uncomfortable should be enough to make you stop. The way you talk about it comes across as you painting your wife as irrational and you as the “correct” parent who’s not “uptight.” I don’t think that’s a productive way to go about co-parenting. If you decide it’s okay to override her wishes on this thing, that opens up a door for you to ignore her on other things just because she’s “irrational” for not wanting her kids left alone in a car.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "The car could be stolen or broken into? At a gas station while the man is inside paying for gas? Do you have a sense of reality?\n\nFirst getting in the car requires either breaking the window or picking the lock. You think he's going to do that in broad daylight while there's 10 people around and he knows the owner of the car is standing 30 feet away within sight of the car?\n\nThen modern cars have a transponder in the ignition. This is basically impossible to steal without a lot of work on the car or duplicating the key (which can only be done by a dealer). How's he going to do that?\n\nThe people who are spewing out nonsense scenarios have watched too many movies and this is the kind of hysterical ignorance that keeps parents from acting reasonably. This is why kids aren't allowed to walk to school anymore even though we live in the safest society in decades.\n\nNTA",
          "id": 42,
          "comments": [
            {
              "score": 28,
              "content": "I think it might be an American thing to worry about this. Because here in Europe everybody leaves their kids in the car while they pay for gas.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "They are probably a hundred times more likely to die in a car accident driving to the gas station than while sitting in the car at it.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "yeah, this is just one of those things that has changed. My parents left me in the car too, but I just don't think people are doing that anymore.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "While I see your point about an unforseen holdup in the gas station, I don't see how it could turn into a 30 mins wait if you know the kids are in the car. Like once you realize youre waiting more than 2 mins, any smart parent who practices this less than smart decision would go back for the kid in the parking lot. No cornerstore worker would force you to stay in the building if you let them know your just running to the car or something. Hell, they won't even car if you don't say anything as long as you aren't obviously stealing from them.",
          "id": 46,
          "comments": [
            {
              "score": -19,
              "content": "What if it wasn’t your usual day to take your kids and you slip into routine muscle memory? What if something has your attention in the gas station and you’re held up? The human mind isn’t a miracle worker; adults are easily distracted, too. It’s better to be safe than sorry.",
              "id": 47,
              "comments": [
                {
                  "score": 9,
                  "content": "OP stated he keeps them in view the whole time. Kinda hard to forget about something you're looking at, especially when that something is the fruit of your loins.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 0,
                      "content": "https://www.google.com/amp/s/www.nytimes.com/2019/08/01/nyregion/children-left-to-die-in-hot-cars-accident-or-murder.amp.html\n\nI gather these parents were also confident in their own abilities to avoid distractions. Not saying OP is a bad person or that he’s the asshole. Sometimes shit happens, but most people don’t think shit can happen to them.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Unfortunately this is absolutely something CPS could end up involved in, shockingly. It would just take one busybody with a cellphone. I’m not saying your kids would be taken away, but it could cause you a tremendous amount of headache and stress. Leaving kids in the car is no longer the norm and could cause you serious trouble.",
          "id": 50,
          "comments": [
            {
              "score": 5,
              "content": "Maybe in the US but in the UK you'd get laughed at for referring someone going into a garage for 5min to CPS.",
              "id": 51,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "or they could get run over walking across a forecourt. how far do you want to go with the world is an unsafe space simulation",
          "id": 52,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 77,
      "content": "NTA I live in the UK so maybe gas stations in America are different but here the petrol pump will be at most 10 meteres away from where you pay, the car is easy to see as the cashier needs to be able to look out at the pumps anyway. I don't understand what people think is the possible danger?",
      "id": 53,
      "comments": [
        {
          "score": 14,
          "content": "Was thinking the same thing. Everyone in Europe (at least western EU as far as I know) leaves their kids in the car.",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I do think this is very location-based as far as safety goes. Carjackings happen nearly daily where I live, in June someone stole a car with a baby in the backseat. Parents don't leave their kids in cars because it only takes one gun to the head while you are outside the vehicle, and the next thing you know the MF is driving away with your kids.",
          "id": 55,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 46,
      "content": "Ehhh...I’m on your wife’s side here. Pay at the pump. You don’t NEED to go inside.\nWill anything happen to them? Most likely no but.. YTA, sorry.\n\nPlus, you can’t really put it on your kids to decide what they’d rather do.",
      "id": 56,
      "comments": [
        {
          "score": 28,
          "content": "Where I live you can’t pay by cash at the pump. And since I almost exclusively pay with cash, you see the problem here",
          "id": 57,
          "comments": [
            {
              "score": 6,
              "content": "Where I live 99% of stations you can't pay at the pump at all.\n\nOne (completely unmanned) station is the only exception I've ever seen.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Ok then, you take your kids inside with you. Problem solved!",
              "id": 59,
              "comments": [
                {
                  "score": 21,
                  "content": "Big hassle, why not leave them in the car?\n\nWhat risk are they at?",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "[deleted]",
          "id": 61,
          "comments": [
            {
              "score": -2,
              "content": "Then take your kids inside with you",
              "id": 62,
              "comments": [
                {
                  "score": -2,
                  "content": "[deleted]",
                  "id": 63,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Wow. 5 min is one thing but the grocery story? That’s shitty.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 41,
      "content": "NTA, imo. The doors are locked and they're strapped in. They're fine and even in the incredibly unlikely event something were to happen you're right there and can always see the van.",
      "id": 65,
      "comments": [
        {
          "score": -19,
          "content": "Unless the thing that happens is he bumps his head or passes out or something and doesn't get back to the car in time.\n\nId feel differently if this were a kid big enough to understand a bad situation and get out of a car themselves if it's overheating.",
          "id": 66,
          "comments": [
            {
              "score": 19,
              "content": "If this happens the cashier will notice within 15 minutes that the car has been parked at the pumps for ages and go check and then notice the kids inside, all gas stations havecobwrings so the cars are always in the shade",
              "id": 67,
              "comments": [
                {
                  "score": -18,
                  "content": "They might notice the car but if they are dealing with waiting for an ambulance and organizing all that they might not necessarily think there are kids in the car, just that the car is sitting there because it's the man's who is now in an ambulance.\nIt doesn't take a long time at all for a car to heat up when it's warm, shade or not.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 15,
                      "content": "What a stupid hypothetical.\n\nIt’s more likely the kids will be involved in a hold up while inside the gas station.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "NTA I don’t remember ever going into the petrol station with my dad",
      "id": 70,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "NAH\nI am genuinely surprised by the number of people saying yta. I know that the big talking point these days is about leaving kids (and animals) in the car on hot days so people are sensitive to it.\n\nBut this is not equivalent. Simply put, nothing is going to happen to them in a locked vehicle over the course of five minutes, while it is in direct view of yourself, especially if you use the child locks that are standard on every vehicle, making it so the rear doors can't be opened from the inside.\n\nI doubt 5 minutes in the sun on a hot summer day would even be an actual health risk, but I don't want to speculate, as that's not the situation here. Even if CPS were to be called, they would take no action beyond MAYBE a brief investigation in which they find out the vehicle was locked, in sight, under shade, and on a relatively cool day. This is simply not actionable.\n\nAlso its super common.\n\nBut... Maybe don't rely on internet strangers to win an argument with your wife about parenting. Talk to professionals and get their advice so you can both learn to be the best parents to your kids and partners to each other that you can be",
      "id": 71,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 24,
      "content": "NTA\n\nif you’ve removed the keys and locked the car I don’t see the problem.\n\nMy parents used to lock the car and disappear into supermarkets for hours.",
      "id": 72,
      "comments": [
        {
          "score": 8,
          "content": "Our parents used to do a lot of things. Just because they did it then doesn’t make it ok to do it now",
          "id": 73,
          "comments": [
            {
              "score": 19,
              "content": "Also doesn’t make it wrong?\n\nAnd there’s nothing wrong here at all.",
              "id": 74,
              "comments": [
                {
                  "score": 0,
                  "content": "It’s illegal where OP lives so there’s that 😂",
                  "id": 75,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Epic?\n\nNo cops are going to give a flying fuck, because it’s harmless and a lot of people do it. You’ve yet to actually say why it’s wrong other than tell me it’s illegal (source?) and make some bollocks statement about ‘just because your parents did it doesn’t mean it’s okay now’.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "What makes you so sure it's not okay?",
              "id": 77,
              "comments": [
                {
                  "score": -1,
                  "content": "Then go right ahead and leave your kids in the car. I’d never do it with mine. \n\nBesides, it’s illegal in some states including where the OP lives.",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}