{
  "post content": "Throwaway account, obviously, as the people involved are frequent redditors.\n\n\nThis has been on my chest for a while now, and I honestly dunno if this is the right thing to do, so posting it here. Some facts changed for recognition.\n\n\nI had a friend group on Sunday that did gaming and such, pre-COVID. It was made up of three boys and three girls, one of the girls being me, and we held it at one of their apartments. The other two girls, let's call Cindy and Eileen.\n\n\nCindy has mental health issues and sometimes struggles to show up on time. When she doesn't make it, every other member of the group is super concerned about her and showers her on our Skype chat with comforting messages.\n\n\nAs COVID was kicking in, I lost someone really close to me. Did not even merit a 'that sucks'. I think I got an 'ok' in chat on that one. Had a mental breakdown, didn't show up for a month, nothing. Recovered, started on anti-anxiety and anti-depressant medication, and am trying to turn things around. Not even a peep of concern. A single \"are you ok, you've been gone for a while and we miss you\" would have helped pull me out of that pit of self-hate immensely. But Cindy can be like \"I don't wanna join today, I'm gonna go eat a pizza and lie down\" and everyone in chat is instantly \"we love you, Cindy! Feel better!\"\n\n\nMaybe they don't feel the same way about me that I did about them, I dunno. I know it's a gaming group, not a support group, but it makes me feel so unwanted at the end of the day and furious to see those messages of support for someone else that I've just started being a complete spiteful bitch. I've said a lot of really hateful things I don't mean, and ended the previous session early as a result.\n\n\nTL;DR: AITA for trying to derail a gaming group over concern-jealousy for a depressed person?",
  "id": 1,
  "comments": [
    {
      "score": 858,
      "content": "ESH.\n\n I'm so, so sorry for what you're going through, and I'm so sorry for your loss. From what you've said, your friends don't seem like your friends. It sucks when it takes something like this to realize that.\n\nThat being said, this one girl didn't cause the group to be like that. She didn't ask for the attention, and she didn't tell them not to give it equally to you. You're completely in your right to feel spite, but it shouldn't be aimed at her.\n\nEdit: my ESH is solely based on what we were given. I don't think OP sucks at all. I think she's going through something horrible, and she needed the support of her friends (MAN I get that!! When my dad died, my supposed best friend was nowhere in sight!). I think her hatred of the other girl is misplaced, and she needs new friends asap!",
      "id": 2,
      "comments": [
        {
          "score": 231,
          "content": ">but it shouldn't be aimed at her.\n\nExactly this. \n\nI get how OP feels, being down with barely a soul being concerned. \n\nBut I reckon it's more an issue where people \"empathise\" as a sort of peer pressure -- i.e. see one friend doing it, everyone jumps on the bandwagon. No one does it, and they don't really care, cos they don't REALLY empathise with the people facing it. Ofc, not everyone is like this and some people really do empathise, however I find there are more people who empathise due to peer pressure more than the genuine people empathising.\n\n&#x200B;\n\ni've never used the word empathise so many times in my life.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I would say NAH (as in , not OP and not the one girl) but these \"friends\" are a totally different matter.\n\nOP should find new, real friends - not these people that apparently tolerate your presence - nothing else.",
          "id": 4,
          "comments": [
            {
              "score": 12,
              "content": "My ESH is based solely on what we were given. Do I think OP actually sucks? Absolutely not! I just think her hatred of the depressed girl is misplaced. I completely agree OP should be finding new, real friends!",
              "id": 5,
              "comments": [
                {
                  "score": 2,
                  "content": "I thought NAH due to the fact that these 'friends' kind of force dislike towards the other person - but ESH works too - with the exception of the actually depressed girl- she does not seem to ask for this.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "NAH I've learned that relationships are based on the way you act. Which is obvious in a sense. \n\nIt's clear that those friends are willing to give levels of support for the mentally ill. They don't act that way to OP because I'd bet they probably don't understand the level of support she needs. Probably because OP isn't open about her struggles. No where do I see OP telling her friends she left cause of mental issues. It seems like she expects them to be mind readers.\n\n99% most people aren't maliciously trying to exclude another person. So I can't see them as assholes.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "But conversely, she also didn't reach out to OP despite arguably knowing what it's like to need that support, so she's at least as bad if not worse than the rest of the group. NTA.",
          "id": 8,
          "comments": [
            {
              "score": 8,
              "content": "Not knowing her makes it really hard for me to say she's just as bad, or worse, as the group. I have depression and anxiety, I've lost both my parents, I've had a a basically shitty hand dealt to me. For some reason when people are going through these same things, I become a recluse. It's something I'm working hard on, but it is really hard for me. I have no idea why! Maybe she's like this too? Maybe that still makes her, and me, TA. Who knows. \n\nMy saying ESH is solely based on what we were given. Do I think OP actually sucks? Absolutely not. But I think her hating the one girl because people give her attention they don't give to OP is misplaced.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Dont know why you got down voted. I agree with you",
              "id": 10,
              "comments": [
                {
                  "score": 2,
                  "content": "Cos I implied a mental illness isn't an excuse for assholery. This sub either demonizes or idolizes certain things and never has room for any in between",
                  "id": 11,
                  "comments": [
                    {
                      "score": 5,
                      "content": "As someone with more than one mental illness, it really isn't an excuse to be an asshole! People who think otherwise are assholes themselves",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I gave you an upvote! I agree with you. While it's incredibly hard for me to reach out to others, you're not wrong about what you said!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[deleted]",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "Everyone sucks here.",
              "id": 15,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 279,
      "content": "ESH\n I don't think you're shitty for acting out because you felt like no one cared. Buuuuuut, think about it this way. She seems to have been open about her issues and struggles and is open about when she can't do things because of them. It seems like you haven't and want the same amount of support without actually asking for it or expressing a need.\n\nYou can't resent people for not giving you support when you didn't ask for any. Id apologise and say you felt hurt and next time ask for what you need.\n\nOther commenters have a point though, are these your close friends? If so they should absolutely be checking in with you and giving way more support just right off the bat than what you described after a loss like that. If it's an unequal situation try find some loving friends op x",
      "id": 16,
      "comments": [
        {
          "score": 28,
          "content": "Gotta agree with this, theres a good chance they are unaware that you are feeling this way, it also sounds like thats one of the quirks of your friends personality that shes quite needy in a way that no one seems to mind so they expect that kind of interaction with her. Its also worth keeping in mind that literally everyone has lost a part of themselves to this pandemic, I dont think anyone gets left unscathed. Theres so much going on right now that I couldnt really say if any of my friends are going through shit atm and tbh i just assume everyone is a little depressed right now.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'm not sure why OP is being expected to ask their friends to care about them after someone close died. It sounds like they did at least mention someone dying, but got a pretty apathetic response. \nMaybe I was raised differently, but if someone were to tell me a loved one died, I'd probably be immediately inclined to make sure this person is doing ok",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -115,
          "content": "[removed]",
          "id": 19,
          "comments": [
            {
              "score": 76,
              "content": "Wow ur the most passive aggressive therapist I’ve ever seen",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 74,
              "content": "You spelled your own job title wrong so I doubt that.",
              "id": 21,
              "comments": [
                {
                  "score": 36,
                  "content": "Never thought I'd see a \"licensed therapest\" farming negative karma on a day old account on Reddit... \n\nIn saying troll. Same luck next try buddy!\n\nEdit: I replied to you instead of the licensed therapest... Damn this night owl brain in the morning",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Thera*pest* is right though",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "I mean that's totally cool? I'm just giving my opinion? I think that they're kind of all a little at fault and I hope op gets support in what they're going through and better supportive friends. What's with the title dropping and sarcasm?",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 86,
      "content": "ESH yea your friends suck and you should make some that actually care about you and your wellbeing. But this is not at all cindy’s fault, she hasn’t done anything at all and has no control over how your friend treat you and her differently.",
      "id": 25,
      "comments": [
        {
          "score": 7,
          "content": "Well except also apparently being a friend and not reaching out",
          "id": 26,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 48,
      "content": "NAH. Listen, depression and anxiety are a hell of a drug. You shouldn't be upset with your friend who has depression. She has no control over the actions of your other friends. If you want the support of your friends, you may need to ask for it. If you are someone who is always fine, puts up a tough front, never asks for help, your friends won't know you need help.\n\nTalk to the one you're closest to about how much you've even struggling, apologize for saying nasty things last time, and explain how you feel like they don't care about you. Don't bring up Cindy. This isn't about her. This is about you and them.",
      "id": 27,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "Seems like you're angry at the other people's behavior, not Cindy's. Towards Cindy, seems like you're just bitter she gets treated better. It's very possible she keeps direct personal friendships going with the rest of the group and you obviously don't.",
      "id": 28,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 17,
      "content": "Nta. OP, are you sure these are your friends? They didn't make any effort to reach out to you while you were grieving or when you started having mental health issues. It doesn't sound like they care enough to deserve being called friends.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "ESH. you could’ve handled that a lot better with communication, but they also sound like inconsiderate friends.",
      "id": 30,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "NAH. Depression is hard. Loss is hard. Anxiety is hard. I get it, OP. I've been there too. Nothing hurts worse than feeling like nobody cares that you're hurting, even though the people ignoring you seem to care very much for the struggles of someone else.\n\nIt might not be the case, though, OP. I know you've had to deal with your illnesses and your hardships on your own, but that doesn't mean your friends really couldn't care less for you. It could be that they genuinely didn't know. They might have thought you had a handle on it. People get scared to death to confront grief and mental health issues. They don't know what to say or do; they don't know what you need or want and they don't know what would be crossing a line. When you're the one hurting, you very much just want an \"are you okay,\" and that's easily done; I'm sorry you didn't get that. But, your friends may not have known you needed that. If you didn't open up about it, even if you had expressed that had happened, they may not have known you WANTED their expressed concern. Some people are uncomfortable with that and are embarrassed by that kind of attention.\n\nI'm not excusing them for neglecting even to check on you, but don't give up on them yet. Try expressing your hurt in a way that won't ruin your friendships. It shouldn't be on your shoulders, and it doesn't feel fair, but sometimes we have to sacrifice a little bit of our pride to make sure we reach the outcome we need to heal. Talk to them about it. See what they say, what they do. If they continue to snub you but support your friend, by all means, break away from them. But - don't react in anger. It will only push them away. If it turns out to be that they just don't value you as they should, then yes: let them go and continue living, and try your best not to let anger and resentment fester in you over what happened.\n\nNo matter what, though, don't blame Cindy for what happened. She's mentally ill, just like you are. Don't kick her while she's down just because she's getting support and you aren't. It's not productive, and it doesn't help to end the stigma surrounding mental illness. Lift her up, and let your friends (including her!) know that maybe sometimes you need to be lifted up too.",
      "id": 31,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA sounds like they don’t care about you. Don’t be too rude but maybe they’re not your best friends.",
      "id": 32,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "For wanting to leave the group, NTA. As for being angry and spiteful, that’s a little more complicated.\n\n  You’re right to be upset with your friends. That nonreaction was crappy of them. You want friends who will think about you when you’re going through a crisis. You know it’s a reasonable expectation from them because of the care your other friend gets. You want to know you matter to them, too. You’re not an asshole for wanting that.\n\n Something to think about is maybe your neglect wasn’t deliberate or a reflection of their values. Everyone was feeling upside down at the start of the pandemic. They could have been caught up in their own emotions and lost in the 2020 haze. Their nonreaction was still super crappy, though. Mull it over decide if it would change anything about how you feel, big or small. \n\nThe attention your depressed friend is getting is probably a case of “the squeaky wheel gets the grease.” Maybe they wouldn’t say jack to her if she didn’t discuss her struggles so often. But she does, so it feels like you’re being left in the cold and punished for not wanting to throw things out there like she does. \n\n  There’s nothing wrong with you for not wanting to talk about it like she does. It’s a personality difference. She’ll get more recognition from this particular group of friends because of it, and that’s frustrating but inevitable part of being a private person. You might be able to manage that expectation if you weren’t already in so much pain, but losing someone puts everything in hard mode for a while.\n\nThe sucky result is that you don’t feel seen or cared for, and not being seen makes you feel disregarded and like not much of a person. \n\nBeing mad at your depressed friend personally is misdirected anger, but your post indicated you already know that. Does feeling that anger make you an asshole? Hell no. Misdirected anger is part of the human experience. What’s unfair is acting on it and being spiteful. I think you already know that, too, but don’t know what the hell to do with it. It’s hard, isn’t it? It really, really sucks, and it’s so easy to end up invalidating yourself and everything you feel with that guilt.  \n\n  If you feel safe enough to do it, apologize for what you know wasn’t called for and try opening up about how hard your loss has been for you and how lonely you feel. See if you get the same degree of compassion when you show them that you’re hurting. See if they check in with you sometimes. If they do, you’ll know they got lost in the 2020 sauce and you still matter to them. If they don’t, you’ll know this isn’t a friend group you want to be a part of. That would be hard, but it’s better than feeling invalidated all the time. \n\n  No matter what, it’s okay to leave. You aren’t obligated to keep the group together when you aren’t enjoying it. \n\n  I’m so sorry for your loss. Take care of yourself.",
      "id": 33,
      "comments": [],
      "relation": "Support"
    }
  ]
}