{
  "post content": "This couple I’m not very close with but the wife is a long-time family friend so I felt that I should invite her. To be clear, all of my invitations stated that there were to be no children at this wedding. But she and her husband showed up with their infant and toddler (who I think is like 3-4). \n\nAt the actual wedding ceremony, I let it slide. I was preoccupied for obvious reasons. I also thought that maybe they planned not to attend the reception or to have someone pick the kids up before it started. (My niece, who was our flower girl, and a few other kids who had to be at the wedding for one reason or another we’re getting picked up/dropped off after the ceremony ended). \n\nAnyway the reception rolls around (I’m fast forwarding through irrelevant details about the wedding but it was beautiful and everything went as smoothly as could be expected). The couple comes and, lo and behold, they still have their children.\n\nI had many other guests and didn’t really feel like dealing with it so I asked our event planner to go over to them and discuss whether someone was picking up the child as the reception (and wedding, frankly!) were not supposed to have children. \n\nI mean, everyone was drinking and loud and rowdy and  a crying child and another little one running around was not part of the plan. (The infant  already had to be taken out once during the wedding ceremony because of fussiness and the toddler was, from what I could see, already appearing cranky). \n\nMy event planner went to talk to the couple. I could tell they were arguing with my event planner though so I went over to help him. I think they thought I came to rescue them because they started going on about how rude my event planner was. I explained that I had actually sent him over to discuss the children. I reiterated that the event was child-free and said that I had stated so clearly on my invitations. \n\nThe wife gave a sort of apology and then assured me that they were capable of minding their own children to make sure they didn’t get in the way of anything. I said that wasn’t really the point. That’s when my now-husband comes over and he and the other woman’s husband begin going back and forth and things got a little heated. \n\nFinally I snapped and said that they just needed to go, which, thankfully they did without much more noise. Still, the whole scene was incredibly embarrassing which is exactly what I wanted to avoid. \n\nI really hate that my wedding day had to be somewhat marred by this incident. According to my mother, everyone was talking about it and I guess enjoying a little dramatic entertainment. \n\nWas I the a-hole for making them leave?\n\n**Edit 1: Wow um this kind of blew up out of nowhere. Thank you all so much for the feedback. What I’ve gotten from this is that most people think that the couple was rude. There are also a select few who feel that it’s assholish to have a kid-free wedding at all which is...interesting.**\n\n**By way of an update, I have now learned that a few family members felt that it was inappropriate of me to kick out the couple. (The wife apparently is still angry about getting kicked out and the husband is FALSELY telling people that we threatened to call the cops on them). No one has said anything directly to me though.**\n\n**Anyway the feedback here has helped me not to feel guilty about that and just realize that not everyone has the same ideas about tact and manners.** \n\n**Edit 2: Well apparently this went somewhat viral and has now been in articles on Fox News, DailyMail, and Yahoo News. Many thanks to those in the comments who let me know! I had used a throwaway account to stay anonymous and lowkey, but I guess that’s out the window lol. No point in deleting now, so whoever sees it, sees it 🤷‍♀️",
  "id": 1,
  "comments": [
    {
      "score": 5248,
      "content": "Absolutely NTA you stated it on the invitation and asked them politely first. I feel awful that a day that was meant to be the best of your life was tarnished by the event ",
      "id": 2,
      "comments": [
        {
          "score": 1495,
          "content": "Agree! NTA. The assholes we're the ones who brought their kids to an explicitly child-free event. And then caused a scene when they were asked to leave.",
          "id": 3,
          "comments": [
            {
              "score": 548,
              "content": "Hell, my friend is allowing kids at her wedding and I double checked that she wasn't just being polite to me. All the other kids are older and can sit through the ceremony, while I have a toddler, so I let her know she doesn't have to be \"fair\" if she doesn't want toddlers. A wedding should be 100% whatever the couple getting married wants.",
              "id": 4,
              "comments": [
                {
                  "score": 229,
                  "content": "I have a six year old, and even if children were allowed I would probably still find a sitter.  If I'm getting all dolled up to go to a wedding, I want to relax and have fun.  I love my little dude, but mommy needs to unwind sometimes.  ",
                  "id": 5,
                  "comments": [
                    {
                      "score": 59,
                      "content": "I have 5 kids and until they got older I only brought them to close family events. My kids are very well behaved when we go out because we talk about expectations beforehand. I also make sure to watch them like a hawk and discipline before things get out of hand.\n\n Many times I would stay home with them instead of getting a sitter (who the fuck is going to watch 5 kids!).  My SO would pop in to the event just as a show of respect.\n\n I would often say the same as you-even when I brought them I could not enjoy myself because I couldn't relax. I never wanted to be \"that Mom\" that doesn't give a shit what her kids are doing so I would be hyper focused on the kids.\n\n Now it's much better because they're older, but when someone can says no kids- it means NO KIDS!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Exactly this... we always get a sitter.. it’s not often as parents we get a night off to have fun, a wedding is a perfect time to do it !",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 185,
              "content": "Yeah for them to argue about it was even more outrageous. You don't have to explain or justify why you didn't want kids at your own wedding. ",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "NTA the inconsiderate couple who thought they were somehow excluded from the child free part of the invitation are assholes! What goes through the head of people like that? ‘Well it says no kids but that couldn’t possibly mean US’... because everyone just luvs their noise making bundles of smells am I right? They probably had those kids dressed to the nines too. If they couldn’t get a sitter they should have excluded themselves. A family friend you felt obligated to invite isn’t someone that would have been missed on your big day. Then to go as far as to argue with the groom! The arrogance of some people never ceases to astound me. Good for you for giving them the boot & not letting their shitty actions put a damper on your big day! Definitely NTA, they are.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Nothing worse than pretentious couples who have no regard for others wishes. Especially on such an important day. ",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Totally NTA. People don’t seem to understand etiquette anymore. My neighbor recently got married, she knows our children really well and her daughter loves our entire family and spend tons of time at our house. The invitation did not say anything about children but it was addressed only to me and my wife so the children stayed home. If she wanted them at the wedding and reception she would have put their names on the invitation. I can’t even imagine blatantly ignoring a statement making this absolutely clear.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "NTA. I ended a 12 year friendship bc I had a no child policy at my wedding, with the exception of my own child and my nieces and nephews. My “friend” was upset and said to me that if I didn’t want her child there I didn’t want her there. No, I didn’t want kids running around alcohol fueled adults and we hired a trusted babysitter for our very closely related kids, no apologies. I actually got a lot of thank yous from other parents for an excuse for a night off. Haven’t spoken to her since and no regrets, I realized how toxic she was in a lot of areas. ",
          "id": 12,
          "comments": [
            {
              "score": 22,
              "content": "> I didn’t want her child there I didn’t want her there.\n\n\"ok\"",
              "id": 13,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "It will be a funny memory to bring up with your SO later on in life and chuckle at, so not all is ruined.",
          "id": 14,
          "comments": [
            {
              "score": 10,
              "content": "Exactly.  Tarnish isn't a bad thing.  It's what makes experiences personal.  Your tarnish is what makes you you.\n\nIt's what makes people interesting.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Late question under a top comment, but this came up in my life recently too, don’t you think we put too much pressure on the wedding day to be the best day of our lives? ",
          "id": 16,
          "comments": [
            {
              "score": 22,
              "content": "I totally agree, but like I said earlier, compare to a sports competition. We all know that a competition is important to those who take part but unless you have worked for it your whole life, or dreamed about it your whole life you don't know how important it is, now just apply this to a persons wedding day, a day where they can finally start a family with the love of their life, a day they may have been planning since they were 6 or 7, thats why a lot of people find it so important and put so much pressure on it to be perfect",
              "id": 17,
              "comments": [
                {
                  "score": 14,
                  "content": "Oh I like that analogy. Especially from the guest standpoint, it’s important to view it that way. This is their event, not yours. They meticulously planned to not have kids there, you didn’t, please leave...",
                  "id": 18,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yh that's what i meant, sometimes an analogy is a really good way of helping people understand your point of view :)",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "[deleted]",
          "id": 20,
          "comments": [
            {
              "score": 11,
              "content": "Well it depends on the person. It may not seem important to you but it may do to them. For example winning a competition is really important to some people but others don't know why they take it so seriously, the same applies here ",
              "id": 21,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2171,
      "content": "NTA - If it was clearly stated that there was to be no children, then it is not your fault. I would have done the same and asked them to leave. ",
      "id": 22,
      "comments": [
        {
          "score": 131,
          "content": "agree NTA its your day so you decide. ",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "NTA. Only thing I would’ve done different is had the event planner approach them sooner (like before the ceremony)",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1515,
      "content": "NTA. You were clear and they ignored that. Then they had the gall to make a scene at YOUR wedding. Good riddance. They sound like complete assholes. ",
      "id": 25,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1144,
      "content": "NTA; you stated this is a child free event, they brought kids anyway, then were asked politely, they should have taken the cue, come said \"wonderful wedding, but we have to get these dudes home for bedtime!\" then left, but no they persisted. Causing drama at someone else's wedding is the ultimate douchebaggery. \n\nNot for you obviously, but for anyone else who is doing a no kids wedding: you have to know your guests. If you know them well enough to know that they'll make sitting arrangements, great. If you don't know them well enough, its always worthwhile to give them a little call, make sure they know this and maybe point to some sitting services your parent friends nearby you could recommend. \n\nBut no, as a parent there'd be no way in hell I'd bring my kids (when they were small, loud and drooly) to a no kids wedding. The closest I'd come would be a quick \"Hi, congratulations! My sitting arrangements didn't work out so I can't stay very long. Just wanted to say congrats!\"",
      "id": 26,
      "comments": [
        {
          "score": 225,
          "content": "Exactly.  I would add that for people traveling to your wedding from out of town, finding babysitting for children under age 5 in a random town may not be possible.  Many children that age aren’t going to be comfortable with strangers, especially in the evening.\n\nThat said, it’s on the parents to figure something out or politely RSVP that they can’t make it.",
          "id": 27,
          "comments": [
            {
              "score": 179,
              "content": "At my wedding, I provided a sitter (my 13 year old cousin) for the other kids coming from out of town (there were five of them, all related to her). We wanted the kids to come to dance but wanted a kid free dinner, so she watched a movie upstairs (we were married at an Inn) with the kids and they got take out. \n\nImportant to note that the children I arranged this for were my out of town family that I absolutely wanted at my wedding and couldn’t expect to have someone watch their kids for a weekend. All of our friends? No babysitting offered, they all figured it out. ",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "Yes! We were informed literally two days before a wedding of my husband’s college friend that we couldn’t bring our infant... nowhere in their literature did they state “no kids”, we also explicitly asked them a few months before and they said it was fine, it was just something they decided last minute. This wedding was a 6 hour drive from our home, we took work off, packed everything, etc etc.. \n\nSo, my husband went, and I stayed home with the baby. He had a nice dad trip at the hotel and got to let loose with college friends, but it’s shitty planning on the part of the couple to not consider guest needs. Get all of that out of the way in the beginning so you aren’t dealing with it weekend-of! Turns out that they assumed we would be getting a babysitter...um...only if you say it’s “no kids”!\n\nThis is why we eloped on the beach. No drama, no frills, best day ever!",
          "id": 29,
          "comments": [
            {
              "score": 28,
              "content": "It’s considered rude to put that on invitations. I don’t think it’s rude but you have to tell people because some people just don’t get it. ",
              "id": 30,
              "comments": [
                {
                  "score": 81,
                  "content": "I’ve had wedding invites and save the dates that say “we love kids, but this is an adults-only affair”. Easy and explicit without being rude.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I don’t consider it rude but many people would disagree with you. ",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I'm going to disagree on there needing to be stated exclusively \"no kids\" or \"adults only\". The invitation is addressed explicitly to those invited. If a kid (by name or \"And family\") isn't mentioned at all in the invitation then they are not invited. An invitation is not the format on which to list who is excluded.",
              "id": 33,
              "comments": [
                {
                  "score": 55,
                  "content": "[deleted]",
                  "id": 34,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I feel like I'm repeating myself a lot but it is considered rude to write on the invitation paper \"no kids\" or whatever phrasing that is meant to exclude them.\n\nThe No kids stuff belongs in an insert (like hotel/directions), or on the website, and can be spread through word of mouth. The RSVP card can specify how many seats your are reserving for the couple (2). Finally the envelope has the names of the couple. Of course, don't write something ambiguous like Smith Family if you only want to invite the adults because you will end up with the whole Family, write the couple's names.\n\nYes, it would be clearer to have that on the invitation card itself but it's just impolite to do it that way. ",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "I agree that the invitation saying only the adults names should be enough, but let’s be honest some people are just so dense and don’t get proper etiquette. If you really don’t want kids you’re going to need to write it on the invite because otherwise some people will take an invite to mean their whole family. Just write it a little nicer than “no kids”. I’ve seen people write it like “we love your kids, but this is an adult only event”. That way it appeases the parents who think they’re children are the greatest gift to the world.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I think in OP's case the couple understood and figured they could get away with it, which is rude to the other parents at the wedding who arranged for child care.\n\nI think those phrases have cropped up because of those people who need it to be written down that there are no kids at the event, otherwise the names on the envelope should suffice.\n\nI'm saying just don't put that on the invitation itself. It looks bad. Include that information on an insert (as you do with directions) or on the website or on the RSVP card or all of those places. I'm talking about paper invitations of course. ",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Can’t agree - To make it crystal clear, you address the invite to who you are inviting (“the smith family” is ambiguous, but “Jane and Patty Smith” is clear), AND you include a clause in your invite or save the date that says “we love kids, but this is an adults-only affair” or whatever way you want to phrase “no kids”. ",
                  "id": 38,
                  "comments": [
                    {
                      "score": 8,
                      "content": "It's considered bad etiquette to put a phrase like that on the invitation. It's ok on the other inserts, or wedding website, just not on the invitation.\n\nI find the situation you described completely unlike the OP's. You had a conversation with the couple well ahead of the event where they confirmed it was fine to bring your child. I'm assuming that was after invitations were sent out. The couple later reneged on including your child at the last minute. \n\nI'm speculating but if you had that initial conversation with the couple ahead of the invitations they are still allowed to change their minds. In which case the persons invited will have their names on the envelope. If your child's name wasn't there, or it wasn't written as \"family\" then they had only invited you as a couple. ",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Yes, this is what I did for our wedding. Our envelopes/invitations were addressed to the adults, and inside they specified that following the ceremony was an \"Adult Reception.\"",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I think people say ‘invitation’ when really they mean ‘envelope’. Whoever is invited to the wedding is on the envelope. It’s either ‘The Jones Family’ or ‘Tom and Martha Jones’. ",
                  "id": 41,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yes you're right. I do mean envelope. \n\nBut it is still considered bad etiquette to put \"no kids\" directly on the invitation. Maybe it's ok on an insert but otherwise it's usually best to put it on a wedding website and have your family and wedding party spread the word. RSVP cards with the wording \"We have reserved 2 seats in your honor\" helps get the message across too.\n\nRegarding your example, if I were sending an invitation to The Jones Family I would do that because I was including their children. Tom and Mary is just for those two people. ",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "I would NOT bring my kid to a kid-free wedding. She's just shy of two and loves to be loud and has picked up a bad habit of falling to the floor when she knows I need to pick her up to do something she doesn't want to do, followed by screaming and flailing. Aka, very disruptive.\n\nIf it's a kid-friendly wedding, then I'd still be embarrassed but at least I know it'd be more acceptable than what OP's guests did.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Hundred percent with the giving people you know who have kids heads up calls if you want a child free wedding. ",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 989,
      "content": "cautious familiar birds ghost chase existence grey seemly squash retire\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "id": 45,
      "comments": [
        {
          "score": 162,
          "content": "Ditto. My sister had a kid-free wedding because her husband's family does not control their kids. They would have been running in the aisle and screaming during half the ceremony.\n\nThis was also before I had my daughter, who I think my sister may have given exception to. But even if she hadn't, I would have asked my inlaws to watch my kid to be polite and respectful.",
          "id": 46,
          "comments": [
            {
              "score": 53,
              "content": "My parents have a VHS tape of their wedding, and the entire video you could barely hear anything because my cousins who were babies at the time were screeching and crying *the entire ceremony*. Of course, it wasn't a \"child free\" wedding, but my aunt should have taken them outside instead of letting them do that the entire ceremony.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Absolutely. Wife and I declined a handful of such events when kids were small. Explained in the rsvp the reason why. Sent a nice gift and were profusely thanked. Plenty of other events to take kids to. Nobody was offended. No drama. Happy time was had by all. Yeah...adulting is hard /s.  ",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yeah my cousins who are popping them out like an assembly line asked me specifically if their children were invited.",
          "id": 49,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 732,
      "content": "NTA. Unbelievably rude to you, and unfair to your other guests, that they would think the rules didn't apply to them. ",
      "id": 50,
      "comments": [
        {
          "score": 216,
          "content": "Yeah I was a little shocked since none of our other friends with kids made a big deal about it. ",
          "id": 51,
          "comments": [
            {
              "score": 67,
              "content": "That couple owes you a HUGE apology. Not following the rules then to fight with the bride at her wedding..... I have no idea why anyone would do that. They won't give you the apology because they sound like dicks but they really should. ",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Kicking these folks out made it fair for the other guests who didn't bring their kids.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": "This is the main reason I would have kicked them out, completely unfair to those who followed your request. ",
          "id": 54,
          "comments": [
            {
              "score": 32,
              "content": "Reception dinners are expensive AF. I’m planning my wedding now. At 50+ a plate, you should be allowed to decide who is permitted, ",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 503,
      "content": "NTA, but I definitely think your mom could have held her tongue rather than make you worry about what people might be saying. Also, it reflects poorly on that couple, not you, for not respecting your wishes. ",
      "id": 56,
      "comments": [
        {
          "score": 113,
          "content": "Absolutely 100% this.  There should be not one scintilla of a question in this bride's mind that she's the asshole.  One hopes the mom at least takes a step back from these 'family friends' for this stunt.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "That's what moms are for though.",
          "id": 58,
          "comments": [
            {
              "score": 5,
              "content": "This comment deserves more upvotes lol",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 478,
      "content": "they gambled with the “if we do x there’s no way they’ll have the guts to do z” card and lost...absolutely NOT TA!!",
      "id": 60,
      "comments": [
        {
          "score": 68,
          "content": "That is 100% what happened here. Half their reaction was probably due to shock that the bride actually did something about it. NTA at all.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 374,
      "content": "anyone who ruins anything by bringing their child is automatically the asshole, that should be a rule for the sub tbh",
      "id": 62,
      "comments": [
        {
          "score": 249,
          "content": "Same with uninvited animals. Too many people *assume* I'm okay with their dog coming into my home.",
          "id": 63,
          "comments": [
            {
              "score": 145,
              "content": "Yea it’s definitely not okay to bring my dog to anyone’s house who isn’t specifically dog sitting or something. In fact, it’s easier on me to leave him home alone or with a sitter than to bother someone else with him. \n\n\nHowever, one thing that does bug me is when people come to *my* house (sometimes not even invited), and when I let them in they’ll say “oh, you need to kick your dog out while I’m here. I don’t like being around a dog.” My dog is so lazy too, spending 80% of his time in his dog bed. Like, this is his home and not yours. If you can’t stand being in the same house as a little dachshund, just don’t come over anymore. ",
              "id": 64,
              "comments": [
                {
                  "score": 73,
                  "content": "Yeah, that would get the person kicked out in my house. The dog has way more right to be here than they do.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "I think allowances can be made for people with allergies who mention it ahead of time. A friend of mine is deathly allergic to cats, so he doesn't come over unless it's for a bigger party. We just visit him instead",
                  "id": 66,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I agree. Given that my whole life pretty much revolves around animals, anyone who knows me is tends to be well aware of what to expect, but in any event, I still have various antihistamines available to anyone who stops by.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Even though I'm allergic to dogs, I won't say anything to someone about their dog in their own house (even if it won't stop jumping on me), and I certainly wouldn't ask them to put it outside! The only exception would be once I have my newborn and the dog is getting rough, for my baby's safety, but I would ask if they could put it in another room, not outside!",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Dude, that even goes for my 100lb newfie mix. This is his home too and I'm not kicking him out for anyone. ",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "I’ve never understood this. I have a family member who has no dogs but whenever we visit she is adamant that we bring our dog. I am always so surprised because she’s not really a dog person and her house is spotless. I have told her that it’s easy for us to leave him at home/get a dog sitter but she still insists we bring him as he is ‘part of the family’ which is really sweet. I’ve never assumed anyone would want me to bring my dog in to their home, even ones who love/have dogs themselves. Bringing him actually stresses me out sometimes because while he is obedient, he doesn’t quite understand that different houses have different rules, so I’m constantly on edge making sure he isn’t trying to climb on sofas and beds etc. I just don’t understand why anyone would assume they can bring an animal into someone else’s home without prior permission. ",
              "id": 70,
              "comments": [
                {
                  "score": 17,
                  "content": "At my in laws house they want our cat to come over... They love our cat. It's horrible for me though because they make him stay in the kitchen and my cat likes to be with people or he will meow liks crazy. So like for example if everyone is watching a movie I have to sit in the kitchen.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I would lose my shit. I’m not a dog person and the shock could literally give my babies (rabbits) a heart attack. People need to realize their fur babies and crotch fruit aren’t always welcome in *private* situations. \n\nIn public go hog! Children belong in public that’s how they learn to be good humans in society. Everyone was a kid once, they need to learn to tolerate kids in public places. And dogs are lovely in a lot of public places as long as it’s not a health matter. \n\nBut you can’t just assume people are cool with *your* little ones *in /their/ home* ",
              "id": 72,
              "comments": [
                {
                  "score": 5,
                  "content": "If I could give you gold I would, because that's exactly my thoughts. Thank you! ",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Agreed. I have a coworker that gets personally offended when she can't bring her dog to events, parties, or even over a dude's house that she very, very recently started seeing. It's not a little dog, either; it's a young, hyperactive golden retriever. Dogs are family, and I get that it might be hard to find someone to take care of it, but she \\*never\\* has an issue finding a dog sitter. She has even mentioned once or twice she wants to register her dog as an emotional support animal so she can bring him on trips and into places he normally wouldn't be allowed, not because she needs the support. ",
              "id": 74,
              "comments": [
                {
                  "score": 19,
                  "content": "Joke's on her then.  Emotional Support Animals are NOT allowed everywhere she goes.  Places such as retail establishments, restaurants, places of business and others that normaly don't allow animals except for service animals can deny her \"Emotional Support\" animal as well.  ONLY Service Animals that are trained to provide a needed service/function for their handlers are allowed in all establishments and service sectors that thier handler can go.  ",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I agree about the animals. We don't have kids, but we have a dog and 2 cats. I love them all, but would never think to just bring my dog to something that I was invited to. He's very small, and well-behaved, but I know not everyone wants dogs around, and besides, I'd rather not have to worry about him stealing food or having an accident or whatever. On very rare occasions I've had people specifically say that I'm welcome to bring him, and sometimes I do. But otherwise, no.",
              "id": 76,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly. You're one of the good owners and I thank you!!! ",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Especially if you say something and they come back with 'oh it's okay, he's an ESA' like that doesn't make it okay, what if I was allergic? Ask beforehand, always.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah, neighbour has this issue with her brother and his little rat dog.  She is meticulous in her housekeeping, and keeps up on her little dog's flea treatment.  Meanwhile, his is riddled with fleas, he does nothing to treat them, the dog is uncontrolled, undisciplined, and steals her dog's food, even fighting him over it.  She tells him, and tells him, and tells him.  He expects HER to pay for the flea treatments for HIS dog \"if you don't want fleas in the house\".  No, just leave your damn dog at HOME! (next door).",
              "id": 79,
              "comments": [
                {
                  "score": 5,
                  "content": "She can call animal control for negligence of an animal. That's just horrid. ",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "HELL YES!",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Ugh tell me about it!!!!! No, I don't want your 50 pound lab on my new couch....",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 352,
      "content": "NTA.\n\nYou said it in your invitation. It shouldn't be difficult for people. They don't get to decide what happens on your wedding day.\n\nIt also sounds like you have some gossipy ass family and friends if that was the talk around your wedding, rather than you guys getting married. \n\nYou're not the asshole for making them leave, or for not wanting kids there. You didn't do anything wrong at all. They were disrespectful, entitled assholes. \"We can take care of our kids.\" Well, bitch, obviously fucking not. \n\nThey clearly didn't give a shit about your request. So fuck them. Don't even feel bad about asking or even telling them to leave from an event they showed up to breaking the rules for lack of better terms. ",
      "id": 83,
      "comments": [
        {
          "score": 174,
          "content": "> It also sounds like you have some gossipy ass family and friends if that was the talk around your wedding, rather than you guys getting married.\n\nTo be fair, if this happened at a friend or family’s wedding I might discuss it, but it would definitely be along the lines of “the nerve of some people” and assuring the bride she did 100% the right thing.",
          "id": 84,
          "comments": [
            {
              "score": 39,
              "content": "Yeah... if I knew the people I'd be wondering what the hell is wrong with them. I am always amazed that some people don't understand that rules apply to them.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "[deleted]",
          "id": 86,
          "comments": [
            {
              "score": 38,
              "content": "Excellent point I hadn't considered. She was not only honoring herself, but her other guests as well, by kicking the couple out. They all made sacrifices, so it's good to establish that they are appreciated for doing so by not letting someone else get away with it.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> I really hate that my wedding day had to be somewhat marred by this incident. According to my mother, everyone was talking about it and I guess enjoying a little dramatic entertainment.\n\nThis just doesn't sound to me like they were discussing how rude those people were for bringing their kids. I could definitely be wrong but it sounded more like everyone was talking about the \"drama\" which caused OP to feel like her day wasn't as nice as it should have been. ",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}