{
  "post content": "So let’s rewind the tape to last week...\n\nMy wife gets a phone call from her aunt, who asks us to attend my wife’s grandma’s surprise birthday party in a couple of months.  Except they live over a 10 hour drive away, and the party is on a Friday night, so we would both need to take off work that day to make it.  My wife immediately wants to go and asks me if she thinks I could get off work.  I told her that I reckon I could, and so she tells her aunt to pencil us in.\n\nFast forward to today, and I open an invitation for my cousin’s wedding for the same weekend...  a wedding that my wife and I were both looking forward to attending (we have three young kids, weddings are great date nights!).  She mentions that it’s too bad we can’t go since we’re already going to her grandma’s.\n\nAt this point, I fully realize the logistical nightmare that this birthday party is going to be...  missing work, the cost of gas, having to have my two oldest miss school, never mind traveling 10+ hours in the car with 3 young kids... all for people that I’ve met twice in 8 years of being with my wife.  And then the regret hits me that I would be missing out on this beautiful evening in a picturesque venue with all of my family and quite a few of my friends.\n\nBut before I go too far down the rabbit hole of grandma-in-law dodging, I come up with a compromise - the party is Friday night, the wedding is Saturday night...  why not leave early Saturday so we can make it to the wedding?  I told my wife she could even stay home if she was too tired, and that either my mom or her mom would probably come help her with the kids so I could still go to the wedding with my dad (divorced parents).\n\nAlas, no dice.  She said it would be too grueling on the children to do all that traveling so close together and that we need a recuperation day in her grandma’s town.  I agree with her, but I think it’s going to be grueling regardless.  That moves our 10 hour drive to Sunday, and then that puts us back to work and the kids back to school with hardly any time to rejuvenate(it’s almost imperative I have a day off between traveling and work to get resettled!).\n\nSo now we’ve flown pass the discussion phase and straight into the arguing phase.  She accuses me of prioritizing my family over hers - and I agree with her.  Then I try to remind her as softly as possible of all the times that she told me she didn’t care if we saw her family at the holidays and that she’d rather see my side of the family.  At this point, she caves, and says we should go to the wedding instead.  If you’re married though, you’ll know this wasn’t a real cave.  It was where I was supposed to relent and agree to go Grandma’s birthday...  except I didn’t.  And she went to bed angry.\n\nSo...  reddit, AITA here?",
  "id": 1,
  "comments": [
    {
      "score": 79,
      "content": "NAH. Everyone wants to do their family’s thing .  But if it comes down to 20 hours in a car with 3 children (AKA Hell on Earth) vs Stay at home and go to a nice wedding, I’m on your side .\n\nCompromise:  any way to fly her to the grandma and you stay home and do the wedding ?",
      "id": 2,
      "comments": [
        {
          "score": 23,
          "content": "Showing up to Grandma’s without babies is as dangerous as me suggesting she travels alone with three children!  Haha",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "NTA I would not miss my cousin’s wedding for a birthday. You can celebrate her grandma’s birthday another day, your cousin’s wedding is once in a lifetime (hopefully). I understand that she wants to see her family, but she didn’t even ask what you wanted to do.",
      "id": 4,
      "comments": [
        {
          "score": 6,
          "content": "Really? It depends on how old Grandma is. She’s the grandmother of an adult woman with children,  how many more birthdays do you think she'll have? Maybe I’m sensitive because I just lost my grandma in December, and I would give anything to visit her for her birthday again, but I don’t see the wife as TA.",
          "id": 5,
          "comments": [
            {
              "score": 3,
              "content": "I thought about that too- I just lost my grandpa and my grandma is turning 90 this year. I think the wife should have at least asked other than saying “oh well!” and making OP feel bad. That is the wrong response that makes her an AH to me.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "I have to agree with this I think most of the NTA are likely kids or people without eldely grandparents.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 38,
      "content": "NTA if you figure out a win win scenario.\n\nFor example, attend the wedding. The next week, driver to grandma to celebrate her birth month!!! Every one wins.",
      "id": 8,
      "comments": [
        {
          "score": 20,
          "content": "The wife clearly wants to see her family at the party so this is not a win win scenario.",
          "id": 9,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Hows that work when everyone is there for a party the previous week.\n\nImo Grandparents are more important than cousins.",
          "id": 10,
          "comments": [
            {
              "score": 9,
              "content": "In my opinion, first weddings are more important than birthdays.",
              "id": 11,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "Nta. Funeral > Wedding > baby shower > birthday party.",
      "id": 12,
      "comments": [
        {
          "score": 7,
          "content": "I would put baby shower at the bottom, but other than that I agree. (I adore babies,but as a Brit I don't really do showers)",
          "id": 13,
          "comments": [
            {
              "score": 2,
              "content": "I love babies. Baby showers are excruciating to me, especially when they do the cheesy games.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "NAH....can't blame your wife for being upset but you had the logical reasoning of not traveling for grandma's party and you also have her a compromise albeit would have been he'll. I do think you should offer to go visit her family at another time when you both have the time to travel and the time to recoup before heading back to work.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "INFO: if you had been looking forward to the wedding, why did you not know the date overlapped with the grandmas bday when you got that invite? Was the wedding date TBD?",
      "id": 16,
      "comments": [
        {
          "score": 6,
          "content": "Eh, honestly, it was more or less a brain fart.  We had talked about the wedding with my cousin very briefly and told her that we were looking forward to coming.  If she had told us the day, I definitely hadn’t saved it...  my wife and I both work during the days Monday to Friday, so an upcoming wedding seemed feasible with little to no planning.  Knew it was coming, just not exactly when.  Hence my “oh shit!” reaction when I realized the conflict.",
          "id": 17,
          "comments": [
            {
              "score": 7,
              "content": "I’m going with a very close-call NTA. There are so many considerations here, but at the end of the day you are at least trying to find a situation that works for everyone.\n\nYou both messed up by not marking down the wedding date if you were advised of it to at least a ball-park estimation. \n\nNormally, I’d say you are obligated to whatever invite you commit to first, but that’s counter-balanced by a once-in-a-lifetime (hopefully) wedding trumping a birthday... which is then weighed against the fact that the birthday is for a grandma (who I assume is elderly), and it seems to be a pretty big family event. \n\nBut, you indicated that you are at least trying to make it work. Sounds like your wife didn’t come up with an alternate plan- just disagreed with yours. For me, your willingness and attempt to find a compromise tips the scale from E. S. H. to NTA.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "NTA. It is understandable that you would rather go to your cousin's wedding rather than a birthday party for your grandmother in law. Especially if you have to drive 10 hours to get to the party and do all of that driving yourself. Maybe give grandma a call during the party and wish her a happy birthday and give her your regrets, but a (hopefully) once in a lifetime wedding ceremony for your cousin should come before a birthday party. I think that grandma will understand you missing her party for a wedding more than your cousin will understand you missing her wedding for a birthday party. Your wife needs to be understanding as well. Good luck and stick to your guns!",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. \n\nModern problems require modern solutions:\n\nAsk your boss on the down low to require you to work on Friday therefore you'll have to miss the party.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "INFO - who's driving the ten hour drive?",
      "id": 21,
      "comments": [
        {
          "score": 8,
          "content": "I’ll more than likely do all of it.  I usually do.",
          "id": 22,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH But weddings are supposed to be a one time thing and birthdays are every year so personally I think the wedding takes priority. 🤷🏻‍♀️",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}