{
  "post content": "Hello all,\n\nPreface: My boyfriend and I will be moving into a nice Riverfront townhome with a Riverfront park we are so happy about. We've been scouting this neighborhood for years and finally found a sale that was worth the price!\n\nFor about 4 years now, my sister has been living with my boyfriend and I. She doesn't have a job that makes enough money to fund everything she wants in life. So my boyfriend and I helped her out by having her stay with us at various places we've rented those past years and saved her tens of thousands. Now that we actually own a place, I told her she can stay. But I gave her some rules below as since we finally OWN a place, we want her to treat the place with a basic respect. \n\n1.) Her cat must have her claws capped at all times. Her cat isn't declawed understandably, and has already put small holes in some of mine and my boyfriends clothes, our nice mattress, and some furniture. \n\nEdit: I didn't know caps were cruel as well. My sister will just have to clip nails regularly as well as be accepting to assume full professional repair or replacement of all clothing, furniture, carpet, rugs, etc when damaged. My sister already has scratching posts she sprays with a cat nip spray. So all the midigation suggestions have been done. She'll just have to eat all costs, which will be expensive. \n\n2.) She will have to pay rent of $400/mo. She was upset because I told her she could live rent free years ago if we ever bought a place. But I want her to be helping out too now. I can understand her being upset, but this is a tiny amount to pay in a nice house in a nice neighborhood in a walkable community by the river. \n\nEdit for clarity: A one bedroom one bath at an apartment complex two blocks down is almost $2k/mo for lease on the cheapest unit. \n\n3.) No more pets. She has a dog and cat already. She's upset because she wants more cats and dogs and even more upset that I'm not letting her adopt more when my SO and I will be adopting our first and only dog. Or plan to in the future when we're settled. \n\n4.) Any dishes she dirtiest must be cleaned immediately after eating or put in the dishwasher immediately. She would pile dishes in the sink all the time. But we want a spotless sink now. My SO and I always cleaned our dishes right after eating and want her to do the same. This goes for her stopping leaving boxes and stuff on countertops. \n\nEdit: I do agree that this should be changed to maybe any dirty dishes made are cleaned by end of day. Not caring about the rare dish left overnight, but more setting the idea that one has to cleanup after themself. \n\n5.) Her room would have to be at least mildly clean. She'd always throw clothes and stuff on the ground and even her closet floor had 100% coverage of clothes. That wouldn't fly anymore and she'd have to be at least somewhat clean. I'm not asking for perfect but at least show respect to the place. \n\nEdit: This is the most brought up one and I get why people do. And again, I'm not asking for spotless. Just not asking for someone to live in a situation to justify a breeding ground for pests. I'm not asking for spotless, again, but you should clean up after yourself and not make a mess. That's a reasonable basic decency bare minimum expectation of any adult. And my sister is 26. \n\n6.) More rules can come up because we've never owned a place and some other thing could be thought of. \n\nEdit: I agree this rule is unfair and I should have an agreement written up in-full prior. \n\nShe was upset with every single point and thinks I'm being way too controlling. I genuinely don't feel that way. Especially because her staying here for super cheap is a courtesy, and I feel she's acting like it's an entitlement. \n\nAITA for setting these rules? Are they unreasonable?",
  "id": 1,
  "comments": [
    {
      "score": 2666,
      "content": "1)  Seems reasonable\n\n2)  A reasonable rate, though if you did promise her that she could stay rent-free, I could see her being upset with that.  \n\n3)  Super reasonable.\n\n4)  Super reasonable\n\n5)  I'd say this is a bit unreasonable.  If you're going to make her pay rent, then you should give her reasonably free reign over her room.  I'm not saying you should allow her to store dirty dishes in there or anything that would attract insects, but if it's just clothes on the floor, let it go.\n\n6)  Don't make stuff up on the fly.  Come up with a lease.  Especially if you're going to be making her pay rent.",
      "id": 2,
      "comments": [
        {
          "score": 929,
          "content": "5) Close the door. Even if it's your house she is entitled to her own space as long as it's not bringing in bugs etc. \n\nAs for 6) be reasonable. If something comes up as an issue discuss it don't just throw out arbitrary rules in the future. \n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 14,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": -4,
                  "content": "Why would you just up and kick out your sibling? Is that how you manage conflict in your relationships? Just immediately escalate to banishment? Does that work out well for you.\n\nShould little sis understand that she isn't entitled to live with her sibling without reasonable expectations? Of course, she should, and sibling is wholly in the right to insist on little sis respecting their house rules. A formal lease would be important, too. And big sibling should respect little sis' privacy as far as her room goes, as long as it's not a hazard. If little sis doesn't want to abide, and cant see the generous opportunity she has, then of course she should find somewhere else to live, but some people truly do want to work things out in a fair way.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": -3,
              "content": "[removed]",
              "id": 6,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "The rent-free part\n\nSister sounds like the kind who'd take that as an invitation to live with them forever.",
          "id": 7,
          "comments": [
            {
              "score": 165,
              "content": "She did",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Plus she should offer to help out if she's working. Even if they don't ask for rent. Unless she's living with someone wealthy.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "Yeah about 5 and clothes on floor and such, where I live that can just become a breeding nest for spiders very quickly so that’s a big no no for me",
          "id": 10,
          "comments": [
            {
              "score": 70,
              "content": "[deleted]",
              "id": 11,
              "comments": [
                {
                  "score": 48,
                  "content": "I live in a basement in Virginia and I have to be super careful about making spider nests on my floor. Every few weeks during the summer I take EVERYTHING that isn't furniture out and do a deep carpet clean.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Oooh, I briefly lived in Virginia and definitely got trapped in a room because some mammoth black spider was chilling in the doorway more than once. Got kind of decent at discus-ing law books to kill them.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Thats terrifying",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Australia?",
                  "id": 15,
                  "comments": [
                    {
                      "score": 18,
                      "content": "You more have to be concerned with shoes than clothes where I am in aus.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Everyone thinks Maine is beautiful and apparently had no idea that 80% of is **FILLED** with a billion tiny spiders.   Everywhere all the time.  Once you notice them you’ll see them everywhere",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 125,
          "content": "If it makes the sister feel better they could call the $400 a utility payment. There is additional costs to having the sister livd there, and they shouldn't have to be the ones paying it.",
          "id": 18,
          "comments": [
            {
              "score": -35,
              "content": "I'd even put it in a savings for her so she can get her own place one day.",
              "id": 19,
              "comments": [
                {
                  "score": 38,
                  "content": "Nope. She’s her sister, not her child.",
                  "id": 20,
                  "comments": [
                    {
                      "score": -9,
                      "content": "That's funny as hell to me. I was just thinking she isn't trying to make money off her sister so much as she's trying to help her be responsible?",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "That's absurd! Letting someone live in your home for free costs money. It's ridiculous to suggest that OP just live with this financial burden and be financially responsible for someone who isn't her child. If sister wants her own place, she can get a job like the rest of us.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 1,
                      "content": "NTA",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Your sister makes $50K a year and is balking at $400 a month and keeping her space and common areas tidy. I'm not sure where you are located, but I expect she could afford to rent elsewhere if these are dealbreakers for her. NTA",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "[deleted]",
          "id": 25,
          "comments": [
            {
              "score": 257,
              "content": "I don't expect spotless and I think I did articulate that in the post. She, however, has her clean and dirty clothes lying everywhere. And I am being serious her current closet has 100% floor coverage in clothes. We live in an area of brown recluse who love spots like that. And behavior like that I feel is just genuinely disrespectful to the place you're living.\n\nNot asking for spotless but I'm asking to be respectful and have some cleanliness",
              "id": 26,
              "comments": [
                {
                  "score": 200,
                  "content": "OHHHHHHH I would add this context detail to your main post, because it is genuinely a health and safety issue and not a mismatched-tidiness-standards issue.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "Oh helllll no. My area is very wolf spider heavy and we learned FAST that this is not a home in which we could leave our clothes on the floor. I'm deathly afraid of spiders so I may be a little biased, but I think that's a good rule.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Nononononononono how do you survive? Nonononono",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "If you can't leave clothes on the floor without spiders making a home, I would definitely sign up for regular exterminator service. You can tell her part of her rent goes to eliminating the spiders.\n\nBut if she's paying rent, she should be able to have freedom to have her room how she feels comfortable.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 68,
                      "content": ">But if she's paying rent, she should be able to have freedom to have her room how she feels comfortable.\n\nYeah, I guess this would be a deal breaker then. And even the problem with her covering extermination services is if her lifestyle lead to that in the first place. If it did lead to brown recluse, we should not have to worry about that massive health concern let alone anything else that would feel invited from that lifestyle. Even if we disregard all that. It's just insanely disrespectful to anyone's place to live like that.\n\nSo I'd agree if she couldn't accept that then she wouldn't allowed to live with us as it's basic decency.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Nothing wrong in expecting a certain level of cleanliness. It also instills a sense of discipline and routine, something young ppl lack a lot nowadays",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "While I agree with all of your other rules, this one is still unreasonable if you're asking her to pay rent.  The brown recluse argument is weak argument that feels like an after-thought to avoid the real issue, which is just that you find it annoying.  You can make any rule you want for someone living with you, but that doesn't mean it's suddenly a reasonable rule.  \n\nAt the end of the day, clothing on the floor (yes, even if the closet floor is completely covered and three-layers deep) isn't going to cause long-term or even short-term damage.  It's your opinion (that I share, mind you) that elaving clothes all over is disrespectful to the space, but not everyone else shares that opinion",
                  "id": 33,
                  "comments": [
                    {
                      "score": 28,
                      "content": "No clothes piled in the floor can also be a place for mice and other household pests to nest that absolutely do long term damage. It’s not unreasonable to expect someone to be clean in YOUR house that they live in",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Other people in this thread don't understand how brown recluses are different from other spiders. They don't hang out in just their area, they go out hunting. Black widows are chill in comparison.\n\nYou know she leaves clothing on the floor. You know this will make comfortable spider habitat. I don't see this working.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Why do you think she will change?",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "NTA by the way. You are asking for basic cleanliness and respect for your place. I don’t think the sister has any respect for you guys nor will she abide by your requests for living in the new place. Do yourselves a favor and get her to move into a rental place of her own. You have helped her out enough. If 4 years of living with you guys hasn’t helped her to save up, it’s not your fault or problem. Distance does save relationships, closeness only destroys them",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I agree with all your rules except that one. Stay out of her room and the clothes on the floor won’t bother you. Clothing is not going to damage the floor. \n\nOh and don’t make up new rules on the fly. Everything you require should be in writing and she should sign it like a regular lease. If a new rule becomes necessary, you need to talk to her about it and put that amendment in writing.\n\nHonestly though, it sounds like cohabiting with her is no longer working for you. She should find other arrangements.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Why  are you allowing her to live with you at all? She sounds like a real pain. If she  doesn't want to respect you and your boyfriend, she can share with other people. You have been very accommodating and kind. I'm especially horrified about her wanting to impose a load of pets on you. Seriously, if any of this is a problem for her, tell her to find her own place.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 40,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That's my terms of having respect for the place she's staying. She doesn't have to live here, and she's already getting an insanely privileged option as well. My place that I own is my business.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Didn't op literally say that it doesn't have to be spotless, just reasonably clean?",
              "id": 42,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "\\#1 I feel clipping could be acceptable, but capped/clipped or not, she should also be providing scratchy toys/towers for the cat to reduce clawing.\n\n\\#5 is why landlords require a security deposit and use cheap carpet.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I would change 1 to capped or clipped. Declawed is illegal in a lot of places because it is cruel. It is cutting off the digit at the first nuckle. The cap are silicone pieces that are super glued on. Getting them on can be impossible. Keeping them on can be even worse. Basically, think of trying to put and keep acrylic nails on a cat. Regular clipping should have the same results as capping.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "~~free reign~~ free rein\n\nThe phrase refers to horse tack, not the monarchy.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "1) those caps can come off and be choking hazards. Maybe regular clippings instead? Otherwise I agree with this guy",
          "id": 46,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 766,
      "content": "NTA. Overall, I think your rules are incredibly reasonable and fair. My only qualm is the rule that her room needs to be clean. It's her private space and she should have control over it (otherwise, it pushes the relationship into more of a parent/child relationship, rather than roommates, imo).   \n\n\nThat being said, do you really want to have her as a roommate? It seems like you are at the point where you and your partner have a particular lifestyle in mind, and she doesn't appear to want said lifestyle. You've done an incredible thing for her, something she doesn't quite understand or appreciate from what you've written. Perhaps it's time for her to leave the nest so that you and your boyfriend can have the space/lifestyle you want.",
      "id": 47,
      "comments": [
        {
          "score": 126,
          "content": "Agreed. I'd say as long as nothing is growing in her room, just tell her to shut the door and you don't have to see the clutter. But even if she was renting a place all by herself, the landlord would require rent to be paid, and could make rules about how many pets she could have, etc. so I don't know why she finds this so ridiculous--except she's spoiled.",
          "id": 48,
          "comments": [
            {
              "score": 26,
              "content": "Oooh, good point about growing things, lol. In many ways, these rules will just prepare her for renting, period, so the shock isn't as bad when she moves out. Given that she seems so spoiled though, I'd WANT those rules and have her sign a contract so you have a clear paper trail in case she ends up becoming a menace and you need to evict her.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "My sister used clothes and blankets on the floor to disguise dirty dishes and half eaten take away food. When my husband finally reached breaking point and told me she had to go for the sake of his sanity, her room was so utterly revolting that we seriously considered getting a biohazard cleaning company in to deal with it. We had to replace the floor in that bedroom because the finish on it was ruined and we couldn't get the smell out of the wood to have it refinished.\n\nI wish we'd never let her move in. She'd been living with me at my previous place for ten years, I knew how slovenly she was, but I thought my husband putting his foot down and having a list of rules for her when we moved in with him would do the trick. I was so wrong. To make matters worse, she was slowly driving him out of his mind by never cleaning up after herself and being arsey when confronted about it. He didn't say a word to me about how he was feeling for months, because he didn't want to come across as giving me an ultimatum to choose between him and my sister.",
          "id": 50,
          "comments": [
            {
              "score": 23,
              "content": "I'm so sorry your sister did that. That sounds incredibly difficult (and honestly, just so, so disgusting) and I think all the more reason for OOP to truly consider keeping her sister from moving in, given that OOP's sister has shown zero desire to follow the rules.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My niece was the same way when she lived with me and when she lived with my brother.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "If you are living with someone and contributing nothing than you at a dependent, not a roommate.",
          "id": 53,
          "comments": [
            {
              "score": 2,
              "content": "Absolutely! I definitely can see that, but I don't think that quite applies to what I'm talking about above. In other words, I would argue that being a dependent is NOT the same as establishing a parent/child relationship. For example, if someone is disabled and can't work, they are dependent on their partner, but does that mean that their partner has a parental relationship to them? I'd hope not, as that would suggest a really troubling power dynamic between the two. And in this case, does she WANT to continue to parent? Forcing someone to have ZERO privacy takes on more of the power/dynamic between an adult and child.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 307,
      "content": "NTA. Those shouldn’t be rules, those should be normal expectations for a roommate. Don’t let her move in with you bc she is not going to change.",
      "id": 55,
      "comments": [
        {
          "score": 71,
          "content": "This. She's been doing this for years. Whatever she may promise to be able to move with you, I would actually lay money that it won't be long (months at best) before she's absolutely doing again what she's currently doing. \n\nShe is so not in an adult frame of mind that she doesn't realise what you are doing for her is a *massive* favour so is pushing against the (mostly) reasonable rules you laid out. You have become her defacto parents and why should she grow up when you'll pay for her home & put up with her antisocial habits? That's what you've been doing to date. This is too late to get her into an adult roommate state of mind when you have been not been acting as roommates for a number of years. I see in a later comment that sister is 26 and making a salary of 50K!\n\nTime to make her stretch her wings and learn to tailor her wants to her budget after she has met essentials. She seems to think you owe her a 'lifestyle' and one that she chooses at that.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She's not a roommate though--she's a dependent or at the very least a tenant.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 299,
      "content": "NTA. Honestly just ask her to find her own place 🤷🏽‍♀️ this is shit you’ll be fighting over all the time. Not worth it. You and your SO deserve your own space, without anyone disrespecting it, you are not her mom",
      "id": 58,
      "comments": [
        {
          "score": 73,
          "content": "Yup. This is 100% not going to work out and the drama is going to make you miserable. \n\nAnd frankly, you’re not doing her any favors by letting her live with you. You’re actually preventing her from learning to live on your own. I’m shocked your SO has gone along with this. \n\nNTA. But YWBTA if you continued to allow her to mooch off you.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Yeah, time to cut the apron strings.\n\nI'm guessing the little sister is at the very least early to mid 20s and her only experience with living out of home has been living with the big sister and doing all these annoying little sins of cohabitation (leaving dirty dishes in the sink, too many pets etc.)? And if so, then she hasn't acquired the perspective to realise how good she's had it and how reasonable OP is actually being by still making space for her in this new home.\n\nIf the sister had to deal with actual roommates who aren't family, she would probably have a heart attack. \n\nOP, you're gearing up for your next life stage - you should be helping your sister likewise adjust to a life where you're not there to hold her hand. Give her a three strikes system because I guarantee she will start testing the boundaries of your new rules so she can slowly pot boil you back into letting her live unabated by the lifestyle changes you want of her.\n\nLike, you need to be prepared now for your reaction when she brings home a kitten \"that had nowhere else to go\" or her being chronically late on rent.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Absolutely. OP has been parenting her sister for years. It’s time for sis to move out on her own. \n\nShe can’t afford everything she wants?  No one can. She makes $50k a year and has spent years not paying any rent.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Seriously, not only has she been paying no rent there has been no rules. Her pushing back for even having some basic rules makes no sense, no functioning parent would even have their household run like this and she feels like she's allowed to argue with you about it??",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Yup. I think this would be the best long term move to keep a relationship with the sister, though I’m sure it won’t be popular to start with. \n\nSometimes you just aren’t compatible with a housemate any more and it’s time to move on, and I think that’s the crux of the matter here.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 90,
      "content": "NTA for setting boundaries.  I do think the rules about her private room are a bit much if she's paying rent.",
      "id": 64,
      "comments": [
        {
          "score": 34,
          "content": "Overly messy rooms can and will lead to odor and bugs.  I lived in a triplex and the woman next door kept a very, very nasty house and as a result, MY nearly spotless house would get overrun with roaches.",
          "id": 65,
          "comments": [
            {
              "score": 11,
              "content": "There are a lot of normal people in this world who are just trying to avoid the situation you described and there are a lot of shitty control freaks and honestly we don’t know which one OP is. However, I generally favor renter rights, especially to privacy.",
              "id": 66,
              "comments": [
                {
                  "score": 1,
                  "content": "She can get all that when she rents her own place.",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "OP mentions in a comment they live in brown recluse territory and keeping the floor clean is a defense against that. About as good a reason for it as you can have, IMO.",
          "id": 68,
          "comments": [
            {
              "score": 5,
              "content": "Hadn't seen that.  Thanks!  That makes sense.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "NTA.  However, if you care about your sister, you must stand firm.  $400 is incredibly low rent.  I think your boyfriend is pretty damned tolerant to continue to accommodate a freeloader.",
      "id": 70,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 44,
      "content": "How old is she, why is she still living with you?",
      "id": 71,
      "comments": [
        {
          "score": 85,
          "content": "26yo and the idea was helping her out until she finally finds a place she can afford. My SO and I have 6 figure jobs and were helping her as rent was already high but jumped due to the pandemic. But from the comments, it sounds like us helping her has enabled some negative behaviors.",
          "id": 72,
          "comments": [
            {
              "score": 62,
              "content": "ESH. You enabled her lifestyle. Her reaction to your rules makes sense. She’s not gonna learn how to fly if she doesn’t get pushed out of the nest. \n\n\nThis is your house that you own, so you’re allowed to make whatever rules you want. $400 a month is pretty damn reasonable, with what you described. This seems like a perfect stepping stone for her into independent adulting, *which should be her ultimate goal,* right? \n\nPerhaps she needs to be reminded that living with you IS NOT going to be a lifelong commitment. Because I think at this point, she has zero timeline or budget for “getting on her feet.” It’s not occurred to her to make one. Her low-rent / high quality life was indefinite. So these rules are probably jarring to her.",
              "id": 73,
              "comments": [
                {
                  "score": 45,
                  "content": "Ohhh I should have articulated better. She hasn't been living rent free. She's just been paying a portion of rent proportional to total income of the household. Which is still $375/mo as she makes around $50k/yr and my SO and I each make six figures. My point above is her staying with us has saved her tens of thousands compared to her living on her own in a place.\n\nBut I can see how us not stamping down rules enabled behavior. Thank you for your comment.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 103,
                      "content": "***Her income is 50k a year??!!!***\n\nYou have been doing her a huge disservice. There’s no way she shouldn’t be living all on her own by now. She should have been living her best, independent, autonomous life for at least a couple years now. \n\nWow. I wish more people had a sibling like you lolol",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I make around $15k less than your sister and pay $600/month towards rent (live with family and split the bills). She's taking advantage of you.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "I lived with my sister and I was making around that amount and she was making six figures. But she was making low six figures, had a $3,000 mortgage, a daughter in an Ivy League college that she had to help and her own student loans. I also made decent money bartending part-time so when mine has tight my niece's freshman year (she got land after that), I volunteered to bump my rent form $500 to $700 and to take over the cable bill. We both bought groceries and if I bought food when I was out, I always brought her something home. My niece too when she was home. Injustice can't imagine not contributing somewhere when I'm working.",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "She makes 50k. She can afford to move out.",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Yes, agree. It seems like she decided “great, free living forever. I’ll fill the house with pets. Maybe never get a job again. Woohoo!”",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Why will she ever bother to become an independent adult if she can whinge and manipulate you into letting her continue being a gross teenager. Cus that’s what she is right now. Not even a normal one, she’s gross if these rules are too much for her. Stop treating her like she needs help and let her learn what life really is.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 37,
      "content": "Your house, your rules.\n\nShe doesn't like it, she gets her own place. She's treating you guys like you're her parents, and is in turn acting like a spoiled child.\n\nShe's very entitled. \n\nNTA",
      "id": 81,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "NTA. Frankly I think you're being extremely generous as it is. You didn't say she couldn't afford to live on her own but that she couldn't have the things she wants. Big difference. If she's not willing to show respect then she'll have to give up some of her \"wants\" and live on her own. The hard part for you is going to be are you willing to evict her if she doesn't follow the rules? If not, there's not much point in having the rules because otherwise the only thing that would happen would be arguments and nothing will change.",
      "id": 82,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA\nRe Rule 1:\nGet a few scratching posts for the cat! If the cat is scratching on that many different things of yours it clearly needs to exercise it's natural urge to scratch. There's carpet, cardboard, and sisal rope types, as well as free standing and flat ones, and all sorts of different cute designs. Getting the cat some different ones will give them variety and you can find out what they like the best. Redirect any scratching to the posts or boxes, don't yell or spray the cat, and they will figure it out. You can also spray scratching posts with catnip.",
      "id": 83,
      "comments": [
        {
          "score": 12,
          "content": "I do agree with this. But her cat does have these. Sadly, damage has still happened. I figure nail caps are much better that handing my sister a multi thousand dollar bill she can't afford. Or we just won't be able to decorate our place how we want, which isn't fair to us.",
          "id": 84,
          "comments": [
            {
              "score": 25,
              "content": "I hear the caps aren't great, you'd be better off insisting that she get her cat's nails trimmed (or trims them herself) regularly. But honestly I just wouldn't let her move in at all, there *will* be strife and getting her out once she's in will be a nightmare. What do you do when she just doesn't obey the rules?",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I know some scratching posts may not go with the decore, and you might want it to all stay in her room. Cats want to scratch all over their territory though, and if there aren't places they're allowed to scratch, they will scratch what's available. I would have a look at some nice options that will fit your decore(there's really fancy ones now) and find more the cat will use. If the cat can't scratch as marking, it may escalate to peeing and you really don't want that. And caps fall off. It's easier to redirect the scratching in the long run.\nI had issues with my cat and a roommate, there was more factors, but it forced me to move out. I hope you can find a way for everyone to be happy in your new home, furry or not. 😊",
              "id": 86,
              "comments": [
                {
                  "score": 7,
                  "content": "It's easier to redirect the sister to find her own place. She can let her cat scratch her own things and lose her own security deposit. It's not OPs job to train the cat for her. The sister would have lasted about 5 minutes living with me. I'd let the cat stay but not her.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA. Honestly op, you are moving into your beautiful new house, that you and your boyfriend own, and are thinking about making the family bigger (adopting a pet). Why I'm earth are you still bringing your sister along with you?? Trait me when I say: it's gonna be a hell of a lot easier to let her know you want your free space BEFORE you all move in to the new house, than it will be to get her out of it after weeks/months of disregard and disrespect towards your home.\n\nIf her job doesn't pay enough to cover \"everything she wants\", she better find herself a new job or start adapting her expenses to how much she makes.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You are moving blocks to accommodate a lifestyle that you didn't sign up for.\n\nYou are better off helping your sister transition out of the house than you are looking at ways to make this home work for the three of you.\n\nHas your sister ever given you a timeline for moving out in the four years you've been cohabitating or any indication that she wants to live independently?",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Are the scratchers being placed next to the area where the cat scratches furniture? The cat is saying, \"I want to scratch something *HERE.*\" So if you place scratchers next to the couch corners, it should get better.",
              "id": 90,
              "comments": [
                {
                  "score": 3,
                  "content": "There are scratchers near the furniture. The problem is her cat scratches randomly just around the apartment, and we can't have a scratcher next to everything.",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "My cat has a very large tower and a couple scratching posts. She still once in a blue moon will scratch the couch, I've trained her well and she stops the instant I clap my hands or snap at her (btw never sprayed her with water or hit her anything like that) just kinda pulled her off and got an angry tone. She still does it maybe once every couple months, I feel like it's inevitable, her instincts kick in and she scratches the nearest thing. If you're going to live with cats, I'd say if you're going to live with a cat that'll it will eventually happen especially if sis or even anyone isn't around. My cats like to be sneaky, they KNOW I do not allow them on any table surfaces or counters, but sometimes I'll come home and see one laying on a table and IMMEDIATELY jump down when I walk in. Caps might be an option but honestly I have no clue how well they work.",
          "id": 92,
          "comments": [
            {
              "score": 7,
              "content": "Sometimes, they do things *because* they know they're not allowed. Our house is brimful of cat things and there are very few places they aren't allowed but kitchen surfaces are a definite no so those are the holy grail of sitting spots, of course. It's very difficult to tell a kitten off for sitting in the sink so he can play with the tap but rules are rules.",
              "id": 93,
              "comments": [
                {
                  "score": 2,
                  "content": "Yep. My cats totally go up on the counters at night.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It's kinda funny, I just snap my fingers and say \"HEY!\" and they immediately jump down........ They know lol",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}