{
  "post content": "My(34f) wedding is at the end of June. I have 4kids all under the age of 6, go to school full time and am planning my wedding which as many of you married Redditors know, it's not just cake sampling and flower arranging. Fiance and I decided on a big party 8 bridesmaids 8 groomsmen. we both come from big families. Maybe I'm just stressed out and letting my emotions get the best of me idk.\n\none of my bridesmaid is J (33) whose been a friend since grade school. I love her but she can also be selfish at times. that's kind of why I feel like I'm an a hole I should have known something like this would happen but I guess I hoped she would suck it up for my wedding.\n\nJ has been job hopping lately. I like to take my bp (bridal party) out on lunch  dates, pedicures, dress shopping, just so they're all comfy with one another. I totally get if someone can't go but all of them have been great with scheduling and putting in an effort to make everything easy and fun. except J. whenever me or my maid of honors says about getting together her immediate reply: I don't know if I can get off like you guys. Whatever. BP decided to have a weekend getaway before the wedding. We all picked April to go, even J and we worked specifically around J's schedule. in April the hotel just has a better deal and saved us all some money. I collect the money, reserve the rooms ahead of time and guess what J gets a new job. April apparently doesn't work now. She doesn't want to ask so soon for a vacation from this new job. She wants to change it to early June so I cancel the reservation because June they're booked and it cost more. I find a new hotel in the city but it's too expensive for J. So I get a new one. it's just been chaos. To top it off yesterday I got a text from her with no apology: yeah I'm really hoping to get that weekend off for the girl's trip. But I don't think I'm going to ask for that weekend and the rehearsal day off. I'm going to have to skip one.\n\nI'm done. I'm stressed and losing my mind. she has shown no compassion towards all the changes I have to make for her and any compassion towards the other girls some who have more responsibilities than her. AITA ?",
  "id": 1,
  "comments": [
    {
      "score": 313,
      "content": "ESH. This will be an unpopular opinion, but your wedding party has ONE job. To show up at your wedding and stand up for you in your union in the outfit of your choosing. That is it. Nothing more. All of the rest is icing on the cake. Brides especially do not seem to realize that. \n\nI say you are the asshole because you cannot expect a person to make all of these 'get-togthers' for you at the cost of their own vacation days, money, whatever; that is selfish. I say she is an asshole, too, because she should not expect you to reschedule around her--she should just explain why she cannot attend, and also she should be putting in an effort to show up at the rehearsal as it is important.",
      "id": 2,
      "comments": [
        {
          "score": 90,
          "content": "I have turned down (very tactfully) 2 invitations to be a BM for the simple fact that I cant stand the obligatory rediculous bougie Instagram nonsense that seems inescapable in modern  bridal culture. I just cant.",
          "id": 3,
          "comments": [
            {
              "score": 53,
              "content": "Right? I know it's much worse nowadays than when I was younger, but these group meetings, daily check-ins; spa days, luncheons, destination over-the-top bachelorette weekends; twelve different showers--it's all too much. Like WTF, it should not be a full time job, lol.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I thought the same...and she has 4 kids I wonder if she bought into that nonsense when it came to showers/gender reveal/etc. as well. This feels so over the top. Schedule things, if she can't be there, no harm no foul.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "But i feel like it's one thing to turn down going to something, and another to make everyone else not go because you can't. Which is what seems to be happening.\n\nHowever not all \"fun\" things are fun for everyone. Some people would absolutely hate a lot of the things Op is having Them do even if they weren't paying for it. Especially if they could be at work doing something important. The the relaxing spa day becomes a stressful spa day.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I decided no more after I had to show up at 6 am for a 5 pm ceremony 🤦🏻‍♀️ hair, airbrush makeup, multiple photo sessions, videographer session etc etc. Never doing it again - but at least that was one day plus a bachelorette party I could have turned down without any fuss.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 62,
          "content": "I got exhausted just reading all of this. A \"weekend getaway\" does that mean there's still a bachelorette party?! Wow. And there's still the shower, the rehearsal and the actual wedding. Yikes.",
          "id": 8,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "As someone who is currently planning a wedding, I completely agree with this! I have 6 bridesmaids and only 2 live in the same state as me. I couldn’t imagine requiring anyone to do anything other than being at my wedding. 2 of my bridesmaids will not be able to make my bachelorette which is totally okay and understandable!\n\nOP you should have a talk with J and let her know that these things are not required, as you keep commenting. She may have said she wanted to go on this weekend trip, but I’m sorry a job is sometimes more important.",
          "id": 9,
          "comments": [
            {
              "score": 14,
              "content": "Yeah, that is the kind of bride to be--you sound pretty in tune to things. Congrats on your upcoming nuptials! :)",
              "id": 10,
              "comments": [
                {
                  "score": 5,
                  "content": "Thank you!! I try to be understanding! Everyone’s situation is different. I’ve been “required” to do things for brides in the past that have ruined the friendship.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This. ESH. My wedding was last year and I went through the ringer with my bridesmaids. But now that I have had some space I would have handled it all differently. Don't fret if she can't make some events, as long as she shows for the wedding day.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I’ve been in three weddings and in none of them were the extra events mandatory - multiple people missed the bachelorette parties and/or came late to the rehearsal because of work. The brides were chill about it. This isn’t normal bride behavior.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I've been a bridesmaid twice and for the most part just showed up. There was a low key rehearsal dinner and hot dog roast reception for the first and I can't remember the second. I'm always amazed when I read reddit stories about bridezillas and groomzillas and destination weddings and fussing about a dress.(no, I've never married)  I've quit reading bridal stories for the most part. It's all yap yap blah blah waaahh. I only clicked on this one because I only saw the first line: aita for kicking the bridesmaid )",
          "id": 14,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "OP also didn't have to bend over backwards to change the dates for J, she chose to. I would have just kept the booking because, exactly as you said, BP can't be expected to attend everything.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 131,
      "content": "Why not still let her be a bridesmaid and just accept the fact that she won't be able to make certain events? As in, don't try to reschedule if she can't make it, but as long as she can still get a dress and everything, let her stand with you?",
      "id": 16,
      "comments": [
        {
          "score": 13,
          "content": "But surely being a bride is an occasion to weld total dictatorial power over your friends and family and cast them out if they aren't up to scratch or should object in any way?  You seem to be missing this important factor in modern weddings.",
          "id": 17,
          "comments": [
            {
              "score": 5,
              "content": "Thank you for saying it.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Yeah this probably would have been my solution from the get-go",
          "id": 19,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 115,
      "content": "YTA.  Why do you think she is obligated to do anything other than show up at the wedding in appropriate attire? \n\nI understand wanting people to meet and get to know each other, but a Sunday brunch or something like that would be just fine. \n\nOther people have lives with other obligations, priorities and expenses and I’m willing to bet your “get togethers” are are nothing more than a PIA for everyone.  \n\nHonestly, you sound like a bridezilla.  Why should anyone sacrifice multiple weekends, vacation time, spend money and potentially jeopardize their jobs just to be in your wedding?  Do you think you are really that special?",
      "id": 20,
      "comments": [
        {
          "score": -111,
          "content": "Did you do a quick skim of what I wrote? Get togethers are just something we do to talk and have fun. I don't require anyone to come. I don't even set all of the dates up. We've all become close with each other is doing so. I mentioned this due to how J replied to us.  The bridal party, not me, decided to celebrate with a weekend getaway. I never suggested, nor pressured anyone into this. The idea had never even crossed my mind until they mentioned it. They have all been great with scheduling except J.",
          "id": 21,
          "comments": [
            {
              "score": 102,
              "content": "You literally just complained about J not coming to your get togethers. It’s clearly so much of an expectation that you began your complaints with it. YTA Normal adults with jobs can’t just take off random days because their friend is getting married and wants “bridesmaid time.” Also why do they need to get to know each other for one day- your wedding? Your wedding is one day and it’s not nearly as significant to them. I would have dropped out of your wedding party long ago. Also, people are allowed to find new jobs when they’re unhappy. The idea that they can’t is so toxic and you’re acting toxic as well.",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 44,
              "content": "If you don’t care if anyone comes why do you want to kick them out of the wedding because they can’t/won’t come?\n\nCan’t have it bot ways.",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "Then why would you “kick her out” of the bridal party. Someone up there said it “her only job is to show up at your wedding in a dress you picked”",
              "id": 24,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Sounds like the only one disadvantaged is J in this story. Poor thing will not have a connection with the other BP members because she's had to miss due to her job, and you want to kick her out on top of it? Id feel horrible if I was in her shoes to have someone in my life like you. She's already going to feel left out...",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 84,
      "content": "YTA. I think you are over reacting. Shes not blowing you off for other people or other events. It's her job. Would you rather she quit her job to accommodate you? If she has her dress and she shows up to the wedding that is litterally all that matters.",
      "id": 26,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "YTA. You're creating your own stress with all these bridal party events. Your wedding is still 5 months away. You are the selfish one here. I know I gabe limited down time and the amount of things you said would basically eat almost all of it. \n\nI'd just tell her that the rehearsal is more important and you understand if she can't get the other weekend off. \n\nYour wedding is very important to you. I get that. You can't expect it to consume your friends and family to the same extent.",
      "id": 27,
      "comments": [
        {
          "score": -72,
          "content": "The thing is she said she wanted to come on this getaway with us. I never pressured her into it. It was actually my bridal party who made up the idea and told her and never said she had to come should it not workout. She decided she wanted to but we had to work with her schedule. Completely fine. She quits that job and moves on to a new one so I have to change the date because she still wanted to come. Never once has she thanked me for this or apologized to the others. Now she's acting like she can't come.",
          "id": 28,
          "comments": [
            {
              "score": 9,
              "content": "Just dont reschedule for her but there's no need to kick her out of the bridal party....",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 43,
      "content": "I’m going to go with ESH. \n\nYes your friend is totally selfish and isn’t recognizing the efforts you were making to include her. \n\nYou, however, seem to be expecting a LOT of your bridesmaids. I know that you see what you are doing as efforts to make everyone friends before the wedding, but not everyone can take off of work and not everyone has the money to do these things. You are putting a lot of pressure on them. \n\nIf someone can’t come, don’t keep rescheduling. You’re making it harder on yourself and everyone else. \n\nRelax and just enjoy your day.",
      "id": 30,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 28,
      "content": "YTA if she can make your wedding and the rehearsal than that should be all she really needs to do. Asking someone to pay so much for so many different events that are required for your wedding, spa days, trips, lunches, bachelorette party, dress shopping, rehearsal dinner and wedding! WTF and then also give up vacation time and God knows how much money for it all and buy a wedding gift. Really. It sounds like your having a year long wedding! Schedule something and if she can't come then ok move on, as long as she is in the wedding then all should be good. I don't think you are being fair asking so much from so many so often just because you are getting married.",
      "id": 31,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "ESH, but you sound like more of an ass then your bridesmaid. Expecting people to take days off their new job for your events is ridic.",
      "id": 32,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "ESH.\n\nI know I will be downvoted amidst cries of \"Your wedding, your rules,\" but bear with me on this one.\n\nTo start, you are NOT an asshole by any stretch. If past behavior is an indicator of future behavior, it's likely J will be a problem on the wedding day itself. That's a perfectly legitimate reason to dis-invite her from the BP.\n\nI do think J is being entitled, demanding you work around her schedule and change established plans for the whole group because of her decision to take a new job. She should honestly have just been left out of the outing.\n\nThe reason I say ESH is that, while being a bridesmaid is a *major* responsibility, brides tend to pile on too. Outside of the bachelorette party and wedding weekend, requiring the BP to set aside time for lunch dates, pedicures, dress shopping, etc is a big ask, especially for people who don't have flexible work schedules. \n\nSo if you want to boot her for entitled behavior, flakiness, attitude, etc then fine. But because she can't make it to a lot of outings that are not really part of her duties? Not as good a reason.\n\nBut hey, your wedding your rules.",
      "id": 33,
      "comments": [
        {
          "score": -40,
          "content": "Dinner dates, pedicures and stuff like that are just random occasions I never expect any of them to come to. I just enjoy spending time with them. most of it's not even about the wedding it's just to have fun. again, there's no requirement just meant for a good time to get comfortable with each other.",
          "id": 34,
          "comments": [
            {
              "score": 34,
              "content": "I understand that but your post is about her waffling on being available for a trip that is not the bachelorette party, or did I misread? So either these extra things don't really matter like the comment suggests or her lack of availability for them is a dealbreaker like the post suggests.\n\nI agree her inconsistency and lack of acknowledgement for the inconvenience she is causing is rude. But it seems the obvious answer would be just to say \"Sorry but we can't move the date again. Either you can get off or you can't. We will miss you.\"",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "You keep saying this, but then _why are you trying to drop your friend from your wedding for having to miss_ **1** _event?!?_\n\nIs she in your bridal party because she's your friend? If so, be aware that you're choosing to drop a friend for life because they aren't able to attend one particular event as much as they tried.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Do you work?",
              "id": 37,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": ">J  has been job hopping lately. I like to take my bp (bridal party) out on lunch dates, pedicures, dress shopping, just so they're all comfy with one another. I totally get if someone can't go but all of them have been great with scheduling and putting in an effort to make everything easy and fun. except J. whenever me or my maid of honors says about getting together her immediate reply: I don't know if I can get off like you guys. Whatever \n\n&#x200B;\n\nThis is as far as I needed to read...yeah, YTA.   How dare she make life decisions based on what is good for her and her future instead of ditching real responsibilities for lunch dates  and pedicures.\n\nGet over yourself, OP. Nobody cares that much about your actual wedding, much less all the stupid and self-indulgent bridezilla nonsense.",
      "id": 38,
      "comments": [],
      "relation": "Attack"
    }
  ]
}