{
  "post content": "Throwaway account. This happened Saturday, but everything is still really bad between us.\n\nI (30F) have a severe genetic condition that affects the way my body makes collagen. I am on permanent disability because of the impact of my condition and how much time I spend in the hospital.\n\nBecause of this, and because of the risk pregnancy causes, I decided to not have children. I'd rather not have my insides suddenly rupture out of nowhere, I don't want to pass on the horror I'm dealing with to anyone else, and if I make it to 50, I will be damn lucky. I am also not in a relationship because I feel sickening guilt over the possibility of forcing a partner to be a caretaker when I have worse days and knowing they would likely outlive me and have to handle my eventual passing. I've had several friends with my condition not make it out of their 30s.\n\nI met Kelly (35F) who has a different subtype of the same disease in an online support group four years ago, found out we lived in the same area, and we became friends IRL, and we have been a huge emotional support system to one another. I was part of Kelly's wedding party two years ago right before everything shut down. Now, she is expecting her first child, and at first, I was thrilled for her.\n\nBut now, every time we see each other, all she does is complain about how much more everything hurts, how she's so tired, how she's so done with this bs, and how much she hates being pregnant and can't wait to get the b*stard* out of her (her actual words). And my complaints about whatever I'm dealing with get brushed aside because she insists that she's going through so much worse because she's pregnant and I'm not.\n\nAfter four months of this, I ended up exploding at her. I told her to shut up. That she knew with her illness, she'd have so much more risk of pain and complications, she KNEW what she was getting into when she started trying for a baby, and she had this discussion with her doctors many times over. \n\nShe accused me of being jealous. I told her that I was actually mad as hell about how ungrateful she was, and how I don't want to hear another word from her about how awful it is to get everything you ever dreamed of having.\n\nWe haven't spoken since. Truth is, I am jealous. I would love to feel like I deserved a loving partner. I would love to have kids. But I can't do this to someone else, and I can't sit there and listen to someone who gets to have what I want act like it's the worst thing to ever happen to them.\n\nMy mom thinks it isn't worth losing a friendship and I should have been the one to shut up and endured her complaints. She insists that I owe her an apology for being insensitive because I \"have no idea what pregnancy is really like\", which just made me feel worse.\n\nWhat's word, reddit? Should I suck it up and be happy for Kelly?",
  "id": 1,
  "comments": [
    {
      "score": 34,
      "content": "ESH. She has no right to tell you whether or not her pain and struggle is worse than yours, but you also have no right to tell her to “be grateful” for her pain. People are allowed to complain about things they chose, it’s just a way to cope. The two of you should take time to learn how to communicate respectfully and place some boundaries down.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 30,
      "content": "YTA. \n\nMy best friend has EDS and went through two painful, stressful pregnancies and she never, ever blew up at me like this when I talked about the physical effects of my own pregnancies despite the fact that I don’t suffer additional complications like she does. You know why? Because she is an empathetic human who understands that pregnancy is hard at some point for the majority women who go through pregnancy. \n\nYour decision not to have children doesn’t negate the pain that Kelly is going through. She didn’t “accuse you” of being jealous - she rightfully called out your jealousy.",
      "id": 3,
      "comments": [
        {
          "score": 12,
          "content": "I have hEDS, while it sounds like OP has vEDS based on life expectancy, and I consider myself LUCKY to not have vEDS. hEDS sucks balls, no doubt, but vEDS is a much more dangerous condition. It also doesn't sound like Kelly has vEDS, and doesn't have any real concept of what OP is enduring, either.",
          "id": 4,
          "comments": [
            {
              "score": 13,
              "content": "But Kelly isn’t the one telling OP to shut up and stop complaining. \n\nJust because someone doesn’t have it “as bad” doesn’t mean they don’t deserve empathy for the pain they do endure.",
              "id": 5,
              "comments": [
                {
                  "score": 6,
                  "content": "This. Pain is not a competition.",
                  "id": 6,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Kelly was the one who made it a competition in the first place. Reread the post.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "But Kelly isn't offering OP the same consideration. OP specifically says that Kelly IS turning it into a competition. I don't think OP is in the wrong for being mad when Kelly made it into a competition first.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "I'm not sure what subtybe Kelly has, but I do have vEDS. She definitely doesn't because she's commented that she, like you, is \"lucky\" because she doesn't have my type.",
              "id": 9,
              "comments": [
                {
                  "score": 1,
                  "content": "Hugs OP.  hEDS sucks enough,  I can’t imagine the strength you must have to fight though vEDS.  I hope you find all the peace and happiness in the world.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "[deleted]",
          "id": 11,
          "comments": [
            {
              "score": 4,
              "content": "This issue is not the children at the end - the issue is OP’s complete lack of empathy for another human being because that person doesn’t have it “as bad” as her.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "YTA and you are jealous. Yes you have a painful terrible condition, but that doesn’t make you not deserving of love.  Many many humans have issues.  Even the healthiest person could suddenly die or become paralyzed and their partner would have to take care of them or leave them. You are the one that decided that you didn’t deserve love or companionship.  At least you have a friend. Be proud of your friend for trying to experience life, you never know when her insides could rip open and she could die.  Don’t let this be what ends a friendship.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "YTA, but it sounds like you’re mostly being the asshole to yourself. You absolutely deserve a loving partner, and the fact that you don’t think you do because of a disability says a lot about your frame of mind and the jealousy you’re experiencing right now. \n\nApologise to your friend, and gently tell her that it is just too much for you to hear her complain about something you wanted so badly - you’re not the person to confide in about her struggles with pregnancy.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA.\n\nYou are jealous. You also don't know what pregnancy feels like and for even a healthy person it can be very hard, let alone someone with a chronic condition.\n\nYou are entitled to your feelings, but YTA for not keeping it to yourself or at least saying it in a way that was respectful.\n\nBe better. Grow up.\n\nEdited to add: You are choosing to live a life of solitude without a partner or kids (you can adopt). So stop being a martyr here. These are all your life choices and it's not even fair to be jealous when you put yourself in the situation to be without a spouse or a child. Partners are there for sickness and health and you are unilaterally deciding what a potential shouldn't have to deal with.",
      "id": 15,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "YTA - if she truly is your friend,  it is not unreasonable to expect support for this huge, frightening, and exciting time in her life. If it’s difficult for you to be there for her, tell her that and limit your time with her. But even if you go your separate ways, at the very least you owe her an apology for blowing up at her.",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH.\n\nNeither one of you is being compassionate to the other in this situation.\n\nI think what a lot of y.t.a. votes are ignoring is that Kelly is NEGATING YOUR OWN PAIN and rubbing it in your face that she's pregnant and you're not.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA especially if this is the first time you've said anything. Why let it build up if it upsets you? Why didn't you tell her before that this isn't a subject that you're comfortable discussing.\nYes she knew the risks and moved forward regardless that doesn't invalidate her pain.",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "YTA. I’m sorry for your Eds, I have it as well, on my second surgery, and it’s awful. \n\nThat said, this is a temporary time of life for your friend. If you want to be a friend – be a friend. \n\nDon’t compare. Don’t minimize her complaints. But if you need to set boundaries and step back, that’s OK. Totally fine. But don’t keep talking to her and be an asshole, that’s not very nice",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Soft YTA\nFellow EDS patient.  It sucks.  You have every right to feel the way you do.  You DO NOT have the right to take it out on others.  You don’t have to have been pregnant to understand she must be miserable.  You also know that even though you prepare and expect the pain, it does catch you by surprise.  There are not a lot of people who get that.  Your friend does.  For your own peace, take the loss, apologize and rebuild this friendship.  You both need each other.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    }
  ]
}