{
  "post content": "Hey guys. So a little background first - my GF (21) and I (22) have been together for a little over a year. I am a very sensitive, mushy-gushy guy with a real loving personality. I love pleasing people and making them feel good. On the other hand, she is super caring and loving just not as mushy-gushy and definitley not nearly as sensitive but this has a lot to do with our upbringings as she didn’t grow up in a great home.\n\nThe only thing that we’ve EVER fought about since we’ve started dating is how she talks. Another thing about her is that her humor is sarcasm so she loves to tease and make jabs (mostly in a rather cute manner) but sometimes her words and tone can really bother me and this is the main reason I’m writing this. She can at times not be aware that some of her sarcasm can come across as rude, passive aggressive, or even just aggressive to people that don’t know her or even people that do know her (I sometimes still feel the aggression!). Some examples below:\n\n-friends hanging out, being goofy, acting stupid and asking stupid questions to be funny and she will just out of nowhere be like “I can’t believe you just asked that are you dumb!?” And sometimes there’s just a slight moment of awkwardness like “ok relax jeez”\n\n-Also sometimes when she tells me she’s going to do things, naturally my response is “oh yeah that’s fine” just cause that’s my normal response and she always has to respond with “oh thanks for your permission” which is just SO ANNOYING like why do you have to make it that way??\n\nWe’ve had many talks on this, some going better than others where she asks how after all this time of us dating that I can’t see when she’s being sarcastic and asks me why I need to take everything so literally and I end up feeling shitty because maybe I let my sensitivity get the best of me. Then there have been other conversations where I tell her that how I feel is how I feel, and nothing is wrong with that, but there is something wrong if you choose to ignore it. At this point though, this convo has come up many times to where she thinks I’m attacking her character and her personality and making her out to be some bully which I don’t want to do. But I do want her to see that there’s sometimes no reason to speak the way she does, even if it’s intended as a joke!\n\nAnyways, the real question here is if I am in the right to be going at her for this stuff. I do love her more than anything else in this world and she is an amazing girlfriend who has been there for me through the most hardest points in my life, but I don’t want to eventually snap later on by trying to ignore this stuff that obviously bothers me deep down. \n\nEDIT: Perhaps some important things I forgot to mention (1) We dated for a year at the end of high school then decided to part ways since I was going away to school and she was going through family troubles. Got back together Oct. 2021 and (2) we now have been living together for a little over a month.\n\nTL:DR - GF (21 F) has a very sarcastic personality and sometimes can come across as rude and I’m (22 M) trying to figure out if I’m right in being upset by it sometimes or if I’m just attacking who she is and being an A-hole.",
  "id": 1,
  "comments": [
    {
      "score": 32,
      "content": "NAH. You're just not compatible. Eventually she's going to stop saying anything at all because she's going to feel attacked. Find someone you vibe with better and stay friends with her.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Interesting you say that, because she has brought that up before where I at times make her feel like she’s walking on egg shells, which is the exact OPPOSITE of what I want to do or am intending to do.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "Absolutely if someone is saying something hurtful, you should bring it up. However, being asked to change your personality/sense of humour/vernacular, can be very hurtful. And generally results in the person shutting down, keeping their mouth shut, not sharing with you.\n\nThese examples you gave sound like NOTHING to me, because I'm also a sarcastic person. I would laugh and throw it right back at her, but you're taking it so seriously.\n\nDevil's advocate: language is a 2-part experience. How you perceive it has just as much impact as how she intends it. You've tried asking her to change. Have you tried to change?\n\nSome personality types just don't mesh well together. And that's okay. You can love someone and not be right for each other. You've also only dated a year, and are 22.",
      "id": 4,
      "comments": [
        {
          "score": 0,
          "content": "Hearing from another perspective similar to hers is really great. Honestly, I can be pretty stubborn and tend to have a mindset that my way of thinking seems more moral/right. But you’re right when you say it’s only as bad as how I perceive it. If I didn’t care, then I wouldn’t think she was being rude. My mom is the same way if not worse, and I almost wish I wasn’t brought up to be so soft.\n\nI want to learn how to care less to be honest. I know it’s hard to give advice on a relationship based on one post, but I really do love her and we are so happy in so many other areas. So all these comments saying we are incompatible while they are appreciated, I can think of a million ways besides this as to how we are. I’m nowhere near a point where I want to give up.",
          "id": 5,
          "comments": [
            {
              "score": 6,
              "content": "My comment about incompatibility comes from personal experience where people kept taking issue with everything I said. It doesn't take long to stop feeling the love, even if everything else lines up perfectly. \n\nI would try reframing your mindset for sure. She's not being immoral or rude, she's showing you she trusts you. Most sarcastic people turn it off at work, as an example, because they aren't comfortable there. \n\nUsually sarcasm is also meant to show that something doesn't matter. You know, let's say you're insecure about your driving. I might say something sarcastic about it to show you it's okay. You don't need to be insecure. I know that probably sounds twisted, but she's using a tool to connect with you. It's just different than the tools that you use. \n\nI would also suggest being cautious while bringing it up to her. Some topics might be off-limits, and that's okay, but rather than just saying \"never ever be sarcastic!\" pick one or two things to start with. And don't expect it to immediately change, it's really hard to change language that you've been developing your whole life. \n\nAnd maybe for the hell of it, with one of these things you know she's prone to saying (like the permission comment), try throwing it back to her and see how you feel. You can even prepare a response since you know it'll come up. It might feel less serious if you can recognize that you didn't mean the sarcastic thing when you said it. \n\nGood luck!",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "Thank you so much for your insight! So hard to find people similar to her that I can talk to.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Sarcasm/shit talking in the context of a positive relationship is a connection tool. It shows that you know the other person well enough to navigate around their tender spots to just tease about things that don’t matter. It shows you know their sense of humor. It even shows that you can respect boundaries, because a healthy version of this will hear “hey that one hit too hard,” go “shit, sorry” and stop using it. It’s a trust tool.\n\nIf you were raised in a toxic version of this, I can understand why it doesn’t work for you. However. If you cannot change your perspective at all on this, you two are not compatible. Full stop. You can go find someone that is sappy and sincere at all times and she can go find someone that she can spar with. Sarcasm is a valid relationship strategy and you’re not objectively correct in disliking it. This is your preference.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "N TA, it sounds like many of the thing your GF says are rude and hurtful, BUT I don't think you will have any luck changing this. But YTA for going at her and trying to \"fix\" her. (You are doing it enough that it is generating conflict).\n\nBTW you have my sympathy, my SIL is one of the most sarcastic, snarkiest people I've ever met and it's absolutely exhausting. Painful too, to see how she shoots herself in the foot over and and over (work, friends). But she is a grown woman and it isn't my place to try to change her.\n\nEdited for grammar",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA. If you don't like her personality and behavior, why are you dating her?",
      "id": 10,
      "comments": [
        {
          "score": -4,
          "content": "Well, I do love her with everything in me so rather than look at it like that I’m trying to see if I need to take a step back and realize what I’m doing is wrong or if I just need to approach it in a better way.",
          "id": 11,
          "comments": [
            {
              "score": 4,
              "content": "It seems like you just may not be compatible.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NAH, just conflicting personality types.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA that’s what dating is for, to figure out who you want to be around and/or marry the rest of your life…if you’re not compatible you’re not 🤷‍♀️",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA but you two don't match",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole because I am judging her character and asking her to change how she is as a person which isn’t fair. I have confronted her many times about this not in the best way which should be judged but I don’t know if my feelings on this make me the asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "So to use your phrasing, you are just attacking her for who she is and being an A-hole.\n\nWe are who we are. It’s her personality, it is how she communicates, expresses herself, interacts. It clearly isn’t new, it clearly isn’t changing. And you shouldn’t expect it to.\n\nYou made a comment around “how I feel is how I feel, and nothing is wrong with that, but there is something wrong if you choose to ignore it.”\n\nLet me flip that for you. **Who she is is who she is, and that is okay, but there is something wrong if you choose to try to change it.**",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": -1,
      "content": "NTA.\n\nI say this as someone who was/is similar to your GF. I grew up in a family that ribbed each other and made sarcastic comments toward each other and that was how I learned to be \"funny.\"\n\nBut its not really funny to most people. A lot of the time it comes off rude and passive aggressive. It hurts people's feelings even if you don't intend for it to. And a lot of people aren't willing to put up with it. My partner has been really patient with me unlearning it. I started really defensive about it, but have been getting better (I think).\n\nPeople that say its \"just her personality\" are kinda right in a way. It IS part of her personality, but personalities can also change. We learn and unlearn different behaviors, and just because its ingrained doesn't mean it can't change. The issue, I think, is that she's defensive about it. If she feels like she's walking on eggshells then she can't tell the difference between funny sarcasm and not funny sarcasm. Its a line you have to learn if she grew up in any way similar to how I did.\n\nIf she cares about you, she shouldn't WANT to hurt your feelings. I'm not implying that she does want to hurt you, either. She's probably feeling threatened because it's what she knows. Changing the status quo is scary for a lot of people. But if you want to put in the time and patience to help her unlearn it (if she wants to), it is possible.\n\nShe needs to realize that this isn't the only way for her to be interesting or funny to others. She can add other things to a conversation that aren't these sarcastic comments, and she'll probably feel better for it because her realtionships might end up more positive as a result. It could also come from a place of feeling unheard in conversations and feeling like she has to add SOMETHING just to be heard (it did for me, so that could also be projecting). If you come at it with love and honesty, she might be able to reflect and open up about something. I hope so at least.\n\nTake all of this with a grain of salt, of course, a lot of it is projecting my own experiences onto you and your GF. But maybe something will resonate!\n\nI hope the two of you can come to an understanding. It'll probably require a lot of patience and understanding on your end that she will not always get it right. You will have to correct her (privately) and maybe explain things. Meanwhile, she'll have to really reflect on the things she says and unlearn the impulsive desire to say her little sarcastic quips. But if you work together and you both put in honest effort, it can get better. I'm rooting for you! :)",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "Thank you so much! Will definitely take this advice moving forward. I definitely am at fault for calling her out in public sometimes too, which definitely doesn’t help. I forget how easy it is to get defensive over things like this and I need to understand that. But she has gotten better since we first started dating, just not totally there yet and before I pressed more on it going forward, I wanted other opinion. Thank you again for all of your insight and advice",
          "id": 19,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}