{
  "post content": "\n\nMy husband, Mike (37) is the eldest in his family. He's pretty close with his sister Beth, (28) and they spend almost all week together. Beth had issues with her father growing up. She went no contact with him after he took her first car and damaged it. She only remained in contact with Mike since everybody else judged her for going no contact.\n\n\nShe's getting married to her fiance of 3 years. From what I understand, she and her dad are slowly getting reconciled, but she made it clear she wants him to take no part in the wedding. She asked Mike if he could walk her down the aisle and he agreed. I have to say that I was taken aback and it felt a bit odd for me because, her dad is alive, they're on speaking terms again, he's gonna be there at the wedding so the logical thing to do is have him walk her down the aisle. This role isn't for her older brother but her father. Not to mention how FIL will feel about it. I brought this up with Beth and she had an attitude and implied that I was just saying this and objecting because of how I feel about the situation not how our traditions should be practiced. We got into an argument and I went home.\n\n\nMike thinks I'm being unreasonable and possibly causing him to miss something so sentimental and that if anything, he feels honored to be asked to do this for her, and said that I should stop worrying about what others might say.\n\n\nNow we're having this conflict (3 of us) and can not seem to reach a solution.",
  "id": 1,
  "comments": [
    {
      "score": 56640,
      "content": "YTA\n\nThere was no conflict except for YOUR (unwanted) opinion.\n\n\\- Beth wants Mike to walk her down the aisle.\n\n\\- Mike wants to walk Beth down the aisle\n\n\\- Mike's wife thinks he shouldn't, sticks her nose into his business, insists upon it, objects to it, creates a conflict because of her own opinions about years-long issues she hasn't been around for, and then posts.\n\nOP, during your entire typing and proofing of this post, did you not see that you've butted into someone else's affairs? Was there no glimmer of \"*Beth should be able to choose whomever she wants*\" or \"*Mike and Beth know this situation best*\"?\n\nI'm more concerned that this isn't the first time you've done this (argued a point rather than listened to the other side), and if I were you I'd apologize and offer your (nonjudgemental) support. If I were Mike I'd be second-guessing my marriage.",
      "id": 2,
      "comments": [
        {
          "score": 9868,
          "content": "yea I fail to see what it is OP takes issue with other than just to be a shit disturber. she needs to grow tf up",
          "id": 3,
          "comments": [
            {
              "score": 6872,
              "content": "I'm guessing OP doesn't like how close her husband and his sister are and is expressing it through this.",
              "id": 4,
              "comments": [
                {
                  "score": 3502,
                  "content": "Exactly! I think she’s jealous that her husband and his sister are close.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 612,
                      "content": "Remember Danny from Friends? OP have u been watching too much Friends? It's his sister. How much are u going to reach here? Are u jealous of his sister? YTA",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 50,
                      "content": "Exactly my thoughts!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "It reads like “Mike belongs to me, not you”.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1257,
                  "content": "I agree since she felt the need to mention they spend a lot of time together",
                  "id": 9,
                  "comments": [
                    {
                      "score": 57,
                      "content": "how TERRIBLE that he have other people in his life who aren't her. I just can't with OP.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "“Almost all week”",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 811,
                  "content": "I’m also getting vibes here that OP has some weird hangups about ✨tradition✨ and the exact ways it should never ever be deviated from.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 57,
                      "content": "OP would NOT have liked my wedding then. Lol.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "Traditions should serve us, not the other way around. If this tradition doesn’t suit Mike & Beth, chuck it in the bucket",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "I got this vibe too",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": ">Mike thinks I'm being unreasonable and possibly causing him to miss something so sentimental and that if anything, he feels honored to be asked to do this for her, and said that I should stop worrying about what others might say.\n\nLet's also get this straight for OP. You're concerned about what others will say? They'll probably say how sweet it is that her brother is giving her away... ESPECIALLY if they know the backstory. You're the only one with issues here. Get help for them before it completely ruins your marriage.  \n\n\nYTA",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2829,
              "content": "And her writing \"I was taken aback\", like I can see her clutching her pearls with her hand dramatically to her head.",
              "id": 17,
              "comments": [
                {
                  "score": 1412,
                  "content": "Lol same. \"But that's not an older brother's role, that's a father's role\" OP are you also upset that Beth's parents aren't being paid a dowry of 5 cattle and 20 bolts of cloth in exchange for their daughter? Why do you care about this weird manufactured tradition so much",
                  "id": 18,
                  "comments": [
                    {
                      "score": 63,
                      "content": "No lands, no titles either…geesh.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "Yes! Like, I want to know is... what if Beth's father had died, rather than been cut off? Would she request that \"dear old dad\" be exhumed for the wedding and be wheeled around \"Weekend at Bernie's\" style?",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 508,
                  "content": "won't someone *please* think of the future sister-in-law?",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "I had the same thought! Who cares who walks her down the aisle? It's actually an honor to be asked. OP--YTA",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Agreed.  Her first paragraph listed a lot of good, solid reasons for SIL to prefer her brother over her father for this and then seems to completely dismiss them because  she seems to think that cautiously speaking to her father again a few times means everything is forgiven...\n\nPoor Mike.  Seems like he married his father.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "From the title alone I was confused, then I read it and I remained as such. Wtf OP, what's the matter with you.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2488,
          "content": "I relate to the siblings here, I have a complicated relationship with my mother that has had many ups and downs. There were periods in my life where I may have felt the same way about having her involved in such a pivotal life event. \n\nPeople who get to have blissfully uncomplicated relationships with their parents do not understand what it's like. And it gets tiring to hear people pull the \"but that's your mooooooootherrrrr\" line when they have no clue what went down between us. \n\nI fully sympathize with the siblings here and OP needs to butt the hell out of it. She might hear about all sorts of things the dad has said or done but she didn't live it. It's totally different as an outside observer.",
          "id": 25,
          "comments": [
            {
              "score": 877,
              "content": "Right?! I have a complicated relationship with my dad, but I had him walk me down the aisle because it's tradition and I didn't want to hurt his feelings. But I regret it. My mom was always my best friend. She should have been the one to walk me down the aisle. And if I could go back and redo it, I would choose her instead.",
              "id": 26,
              "comments": [
                {
                  "score": 120,
                  "content": "Hope you have told her this.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Right. And OP probably will never hear about the worst of it because that's PERSONAL.\n\nOP thinks it's about the car.\n\nThe car was just the last straw after a lifetime of issues. \n\nIf you're in any way interested in what the issues are (and you won't be told the full story because that's personal), maybe ask.\n\nYTA.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I distinctly remember that conversation in middle school. This one student and I were bonding over shitty fathers.\n\nThis one gal kept saying “but that’s your father.” then got offended when we told her off for being sheltered. She took it especially poorly when my friend mentioned, “we’re whispering in the corner of a huge playground, why are you such a nosey b***h?” Thankfully the eavesdropper walked off in a huff. Never understood wth here deal was.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 776,
          "content": "All of this!!! Are you...jealous of your SIL? What tf is wrong with you? You're the only person that takes issue with this, and yours is the opinion that was neither wanted nor sought. You need to back off, or just go be miserable somewhere else. Hard YTA.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "This is so odd, she seems to think she has an equal say in a situation that has nothing to do with her.  The only impasse here is that Mike and Beth are trying to figure out how to politely tell her to fuck off.  The only thing missing from this post is OP bragging about being \"brutally honest.\"",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24381,
      "content": "YTA. \n\nThere are 3 places you can always stay for free:\n1. In your lane\n2. Out of other people’s business\n3. Over there with your nonsense. \n\nThis is way out of your lane, it’s none of your business, and no one is remotely interested in your nonsense. Why do you honestly care who she wants to walk her down the aisle? Do you have a problem with his sister?",
      "id": 32,
      "comments": [
        {
          "score": 7688,
          "content": "> and they spend almost all week together\n\nShe's jealous.",
          "id": 33,
          "comments": [
            {
              "score": 3796,
              "content": "*she’s insecure \n\nFixed that for ya",
              "id": 34,
              "comments": [
                {
                  "score": 1840,
                  "content": "It’s both.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 947,
                  "content": "Usually jealous and insecure go hand in hand.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "I really love this response. \n\nWhen I married the second time after my first husband left me, my *daughter* walked me down the aisle.   My best friend did the same at her wedding. \n\nI went to a wedding in which both the groom and bride's fathers weren't in the picture.   The moms both happily walked the bride down the aisle.  There was no \"giving the bride away\".  Both moms just said they would support their children anyway they could.  Not a single dry eye in the church. \n\nOP seems both jealous and petty. Digging her heels in about \"tradition\" is so sad.  This isn't about tradition.  It's about insecurity over her husband's relationship with his sister.   Which is both weird and concerning.\n\nOP, YTA.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10011,
      "content": "YTA. The person who walks her down the aisle can be any one that has played a big part in her life. You’ve acknowledged that your husband has been that for her. What does it matter who she chooses? It’s not your wedding or your business.",
      "id": 38,
      "comments": [
        {
          "score": 4192,
          "content": "> Now we're having this conflict (3 of us) and can not seem to reach a solution.\n\nSo it sounds like they do have a solution already then.  Mike walks Beth down the aisle and OP minds her own fucking business, problem solved.  YTA.",
          "id": 39,
          "comments": [
            {
              "score": 566,
              "content": "Exactly. The entire issue here is that OP thinks this is somehow her decision/she's involved and that a solution needs to be reached she approves as queen of the world.\n\nThere is a solution. Beth asked Mike to walk her down the aisle, Mike liked it and agreed. Both people involved are on the same page. So he walks her down the aisle.\n\nReally the only problem I see is that Mike married a judgmental controlling asshole (YTA OP) who creates problems out of literally nothing. You are the problem. Just stop, and the problem will be gone.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I’m confused why she thinks she’s owed a resolution. Or why she gets to be part of it.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "No, you clearly misunderstand. “Reach a solution” means “they need to do what I say”.",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 649,
          "content": ">she had an attitude and implied that I was just saying this and objecting because of how I feel about the situation not how our traditions should be practiced.\n\nThat's 100% bang on too.\n\nNo chance they are just so rooted to that traditions, something else going on.",
          "id": 43,
          "comments": [
            {
              "score": 63,
              "content": "It’s so weird OP could type that out and not realize it’s 100% true.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Haha, yea, the sister definitely has her card, and knows 100% what she is about.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Crazy how Beth would have \"an attitude\" about uninvited interference in her wedding and family too right?",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Exactly… It’s weird that OP is annoyed by this. My coworker had her twin brother walking her  down the isle. Her dad is still alive and they have a great relationship. Everyone was extremely happy. I don’t understand the issue. OP YTA.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6679,
      "content": "YTA.\n\n“Now we’re having this conflict (3 of us) and can not seem to reach a resolution”\n\nYeah, because you’re offering your opinion where it’s not wanted and trying to make a decision that’s not yours to make. The way this gets resolved is you saying “I’m sorry for my behavior. You are right I am objecting because of how I feel, and this is not my decision nor something I should be pushing my feelings on.” You then be happy that your husband is so close with his sister that she wants him to walk her down the aisle. That he was there for her all of those years when no one else was.",
      "id": 48,
      "comments": [
        {
          "score": 1911,
          "content": "For real, she says \"the three of us\" like she gets a say?? She has literally no stakes in this discussion. It's not her family, her marriage, nor her history. Just this bizarre nosy entitlement.",
          "id": 49,
          "comments": [
            {
              "score": 399,
              "content": "Lmao exactly. Op can dramatically ponder her thoughts by a rain soaked window all she wants. The \"conclusion\" has already been met.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "Seriously, there are only two possible resolutions. One is that OP gets her way, which is not going to happen. The other is that everyone else does what they were planning to do anyway, and think less of OP for this stunt she's pulling.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "It seems to me that everyone else has reached a conclusion,  but because it isn't what OP wants,  then she didn't accept the conclusion. \n\nSend like she is jealous of her husband close relationship with his sister,  and wants to damage that bond.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4160,
      "content": "YTA. I'm sorry, this is your business how?\n\nBeth has a great relationship with her brother. Beth has a bad relationship with her father. Beth wants her brother to take her down the aisle because her father was toxic to her. \n\nI don't understand your problem. It's her wedding. She can ask whoever she likes. She does not need your permission or your approval.",
      "id": 53,
      "comments": [
        {
          "score": 691,
          "content": "OP is jealous.  Her husband has a closer bond with his sister and she doesn't like it.",
          "id": 54,
          "comments": [
            {
              "score": 77,
              "content": "I’ve always found jealously over close sibling bonds weird af, what is there to be jealous about? Do these toxic people watch too much taboo porn scenarios? If so—stop it, get some help. And don’t forget, partners are replaceable, siblings aren’t.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 237,
          "content": ">”It’s her wedding. She can ask whoever she likes.”\n\nThis. It’s none of OP’s business. Beth can ask a man off the street if she so pleases.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3262,
      "content": "YTA- and this has literally NOTHING to do with you, butt out",
      "id": 57,
      "comments": [
        {
          "score": 34,
          "content": "Fr. I tend to think \"why do brides need everything so perfect? Ridiculous.\" When they're screaming about the color of the flowers or if someone ends up in one of their thousand pictures.\n\n*This* is probably the most meaningful and sentimental piece of a wedding. Transitioning from your family to your new family of your own...how dare the SIL think she has the right to intervene??? Dear, Lord. I bet the creator of this tradition is in shock with OP's stance and gall. I bet the in Law family is disgusted rn.",
          "id": 58,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3236,
      "content": "YTA. Regardless SIL has good relationship with father or not, she has to right to choose who ll walk her on her wedding day! It can be her father, mother, brother, friend or any other person she trusts and wants! \n\n#This is NOT your wedding and you have no say who bride choose to walk her down. \n\nAnd since has nothing to do to you stay out of relationship between brother and sister!!\n\nYTA!",
      "id": 59,
      "comments": [
        {
          "score": 357,
          "content": "I'd also expect that it is a great honour just being asked to escort the bride down the aisle. Its only reserved for people who mean a great deal to the bride herself.\n\nOp, get over yourself because you're the AH here.",
          "id": 60,
          "comments": [
            {
              "score": 34,
              "content": "\"I'd also expect that it is a great honour just being asked to escort the bride down the aisle. Its only reserved for people who mean a great deal to the bride herself.\"\n\nAbsolutely! I agree 💯%",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2287,
      "content": "Why do the 3 of you need to come to a solution? This is between your husband and his sister and they are in agreement. This has nothing to do with you.",
      "id": 62,
      "comments": [
        {
          "score": 360,
          "content": "Absolutely,  I don't see how wifey thinks she gets a say?  This has 0% to do with her.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1786,
      "content": "Info: why are you jealous of your SIL and why does your husband taking an integral, supportive role in her wedding make you feel threatened? \n\nYTA, traditions are only important if the person in question values them. Even then, they tend to be meaningless. I’d invite you to look up the original tradition of having a father give away the bride, and even the original role of best man. It’s….dark. \n\nDo some deep introspection, determine what on earth is triggering you, take accountability for your own actions/emotions, and then apologize to them both. You may be able to fix both the conflict, and something within yourself, in the process.",
      "id": 64,
      "comments": [
        {
          "score": 477,
          "content": "She used one of the first sentences in this post to complain about how much time her husband spends with his sister. This is an issue she created out of resentment instead of being honest with herself about her insecurity and jealousy. YTA GET THERAPY",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 926,
      "content": "YTA. None of this is your business whatsoever. Your opinion does not matter AT ALL. You come across very judgmental and self-centered. \"I feel\". \"I think\". \"Our traditions\". Keep your opinion to yourself and your mouth shut.",
      "id": 66,
      "comments": [],
      "relation": "Attack"
    }
  ]
}