{
  "post content": "My brother was getting married, and it was a child-free wedding per future SIL's request. The wedding was out of state so my husband and I were going to make it into a three-day weekend. We had a sitter lined up months ago. The day before we were set to leave she had to cancel for a family emergency. We tried to find a last-minute sitter that we trusted and could also do just overnight but came up empty. I tried calling and texting my brother about the situation but couldn't get hold of him. We were both in the wedding party and I didn't want to leave my brother and his soon-to-be-wife in a bind. So I called my mother after that since I knew she was with them. I explained the situation and she said she'd call me back after talking to him.\n\nFour hours pass and we didn't hear back. We had to make a decision, and since we are currently sharing one vehicle couldn't really leave my husband and kid without a vehicle, and had put a lot of money already into the wedding and trip, we just took our baby with us. We got there later than we originally planned and just went to our room. The next afternoon was the wedding, and my husband and I planned to swap time out- I'd go the ceremony and part of the reception while he stayed with the baby, and he could attend the second half the reception while I stayed with the baby. When the ceremony was over and we were heading inside to the reception, my husband had the baby inside in her stroller. I joined my husband and went to say hello to some family members, and went with him to congratulate my brother and new SIL. Husband said his hellos and congrats, then went back to our room with our child.\n\nI left the reception area a few times to bring my husband some small plates of food so he didn't have to wait for his turn to eat. On one of my trips back my brother spoke with me about it being a child-free wedding and his wife was upset that my husband had the baby in the lobby and that I kept leaving the reception. I told him they can't be too upset because we didn't bring the baby into the wedding area or the reception. The rest of the time I was at the reception I kept getting comments from who I'm guessing were SIL's family and her bridesmaids about how I was trying to steal her thunder by having my baby there. SIL kept asking why I didn't just leave them at home and would not accept my reason for not doing so.\n\nIt's been a sore spot for my family and her all weekend. Am I an A-hole for bringing the baby with us?\n\nInfo: The wedding ceremony itself was outside in a courtyard, it was not in a closed-off area. We had to go through the lobby area to get to the reception hall. My husband was in the lobby walking with the baby and getting coffee from the hotel shop.",
  "id": 1,
  "comments": [
    {
      "score": 15553,
      "content": "NTA\n\nShort of abandoning your child, **WTF else were you supposed to do?!?!?**",
      "id": 2,
      "comments": [
        {
          "score": 3994,
          "content": "Would have loved to hear SIL's recommendation. Likely requiring duct tape. NTA",
          "id": 3,
          "comments": [
            {
              "score": 1002,
              "content": "Wait…you don’t use duct tape on your kids?!",
              "id": 4,
              "comments": [
                {
                  "score": 646,
                  "content": "Yeah it's excellent for securing them to the wall.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 371,
                      "content": "Behind the wallpaper right? Or am I doing it wrong?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 101,
                      "content": "Really? I use Gorilla tape. Duct only holds them for about 2 hours on a good day.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "But is it organic duct tape?!",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "[removed]",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "That might not be legal anymore",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "there are pictures of that on the internet actually.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Works for siblings too",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Velcro works too",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 148,
                  "content": "My mom always said that “silence is golden, but duct tape is silver”. Didn’t work, we were a pretty wild bunch lol.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 63,
                      "content": "She didnt use enough duct tape.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "Well, fun story, my dad duct taped my feet to the pedals of a tricycle when I was little because I would just scoot along.. my mom wasn't home, otherwise he wouldn't have done it.  Neighbor tried it with his kid but his wife was home..",
                  "id": 18,
                  "comments": [
                    {
                      "score": 57,
                      "content": "I am the mom and am now contemplating doing this to my kids with their bicycles since they just cannot seem to grasp the concept of keeping their feet on the pedal while pedaling.... teaching them to ride a bike in my mind was going to be this great, fun, easy bonding experience. It very much was not 🤣",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 33,
                  "content": "Not any more. They are out of college now.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Gorilla tape?",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": ">Not any more. They are out of college now.\n\nNot any more. They are out of the house now.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "Silence is golden. Duct tape is silver.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Gotta keep those diapers on somehow.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "[removed]",
                  "id": 25,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Seriously. Mine was child-free and my MOH ended up giving birth exactly 2 months before. Her mother and MIL took care of the child in the hotel room upstairs, we provided them food, and my MOH would run upstairs to check on the baby during parts of the reception where she wasn't needed (and before the wedding started while I was getting my final touches done) and no one cared at all, especially not me! Of course we were going to accommodate her and the childcare she needed at the wedding!",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Calm down there, Casey Anthony",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I would have sooner tried it on the SIL.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 343,
              "content": "I wonder if SIL thinks a baby is like a cat that you can leave a few bowls of food out and a litter box and it’ll be fine. But for real NTA. OP and husband did the best they could in a shit situation to honor their obligations and ya know, not abandon their child.",
              "id": 29,
              "comments": [
                {
                  "score": 85,
                  "content": "Making a big assumption that SIL thinks about anybody but herself.\n\nNTA.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Well my kids never got the handle of a litter",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If they eat it and poop it out, does it still count as effective?",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": ">why I didn't just leave them at home\n\nSIL gave her recommendation that husband should have stayed at home with the baby.",
              "id": 33,
              "comments": [
                {
                  "score": 263,
                  "content": "I feel like that's the recommendation she gave because she was angry at this situation, but if the husband didn't show up and he was in the wedding party, she would have probably gotten upset that he bailed at the last minute. There wasn't a solution, but SIL wanted to get angry anyway.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 741,
                      "content": "SIL’s preference ends at “baby not in the same room as the wedding.” She doesn’t have any agency over the hotel, the lobby, the city, the tri-state area. She didn’t want the baby at the wedding, the baby wasn’t at the wedding.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "It's also Monday morning quarterbacking. OP had to make a decision without input because no one called them back.\nSIL's chance to have input was when the cry went out to mom.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "Too hard on the environment, we just hang them on a nail./S. NTA",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "It's a baby cage! It's a good one too. When I was a kid, mine didn't have these windows. It's perfect. If you want to go out to dinner, there's ...",
              "id": 38,
              "comments": [
                {
                  "score": 4,
                  "content": "Kudos for the Scrubs reference 🤣🤣🤣",
                  "id": 39,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Mom, baby cage, play pen, are not the same thing.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You just throw some cedar chips in there so the baby can poop... and bingo bango!",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 800,
          "content": "I can’t imagine handling the situation any better then she did. OP you were amazing and gracious and I’m so sorry that you are going to have so many future holidays and get togethers with your SIL😂😂 Prayers up for you.\n\nNTA",
          "id": 42,
          "comments": [
            {
              "score": 239,
              "content": "Like, they did everything they could to show at the wedding, AND everything they could to take care of thier kid, despite dealing with poor communication and a shit situation.\n\nJust doing thier best to be good parents *and* good relatives.\n\nWho could fault them?",
              "id": 43,
              "comments": [
                {
                  "score": 68,
                  "content": "Bridezilla apparently",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Exactly this seems like the most sensible solution to the very common child free wedding stress posts on here, OP you did nothing wrong NTA",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The worst thing is that people like SIL are also usually the fussiest, most precious PITA parents if they go on to have kids. \n\nI would be unsurprised if SIL is completely unbending now, and then in six years insists that every single event ever, even when her family are not present, be organised around her children who have a list of very specific rules that will apply to everyone who happens to be present.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm all for childfree weddings if that's what the couple wants, but this is an exception.  \nAt some stage you need to consider the fact that babysitters fall through, shit happens, and plans fall apart.   \nThere were only two options, pull out of the wedding entirely, waste a lot of money they probably didn't have, or do what they did here. They respected their wishes of a childfree wedding and did the best they could given the situation.   \nIf it were me, as long as the reception wasn't too wild, I would say F it and let them join in and have fun instead of have to worry and be apart the whole time. I don't think one baby is going to effect the atmosphere much. \n\nIt's an issue that would only bother you if you let it.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 546,
          "content": "NTA She and her husband did everything  they could to accommodate the brother and his bridezilla. The bride acted like the baby was in the front row of the ceremony crying their eyes out. To be annoyed that they were in the lobby, it’s ridiculous. And being jealous of a baby 🙄. And I love that the bride thinks finding child care last minute when most child care options are probably at her wedding. My goodness family functions will be interesting with this SIL.",
          "id": 48,
          "comments": [
            {
              "score": 143,
              "content": "The lobby of a PUBLIC hotel nonetheless!! She’s lucky she didn’t have 3 dogs, a group of tourists, and a homeless dude wander through!!",
              "id": 49,
              "comments": [
                {
                  "score": 69,
                  "content": "A friend of mine got married on a public beach and a little boy who was about 4 years old wandered over to watch and ended up standing next to the bridesmaids - so a bunch of the pictures of the ceremony  have a random little boy in a red speedo in them. The bride thought it was hysterical and loves those pictures.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I would think it's hysterical, too, if that happened to me. I would think it's cute and hilarious!\n\nI think you also left out the word beach. 😂",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "A photographer on /r/weddingshaming (inthink) in Dubai shared a story of a beach resort wedding she photographed with a topleas Italian lady with enormous fake boobs who came wondering up to watch the couple exchange vows... just standing tits out, watching right behind the priest. Lol. She was asked to cover up at least or something and so she.. crossed her arms. Fair amount of photoshop involved to get her out of the pictures - and a red faced officiant in half the pictures probably once he noticed her",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Were you at MY wedding???????\n\nThe setup crew had to move the sleeping homeless guy so they  set up the cake table.  But we felt bad so we left him some extra cupcakes for later.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Something tells me they'll get their karma one day if they have their own kids. NTA.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "But she will also be the most entitled mother when her own kid comes along, everyone will have to bow to her and her precious spawn's whims",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "She could have just put baby in a corner.  \n\n  \nSeriously, though, NTA.",
          "id": 56,
          "comments": [
            {
              "score": 305,
              "content": ">She could have just put baby in a corner.\n\nNobody puts baby in the corner...",
              "id": 57,
              "comments": [
                {
                  "score": 72,
                  "content": "Unexpected Dirty Dancing reference for the win!",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "So annoyed you did this before I could",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "😂😂😂",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 335,
          "content": "Imagine being threatened by a baby. A baby who happens to be either your husband’s niece or nephew. Never leave the child alone in the same room with her!",
          "id": 61,
          "comments": [
            {
              "score": 115,
              "content": ">Imagine being threatened by a baby.\n\nImagining it now.\n\nWHO GAVE IT A KNIFE",
              "id": 62,
              "comments": [
                {
                  "score": 32,
                  "content": "I thought that was just proper parenting. Teach it self defense young.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Gaga SLASH…",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "\"Like taking candy from a baby.  He was in the ICU for two weeks after, but did get the candy.\"",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Great. Now I can’t stop thinking about Pet Cemetery right before bed.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Now all I can think of is that vine where the mom ask 'what do you have?' and this devil of a 4 year old joyously replies 'A knife!' and the mom yells 'NO!'.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 82,
              "content": "A child that is now her niece or nephew.",
              "id": 68,
              "comments": [
                {
                  "score": 29,
                  "content": "probably the type to call the kid her 'niece/nephew-in-law' lol",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 51,
              "content": "I’d wait until the kid was an adult and say “you probably don’t remember this but Auntie Awful didn’t want you at her wedding and was annoyed that you were even in the building.”",
              "id": 70,
              "comments": [
                {
                  "score": 3,
                  "content": "Hopefully Ex Auntie Awful. Her brother needs to get this annulled stat.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 190,
          "content": "[deleted]",
          "id": 72,
          "comments": [
            {
              "score": 57,
              "content": "My toddler built a working triple expansion steam turbine, UP YOUR PARENTING GAME!",
              "id": 73,
              "comments": [
                {
                  "score": 48,
                  "content": "[deleted]",
                  "id": 74,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This, as my actual 3 yr old, is singing as loudly as possible in the other room in an unintelligible language that very closely resembles gibberish. PS she just gave herself a round of applause.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "And if they’re not, they should temporarily spontaneously combust and then conveniently and correctly piece themselves back together when bridezilla is ready to acknowledge their existence.\n\nI’d apologize for wasting all that money going to their wedding, NTA",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "When I was in preschool, one of my toddler friends made fresh pasta from scratch for a dinner party for his parents.\n\n... this is actually true.",
              "id": 77,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 114,
          "content": "It seems that the SIL did want her to abandon her child since she asked why she didn't just leave the baby at home, like wth",
          "id": 78,
          "comments": [
            {
              "score": 6,
              "content": "i think it was reffered to as why she didnt left husbamd and baby at home. not just the baby. because the comments were made towards op keep leaving to give husband plates of food.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "NTA. It was that kind of emergency cancellation. It’s not as if you didn’t make arrangements and still tried to keep up.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "The SIL would have said something like, \"I'm sure you could have found someone else if you really tried\" despite there being no one else.  NTA.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Arguably either not attend the wedding or have their spouse not attend and leave the baby home. I think OP acted reasonably here, but if their brother preferred an alternative, I think that would have been it. Not just simply giving them up for adoption or something.",
          "id": 82,
          "comments": [
            {
              "score": 117,
              "content": "I mean the brother could've bothered to answer if he preferred an alternative then.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "*to be read in the G.I. Joe mock psa voice*\n\nLeave that baby at the fire station, and PRIORATISE MAH MATRIMONY!!!",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5865,
      "content": "NTA, excited to hear what magical solutions everyone had on offer. You were in the wedding party, you had a solid plan for everything, you showed up and did an amazing job under those circumstances.",
      "id": 85,
      "comments": [
        {
          "score": 3607,
          "content": "The magical solutions were 1) Leave my husband without a car while he was home with our baby 2) Leave our child with a babysitter we didn't know for more than one night 3) My husband languished in the hotel room for hours without eating before he could go downstairs to the reception (hell to the no on roomservice prices) and 4) Whoever was watching the baby just stay in the room.",
          "id": 86,
          "comments": [
            {
              "score": 3593,
              "content": "You forgot the solution where someone actually got back to you in a timely manner about you losing your sitter.\n\nNTA",
              "id": 87,
              "comments": [
                {
                  "score": 1017,
                  "content": "What!?? Why couldn’t they just leave the baby back at home-home? Why did baby even need to come anywhere in the vicinity of a bride who insisted on a child-free wedding?? Babies are fine for a day or two without food and any other help, right!??? \n\nNot seeing the problem here\n\n(/s for anyone who’s not caffeinated for humor yet)",
                  "id": 88,
                  "comments": [
                    {
                      "score": 571,
                      "content": "If the baby's old enough to sit up, they can learn how to use a can opener. /s",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 106,
                      "content": "Exactly! I leave my cats alone for a weekend and they survive. Surely a baby isn't much different? Just strap on a fresh diaper and leave some food nearby. Kid will be fine.\n\n/s",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Exactly. They could have just had a neighbourhood kid come over to water the baby once a day.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "And the baby will be the *that* baby of \"baby's day out\"",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Agreed! I do it with my cats all the time! Just leave a pile of dry food out and idk put on a few layers of diapers and they’ll be fine! Stop coddling your kids and make them learn some life skills! \n\n/s",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I mean, we leave our cats home alone all the time! Just put out extra food, fill the bathtub with some water, and make sure the litter boxes are clean! Is it really any different for babies?",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Babies are like cats. You just leave out some food and water and they’re fine. OP is overreacting /s",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Or the solution where this baby - an actual human being member of the family - was allow to be at the wedding.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">You forgot the solution where someone actually got back to you in a timely manner about you losing your sitter.\n\nDid anyone ever follow up at all? OP left it out of the story, but it sounds like everyone just sort of ignored OP until she showed up to the wedding.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 393,
              "content": "If she can’t trust herself to be more interesting than a baby at her own wedding, then she deserved for her thunder to be stolen.",
              "id": 98,
              "comments": [
                {
                  "score": 75,
                  "content": "Right? It's not like the baby came out tap dancing and doing back flips! It was just hanging out in it's stroller, if that's so interesting SIL must be as fun as watching paint dry.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "And the baby wasn’t even at the wedding. The baby was in the lobby in the same hotel as the wedding but not in the reception or ceremony area. I’d bet there were other children somewhere in the hotel too. Banning children from the same building is not what is meant by a “child free wedding.” A child free wedding is fine. And the bride DID have a child free wedding. The baby never went to the ceremony or reception. OP and her husband did the best they could with the circumstances they had. They didn’t anticipate an emergency so they made adjustments to still respect the child free request. Bride is ridiculous as is anyone complaining. OP followed the rules.\n\nNTA",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "This post is an example of 2 parents doing their absolute best under the circumstances to both support the married couple and meet their responsibilities as parents.  \n\nProbably no one would have paid much attention to your arrangement if the Bride hadn't been hyper focused on you for no reason whatsoever.  NTA",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 145,
              "content": "THE BABY NOT BEING ALLOWED IN PUBLIC PARTS OF THE HOTEL IS COMICALLY INSANE.",
              "id": 102,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly!  The wedding was at a hotel.   Did they tell all the other patrons with kids there to stay in their rooms during the wedding too?!",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "Your brother and his wife must be incredibly wealthy to have rented out the entire hotel including the lobby.  Or they're just assholes.  Probably the latter.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "Or even not attending the wedding at all!\n\nI admit I see a lot of posts in AITA about people who think that child free rules at events don’t apply to them.  Not the case here.  You did the best you could do with a tough situation that by all accounts, worked.  Was it optimal?  Maybe not, but did they not realize that this was the only way to even have you there?\n\nNTA.  In the slightest.",
              "id": 105,
              "comments": [
                {
                  "score": 164,
                  "content": "Not attending at all wasn't completely on the table- we had to buy our dress and suit. Bought tickets to a show and had a paid reservation. Even if we had skipped the wedding, we still would've been in the hotel due to the rest of the money we had tied up in what was meant to be an extended weekend. At least we learned she reaaalllyyy loves yakisoba lol",
                  "id": 106,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Understandable.  I mostly meant what I said as a hypothetical point to illustrate that you all did everything you could to attend, and that the only real alternative was not even going.  They could have had this adapted version of your attendance or nothing at all.  You and your husband bent over backwards to get there, and I’d hope that they’d show you nothing but gratitude for your efforts.  That’s how I would’ve seen it if I had been the groom.\n\nEdit: spelling, and to say that yakisoba is amazing!",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "NTA, but you said you were both in the wedding party, right? how did that work exactly?",
              "id": 108,
              "comments": [
                {
                  "score": 258,
                  "content": "My husband had to skip the ceremony and SIL was salty about that too. We were hoping him going to some of the reception he'd still be able to somewhat be in a supporting role as a groomsmen.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 204,
                      "content": "So there was no right way to do this other than going back in time and not having your kid.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 190,
                      "content": "She suggested him staying home with the baby but was salty he didn't come to the ceremony? How is that logical?",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "Your SIL sounds super unreasonable. I mean, short of child neglect and abandonment (generally not super recommended) you guys did the best you could do.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "This is ridiculous.If one of the wedding party had shown up to my wedding with a baby because of a situation like this, I would have been completely understanding. This was family, someone could have held the baby for a short while (if you were okay with it) while your husband was a groomsman. SIL sounds like a real fucking treat and I feel bad for your brother. Has she been like this before the wedding? Like how was your relationship previously?",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Sounds like they're annoyed by the situation and taking it out on you. Such poor people with such lack of self awareness.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "NTA hun. Sit back and relax. Your brother is in for one hell of a rocky marriage with someone like that.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "NTA, but I will say, I personally would have enjoyed option 3. I would have ordered some take out beforehand and languished the hell out of that room. Hanging out in the lobby with a baby sounds awful. But again, that’s just a personal preference based on my own interests, not a judgment on anything you or your husband should have done instead.",
              "id": 116,
              "comments": [
                {
                  "score": 41,
                  "content": "Babies love novelty, most likely the baby was going stir crazy in the room, so the husband put baby in the stroller for a walk (and to get himself coffee), because baby would immediately calm down that way.\n\nDepending on the age, many babies will stare at passing objects , quietly, for a decent amount of time.  Walking them can be the best way to get some quiet as a parent.  Also often puts them to sleep.\n\nIt sounds like they were in the hotel all morning, did the walk around the lobby for a bit, then went back to the room.  Most of the day they were in the room, bride is annoyed their walk just happened to coincide with the period transition period between the ceremony and reception when people were casually milling about.\n\nIt doesn't sound like the husband spent the whole day standing around in the lobby.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 10,
                      "content": "This. A child starts climbing the walls after about an hour, in my experience. (Literally, if they’re old enough.) The husband probably tried to vary the surroundings every now and then, and just happened to be in the lobby the same moment the wedding party was passing through.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My toddler now communicates when she's getting stir crazy. It's kinda cute -- she grabs our shoes and brings them to us and says, \"bye bye\". Less cute when spouse and I don't want to go anywhere.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I’d like to point out option 5: Ghost them.\n\nI get that weddings are stressful, but if you can’t answer a call from someone in your own bridal party, why are they even in your bridal party? Clearly there’re not actually that important to you.\n\nYour sacrifice might not have been noticed by your SIL, but we here on the internet do. NTA",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "So what about other people with babies in the same building. Were they also not allowed to leave their room because of the child free wedding?",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3446,
      "content": "[removed]",
      "id": 122,
      "comments": [
        {
          "score": 711,
          "content": ">trying to steal her thunder by having my baby \n\nIt's a baby... They are trying to make it seem like two parents who don't want to abandon their baby or let down their family want to \"upstage\" the bride.\n\nI'm kind of sick of child free weddings like this. It just kind of seems like another way to shame parents and treat your \"loved\" ones like little puppets for your \"big day.\"\n\nYou can't make parents put your wedding as their #1 priority... All of this judgement from them shows just how little love there was at that wedding.\n\nNTA",
          "id": 123,
          "comments": [
            {
              "score": 175,
              "content": "Also, who cares about a baby? You go out anywhere in the world and you see them. What? Like shes pregant and goes to the grocery store and yells at other customers for bringing their babies there? GTFO.",
              "id": 124,
              "comments": [
                {
                  "score": 55,
                  "content": "This is how I feel about it. So what, it's a baby. I see them all the time. I even used to be one.",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "This too. Like tbh.. child free weddings are more about not having your 3 year old come up and smash the cake. wtf is a baby gonna do? the worst is cry, to which they’re usually taken away into a bathroom or something anyways?",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "Child free weddings are totally fine. But many people who attend them with children end up doing something very similar to what OP did. What I find so strange is the idea that the baby was stealing the bride’s thunder. People don’t want kids at the wedding because they can be annoying if you just want to party. I’ve been to weddings where there were lots of kids and it’s an entirely different vibe. Which is fine, if that’s what the couple wants but I’ve never heard it being about stealing anyone’s thunder ffs.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "Yeah I agree. I used to think \"it's their wedding so whatever\" but after seeing so many of these posts I've started to change my tune. \n\nWent to a friend's wedding and there were children and babies there. Still managed to have enough fun that my boyfriend had to pull over on the interstate the next day so I could hurl. \n\nThe parents with a baby just took their baby aside if it started crying and they left early. The kids danced harder than I did. I'm not a kid person but they were cute and not disruptive at all. Idk why people get so pressed about it.",
              "id": 128,
              "comments": [
                {
                  "score": 34,
                  "content": "The kids danced harder than I did. \n\nWe went to a childfree-ish family wedding recently (more limited kids than no kids) \n\nAnyway, my kids tore it up on the dance floor.\nA family member made it sound like they were basically crowd surfing at one point (I didn't see it--I probably would have intervene if I had, because I am obviously not as cool as my kids).\n\nI think if it's all parents with kids, it can change the vibe.  But take a few kids get them hopped up on soda and cake and play literally anything and you've got yourself a dance party.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "yes absolutely agree. I allowed kids at my wedding as the majority of both mine and my partner’s cousins had youngsters ranging 4-15 (and a friend with a teeny 4mo who reasonably only stayed for the ceremony and dinner) and you know - the kids/now adults STILL talk about how much fun they had at our wedding - it’ll be 8 years for us in Sept this year.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yup, same here. The kids really got the party started at the last wedding I went to. There's something really captivating about little kids just unabashedly dancing.\nI find the drunk adults more disruptive than the kids.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "100%. No one is entitled to an invitation to a wedding, including a child, but I feel like the rise of child-free weddings is a symptom of the fact that many weddings are now all about the pictures and aesthetic rather than actually wanting to celebrate with your friends and family. There may not be space for every kid but I honestly cannot understand excluding your own niece or nephew because you need more attention!",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I had a child-free wedding. One couple's boy sitter got super sick the night before. I told them to bring her and have fun. I didn't want them to miss out and guess what! I didn't even realize there was a child there until I personally sought them out to say thank you for coming. She was so well behaved - a bit dazed by the amount of people 😆 but at the end of the day, I don't mind making exceptions as long as people aren't jerks and we all can come to reasonable arrangements.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Right. I thought the point of child free is so the adults can have fun and let loose without worrying about watching kids the whole night and so the party doesn’t have any tantrums. How is a baby in the lobby ruining a reception? Bride needs to get a grip.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I agree, where is the compassion? I mean, I kind of like child-free weddings, but I feel like what they’re shaming her for is a stretch. Upstaging the bride by… not having the baby at the wedding??? It’s not like she brought the baby into the ceremony OR the reception. She still performed all her bridesmaid duties. Like how insecure is this bride that she feels upstaged by a baby existing in the same hotel as her wedding? \n\nOP had a plan but emergencies happen. Would they have preferred her to drop out of the bridal party at the last minute? Because that seems like the only other option since there were no other trusted sitters and they both need their only mode of transportation . \n\nGood parents will always put their children first. OP and her husband made some solid compromises that catered to her brother and SIL *and* kept their baby safe. SIL is out of her mind if she thought she had top priority over an infant. Plus I hardly believe anyone else at the wedding cared if there was a baby OUTSIDE. Unless the guests were the Sanderson sisters and they can smell children.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Mine was full of babies and kids, it was wholesome. I wanted my friends and family there, having a child free wedding would have prevented half the people to show up.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "I wonder if the bride freaked out at the sight of other babies in the lobby.",
          "id": 137,
          "comments": [
            {
              "score": 68,
              "content": "Probably.\n\nThere were babies in the area of ***her*** wedding! The attention is supposed to be on her! Not the random people staying at the hotel walking through the lobby with their babies and other small children. WORST distraction ever! \n\n(/s, in case it wasn't clear.)",
              "id": 138,
              "comments": [
                {
                  "score": 54,
                  "content": "Babies at the resort! In the same town! What if other weddings were happening at the same resort? She better get a refund.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 11,
                      "content": "On the same day! Time for handbags in the car park, and let the worst Bridezilla win...",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "See, you joke, but something similar happened to me last summer.  We were at a friends' wedding, and there was another wedding reception in the other ballroom.   That wedding was \"child free\" and the bride tried to get the hotel to kick the kids from my friends' wedding out of the hotel.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 35,
                      "content": "I can't imagine being that full of yourself or stuck up your own ass that you think kids shouldn't even be in the same hotel as your wedding reception. But part of that might be that I like kids.\n\nI'm sorry you and your friends had to deal with that first hand and hope everything was fine in the end.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Who are these people??!!!",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It's unfortunate there wasn't a baby convention going on in another part of the hotel at the same time.",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 32,
          "content": "Bahaha best quip",
          "id": 145,
          "comments": [
            {
              "score": 18,
              "content": "Love it!\n\n\"Ohhh, *you* want to be the *only* baby at this wedding!\"",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "everyone knows lobby babies are the biggest threat to brides.",
          "id": 147,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "NTA,\n\nThe bridemaids were all ready to help her with her tantrum since they were already convinced OP would want to steal the thunder.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Like would she have been mad at some strangers staying in the hotel spending time in the lobby with their cute baby? People get excited about them in public it's like getting mad a people noticing s cute puppy lol",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "“She wanted to be the only baby there.”\n\nThis is gold. 🤣🤣",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "It's honestly my first time encountering this reason for deciding a child-free wedding. Usually it's so there would be no disruptions especially during ceremony, so adults could have a fun evening w/o kids, or for budgetary reasons. This bride has some serious issues if she's do insecure about a baby.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Right I thought child free weddings was so the service isn’t disrupted. There HAD to be other children staying in the resort building??? Not where the actual wedding was happening",
          "id": 152,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Child free weddings are like destination weddings, you have to accept that this will mean some people will not be able to make it. The amount of brides on here losing their s*** because people who couldn’t get baby sitters or afford the trip decline the invite is astonishing. Like, they’re not going to sell their baby to be able to afford your nuptials in Dubai. Get over yourself.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1160,
      "content": "NTA - you and your husband did all you could to respect the child-free wedding, while also dealing with an unexpected sitter cancellation. You tried to reach out to someone in advance of the wedding and did everything you could to not have the baby be the center of attention. \n\nThe only piece that maybe stands out is the \"left the reception area a few times\" but without knowing what kind of setup that was or how you left,  it doesn't change my opinion.",
      "id": 154,
      "comments": [
        {
          "score": 662,
          "content": "I've never been at a wedding reception that was basically a lockdown situation. Going outside, for a short walk/fresh air/cigarette, isn't discourteous.",
          "id": 155,
          "comments": [
            {
              "score": 147,
              "content": "There's a South American country (sorry but I truly don't remember which - maybe Brazil?) where it's a whole *thing* that no one leaves before the bride leaves\n\nOne of my best friends lost a friendship over this as she didn't realize + got a migraine and absolutely had to go home, with profuse apologies. Bride was having none of it and never spoke to her again.\n\n(I assume most people from this country would not be jerks about it in a migraine situation, just pointing out this is a big deal for some cultures.)",
              "id": 156,
              "comments": [
                {
                  "score": 77,
                  "content": "I am Brazilian and never heard of this rule. Definitely not an issue in any wedding I have been to. And considering I have literally close to 100 cousins, there were many.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'm definitely remembering the country wrong. It's been a while. Looking it up online & it might be Venezuela?",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "> Bride was having none of it and never spoke to her again.\n\noh no.... anyway.\n\n I'm sure she spent the rest of her life happy with people who don't follow random traditions as if their lifes depend on it.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "Well these days, being invited to “celebrate” someone’s “special day” is akin to signing over your life for the year.\n\nYou must dance to their tune for the special day.\n\nYou must look part of the aesthetic down to your toe nails\n\nYou must not get pregnant that year.\n\nYou must not get engaged that year.\n\nNo one is permitted to die that year.\n\nWhich is cool because that takes care of no one being allowed to grieve that year.",
              "id": 160,
              "comments": [
                {
                  "score": 26,
                  "content": "It's not even these days! 12 years ago we were invited to the wedding of one of my husband's coworkers. Not super close, we hung out at work events, but that's about it. The day before their wedding (what was our 5 year wedding anniversary), we announced my pregnancy on Facebook. We had very few overlapping friends, and the few we had would have noticed something was off with me at the wedding (I had really bad morning sickness that got worse as the day went on, so my dinnertime I was miserable. Even so, I truly did not think about their wedding when it came to our announcement, but the bride was so angry with me. She would bring it up at every with Christmas party for years. So excessive.",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "And if you tried that, I suspect there’d be more than a few people fighting to leave for a few minutes.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "That's the same thing that would happen for people to smoke and go to the bathroom. It's a reception, not a hostage situation.",
          "id": 163,
          "comments": [
            {
              "score": 43,
              "content": "You might be mistaken. This sounds like it was close to hostage situation :/",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "I can’t believe how hyper focused she was on OP’s movements. I have no idea who popped in and out of my reception: I was focused on celebrating with my new husband! Even if I looked for someone and couldn’t find them at that moment, I would assume they were going to the bathroom or something. \n\nThe point of childfree weddings is supposed to be eliminating distractions so you can enjoy your day. It is not the point to become a middle school hall monitor hyper focused on making sure everyone follows the rules to an exacting standard.",
          "id": 165,
          "comments": [
            {
              "score": 3,
              "content": "Exactly! We only had 28 guests on our wedding reception (+1 baby) and I still could not have told you who stayed the entire reception, who left early, whatever… (I especially couldn’t tell you any details now, 5-10 years later. No, I do not remember which year I got married. 😆)",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "[deleted]",
          "id": 167,
          "comments": [
            {
              "score": 12,
              "content": "That bride is so weird! I've been a bridesmaid a few times and mostly we were free to do what we wanted after/in between our agreed tasks/duties.",
              "id": 168,
              "comments": [
                {
                  "score": 9,
                  "content": "Yes! I’ve never been to a wedding where the bride and groom weren’t totally bombarded by people and lights and responsibilities all night long.. they’d never notice one person wandering off from time to time.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 996,
      "content": ">On one of my trips back my brother spoke with me about it being a child-free wedding and his wife was upset that my husband had the baby in the lobby and that I kept leaving the reception. \n\nWow, that's next level control issues, lol. Did she also try to ban all babies from the hotel?\n\nYou are NTA here - you managed a very difficult situation while still respecting the requirements of your brother's wedding.  Did his new wife plan on you being by her side every single second? That's not realistic or practical. You (and your husband) did a really excellent job. :)\n\n> SIL kept asking why I didn't just leave them at home and would not accept my reason for not doing so.\n\nThere's the AH, right there.",
      "id": 170,
      "comments": [
        {
          "score": 775,
          "content": "Gods I wanted to bring that up to them so badly lol What's the difference in other guests' kids being around the lobby and pool and my baby?",
          "id": 171,
          "comments": [
            {
              "score": 186,
              "content": "It's amazing how logic ceases to function in people like this, lol.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Don't you know...if your family commented on your baby's cuteness, they would use up all their admiration ability and would have none left to fawn at bride? \n\nHer princess party was ruined! /s\n\nMy 16 month old niece ( as adorable as they come) was at my wedding. I didn't care. I was just happy to be married to my love...",
              "id": 173,
              "comments": [
                {
                  "score": 12,
                  "content": "We had tons of kids at my wedding. It was a blast. While planning, my dad asked me if kids were allowed (there are quite a few among the family now, so it was going to be a big burden if people couldn’t bring them) and I honestly didn’t even know what he was talking about. I had no idea child free weddings were a thing. I’ve literally never heard of them before Reddit.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 5,
                      "content": "OMG same... I heard the term for the first time after coming to reddit..in my Country there's literally no concept of \"child free wedding\" irrespective of religion..",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 63,
              "content": "You made the best of a difficult situation. Plus no one called you back so you had to do what you felt was best. NTA",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "They didn't respond to you at all, then thought you would just abandon your family? Lol. \nWhere are your parents on this I mean it's not as if you didn't try to reach them.",
              "id": 177,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I was wondering if they rented the entire place and banned all babies because of the child free wedding.\n\nYour SIL is definitely the AH here and you did nothing wrong.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also the \"baby\" in question is their niece/nephew. Not some random kid... sheesh.",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Right??? You didn’t rent out the whole hotel, chica. You don’t get to control who is in the lobby or rooms.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 516,
      "content": ">SIL kept asking why I didn't just leave them at home\n\nBecause he's a baby. \n\nNTA You didn't bring the baby to the wedding. You were respectful and accommodating. Sometimes things don't work out perfectly.",
      "id": 181,
      "comments": [
        {
          "score": 155,
          "content": "\"Dear Reddit, I want to know AITA. I recently had a childfree wedding. My SIL's babysitter fell through at the last minute. They tried to reach us to ask us how we'd like them to handle this, but somehow we didn't get their message.\n\nThey left the baby at home alone to attend our wedding. When they got home, they found that the baby had scribbled on the walls, cut off chunks of the dog's hair, driven their car and wrecked it, built a meth lab in the nursery...Now my SIL and our whole family are mad at me because of what happened when they left their baby at home alone. AITA? Signed, the Bride\"\n\nOP, NTA!",
          "id": 182,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "Leaving a baby at home can get you arrested. And that's the best case scenario where someone realises that there's an abandoned baby.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 357,
      "content": "Info: did your brother rent out the entire hotel??\n\nI’m guessing not. I’m also guessing he couldn’t exactly ban other resort guests’ kids from the lobby. \n\nNTA. Your brother still had his child-free wedding. (He just couldn’t demand a child-free resort.)",
      "id": 184,
      "comments": [
        {
          "score": 45,
          "content": "Yeah, as someone who hates being around children, especially infants, this is about the best outcome from the cards dealt.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Right? Imagine getting angry at somebody because their baby is in a completely different room while a wedding is happening.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 261,
      "content": "NTA\n\nThose childfree weddings have turned from \"please no screaming toddlers at the ceremony\" into \"if I have to acknowledge that people under 18 exist on my wedding day I'll throw a massive tantrum\". At this rate the bride and groom should exclude themselves from their own wedding because they're clearly too immature for an adult-only event.",
      "id": 187,
      "comments": [
        {
          "score": 47,
          "content": "Right? Imaging hating children that much that you throw a tantrum over spotting one in the hotel lobby. \n\nI'm childfree by choice but I don't get triggered by kids for existing.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly! It's no like OP actually made her baby seen, for Christs sake, her husband was getting a COFFEE, and had the baby with him. The fact that family recognized them and went to say hi is a given\nWhat did the bride want them to do??? Ignore all family??",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, I don’t get it. I want a child free wedding, sans my kids, because I KNOW my kids are capable of sitting still quietly for long periods of time, and well… because they’re mine. I don’t have that same guarantee for other children.     \n   \nBut if I had a guest in a situation like this, I wouldn’t turn them away or force them to stay in their room. They’d be free to bring them baby there.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Lmao remember that girl who was 22 and wanted to ban anyone under the age of 21, including her best friend? Pure insanity",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "Nta\n\n\nYou did what you needed to do. Unfortunately, it came down to bringing the baby and one of missing or not showing up at all.\n\n\nSil sounds insecure.  You respected their wishes. Didn't bring the baby into the wedding.\n\n\nChildcare does fall through on occasion.",
      "id": 192,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 161,
      "content": "NTA Your baby didn't go to the wedding or the reception. They had a childfree wedding just like they wanted.\n\nHer problem with your baby simply existing in the same hotel is a level of controlling that makes me pity your brother. \n\nYou tried working something out. They didn't get back to you.  You tried other avenues. They still didn't get back to you.",
      "id": 193,
      "comments": [],
      "relation": "Support"
    }
  ]
}