{
  "post content": "I'm getting absolutely chewed for this and I'm not sure if I made the right call here.\n\n&#x200B;\n\nThis morning I woke up and my pregnant girlfriend was laying in the shower because she had been puking for the past couple hours. This isn't entirely irregular at this point, but it really sucks and wrecks her day from the start. The water helps her nausea. I go in and check on her and go back to getting ready.\n\n&#x200B;\n\nQueue my roommate walking into my room and asked me to ask her to get out so he can shower for work. Thinking this is a reasonable request, I go ask.\n\n&#x200B;\n\nI am told \"I'm not getting out.\" and \"What does he do around here anyway?\"(I do almost all the cooking and cleaning in the house, so she isn't wrong, just in poor tact) Loudly and clear enough for my roommate to hear. At which point, I was appalled and leaned down and turned her head to me and made a face like \"Why are you doing this?\" Albeit I think I was a little forceful doing that, and I feel bad having done that to her.\n\n&#x200B;\n\n I asked her if she could just sacrifice 10 minutes so he can shower for work, and she says \"I make sacrifices.\" My roommate hears what shes saying and leans into the bathroom, the shower curtain is closed so my girlfriend is not in view, and tries to get involved in the conversation, saying \"I'm a part of this conversation.\" And i say that's not really fair. And my roommate pipes up and says, \"Well we work, so how is this fair.\" And my girlfriend yells for us to get the fuck out of the bathroom so she can get out.\n\n&#x200B;\n\nShe gets out, I leave for work quite quickly in the aftermath, already running late. This whole exchange occurred in a matter of 5-10 minutes of me waking up and I was not really within my faculties yet.\n\n&#x200B;\n\nSince then she went to her mothers, and has the majority of the following phone conversation (read: her talking, me silent) with her family in the room. I have been called a \"little ass boy who cant let his pregnant girlfriend shower\" and been told \"I'll be surprised if blood isn't pouring out my vagina.\" And now she is saying that she would have gotten out of the shower in 5-10 minutes, and I should've been a man and told my roommate that she would be out in 5-10 minutes (which I would have if I had known that was an option). That I moved her head with force and hurt her, which I think I was forceful and should not have done. And that \"this makes me wanna pack all the shit I even have in that house.\" She is also very angry at me for letting my roommate step into the bathroom while she was naked (In the shower, curtain closed) which he barged in, and under all circumstances I would not put up with, it just all happened very quickly.\n\n&#x200B;\n\nI also came to find out that my roommate didn't have to work as early as I did, after the fact, and this could have been much more avoidable.\n\n&#x200B;\n\nI love her very much and she isn't herself when she acts this way, by the way.\n\n&#x200B;\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 2008,
      "content": "ESH\n\nYou should have been a little bit more empathetic and explained to your housemate that your gf is unwell and the shower helps her, as well as asked him how soon he needed the shower. You also shouldn't have been forceful towards her and moved her head the way you did.\n\nYour housemate, while part of the conversation shouldn't have entered the bathroom without permission, if he wanted to be involved he should have knocked and asked. Also, knowing your gf is pregnant, should have been a little more empathetic, unless she'd been in the shower for an extended period by that time (e.g. half an hour or longer), in which case his request wasn't unreasonable.\n\nPregnancy and nausea aside, your gf needs to remember she doesn't have the monopoly on the shower or live alone. She also should have, upon being asked if she could get out, specified she would be out in 5-10 minutes. Giving attitude towards a reasonable question/request, and verbally attacking you and your housemate is not on.",
      "id": 2,
      "comments": [
        {
          "score": 545,
          "content": "Having dealt with a pregnant wife. I can comment the following:\n1) nausea isn't really something that gives you an idea of how long it's gonna be. 5-10 minutes might NOT have been enough, and it's not so easy to estimate\n2) people aren't the most tactful when they're in pain.\nI think we can give the pregnant gf some slack.",
          "id": 3,
          "comments": [
            {
              "score": 916,
              "content": "Disagree. Having sympathy for her while she is ill is reasonable. Giving her 5 minutes extra to recover is reasonable. Allowing her to totally monopolize the bathroom for an indefinite time while she insults and berates the roommate, who had no say in living with a pregnant person, I assume, is not acceptable. \n\nJust because she is pregnant, doesn't mean she can deny roommate use of the bathroom when he needs to go to work. It doesnt say how long he had been waiting already, he may also be an asshole in this situation if it was say, 5-10minutes before he barged in, but if he had been waiting 30 minutes or more I think its justified.",
              "id": 4,
              "comments": [
                {
                  "score": 123,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I think the vagina comment was essentially her trying to emasculate him, saying that he isn't a man because he wasn't defending her. I honestly read the bleeding vagina comment as that.\n\nThere is another way i could see it being interpreted as but it doesn't feel right. Essentially that hes acting with emotions and that she doesn't think he should be?? The whole women are more emotional on their periods, therefore bleeding vagina is a slap at him being frustrated with the situation.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "She’s been hospitalized for HG, a condition that can kill both the mother and the baby if it isn’t managed properly.  The vagina comment was her telling him that she wouldn’t be surprised if she miscarries. You know, with the classic Hollywood blood gushing down the legs imagery. I’m going to assume she told him that he was just a boy and not a man because he failed to protect both his child and the mother of his child from potential physical harm because he didn’t want to tell his creepy roommate to wait.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Tbh I thought she was threatening miscarriage.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I was ready to give her a pass until OP mentioned what she's been saying to him. Seriously, the vagina comment alone is just absurd and inappropriate. Unless she's having non-stop, horrific pain (and, if so, she needs to see a doctor) that clearly can't be blamed on the pain. So, yeah, she sucks, too. \n\nAnd I also agree she should know better than to basically claim the shower. I get she's in pain, that's terrible and I sympathize. But she should also be able to sympathize with the fact that other people need to use the shower and need to get to work. She should've worked to find another way to address the pain earlier, in case she couldn't use the shower. It's just part of sharing a bathroom. Yes, her roommates should be understanding. But she needs to be a little understanding, too.",
                  "id": 9,
                  "comments": [
                    {
                      "score": -1,
                      "content": "I think that she was saying that she wouldn't be surprised if *she* wasn't bleeding out of her vagina (i.e. a miscarriage), since it was in quotations.\n\nEdit: still an overreaction, but not a horrible insult to OP",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 164,
              "content": "You're right, nausea isn't predictable, that comment was mainly based on what she claimed at the time (that if they had waited she would have gotten out in 5-10 minutes).\n\nHowever, being in pain still isn't an excuse to lash out. She doesn't get a free pass for that.  Especially if several hours later she is getting on the phone to verbally attack and abuse, and emotionally blackmail and guilt trip OP, instead of waiting for him to come home and then talking about it maturely.",
              "id": 11,
              "comments": [
                {
                  "score": 45,
                  "content": "Yup, we've all had horrible pain at some point or felt sick as shit and probably lashed out at someone or was snippy. It doesn't excuse the behavior and when we do we should apologize. I get god awful migraines and haven't been able to afford a dentist in a decade and frankly I'm in a nearly constant state of pain. However it's rare I let myself get to the point of lashing out verbally at someone and if I ever do I immediately feel bad about it and would apologize sincerely.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 11,
                      "content": "If any colleges/universities near you have a dental or dental hygiene program, you can probably get extremely cheap cleanings.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Verbally attack and abuse, and emotionally blackmail and guilt trip?\n\nHow did she emotionally blackmail him? What did she threaten? How did she abuse him?\n\n**Did you miss the part were he grabbed her face and forcibly turned her head?**\n\nIs that what 'talking about it maturely' looks like to you?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 7,
                      "content": ">Did you miss the part were he grabbed her face and forcibly turned her head?\n\nRead my other comments, I've already talked about that.\n\n>How did she emotionally blackmail him? What did she threaten? How did she abuse him?\n\nDid you miss the part about how she spoke to him on the phone?\n\n>Is that what 'talking about it maturely' looks like to you?\n\nYep, you got me. Busted. Heh heh heh.\n\nWhat do you think?  Talking maturely would be waiting until OP got home, sitting down and the talking about what happened, how it made each other feel, and trying to come to an understanding.  Apologies from. Those who need to gove one is always good too.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "[removed]",
              "id": 16,
              "comments": [
                {
                  "score": 48,
                  "content": "Completely agree with this. \n\n26 weeks into my first pregnancy and have had morning sickness the entire time. I definitely sympathize with the girl, but that by no means gives her the right to act how she is. If her nausea is truly this debilitating she needs to talk to her OB and see if she can get a prescription for anti-nausea meds. \n\nAlso... If I'm not mistaken she isn't technically a 'roommate' so has no responsibility toward paying for utilities/ really has no claim to the bathroom in the first place. I would feel so embarrassed hogging the bathroom like she is when her bf's roommate who actually lives there needs access to a room he actually pays for so he can go to work. NTA",
                  "id": 17,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm currently 23w pregnant and was miserable, absolutely MISERABLE, until I finally asked my OB for help at about 16w. I haven't vomited since because I'm on some great meds that keep me functional. I should've started them weeks before but I just... didn't? I guess I thought it was just a normal part of pregnancy to throw up multiple times a day and not be able to ride in cars (or even drive myself) due to it triggering nausea.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 19,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Room mate has to get to work.",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Having been a pregnant wife, while I never monopolized the shower, I can attest that I would have and God help the human that tried to move me. That both men in this post lived to see another day was a mercy on her part.",
              "id": 22,
              "comments": [
                {
                  "score": 2,
                  "content": "Hell hath no fury like a woman scorned, hangry or pregnant.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 1,
                      "content": "OP and his roommate have no idea how close they were to being mauled. Bless their ignorant little hearts. XD",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "Everyone needs to see the info op left out. Apparently ops girlfriend had to be hospitalized for this nausea that’s how serious her nausea is. Also ops girlfriend had to quit for job because she has to go to the hospital and op supported this. Then ops girlfriend wanted to move to not be inconvenient with hogging the shower, op and roommate said no and roommate knew that she had serious nausea yet still chose to live with them. \n\nOps girlfriend is NTA and it’s sad to see that everyone is being so harsh on her.",
          "id": 25,
          "comments": [
            {
              "score": 38,
              "content": "I was ready to say YTA without this info and I just think so even more now. \n\nShe’s so sick that she’s puking constantly & the only thing that helps her is lying in the shower. It sucks that your flatmate was inconvenienced but how do neither of you have any sympathy for this poor woman?!",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "As soon as he said she was in the shower because she'd been puking for half an hour, I knew it was likely to be hyperemesis. I had it for nine months straight and it was a nightmare. If my husband had \"forcefully\" moved my head at any point I'd be divorced now.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -44,
              "content": "People need to stop trying to justify her behaviour as acceptable purely because she's pregnant and unwell.  Her behaviour was not acceptable, nor justifiable, full stop. Period.\n\nBeing sick does not give you a free pass to be unaccommodating or toxic.\n\nJust because she was in hospital the week before doesn't mean she is that unwell again.  And if she is, instead of verbally attacking her boyfriend and their roommate, she needs to say that she has to go back to hospital.\n\nYes the roommate wanted to keep living with them, despite OP wanting to move out with his gf so the pregnancy wouldn't be inconvenient, but he didn't agree to basically being called a freeloader and told he can't use his own shower (which uses water he pays for, mind you).\n\nPregnacy is rough, and it hits some harder than others, but it doesn't mean you're allowed to be an AH to others.",
              "id": 28,
              "comments": [
                {
                  "score": 55,
                  "content": "No one is justifying her behaviour because she is pregnant. In fact I feel like people are coming down harder on her because she is pregnant.\n\nI just don't think that lying in the shower when you feel sick makes you a toxic person. \n\nWhat if I have diarhheoa and need to sit on the toilet for 45 minutes? Am I an arsehole to my flatmates? Unaccomodating? Toxic? No? So if I'm sick and hog the bathroom I'm not an arsehole...unless I'm also pregnant.\n\nThe thing that gets me is this. He needs the shower, but can't use it because of her. However, she needs the shower, and can't use it because of him. How is it any different?",
                  "id": 29,
                  "comments": [
                    {
                      "score": -6,
                      "content": "Most of the comments excusing her are because she's pregnant, so should get some slack.\n\nShe is not toxic because she was sick, she is toxic because instead of talking to OP like a mature adult, once things had calmed, she chose to call him several hours later from her parents place and then proceed to belittle and mock him and threaten to move out or break up with him, in front of her family.\n\nShe is allowed to use the shower, there is nothing wrong with that, especially if she needed to clean herself off and because it helps her feel better, but, especially depending on how long she had been in there and their roommate had been waiting, responding to a reasonable question/request with an abrasive attitude is wrong.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Not defending her behavior entirely, just correcting the part about needing to go back to the hospital. Usually pregnancy nausea that requires a hospital visit is actually called Hyperemesis Gravidarum. You only need to visit the hospital if you stop urinating because you can't even hold water down, its just vomiting 24/7. All they do is put fluids in you and send you home and tell you to try to keep water down and eat crackers.\n\nAnd I will say, its hard to be rational in that state and its true that showers miraculously help. But she should have more easily given up the shower",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I'm leaving my original comment, but please see the edit! \n\nI'm pregnant and honestly I think that OP is n t a. I have had morning sickness, round ligament pain, dizziness, shortness of breath, you name it. I'm also currently on bed rest, which is no cup of tea, and I still would never treat my friends/partner this way. Her pregnancy has nothing to do with roommate, and he shouldn't be punished for someone else's choices. \n\nThe reality is the morning sicknesses sucks, but that doesn't mean everyone else has to change their shower schedule to match when she's gonna throw up. That also sounds like a horrific waste of water...\n\nEdit: I got more info on the situation, (that girlfriend specifically wanted to move to avoid this kind of situation, and that she's actually been hospitalized and lost her job over the nausea) and I take it back. \n\nOP YTA, your girlfriend TRIED to make sure this would never happen and no one listened to her. I completely understand her frustration, as it sounds like everyone wants to say they'll be there for her but when it comes down to it they don't actually mean it.",
          "id": 32,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I agree with ESH. The thing that caught my attention though was that she had been in the shower for a couple of hours. At that points it's pretty ridiculous.",
          "id": 33,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "What does ESH mean?",
          "id": 34,
          "comments": [
            {
              "score": 3,
              "content": "Dont know if you still need this but it means Everyone Sucks Here",
              "id": 35,
              "comments": [
                {
                  "score": 2,
                  "content": "Thanks!",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "What's ESH?",
          "id": 37,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -117,
          "content": "Nope. YTA. She's sick, pregnancy or not. What would OP do if she had the flu and it was coming out both ends? I think both of them dismissed this a pregnancy \"hysteria\" and that she's not really sick. Some women get very sick, just like some women get sick on their periods. You can't just dismiss it as being no big deal. Princess Kate was hospitalized several times for this. Then, you yank her head around to give her a dirty look for DARING to be sick? Your lack of empathy is clear and I understand why being manhandled as if she was a misbehaving child. It does not bode well for your future.\n\n&#x200B;\n\nIn addition, the roommate was TA for forcing the issue when he didn't even need to shower yet. He can't EVER go without a shower because accommodating another person's illness is too much? \n\nYou'd better get your priorities straight.",
          "id": 38,
          "comments": [
            {
              "score": 70,
              "content": "I'm not sure the flu metaphor supports your point. Even if she were spewing forth bodily fluids from every orifice, like... if she couldn't spare 10 minutes to let someone else use the single shower in the apartment, that is a *medical emergency*. She shouldn't be in the shower, she should be on her way to the ER. Sometimes, when you're living with roommates, you have to reach compromises about who uses the shared facilities at which times. If you've had the bathroom for hours, even if that's because you're legitimately ill, you still need to let other people use it for important things like showering. That's one of the classic \"things that suck about living with other people\".\n\nAnd yes, OP sucks for yanking her, and the roommate sucks for making it out like he needed to shower more urgently than he did and coming into the room. But you can't just take up the one single bathroom forever without letting someone else have a turn, no matter how sick you are. If you're so sick you have no other choice, you need to go to the hospital, because you're probably about to keel over from dehydration.",
              "id": 39,
              "comments": [
                {
                  "score": -17,
                  "content": "The heck are you talking about? People can be sick for hours without needing to go to the ER. I had a horrible bout of norovirus where it was coming out of both ends and I ended up lying on the bathroom floor for several hours because I was so exhausted I couldn't move. It wasn't a medical emergency, I didnt need an ambulance, just fluids and rest. But if my husband had tried to come in and shower at that point I couldn't have moved if I'd wanted to. You can be sick for several hours at a time, you cant just stop mid shit or mid barf to let someone in.\n\nTheres also massive anxiety when you're feeling that I'll and you have to leave the bathroom. Knowing that you could start heaving again at any second but not be able to get back in there is terrifying, and makes it all the harder to leave.\n\nObviously eventually you can move and stop barfing and feel better for a bit and let other ppl use the bathroom. You're not barfing 24/7. But sometimes that's 20 minutes later, sometimes that's 2 hrs later. It's not a thing that can just happen on demand and a shower is really NOT that big a deal. You can go like 1 day without showering, it's not the end of the world.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Wrong. OPs gf is also TA.  Being ill is not an excuse for a bad attitude.  She's allowed to be cranky, but attacking their roommate and his worth and not being receptive to sharing the house common areas, because she's pregnant, is not okay.\n\nIn another comment OP said that his girlfriend doesn't work or pay rent (fair, because she's pregnant, and the world sucks), but here she is accusing their roommate (who does pay rent) of not contributing (\"what does he do around here anyway\"). It doesn't matter if OP does most of the cooking, their roommate pays for the right to live there and use the facilities.\n\nShe then goes on to insult and attack OPs character while in the presence of her family, which he didn't (or he says he didn't) respond to, mind you.\n\nOP did wrong with the way he handled the whole situation, especially when he got physical with here, which was both dangerous and highly wrong, but she is far from innocent in this entire situation.\n\nIf she was that seriously unwell, she should have said something or asked OP to take her to the hospital or a doctor (mind that OP could have checked in with that suggestion as well).",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Sick, pregnancy or not, doesn't mean you no longer have roommates who require the bathroom. Even in your example (which would be FAR worse than what was actually happening), it would be unfair on the roommate.\n\nYes, she was puking and feeling sick, and I'm sure it's horrible. But when you have a roommate, you make sure they are able to use the bathroom when needed. She can go puke in the sink, or go puke in a bucket. However she does it, she needs to deal with her sickness and nausea for long enough to let her roommate use the bathroom.\n\nESH except the roommate. The worst thing he did was LEAN into the bathroom while the curtain was completely closed, because she had been being a brat and loudly insulting him.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Who knows how long the roommate waited for the shower or waited to say something?\n\nHe knew the girlfriend was in there a while and probably was worried he wouldn't be able to shower in time for work. He also knew he'd be out of hot water too. \n\nHe is AH for how he entered the bathroom but not because he didn't shower last minute for work. Some people do it hours before they leave the house because of numerous reasons. Might need to apply topical medication after a shower and cannot go out in the sun for some time. Or they just want their hair to be fully dry before heading out. Doesn't matter. \n\nOP said the long showers help his girlfriend, so she probably has been doing this at least a few times. She shouldn't hog it during peak times and I'm sure she can let others use it for 15-30min a day as they live there too. She is being the AH for making the roommate sacrifice his hygiene and work for her convenience. She should explore other methods of relief, especially ones that don't affect the roommate.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "i personally have to take a shower every day due to greasy hair. Also my work doesnt give 2 shits of some girl is pregnant. So getting fired for her not being able to be sick anywhere else is bullshit",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It's clear many of you have not been so sick you can't move. I have. Sometimes we have to sacrifice a bit as well. He doesn't state that this has been a problem before so, it's possible she was extra sick that morning. It has nothing to do with fairness it's about compassion. You can be very sick and it not a medical emergency.\n\nI have had to wash my hair in the kitchen sink before and you can do a sponge bath.\n\nI know it's an inconvenience but, if this day was different, maybe those around her could show some empathy.\n\nI think a lot of you are young men with the \"just suck it up\" mentally. They just haven't had a bad experience yet.",
              "id": 45,
              "comments": [
                {
                  "score": 4,
                  "content": "I'm a grown woman. She could have kept a wastebasket next to her bed for 10 minutes. The world doesn't stop just because she's pregnant.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I'm not saying it does. I'm just saying that this day she seemed unusually sick.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Well, the science part of your name doesn't check out. I don't think I can speak to the other half.",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 617,
      "content": "ESH. You shouldn’t have put your hands on her in the manner you did. Your roommate shouldn’t have entered the bathroom while your girlfriend was in there. And pregnancy doesn’t give someone license to inconvenience everyone they live with and say nasty things to their partner. You all suck.",
      "id": 49,
      "comments": [
        {
          "score": -140,
          "content": "[deleted]",
          "id": 50,
          "comments": [
            {
              "score": 88,
              "content": "“At which point I was appalled and leaned down and turned her face toward me”",
              "id": 51,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 61,
              "content": "He literally said he did",
              "id": 52,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 355,
      "content": "It's weird to ever lay hands on a person to force them to move a certain way--unless you're protecting them from danger. I get you were groggy, but the idea that your base instinct was to force her look at you ... based on that I'm going to have to vote for YTA.\n\nETA: the fact that the roommate didn't have to work that early and didn't supply that information, then barged into the room, makes him the asshole, too. And your girlfriend's behavior after the fact is asshole-worthy (she can be furious--she deserves to be, in fact--but the way she's expressing it is awful), but I'm hesitant to judge her in the moment because it's unclear if *she* knew that roommate's shower situation wasn't dire. Because if she did, I can't blame her for being incredulous.",
      "id": 53,
      "comments": [
        {
          "score": 176,
          "content": "YTA.\n\nAn info post longer down has this info.\nGf has been hospitalised due to the nausea earlier on.\n\nThey were supossed to move from roomate but OP did not want to leave roomate.\n\nOp sucks he should probably prepare for being single.\n\nAlso pregnancy caused her to have tochange jobs. But shecould not start new one due to hospital.",
          "id": 54,
          "comments": [
            {
              "score": 115,
              "content": "All very relevant info, sounds like OP is minimalizing his GF's condition. What an AH, she's better off leaving him to live with her family.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 109,
              "content": "I’m rolling my eyes at all the people picking on the gf for not working.\n\nShe’s growing their child and she’s sick. She’s been hospitalized for this. Her partner was fully supportive of her not working for the time being to focus on her health and the child’s health. She’s not a “freeloader.” She already has another job lined up but she literally can’t perform it. She doesn’t want to be living with the roommate PROBABLY BECAUSE SHE’S PREGNANT AND SICK. It is hugely shitty to share your living space with a person who isn’t family when you are that sick. If I’d had to share a bathroom with anyone but my partner while pregnant I would have lost my damn mind.\n\nYeah she probably overreacted and is being shitty for her behavior and being pregnant and sick doesn’t mean you can be a jerk, but jeez at the idea she’s a freeloading waste of space.",
              "id": 56,
              "comments": [
                {
                  "score": 13,
                  "content": "They're probably saying that because he didn't put in the OP all this info. He's hiding it to make it look better for himself",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Ugh this just solidifies even more a YTA from me. I have a chronic pain condition that effects my stomach, and pregnancy was awful for me. Sometimes showers were the only thing that eased the agony. Grabbing his pregnant girlfriend head and forcibly turning her to face him is not okay. Ever. I'm scared of how this man will react when he has a screaming infant and an unruly toddler. I say this as my wild 3 year old climbs me and grabs my face lol.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -32,
              "content": "He should prepare to have a controlling freeloader out of his life\\*",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 58,
          "content": ">the fact that the roommate didn't have to work that early and didn't supply that information, then barged into the room, makes him the asshole, too. \n\n\nBro, it's his house, the GF doesn't pay rent OR help with utilities (that shes probably racking up by spending several hours in the shower). I shower 3 hours before work cause otherwise my hair looks like shit, and similarly, he doesn't need to wait until right before work to shower. Not only is he *not* and asshole, he's an angel for putting up with this bullshit. Post this from the roomates perspective and watch the stream of comments saying \"NTA- set boundaries and don't allow roomates to move their partners in.\"",
          "id": 60,
          "comments": [
            {
              "score": 52,
              "content": "Roommate convinced op to stay when the girlfriend wanted to leave. He signed up for this.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "It's not his house. It's their house. The roommates and the couple. The couple get to sort out their finances between themselves. If they decide between them that bf pays more or all of it that is up to them, as long as roommate doesn't have to pay any more than a third.\n\nAnd he's not putting up with it. He agreed to live with both of them, knowing she was pregnant.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I wonder if op is paying for the markup on their water bill.",
              "id": 63,
              "comments": [
                {
                  "score": 24,
                  "content": "Oh christ a long shower adds pennies, don't be obtuse.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "I wonder if he's paying the extra utilities/rent to makeup for there being 2 of them anyway. He says him and his roommate split rent and bills, but are they split 2 ways or 3 ways?",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Where does it say that it's the roommate's house?",
              "id": 66,
              "comments": [
                {
                  "score": 10,
                  "content": "What I mean is that he is living there and paying rent- he should have access to basic facilities, and not get shit for asking to use the bathroom after his roomates girlfriend was occupying the bathroom for several hours",
                  "id": 67,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Its not his roommates girlfriend though. She is not just visiting. She also lives there. She is also his roommate. \n\nAnd as she is living there, she also has access to basic facililties and should not get shit for using the bathroom (The post doesn't say she was there for hours)",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "(I think you mean ESH)",
          "id": 69,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 319,
      "content": "NTA\n\n&#x200B;\n\nI'm 27 weeks pregnant, still throwing up so I understand how she feels BUT that's no excuse for her to be an asshole. Your roommate asked a reasonable request. What she said to you on the phone was absolutely inappropriate and frankly disgusting.",
      "id": 70,
      "comments": [
        {
          "score": 319,
          "content": "I dunno. He forcibly put his hands on his GF and his roommate barged into the shower while she was in there. \n\nThis is at least an ESH",
          "id": 71,
          "comments": [
            {
              "score": 202,
              "content": "If my roommate is hogging the bathroom for who knows how long, when I need to shower for work, I’m going to barge in to get them to leave. The gf does not get a monopoly on the bathroom just because she’s pregnant. That was her and op’s decision not the roommate. And even “barge in” is an unfair characterization of what the roommate did. He stuck his head in so he could communicate better.",
              "id": 72,
              "comments": [
                {
                  "score": 29,
                  "content": "It’s because she’s sick, not because she’s pregnant. I know it’s a fine line to draw. But this isn’t pregnant entitlement. She is a sick person. It sucks that she wasn’t able to feel better quick enough but making it out like her suffering doesn’t matter because she’s “just” pregnant or something is terrible.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "She doesn’t even work, and OP said he works and does all the cooking and cleaning. NTA. But OP is in for one hell of a ride.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 166,
                      "content": "She doesnt work because her old job wouldn't let her go to her doctors appointments and OP supported her quiting. The only reason she didn't start her new job was because she had to be hospitalized for her nausea. OP also says that the roommate wanted them to stay so OP extended the lease even though girlfriend wanted to move out.\n\nOP left a lot of context out of the main post.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "I agree with OP being the AH for turning her head (too forcibly according to him), and obviously his GF is also the AH.\n\nBut the roommate? He LEANED into the bathroom, with the girlfriend completely out of view by the shower curtain, after she was loudly insulting him and refusing to leave the shared bathroom.",
              "id": 76,
              "comments": [
                {
                  "score": 44,
                  "content": "He had no idea she was out of view until after he already put his head in. In another comment OP says the roommate wanted them to stay even though girlfriend wanted to move out. Roommate signed up for sharing a bathroom with a pregnant person and then enetered a room with a naked person who didn't consent to him being there. Girlfriend was still being an ass, but so was OP and roommate.",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Roommate did not barge into the shower, he barged into the BATHROOM. The shower curtain was closed the entire time.",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "To be fair, OP and roommate both did that AFTER the gf loudly proclaimed she wasnt getting out and started insulting the roommate\n\nOPs reaction is understandable. She was being aggressively embarrassing, even tho he shouldnt have touched her\n\nRoommates reaction is understandable. If you pay rent, and your roommates gf is refusing to hand over the shower WHILE shes insulting him loud enough to hear, then confronting her is very valid. He shouldnt have stepped into the bathroom, but i can see it happening\n\nGirlfriends reaction is not understandable. She can only claim pregnancy, which does not excuse even half her behavior\n\nI think a NTA judgement makes more sense, tho technically ESH",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -7,
              "content": "Sorry, but my needs to basic human hygiene are more important than my roomie's freeloading girlfriend.",
              "id": 80,
              "comments": [
                {
                  "score": 32,
                  "content": "Then maybe don't convince them to continue the lease. The girlfriend had to quit her job because she was hospitalized for nausea. The roommate was the one who convinced the boyfriend to stay when the girlfriend wanted to move out.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -36,
              "content": "Don't make it sound worse than it was, he turned her head. It's not that big a deal.",
              "id": 82,
              "comments": [
                {
                  "score": 54,
                  "content": "OP himself said he was (too) forceful, and then reaffirmed it. Even if it was a light twist/turn, if his gf had been tensing her muscles it still could have caused her pain (pregnancy or no).\n\nDon't assume or claim that someone's actions weren't bad when they themselves said it was bad or you don't know much about the situation.",
                  "id": 83,
                  "comments": [
                    {
                      "score": -19,
                      "content": "If she wasn't there in the first place, said situation wouldn't have happened",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "He put his hands on her in a forceful manner in order to get her to do what he wants. That's abuse and control and I wouldn't tolerate it for a minute. Most of the N A H come from men and women who didn't have serious illness while pregnant.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "I'm 20 weeks pregnant and I haven't gone a day without throwing up MULTIPLE times. To the point where some days the only thing I can consume is water and even that comes back with a vengeance. I'm on multiple medications and my doctors have informed me that if this continues as it is now I'll be in the hospital at least a few times before this baby comes. Just because you can knuckle through some inconvenient morning sickness doesnt mean OPs GF can, it is very different for every person. I am not able to be pleasant and helpful after being on the toilet for HOURS  a day throwing up BILE and feeling my esophagus burn my back muscles spasm my stomach ache and my head pound. The roommate was trying to push the issue and he chose a terrible time. If he had taken the loss that day and chose to speak to OP when his GF wasn't in misery I would be far more sympathetic but he was being a GIANT ASS to pull that sh*t at that time.",
          "id": 86,
          "comments": [
            {
              "score": 42,
              "content": "To be fair they didn’t even give her 5 mins to get the energy to pick herself up, that’s so fucking rude no wonder she lashed out and there was no reason to physically hurt your own pregnant girlfriend (being pregnant often make people really achey and sore so if she was already incredibly nauseous that must’ve hurt more than for the average non-pregnant individual). Turning someone’s head to force them to look at you when they’ve been PUKING is such an asshole move. OP, YTA in this situation.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "he should have at least asked/given her a few more minutes, she was obviously miserable and unwell",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "Hey I'm in the same boat-- 26 weeks and not a day goes by where I don't start it off by rushing out of bed to puke bile up, choke down some saltines and water, and have those come back 30 minutes later. Fortunately I haven't had to be hospitalized yet, and the meds I'm on allow me to function fairly normally. \n\n&#x200B;\n\nThis still doesn't give any person a pass to act like OP's gf was. You can be miserable and still be decent to other people, especially if you're in someone else's home.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "Should I describe my daily routine with you? You seem to think that I only deal with “inconvenient morning sickness”. You have no idea what I deal with on a daily basis. Am I lucky enough to only have to take one medication to make me feel human? Yes. Does that mean I don’t spend my days NOT eating anything because I’ve already thrown up water that started by just brushing my teeth? NO. \nI completely empathize with you. Vomiting/nausea during pregnancy is the WORST thing I’ve ever experienced. What I’m saying is the things OPs GF said after the fact that completely unnecessary and rude. I would never want ANY woman to have to go through a rough pregnancy. Like you said, pregnancy is different for every woman so please don’t assume that I’m peachy keen being able to “knuckle through inconvenient morning sickness”. You don’t know what I’ve been through either.",
              "id": 90,
              "comments": [
                {
                  "score": 2,
                  "content": "Fair enough",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I'm currently 29 weeks and couldn't agree more.",
          "id": 92,
          "comments": [
            {
              "score": 20,
              "content": "If I talked to my boyfriend that way, he would literally tell me to fuck off! Lol no excuse",
              "id": 93,
              "comments": [
                {
                  "score": 18,
                  "content": "Would he grab your face?",
                  "id": 94,
                  "comments": [
                    {
                      "score": -15,
                      "content": "Nope but that’s not what OP said he did. Plus I wasn’t there so I really have no idea how he moved her head.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I would strongly reconsider this statement. Morning sickness affects women differently, and women who end up hospitalized because of it are supposed to be very careful. If you did not see OP's comment in the thread I suggest going to read it.\n\nI hope your pregnancy continues to go smoothly.\n\nBut OP is definitely YTA here.\nEdited: I should not have been dismissive of /u/captainmorgan42418 's opinion in my initial sentence, edited to reflect that.",
          "id": 96,
          "comments": [
            {
              "score": -6,
              "content": "I never said I was/wasn’t hospitalized for severe nausea/vomiting. All I said was I’m still vomiting but thanks 👍🏻",
              "id": 97,
              "comments": [
                {
                  "score": 19,
                  "content": "You have a strong and valid point of view for this, you are right, I apologize for my statement sounding dismissive.  \n\n&#x200B;\n\nWhat bothers me is that your voice is going to have a lot of weight behind it on this thread because you are pregnant (whether that weight is right or wrong).  What you are implying with your comment it that since you are 27 weeks along and vomiting, your experience is the same as OP's gf, so you know what exactly is happening.  However that isn't true, every pregnancy can be very different.  That OP's gf had such a severe hospitalization that it caused her to miss out on her job interview and work paints a grim picture.  The hospitalization isn't included in his initial write-up which means a lot of people are going judge his gf on \"morning sickness\" alone.  Which as you know can vary wildly.\n\n&#x200B;\n\nYou don't have a duty to educate the people of Reddit on how bad Morning Sickness can be, but please think of making sure people realize that it is not all the same.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I totally understand where you’re coming from. I didn’t mean for my comment to imply that every woman going through the same thing that I do. Most of the people who has responded to me is also pregnant and agree with me, but I can understand that’s everyone might not realize pregnancy can be different for everyone.  I meant to show my point of view because I am pregnant, have NOT had a smooth pregnancy as far as vomiting, but I would never treat someone like that no matter how badly I feel. I more have a problem with how she treated OP after the fact on the phone. HG is not excuse to treat someone like that. I understand getting frustrated and taking it out on someone close to you and I hope they can work it out so both parties are at peace. \n\nAll in all, I see what you’re saying and I will be more aware next time I comment about something like that.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I feel for you, I had paralyzing all day morning sickness. Watermelon helped me immensely, I can't swear it will help you, and the effect was temporary, but it calmed my stomach enough to eat a meal without gagging.",
          "id": 100,
          "comments": [
            {
              "score": 10,
              "content": "Oh my gosh I’m so sorry 😩 paralyzing is the perfect word for it! Thank god for meds, I take Unisom every day to just feel human (but still violently throw up at 2am 🙄) I will for sure pick up some watermelon! Thank you :)",
              "id": 101,
              "comments": [
                {
                  "score": 9,
                  "content": "Those Sea Bands helped me. Also carrying around tea lights in scents that I could handle also helped. \n\nI was even able to get them through TSA once because I dared the TSA Agent to take my tea lights away and I'd puke on him. \n\n Hyperemesis gravidarum  just sucks oh so much.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I had luck with dry food! I carried crackers and almonds around with me everywhere. I would start eating them as I felt nausea come on and it helped me so much!",
                  "id": 103,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I’ve slowly started to do that! I work at a desk and keep pop tarts and honey roasted cashews in my drawer 😂 it definitely helps through out the day!",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I had to smell lemons. I carried cut lemons around with me.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Banana belped my for the first one.\n\nRitz crackers were evil. Everybody was always pushing them on me. And going down they were okay going up they were horrible.",
              "id": 106,
              "comments": [
                {
                  "score": 3,
                  "content": "I literally plan my meals by what would be less horrible to throw up! I drank a lot of protein shakes in the beginning 😩",
                  "id": 107,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thats why all I ate was applesauce for a good few weeks there",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Protein shakes were a life saver!",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It's been a year since I gave birth and I still can't look at oyster cracker. Nauseous now just thinking about them.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "I lost my virginity to a microwaved watermelon",
              "id": 111,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 191,
      "content": "ESH. You are an absolute ass for manhandling your pregnant girlfriend while she is in the shower. Get some self control. She's being wholly unreasonable for acting like this but it is no excuse to use force on her body. Your roommate is an ass for daring to barge into the bathroom.",
      "id": 112,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 165,
      "content": "Sorry but YTA, mostly for forcefully pulling a nauseated, pregnant woman's head.  Thats physical abuse, and everything else in your story doesn't make this better.  Yes you might be getting verbal abuse from her family (from her? Im confused with how this is written) but even one instance of physically abusing a pregnant woman is too many.  \n\nThe roommate is also a huge A because of walking into the bathroom while she is vulnerable in the shower and instigating this entire thing when (s)he didn't need to.  \n\nMy partner has to sit in the show for long periods of time due to migraines and feeling nauseated, and I never try to remove him even when I need to get ready for work.  I just take a sink shower and make do, because he is in pain and needs to be there.  I cannot imagine the audacity of someone trying to force a pregnant cis-woman or trans-man to get out of the shower while they are having morning sickness.",
      "id": 113,
      "comments": [
        {
          "score": -15,
          "content": "This is just ridiculous. She doesn't pay any rent or bills, but because she's pregnant then the roommate is no longer allowed to use the bathroom?\nOP is the AH for grabbing her head. His GF is the AH for multiple reasons. His roommate is perfectly reasonable. He LEANED into the bathroom after she had been insulting him, whilst the curtain was totally closed. He didn't instigate anything, he wanted to use the shower he pays for, in the flat that he pays for. Thats a perfectly normal and reasonable expectation.",
          "id": 114,
          "comments": [
            {
              "score": 35,
              "content": "He's not allowed to use the bathroom while she's using it. That's the only expectation she has.\n\nI disagree \"leaning\" into the bathroom is normal behavior. I would never do that to my roommate's SO, regardless of circumstance.",
              "id": 115,
              "comments": [
                {
                  "score": 22,
                  "content": "Well if you're in there for hours at a time, including during important times, then its a problem. Thats called being a shitty roommate.\n\nWhen she's refusing to leave, and shouting insults at him, i see no issue with him leaning in. Its no different to shouting from outside, except that its easier. She wasn't in view.",
                  "id": 116,
                  "comments": [
                    {
                      "score": -20,
                      "content": "Not to mention she doesn’t contribute to the water bill. Sitting in a shower for HOURS then not letting the roommate in when the roommate is paying for that water is fucked up. \n\nShe sounds awful and that’s coming from another unemployed pregnant lady. I would never dream of pulling this shit.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -30,
          "content": "Hey uh, want to add this.\nThe roommate didn't really do that much wrong, he only peeked his head into the bathroom (shower curtain was closed) and only spoke a bit, didn't even fully enter.",
          "id": 118,
          "comments": [
            {
              "score": 56,
              "content": "I think it is really odd that people are okay with this.  It is up to the naked person whether this is a comfortable thing or not, and how was the shower curtain closed if OP had just turned her head towards him?\n\n\n\nIt also was not an urgent issue and yet the roommate pressed.  If you see OP's other comment about the GF being hospitalized for vomiting (something left out of the original write up), how is the roommate not more understanding?  There are many times when vomiting during pregnancy can be extremely severe and pregnant women have to be extremely careful moving and eating to make sure they keep food down. If you read OP's other comments it sounds like OP and GF are not on the greatest terms with the roommate (they are moving out soon). It sounds like roommate and GF have some issues, so roommate lacks empathy for a woman with severe morning sickness not wanting to move from the shower.  That makes the roommate the A.\n\nAlso, while the GF isn't working it is because her work wouldn't let her go to doctor's appointments (while pregnant), so it wasn't that she doesn't want to work (just in case someone is trying to make the \"she doesn't pay rent or work\" follow-up).  \n\nI'm not a fan of the GF's phone comments afterwards, but the roommate and OP are the bigger A's here in my view.",
              "id": 119,
              "comments": [
                {
                  "score": -24,
                  "content": "Well, I'm not okay with even this happening in the first place. So, first off.\n\nEveryone has a say in what's comfortable or not in that situation, and OP has explained about the curtain already in a different comment. The roommate couldn't see her because of the curtain from his view at the door, but it was pulled back a bit. (you did a small misstype btw in your comment, you switched op and gf genders.)\n\nSo, do you know about the word reputation? You go into work and your co-workers avoid you because you smell or look bad? That gives you a bad reputation. The roommate wanted to use the shower because he needed to look good on his job.\n\nThe roommate can and should be a bit more understanding, but also should she about living with others. You aren't entitled to the bathroom for hours at a time because you have morning sickness and pregnancy. I am not a female so I have no clue how a pregnancy works but biology wise she can take a 10 minute break from having water on her.\n\nI don't know where it's stated about the gf's work situation so I won't comment on it.\n\nEveryone imo is a butthole here, OP for forcibly moving his girlfriend's head, the roommate for not being a bit more considerate and understanding but GF is a butthole for the phone thing, and imo a bit for not considering the roommate too. \n\nSorry if this seems hazy or if my information has gaps and errors, it's late at night and I didn't expect a reply anymore.",
                  "id": 120,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -44,
          "content": "JFC, he turned her head. That's not abuse. And mental abuse isn't any better than physical abuse. It can even be worse. It was worse in this.",
          "id": 121,
          "comments": [
            {
              "score": 26,
              "content": "So....you didn't read that well. When the person retelling the story says they used too much \"force\" while moving her head that is abuse. Anyone forcefully turning someone's head against their will is not just \"turning\" their head. More than likely he jerked her head towards him, he even says multiple times he used too much force doing it and he regrets it.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 130,
      "content": "Tf is wrong with you grabbing your wifes face like she is a naughty child to be told off ?  Shes  yta for how you acted .  Man shes carrying your baby, she gets asshole passes you dont",
      "id": 123,
      "comments": [
        {
          "score": 51,
          "content": "Ok to answer all the men messaging me saying shes the ass hole. Yes. She acted like a ass. But she was THROWING UP  IN THE SHOWER . And her partner grabbed her chin . Abd spoke to her like a toddler . \n THATS ABUSIVE  . Comparatively he is the AH .",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "How do you get an asshole pass for being pregnant lmao, obviously it’s an ESH situation. Being pregnant doesn’t justify all your actions, you’re still in control of your mouth.",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -9,
          "content": "People who are pregnant don't get passes in situations like this. The only person who isn't an asshole is the roommate.",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -11,
          "content": "> Man shes carrying your baby, she gets asshole passes you dont\n\nNope. So much wrong with this.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -12,
          "content": "No one gets passes for that behavior. Maybe we be a bit kinder, but being TA is being TA, pregnant or otherwise",
          "id": 128,
          "comments": [
            {
              "score": 38,
              "content": "The act of grabbing someones chin to make them look you in the face while you talk to them like a toddler, is not the way to talk to your wife  it is agressive and abusive",
              "id": 129,
              "comments": [
                {
                  "score": 5,
                  "content": "Yeah. Good thing we agree on that",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -12,
          "content": "It doesn't matter if you're pregnant, drunk, your dog just died, or whatever ridiculous excuse. That's not a pass to be an asshole.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -17,
          "content": "[deleted]",
          "id": 132,
          "comments": [
            {
              "score": 0,
              "content": "[deleted]",
              "id": 133,
              "comments": [
                {
                  "score": 5,
                  "content": "Oh the irony of assuming a person on the internet is a man while accusing them of being a misandrist.",
                  "id": 134,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -8,
                  "content": "[deleted]",
                  "id": 135,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh i know what your trying to call me 😄",
                      "id": 136,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 60,
      "content": "YTA. You literally said she has been hospitalised due to her sickness. I've been there. The never-ending nausea, feeling like you might faint all the time because you can't keep anything down. That is real. It is not some pregnancy hysteria. You didn't ask how urgently your roommate needed to shower. Instead you put your hands on an ill woman who is carrying your unborn child... If someone had done that to me, when I was so ill you can bet I would not be there for him to do it a second time. You completely failed your girlfriend, you failed to understand or empathise at all.",
      "id": 137,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 57,
      "content": "ESH. You: wtf dude. Her: for not just saying \"give me a few more minutes\" and throwing a fit instead and getting her family involved. But mostly you: wtf dude.",
      "id": 138,
      "comments": [
        {
          "score": -48,
          "content": "She’s also gaslighting him by saying she would have gotten out after the fact when she clearly said she wouldn’t get out at the time of the incident. She sounds like a treat. He shouldn’t have moved her head but from the sound of it she was just ignoring everyone else’s needs and staring at the wall. He has to get her attention because he didn’t want to let the roommate know there was a situation (which she was causing). I can feel OPs frustration coming through the screen. Pregnant or not, the gf is way more of an AH. She knows the roommate works and we can assume she doesn’t. Also from the sound of it the OP does most of the housework. She can get out of the shower.",
          "id": 139,
          "comments": [
            {
              "score": 37,
              "content": "Have you ever been pregnant? It's rough, and you do what you can yo get relief.\n\nAlso, that's not gaslighting.",
              "id": 140,
              "comments": [
                {
                  "score": -31,
                  "content": "Other ppl agree it is gaslighting. \n\nI have not been pregnant but hope to be one day. I’m sure it will be terrible but I still wouldn’t be as inconsiderate as the gf here.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Gaslighting is deliberate manipulation to make someone believe they're going crazy. What's described here is a changed narrative, not gaslighting.\n\nI've been pregnant five times and each time I've gone absolutely insane in the first trimester, prior to finding out I was pregnant. By the third pregnancy I realised I could identify it as a symptom.\n\nFirst pregnancy I was sure I'd gone insane because I kept hearing a baby crying under my house..\n\nSecond pregnancy I overdosed on painkillers.\n\nThird pregnancy I went on a rampage and bashed the shit out of my home and car.\n\nFourth pregnancy I collapsed to the floor and sobbed until I threw up.\n\nFifth pregnancy I drove out bush and hooned around in a manic psychosis.\n\nIt's easy to say what you will and won't do but you don't know until you experience it. I'm usually a gentle giant.",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": ">He has to get her attention because he didn’t want to let the roommate know there was a situation (which she was causing)\n\nNever, ever an excuse when you are dealing with **anyone**, let alone a pregnant woman who has been up for what sounds like hours puking. unless you are trying to protect someone, or stop them from something.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Completely agree. Hence my verdict of ESH.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 55,
      "content": "YTA. Don't grab a nauseated person's head. And don't demand that she gets out immediately. Roommate could've asked for her to be out in ten minutes, and to be fair she should've suggested that. But you and the roommate did take away her privacy when she was vulnerable and that's unacceptable. And you grabbed her head forcefully??? Yeesh\n\nEdit: you should apologize dude. Yeah, it's rude to monopolize the shower. But come on. Don't grab someone's head like a belligerent child and deny them privacy (I don't care if the shower curtain blocked your roommates view, you should've closed and locked the god damn door). That's unacceptable.",
      "id": 145,
      "comments": [],
      "relation": "Attack"
    }
  ]
}