{
  "post content": "Context, we’re from the UK. I am struggling to see why we are the assholes as deemed by my parents and sister. My husband uses Reddit and thought this sub would provide a third insight that we are missing.\n\nMy husband (42M) and I (40F) have 2 daughters: Jane (22F) and Lisa (5F). This concerns Jane who has been struggling with the cold.\n\nJane started to complain about the temperature of the house now it’s no longer summertime. Currently, we leave the central heating off all the time apart from in the early morning (5-7am) so Lisa doesn’t get too cold when she is awake. My husband and I don’t have an issue with the temperature of the house (its approx 16C at night across all of the bedrooms since we checked in case her room was draftier), we don’t really feel it and do not see where Jane is coming from. Jane complains and says she wears multiple layers to bed and around the house while we are all asleep.\n\nSo, she asked if she could have access to the thermostat in order to switch the heating on at a higher temperature than 18C (what we set it as). She wants to raise it to 21C but we said no. She keeps complaining about how she has to wear 4 layers to bed so she doesn’t feel cold in the morning. Lisa says it isn’t cold when we ask her, my husband and I also don‘t feel the cold so we said no to her asking and thought that would put an end to it.\n\nIt did not. We had dinner at my parents house in which Jane was making comments about how warm and toasty her grandparents’ house is. My parents were shocked that we didn’t allow her access to the thermostat and they tried to sway us into giving her access because it isn’t right for her to sleep in multiple layers. My sister also agreed with them and said my daughter has valid points since the temperature is starting to drop in the night.\n\nAre we wrong here?\n\n  \n\n\nHello everyone and thank you for all your feedback. I did not realise there were so many reasons as to why my daughter potentially could be cold and that layering may not work in those cases. We reached a compromise with our daughter: she can have a small heater for her room with a timer so I am 100% sure it is not left on overnight for my own peace of mind. We are also going to buy her a heavier duvet and thicker mattress topper to prevent cold from underneath the bed. Thank you all. ",
  "id": 1,
  "comments": [
    {
      "score": 11120,
      "content": "YTA. 16c/60f or even 18c/64f is too cold for most folks. Just because you're fine doesn't mean it's reasonable to expect her to be miserably freezing. I see you're not interested in keeping the heat on consistently either, so that's miserable for her as well. Why do you think she should suffer so you can save a few dollars on the power bill? Also, the things most folks are suggesting (heating blankets, space heaters, etc) actually use more electric than just keeping your house a comfortable and consistent temperature. Expecting her to have 4+ layers to be moderately warm is unreasonable.",
      "id": 2,
      "comments": [
        {
          "score": 7477,
          "content": "It’s interesting to me that no one has noticed his comment about turning the heat up so the 5yo is comfortable but who cares about the 22yo. YTA",
          "id": 3,
          "comments": [
            {
              "score": 3082,
              "content": "This is what I came here to say - by all means, if the 5 year old is fine, forget about the needs of the 22 year old? Not hardly.  They ATH",
              "id": 4,
              "comments": [
                {
                  "score": 1865,
                  "content": "literally. i could tolerate cold much better at 5 then i could my current age of 24. i’m anemic, have arthritis and have raynaud’s. the cold is not nice to me, even at a mild cold temp of 64F, and people like this would have me in a VERY bad mood.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1584,
                      "content": "A lot of females that age (late teens early 20’s are pretty cold sensitive. I was raised in an older home in a cool area and had a miserable time because I froze all fall/winter/spring. Let her turn up the heat *she’s not making it up*!!!!\nMany people have undiagnosed reynauds and other things like underactive thyroid that make them get cold *especially* young women.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 211,
                      "content": "Yep. Basically up to the age of 14 I could jump in the pool during winter (I'm in Aus, winter temps usually around 15-18°C) without any care in the world. I'd walk around in shorts and a tank top without needed to cover up. I'm only 23 now and the moment it drops below like 20°C I think it's cold and need to layer up. Hell it's currently feels about 21°C and I'm underneath a thinner blanket.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 155,
                      "content": "Dude same. I mean, different medical conditions, but 64 is too cold for me. We keep our house at 67 (even that's too low for me) but it's manageable. I mean, I'm uncomfortable, but only wearing a sweater plus fuzzy socks in addition to my normal clothes, so I tolerate it. \n\nBut my joints like to freeze, especially my elbows. Bent too long? \"Yeah, you're not straightening them, sucker!\" (A direct quote from my elbows.)  I'm 22 going on 90, I think. \n\nOP is definitely the AH and I feel for his daughter",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 140,
                      "content": "Also young children have more brown fat which helps keep them warm. Babies have the most and as we age it finishes greatly. So the 5yo probably is warm enough while the 22yo is frozen through.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 107,
                      "content": "Iirc most women are anemic. Blood loss is really bad for keeping iron levels up, and women bleed a few days a month.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "53 here and I too am afflicted by these conditions.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I have always been very cold sensitive and share those ailments. I’m the one in my fam most likely to pull out the head to toe cold weather coat when the season cool season is just getting underway and everyone else is still in jackets and it was something of a joke in my immediate family that I adored a pair of thick, warm socks or blanket or robe as a gift the way others would like a new electronic gadget. When I got to be an adult but was in the family house, I simply took over the electricity bill as part of my household contribution. Eventually though, it made more sense for me to get a space heater for my room and to layer up more fully in the cold weather, both for the general comfort of all the household, my budget and with a humble nod to environmental responsibility. It definitely helped cut down in everyone in the house bickering about the temperature. \n\nI’m confused about the sleeping under multiple layers bit. I have cold weather material pjs and sheets and thick blankets. In hot weather I may only use the thin flat sheet but in winter I may use the thick flat sheet plus the blanket or comforter. Is this unusual? Do people use the same weight and number of bedding items all year round, regardless of weather?",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I'm 50 and have Raynaud's. My hands and feet are ALWAYS freezing. I've lived my whole life in Minnesota, where it gets VERY cold. I used to be fine having the thermostat at 66F when I am home and 61F while I'm asleep. Now I have the house at 69F while I'm awake and 65F while asleep. That's my bare minimum, now.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It’s like you’re me but younger. Love the lol trifecta of autoimmune/crappy iron you’ve got going, because same.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "The worst thing is that I have Raynaud's and used to be the always cold one but discovered when I transitioned and started testosterone, it changes your comfortable temperature range but doesn't help the hands and feet. So now I just find a temp where my body is sweating but I have ice blocks for hands and feet 😭 (my desk has a heated foot warmer + USB fingerless gloves to use year round, and I just wear shorts and no shirt, it's absolutely ridiculous)",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "Sounds like a push to \"your 22 move the hell out already\" lol \n\nYta op, she's cold so you should accommodate to let her use the thermostat",
              "id": 16,
              "comments": [
                {
                  "score": 262,
                  "content": "Have you not experienced 21st century real estate and economy? No one can AFFORD to move out anymore. I'm sure she'd rather be on her own, but it's ridiculously expensive. I'm 40, I live with my sibling and his family. Because we both can't afford to live alone. 4 separate adults share the one house our parents left us because it's the only way to be in any way comfortable. And that's with us in 30s through 50s in age. 22? Either in school or just starting out and no way can they afford a place.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Lmao I was being sarcastic. I didn't move out till 21 myself",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Because Lisa is the one that matters now. Jane has been replaced,her physical needs are no longer a priority.  Even if you don’t think this is true, trust me, JANE thinks it.  Why else would you be concerned for Lisa’s comfort but not Jane’s?\n\nI grew up being the cold one.  I was lean, very little body fat, my mother was slightly overweight, my father moderately. They had a slower metabolism so they ran warmer.  I was cold all the time.  They refused to turn up the heat for me (but even THEY kept it warmer than OP keeps her igloo).  Oddly enough, after I moved out and they decided to remodel my bedroom into a computer room one of the first things hey did was replace the windows “because your room was cold and drafty!!!”  Everything I complained about forYEARS, that they dismissed, was true.  \n\nOP-how old are her windows??  Can you replace them??  Even window insulation plastic on the windows will keep it warmer and lower your heating bill. Would it be super difficult to put her room on its own heating “zone” with a separate thermostat so that she’s just heating her room and not the whole house?  Both this and replacing the windows would increase your home’s value too.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yes this passed me right off!!! Like you ask a 5 year old for advice???",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Ah, more child worshipping culture. Cater to the child, ignore the adult who isn't okay.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 602,
          "content": "I'm not going to believe that using an electric blanket at night uses more electric than heating the whole house.  I live alone and use one in the winter.  Why in the world would I heat the whole house when I'm sleeping?",
          "id": 22,
          "comments": [
            {
              "score": 203,
              "content": "A space heater will but my electric blanket costs about 4p per night to run on max all night",
              "id": 23,
              "comments": [
                {
                  "score": 163,
                  "content": "Only if you buy a spectacularly inefficient space heater or substantially heat a large space with one.  Space heaters aren’t as cheap to run as an electric blanket, but using 1 to heat a small room like a bedroom is usually substantially cheaper than heating the whole house.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 21,
                      "content": "It's the only way I could stand living at my parents.  They had zoned heating and it was set to heat the house as people moved around during the day...but that wasn't my schedule once I graduated.  So it would be in the 50s at night when I got home from work late at night.  A space heater to get it up to a tolerable temperature made my life much, much better.  One of the wonderful things about being an adult is controlling the thermostat.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "It really depends on how big and cold the bedroom is compared to the rest of the house, and what kind of whole house heating there is.  Generally speaking, it costs 2-5x as much per unit of heat to run a space heater (and there's no difference in efficiency among them), so probably useful if it's one room among 10 but less useful if it's one out of three.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Anecdotal, I know, but when I moved into my first apartment in my current city, they got the electric meter mixed up with another apartment in the building. I lived in a one-bedroom, the other was a 3-bedroom. In the 3-bedroom, the ladies renting that thought that they would save money by using space heaters in their bedrooms at night rather than turning on the gas heat. Color me shocked when I got a $700 electric bill! The mix-up was cleared up, but then they were on the hook for that. We (me and the girls in that apartment) talked about why their bill was so high, and they swore up and down they were only running the space heaters at night, in their bedrooms with the doors closed. And this was a bill for mid-October to mid-November, so not even really that cold (highs in the upper 50's-upper 60's, lows not really going below 40).\n\nSo let's math here. My electric bill was around $50 for that time. That ran all the same stuff as them, minus the space heaters (plus a smidge for the furnace fan, but those don't actually take much electricity, and mine didn't run much because it wasn't \\*that\\* cold). Let's (generously, their appliances were newer than mine and roommates will often cook at the same time...I always did that when I had roommates...\"Oh, hey, you're using the oven, can I stick my dish in there, too?\") say they used 3x that for lighting, entertainment, cooking, etc., since there were 3 of them, for a $150 \"expected\" bill. They spent $550 heating 3 bedrooms only at night, for a cost of $183 per bedroom. And, again, in \"cool,\" but not COLD weather!\n\nI have never...NEVER...had a utility bill as large as they did for a single bedroom! When all my windows sucked (they were 57 years old and so bad that snow would sometimes get between them and the plastic!) and were covered in shrink-wrap plastic to \"get through\" until I could get them replaced, my gas+electricity ran around $175/month for a 1600 square foot house (with the new windows and doors, it runs less than $100 in even the coldest weather)! My solar panels were installed before my first summer here, but running the numbers, if I was paying full board for my electricity, my biggest bill ever would have been around $150, using central A/C to 76 during waking hours!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "no, because a space heater has to heat the air and all the objects and the walls and thats very inefficient.\n\nturn on the heat in a car and your rear passengers won't be warm for a long while.  \n\n\nheated seats... and bam, toasty.   and thats only a 12v system!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 170,
              "content": "I started using an electric blanket during the colder months a couple years back, and the difference in my electric bill is barely noticeable. Even using a space heater for a few hours per day (on the low setting) only bumps up my bill a couple bucks.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "It doesn't, that person is crazy.",
              "id": 30,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 48,
              "content": "There is no efficiency issue for electric heating really, one watt from any source becomes the same amount of heat regardless. Only issue really is insulation or using focussed heating. Ridiculous to think a blanket would be worse at that.",
              "id": 31,
              "comments": [
                {
                  "score": 8,
                  "content": "1 Watt in a heat pump is a lot more efficient than in a resistive heater.  Plus while resistive heat is supposed to be the same, I've had different results with different style heaters.  For instance, straight glowing element with a fan behind worked a lot harder to keep my house warm over the same wattage oil filled radiator heater.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Electric blankets are nice, but have you heard of heated mattress pads? They are a game changer. My parents got one and my mom's chronic pain when she wakes in the morning is so much better. Then I got one, and even with electric blankets my hands and feet usually freeze and wake me up at night, but now they stay super toasty. We even got one for my 90 year old grandpa and he sleeps easier with it. I know it's not the point of the post, but goddamn I love that thing.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Not a good idea to leave an electric blanket on overnight. You can seriously over heat. And there could be electrical safety issues. I turn mine on before I go to bed - if it's very cold I wear socks and layers in bed.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Electric blankets are great for heating up the bed before you get in, but are not safe to leave on all night. Just ask our 90 year old neighbour whose house burned down. The blanket was relatively new and a gift from his daughter.",
              "id": 35,
              "comments": [
                {
                  "score": 5,
                  "content": "I’ve been waiting to see someone bring this up. Leaving space heaters or heating pads on all night is dangerous. Every time I’ve ever read the directions on either one of those (yes, I read the directions, my parents house burnt down and I’m paranoid) they always say don’t use while sleeping, especially heating pads. I’m not sure about heated blankets, I’ve never used one- I assume if it’s something designed to go on the bed, it’s safe to leave on all night.\n\nIt’s also unreasonable to expect that their daughter should only be warm when in her room or in bed. Using heat like that will make her more intolerant to the cold elsewhere so she’d be even more cold in every other room of the house. That’s why 60 degrees in the spring feels like a heat wave and 60 degrees in the fall feels like a cold snap.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 412,
          "content": "[deleted]",
          "id": 37,
          "comments": [
            {
              "score": 143,
              "content": "I have one room at 73 and one at 71; heat isn't on yet in the rest of the house and I get cold a lot quicker than my husband does, but  no room is even close to 60.",
              "id": 38,
              "comments": [
                {
                  "score": 57,
                  "content": "[deleted]",
                  "id": 39,
                  "comments": [
                    {
                      "score": 78,
                      "content": "I guess I'm weird. Our area has been hitting the high 40's at night and I have my windows open and fans on.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "I love the Cold. But my furnace isn't working and the interior temperature of my house is currently at around 68F. You bet your ass I have a space heater in every room that I turn on if I'm going to be in said room.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I wouldn't say that's cold at all. That's the absolute hottest I am comfortable in. My place is consistently 63-64F.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "That might be another option: a space heater or electric blanket for the daughter. That way, she can use it in her room at night, and she's only heating the room she's in since everyone else seems fine.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 133,
              "content": "It’s crazy how everybody is different. I don’t think I’ve ever set the heat to 72…I would melt.",
              "id": 44,
              "comments": [
                {
                  "score": 18,
                  "content": "Yes I’m surprised reading all the comments. I don’t turn the heat on before it’s 17 degrees. And I don’t even have a heater in my bedroom. I would melt sleeping in a warm room. I’m middle aged btw. And I do turn it on for visitors or my family because I’m aware of them might feeling the cold. But If I’m alone it’s cold here. My pets do have extra flooffy fur because they use to love my cold bedroom and choose to sleep on my bed (the have open access to the whole house).",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "We turned our whole HVAC system off a couple weeks ago because the weather has hovered at 60+/- 5 degrees. It's perfect",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I sleep cold with lots of blankets. During waking and living hours though I need heat. My hands and feet are like ice all through the winter. \n\nSo I can understand keeping a house chilly during sleeping hours. During waking hours though? Comfort is necessity.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 122,
              "content": "My fingers and toes turn blue at the 67° to 70° range. It's a me thing and I can bundle up real easy. My husband overheats so I don't mind having the apartment in that range cause I can bundle up, but it is more difficult for him to cool down\n\n60° is insane for not sleeping Temps. That is very cold. My area just dipped below this temp.",
              "id": 48,
              "comments": [
                {
                  "score": 97,
                  "content": "That's called raynaud's phenomenon I believe it's a chronic health issue. It's not normal, but they can't fix it. Like so many things. I have similar.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 14,
                      "content": "If you have trouble with your body temp due to a medical issue, in some places (australia) they have an energy rebate for people who need to use cooling and heating to regulate their temperature. You just need to get a med cert and call your energy provider",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Have you met its sexy cousin, livedeo reticularis? Because there is nothing hotter than having corpse-like legs.",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 70,
              "content": "I sleep best when it's 55° F or below and still have a fan blowing on me.  All I've got for covers is a sheet and thin blanket; no pajamas.",
              "id": 52,
              "comments": [
                {
                  "score": 34,
                  "content": "You're like me lol. I have my vent mostly blocked and window cracked in the winter because I love sleeping under layers",
                  "id": 53,
                  "comments": [
                    {
                      "score": 7,
                      "content": "We have our vent completely closed & a door shutting us off from the heat.  I love sleeping in a cold room.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Same!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I sleep under a heated blanket with the ac cranked to 60 and a fan blowing on full speed year round, idc if it’s the middle of winter that fan is staying on",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Wow, I would DIE!  I'd probably be crying, I'd be cramping and puking for sure. It's funny  how different we all are! 85 is comfy for me. No fan and a comforter even during the Arizona summer.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 68,
              "content": "72 makes me feel absolutely sick inside so it’s not for everyone. I’m fine outside at this temperature. \n\nI’m a woman and a normal weight. Have been like this even when 15 pounds underweight.",
              "id": 58,
              "comments": [
                {
                  "score": 75,
                  "content": "72 sounds awful to me.  Way too hot.  I sleep with the temp at 64 deg",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 407,
          "content": ">16c/60f or even 18c/64f is too cold for most folks.\n\nDon't come to Australia. Our houses are poorly insulated, and rarely heated in winter. Waking up to it being 16C inside is nothing. Put on some slippers and a fuzzy dressing gown. Some houses are 5C when you get up in the morning.",
          "id": 60,
          "comments": [
            {
              "score": 404,
              "content": "[deleted]",
              "id": 61,
              "comments": [
                {
                  "score": 216,
                  "content": ">This thread is baffling.\n\nThere is a reason the US uses twice as much energy per capita as many other similar wealthy nations. Apparently putting on a sweater is unthinkable.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 265,
                      "content": "No one is saying putting on a sweater is unbearable.  Everyone is saying that living in 4 layers and still being cold 24/7 is ridiculous.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 178,
                      "content": "Apparently thinking your house should be warm and comfortable is unthinkable. I don't live in the US and if someones house was 16 degrees I would be suprised.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Isn't that also because everyone lives in single family homes, drives huge trucks, has AC in most rooms etc? I'm in the Netherlands and 19c-21c is considered a normal room temp, but we don't use as much energy as the US.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I DO put on layers and heated blankets. It's hard to sleep like that and uncomfortable. Some of us need it warm.. 85 is nice and comfy year round for me. Desert girl would never make it at 60.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 183,
                  "content": "I'm from Canada so I genuinely don't know - how much humidity/moisture do you get in your winters? Here we need that much heat in order to be comfortable in part because it's incredibly cold and damp outside. \n\nI grew up in an old house that was heated to 16 most of the time and honestly it was pretty miserable, I was freezing all the time even with sweaters and slippers. It was mostly kept at that temperature to save on heating costs.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 130,
                      "content": "Canadian here with cheap ass parents who froze all of my life. Own my home now as a grown woman and keep it comfy - 22/23 C. Ridiculous to say 16 C is comfortable for a home in winter. Having said that we are battling -40 C outside so the furnace basically runs all winter 🥶",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "[deleted]",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "NZ has fairly damp winters but we don't get much below freezing outside normally and during the day it might be say 8C to 16C on your average wintry day.\n\nIt is apparently unhealthy for a house to be colder than 15C.\n\nMine in winter is usually 12C unheated, it's gone down as low as 9C. This is what I would normally wake up to. I don't heat the house overnight. It's cultural though, we are big on the old putting on another jersey mentality.",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 124,
                  "content": "yeah 21 C is tropical, and I'm a Brit. My heating is set to 15 C twice a day for an hour or so and that's fine for me.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Most people replying to this thread are coming from American thinking. Heat an entire house to 21 degrees in the UK currently and you'll end up with a huge energy bill. Last summer my sister in law had her house set to 20 for the winter. Her bills have risen to over £500 a month to try and balance it out. I kept telling her this is going to cost you come the spring whenever I stepped in her house.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I left the British isles for tropical weather decades ago and it is a common laugh amongst us expats about how when we go home we have to beg families to put the heating on as they rarely will and if they do they set it to arctic temperatures such as 15/16 degrees and thinks that everyone should be happy and any hotter a window needs to be opened.  Yet, everyone wears several layers of clothes……",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "as a floridian, getting my house DOWN to 21C EVER would almost push me to religion. one of my jobs is outdoors in mid-afternoon and it's been solidly between 33-35C up until this week. if we set our thermostat below 24/25 we can't afford it but getting things done in the house is possible for a couple hours at a time before the humidity the air con can't keep up with covers us in sweat. the tropics are not having a good time lately.  \n\n\nthat said, air con 21 and heat 21 are not the same. 21 is a blast furnace because heat rises. i can't imagine being comfortable turning it up that high. though, we don't run our heat unless it gets below 5 because the dust layer in the coils is a fire hazard. it just becomes the one time a year we get to build a blanket nest and not suffocate",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Father?",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I live in the tropics. 21 c is a bit chilly still.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 95,
                  "content": "here in Canada you have to keep the house heated pretty much 24/7 in winter, otherwise you get busted frozen water pipes.  and most of us get right cranky when we're cold as it is.    you do not want to have to deal with a teeth chattering ticked off canuck lol!   \n\n\nkeeping the thermostat at a constant same temperature actually costs less in the long run than firing it up only when needed or wanted.    i keep mine at 20 degrees from around the start of october til at least mid may.  \n\n\nand many of us have natural gas fed furnaces, that also use power.   lucky us, we get two utility charges/bills for just keeping our pipes from busting frozen all winter long.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "I used to live in the south island, some mornings my house would be 6°C indoors before we lit the fires",
                  "id": 78,
                  "comments": [
                    {
                      "score": 101,
                      "content": "I'm in the Netherlands and in winter, we're supposed to put the thermostat to at least 16c. If we would turn the heating off completely, the pipes would freeze.\n16 at night so that the house doesn't cool down as much and is easier heated during the day. Our heating runs on gas.\nAlso don't have a fireplace or any other means of heating the house.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "So I am in the US but my bill is only about $100 -$200 a month year round. It's really not bad at all. We get snow and it stays frozen for a few months in winter here. It has gone down since we got a new heat pump though, was about $50 more in winter before that. Still not bad",
                  "id": 80,
                  "comments": [
                    {
                      "score": 44,
                      "content": "[deleted]",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Also in NZ and I wouldn't consider turning a heater on unless it's 10C or lower. It's 17C right now in Auckland and I was honestly thinking about bringing the fan in from the garage soon cuz it's getting hot.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 68,
              "content": "Or cooler - electric blankets, hot water bottles…cheaper than heating a whole house, especially with energy prices going up with no end in sight. We run our house a little warmer during the day if we are home, but overnight we sleep better if the ambient temperature is on the cooler side, and if I remember correctly cooler is supposed to be better for sleeping - more blankets and a hot water bottle for me so I don’t roast my husband, who runs on the hotter side. Everyone is different so maybe something that heats just their bed, as i  totally understand that once you’re cold you stay cold for ages. Look at options rather than just both getting stuck on the overall temperature of the house.",
              "id": 83,
              "comments": [
                {
                  "score": 47,
                  "content": "> if I remember correctly cooler is supposed to be better for sleeping\n\nIt is. I don't sleep well if the room is over 20C\n\n&#x200B;\n\n> i totally understand that once you’re cold you stay cold for ages\n\nCold feet keep me awake in winter. So I wear socks to bed, and take them off before I go to sleep.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’m so glad I made it this far down the thread. I’m in the uk and I wake up to a house that’s about 6C even now in autumn. Especially with the cost of living crisis heating a house to 21C every night would be extortionate",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Grew up in uk and now live in Australia. Agree. 16-18 overnight is the perfect sleeping temperature. Cold room, warm body. Wool duvet/doona, toasty pajamas, he'll even an electric blanket underneath if needed. Bliss! Anything over 20 and I seriously struggle to sleep properly",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Thank you! I’m in my office this morning and it’s 14.5. It will warm up later but not more that 16 during the day and then we put the heating on in the evening. It’s fine, I’m just wearing some layers. Sure it would be nice to have it toasty & warm but it’s also nice not to bankrupt myself with heating bills.\n\nI feel like all these Y T A comments either don’t worry about money or don’t understand just how much it would cost to heat the house to 21.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I don’t even put my heater on till it’s 10C. I’ll wear slippers, my Oodie or put more layers on.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Agree. Aussie here. There's a halfway point between Brits who refuse to heat indoors until December because they're so stoic, and North Americans who expect to wear nothing but a t-shirt indoors in the middle of winter.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "As a fellow Aussie, I couldn’t help but chuckle reading that 18C is too cold at night. It’s been around 11C at my place every night and I find that perfect. Cold enough to snuggle in a doona but warm enough to have the fan on low.",
              "id": 90,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I was thinking the same thing. 16 degrees inside is pretty damn good mid winter. Uggies and oodie, we’re all set.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This is such a generalisation, I grew up in regional QLD (in old Queenslanders) and while winter temps could get below freezing, we had heating and a fireplace - *everyone* I knew had space heaters running at the very least. \n\nNow I’m in Melbourne and the rental minimum standards require landlords to provide fixed heating in all dwellings. I’m lucky to own a great east facing energy efficient apartment and it never gets below double digits with the place closed up, but we have heating if we needed it. \n\nI’m not saying there aren’t people who cannot afford heating/live in shitty houses with poor insulation, but it’s certainly not the norm in Aus for people to be comfortably living in 5 degrees Celsius.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "Too cold for most American folk maybe. It's perfectly normal and reasonable for the UK.",
          "id": 93,
          "comments": [
            {
              "score": 313,
              "content": "It's lower than the minimum the UK government recommends.",
              "id": 94,
              "comments": [
                {
                  "score": 118,
                  "content": "Then the UK government needs to pay for it lol. Most of us do not have that much money to piss away on unnecessarily high central heating temperatures",
                  "id": 95,
                  "comments": [
                    {
                      "score": 18,
                      "content": "In the UK can't afford heating at all. It's extra clothes and a hot water bottle, 4 layers is normal. It depends on what you can afford as to the temperature, she shouldn't be cold in principle but if you can't afford to run the house warmer she has to cope.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "The nhs has just recommended 18 dc. I’m sure there’s adverts on the telly every year. This seems to be what the thermostat is set to, so should be kicking in when it drops below that. If not then they need to look I need I why.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 274,
              "content": "I'm Canadian. I know how to handle the cold, but there's no way in hell I'm leaving my house at 16C all day. 20-21C is a reasonable temperature. 16C might be fine for some at night, but I personally don't like going lower than 18C. And, frankly, I think as a parent the needs of the children (adult or not) should come first. If she wanted the house to be at 25C, then they should compromise, but asking for the house to be 21C really is not a huge ask.",
              "id": 98,
              "comments": [
                {
                  "score": 88,
                  "content": "UK here. 20C is where I start being too hot",
                  "id": 99,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Imo, the perfect temperature is about 20C. But that's the average summer temp here, so it's what I'm used to. 18C is perfect for sleeping, but I want my house comfortable when I'm awake. I don't want to need to wear a hoodie, I want to be able to change without needing to rush. So starting to be too hot is better than being too cold imo. At least at this time of year. It's different when it's summertime and it's too hot no matter what I do.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 66,
                  "content": "Canadian there too.  I roast at 20-21 for sleeping.  It's okay if I'm just sitting around, but any amount of housework and it's too warm.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 35,
                      "content": "We don't keep it at 21 for sleep either, but they weren't just talking about sleep. They said they only keep the thermostat on for 2 hours all day, and then they only turn it up to 16. That's not a comfortable temperature to have the house at all day, unless you're doing a full deep clean all day every day, that is. Personally, I adjust the temperature based on what I'm doing. If I need to, I turn it down and open a window for a bit. But I'd rather be comfortable in my house than freeze. I'm sure OP's daughter feels the same.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Set the temp to be 20C. It varies but is generally 22-23 actual temp. \n\nI can feel it when it's under 20. And this is coming from someone who loves having a fan on all night year round.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Yeah, nah. I live in a part of the US that can get down to -30C and ~21C is a pretty standard temp for homes.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": " I'm seeing a lot of this. Our house is between 62F when we're sleeping and 66F when we're awake. I don't know how people do 70F that's too hot",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 144,
          "content": "I am in the UK and have my house at 16-18c. It is comfortable. I have a light blanket and jumper for the evenings.",
          "id": 106,
          "comments": [
            {
              "score": 41,
              "content": "Same here! Having the heat any higher and I wake up having hot flashes!",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 132,
          "content": "A heating blanket does not use more power than heating a whole house. Especially if it's a large house, multi-story, older, or poorly insulated.",
          "id": 108,
          "comments": [
            {
              "score": 12,
              "content": "Also, higher tog duvet. Get a 10.5 tog and you’ll be toasty. Heated blanket for getting into bed and a 10 tog duvet to keep you cosy?",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "Not that I agree with OP. But 60-67 is considers optimal [sleeping](https://health.clevelandclinic.org/what-is-the-ideal-sleeping-temperature-for-my-bedroom/amp/) temp. \n\n70, when you feel comfortable at 60 is very hot by comparison and it is easier to layer than peel skin off. \n\nHowever: a compromise of bumping to 65-68 might be doable. 70 is a lot. 60-63 is a lot (my folks keep it that cold and I agree it’s freezing). Some mid ground should be found. YTA though because if it’s so cold she’s layering just to sleep then it’s to cold",
          "id": 110,
          "comments": [
            {
              "score": 7,
              "content": "That's... Precisely what she's asking for.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 64,
          "content": "My mom kept our house at 62 during the winter and my toes would go numb after walking home from the bus. No amount of socks or hot water could warm them up. It was miserable. All I could was lay in bed under like 10 blankets. Major YTA",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Somewhere between 15 and 19 degrees C is the recommended temperature for sleeping so that's not \"too cold for most folks\", but it is too cold for the daughter and that's all that matters here.",
          "id": 113,
          "comments": [
            {
              "score": 17,
              "content": "So one person's comfort is all that matters?",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4883,
      "content": "YTA. \n\nGet the girl a personal space heater for her room or a heated blanket or heating pad. She obviously not making it up that she is cold. Who are you to tell someone that they are not cold or not hot.  \n\nI do understand not giving control of the thermostat to her but to not make accommodations for her so she isn't cold is where you're the asshole. \n\nAlso 16 degrees Celsius is freaking cold. (And yes this dumb American did have to google what that is in Fahrenheit lol)",
      "id": 115,
      "comments": [
        {
          "score": 1094,
          "content": "Has she always been cold in what you consider normal temperatures? If not, you might want to get her bloodwork done. I was cold all the time when I was anemic. (Also, YTA. it's unreasonably cold, you're clearly prioritizing one daughter over the other and you're not making any effort to accommodate your older daughter - space heater, heated blanket, etc.)",
          "id": 116,
          "comments": [
            {
              "score": 260,
              "content": "Or possibly thyroid issues. When mine was off I couldn't get and stay warm.",
              "id": 117,
              "comments": [
                {
                  "score": 216,
                  "content": "Or it might be the 16C issue...",
                  "id": 118,
                  "comments": [
                    {
                      "score": 18,
                      "content": "That’s colder than I keep my house in the summer! I’ve got central air (American) and keep the house a comfortable 20C (68F) year round now that I finally have a house with central air! If we’re having a super hot summer, we pull the drapes to block light and heat coming in and occasionally turn the temp up to be kinder to our bills *and* the environment. \n\nI grew up in a cold, drafty house as a kid. I slept in multiple layers, under multiple blankets and was always cold in fall, winter and much of spring. We used generators (no electricity to the property for years and years) and they got turned off at night to rest them, so no electric blankets or space heaters. It was fucking cold! No air conditioning either so you’d feel every single miserable degree of heat or cold. \n\nI’m going to be 50 this year and we finally bought a house with central air. It’s a comfy 68F right now. I’m under a single blanket on my extra comfy bed. A single layer of clothing. No need for socks! \n\nFor the other commenters with circulation/cold issues, I’m there with you. I’m a T-7 paraplegic and my body can’t regulate temperature below the injury line or from the bra band down. I have to monitor my legs and torso for warmth, make sure I’m not too hot or too cold and it can be exhausting. Now that the temp is the same year ‘round, my life is so much better. \n\nI hope everyone is able to find comfort, warmth and cool when needed. Much love to my blanket collecting and adorned brethren. \n\nOP, YTA!",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I mean that’s generally what I keep my house at in the winter, but I also 1) live alone 2) don’t have any conditions that prevent me from regulating my body temperature and 3) like being bundled under blankets because I like the weight of it. \n\nBut when I had temperature sensitive animals, in addition to giving them their own space heater, I upped my house to about 68-70F (I think I saw elsewhere that’s about 20-21C) because their health and comfort trumped my desire for blankets.\n\nMom and dad, YTA",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Right?! I don't mind being cool but we keep our house around 67-69. At night it'll go down to 62-64, but 60 is wild",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I have both anemia and thyroid issues so I was always cold until I started testosterone, now I'm always hot 🙃",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "She can feel warm when she’s at he grandparents house though.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 179,
              "content": "You raise a good point, but 16C is not considered normal inside temperatures, In places with renter's rights it's considered reason to withhold rent if the house can't be heated to 20C.",
              "id": 124,
              "comments": [
                {
                  "score": 4,
                  "content": "Where I live it’s 16 - had to look it up not too many years ago. Also that’s what I keep my place at. But I agree. OP is still an AH coz I’d never let my kids go cold",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "No I think it's the freaking 60 degree internal temp which is an ICEBOX when it's cold outside in a drafty UK home.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "We are talking about the 60s here. That is pretty nippy, especially in the morning before you start moving around.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "Foot warmer has totally changed my life. I found electric blanket way too large but I got something advertised as a lap-size electric blanket and i just make a little foot taco and it's all I need.",
          "id": 128,
          "comments": [
            {
              "score": 67,
              "content": "They even make ones with snaps up the sides, specifically to be folded into a foot taco whenever you want! Mine is advertised as being just the right size for your back or lap when unfolded, and for your feet when folded and snapped. Changed my life when I found it, it contains the heat so well, or at least it does when my cat doesn't steal it 😂",
              "id": 129,
              "comments": [
                {
                  "score": 7,
                  "content": "Link?? It sounds amazing",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My cats kept stealing my foot blankets, so I got special cat heating pads just for their beds. They don't get as hot as a normal heating pad and can be on all the time. They definitely appreciate them more and more as they get older.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I love \"foot taco.\" I do that with my blankets but now I know what to call it!",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "16 degrees is the lowest possible AC temperature. It’s freaking cold. 21 degrees isn’t even hot, it’s average temperature. OP is YTA.",
          "id": 133,
          "comments": [
            {
              "score": 136,
              "content": "I can't imagine many people in UK have heating on 21c. And definitely not during the night. I haven't even turned on the heating yet",
              "id": 134,
              "comments": [
                {
                  "score": 69,
                  "content": "I don't think I've ever had my heating set to 21°, I think that's just way too hot.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I think Reddit is showing its American bias.\n\nFor Americans reading this for most people in the UK during the day, inside and during winter/autumn 17°C is cold, 18°C is ok if wearing socks and a light jumper, 19°C is comfortable in a t-shirt, socks are optional, 20°C to 21°C is very nice, any warmer and you'll start to sweat.\n\nPersonally anything 25°C and above and I'll want to strip down to my underwear.\n\nOn a night anything above 15°C is acceptable if you're bedding a suitable tog.\n\nObviously there are exceptions, others have suggested the daughter may be anemic. Alternatively I think it could be that the UK has gone from pleasantly warm to unbearably cold overnight. But my point is 18°C during the day is normal in the UK not some kind of poverty.\n\nParents are still being unreasonable by not providing/allowing some alternative method of keeping Jane warm on the night.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "21-23° is termed the Goldilocks Zone and is considered to be optimum temperature - many women will feel 21 is a touch cold and men will think 23 is too warm as women tend to run slightly warmer so notice the cold more.\n\nEdit - having said that, I'd usually opt for 18 and a sweater. As someone who grew up in a house that only had a 3 bar electric fire in the living room, Central heating has turned me into a softy.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Yes i am kind of shocked by all the people who are telling 21°C is ok, i've always heard that 18-19°C was the best compromise for bill/ecology. And i get cold really easily, and yes, if i don't move my hand and feet are freezing, but i definetly understand the bill problem.\n\nEven last year in france, we had trouble with electricity, and the government asked us (and industry) to put the thermostat on 18°C max.\n\nAnd don't compare US salary to other country, the median salary in UK is 2313£ (and i don't know what tax you have to remove to that)",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Agreed. My Irish blood would start boiling at that temperature!",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 51,
                  "content": "I'm chronically ill and my heating went on yesterday. 17C until bedtime, when I turned the thermostat to 14C. Did not freeze to death in the night, am not drowning in condensation this morning.  It's 12C outside right now.   \n\nThere are a lot of people here imposing irrelevant views on this scenario. Of course there's a minimum room temp in New York City, it gets much colder outside than most of the UK does (and hotter in summer). You don't want to lose all your building heat to outside.  We *do* have a minimum working temperature for offices, and it's 16C (13C in physical jobs). You should be cooler at night than you are at work, for good sleep. We're at the same latitude as much of Canada, not the Mediterranean, so what people are used to in Florida *really doesn't matter*.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 15,
                      "content": "It's very odd to read these responses. I've never had heating on during the night, even before the energy price rise. It's nicer to sleep in a cooler bedroom. I prefer 20c during the day but not at the current prices so we set it at 18c.",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "16 C is waaay too cold for an office. People think slower in the cold and the average temperature for women to feel comfortable is higher than men. \n\n(Not from florida here).",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "I am in Scotland and my heating is on right now. But not during the night for sure.",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "My flat would swelter at 21. I'd dehydrate overnight like a prune.we don't have ac we have gas boilers and radiators.",
              "id": 144,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "But there is a difference between 16 °C blowing behind your neck and 16 °C in a room with stable air",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "She's 22.. can she not get herself these things?",
          "id": 146,
          "comments": [
            {
              "score": 411,
              "content": "She's not allowed. They don't want their electricity bill to go up. At all.",
              "id": 147,
              "comments": [
                {
                  "score": 298,
                  "content": "Energy bills in the uk are ridiculous at the moment to be fair. Very few people can afford to keep the heating on constantly.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 6,
                      "content": "OP responded to someone the bills are not the reason, just the prínciple. im in the UK too so i understand you but its not their reasoning. theyre just being TA.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "Why not have her contribute to the bill?",
                  "id": 150,
                  "comments": [
                    {
                      "score": 61,
                      "content": "[removed]",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 384,
              "content": "In other comments OP replied to she stated that\n\n1. She isn't willing to ask Jane to contribute to the bills in order to run the heat more.\n\n2. She won't allow Jane to purchase or run a space heater because it will make the electric bill go up.\n\n3. She won't allow Jane to purchase or use an electric blanket because she (OP) is afraid of it catching fire.\n\nOP is being uncompromising on any solution besides \"wear more layers\" when Jane is already wearing 4 to stay warm enough.",
              "id": 152,
              "comments": [
                {
                  "score": 50,
                  "content": "OP is forgetting that it's a lot easier to get warmer at night if you share a bed with someone.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That too! Especially a young child who produces tons of body heat.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "She could at least get her an old fashioned hot water bottle. Pad the bed with better bedding.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 7,
                      "content": "This is what I do when I get too chilly and don't want to run the heat more. I lost my home to an electrical fire as a child and have some unhealthy anxiety about certain things, and electric blankets are one of the things that really bother me. I understand logically that they're not particularly dangerous when well maintained, but I would rather use a hot water bottle because it has a similar effect with zero fire risk.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Or she could have a space heater because her parents are supposed to give a shit.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I do think it sounds like OP is trying to force Jane out. She could also be significantly skinnier than the rest of the family which would contribute, although the 4 layers - I do wonder if Jane is sweating and it's getting absorbed, thus making her colder. If I bundle up before bed, I will be cozy falling asleep but then just damp and freezing when I wake up.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 11,
                      "content": "OP said in another comment that Jane is a fair bit thinner than her parents as well. But 60F is just a ridiculously cold temperature to keep the house at for anyone, especially in a humid place like the UK.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "That's really awful. The poor woman is cold and has no solutions available. That's not fair.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I am so sick of hearing \"just wear more layers\". That's reasonable if Jane is walking around in a T-shirt - sure, that would be on her. But once you're past two layers each new one becomes really cumbersome and adds its own form of discomfort. Heating bills are stupid and it'd be fine for Jane to have to wear three layers (I usually do in winter, or more, myself) but she's got on FOUR, it's time to make a compromise.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Plus layers don’t really work for the parts that get the coldest like hands and face, especially at night",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "OK yeah that shows she is the AH here because she's not willing to do ANYTHING to compromise and solve this.  Modern electric blankets are VERY safe, and a small space heater for a bedroom or bathroom is not going to increase the bill much at all.  Further, the fact that she cites costs, but then refuses to allow Jane to help w/ the cost, tells me this is more about punishing Jane than anything else!",
                  "id": 163,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "OP- YTA!!",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "This is so weird to me, why isn't OP treating their 22yo daughter like an adult? Just let her get a space heater and pay for the bump in electric bills. I've had to do similar with a window ac unit because I need it to be cold to lessen the frequency of my chronic migraines. Everybody has different needs.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 116,
              "content": "Her parent is paranoid and thinks they’re too dangerous.  She’s not allowed.",
              "id": 166,
              "comments": [
                {
                  "score": 17,
                  "content": "That's um yeah 😐 \n\nI think personally I'd move out but I assume she might be paying little to no rent",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "That's what I've been wondering",
              "id": 168,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "I highly suggest electric blanket! You don't want to heat the whole house, just one specific area. They're very safe and they can be set on a timer.  \nA small heated blanket works wonders if you want to sit on the couch, then you can unplug it move it to your bedroom to lay on top of when you sleep. If you only need it when you're sleeping I suggest getting a heated sheets. They are the fucking best, do you know blanket on top of you is not the same as laying on top of one. And they tend to have a larger range of temperature compared to the blanket I've come across. Me personally I like it at like level 4 out of 10, but my parents love there's at like a level 9 or 10.",
          "id": 169,
          "comments": [
            {
              "score": 33,
              "content": "You should not lay on top of heated throws or blankets.  They’re not designed to be under weights when heating and can overheat.  If you want a warm thing to lay on, be safe, get a warming mattress topper.  They’re designed to be under a person’s weight.",
              "id": 170,
              "comments": [
                {
                  "score": 10,
                  "content": "I think something happening in this thread is that Brits all call mattress toppers heated blankets, I've never actually seen a legit \"heated blanket\" round here. They're all mattress pads.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Same. They are almost all to go under you. This is fine.",
                      "id": 172,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "They've been calling them electric blankets here since the 1920s. We know what we mean when we recommend them, as does OP.",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Oh, that's so interesting to me. Electric blankets - in Canada at least - are literally blankets that you plug in. I had a fleece-like one as a teen (because I slept in a very cold basement) and the instructions said to lay under it, not over it. It also came with a timer and temperature setting and I never felt unsafe. I'm not sure I've ever seen a heated mattress pad in person around here. We were recently talking to my family about heated/cooled mattress pads and how it seemed like such a novel idea for your mattress pad to be temperature controlled. It's funny that in the UK you have the opposite. \n\n\n(For the record I know that electrically cooled mattress pads are relatively new, but even the idea of a mattress pad being heated was new to us).",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Yes!  Listen to Kali!!  Don’t sleep on your normal electric blankets, sleep under them.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I hate when people try to disagree with me when I tell them how I feel. “I’m cold.”  “no you aren’t. It’s warm in here because I’m comfortable.” ok good for you.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2963,
      "content": "INFO\n\n> My husband and I don’t have an issue with the temperature of the house\n\n>  Lisa says it isn’t cold when we ask her, my husband and I also don‘t feel the cold\n\nHow does everyone's *body type* compare here?\n\nIs Jane significantly thinner than the rest of you, or something?",
      "id": 177,
      "comments": [
        {
          "score": 2713,
          "content": "5 year-olds are also highly suggestible. \n“It’s not cold is it?” is read by a 5-year-old as *“mum wants my support on the ‘it’s not cold’ statement - and I love mum!”*",
          "id": 178,
          "comments": [
            {
              "score": 1242,
              "content": "I’ve got a nibling that will stand outside in winter barefoot in a T-shirt and shorts and insist they’re not cold while shivering.",
              "id": 179,
              "comments": [
                {
                  "score": 591,
                  "content": "My dad always says it's \"not cold\". Recently we were on holidays and my mum was trying to figure out if she should wear her puffer jacket or not. I told her to wear it, as she can take it off if she gets too hot. My dad was like \"why do you need that, it's not cold\". So my mum left it in the car. As we were grabbing some things from the car before setting off for the short walk, a blast of cold wind came up. My mum went and grabbed her jacket. So then on the short walk the wind picks up, we're all toasty and there's my dad trying to act tough and not be cold. But he was freezing but wouldn't let on because he always criticises others that \"it's not cold\".",
                  "id": 180,
                  "comments": [
                    {
                      "score": 414,
                      "content": "Ah yes, the classic proving you’re manly by unnecessarily suffering trick.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "My husband is from New Hampshire.  I’m a California girl.  We met in March, both living in PA.  On a memorable early date, he wore shorts, and we had to duck into shops every block or two walking back to our cars after dinner, because he was so cold! (At least he didn’t pretend it wasn’t cold - just looked sheepish and admitted that he underestimated how much the temp would drop when the sun went down)",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My Grandpa almost got hypothermia because he insisted on going in a T-Shirt, Shorts and Sandals (with the obligatory tennis socks) to the City of Petra while on a cruise. \nEveryone told him to at least take a Jacket but he always says that “a real German doesn’t get cold” (he’s 85 and we are trying to teach him that sayings things like that aren’t ok anymore but old people 😅), but he had to get an emergency blanket because he was shivering so badly.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Hahaha my dad is the opposite - one draft and he's screwed. However, stick him in Dubai's midday sun and he is the happiest person on the planet! We call him a lizard since he obviously can't generate his own body heat!\n\nWe also turn the radiators off in certain rooms, because he will keep the house at 30C and the rest of us will get heatstroke otherwise! The kitchen is our breathing room!\n\nBut yeah, OP? YTA. You can turn individual radiators off and let your daughter have one room where she isn't deeply uncomfortable...",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "My 5 year old will always say “I like chilly” to not have to wear a jacket. They can’t be trusted with body temp regulation lol",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Last winter my now 6yo would be shivering, teeth chattering, goosebumps all over…*vehemently* insisting that he was NOT COLD, he was TOO HOT!!!\n\nI think he’s getting it now though, we had a discussion where I explained what it looks like when someone is too hot vs too cold and he didn’t contradict me this time (previously he would do so with increasing volume and intensity).",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Constantly trying to get mine to wear pj's or clothes now that it's getting cold. She'd rather run around in her nickers. It's been a little battle but we're getting there",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "While their lips are turning blue and they can’t hardly speak from the shivering?  I’ve got two niblings like that and I’m just baffled.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yep. Like, I’m cold looking at you!",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Mine have too be bribed to wear coats & stop wearing summer uniform after October half term, they refuse that it’s not cold when it’s frosty.",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "My dude, in the dark months in the North of England I’ll be shuffling around town in my winter layers between a sea of women in mini skirts and boob tubes and absolutely living  it.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I'm in the North of England myself, recently I had popped out to greggs to get a coffee, and as I was walking back to mine, there were a couple of girls (I say girls because they looked to be teens) in the sort of outfits I'd expect to see women in their 20s wearing at clubs. And this was at midday. I was all bundled up in thick jeans, a leather jacket, gloves and a beanie. All I could think about was how cold they must have been.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 244,
              "content": "My partner's ex does this ... \"I'll ask the boys how they feel about blah\". He will always frame the question so the boys know how to answer him .... \"you don't really want to do blah?\", \"you don't care if I don't take you to blah's birthday party?\"",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "I have this theory that kids don’t feel temperature before around age 9. That’s why they swim while their lips are purple, and don’t care about shorts in snow",
              "id": 194,
              "comments": [
                {
                  "score": 81,
                  "content": "Look up \"brown body fat\". Children indeed don't turn and feel cold as adults do, their temperature regulation works completely different.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Teen boys don’t care about shorts in snow or frigid weather, either. I livid in a frigid climate many years and can attest to that. Most start wearing jeans in winter at college age. A few holdouts who may or may not be rather slow to adapt.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 10,
                      "content": "My sister's husband wears shorts in the winter. Their toddler still refuses to wear pants & will only wear dresses & seems to also run hot. I'll be cold & they'll be fine.",
                      "id": 197,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 334,
          "content": "op said upthread that she and her youngest daughter co-sleep so the only reason they don't 'feel the cold' is because they're sharing body heat at night",
          "id": 198,
          "comments": [
            {
              "score": 127,
              "content": "Oh this makes a massive difference!!! When I stay with my parents I will run the electric blanket on nights that they don’t need one because they’re sharing heat and I’m not.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "Oh what the actual fuck?",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 68,
              "content": "You’re kidding. OP is a clown.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Thar was my thought, the 22yo doesn't have a human heater at night",
              "id": 202,
              "comments": [
                {
                  "score": 16,
                  "content": "Electric heaters actually cost less than human heaters true story",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 137,
          "content": "That was the first thing I was thinking. Every person here stating how they prefer cold temps or freeze at those temps probably has a different body type. I’ve been at very different body types in my life and the difference in how I’ve felt at different temps is remarkable.",
          "id": 204,
          "comments": [
            {
              "score": 19,
              "content": "Nah 16-18 degrees indoors is freezing, completely normal to feel cold. My flat is 18 during the winter due to my electricity bill and it’s cold as fuck - I suffer through it, but it’s not a comfortable temperature to live at\n\nEdit: oops responded to the wrong person. point still stands though",
              "id": 205,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I’ve lost about 20kg over the last 12 months, and the recent winter was the first one I’ve been through after losing that weight and oh my god I was shivering for like four months straight all the time. But even though I’m freezing during the day, I LOVE a freezing cold room at night to sleep in. I get so hot while I sleep, it’s bizarre haha. It’s started warming up a bit now but I still get cold when everyone else is hot at like 29°c",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 67,
          "content": "I'm wondering if Jane might have a health issue like hypothyroidism or anemia or.....well, seeing a doctor wouldn't hurt.",
          "id": 207,
          "comments": [
            {
              "score": 304,
              "content": "16C (61F) is a perfectly reasonable temperature to feel cold. Now if she was wearing 4 layers at 70F then yes definitely",
              "id": 208,
              "comments": [
                {
                  "score": 80,
                  "content": "I’ll just agree with you and leave this here. \n\n“The World Health Organization recommends a minimum indoor temperature of 18°C, or 20°C for houses with young children, elderly people or ill people. Damp and mouldy housing can affect health in several ways, particularly respiratory health.”",
                  "id": 209,
                  "comments": [
                    {
                      "score": 17,
                      "content": "NHS recommends 16-20C.",
                      "id": 210,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Not when she's been wrapped in a duvet all night. She needs a better/ thicker duvet if she's freezing all night at 16C. It's going to get much colder and she shouldn't need four layers of clothing currently if she had an adequate duvet.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I’m thinking other way around and this is a mom and dad thing. \n\nBoth men and women being experiencing a significant hormonal shift in their 40s-50s. For women it’s menopause, but men have a similar shift. \n\nBoth of my parents were normal about the temperature, like house is set 73-78 Fahrenheit depending on the season. And then around when they turned 45, suddenly the house was strictly kept no higher than 70F. I’d be wearing a sweater in the house when it was 100F outside.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I grew up thin with a family of average weight/slightly overweight builds. I was always freezing in our house as a teen in the fall and winter. My father recently lost weight and realized that I hadn't been being dramatic about being cold af all the time when I was living there!",
          "id": 213,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1813,
      "content": "16 degrees in house is fkin mad. I come from country with 4 seasons. During winter my house temperature was 15 degrees. Literally waking up in the morning I could see my own  breath while breathing. I understand that we live in fked up times thanks to cost of  living, but 16 degrees is way too low. 18-19 is fine u can wear thin jumper if u barely move.",
      "id": 214,
      "comments": [
        {
          "score": 589,
          "content": "It's also not even being kept at that temperature, they turn the heat on for two hours every morning. It's definitely not still 16-18-whatever degrees at the end of the day.",
          "id": 215,
          "comments": [
            {
              "score": 24,
              "content": "No it's set to 18C and they state that the rooms don't get below 16C at night.",
              "id": 216,
              "comments": [
                {
                  "score": 6,
                  "content": "Maybe! I don't assume they have thermometers in every room measuring that.",
                  "id": 217,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 179,
          "content": "Seriously. I was knocked unconscious at age 22 in a house that was around this temperature and almost froze to death wearing my everyday clothes. \n\nIf she’s cold, it’s not okay. Any parent who thinks she should just deal with it can call my mom to ask her about the trauma she has from finding me.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "If you can see your breath it’s around 7 degrees or below",
          "id": 219,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "If you can see your breath it isn't 15. It's currently around 15-16c in my house and yes, it's a bit cold but this isn't 'see your own breath' cold. And yes, temps drop at night, it's healthy to sleep in the cold and most doctors will tell you that - I have to sleep with a bedroom temp of 17 or below (and that was recommended by my doctor) because I have a deviated septum and allergies and I can't breathe if it gets hotter. \n\nIf i put the central heating on to 18c, everyone ends up sweating because we're naturally used to following the  seasonal temps and 18c created by central heating is NOT the same as ambient 18c.\n\n Allowing yourself to be cooler in winter helps you cope with lower outside temps too. I've never understood how people say 21-24c is 'room temperature' when that is literally late spring/early summer temps in the UK and having a house at 21 artificially is more like an ambient environmental temperature of around 26c outside.",
          "id": 220,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Bare in mind that the way thermostats work, they don't maintain an exact temperature. If it's set to 18°c it will drop to a couple of degrees below before calling for more heat.",
          "id": 221,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1197,
      "content": "For us Americans, that's \\~64F\n\nJust because YOU are comfortable does not mean HER constutiton is the same. There are a lot of reasons one person is cold when another is comforatable at the same temperature. Some of them are health related. Others are just the way different bodies work.\n\nOther alternatives:\n\nElectric Blanket (they come with timers, you know)\n\nHeated Mattress Pad (ditto)\n\nSpace heater in her room (double ditto. [Plug timers are cheap](https://www.amazon.co.uk/Timers/b?ie=UTF8&node=1938312031)!)\n\nBump the thermostat anyway.",
      "id": 222,
      "comments": [
        {
          "score": 993,
          "content": "No, it’s not.  16c is 60f, which is quite cold to keep a house when people are in it.",
          "id": 223,
          "comments": [
            {
              "score": 325,
              "content": "Either way I would be an ice cube lol.",
              "id": 224,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 222,
              "content": "Our 90y old house sometimes goes down to 17c in the early morning, it's still 18.5c when we eat breakfast but 20-21 during the day. We also go camping with the 2+6y kids in the mountains often, where it is below zero during the night. But there we bring sleeping bags made for that conditions! And we can warm up again during the day.\n\n16c during the night isn't so harsh, many people leaving their window open have that. It's 7c outside right now and most houses in the neighborhood have the windows on the bedrooms open. \n\nBut keeping it below 18 _all the time_, that is just insanely uncomfortable! If you need 4 layers, the sheets are obviously too thin. When the cold creeps in and you have no place to heat up, the fun is over. \nAdditionally,  mold might eventually become a problem.",
              "id": 225,
              "comments": [
                {
                  "score": 73,
                  "content": "I think the important thing is we went from a very mild start in October to single digits in a day. It’s been a big shock for a lot of people, my heating has been on for a week.",
                  "id": 226,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yep, we just had a really hot September and mild October and now it’s suddenly freezing. Literally last week I was in the garden and it was 20+ degrees and hot, then this week I woke up to it being 2° outside. The suddenness is jarring",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Keeping it below 18 all the time will also cause it the mould rapidly.  The walls will go wet. Like especially in the UK. If they can afford it, it should be at 20.\n\n\nBut 16 24/7 is insane.\n\n\nAlso saying well ‘I’m not cold so you stop complaining’ is also stupid. And bundling up does not prevent feeling cold either.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Yeah, everyone else in my house likes it warm in the winter/fall except for me. So to combat that, I have a floor a/c unit in my room. The absolute coldest it will go is 18c. So an air conditioners lowest setting is still warmer than what they \"heat\" their house to.",
              "id": 229,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I have a severe heat intolerance -- to the point that I have the heat vent in my room blocked during the winter in Wisconsin because it gets too hot -- and 60F is pushing it for me. I can't imagine what it's like for someone whose body can properly regulate its temperature.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "OP said it’s 16C at night and 18C otherwise (at least that was my understanding), which is what I think they were referencing. Still cold nonetheless.\n\nMost OSHA standards in the US require the temperature to be between 68-78F. In the winter my family has always kept our old, uninsulated house at 68 during the day, and 70-71 on extra cold days, and around 60-62 at night. I can’t imagine it being much colder constantly.",
              "id": 231,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I would be in constant pain at that temp, and if I wasn't allowed to adjust the thermostat, I would make sure everybody in the house knew exactly how much pain I was in.\n\nI had to briefly tolerate a similar situation in an Airbnb where the post had locked the thermostat to only be controlled by her phone. She went away for the weekend, and while she was gone the temperature outside dropped significantly. I had on fleece pajamas, wooly socks, house shoes, a terry cloth housecoat, and gloves, and my hands still hurt. I quickly sent her a text message and she turned the thermostat up to 65, which was livable so long as I wore long sleeves",
              "id": 232,
              "comments": [
                {
                  "score": 4,
                  "content": "You and me both.  I have Raynaud’s and an autoimmune disorder, and I spent substantial chunks of my adult life with low iron, sometimes to the point of anemia.  I suffer miserably when I’m too cold.  Everything hurts, and if I can’t get warm, there’s a chance of tissue death, which can necessitate amputation of digits (Raynaud’s is easy to manage if you can mostly keep warm, but it’s no joke in the cold).\n\nMy husband and I lived in a hundred year old brick house with terrible insulation for several years in Philly.  We had to curtain off our living room from the stairs and the kitchen and use a space heater in the bathroom (a later addition that we think may not have been insulated at all) to keep it warm enough to not harm me.  I had fleece pajamas, a thick warm robe, and sheepskin slippers with the wool inside, and we’d still end up with my husband using his own body heat to re-warm me after I’d brushed my teeth and gotten ready for bed. (Bless him, he is a dear sweet man, he’d be a bit comical about how cold my fingers and toes were sometimes, but he’d just snuggle in closer and pull my cold body against him until my side of the bed and myself got warm enough for me to stop hurting.)",
                  "id": 233,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 184,
          "content": ">Just because YOU are comfortable does not mean HER constutiton is the same. There are a lot of reasons one person is cold when another is comforatable at the same temperature. Some of them are health related. Others are just the way different bodies work.\n\nTHIS!! My husband and I are very different when it comes to feeling cold. I'm on my couch under a blanket and the room is about 73F right now and my feet are cold. I guarantee my husband is nice and toasty right now. There have been times over the years where I put my hands or feet on him and he asks if we're in the same room because of how much colder I am than he is. I do like it a bit cooler at night, but at the temp OP is setting their home I'd be freezing!!",
          "id": 234,
          "comments": [
            {
              "score": 60,
              "content": "Where you live also has a huge effect. I used to be perfectly comfy at 72 in NY now that I live in AZ and got used to 100 plus days most of the year 72 inside is cold af.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "Also just wanting to add - \"putting more layers on\" doesn't help for everyone, there are a number of medical conditions that can mean that the body struggles to warm its extremities regardless of layers. Active heating is needed. \n\nAlso as others have said, get her checked by a doctor. \n\nregardless of the reason, not taking her concern / comfort seriously will be doing direct harm to her mental health, quality of life and to your relationship with her. I run the other way, I cannot cope with heat. \n\nEven just warm weather makes me lethargic, gives me headaches, stops me sleeping and generally feel crap. My mental health as a teen always took a massive downstroke in summer due to people dismissing my complaints and making me feel like I was being unreasonable/lazy/weak - turns out my body keeps trying to warm itself when its already hot.",
          "id": 236,
          "comments": [
            {
              "score": 85,
              "content": "Yup, that’s me.  Once I get chilled, I’m incapable of re-warming myself.  Doesn’t matter how many layers or what they’re made of - it takes a hot shower or bath, or being pressed against or covered by a full body size object that is warmer than me to recover.",
              "id": 237,
              "comments": [
                {
                  "score": 8,
                  "content": "Oh shit, that's me too! Do you know the cause?",
                  "id": 238,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Mine is a combination of Raynaud’s phenomenon and a type of dysautonomia (mine is Postural Orthostatic Tachycardia Syndrome, but all types of dysautonomia can cause thermal dysregulation).  Anemia can also cause it, as can hypothyroidism",
                      "id": 239,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Also, sweat. Even if I'm cold I don't like laying clothes because I sweat. I'll be sweating through clothes and still be cold which is super uncomfortable. Or feel overheated and be sweaty in the layers--I hate wearing socks most of the time for this reason.\n\nI like shorts and tank tops while underneath blankets. I would pop my feet out especially\n\nMy mom would keep the house at 64-65 when I lived with her. I was always freezing. My house now is kept around 69-71, but my mom would be overheated by that",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I once complained that our house was (as always) far too cold, and my mum, without looking at me, said “well, put a jumper on”. To which I pointed out that I was in full Victorian Dress, including two floor-length petticoats and a cloak, and I couldn’t realistically put more layers on.\n\nI had been complaining that the house was too cold for a decade, and that was the first time she took me seriously.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes everyone always says \"if you're cold you can just bundle up\" but it doesn't matter how many layers I put on. My body will not provide enough warmth to combat the cold outside those layers for hours. \n\nMy boyfriend's mom keeps her apartment at a similar temperature in the winter (in the southern US!) and it's miserable to spend a night there. I bring my heated blanket and still struggle to get warm enough to fall asleep. Then getting out of bed and leaving the finally warm nest I've burrowed into is hell.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "My MIL loves it cold. The first time I brought my baby  (8 months) to her Northern Cali house, she hadn't turned the air on for mid fall. It was 58 degrees inside. I wasn't aware this was her normal behavior, and that baby was dressed for 72. I woke up freezing and cranked her air to 70 and held the baby until the didn't feel cold. I have never been at that house and warm. I know how to dress people there now. Fyi- she was not pumped about the thermostat change.",
          "id": 243,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Anything under 74f aka 23c would literally make me want to yeet myself off a cliff. But I’m from the south eastern us, so i start wearing hoodies and toboggans around September 1.",
          "id": 244,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1038,
      "content": "Where shall we start?\n\nPeople have different tolerances to hot and cold temperatures. That's just a fact.\n\nI have a daughter roughly Jane's age. She doesn't have an ounce of spare fat, and is cold in the summer (air conditioning) and cold in the winter (not hot enough for her). When she went to college, she purposely limited her choices to warm parts of the country.\n\nMy wife, on the other hand, is hot all the time. \n\nWhat Jane needs is a heated mattress cover. Nice thick duvet, heated mattress pad, and she'll be warm and toasty in bed even though you keep your house at 18 C in the daytime (and presumably it gets colder at night).\n\nSo YTA, because you're dismissing Jane's comfort as irrelevant. Turning the thermostat up isn't the right solution, because that's expensive, and will probably make the house too hot for you and your husband.",
      "id": 245,
      "comments": [
        {
          "score": 405,
          "content": "Especially refusing to get her a space heater or an electric blanket because they are concerned about fires even though there's a safety timer and fire safety mechanisms built in.  If you won't turn up the heat, you have to let her have some way to stay warm. Some people (especially older adults, but that's irrelevant) can even get legit hypothermia at temperatures between 60F and 65F.",
          "id": 246,
          "comments": [
            {
              "score": 116,
              "content": "Modern space heaters are also a lot safer.",
              "id": 247,
              "comments": [
                {
                  "score": 16,
                  "content": "I had one a while ago and not only was it timed with several heat levels, it had a little pressure pad on the bottom so it if was not sitting perfectly upright it would shut off. I had that thing going like mad and no issues. On the other hand, some of my bedroom fans have shorted out and I've woken up to melting plastic smell.\n\nNever was scared falling asleep with the heater near my bed. It was a solid purchase when I moved to Florida to Ohio and had to learn how to get used to actual winters.",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "At the fire station near me (and in a lot of parts of the UK) they do weekends leading up to the winter where you can bring in your electric blanket and get it safety tested if it’s an older one. This is all free too, obviously.",
                  "id": 249,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I got a hot water bottle last winter and fell in love. I put it under the blankets near my feet and it keeps my toes toasty. No fire risk.",
              "id": 250,
              "comments": [
                {
                  "score": 20,
                  "content": "My husband got me a lovely, 3 ft long hot water bottle with a soft cover for Christmas. I thought it was fantastic (we keep our house at 21) until I woke up one morning in a wet bed. LOL",
                  "id": 251,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Wow. Mine is less than a foot long. If I had a 3 footer, I’d probably roll over on it and pop it.",
                      "id": 252,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Wait, they refused to do that?  I must've missed that part.  They suck even more than I thought.",
              "id": 253,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I like how you said turning up the thermostat isn't the right solution. There are many options. I grew up in a house that set the temp to 14-15 C. To offset it, my mom got all of us nice down comforters. This, with sheet and bedcover kept us warm. Nowadays I have the most comfortable sleep with the window open and stay warm with my comforter. We also have a springtime midlayer for our beds in lieu of the comforter. Often I would keep this under the comforter. Even if temps were under 14 I'd  kick off a top layer for being too warm. Around the house I got used to wearing a sweatshirt and wraping myself in a wool blanket if it is especially cold. I also have a heated blanket (but I only really use it when I'm playing games on my computer). I'm older now and I truly believe cold endurance helps the health of anyone, but when you need to be warm you should have options. Sometimes all it takes is a shower, others a comforter, wool blanket, or heated blanket.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yes people need to know how fat can make such a difference (not sure if OP’s daughter is skinny compared to them). I was the only super skinny one in the family for a long time, and everybody found it a bit weird how cold i always was. Till my aunt lost a bunch of weight and then she was like: holy shit the winters are terrible now 😂😂",
          "id": 255,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 635,
      "content": "YTA.  If she’s already wearing 4 layers and is cold, turn it up a couple of degrees as a compromise.",
      "id": 256,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 595,
      "content": "YTA\n\nIt’s not that you can’t afford to raise the thermostat, it’s not that raising the thermostat would make the rest of you uncomfortable, you reject every single option for a heat source (like heated blanket or space heater) other than raising the thermostat, you just don’t give a damn about your daughter. You just don’t care that she’s too cold. Also 16 degrees is fucking insane to keep a house at.",
      "id": 257,
      "comments": [
        {
          "score": 138,
          "content": "And that’s during the day. They turn the heat completely off at night which costs more money anyway just because they’re truly stupid and spiteful.",
          "id": 258,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I’m still upset at how my family ignored the fact that I was always freezing at home and wearing 2-3 layers just because the rest of them felt fine at 18-20C (64-68F). \n\nThere are absolutely solutions that can make everyone comfortable, YTA OP.",
          "id": 259,
          "comments": [
            {
              "score": 5,
              "content": "That is freezing to me. We keep it around 72ish (22C) year round. Sometimes we \"sleep cold\" and turn it down to 68. I don't like to be hot when I sleep.",
              "id": 260,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 496,
      "content": "YTA because you refuse to allow her a space heater",
      "id": 261,
      "comments": [
        {
          "score": 255,
          "content": "Or an electric blanket. Like, wtf.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Running a space heater will cost more than just turning up the thermostat. I assume they are being cheap so spending more money is also going to be an issue for them. \n\n20c to 22c is the most common interior temperature during the winter.",
          "id": 263,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 405,
      "content": "Why do you favour your youngest over your eldest?",
      "id": 264,
      "comments": [
        {
          "score": 21,
          "content": "I wonder this as well.",
          "id": 265,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}