{
  "post content": " I (F33) am a proud owner of Peanut, my Yorkshire Terrier.  I took Peanut to the dog park today and Petsmart.  In the same complex is the grocery store I go to.  It was a warmer day and didn't want to leave Peanut in the car. So I leashed him up and took him in with me.  \n\nI had planned on a quick trip, no more than ten minutes. I went to the produce department to grab some stuff.  A guy, probably in his 30's, not an employee, rudely told me that pets aren't allowed in grocery stores and asked why I had my dog with me.  Before I could respond he told me it was gross as fuck to have my dog in the produce section.   I explained it was hot out and I planned to be quick in the store.  I apologized and said the most convenient thing for me was to come here with Peanut.  He told me to fuck off and not to be a lazy pet owner. Then he stormed off. It was a bit of a scene.  Feeling uncomfortable, I just left.  I thought it'd be no big deal, Peanut didn't misbehave or have an accident, And I didn't think I was being an asshole.",
  "id": 1,
  "comments": [
    {
      "score": 57144,
      "content": "YTA, as someone who works in a grocery store, dont bring your fucking dog to a grocery store\n\nEdit; im getting countless “what about service dogs” comments. Obviously this is not about service dogs, this is about pets. OPS dog is a pet, not a service dog. A service dog isnt going to piss in an isle, bark at a small child, try to bite other customers or run loose throughout the store.",
      "id": 2,
      "comments": [
        {
          "score": 20926,
          "content": "Exactly, it’s both unhygienic and inconsiderate to anyone with dog allergies. Plus it adds an potential liability to the store because it’s a violation of health code.",
          "id": 3,
          "comments": [
            {
              "score": 8353,
              "content": "Ironic because the dog's name is Peanut 😬",
              "id": 4,
              "comments": [
                {
                  "score": 8434,
                  "content": "It’s a Peanut allergy.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1338,
                      "content": "*angry updoot*",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 100,
                      "content": "r/thatsthejoke",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 80,
                      "content": "[removed]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1301,
                  "content": "So this is why everything in a grocery store \"may contain traces of peanut\"",
                  "id": 9,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Omg this one made me laugh.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3189,
              "content": "This.  There is no state there this isn’t a violation of a health code and give the store problems.  Be a good neighbor and owner (dogs can pick up hostility directed towards them) and keep your pup at home or order Instacart.",
              "id": 11,
              "comments": [
                {
                  "score": 2040,
                  "content": "even beyond health violations, its all around an asshole move. Its unsafe and inconsiderate. No matter how well trained your dog is, your dog can still bark or bite, some people are allergic and your dog might still shit in isle 9. Even if your dog is absolutely perfect, letting you in gives others the idea that it should be okay for them to do the same.\n\nAlthough if we're being real the dog is never even close to perfect. The owners will let them walk off-leash, the dogs will jump on the produce stands, bark at small kids, and will inevitably piss somewhere (and dont worry, the owner will never say anything about it and it will sit there to dry for hours)",
                  "id": 12,
                  "comments": [
                    {
                      "score": 871,
                      "content": ">letting you in gives others the idea that it should be okay for them to do the same.\n\nTHIS! This is now the problem in NYC Transportation. First we had people with small dogs in bags, then the medium dogs, now people with big dogs get on the subway. They are leashed but not muzzled, not bagged or crated. Right out there. This is actually a violation of the transportation code for the City. And with 8M people something is bound to happen one of these days.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 771,
                      "content": "Not to mention how it can affect service dogs - both their training and the public’s view of them being allowed in places",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 351,
                      "content": "And it makes the employees jobs harder because everyone is going to complain to them about the dog.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 174,
                      "content": ">will inevitably piss somewhere (and dont worry, the owner will never say anything about it and it will sit there to dry for hours)\n\nHad this at a bank the other day.  Everyone walking around in suits, and there's a big puddle of dog piss in the lobby.  I don't hate dogs, but they don't have to go everywhere with you.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 122,
                      "content": ">Even if your dog is absolutely perfect,\n\nEven if your dog is absolutely perfect, some people are really afraid of dogs and shouldn't have to manage their difficult emotional reaction in the produce aisle.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Also that their argument to the person that called them out was that this was the most convenient thing for them to do. So stuff everyone else right? Just take the dog home and go back to the grocery store if it's too hot.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "\"Letting you in gives others the idea that it should be okay for them to do the same\"\n\nThis is what people don't seem to understand, as a customer service worker. You're not special. If I break the rules for you, every single other customer is gonna start hounding me wondering why I can't do the same for *them*. You are making our jobs ten times harder.\n\nAnd also like generally, in my decade of experience - if you're the kind of person who breaks the rules in the first place, you're probably *not* this mystical exception who won't take advantage when I let you get away with it. If you're insisting that I let you sit down after closing, you're *not* gonna be fast. If you're insisting that I break health code so your dog can come in, then your dog's *not* gonna be well behaved. Because people who think they're so special that customer service workers should let them do whatever they want generally are not respectful or responsible enough to behave well.  \nThere is *nothing* that will make me stick to a rule harder than someone trying to convince me to break it for them. Because I just know. As soon as you're told why the rule exists, and you're still trying to break it, I know you're gonna make my night *hell* if I actually give in.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Plus it opens the can of worms of, well if she can bring her dog, why can't I bring mine? Some folks I guess feel entitled while most people are fine with observing private property rules.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "No, a legitimate service dog with service dog-level training will not bark, bite, or shit in isle 9, so that level of training is possible. It’s just entitled and illegal to bring a non-service dog in even if the dog is trained as well as a service dog.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Listen, I have a precious dog also-- a chihuahua named \"Jelly.\" And what I want to pose to OP is this: sure, *your* dog is one little dog, 10m, no big deal, whatever, hot day, convenient for you etc. \n\nCan you imagine if *everyone* shopping had a similar rationale for bringing their dog into the grocery store? It wouldn't be hard to imagine a scenario where a grocery store becomes overrun with canines whose owners had special circumstances.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "But it was the \"most convenient\" for OP!!! Everyone knows you don't have to follow rules or laws or even think about others if it feels more convenient for you not to.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "This is why people don’t respect service dogs. It’s sad when lazy pet owners ruin it for others in need",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2172,
              "content": "But you see, it was only 10 minutes. Everyone knows that the first 10 minutes are free and the dog only starts to be unhygienic and cause allergies at the 11 minute mark.",
              "id": 25,
              "comments": [
                {
                  "score": 399,
                  "content": "Like the three second rule but for dogs?",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Yes these are the same people who take the wheelchair parking spaces because ‘they’re only gonna be a minute’.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "So true!  We all know that the health code doesn't apply if violating the heck out of it would be inconvenient to the owner of a really cute dog.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 12,
                      "content": "But that rule only applies to the peasants' dogs, not *my* dog.  \n\n\n\\-OP, probably.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "But you see, it was just peanut.  Just one little peanut.  Not a whole *walnut*!",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Hey! It was the most convenient thing for her ! \n\nWhat else matters?",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Did you know that it's also totally OK to park in the accessible parking spots if you are picking up balloons for your kid?  Even though you don't have a permit because you don't have any need for accommodation except for an accommodation for your over-developed sense of entitlement?  Really, a guy parked diagonally across the only two accessible parking spaces told me so.  Because he was just dashing in real quick.  And it was for critical balloon supplies.  And the guy who was in a marked accessible van circling the lot looking for parking he could actually use was totally fine having to wait for balloon dude for 10 minutes.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1417,
              "content": "Also if there’s a customer with a guide dog the “regular pet” dog could irritate the fuck out of the working dog by barking/trying to get in touch with the guide dog",
              "id": 33,
              "comments": [
                {
                  "score": 789,
                  "content": "This has got to be one of the most problematic issues around having a service dog: entitled AH’s bringing their pets (or “emotional support animals”) places where they don’t belong. They can bark at, relentlessly try to engage with or even become aggressive towards the dog who is trying to do their very critical job. It’s so dangerous. It also makes it difficult for businesses to determine the difference between a legitimate service animal and a pet. So, so frustrating. \n\nYTA OP.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Yup. If it’s hot out and I’ve been to the dog park and need to go to the store I just take the dogs home first. Dogs are a responsibility and taking them home when it’s too hot to wait in the car is the responsible thing to do. \n\nI have a smaller dog and she is honestly more reactive than my big dog. The world is scarier when you’re tiny.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Yup entitled pet owners have absolutely ruined having service dogs in public. For example service dogs handlers get harassed non stop now due to so many badly behaved pets being passed off as one. \n\nMany countries have added more hoops for people to jump through to get on airlines with their dogs, even accredited program dogs get turned down  it’s really frustrating to see.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yes! And the AHs bringing their pets in (or worse, slapping a vest on an untrained pet and parading it as a service animal) give actual service animals and their owners a bad name.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Friend with a service dog was attacked by someone's random.pet they brought in that way.\nNot violently, but aggressive loud barking.\n\nNot sure who was more upset, the friend or her service dog, but it was NOT alright.\n\nMy menace would...well, be a menace. At least I've got the sense to know it.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 795,
              "content": "My kid is severely allergic to dogs. People are think I hate dogs. I don't I love them. Some people are just selfish",
              "id": 39,
              "comments": [
                {
                  "score": 233,
                  "content": "I am that way but with cats and several businesses in my area keep shop cats. Like my local pharmacy I can’t use it because yep they have a cat there. Let me use this epipen to by my epipen.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 111,
                      "content": "tbh as much as i love cats, i don’t think places should have a “shop/office/whatever cat”. besides veterinary & pet/pet friendly stores obviously. my uncle will swell up and break out in hives, sometimes his throat will also close if it’s bad enough, if he comes into contact with cat hair/saliva/whatever — and i know there’s many others that deal with the same. nobody should be stressed about going to the pharmacy because they have a cat hanging out on the counters leaving hair behind",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Wanted to second this. Mine carried an EPI pen for dander. Watching your child go into anaphylactic shock because some asshole brought their dog into a drug store is no picnic.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 675,
              "content": "Also inconsiderate to people who need service animals. I’ve seen reactive pet dogs bark and lunge at service animals either trying to play or out of aggression. It’s not okay.",
              "id": 44,
              "comments": [
                {
                  "score": 144,
                  "content": "This is a huge issue. So many service dogs wash out because of being attacked by untrained pet dogs. I love my dogs, but they’re farm dogs and thats where they stay.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I love my dog too, but I don’t bring her with me unless it’s a place that actively invites and welcomes dogs.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Exactly what happened to a family member's service dog. Got attacked by an untrained dog in a store and spooked the service dog badly. The service dog could do its job at home but unknown animals and people freaked out the dog. \n\nThousands of dollars and hundreds of training hours wasted because people are selfish. \n\nI love dogs but anyone who thinks they are entitled to take their non-service dog everywhere is automatically the AH.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 276,
              "content": "yeah… I think op knows he is TA as otherwise he wouldn’t emphasise the timing. the 10 minutes are not the problem. If I sneeze in OP’s food once or for 10’min the problem wasn’t the amount of times i did it",
              "id": 48,
              "comments": [
                {
                  "score": 25,
                  "content": "People throwing out suspiciously round numbers of minutes are pretty much always taking liberties with other people.\n\n\"I'll only be 5 mins\" says the prick in the disability parking. \"It was just 10 mins\"... people are largely useless at estimates at the best of times, and being defensive does not make it the best of times (more like blurst).",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "it’s also risky for service dog owners",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Hubby has a service dog, and while he is within his rights to take the dog there, he doesn’t unless he absolutely needs to. People taking their dog into the grocery store ‘just because’ are hands down ridiculous. There was no need for Peanut to be in the store. \n\n\nAnd how much do you want to bet that OP would have been absolutely appalled if anyone else brought their bigger dog to the store. Her tiny peanut is the exception and so is she! But other dogs in the store???? How could they??\n\n(Please note the heavy sarcasm towards the entitled OP)",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2087,
          "content": "Tbh I didn’t have to read any  further than “I am a proud owner of Peanut, my Yorkshire Terrier” to know OP was an AH. Tf does that mean?",
          "id": 52,
          "comments": [
            {
              "score": 559,
              "content": "Probably has an instagram for it and takes it everywhere.  Bet they finally got backlash and hence this post.",
              "id": 53,
              "comments": [
                {
                  "score": 116,
                  "content": "Hey I have an instagram for my large breed dog and I don’t take him anywhere against the rules.\nIt’s just fun to post pictures.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 253,
                      "content": "[deleted]",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "i don’t have an insta for my dog but my account may as well be hers lol. out of all 15 of my posts, 2 of them are non-dog related. i don’t like sharing pictures of myself, but my dog is fair game.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 327,
              "content": "LOL exact same reaction. Owning a dog is not an identity, nor anything to be proud of. Literally anyone can do it. It's meaningless.\n\nYTA for contaminating the grocery store.",
              "id": 57,
              "comments": [
                {
                  "score": 18,
                  "content": "I had a friend who would not only take her dog inside businesses (bank, insurance company) she would put it on the counter in front of the staff so they could admire her dog.\nShe would bring her dog to non Sunday church events and take the dog from to person “greeting “ them.\nI love dogs but boy was that annoying",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 156,
              "content": "I read that “proud owner” part and instantly knew Main Character Mary here was probably going to be the AH by the time I got to the end… 🤣 surprise surprise, she was!",
              "id": 59,
              "comments": [
                {
                  "score": 9,
                  "content": "But IT WAS PEANUT! And CONVENIENT for OP! How could they possibly be TA?!?! /s",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "I love dogs and I 100% agree. I've lived in cities where bringing a dog in is accepted and normalized and even still I never bring my dog in.",
              "id": 61,
              "comments": [
                {
                  "score": 13,
                  "content": "Some restaurants in my area had terraces outside and you could have your dog with you, they'd give it water, but I still feel super awkward, and would just rather not. My dog doesn't need to go everywhere with me.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Are you trying to say you've never heard of Peanut? He's only Yorkshire's most famous terrier. They named an entire legume after him.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "It's always the yappy little bitey breeds that people insist on bringing everywhere, isn't it",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "My mother in law's tea cup Yorkshire terrier was also named peanut... And he was the most shitty, yappy, barked relentlessly at even the gentlest of breezes fucking dog there ever was....\n\nUgh yep made me think asshole too lol",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "They managed to go somewhere and buy a dog.  Who wouldn't be absolutely super proud of that?",
              "id": 66,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "It means they're a mutt minded dog lover who only speaks doggishan language",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Haha, I started to raise my eyebrows about that point too. Like, everyone likes their pet animals, that's why we have them, but being *proud* of having a dog sounds like you really overestimate how much everyone else ought to give a crap about your dog.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1903,
          "content": "Someone had their dog WALKING on the produce at a Walmart in my town. LEAVE YOUR DOGS AT HOME.\n\nYta op",
          "id": 69,
          "comments": [
            {
              "score": 1242,
              "content": "Someone lost their huge lizard in our produce section at Walmart. When I saw them come in holding the lizard like a baby, I knew it was going to be bad. \n\nWe.had to close that half of store for 2 hours till the exterminator found him under the banana display.\n\nWalmart sued those people. I bet they won",
              "id": 70,
              "comments": [
                {
                  "score": 603,
                  "content": "Reptiles carry salmonella, that's absolutely infuriating. Reptiles have NO business near anyone's food.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 169,
                      "content": "We once got a lizard in the watermelon bin. Must have come up from Florida with them. The only acceptable way for a lizard to be in a grocery store.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": ">Reptiles have NO business near anyone's food. \n\nCan't wait for someone to defend it as their \"emotional support reptile\"",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Gram negative bacteria as well.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "By any chance did this happen in Ohio? I remember going on a late night snack run to a walmart in my college town and seeing a guy who had an iguana on his shoulder like it was totally normal.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Ahhh, Ohio. We are the Florida of the north.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "And thr other sad part is I'm sure the lizard didn't want to be there either and was likely terrified.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And this is why all produce goes straight into a bath when it gets home. Yuck! I love my dog but his feet are gross!",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "When I worked for Kroger this woman brought in her African gray parrot, on her head, eating her hair.",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 357,
          "content": "This, I had a a dog launch at me while exiting a store, it was a small dog and didn’t bite me but it definitely got defensive and the owner had so much slack on his leash",
          "id": 80,
          "comments": [
            {
              "score": 293,
              "content": "And imagine what would happen if it did that to a service dog. So many SDs are washed because they were attacked in public by dogs where they shouldn't be.",
              "id": 81,
              "comments": [
                {
                  "score": 305,
                  "content": "This! My SD has been attacked 4 times in public, grocery stores, by people having their pets in the store. After the last time, I had to wash him as he was hypervigilant and getting aggressive toward other dogs. I'm pissed because I can't afford to get another SD.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 70,
                      "content": "I'm so sorry this happened. Is there any way to sue the grocery store that allowed the dogs in? I don't like to be sue happy, but it's their fault for allowing the dogs in and you having to wash him. The least they could do is help pay for a new one.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I’m sorry I probably sound so dumb but I’m not familiar with service dogs. What do you mean wash him? Do service dogs not get groomed or something? Sorry I probably sound so dumb.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "My service dog in training got attacked 3 times and is now hyper vigilant as well. It sucks but he'll never graduate to full service dog.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I saw this happen at our local grocery store and I nearly lost it on the lady with the \\*absolutely massive '\\*emotional support' dog that lunged at an elderly Veteran's service animal. My husband is also a disabled Veteran and I don't think I've ever been that angry at anyone in my life. When she threatened to call the police, I told her I'd gladly wait for them to show up. She left. And the store gave me a complimentary cupcake :) Edit to add: I hope you have some recourse to sue the store. This should never have happened to you.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 266,
              "content": "Smaller dogs are the worst. I swear a lot of owners of small dogs fail to train their dogs properly because they’re small and they assume it makes their dog less dangerous. I’m still traumatized from an encounter I had a as a child with a chihuahua. Those dogs can be vicious!\n\nEdited to add: I don’t mean to say that small dog breeds are the worst; just that it seems, from my very limited experience, that many owners of small dogs let them act out more because they’re small/cute and, in the owner’s opinion, “not dangerous.”",
              "id": 87,
              "comments": [
                {
                  "score": 106,
                  "content": "This frustrates me so much. My last dog was a Chihuahua and he was abused before we got him, so he came with some behavior problems. We worked hard and he overcame them to become a wonderful dog. But while he was still struggling, people would constantly tell me that it was fine because he was so small. No, no it is not ok for him to behave badly just because he can't do significant damage. That's just stupid. Please leave us alone now.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I have scars on my ankles from a former client whose pack of \"chilinquents\" (a portmanteau he proudly made up for his delinquent chihuahuas) attacked me. Horrible animals.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "DON'T bring your ankle biter around me! My daughter has a scar from a dachshund. Her/Our GS would've changed diapers, if she could! \n\nWhy is it always little breeds brought into restaurants, stores, etc and treated like accessories?",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "When I take my kids to the park I only ever let my kids 3yo and 7yo pet the bigger dogs never the smaller dogs. Only once permission has been granted (never service dogs regardless of size). Being younger kids they don’t always know how to be gentle and smaller dogs are more easily overwhelmed and can become defensive/aggressive.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "If the behavior wouldn't be \"cute\" in a large dog, it's not \"cute\" in a small dog.\n\nAlso, my dad and stepmother are those obnoxious dog owners, though they don't take their dog into stores. They insisted on bringing her when they visited (didn't ask if it was ok, just we're bringing the dog). I had 2 cats. The dog chased them & barked the entire time one came out to try to eat. My stepmother thought we should shut the door to the bedroom where they were hiding, but they stayed all day (8 am to 9 pm). I told them the cats have to get to their litter box. I'm not moving it into a bedroom. & they didn't want to board their dog, but I should lock my pets away. \n\nThey also let their dog walk all over the furniture and fed it the meal I'd worked so hard making. The dog is cute, and was sweet when they first got it. They've made it obnoxious.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This bugs me so much! Like if it’s not “cute” when a bull Arab does it, it’s not cute when your tiny dog does it either.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "That you for pointing out it is an owner problem! I had two (one just passed) wonderful chihuahuas that I put a ton of work into training and socialising. Everywhere we went (including the vet) people were and continue to be shocked at what good boys they are. It gives little guys a bad name because assholes treat them as accessories and don’t put the work in to train them!",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Totally agree my large breed dog has been bitten more times than I can count by little ankle biters. One even ran out of a house into the street where we were walking by, bit my dog in the face and turned around and ran back. If my dog did anything remotely like that she would probably be put down.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "People with small dogs are also the worst at picking up their poop, which is a law around where I live. The smallest & the biggest dog owners are the same.",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "As a small/medium dog owner, I couldn't agree more. I made sure my two are properly trained to go to the stores they are allowed at. (Joann Fabric, Lowes, etc). But I see so many small dog owners treat them like \"oh well they are small, they won't do anything\" attitude.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My shih tzu is a dick. My large breed dogs are much better behaved than he is.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 200,
          "content": "don't bring your pet to any store",
          "id": 99,
          "comments": [
            {
              "score": 180,
              "content": "Well some stores are okay - pet store, for example.",
              "id": 100,
              "comments": [
                {
                  "score": 36,
                  "content": "Just to give a different cultural perspective, my local supermarket in Italy has just introduced dog trollies (carts) - they’re regular shopping trollies, but the end section is lined with Astroturf and there’s a clip-on lead. \n\nI now take my chihuahuas shopping with me. They sit there like statues looking at everything. Of course, you couldn’t do it with a bigger dog, because it wouldn’t fit!",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I see atleast 1 or 2 dogs anytime I go to Home Depot and Lowe’s",
                  "id": 102,
                  "comments": [
                    {
                      "score": 14,
                      "content": "And that's fair enough, those are the kinds of stores you expect you'll see some dogs, and don't have fresh produce about.",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Lowe's has signage specifically allowing animals other than service animals. It's also a fucking hardware store. Not a grocery store with things that people will be eating. OP, YTA",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "All the large pet store chains not only allow but encourage people to bring their dogs. Hence why she brought him to Petsmart. She only decided to dip into the grocery store because it was there and therefore convenient for her. Should have taken the dog home after Petsmart and come back for her groceries.\n\nEdit: there are other chain stores that allow dogs as a policy as well. Home Depot and Joanne Fabrics are notable examples. We also have many Mom and Pop stores in our area that are pet friendly, as well as restaurants that allow dogs in their outdoor seating areas. You are of course free not to patronize such businesses.",
              "id": 105,
              "comments": [
                {
                  "score": 29,
                  "content": "Joanne fabrics is surprising.  There's so much there that could absorb dander.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I used to work there. It was the most bizarro thing. I mean, a lot of fabrics should be washed before using anyway but still.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Even those, I would check. I was going to stop at home depot recently, with my bird in a backpack carrier, which used to be fine by them. I was even asked to bring him at one point, because I was buying supplies to build something for him, and the guy who helped me said to bring him in. \n\nBut, last time I went there, there was a no pets sign on the door. And that's fine, I didn't get upset or anything, we just went back to the car, it's all good.  I'm just saying even if it was their policy or it's the policy at other stores in the same chain, always take a second to check for a no pets sign. (And just assume no pets of course unless they tell you it's allowed.)",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Guys, guys, guys… come on now… stop calling her an AH. She was just doing what was convenient for her. F everyone else in the world.",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Nicely put! Nothing aggravates me more when I do decide to go to a store and see an \"emotional support animal\" pissing all over the floors and marking their territory on everything that touches the floor.\n\nOP, STOP TAKING YOUR DOG INTO PLACES THEY DONT BELONG. YTA!!!",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Exactly, and especially when non-service dogs are very prone to attacking service dogs in locations like this. Saw it a few times working at a grocery store, where we had a sign that only service animals were allowed. OP YTA",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Hopping on top with a personal story about a Yorkie in a store. I was walking up the stairs in a store that did not allow pets. The Yorkie lunged at my dog, MY MOBILITY SERVICE DOG. He tried to position himself so I could brace and the dog nipped my ankle and I fell. My dog was so distraught. After that, even after extensive rehab training, he was afraid to walk up stairs with me outside the house and he would try to body block if we encountered a small dog. He was done, washed out. I cannot afford another dog. A shitty dog owner just like you took away my ability to safely move about in public and ruined an irreplaceable medical aid that cost me over $20,000 and nearly 3 years to train.\n\nYTA.",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "How is this even a question…I’ve literally never seen a non service dog in a grocery store and OP wouldn’t have given us all the reasons why she was doing it (hot out, quick trip, same area) if she didn’t already know that pets in the grocery store aren’t a thing…YTA",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22156,
      "content": "YTA\n\nI adore dogs. I don't want to see them in grocery stores (service animals being the obvious exception). If it's too hot for the dog in the car, you run those errands later.",
      "id": 114,
      "comments": [
        {
          "score": 5227,
          "content": "Or do a drive up pickup - I often schedule it so it’s at the end of dog park time. Covid gave us so many options without needing to bring dogs places they aren’t allowed.",
          "id": 115,
          "comments": [
            {
              "score": 889,
              "content": "Yes!!  Drive up has been a blessing even post pandemic.",
              "id": 116,
              "comments": [
                {
                  "score": 31,
                  "content": "I use it SO MUCH. I love not having to trudge around the store for an hour after a full day of work, and then still have to go home and make dinner. It saves time and sanity.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I have a newish baby and grocery drive up, instacart and door dash are the threads by which my sanity hangs.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 911,
          "content": "In my country it's entirely accepted to just tie your dog outside to a post, and then run inside to do your groceries.\n\nNo need to put a dog in a car on a warm day. No need to bring them in.\n\nOP is YTA",
          "id": 119,
          "comments": [
            {
              "score": 1547,
              "content": "Unfortunately that's a great way to have your dog stolen in the US. Especially a purebred one.",
              "id": 120,
              "comments": [
                {
                  "score": 547,
                  "content": "Your dog would get nabbed in the UK, too.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 211,
                      "content": "germany too-isch. \n\nYou can run in and grab a drink IF you can see the dog from the store window. \n\nBut you only need to worry about purebreed dogs, small ones even more.\n\nI am happy our local store (like thoose that have shampoo, pencils and so on) let you enter with your dog to quickly grab something to drink. but 99% of stores, this is a no-go.\n\nedit: i found it cute how a cashier was like \"you know your dog dosen't have to wait outside? But i'll keep an eye out for you.\" (small town, noone wanting to pay rn)",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I live in Britain and i often see dogs tied to a post outside a shop, so it's definitely something people do (and they wouldn't if the dogs were getting stolen).",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "What I've learned from Reddit about the US is that everything gets stolen if you leave it unattended for a tiny little bit",
                  "id": 124,
                  "comments": [
                    {
                      "score": 11,
                      "content": "As a kid I left my bike on the driveway while I went inside to use the bathroom. Came back out and it was gone. \n\nAlso had a bench and a pair of Japanese guardian dog statues stolen off our front porch. Most people chain their barbecue grills to trees or their porches. It's sad.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Yep, even fun things for the community. For halloween it's pretty common practice to leave out a bowl of candy with instructions to take one piece. I did that last year and someone took not only all of the candy, but the fucking bowl too. They left a tiny pumpkin in its place, at least?",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 208,
              "content": "Also, if it’s *really* hot outside it may not be safe for your dog to just be out there on the pavement. I live in Texas so I’m used to 110s where the only place my dog can go without her booties is grass.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This is very dependent on where you live. I strongly advice against doing that when you are literally anywhere else.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "The problem is every asshole with a dog in a store will claim it’s a service animal. Which will either be just total bullshit or one of those fake service animals where you get an internet “doctor” to write you a note for like $40. \n\nThere really needs to be a massive crackdown on this.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I am the same. I hate this new trend of dogs in carts in grocery stores and target/Walmart. Especially small dogs bc the owners think it's more acceptable. \n\nI really adore dogs in general and love my dogs and we do outdoor dining often in dog friendly patios. Our dogs are socialized and well behaved too. \n\nBut dogs don't need to go every single place with you either.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Or leave the dog home! Time and place for everything. I go into the pet store and I expect to see a dog or two. Grocery store, not so much.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17095,
      "content": "Yeah, YTA.  No pets doesn't mean 'no pets unless it's inconvenient to follow the rules'  or 'no pets except for for a few minutes'",
      "id": 132,
      "comments": [
        {
          "score": 2906,
          "content": "Exactly! OP’s minor convenience does not trump the rest of society’s reasonable expectation of hairless produce and slobberless floors.",
          "id": 133,
          "comments": [
            {
              "score": 527,
              "content": "don't forget pee'd on products, chewed packaging and shit smeared floors",
              "id": 134,
              "comments": [
                {
                  "score": 172,
                  "content": "Or tripping over the fucking thing while OP is looking for something. \n\nThere’s a lot going on in a supermarket; pushchairs, wheelchairs, shopping trolleys all of which could hit the dog. People don’t generally keep their eyes on the floor when walking around a shop.\n\nNobody should be put in a position where they could injure the dog or themselves because OP is a dipshit.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Touching and holding the dog and then touching the produce is not great",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Why do I feel OP will never understand this in any situation",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 961,
          "content": "I think you guys are forgetting that OP's convience is worth more than others health and safety. They're special and the rules don't apply to them like they do to the rest of us.\n\nYTA all the way",
          "id": 138,
          "comments": [
            {
              "score": 13,
              "content": "This post is the epitome of this amazing song: https://www.tiktok.com/t/ZTRnRUkFa/",
              "id": 139,
              "comments": [
                {
                  "score": 7,
                  "content": ">https://www.tiktok.com/t/ZTRnRUkFa/\n\nThe FIRST thing I thought of when reading the title 🤣",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 414,
          "content": "But she's a proud owner!",
          "id": 141,
          "comments": [
            {
              "score": 115,
              "content": "Acting like it’s some sort of accomplishment to own a dog. I don’t brag about being the proud owner of a television.",
              "id": 142,
              "comments": [
                {
                  "score": 9,
                  "content": "It must not be a nice TV, then. This lady's dog must be an amazing dog.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "She shouldn’t be. I already hate Peanut.",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 325,
          "content": "Way too many people these days think every rule comes with an \"unless it's inconvenient\" or \"unless you personally prefer otherwise\" exception. News flash: If that's you, an inconsiderate asshole like you was probably the reason that rule was made to begin with.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 251,
          "content": "When I was growing up, no one would have dreamed of doing this.  Dog owners have become so entitled.",
          "id": 146,
          "comments": [
            {
              "score": 73,
              "content": "I'd love to bring my dog everywhere, but I also realize that I live in a society, where what I want isn't always the best for the whole.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I completely agree. It’s ridiculous how normalized it has become. I love my dog, but she’s just that: a dog. It’s not hygienic to bring them into stores where they can shed or drool on items.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Yes, everyone has some kind of exception. My friend and I were walking my dog one morning and decided to stop for coffee. She waited outside with my dog while I went in to order for us both. There was a guy with a corgi in line in front of me. The cashier repeatedly told him that dogs were not allowed, but they guy just brushed it off, saying, \"Oh, I'm just here to pick up something.\" Well, yeah. Isn't a coffee shop a place where every person is just picking up something? Then the corgi man proceeded to ask for two cake samples before ordering his coffee. To be honest, it's rare to find a worker that will call out a dog in a shop, but I wish they'd followed through and refused to serve him so that he won't do the same thing next time.",
          "id": 149,
          "comments": [
            {
              "score": 44,
              "content": "One time I was in a cafe with a super narrow aisle and I was squeezing between the line and the wall and accidentally stepped on the tail of some poor pup I didn’t see. Her owner shot daggers at me and I felt bad but honestly maybe it wasn’t the best idea to bring your small dog into a super crowded shop with no room to breathe?",
              "id": 150,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "As a barista I just want to say I wish more people were like you. Sadly a lot of people with dogs lie about them being a service dog and while we are allowed to ask what task they help with most of us don’t because it’s too busy or we don’t think it’s worth it because we don’t want to cause drama. We have mobile order ahead and people still bring their dogs in to get their drink. Just because your dog can fit in your arms doesn’t mean you can bring it in. I promise you that you can see your dog from inside the store if you leave him outside for a minute. That said we had a very nice couple in our store today with their alleged service dog (the dog had a vest) and their dog was very quiet and well-behaved the entire time they were there. I’m inclined to believe they were truthful about their dog because he/she behaved like I’d expect a service dog to.",
              "id": 151,
              "comments": [
                {
                  "score": 26,
                  "content": ">  That said we had a very nice couple in our store today with their alleged service dog (the dog had a vest) and their dog was very quiet and well-behaved the entire time they were there. I’m inclined to believe they were truthful about their dog because he/she behaved like I’d expect a service dog to.\n\nLegit service dogs (not just \"emotional support animals\") are always much better behaved because of how much training they've had. I love seeing well-disciplined dogs in general. I don't get why so many people think hyper, jittery, whiny, and/or needy dogs are \"cute\".",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Ohhhhhh this makes me so angry because I love corgis and this owner doesn’t deserve his dog. If you see him again tell him “YTA” even though he didn’t ask lol.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Oh my gosh!! Dog owners do think their dog is some kind of special exception.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "If everyone brought their pets, it would be a disaster. \n\nThat's actually a good way to judge most situations. \"What if everyone or a lot of people bent/broke this rule?\".",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "But peanut didn’t even have any accidents !! Give me strength \n\nWhat has happened that somebody would even consider this is an acceptable idea unless a service dog ?\n\nI’m 30F so it’s not an age thing\n\nBizarre",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "If it's just for a few minutes, leave the car running and lock the doors.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I work in a hotel and get the same call often. 'Do you allow dogs?', 'Only guide dogs, no pets are allowed', 'even small dogs?', 'sorry, no pets are allowed', 'he is really well behaved', 'no pets are allowed', 'Ohh..'",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10370,
      "content": "It’s literally the health code that PET animals are not allowed in the grocery stores, with an obvious exception for service animals. YTA.",
      "id": 159,
      "comments": [
        {
          "score": 1654,
          "content": "I love in a very dog-friendly area and I really wish the people here understood this. More often than not, the dog is untrained and obnoxious as well 🙄 ETA: oops forgot to include YTA",
          "id": 160,
          "comments": [
            {
              "score": 472,
              "content": "Trained or untrained is irrelevant. I’m a K9 handler and my dog has amazing obedience however it’s still an animal that thinks independently and can go off in the blink of an eye. Most pet owners do not know how to read animal behaviors which is why you see so many dog fights in dog parks and people getting bit by dogs where the owner says “my dog is friendly” or “my dog is very well trained.” Bullshit. You can’t control your dogs behavior 100% of the time. Op YTA",
              "id": 161,
              "comments": [
                {
                  "score": 56,
                  "content": "I can attest to this. \n\nI am a professional dog trainer and my K9 and I are a search and rescue team. She's also undergoing therapy dog training. My dog is absolutely fantastic and extremely well behaved. I often get asked if she's a service dog. Nope. She's just a well trained working dog.\n\nI could easily get away with bringing her into markets and other stores. But guess what? I don't, because she's still just a dog and I respect other people's space.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "I think the person you're replying to isn't saying that well-trained dogs should be allowed in stores, but just that they're often untrained *on top* of being brought into the stores by their owners.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I have a 50 pound mutt that loves everyone and normally doesn't have any issues but when I took her to home depot (dogs are allowed there) she took a shit in the lighting department. It was embarrassing but we bought paper towels, disinfectant cleaner, and a bottle of febreeze so the employees wouldn't have to clean it up, that being said I couldn't imagine how foul it would be if she had done that in a Kroger.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yup, we had had our Malinios/pitt mix trained by a very good handler.  He echoed the same thing.  He hammered in the fact that dog parks are very bad places to take dogs, even if yours is incredibly trained.  He said while you can control your dog, others either won't or don't control their's.  He makes sure every dog that goes through his training their owners have to spend one full day of the last two weekends if the training being trained along with their dogs.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I was working when I walked into a local boutique. The store owners dog just ran up and bit me. My employer required that I file a police report.",
                  "id": 166,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 157,
              "content": "Ugh same! Someone once called my service dog “unfriendly” because I wouldn’t “let” him play with the guys TWO barking and growling dachshunds in the middle of the bakery section! Of course no employee came to see what the commotion was about because yayyyy puppies!!!",
              "id": 167,
              "comments": [
                {
                  "score": 17,
                  "content": "My friend gets SO MUCH unwanted attention both for herself and her dog. People demand to pet the dog, pull the handle away from her, and jostle it around, call her all sorts of names when she says the dog is working. Dogs harness is covered with \"WORKING DOG\" and \"PLEASE IGNORE\" patches. Society treats these animals more as a source of their entertainment than what they actually are: a mobility device. When the harness is on, you don't even make eye contact with the dog if you can help it.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Try to pull the handle away from her??? That’s absolutely insane. I mean it’s all atrocious, and we should all respect the job service dogs perform and not do anything to put their focus in jeopardy. But grabbing their handle away is like next level insane. Bc if I was walking my normal dog down the street and someone tried to grab their leash away from me, I’d assume they were trying to steal my fucking dog! I mean that’s pretty much the only outcome, right? There’s no innocent reason someone forcibly wrests control of your pet’s lead away from their owner. And that’s without even taking into consideration that the dog is performing a medically necessary, live saving job for their owner!\n\nIf that ever happens again, tell your friend to treat it like an attempted dog napping to the public (scream “they’re trying to steal my service animal! Help! They’re stealing my dog!”) and ask someone to call the police (or do it herself if she’s alone). When they arrive she should not only report it as a dognapping, but also an attempt to sabotage a life-saving medical device.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This is another reasons it’s so awful when people lie and say their pet is a service dog — they encourage people to pet and play with their “service dog,” and people then have the impression that petting and playing with service dogs is okay — which it absolutely is not, ever.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "I know a guy that regularly brings his half Dachshund half Chihuahua into the grocery store and that dog has a poo \"accident\" every single time. Yes, the guy is as much of an asshole as you can imagine.",
              "id": 171,
              "comments": [
                {
                  "score": 15,
                  "content": "Why don't you kick him out the second he does that?",
                  "id": 172,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Cause service workers don’t get paid enough to deal with a lunatic who thinks their dog is a special little baby who should be allowed anywhere",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Why don't I kick him out? I'm not a store worker. I am a person he was telling anecdotes about his dog after the fact. I no longer have contact with him so it's a moot point.",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Plus an untrained dog can be a distraction to a service dog.",
              "id": 175,
              "comments": [
                {
                  "score": 11,
                  "content": "I heard of pet dogs even attacking service dogs.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "yep i live in nyc and there is at least one dog (not service animal) in the shop every time i go to the grocery store. usually with the owner paying the least amount of attention to it while it zigzags through others paths too",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "It’s the health code for a reason. Do not bring your pets into grocery stores.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And OP was clearly aware of the \"no pets\" sign they strolled by, thinking \"clearly they mean everyone but me.\" \n\nAlso I've never met a Yorkie that wasn't an awful, irritating yappy asshole that tried to bite everyone.",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6416,
      "content": "[deleted]",
      "id": 180,
      "comments": [
        {
          "score": 1048,
          "content": "It’s really not hard to check what stores allow dogs and what stores don’t. My parents dog goes with them to pet stores and to Home Depot because those are the two local places that very clearly state they allow dogs. Their dog gets to socialize and get some pets and dog biscuits while my parents get shopping done.\n\nThe grocery store does not allow dogs, so the grocery store errands happen on a trip that doesn’t include the dog!\n\nIt’s that easy.",
          "id": 181,
          "comments": [
            {
              "score": 621,
              "content": "Not to mention, as a general rule of thumb, if there is food being sold there (restaurant, grocery store, etc), pets are not allowed due to health code issues.",
              "id": 182,
              "comments": [
                {
                  "score": 74,
                  "content": "Even if it wasn't in the health code... I'm not trusting my dogs round what is in their eyes dog buffet heaven, trained or not. Op is out of his mind.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 173,
              "content": "The grocery store chain I frequent asks people not to bring in their dogs (if they aren’t service dogs) and specifically mentions the produce section as one of the big reasons.",
              "id": 184,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 373,
          "content": "It is quite unhealthy for both the owner and pet to be this dependent on each other.  It isn't cute. It isn't adorable.",
          "id": 185,
          "comments": [
            {
              "score": 206,
              "content": "[deleted]",
              "id": 186,
              "comments": [
                {
                  "score": 26,
                  "content": "We tell the cats “we are going shopping” if we plan to return that day and “we are going on a trip” if we will be gone overnight. Honestly, they seem to understand.😹",
                  "id": 187,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I do this, too, but I never get approval for any trips.  I am allowed to go shopping, but only long enough to grab cat food.   \n\nBut after reading this thread, I now understand that I'm allowed to just bring the cats wherever I go, if it's a matter of convenience.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I just tell my pets \"bye you bastards! Don't let robbers in!\". I say this to a couple of cats, 2 Yorkies, a tiny green anole, and a pet pigeon. My home is definitely well defended lol",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Lol I also say something whenever I leave the house lol I tell my 2 dogs “I’m going shopping” if it’s only for a short outing, and “I’m going to the office” if I’ll be a while. I have no idea why lol",
                  "id": 190,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I tell our dog “I’m going to work! I’ll see you when I get home” every morning like he gives a shit. He usually shorts at me and goes back to sleep until my husband gets up and takes him outside.",
                      "id": 191,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I feel like if you repeat it they start to understand.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Exactly. It’s gross. Just leave the damn animal at home.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 222,
          "content": "> Where did people get the idea that their pets should be allowed to go everywhere with them?\n\nSERIOUSLY! \n\nThis attitude that dogs need to be everywhere is so annoying and I don’t get why it became acceptable. And it seems like other pets stay home, and are expected to, but somehow Fido gets a pass? \n\nAn outdoor beer garden? Sure, as long as you keep your dog from bothering other people. \n\nBut the grocery store? The workplace? The doctor’s office? No. NO. NO! Unless it’s a service animal leave your dog at home.",
          "id": 194,
          "comments": [
            {
              "score": 35,
              "content": "The constant response I see is \"but I can't just leave them in the car!\" THEN TAKE THEM HOME",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "You can argue that yeah, the guy calling OP out was rude and made a scene like OP made it sound in their post, but when he called her a lazy dog owner, that was right on the money.\n\nIf you want to be responsible for another life, pet or otherwise, you have to realize you can't take them with you everywhere. Things will be \"inconvenient\" at times. So you're an asshole if you take pets to stores they aren't allowed like you're an asshole for taking a crying baby to the movies. You need to go when you don't have to bring them along. The rest of the world isn't responsible for making those responsibilities as easy as possible for you.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "This. \nYTA.\nSo many people want to take their pets everywhere in public. I absolutely love animals but I hate every person who brings their pet everywhere. The rest of us are not interested in and are indeed annoyed by your pet. The very best pet owners with the very best pets are still dreadfully annoying in so many contexts. \nThis is before we get into allergies at all, which should alone be enough reason for you to leave your pet at home",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "I highly doubt leaving the dog in the car with the windows cracked would do anything. My parents used to do that with me when I didn’t want to go inside and they’d be gone for an hour or so. \n\nYTA OP. People are afraid of dogs, yes even little Yorkies, people are allergic to dogs, and I’m not either but definitely don’t want strange dog hair and dandruff on my food.",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "This account has been deleted due to the decision made by Reddit, Inc to monetize its public API to an impossible degree, thereby forcing 3rd-party apps to shutdown. See [this post](https://old.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/) made by the creator of the Apollo app for context and receipts. \n\nThis account’s self posts and comments have been edited to remove any content that might add value to Reddit’s product at zero cost to the company. We made the content for free. We made Reddit what it was. \n\nIn the end, it’s a beneficial shake-up that will lead to reading more books and gaining a healthier focus. \n\nApollo, this user misses you.",
          "id": 199,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4274,
      "content": "YTA\n\nI love dogs but everyone knows that they’re not allowed in grocery stores. You’re not special.",
      "id": 200,
      "comments": [
        {
          "score": 517,
          "content": "OP repeatedly stated that it was just a “quick trip,” which indicates to me that she knows it was wrong but was hoping to get in & out before anyone called her out on it.",
          "id": 201,
          "comments": [
            {
              "score": 24,
              "content": "She also said 10 minutes. In no shape or form is that a quick trip to me. \n\nI've worked in a store, and I've allowed people to make a quick trip inside, but only because it is \"buy a singular bottle of water at the front desk\" type of quick, not the 10 minutes of shopping quick.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Same mentality as people who get upset for getting a parking fine when parking illegally and then whine about \"But it was only 15 minutes\".",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "NC resident and people bring their dogs everywhere signs or not, (sometimes off leash!) and throw a bitchfit if anyone says anything. Dogs fucking slobbering on shit, barking, and getting in the way and they couldn't possibly care less about the inconvenience they're causing.",
          "id": 204,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Reminds me of when I saw someone wandering around Walmart smoking a cigarette. Other people exist!",
          "id": 205,
          "comments": [
            {
              "score": 15,
              "content": "In the building? 💀",
              "id": 206,
              "comments": [
                {
                  "score": 16,
                  "content": "Yes, walking up and down the aisles.",
                  "id": 207,
                  "comments": [
                    {
                      "score": 19,
                      "content": "That's a special kind of assholery.",
                      "id": 208,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I’m old enough to remember when grocery stores had ashtrays at the end of each aisle. So glad those days are over.",
              "id": 209,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3542,
      "content": "Yta\n\nYou said it right in your post: it was more convenient for you. You’re only thinking about what’s easiest for you and now how your actions effect other people. Dogs absolutely do not belong in grocery stores.",
      "id": 210,
      "comments": [
        {
          "score": 287,
          "content": "Absolutely this. It was easiest for you so you hoped you could get away with it. You didn’t. Don’t try to do it again.",
          "id": 211,
          "comments": [
            {
              "score": 18,
              "content": "OP will 100% be doing this again.",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "But it was “only 20 minutes.” This time. Next time OP will go for 20, and the next would be 30.",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2550,
      "content": "You know people are allergic to dogs, right? You brought a pup into produce? C’mon girl, YTA",
      "id": 214,
      "comments": [
        {
          "score": 644,
          "content": "Not to mention I don’t want pet hair on my food. Gross.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 310,
          "content": "I feel like the produce part ups the YTA factor for me bc so much of the produce i buy doesn't get cooked, it goes in salads and stuff. All I can picture  is like a cloud of dog park particles floating around landing on all that wet romaine and stuff. It's gross enough that people are allowed in there, we're not doing pets.",
          "id": 216,
          "comments": [
            {
              "score": 17,
              "content": "I hope you properly wash your produce, regardless of whether there was a dog present in the store or not. You’d be horrified at the stuff on your produce…",
              "id": 217,
              "comments": [
                {
                  "score": 8,
                  "content": "I do, as I am well aware of what can be on my produce",
                  "id": 218,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1853,
      "content": "Yta, we all know dogs aren't allowed in grocery stores.",
      "id": 219,
      "comments": [
        {
          "score": 328,
          "content": "You'd be surprised.\n\nSource : Worked in a grocery store for 6 years.",
          "id": 220,
          "comments": [
            {
              "score": 321,
              "content": "Many of those people, like OP, know the rules.  They, also like OP, just don’t give a shit.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Oh.  There are always those.  Those who speed.  Those who buy term papers online.  Those who take their dogs to grocery stores/ farmers markets and as of late… food courts!  Ugh!!!",
              "id": 222,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "when old ladies would put their dogs in the carts 😭🤢",
              "id": 223,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Because managers are afraid to get sued but rule of thumb you can ask 2 questions\n\n1. Is this a service animal\n2. What function does it serve\n\nIf they say it's emotional support legally allowed to tell them to leave",
              "id": 224,
              "comments": [
                {
                  "score": 9,
                  "content": "You can also ask misbehaving or disruptive service animals to leave by law.",
                  "id": 225,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I worked in a CVS. We were too lax sometimes about keeping dogs out (especially considering it's a pharmacy) and one time I saw a customer's dog pee all over a chip display stand. I was mortified. I told the customer and he shrugged and walked off, like it's not his problem. I called a manager to deal with the mess (I was a cashier with a line), but there were no repercussions.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I think people who have little dogs think the dog rules don’t *really* apply to them",
          "id": 227,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1242,
      "content": "YTA - Really ma dudette? Yes dogs should not be in grocery stores, it's against the rules and this was not any kind of service dog that would have been allowed. It's not one rule for you and one rule for everyone else. Do better.",
      "id": 228,
      "comments": [
        {
          "score": 363,
          "content": "Not just rules. This is federal law. No animals in places that produce or store food. The store could have been fined or have actions against their business license for your actions.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}