{
  "post content": "My mother-in-law who is experiencing dementia came to live with my husband and I, 5 years ago. We charged her $400 a month. She was bringing in $1,800 a month. Now with the cost of everything going up we have let her and my sister in law (who takes care of her finances) know that we are increasing it to $1000. Her funds have increased to $2,100. This leaves her with plenty of money to pay for anything she wants. We pay for all of her food and staples she uses also added entertainment she may want.  We also take on the added costs of utilities and gas taking her to any appointments she has.  My mother-in-law and sister-in-law (who side note will not let her mother come live with her) are furious saying we are taking advantage of her. Are we the ass holes?",
  "id": 1,
  "comments": [
    {
      "score": 3493,
      "content": "NTA. You can tell some of these people have never taken care of anyone in their lives. As a full time caregiver while running my own business and family home, I know you have been giving your MIL a steal. Nursing facilities would cost your mom 8k-10k PER MONTH for a small room. Assisted living not much less. Have your sister-in-law figure out where she will go and let her get a damn good reality check on how much things actually cost when she does not want to step in.  You charging anything shy of 5k is a deal and gift for your MIL.",
      "id": 2,
      "comments": [
        {
          "score": 1174,
          "content": "100% if the $400 was only for the room, yeah that's a bit. But this is $1000 for room, food, driving and everything else. That's not too much that's a steal.",
          "id": 3,
          "comments": [
            {
              "score": 492,
              "content": "Considering the cost of eggs has nearly tripled in my area and butter has doubled. Not to mention meat. Holy crap. Just basics increasing calls for an increase let alone how much work it is to care for someone 24/7.",
              "id": 4,
              "comments": [
                {
                  "score": 180,
                  "content": "I went to the grocery store and had to buy butter for the first time in awhile(thanks grandma for teaching me to stock up) and I had to pick ny jaw up off the floor when I realized 1lb of butter was MORE than a pound of ground beef(it was 80/20 if it matters).",
                  "id": 5,
                  "comments": [
                    {
                      "score": 55,
                      "content": "I was incredulous when I realized they were charging $4.00 for a head of iceberg lettuce",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 55,
                      "content": "80/20, 70/30, it doesn't matter... ALL of it is fricken outrageous!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "I saw eggs at EIGHT DOLLARS for a dozen - not everywhere, but I've seen it. That was $1.67 a year ago.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I was shopping Christmas Eve, and popped into a nearby grocery store because it was the closest to my house, and was outraged when I saw what they were charging for a 4L jug of milk ($10), and a dozen eggs ($10).  I'm sorry, but those are 7-Eleven prices.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Eggs earlier this year for us were .98 a dozen.   Not anymore 😭",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": ">We make devilled eggs monthly(for a family friend) and ourselves--so about 20 eggs just for that alone, not counting regular use(baking, breakfast, etc) and it's crazy how much the price has gone up.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "So glad I buy the 30pack for $10. Idk if that’s good or bad. It seems good to me. I never had to buy eggs (I hate eggs and the smell makes me nauseous) until my bf and I started living together. He goes through the pack in a week!",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "That's the price we have in our area too, I forgot how much it was before but never that high.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Seriously it is crazy.  My mother wants me to buy 4 dozen eggs every week (and she doesn't bake) but only accepts the jumbo eggs which are the most expensive.  With the bird diseases and culling (poor chickens) I know supply is down, but yikes, I'd start skipping them altogether if it was just me.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I thought it was just me, because I hadn't bought eggs in months, then went to buy a week ago, $7. I was honestly confused, in my mind I was trying to remember if they cost that much last time I bought them.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Bird flu will do that",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "We completely skipped holiday baking because 1/2 dozen eggs was almost $3. No way I'm buy 3 dozen eggs for baking and deviled eggs. We just didn't make anything that needed them.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Applesauce substitutes well for butter (1-1 sub) and bananas substitute well for eggs (1/2 normal banana for 1 egg).",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I raise chickens and cows.  The cost of feed for chickens has went up 30% on every 50lbs.  Cow feed is a bit better because we buy it by the half ton, but it went up about $25/1000lbs.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Eggsactly. I pay just over $1 per egg because organic free range eggs from happy healthy chickens are important to me. It’s also important to know that the producer receives decent remuneration. And I can afford to do so. I buy from local independent shops with transparent supply chains. \n\nWe should be paying more for these items. Costs have increased for farmers all the way up to purchasing them at the supermarket.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Literally, though. My husband called from the store this week and asked if I knew that eggs were now $6 a dozen.\n\nEggs are my \"shit I need to feed us but we're broke\" food...",
                  "id": 21,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I recommend beans, lentils and tofu as the new \"shit we're broke\" food. Tofu is $1.70 for 14oz, and a pound of dried lentils/beans is $1.25-$2. You can get all three for ~$5 and have multiple meals when paired with some good seasoning and rice (which is thankfully also still cheap).",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Cheapest eggs in the cheapest store here are now $14 for 18. Prices on everything have gone way up.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I went to the grocery store this morning to pick up some eggs, bread, spaghetti ingredients (we're broke right now so it's just noodles and sauce lmao) and the trip cost me $70. I had to double check the receipt to make sure something hadn't gone horribly wrong and sure enough, everything added up.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Funny how eggs and butter haven't gone up too much but a bag of cheetos is like $7. Luckily for me i don't indulge in those but my fiancé",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Not to mention dealing with an elderly person (that you love!) suffering from dementia symptoms. My grandma had to move in with my dad (her son) when the town sheriff found her sitting in the middle of her town's lone stoplight intersection. She was lost.\n\nHer house was one block away.\n\nShe'd get combative. There were days that she'd insist she needed to go back to her old house in another state (it was sold as soon as Dad moved her down to help pay for her care. That money did not last long) and she'd get furious and yell and throw things when she was told no. Other days she'd decide she was going to drive to the grocery store. Her car had also been sold, her license had been revoked about the fifth time she wound up in the same ditch, and the grocery store she wanted to go to was in Olkmolgee, Oklahoma. We were in South Texas. And it didn't take long for the ten stories she told everyone, every time she met them, to dwindle to five. And then to three. And then to none. She lost her words. Dad and my stepmom had to hire a full time carer to take care of her when they were at work because she could not be left alone. Someone had to stay in the room with her because we couldn't be sure what she'd decide to do. By the time she was bed-bound, she couldn't talk anymore. All she could do was scream. And she did. Sometimes it sounded almost like words, but mostly it was just inarticulate shouting, like she was in a nightmare she couldn't wake up from...which yeah, she was. I was sad when she finally passed, but it also came with a sense of release. \n\nHaving a loved one with dementia is like watching a beloved photograph fade. First the colors go. Then the grayscale details disappear, until finally there's nothing   \n left but a mostly blank page with maybe just a few traces of that beloved smile left. And you still don't want to let go because, blank or not, it's all you've got left.\n\nNothing about this is going to be easy. It will not let up until the MIL here is either dead, or her condition degrades past what OP and her husband can handle and she *has* to go to a medical facility. You couldn't compensate them for what they're about to go through if you gave them a million dollars a month. An extra six hundred so they don't have to stress so much about paying the bills, it's not even a drop in the bucket.",
              "id": 26,
              "comments": [
                {
                  "score": 40,
                  "content": "[deleted]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I like being alive, but if I found out I had dementia I'd hopefully get a second or third opinion. Then end it. I do NOT want to live like that. If other people do, that's their choice.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I'm lucky enough my country legalized autanasia a few years back. It alm started when a man help his wife with multiple sclerosis die and they wanted to put him in prison. He had a video of the wife saying that this is what she wanted. The judge gave him a suoer light sentence (not even prison time) and a year later the passed the law and retracted on his sentence. I signed the papers as soon as I could.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "My partner's dad had Lewy bodies dementia and I often wished we could give him the same gift we gave our old, sick cats: release from suffering and pain.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "You describe dementia eloquently. I work with people with it and have had to deal with family having it. Your words perfectly describe what it’s like. Thanks for that.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I'm glad you found it meaningful. It was pretty cathartic to write. We're watching my maternal grandmother go ATM. She's 91, so...yeah, it's going to happen. Her cognitive skills seem pretty okay--her speech is clear, and when it's a good day she's still reading as many spy thrillers as she can stuff into her kindle (She owns over three thousand books. We know this because when she attempted to catalogue them all back in the 90s, 3000 was when she gave up. She never even got to the paperbacks.)\n\nBut she's begun having episodes where she loses touch with reality. Thanksgiving day, she was convinced that the villains from her latest novel were coming to get her and take her to the same Chinese prison the protagonist was in. It took two days to get her out of it and she didn't remember a damn thing when she was \"back.\" Her docs and my aunt (read as: her carer) are pretty sure UTIs are the culprit, but these episodes are coming faster and lasting longer, and it's getting harder to get Grandma to do the things she needs to do. Like drinking enough water that she doesn't get another UTI. She does have hospice/palliative care involved, because...you know. She's 91. It's going to happen. It's better to get the experts in early before there's no quality of life left to preserve. But that doesn't make this shit any easier to handle. And understanding that *it isn't going to get better*. That...yeah, this is it. The peaks are going to get smaller, there's going to be fewer of them, and the valleys just seem to get deeper and darker each time she declines. \n\nIt's a part of life and a transition and I hate every fucking part of it.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Wow! Thank you for sharing your experience. My heart goes out to you!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I feel this so much. Your description is beautiful.\n\nSending her to a care facility when it worsens is not negotiable. They have to prepare for that. And the extra money is really a bare minimum to help at least carry the physical costs.\n\nMy gran stayed with us. She had Alzheimer’s. I was 14 when the dementia got bad, and 17 when she died. I was her primary care giver until the last 6 months when my parents got a nurse.\n\nShe screamed. Fought. Cried. Attacked me. Started by calling me my name, then my mom’s name, then her sisters name, then her mom. She had polio as a child, so she couldn’t really walk, so she never ran off anywhere, but the sound of her walker’s click-click coming down the passage will be with me forever. My brother (10 yrs younger) would hide in his cupboard when he heard it.\n\nI carried her to the bathroom for a while, but towards the end I had to change nappies and sponge bath her. That’s why we finally got a nurse. But she was so afraid of her (the nurse) that she would cry for me whenever the woman went near her. So I stayed, but had an extra pair of strong arms.\n\nThe worst was the moments of clarity though. Every now and then the lights would go on and she would know what was happening. But also what she had just done or said. (It happened less and less towards the end thankfully.) And she would look at me and sob. She kept asking for her to die. Begging god to take her. Eventually begging me to end it. All I wanted to do was put a pillow over her head and stop it. I loved her so much. She took care of me as a child. She was my best friend, confidante, cared about my actual interests and feelings. And then she became this.\n\nIt was so strange loving and hating and fearing and pitying someone all at the same time. I know I sound cold, saying I thought of ways to end it. But I love her. So much.\n\nMy husband doesn’t understand, but if I ever get diagnosed I will end it that day.\n\n(Edit a word)\n\n(Edit 2: sorry for the vent but this is just something that weighs so heavily I had to get it out.)",
                  "id": 34,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My eyes are filled with tears now.\nYou don't sound cold at all! You sound warm and loveing and caring and full of empathy. You did all that when you were not even a grown adult but still a teenager. You have my respect and my empathy ❤.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah. Everything about Elder care is brutal when dementia is involved. \n\nProbably the most famous dementia patient right now was Robin Williams. It's not well known because the diagnosis was posthumous, but at autopsy that found that he had Lewey Body Dementia, and he had it on a scale that it HAD to be affecting his cognitive abilities. Everybody on the set of *Night at the Museum* 2 have said he was visibl*y* underwater during shoots, and struggling to remember lines when his entire career was based on his skill with memorization and improv. His family knew something wrong. He *had* to have known something was wrong. \n\nIt's why I get very angry when people say he \"lost his battle with depression\". No, he fucking didn't. He was very literally losing his mind, and he was losing it to a disease that sounds fucking terrifying--Lewey bodies also cause hallucinations ,and not very nice ones. And even if he had managed to push through things that night and not succeed at suicide...he was still going to die. And it was going to be very slow, very painful, and completely horrifying for everyone involved, including Robin. He didn't lose his battle with depression. He just got into a second fight that he was never going to win, and he chose to end it on his terms. \n\nI think that if the majority of us got a dementia diagnosis while we were still mostly competent, the majority of us would at least consider an easier exit than the long and slow demise. It's not a very laudable thought, but nothing about dying with dementia is good. If you know you're about to be done, the least you should have is a choice in how it goes.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I'm a caregiver for dementia patients and you explained it so eloquently and truthfully. That must have been scary seeing your own grandmother go through that firsthand. Sending you love.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I’m so sorry.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I watched my grandfather and my mother go through senile dementia. Your description is perfect. Thank you.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "We believe my grandmother had early signs of dementia when she died. I don’t know if she was formally diagnosed or not, she might have been. I’m honestly glad that it was her blood disorder that caused her death. The last several years of her life she had a blood issue that required a blood transfusion on a regular basis. She received blood transfusions for years. They eventually stopped being effectual and grandpa/their kids made the decision to stop the transfusions/meds for the disorder. It was hard enough to see her deteriorate from the blood disorder, it would have been literal hell to see her deteriorate from the dementia. Thankfully, she died before the dementia was really noticeable. Your experience makes me feel so much more grateful we didn’t have to witness that.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "You could them the other option is to pay $5000 and up for Assisted Living. The more care she needs, the more expensive it gets.\n\nYou should price facilities for the elderly in your area. $1000 is a bargain.",
              "id": 41,
              "comments": [
                {
                  "score": 50,
                  "content": "Absolutely $5000 per month for a parent in assisted living.  Father had dementia and was on a locked unit for safety, while I cared for mother with stage four cancer and all her mental faculties intact.  Giving up your entire life (job, marriage, hobbies, any down time to rest) to care for an elder parent isn't easy.  It's a life changing event.  You couldn't pay me to do it again.  Definitely NTA.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 23,
                      "content": "My mom's ALF was $6800/mo. This was after my husband and I moved into her home so I could care for her for 2.25 years. At that point I couldn't do it any more and my brothers made the decision to move her into care. \n\nI'm glad I had that time with her, but, oh man, it was tough the last 6 months!",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This. \n\nIf MIL don’t want it boot her out and I’d gladly pay this.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "AND the emotional draining aspect of caring for someone with dementia.  That's not a small thing.\n\nMy almost 95 year old grandmother lives in a home.  She has paid a $150,000 deposit (I think - it may be $180,000), and pays over $1200 per fortnight in addition.  All of her pension goes to that, and the extra is paid from her savings.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Depending on where they live $1000/mo is a totally normal amount for a room. My room and utilities in a shared house runs easily more than that (west coast big city). Even when I lived in one of the cheapest Midwest cities, $400/mo would not have gotten you any kind of room and utilities. Not to mention food etc. These family members are being straight up absurd! Frankly, I think I would offer them the chance to pay your actual cost and you’ll agree to change the rent to that whether it’s more or less. If it’s a 4 bedroom house that means 1/4th of mortgage and taxes plus maintenance, proportional share of utilities, food, gas for the car etc. They might well agree and then end up having numbers be more like $1500. If they are worried about grandmas spending money, they can chip in monetarily",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I know it’s different for the elderly in some cases but in a lot of cities people are paying 800-1000 for just a room with no storage and shared kitchen and living spaces this woman is getting a good deal no matter what. 2000 a month is more than what most people make that are working in said cities. Idk how they are mad about the price increase like just look on Craigslist and you can see how expensive every room and apartment is now.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "And if she has dementia there is a fair amount of personal care going on.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Before my grandma went to a dementia facility in a nursing home (which is at least this much) she lived next to my parents. I know my mom kept all the receipts for food and rent and bills (managed by my parents) in case her sister asked about it. That way she could proved exactly how much it cost if she needed to.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "OP, tell the sister the mom can go live with her for $400 a month. Tell her she either lets the mom move in or she shuts up.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "In my state, that price is for a shared room. A private room is twice that. I am a former CNA. I helped a resident fill out his checkbook to pay the month bill for his own private room in one hall and his wife's private room she had in the Memory ward. His bill was just over 32k.. a month. He paid it every month, without fail. Old, old ranch owner. Had several thousand Herefords.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My grandmother is in a memory-care facility and it costs $14k a month. It’s insane, but she gets all of the one-on-one care and specialized medical plans that she needs. Memory-based facilities are ludicrously expensive.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yup! My great aunts nursing home (it's really nice) in Washington State is almost 10k a month.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "In my area (limited resources) it's 30k a month for an ALF.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Happy cake day!",
          "id": 55,
          "comments": [
            {
              "score": 1,
              "content": "Thank you!!",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This.  Over a decade ago, I went to help my mom look at assisted living and nursing homes for my grandfather when his dementia got to be too much to keep him home. It was 3 to 5000 THEN. And I live in a low COL area.  I can't imagine what it is now, if you can even get a bed",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This exactly. My father in law was in an assisted care place recently…$5800usd per month.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 737,
      "content": "NTA\n\nFull time assistance and housing for a dementia patient starts at 30k per year in the United States, I am hard-pressed to see how you are taking advantage. Heck, I think most adults would consider rent, utilities, food and transportation costing less than half of their monthly income to be a steal…",
      "id": 59,
      "comments": [
        {
          "score": 93,
          "content": "I’m 31 and it’s been very rare the times my rent is not around 70% or more of my income. And that’s without someone paying for my food and driving me around lol. I would commit so many crimes for rent that’s only half my income xD",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "The issue here is one of communication perhaps, not necessarily price. Being a caretaker is exhausting and costly, but significant increases in cost should be communicated clearly and negotiated fairly. If they need more money to cover costs, that's fine, but they need to justify the 150% increase (show their budget, make the argument) and treat the financial caretaker as a partner (you know, family) rather than as a hostile party who must pay up or leave.",
          "id": 61,
          "comments": [
            {
              "score": 7,
              "content": "In this case,  it's just pay up.  Mil and accountant daughter know prices have increased.  It's silly to have explain common sense.",
              "id": 62,
              "comments": [
                {
                  "score": -3,
                  "content": "150% inflation in 5 years is not common sense. In common sense terms, that is getting fleeced. That's one reason why OP needs to make a case for it: to justify what on ita face is a severe increase.",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "They don't need to show their budget. They let the mom move in and didn't know what they were really taking on. Mom was  underpaying for 18 months and will still be paying less at $1,000/month than she would if she was on her own or in assisted living.\nEDIT: I mis-read \"and I, 5 years\" as 1.5 years. Sixty months, not 18. OP has been ripped off for five years. I'm furious.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My dad in a dementia care facility is over 8 grand a month",
          "id": 65,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "they want more money built up in her accounts for the eventual inheritance. bet. families are gross about money.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 486,
      "content": "NTA. You are paying for everything and taking care of her 24 hours a day. Tell your SIL that she can pay for a nursing home and the costs associated with it if 1k is too much.",
      "id": 67,
      "comments": [
        {
          "score": 43,
          "content": "Very much this. NTA",
          "id": 68,
          "comments": [
            {
              "score": 21,
              "content": "Agree. Your SIL doesn’t want your MIL to live with her so she really doesn’t get much of a say, in my opinion. You’re doing everything to care for your MIL. Your SIL may want to give gratitude a try knowing that her mom is safe and cared for by a good family member instead of by strangers in a facility. Good of you to care for her.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agreed. NTA. And I'm curious as to what SIL is doing with the remainder of the $2,100 as OP is providing housing, care, food, entertainment, and transportation.",
          "id": 70,
          "comments": [
            {
              "score": 5,
              "content": "Exactly this! I am betting she’s using it for her own finances and was counting on that extra $600.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 237,
      "content": "NTA. If you are fully subsidizing all the things in your post, I don't understand the opposite opinions on this thread. You have NO obligation to raise MIL's rent by only as much as MIL's income has increased, especially when paying for all her food and staples. You can't control MIL's income or inflation. $1,000 a month in the current environment seems like a reasonable amount for MIL to pay to cover all costs related to food, housing, utilities, transportation and entertainment for a senior, and she still has more than 50% of her disposable income left over. Many people would be relieved to be in that position. You seem fine to me OP.",
      "id": 72,
      "comments": [
        {
          "score": 74,
          "content": "Plus it is the first increase in 5 years by the sounds of it which equals approximately 120 ish per year increase. That sounds reasonable given increasing costs and general inflation….",
          "id": 73,
          "comments": [
            {
              "score": 53,
              "content": "Why? If she went into a Nursing Home they would take her entire Social Security and give her an allowance of $100 bucks a month.",
              "id": 74,
              "comments": [
                {
                  "score": 27,
                  "content": "A nursing home would cost thousands each month….",
                  "id": 75,
                  "comments": [
                    {
                      "score": 11,
                      "content": "It would. I absolutely agree with you. I meant to reply to a different comment. Sorry.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Insurance such as Medicare would pay a portion",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "They charge extra for stuff like hair cuts too.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Shit, if I trusted my siblings - and I fucking must because I leave my vulnerable mother with them all day every day so that I don’t have to do it - I’d let them have the whole shebang. An extra $1100 a month plus the $1000 in basic housing an utilities is a SMALL PRICE TO PAY for it being “not my problem.”  Because we know mom is gonna get worse. And I’m still not taking her. Live it up now with steak and fresh veggies and entertainment. Soon, you’re gonna be wiping asses and baby proofing your home for a mobile adult-sized toddler. In between doctors visits and feeding and bathing her. This is a goddamn steal for SIL. They are very lucky OP isn’t greedy or petty because she’d be out of my house that week.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Firstly, it isn’t rent. It’s an all inclusive -assisted living but of a better standard than MIL can afford otherwise. A lot of adults spend half their monthly income on housing. The rent to income ratio is more than fair. SIL is delusional and blind bc she isn’t involved in the day to day caring of MIL. So she can afford to sit on her high horse and deem it unfair. Go on vacation for a week and let SIL do the minding. NTA.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 129,
      "content": "NTA.  \n\nShe's living with you and has dementia.  That means you are doing caregiver stuff, too, even if she has other caregivers coming in.  There are safety issues involved, hazards, all kinds of things that you need to be aware of.  It takes a mental and emotional toll on you.  I'd ask a social worker, or get some library books or online research, about what to do to make your house safer for someone with dementia. \n\nSIL doesn't like it, she can make arrangements to find another place for MIL to live, but she's not going to find anything for less money and this kind of personalized care.  \n\nThis is different than just renting out a room and basics.",
      "id": 81,
      "comments": [
        {
          "score": 7,
          "content": "Fwiw many county aging programs do this kind of in home consulting.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "All of the YTA people have apparently never had an elderly person with dementia living with them because I’m sure there are days you want to bang your head against the wall.  Move her to sis’s care.",
      "id": 83,
      "comments": [
        {
          "score": 26,
          "content": "Did it until my dad died last year. Alzheimers is a hell of a disease. Was it hard? Yes. But do I regret it? Hell no. It was my honor to help him transition from this life to the next.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I've been there. It *sucks*. I get the anguish, the frustration that other family aren't hosting or doing the meal trips or doing the welfare checks. I get the numbness, the conversations that go nowhere. \n\nBut why did OP just spring this cost increase on them both, sight unseen? Why wasn't this a budget-open conversation about what's best for MIL? It feels like the parts of the family don't get along well or communicate well in the first place. The more I read, the more I think we don't know enough to give a judgment. Is OP TA for not communicating and collaborating, or are there reasons she doesn't?",
          "id": 85,
          "comments": [
            {
              "score": 1,
              "content": "I’m wondering if the $400 was a really big break?  But I guess what really needs to be known is, we’re they covering a lot of mom’s costs.  I know I was paying for a lot of my father’s stuff.  It starts small and then grows.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 80,
      "content": "NTA. I was about to call you harsh for such a big increase, but for rent, food, utilities, and transportation $1000 would be fair in most of the US. Keep receipts, bills and rent comps in order to justify to SIL.",
      "id": 87,
      "comments": [
        {
          "score": 17,
          "content": "Thank you for your suggestion",
          "id": 88,
          "comments": [
            {
              "score": -35,
              "content": "Do math. Yes, retirement sucks, but you took 1/4 their income. Now almost half. Yeah… social security doesn’t keep up with the times, but you suck",
              "id": 89,
              "comments": [
                {
                  "score": 20,
                  "content": "> Yes, retirement sucks, but you took 1/4 their income. Now almost half.\n\nI mean... what % of your income is rent, food, utilities, and transportation? lol.",
                  "id": 90,
                  "comments": [
                    {
                      "score": -19,
                      "content": "No transportation… 1/3 would be fair",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I agree. This is the best way to make them understand why the increase is needed. \nI can't really blame them for getting upset over an increase this big. But at the same time it's naive of SIL(can't really say that of a woman with dementia, as they can't make these decisions anymore themselves hence SIL being in charge of finances) to think that the higher contribution isn't needed.\n\nIn my country when you are \"in charge\" of another adults finances etc you have to justify everything you spend of their money to a judge. Every year. This is to prevent financial abuse.\nNow you are not in charge of that, SIL is, but by doing the math and showing it to them you are justifying the rise in money you ask for caring for and housing your MIL. \n\nNTA. SIL is.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "NTA. Find out what assisted living facilities cost per month in your area and what they provide. A greedy uncle tried to claim mom was robbing her mother for the rent my mom received from Nana. Mom looked up the cost of assisted living facilities and taxi's (this was way before Uber and Lyft) to get Nana to and from church weekly and her pinochle games with friends and what my mom charged was a pittance. Provide a copy of assisted living costs to your family members and let that do the talking for you.",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "Nah.  Reading your comments it’s clear that you were not aware of all the additional costs it would take to care for her.  You need to show mil and sil why you want to increase the rent.  He how much each utility went up, the amount you spend on food for her.  You should also include the hours out your day where you’re driving her to appointments and taking care of her other needs.",
      "id": 94,
      "comments": [
        {
          "score": 29,
          "content": "I think the SIL is a major AH. She refuses to let MIL live with her and doesn't appear to be contributing financially, but expects OP to financially subsidize MIL's care while being a 24/7 caregiver at the same time.",
          "id": 95,
          "comments": [
            {
              "score": 7,
              "content": "Seriously.  No one seems to understand how much work goes into caring for someone with dementia.  It’s time consuming, expensive and mentally exhausting.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Agree, like OP has a right to increase the rent due to costs rising and caring for MIL. I also can understand anyone, on principle alone, being a little miffed if their rent suddenly increased 150%. SIL is definitely the AH and also it is incredibly suspect that SIL is handling the MIL's finances, yet refuses to house, or seemingly care for her at all (unless its like the SIL is the one paying her own money as a monthly stipend to MIL).",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "NTA\n\n\n$400 a month comes out to roughly $13 a day. \n\n\n$13 a day is all you’re getting to cover her share of utilities, the extra gas and mileage on your car to take her to all her appointments, extra hours of driving, running errands, and constant supervision, as well as the cost of her daily steak dinners. \n\n\nPeople are calling you the asshole due to the large increase, but the fact is you’ve likely been undercharging this entire time. I dare anyone to find any service for someone with her condition for $13 a day. $1000 is a large leap, but it’s much more appropriate compensation for what you’re providing.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    }
  ]
}