{
  "post content": "Am I the a$$hole for not lending my AppleTV to my roommate. I have been living with my current roommate for 3 years now. He was given a house by his father a couple of years ago and wanted a roommate to help pay for repairs around the house. We have known each other for many years as we went to high-school together and it was a simple decision on my part to move in. Anyways, throughout the 3 years I have lived here he has promised to fix many things and has never gotten around to most of them. Things that do not only effect him. One of the things he said he would do was buy a SmartTV for the living room (we currently have a super old Samsung with only 2 HDMI ports) to make it easier for when one of us wants to watch TV in the living room versus our own room. I own an AppleTV as this is my favorite way to stream all of my apps. Sometimes when I want to watch TV in the living room I just move my AppleTV in there. Today he asked me if I he could use the AppleTV as he has some people coming over to watch a movie. This really irritated me as it felt like he just assumed I would lend it to him even though he had yet to ask me. So I told him “Sorry, not tonight.” As I believe to be my right. Well later in the evening I went to dinner with my boyfriend and brought up the situation because I was still a little annoyed by it. This turned into an argument as my boyfriend believes I was being a jerk and being super selfish as I was not even going to be home. I explained my side that I bought this AppleTV for myself and felt like he just assumed he could use it. I also explained that I felt like this is ultimately my roommates fault as he was the one who said he wanted a SmartTV in the living room for when guests come but has yet to buy one. My boyfriend was not budging and still believes I am in the wrong. So what do you think, Am I the A$$hole?",
  "id": 1,
  "comments": [
    {
      "score": 2,
      "content": "NAH.  Asking to borrow it was not the unreasonable thing you’re making it out to be unless he told his friends that they’d be watching a movie that is only available on AppleTV.  If they’re just coming over to watch a movie, then they should be fine watching on whatever device he has available.  Asking to borrow something from a roommate you have a decent relationship with is pretty normal.\n\nThe situation where he’s promising repairs as your landlord and not doing them does make him TA, but I’m limiting my judgement vote to the AppleTV issue, since that’s what you asked about.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Right, sorry didn’t clarify. The TV in the living room does not have access to anything (no cable, no way to stream anything, etc.) it is basically just a monitor lol. I am the only one who has a device that can be used to stream. My roommate used to have an Xbox but sold it. I think I am more so frustrated because he said he would buy a tv for the living room to make it easier on us but didn’t. Then sold his one way for him to watch TV in the living room. I felt like it was more so assumed I would let him borrow it. Ultimately, my roommate and I are fine. My boyfriend just made me feel like I was the AH.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "Ah, that’s an important clarification!  In that case, yeah, he’s TA.  He needed to either ask first or have another way to watch movies that he expected to use if you weren’t going to loan him your device.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I did not lend my roommate my Apple TV. This could make me the asshole as I was not home when he wanted to use it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAm I the a$$hole for not lending my AppleTV to my roommate. I have been living with my current roommate for 3 years now. He was given a house by his father a couple of years ago and wanted a roommate to help pay for repairs around the house. We have known each other for many years as we went to high-school together and it was a simple decision on my part to move in. Anyways, throughout the 3 years I have lived here he has promised to fix many things and has never gotten around to most of them. Things that do not only effect him. One of the things he said he would do was buy a SmartTV for the living room (we currently have a super old Samsung with only 2 HDMI ports) to make it easier for when one of us wants to watch TV in the living room versus our own room. I own an AppleTV as this is my favorite way to stream all of my apps. Sometimes when I want to watch TV in the living room I just move my AppleTV in there. Today he asked me if I he could use the AppleTV as he has some people coming over to watch a movie. This really irritated me as it felt like he just assumed I would lend it to him even though he had yet to ask me. So I told him “Sorry, not tonight.” As I believe to be my right. Well later in the evening I went to dinner with my boyfriend and brought up the situation because I was still a little annoyed by it. This turned into an argument as my boyfriend believes I was being a jerk and being super selfish as I was not even going to be home. I explained my side that I bought this AppleTV for myself and felt like he just assumed he could use it. I also explained that I felt like this is ultimately my roommates fault as he was the one who said he wanted a SmartTV in the living room for when guests come but has yet to buy one. My boyfriend was not budging and still believes I am in the wrong. So what do you think, Am I the A$$hole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    }
  ]
}