{
  "post content": "My in-laws are what you would call traditional. They seem to think the world should have stopped 50 years ago, and think everthing since then is evil. They aren't racist (that I know of) or outwardly bigoted, but they just are very old fashioned. \n\nMy husband and I have three children (16f, 14f, 10m) and we go to visit all their grandparents since they live close. Here's the issue, they don't like the idea of women wearing pants. My MIL says it's \"showing off\" and my FIL always says it isn't christian. Now I'm pretty feminine, so I don't mind throwing on a dress when we stop by, but our daughters are not.\n\nThey don't like visiting my husbands parents, which breaks his heart, because we make them put on a dress before they go. They are both pretty tomboyish, and they never wear any dresses otherwise. I had to but each of them a few dresses specifically so they can go. To be clear it's not like they aren't allowed over if they wear pants, it's just that they won't shut up the entire time about how much they hate it.\n\nOur daughters hate this, and think it's unfair. I guess it is, but in a lot of cultures women only wear skirts and dresses so I don't think it's a big deal. Plus it isn't like it hurts them to wear a dress a few times a week for a few hours. The issue is our oldest is planning to never speak to her grandparents again after she's 18, and I'm worried it's affecting them.",
  "id": 1,
  "comments": [
    {
      "score": 52010,
      "content": ">My MIL says it's \"showing off\" and my FIL always says it isn't christian.\n\nThis? Right here? Is the problem. YTA for letting your in laws treat your daughters this way.",
      "id": 2,
      "comments": [
        {
          "score": 16990,
          "content": "Yep. Has nothing to do with the in-laws age. My grandma was born in 1909 and she wore pants til the day she died. She wasn’t very religious.",
          "id": 3,
          "comments": [
            {
              "score": 9585,
              "content": "My mom-mom was born in 1917, and was very religious.   She wore pants every day.  Even to church.",
              "id": 4,
              "comments": [
                {
                  "score": 5650,
                  "content": "my gigi was born in 1927. never seen her wear a dress even once. the woman also goes to church every single day and is probably qualified to be the pope",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5023,
                      "content": "The Pope, however, wears a dress (kind of)",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 627,
                      "content": "My nana was born in the 30s and she wore pants all the time, including to church on Sunday. And shorts in the summer! The horror!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 276,
                      "content": "I had a GG! She passed away 2 years ago(born 1934) and I never saw her wear a dress other than her wedding photos",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "My grandma is 96, and has worn pants for as long as I can remember",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "My grandma is 102 and I rarely saw her wear a dress unless it was for a character (she was an actress and singer).",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 615,
                  "content": "My Irish Catholic grandma was born in the late 20s, the only time I can remember seeing her in a dress was at weddings.  She was always cold, so she was more comfortable in pants.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 350,
                      "content": "I also have an Irish Catholic Nana, born 1930 and from what I can recall she's almost always worn trousers. She used to wear skirts occasionally in the 80s/90s and later for special occasions. I think everyone agrees the in-laws dated opinions have little to do with age or Christianity, it's about control",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 175,
                      "content": "My catholic Italian Nana (b. 1934) has only been seen in dresses in pictures. She wore a kicking’ pant suit to my wedding. \n\nCome to think of it, my Irish Grammy (1939-2016) only ever wore pants. I’ve seen pictures of her in dresses, but never in person. Even when she went to church. Or my Uncle’s wedding.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "My French Catholic grandma born in 1930's and had a mother who almost became a NUN! Wore both and she never told her kids, grandkids or great grandkids what to wear. She always told me, she may not like it, but times change and things change over time so it's not up to her to decide. I just lost her yesterday, I am going to miss the heck out of her!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 222,
                  "content": "My Grandma (b. 1923) went to Mass every single morning until she was no longer allowed to drive. Nearly always in pants, as she had work/volunteering to go to right afterwards.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "a former colleague's great aunt was a regular Christian, attended every Sunday. \n\nAlso wore pants and disowned her sister for not accepting her nephew when he came out. \n\nBeing old isn't an excuse to be a bigoted AH. But these kids are OP's - and OP is being a terrible parent to her kids. She will come back here in 10 years asking \"AITA my kids hate me & won't talk to me\".\n\nYTA.\n\nAlso, the world is full of cool grandmas. Hope the kids find one who can set their parents straight.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Wait until they find out Jesus wore a dress.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Yes, my grandparents were born in 1915 and my great grandmother was always in pants and a ball cap. She was quite religious as far as I know. She passed away when my dad was about 5 I believe? Maybe younger. I would call my family very open minded for their generations mostly but still. This idea of religion being a reason for sexism is odd. I know it used that way often but in this case it is extreme and not how these children have been raised. It is damaging to the children.  OP YTA.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "My Gran was born in 1906, and her sister in 1900. They both went to university and church, and they wore pants to both... since before I was born. I've seen pics of them wearing pants in the 20s and 30s.\n\nFFS the queen wore pants.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4639,
              "content": "My MIL was born in 1931 and scandalized her Kentucky home town by not only wearing pants, but saying no to her first suitor because he didn’t believe in birth control. She eventually met the man who would become her husband and he whisked her out to California shortly after my husband was born in the early 50’s. They never looked back. \n\nIt’s not about age. It’s about misogyny. OP, if you see this, start standing up for your daughters or you will find their grandparents aren’t the only ones they cut off.",
              "id": 20,
              "comments": [
                {
                  "score": 738,
                  "content": "You just said in one sentence what I took three paragraphs to say.  Nicely put.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 461,
                      "content": "I have occasional moments of clarity. Normally I have diarrhea of the keyboard.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "This right here. \n\n>The issue is our oldest is planning to never speak to her grandparents again after she's 18, and I'm worried it's affecting them.\n\nOP, YTA. Your 16-year-old is planning on never speaking to them again in two years. That's a major, massive red flag that this extends far beyond clothing. This is just the straw breaking the camel's back. If your in-laws want to complain, let them - cut down your visits as a result. Keep this up and you'll only have two years until you never see your oldest again - 4 if your middle child follows suit.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "This! OP your busband should talk to his parents and explain to them they live in the year 2023. Their opinins are misogynistic and they risk loosing their granddaughters with their horrible behaviour. At the same time, people who think like that has a tendency to think that boys are better than girls, so they might not have a problem with just the grandson visiting.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I love your MIL!",
                  "id": 25,
                  "comments": [
                    {
                      "score": 9,
                      "content": "She’s pretty amazing. She’s declining rapidly now, and we will miss her terribly when she’s gone.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2805,
              "content": "My grandmom was born in 1935.  She still to my knowledge goes to church every morning, or she did until COVID.\n\nShe officiated my gay wedding.",
              "id": 27,
              "comments": [
                {
                  "score": 351,
                  "content": "Hell yeah grandmom!!!!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 323,
                  "content": "My grandma was born in 1912. Her husband died after their 13 kid. She had kids to raise and a farm to run. No time to worry about stupid stereotypes and role genders.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 393,
              "content": "Yup, my grandma was born in 1937 and she wears pants all the time. She'd find the suggestion that wearing pants is immoral hilarious.",
              "id": 30,
              "comments": [
                {
                  "score": 414,
                  "content": "Yeah, these grandparents aren't living 50 years in the past...  maybe 150...\n\nOr they're just religious and sexist.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 456,
                      "content": "[deleted]",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 298,
                      "content": "Yeah, 50 years ago was 1973 hardly the dark ages",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": ">these grandparents aren't living 50 years in the past...  maybe 150...\n\nThank you. 50 years ago it was the 70s, and women wearing trousers was pretty de rigour, so it's not like anyone was scandalised by seeing someone's ankle. The In-laws are just being sexist and weird. \n\nI'm all for formal clothing for special occasions; I think it's a shame people don't really dress up to go to dinner or the theatre anymore, but expecting your grandkids to wear formal clothes for a casual visit is just silly.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 319,
              "content": "My mom was born in 1926. Her mother never wore pants, but my mom wore jeans in the 40s and 50s before it was cool to do so and I think I remember 3 or 4 times when she wore a skirt. I'm sure my religious grandmother didn't like my mom wearing pants all the time, and my sister and I weren't dress wearers except that we were required to in school, but I also don't remember my grandmother ever saying a word about it. OP, YTA for letting the grandparents treat your daughters this way. You are taking the easy way by forcing them, but look what they're doing to your kids already with one of them saying she wants nothing to do with them the minute she's not required to.",
              "id": 35,
              "comments": [
                {
                  "score": 310,
                  "content": "I *love* wearing dresses but would wear pants to visit in-laws like this, even if just to take the attention off my daughters. \n\nWe wear dresses to church.  It's definitely a cultural requirement where we are.  If one of my girls objected, I'd make sure she had a nice pants suit or something similarly church appropriate but not a dress.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 224,
                      "content": "This is the way. You sound like an excellent mother!! This is exactly what OP *SHOULD* be doing for her daughters.\n\nInstead, OP is allowing her in-laws to bully her daughters and not sticking up for them and their needs in order to avoid conflict or awkwardness with her in-laws. She is invalidating her children's feelings of discomfort, especially if they NEVER wear dresses to the point where she had to buy ones specifically to go to the in-laws house and are upset enough over it to go no contact with the grandparents at 18. There is a larger issue here. It isn't JUST a dress to them. \n\nOP is an adult and should be putting her in-laws in their place. They have no right to dictate what her children wear and she is showing her children that her in-laws wishes and avoiding conflict matter more to her than their discomfort.  She is also teaching them that they should be expected to be ok being uncomfortable and unhappy to appease others because... *(checks notes)* they are girls... As if society is not going to tell them enough that they are expected to change themselves or reduce themselves to make others (mostly men) happy.\n\nThese are lifelong damaging messages you are sending to your daughters OP. YTA",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I would tell my in laws to shut their gobs if they started on my kids. My husband can visit them alone with that attitude.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 269,
              "content": "Yeaa it really doesn't. Some old people just really grew up to be an asshole because of the way their environment was and what not.",
              "id": 39,
              "comments": [
                {
                  "score": 9,
                  "content": "This. Unfortunately I have a granddad who collectively\nWith his best friend in the ‘00 decided we ain’t gonna learn this internet craze computer stuff. It’s a hype and be gone in five years..\n\n\nWelll, didn’t they come home from a cold Christmas. \n\nHe used to comment on my hair my clothes as a kid. All he known is wear a suit since he’s a baby and still goes to the office (94 yr old).\n\nHe means well, he’s an arsehole. I think he knows. Still love the man to bits.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 226,
              "content": "My grandma was very religious and I hardly ever seen her in a skirt or dress. Just formal occasions and then, she sometimes she wore pants. I don’t understand the whole religious thing where women just wear skirts or dresses and the mean can dress as they please.",
              "id": 41,
              "comments": [
                {
                  "score": 530,
                  "content": "Oh let me explain. It's (1) to drill it into girls and women that they have no agency and (2) to prevent them from doing activities that might create competition for men later in life by becoming competent, curious and self-assured.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 135,
                      "content": "And to make sure gender roles are strictly enforced",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Also so men won’t see the shape of their butt cheeks and become aroused.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 261,
                  "content": "Right? My grandma was very religious and very (personally) skirts and dresses traditional, and one of my very vivid \"going to church to appease grandma while we were visiting her\" memories was her absolutely *going off on one* on a fellow (male) parishioner who *dared* tell her precious granddaughter (me) that she needed to wear a skirt to church.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Go Gram! She sounds like an amazing and absolutely kick-a$$ lady!",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "My super catholic great grandma wore a white pantsuit to her second wedding (my great grandpa by blood had died years before). \n\nI think the last time she wore a dress was at her first husband's funeral, and prior to that, only for really special occasions. She had pantsuits with matching costume jewelry for literally every occasion. And matching sunhats as well for summer events.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 173,
              "content": "Right?  My aunt who was born in the 30s and was so religious I thought she was a nun when I was younger wore pants all the time \n\n\nSide note. I was like 10 when I finally figured out wait she has kids and was married.  She can't be a nun.  She just worked at a catholic school and wore mostly black after her husband passed when I was a baby.  I was not a bright child.",
              "id": 48,
              "comments": [
                {
                  "score": 17,
                  "content": "Had a great aunt who was a nun. She wore pants so much, I think the only times I saw her in dresses/skirts were in her class photos (teacher).",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Almost all the nuns who taught at my school wore pants! There was only one, very elderly nun who still wore a habit.",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "My grandmother was born in 1930. Practicing Jew until she died. She only wore dresses for \"special occasions\" when she dressed up. Otherwise, she wore pants. 🤷‍♀️",
              "id": 51,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 55,
              "content": "My very religious grandmother is 81 years old, and she wears pants all the time. She loves the yoga pants from Costco and that’s what she wears most days for around the house, going for a walk, etc. She does wear dresses to church, but I don’t think I’ve ever seen her wear one not to church or a wedding or funeral.",
              "id": 52,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6401,
          "content": "YTA.\n\nI was reading this assuming they had to see the grandparents every few months or so and still thought OP was an asshole. Then I got to this part:\n\n>it isn’t like it hurts them to wear a dress a few times a week for a few hours.\n\nWhat the hell OP!?! These poor kids have to be subjected to them several times a week!?! \n\nYou’re worried they aren’t going to speak to the grandparents again after they turn 18, you should be more worried they won’t speak to you or your husband either.",
          "id": 53,
          "comments": [
            {
              "score": 2876,
              "content": "A few times a week, for a few hours each, would be a significant fraction of the time they’re not in school or doing schoolwork. Especially since it would break other time up. So instead of having time for themselves, for social activities and/or extracurriculars or just to themselves, they’re being dressed up and dragged to the grandparents’ place to play pretend fundamentalist.\n\nAnd OP’s husband is heartbroken that his daughters don’t like visiting his parents — how could he really expect anything else? How is he not heartbroken that his parents treat his daughters so poorly?",
              "id": 54,
              "comments": [
                {
                  "score": 843,
                  "content": "Yeah...assuming the minimum definition of \"a few\" that most people would agree on, it's a minimum of 9 hours a week (3 hours, 3 times a week). That's a significant chunk of time that they don't get to spend on extracurricular activities or other things they enjoy, because they're sitting in a uniform they hate listening to Grandma and Grandpa Asshole whinge about politics or whatever.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 189,
                      "content": "Yeah, I can guaranteee that Grandma and Grandpa AH spend hours saying AH things about other stuff, too, not just their grandkids' clothing.  That kind of negativity and controlling narrow-mindedness gets all over everything -- it doesn't just shut off when you appease them about one thing.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": "If grandma and grandpa are good Christians, I bet they spend hours there on Sunday.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 60,
                      "content": "Not just politics but also what they are wearing and how they live up to their standard of what a woman is and should be.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "It sounds more like a religious ed situation/ evening bible study to me + sunday.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I know how this works! \"You need to wear a dress to school today because we're going to grandma's right after.\"",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 140,
                  "content": "Agreed! My parents lived downstairs in our two-family home for 13 years and once my daughter was older, she might see them an hour or two a week. She had homework and extra-curricular stuff that garnered her time at that point. This seems like a ridiculously excessive amount of time for teenagers to spend with their grandparents, especially in clothes they hate wearing. \n\nI wonder if the kids are homeschooled? That’s the only way I can see how they might have this much free time to spend at their grandparents at 16 and 14. \n\nOP, YTA for supporting your grandparents ideals, which are actually out-dated and sexist - not old fashioned.\n\nWhen I think “old fashioned” I think of Emily Post style manners, saying please and thank you, setting the table before dinner and eating as a family, ironing and starching your clothes, baking from scratch, etc. You know, things that modern people often skip, but feel like a unique or satisfying experience when taking the time to do something the old fashioned way. (Manners shouldn’t be old-fashioned but I feel like they really are these days.)",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "How likely is it that OP's husband likes the idea of controlling the women? I have a feeling he either agrees a little with it or doesn't consider the impact of it because he has never been subjected to controlling demands himself.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "op also says they visit *all* their grandparents. Does that just mean these two, or her parents as well? When do these kids get to be kids??",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Let’s be real, there’s no way the daughter wants to cut out the grandparents just because of having to wear dresses and some comments about the dresses. I bet there’s a bunch of other stuff going on that OP isn’t telling us about.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 18,
                      "content": "A few hours, a few times a week is a lot of time to spend with people who are overbearing about their views that you don’t agree with. Above I was talking about how much of the kids’ time this is taking up, but I wonder what’s being done or talked about, in all of those hours. Long drawn-out dinners?\n\nThe daughter saying she wants to cut out the grandparents may be her being hyperbolic, or it may be a more specific “once I’m 18 I’m never coming to these dinners again.” But yes, there are some potential missing missing reasons here. The parents have let these grandparents make the interactions be things that make the kids uncomfortable — of course the kids won’t continue after they’re not forced any more.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yea where is the supposed man who made these children?  Why is he not protecting his daughters from this abuse?  My guess is he agrees with it which is so sad for these girls.  \n\nAnd OP is an abuser as well for allowing this.  She’s forcing her daughters to behave like second class citizens not just once a month - which would be bad enough - but multiple times per week. Now she’s going all Pikachu face when she’s finding out they’re going to go NC the moment they legally can.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 969,
              "content": "Right? My grandparents lived literally around the corner from us and we saw them once a week at the most. This is downright torture at this point. Your daughters deserve better. Have the conversation with your In-laws that you should have had years ago: that your daughters are in control of THEIR bodies and THEY get to choose what they wear. If the grandparents can’t shut up about it, the kids don’t have to go anymore.\n\nEdit: YTA",
              "id": 67,
              "comments": [
                {
                  "score": 444,
                  "content": "[deleted]",
                  "id": 68,
                  "comments": [
                    {
                      "score": 31,
                      "content": "That sound you hear in the distance is me cheering on your support of you son.  Good for you! He is a lucky boy to have such a devoted mom.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I have those relatives. My dad grew up near Chicago, as did I, but everyone on his side of the family is deeply rooted southern rural Baptist and his parents retired back down there. My late grandparents, in fairness, stifled a lot of the controlling crazy, probably because we lived so far away and they didn’t want to risk even less visits from us. But they lived in the area where our family started out in the US in the 1700s, so there were a LOT of relatives to interact with when we were down there. \n\nI remember my dad shaving off his beard before a trip down there, because beards were apparently frowned upon at the time. Maybe they still are, idk. One of my dad’s cousins worked for a beer company and would hook my grandpa up with her freebies from work. This was scandalous, both her working for an evil alcohol company and him having the odd cold beer. He was in his NINETIES at the time, ffs. Let the man enjoy himself maybe?\n\nI miss my grandparents, but after my grandfather died, both my dad and I were like “cool, we never have to go down there again!”. And we haven’t.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "[deleted]",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "omg with that type it’s always no don’t be feminine until boys with curly hair. then it’s how dare you give him a traditionally masculine haircut lmao. also southern, and plenty of my friends/neighbors growing up had similar experiences.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": ">he's got the rest of his life for the world to shit all over him\n\nI love this phrasing",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 640,
              "content": "100 percent! I thought we were talking about a couple of special occasions, not several hours several days a week. \n\nLeave your daughters at home instead. They shouldn't have to spend their time with judgemental bigots. YTA big time. \n\nStand up for your daughters. I certainly hope your own home isn't run on these principles.",
              "id": 74,
              "comments": [
                {
                  "score": 702,
                  "content": "It’s a real nasty little lesson for the son to absorb about women and girls, too.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 103,
                      "content": "OOh, you're the first person to mention this. Yes. I wonder how he feels? I'd be anything but quiet if my siblings were being treated like that by my grandparents. It's bad enough I've seen this type of shit with my ex-inlaws when they play favorites with my kids. (I still call them out on their terrible behavior and they are both very religious who don't believe women are valued at all - seriously it's gross)",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 62,
                      "content": "Yes! Excellent point! We have all been so focused on the damage this is doing to the girls, but this will absolutely have an impact on the son as well. This has probably given him a sense of male entitlement already.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Exactly right! Also I'm wondering, is the son made to dress up in a suit and tie? Is the son expected to make himself uncomfortable for all these hours per week?",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "It probably is if her husband is “heartbroken” his daughters hate going to his parents house.  If he didn’t agree with his parents, he wouldn’t be confused or “heartbroken” that his daughters didn’t like being treated as second class citizens.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 534,
              "content": "Why do I feel that these grandparents have money and it’s about keeping them happy so they inherent?",
              "id": 80,
              "comments": [
                {
                  "score": 176,
                  "content": "Came here to say this. There must be a reason they are so preoccupied with keeping the grandparents happy.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Their will and money or social status",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "It’s giving Flowers in the Attic isn’t it? Be quiet and submissive so we get the bag.",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 134,
              "content": "I wanted to quote that line too. But rather to say \"It isn't going  to hurt the grandparents to look at girls in pants either.\" Just let them complain instead of giving in.",
              "id": 84,
              "comments": [
                {
                  "score": 14,
                  "content": "Right. OP says that the grandparents wouldn’t stop them from coming if they wore pants, but would complain about it constantly. Ok…so you choose listening to your children complain about it? Or are they just supposed to suffer silently? I would have shut that down right away—they’re going to wear what they want or we aren’t coming…end of discussion.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Well, I can come up with just 2 reasons why OP is not putting an end to it. \n\n#1 She is a doormat for her in-laws.\n\n#2 She wants her daughters to wear dresses and is happy her in-laws are the way they are so she can use them as scapegoats.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "OP should let the girls stay at home and just take the dresses, as they seem to be the most important part of these visits. /eyeroll",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Absolutely agree. Honestly OP mentioning that her daughter is already planning to go NC with grandparents seems to be one of the main reasons for posting, but more in the sense of \"oh no! If daughter goes no contact with grandparents, I'll have to deal with their temper tantrums and questions of why they are not visiting anymore\" over actual concerns for her kids. \n\nYTA OP, and a big one! Not even gonna go into the other big red flags you included in your post, others have those covered. But if you yourself want to keep any kind of close relationship with your daughters, you should grow a spine and support your kids.... and fast!",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I honestly don’t get why they aren’t allowed to stay home and not go",
              "id": 89,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2703,
          "content": "Hard agree. OP, the first thing you should have done is sat your in laws down, told them that your daughters are not comfortable in dresses, and that if they want a relationship with the girls, they need to keep their opinions on dresses to themselves. That's all it takes. \n\nMy grandma is 85. She has some really strong views on religion, and the lack thereof in my house. I told her that if she wants to spend time with my kids, she had to stop telling them that I was wrong for how I was raising them and speaking out against the UU church we attend. My kids greatly benefit from knowing her, and she delights in their presence. But setting a boundary isn't disrespectful - it allows us to have a flourishing relationship.",
          "id": 90,
          "comments": [
            {
              "score": 869,
              "content": "This! “Mom, Dad, our girls don’t like wearing dresses. They can either visit in clothes they are comfortable in and you can keep your opinions to yourself, or they won’t be visiting at all.”",
              "id": 91,
              "comments": [
                {
                  "score": 61,
                  "content": "Absolutely, solidarity with OP’s daughters would be huge. The resentment those girls must have for their PARENTS, poor things.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2350,
          "content": "Teaching woman to be submissive. Hell no! YTA",
          "id": 93,
          "comments": [
            {
              "score": 4272,
              "content": "Yes! It IS hurting her children. It’s teaching them that they can be uncomfortable to make someone else happy. It’s telling them that their body preferences are not as important as what someone else wants for their body. \n\nMom and Dad should be the ones who protect their children no matter the circumstance. Not the one who says it’s ok to let someone else make choices for you. That’s a crap lesson and a slippery slope. \n\nMaybe next time all 3 kids should wear dresses. See how that plays.\n\nEdit: Wow. Oh wow. Thank you for all of the upvotes and awards. ❤️ The best thing is seeing so much support for these girls!",
              "id": 94,
              "comments": [
                {
                  "score": 906,
                  "content": "And it's not like this is even a few times a year, per OP this is \"a few times a week for a few hours\"! So this is a regular extracurricular activity these girls get dragged to and forced to wear a dress for, and OP doesn't get why the girls resent it? Bullshit you don't OP. Bullshit.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 562,
                      "content": "That really stuck out to me as well, these girls are in high school.  At that age they are should be too busy for that.  They are not only be forced to at least spend 6 hours a week on this, they’re forced to wear clothing they find uncomfortable to placate a pair of old wind bags.  YTA",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 317,
                      "content": "I also doubt it's just the dresses and no other antiquated ideals, religous indoctrination, and speeches multiple times a week. Op, you just don't want to listen to it, and I get that it might be easier to go along to get along. But it's in no way fair to subject your kids to this if they hate it enough that your 16yo is talking about going NC with her grandparents in 2 short years. You need to speak to your husband and your daughters, then all together so everyone has the ability to voice how they feel and see where everyone is at. Then it might be a good idea to try and talk to the inlaws again at this point and let them know that the grandkids only have a few short years to be alienated before you can no longer force them to see them so it may be time to try to change or prepare for that NC eventuality.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": ">a few times a week for a few hours\n\nI don't even see my best friends that often! I feel like the dresses are the Iranian yogurt here.",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 399,
                  "content": "[deleted]",
                  "id": 99,
                  "comments": [
                    {
                      "score": 351,
                      "content": "Yep.  My grandpa used to hit me so hard on the back when he greeted me that I’d yell at him.  My parents never stood up for me and instead made fun of me for years for it along with my whole extended family.  And my parents still wonder why it took me eleven years to tell them I was raped in high school?  Lol not just for this specific reason but the overall lesson of being told my body doesn’t belong to me and mens egos are way more important than my pain",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "And I can almost guarantee it isn’t just the clothes making the girls uncomfortable. The grandparents have absolutely said (or done) other things when OP wasn’t watching.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": ">in a lot of cultures women only wear skirts and dresses so I don't think it's a big deal. Plus it isn't like it hurts them to wear a dress a few times a week for a few hours. \n\nOP should tell her in-laws in a lot of cultures women wear pants. Plus it isn't like it hurts them to see girls in pants a few times a week for a few hours.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I hope that the grandparents that they need to make happy leave a lot of inheritance so that it will be worth for OP to alienate her children.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And have the boy wear PINK",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yup came here to say YTA because you are putting your in laws comfort level above your daughters comfort level. If I as a teenager had been made to wear dresses to visit my grandparents…. Whoah",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 254,
              "content": "Bodily autonomy?!?! Hell no, not for women! YTA",
              "id": 106,
              "comments": [
                {
                  "score": 12,
                  "content": "The mom writing this is saying her kids \"won't shut up about how uncomfortable it is\" (why would a parent think like this😷) then proceeds to ONLY worry about the grand parents feelings like kids are dolls. I'm gonna laugh if the kids go no contact in the future",
                  "id": 107,
                  "comments": [
                    {
                      "score": 12,
                      "content": "At minimum, they're going no contact with the grandparents. The parents are definitely on thin ice. I can't believe how often they make them do this as well! I expected a couple times a month, not a couple times *a week.* \n\nI was a complete tomboy at their age as well. I couldn't handle how uncomfortable I felt in a skirt, let alone a dress. Fortunately, my very religious grandparents weren't also misogynistic assholes, and my parents have spines. I feel so bad for those girls.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "This...and that their desires and wants don't matter. OP is an AH",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1029,
          "content": "OP, one set of my grandparents was just like your ILs and I have had virtually no relationship with them for my adult life.\n\nI can’t think of a single memory of feeling relaxed or happy with them. There was always something they were picking at or criticizing. On the rare occasions I did see them as an adult, they criticized how little I visited the entire time, which in turn made me want to see them even less.\n\nI also had a lot of resentment toward the parent who never stood up for me with them and subjected me to all of their criticism. Every visit felt like being an emotional punching bag for a couple hours and I couldn’t wait to escape. My sister feels the same way. \n\nYTA and you need to do right by your kids. Sit down and have a conversation about what they want their relationship with their grandparents to be. I’m not saying never see them, but you may need to cut back, or your partner may need to have a difficult conversation with your ILs, or you and your daughters may need to find a compromise (like leggings under dresses) and you shut down any discussion of their clothes during visits.\n\nSome food for thought: I know there are some people who just really hate wearing dresses that much. But if your kids actually enjoyed spending time with your ILs outside of the dress thing, I don’t think this would be such an issue. I’d encourage you to really think about what your visits like them are like from the kids’ perspective and if the dresses are actually the true problem or a symptom of a different problem.",
          "id": 110,
          "comments": [
            {
              "score": 101,
              "content": "💯💯💯 Yes! My guess is the dresses are the scapegoat for other things the girls are feeling uncomfortable about because they can’t say what’s really bothering them. If that’s the case, OP and her husband need to look really hard at themselves if the girls can’t tell them the truth about what the dresses actually represent. It could be as simple that they really want to spend “a few times a week for several hours” with their friends or doing sports, instead of visiting the grandparents. This seems like an excessive and unhealthy amount of time to spend with people that is taking away time they should be spending with kids their own age.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Yup. I didn't really like dresses as a kid because they were uncomfortable, but in and of itself, it wasn't really the dresses, themselves; plenty of dresses are comfortable, and plenty of pants are uncomfortable.\n\nThe reason why *dresses* stood out is because of the social restrictions that came with them: I couldn't run too fast, climb a tree, wrestle, kick, etc. lest I accidentally flash someone, and there was a *lot* more fuss over messing up my dress than messing up my jeans. **It wasn't the dress that was uncomfortable, it was the social restrictions and enforced femininity.** I had no problem with dresses that were easy to wash and I could wear shorts underneath, but the older you get the less socially acceptable this becomes.\n\nI'm in a lot of queer communities now, so definitely in the back of my mind, some alarms are flashing that one or both of these girls might not be a cis girl, might be nonbinary, or might otherwise be queer in some capacity. But, that would just be another insidious layer to the ILs' insistence on dresses. Even if they are 100% cis-het, there are still plenty of reasons to resent dresses that have nothing to do with the clothes themselves.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That's exactly how I felt with one set of grandparents, I could never relax around them. My other grandparents I was happy to visit because they were happy and positive.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 931,
          "content": "Reading the 2nd and 3rd paragraphs I was thinking \"these kids are gonna go NC at the first opportunity\", and then there it is in the 4th lol. \n\n>The issue is our oldest is planning to never speak to her grandparents again after she's 18, and I'm worried it's affecting them\n\nGood. These controlling, bigoted grandparents deserve no less. YTA for regularly making your own children uncomfortable to pander to them.",
          "id": 114,
          "comments": [
            {
              "score": 628,
              "content": "Wait, did I read that right? Oldest is already planning on going NC as soon as she has the legal right to decide that for herself…and op is worried about the effect that’s having on the sexist fundie *grandparents?*\n\nGood lord. YTA, op, in so many ways.",
              "id": 115,
              "comments": [
                {
                  "score": 70,
                  "content": "I’m puzzled at why she has to wait till she’s 18. I decided I no longer wanted to see my grandmother at 13 and never did. Not even attending her funeral.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 208,
                      "content": "I mean...op's here asking if she's t.a. for not letting her teens *dress themselves* to visit the grandparents. I imagine allowing them to decide whether or not to visit in the first place has never occurred to her.\n\nIme, people who see this kind of blatantly sexist and fundamentalist religious behavior and call it \"traditional\"...don't always have the healthiest nor most realistic understanding of personal autonomy and boundaries.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Same here. At about 14 I just flat refused to see my paternal grandmother anymore and that was that. It upset my dad, but that was the price he paid for allowing her to treat me poorly for basically my whole life.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yes. Yes you did read it right. She worries about that more than how being forced to wear something uncomfortable to have the *pleasure* of meeting sexist, religious nuts every single week affects her daughters. As if it is an honor!",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 191,
              "content": "That really makes me think it isn’t even just about the clothes. The grandparents have definitely been saying or doing other things to those girls that OP either didn’t directly witness or simply ignores.",
              "id": 120,
              "comments": [
                {
                  "score": 104,
                  "content": "Yeah, zero chance their sexism doesn’t spill out at the girls in other ways.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 20,
                      "content": "But OP insists that the in laws totally aren’t bigots!!",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 317,
          "content": "New flash: Christ didn’t wear pants, either. So, if you’re traditional, it’s not masculine OR Christian to wear pants. \n\nThis is about controlling women’s bodies and removing their bodily autonomy. If it was three times a year, I might see it as an acceptable concession. Every week, for hours? YTA, big time. You are telling your daughters that other people can dictate about their bodies. It’s a terrible lesson to impart.",
          "id": 123,
          "comments": [
            {
              "score": 10,
              "content": "I always find it utterly amazing when people insist that girls must wear dresses and that boys must wear pants and never between the two shall meet that they conveniently forget that male and female clothing was astoundingly similar for centuries upon centuries with only the accessories or the way the same garment was worn differentiating the sexes. As a result I give two farts in a tornado about if a girl wears pants or if a boy wears a dress. It's all clothes that cover our body so who gives a damn?\n\nOP is a total AH. The biggest AHs though are the grandparents. Blech.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 305,
          "content": "Yeah. How hard is it to say \"That is a really shitty thing to think about your grandchildren. And it's just not how the world operates. Keep your mouths shut about what they're wearing, or the visits will stop\"? \n\nLike yes, emotionally it will be a bit of a hurdle for someone who's used to letting these people walk over them, but at the end of the day your kids should know you're on their side and in their corner. \n\nOP and her husband need to find their spines.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "Adding, their grandparents probably thought they were hussies for showing ankle, and looked rough and common for not not having some form of corset around the waist.\n\nMy great grandmother used to lace her mother's corsets for her in the morning. That's how much fashion has changed. And in the 40s women often wore pants. My Nanna would be wearing pants making ammunition during the war. Katherine Hepburn would be in black and white movies wearing pants. By the 50s they were standard attire for women. That is 70 years ago! If they are in their 80s they were choosing their own fashion standards in an era when women wearing pants was normalised.\n\nJust to add that it has nothing to do with fashion for the culture. They have decided something is or isn't acceptable likely contrary to the culture they grew up in. And now their grandkids are being forced to change their clothes to accommodate their opinions. That's controlling \n\nGreat they like women in dresses, then they can wear dresses. But they are dictating something that isn't part of the culture, to their own standards and everyone is accommodating because they don't want to upset them. Why?\n\nIs grandma going to make a fuss? Plenty of traditional values would think a woman shouldnt be so mouthy. is grandad going to make a fuss, plenty of 'traditional' values would say he is 'a bit funny' for caring so much about women's clothing. Or do they just get to pick what traditional values to comply with and everyone else has to make do?\n\nKeeping the peace may be the cost you like to pay, but you have almost adult children saying 'hey, that cost/benefit equation does stack up for me.' I would think raising women OP want them to be in a position where they have the bodily autonomy and confidence to be able to say no to people making demands on how they live their life. Or they are raising daughters who are more likely to change their lives around a controlling partner. Don't normalise women living smaller lives to make others feel more comfortable, there is enough of that already and it leads to heartbreak.\n\nAnd to add to that history of women: couldn't get a mortgage without a male relative signing off until the 70s, couldn't legally drink at the bar until the 80s in the UK. Traditional values are far too often handcuffs on women's wrists, put there on men, and then socially reinforced by women because it's 'virtuous'.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 110,
          "content": "I agree, its 100% sexist. If it weren’t, they’d expect the son to show up “proper” clothing as well.",
          "id": 127,
          "comments": [
            {
              "score": 23,
              "content": "I desperately want OP to take all three kids to the iL's in pretty matching dresses and watch their heads explode when the son walks in.",
              "id": 128,
              "comments": [
                {
                  "score": 11,
                  "content": "The son should have a full face of makeup hair done to perfection, nails and jewelry. Grand parents will EXPLODE😂",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19540,
      "content": "YTA. I know it seems like it’s just easier to get them to wear a dress but it’s sending them the message that their feelings and comfort aren’t as important as other peoples. Their grandparents should love them for them, not if they wear what they consider appropriate clothing. It’s not 1950 anymore. G-parents need to accept things are different and you need to support your kids.",
      "id": 130,
      "comments": [
        {
          "score": 7462,
          "content": "Also, it's not like we're talking visits twice a year at Christmas and Easter or something like that... OP said \"a few times a week\"! That's kind of a lot to deal with, actually. \n\nAnd I'm not surprised they don't want to visit anymore, they've now come to associate visiting those grandparents with being forced to be uncomfortable. They're old enough now to start making their own decisions about this. \n\nAnd your husband is perfectly capable of saying, \"Well mom and dad, I know you love seeing the girls but to be honest they're tired of being criticized for wearing pants, so as long as that continues they've decided they don't want to visit anymore.\"",
          "id": 131,
          "comments": [
            {
              "score": 1853,
              "content": "Right, like twice a year, Not that it’s right or wrong but my family would turn it into a running joke and it’d be a funny albeit borderline traumatic memory but we’d talk smack how crazy our grandparents were… Multiple times a week like they’re regularly in each other’s lives is a no-go and ridiculous.",
              "id": 132,
              "comments": [
                {
                  "score": 155,
                  "content": "Right? We would all show up in gowns- husband and son included🤣",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1020,
              "content": "> Also, it's not like we're talking visits twice a year at Christmas and Easter or something like that... OP said \"a few times a week\"! That's kind of a lot to deal with, actually.\n\nYeah, this felt pretty reasonable up until that. \"Every once in a while you might have to do something uncomfortable to make someone you care about happy, even if the thing they're happy about feels stupid to you - we do this because we care about our loved ones\" is a fine lesson to learn. \"You need to put up with other people's irrationality on a regular basis because we said so\" is a much worse lesson.",
              "id": 134,
              "comments": [
                {
                  "score": 1030,
                  "content": "Sorry, I don’t think this is reasonable at all. Those girls never wear skirts, yet they are forced to whenever they visit the grandparents.\n\nEven if it only were several times a year, how is it reasonable to do that? Their brother surely doesn’t have to accommodate to this nonsense, so the girls are essentially taught that they are inferior and have to accept feeling physically uncomfortable just because they lack a penis.\n\nI get it’s important sometimes to do stuff you don’t want to, but having to wear skirts just to avoid conflict with people who are clearly in the wrong isn’t one of that.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 517,
                      "content": "They should send their son in a dress.  \"I thought the grand kids were expected to wear dresses???\"",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 143,
                      "content": "Also, as someone who was forced to wear skirts and dresses as a preteen, it will turn them off of skirts and dresses. I didn’t wear one for years because my grandmother made me wear one every day, even in the dead of winter. One day I begged to wear jeans and she said no, wear your wool skirt. My wool skirt was knee length and itchy. She also made me wear thin tights.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Makes me wonder if a possible monetary inheritance from the grandparents could be a factor here. “But we have to cater to their toxic misogynistic principles so they’ll include us in their will!”",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Hell, I can still remember the absolute screaming fight I had with my mother who REALLY wanted me to wear a dress for Easter and I REALLY didn't want to. Vivid memories of exactly where we were, and of the green pants I wanted to wear. I think I eventually wore her down by insisting I would scream and cry the whole time if I wore a dress. I couldn't have been more than 5 years old. \n\nI feel for those girls so much.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 343,
                  "content": "But the same logic applies to the grandparents. They can suck it up and be uncomfortable seeing the girls in pants (the horror /s) because they love their grandchildren. Dont they?",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 88,
                  "content": "That's not reasonable. There's no reasonable amount of misogyny children should be expected to accommodate.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "\"Every once in a while you might have to do something uncomfortable to make someone you care about happy, even if the thing they're happy about feels stupid to you - we do this because we care about our loved ones\" is a fine lesson to learn.\"\n\nIs it? You're describing appeasement which is not the move to make, it's just enabling them and their backwards beliefs. \n\n We shouldn't be bending over backwards because lazy old people don't want to put in effort to change. The excuses of \"it was a different time\" have never held water. \n\nThere have been people who could clearly see slavery is morally wrong since before written history, people who don't believe in the diety of the day, have supported women's rights, gays being treated equally, etc all hundreds of thousands of years before the actual changes became the norm. Seems like it always has been and always will be the open vs closed minded and at it's core that's a choice. Yes you can be put in a situation where you're at a disadvantage like being raised in a hyper religious family where the idea that it's a choice is unthinkable but yet countless people in those exact groups manage to see through the shit and get out under the same circumstances. How long of a leash are we supposed to give to the rest who can, but are not, doing things to be better people or make the world better and are actually doing everything in their power to do the opposite because doing good requires work. Doing evil requires nothing.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": ">you might have to do something uncomfortable to make someone you care about happy\n\nHard pass. The people I love and those who love me don't get to demand me being uncomfortable for their own enjoyment or happiness. We're not talking about going to a party or something superficial, even though that is also valid. This about being comfortable in your own skin. People who ask and demand you be uncomfortable for their sake after you've expressed how uncomfortable something makes you don't love you very much.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 693,
              "content": "Yeah, that blew me away.\n\nI disagree totally with doing this, but doing it 2-3 times a year is completely different than doing it multiple times per week!\n\nI'm going to guess if OP and Hubby had laid it out from the start that this wouldn't be tolerated, the grandparents would be well over it by now. Now its going to be a much bigger thing than it would have been if they'd just responded with \"the girls are allowed to wear whatever makes them comfortable, and if you continue to complain we just won't be bringing them any more\" when this first became an issue.\n\n&#x200B;\n\n>The issue is our oldest is planning to never speak to her grandparents again after she's 18, and I'm worried it's affecting them.\n\nOP, I'd be worried about how its going to affect your relationship with them more if I was you. One day they're going to work out that while GPs were the ones complaining, it was you and your husband who actually forced them to do this...",
              "id": 144,
              "comments": [
                {
                  "score": 88,
                  "content": "I’d wonder though if hubby would have been so conditioned to appease his parents that when he had his own children that the boundary never got set. Thin end of the wedge has ended up here on a precipice with his oldest daughter wanting to go NC the first chance she gets. OP, I don’t know if you tried arguing for your kids’ body autonomy when they were young, or didn’t even know what type of parents you and hubby wanted to be (me and my partner muddled through it with plenty of disagreements at the beginning), but it’s time to put your foot down and stand up for your kids. As others have said, your daughters deserve bodily autonomy and their own boundaries to be respected. And your son surely does not need to start believing that it is okay to treat people like this either.\nOP right now YTA. But you might have a chance to turn that around if you stand up for your kids decisively.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Yeah this is intergenerational trauma to a T",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Unfortunately, I see husband putting this off on OP.",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Exactly! I was very much a tomboy from ages 10-16, my mom made me wear a dress for ONE occasion the first year I fought back and never again. It was maybe 2-3 times a year that I was expected to wear a dress, but after the first time we went through the fighting, all she cared was I was dressed nice enough for the occasion. \n\nNowadays I LOVE wearing dresses, but i doubt i'd be so inclined if it was forced upon me to hen i was young",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I made the assumption that it was just that, a couple times a year, maybe once a month at the MOST. I was with OP until that sentence. YTA for that, man. \nI know my grandma doesn't like how I portray myself all the time. It took her a few years to get used to my tattoos and my hair being weird (lol) but I mean, I'm her granddaughter. She may still not like it but she loves me and deals with it. She's happy to see me and that's enough. They should accept, not just your daughters, but like.... At least what is deemed societally normal... ALSO ladies were wearing pants in the 70s anyway so boo all that too. It seems like theyre more stuck in the 40s, 80 years ago, anyway.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "Exactly. There's a difference between \"please don't wear jeans at your cousin's wedding\" and \"we are going to let closed-minded misogynists dictate what you should wear on an almost daily basis because *their* values are more important than *YOUR* autonomy.\" What some people seem to be missing is that this isn't about a dress code, it's about some pretty antiquated gender issues and there are a lot of additional messages in that.\n\nOP, if you think your kids are only being alienated by their grandparents you're kidding yourself. You've sent a very clear message that any gender equality they feel at school/ around friends away from the in-laws is ultimately meaningless because when it comes down to it, multiple times a week, every single week, ***it can be revoked*** at the whim of anyone else whose values and opinions you prioritize more.  You're prioritizing people who believe that your daughters are only as important as their ability to submissively please other people with their femininity and appearance. \n\nIf that sounds like a gross exaggeration that can't be true (\"no, grandma and grandpa care about them more than that!\") then surely gma and gpa would eventually be able to accept them in pants, no? \n\nIf not, then you already have your answer. What you need to realize is that either way, this is *already* the answer your kids see ***you*** enabling on a near-daily basis. You are not on the sidelines here OP. Your in-laws may be old fashioned, but you're the one teaching your kids that seeking your in-laws' approval is much more important to you than advocating for your kids. (\"Now remember, kids, it's more important to hide who you are in order to please everyone else, even if they're trying to control your body, appearance, femininity, and making you ***deeply*** uncomfortable.\")\n\n*(Slow clap...)*\n\n Ask yourself if you would want them to date a guy who also supports this message. Letting them wear jeans at home doesn't matter if you're still teaching them that their autonomy only exists when it isn't contested by anyone else who wants to look at them.",
          "id": 150,
          "comments": [
            {
              "score": 18,
              "content": "I have to wonder (as other commenters have) how much money OP expects her family to get when these misogynistic bigots die?  What amount is worth selling her daughters’ self worth?",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Your reminder that 50 years ago was 1973, not any time in the 50s.",
          "id": 152,
          "comments": [
            {
              "score": 10,
              "content": "Exactly! I was born in 1971, and these grandparents probably aren't much more than 10 or 15 years older than me. \n\nMy suggestion to Mom is that she let the girls go out and find the mini-est micro mini skirts they can find to wear over to the overbearing religious grandparents' house. It meets the letter of the law -- they're wearing skirts and not pants.",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Yes this absolutely this. Girls are constantly taught their feelings aren't important. Please please stop doing this. How would you feel if they end up in a relationship with a man who wants to control how they dress and how feminine they are? Because currently you are setting this as a normal thing for other people to control because of how they feel. Girls are already given so much crap about having to look perfect, be feminine, spend hundreds of dollars a year on beauty products. Please don't add to that misogynistic pile and let them be who they are. If their grandparents won't shut up about it don't see them. That's their choice to be an asshole. Don't pile on with them",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yeah, and by OP strongly encouraging them to wear skirts and dresses, she’s telling them that the grandparents are right about wearing pants making them dirty little devil-worshippers. Your self worth shouldn’t be based on what you wear. Well, within reason. Obviously don’t go over to the grandparents wearing a shirt that says “WHORE” on it. That would be stupid.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It’s sending the message that for them to be loved by their grandparents they have to change who they are, and by proxy this feeling will get to you as well. \n\n“If they really loved me they would defend us from the grandparents, but instead they’re enforcing those changes, which mean they don’t love me for who I an either”.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yup. Children of any age should know that their boundaries matter - at younger ages it can be tricky (my son hates having snot sucked out of his nose but it's not always up to him, because he doesn't know how to blow his nose himself and he needs to breathe - just for example) but with 16 and 14 it's a no-brainer!\n\nOP, it should be up to your daughters whether they:\na) visit their paternal grandparents wearing dresses,\nb) visit their paternal grandparents wearing pants (and face the consequences of hearing their grandparents criticize them for the whole visit), or\nc) don't visit their paternal grandparents because both the previous options make them uncomfortable (or, phrased differently, let the grandparents face the consequences of being sexist jerks, because contrary to what OP says in the first paragraph, harassing people for not adhering to your preferred gender presentation IS \"outwardly bigoted\").\n\nYTA for making this choice for them, multiple times per week, for their entire lives.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "also funny that OP says the grandparents think the world should’ve stopped 50 years ago. in my head i get that she means the 1950s, and it’s wild to realize 50 years ago was 1973…",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "YTA, obviously. Women wore pants long before the 1970s, and the things that men wore way before then would qualify as fairly feminine attire today. Extra frills were in!  \n\nNote that you’re destroying the relationship between them - your oldest will not see them in 2 years anymore and your middle is sure to follow.  Who is this benefitting?  (Answer:  OP, who can avoid parenting instead of setting boundaries with in-laws)",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": ">it’s sending them the message that their feelings and comfort aren’t as important as other peoples.\n\nAll of this. You’re training them as girls that misogyny is their problem. Abso-fucking-lutely not.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10345,
      "content": "YTA, women wore pants 50 years ago. And qhy are the girls over at their place so much, if your In-Laws are not able to actually respect them?",
      "id": 161,
      "comments": [
        {
          "score": 5188,
          "content": "I don't think people realize 50 years ago was the 1970s.",
          "id": 162,
          "comments": [
            {
              "score": 2639,
              "content": "And even if they are stuck im the 1950s, women wearing pants, was a thing back then.",
              "id": 163,
              "comments": [
                {
                  "score": 1594,
                  "content": "And since the grandparents are using Christianity to back their views, let's talk about how back in Biblical days, neither women \\*nor\\* men wore pants.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 635,
                      "content": "I wonder if they could get the boy to wear a dress just once to see the reaction.  I would pay to see that!",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My grandma was born in the 40’s, and loved buying me clothes that showed off my figure, as she put it. Teenage me had no complaints! Sundays were spent catching her up on the weekend dates I got from her boy-catching outfits she picked out for me lol.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Pedal pushers are gorgeous! Even better with a nice pattern! Or slacks, jeans… Kate Hepburn virtually never wore skirts unless she had to.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yeah, the thing about no pants is more 1930s, so 90 years ago.",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 282,
              "content": "Yeah I tried to do the math on this and I feel like we’re past the point where the ‘they’re just old!’ argument works.\n\nEven if the grandparents are 90 years old, they would have been in their teens/twenties during the 50s and would’ve definitely seen women wearing pants early on. You’d think they would have gotten over it, seeing as it’s been normalized for the majority of their lives",
              "id": 169,
              "comments": [
                {
                  "score": 111,
                  "content": "Trousers were common in the 20s and 30s for women, particularly in the form of what's vasically pant suits. Pre WW1 it was more frowned upon though, so they're only 110 years out of date.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "Exactly! My grandma is 95 this year (b. 1928) and she is an italian catholic, raised in a poor household of farmers.\n\nShe still wears pants everyday and asks my best friend (F) about her girlfriend every week. Sends them presents for christmas and birthday and invited them to her house multiple times.\nMy younger brother lives with his girlfriend without being married. No problem on that too, she actually took his girlfriend in as another granddaughter 😆\n\nBecause she's intelligent.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "It’s nothing to do with age and everything to do with religion. Some churches don’t allow women to wear pants, cut their hair, wear makeup, or jewelry. I went to school with a girl in the 90’s who was Church of God and she had hair down past her butt and always wore the same ankle length denim skirt to school every day.\n\n\nOld people are probably more likely to attend churches like that, it’s true, but there’s plenty of fundamentalist Christian Millennial/Gen Z women on Instagram rocking the Duggar aesthetic because their church tells them to.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 259,
              "content": "I know!  If they were really stuck on 50 years ago, I'd think they'd be all about women wearing pants, and smoking pot, and key parties...",
              "id": 173,
              "comments": [
                {
                  "score": 21,
                  "content": "Or mini skirts! I bet they have an opinion about the length of the dress as well...",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Maybe that's what they are worried about! If the girls wear pants they might smoke pot and have key parties!",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Listen here you little shit",
              "id": 176,
              "comments": [
                {
                  "score": 108,
                  "content": "I feel the same way when the AITA are about “my parents/uncle/aunt are old fashioned” and they’re Gen X. I GREW UP IN THE ERA OF FRANKIE GOES TO HOLLYWOOD AND TWISTED SISTER AND BOY FUCKING GEORGE BEING MAINSTREAM ARTISTS it wasn’t the fucking 1880s.",
                  "id": 177,
                  "comments": [
                    {
                      "score": 8,
                      "content": "WE ARE THE BEASTIE BOYS, HAIR METAL BAND, AND FREAKING MADONNA GENERATION.  No Gen X has any excuse to be \"old fashioned\" and impose that crap on others. \n\n\"YOU GOTTA FIGHT.  FOR YOUR RIGHT.  TO PARRRRRRRRRRRRRRRRRTAY\" \n\nFight for your kids, OP.  You are failing as a parent, and will have NC because you allowed misognystic bigots to control your children's lives. Shame on you. And they are in high school- WTF are you doing forcing them on these visits instead of building up their extracurriculars for college.  Oh wait- you probably think women should not be educated, because it will make your In laws UNCOMFORTABLE. \n\nSeriously, shame on you OP.  Shame on you and your husband for abusing your children to appease your in laws.",
                      "id": 178,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I think of the 50s when I think 50 yrs ago. Lol",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "50 years ago women were wearing hip hugger bell bottoms and tube tops.",
          "id": 180,
          "comments": [
            {
              "score": 12,
              "content": "Well maybe. I graduated from high school in 1971. Ours was last class where girls were required to wear skirts and dresses. When I got to college in the fall of ‘71, we were the first group of girls allowed to wear pants walking through the dormitory lobby.\n\nUnless you worked in a head shop or a record store, you were wearing skirts and dresses to work—including nurses.\n\nOf course all that has changed, thankfully. These parents should not make their kids wear dresses, or skirts to visit the grands. Those kids are never going to visit the grands, once they hit 18. I’m pretty sure they aren’t going to be stopping home for a lot of visits either. Who wants to spend time with people who have no sense of proportion, and obviously have no respect for their thoughts and feelings.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Yeah, 50 years ago? Sounds like they think they're back in the Victorian ages more like. Do they also not let the girls show any ankle?",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Katharine Hepburn wore pants in her 20’s and 30’s and she was born in 1909",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7074,
      "content": "You are on the wrong side of history here, without question.\n\nYTA\n\nMy grandmother used to fight with my dad about me not wearing dresses to church. God I hated dresses. \n\nMy grandmother was born before 1900, she had some *very* outdated ideas. And my dad was not exactly a hero dad in many ways, but in this aspect he stood up for me, hard. Against his own mother who he loved and admired very much. \n\nBut on this he would not allow her to try to teach me that I had to follow these ridiculous expectations. I overheard it once, and it stayed with me for life. It mattered in many ways. It is *really important* to stand up for your girls on this.\n\nI don't think you understand how significant it is that you're failing to do it.",
      "id": 184,
      "comments": [
        {
          "score": 1228,
          "content": ">My grandmother was born before 1900\n\nWhich is the only time a person can be born where having those attitudes is remotely excusable. \n\nEvery woman relative of mine that I’ve met in my lifetime, including the ones that were born when the Titanic was the latest thing, has worn pants.",
          "id": 185,
          "comments": [
            {
              "score": 187,
              "content": "Just deleting the comment that was here because what I meant is different than how it's being read, and it's producing some off-piste comments about church-related patriarchies that don't actually fit with the thing I was describing.",
              "id": 186,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Fun fact: women wore pants in the 1800's too, and people LOST THEIR MINDS because of it.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "100%…as someone who never had someone stand up for them, it really fucks you up. They will never forgive you if you don’t. Ever. They may understand but not forgive.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "You're absolutely right. The dress-wearing only lasts a few hours a week, but the mental effects of knowing your grandparents can't accept and respect you as you are, and that your own mother won't support you lasts forever. The reinforcement that you have to make yourself uncomfortable to make other people happy, especially to young girls, is extremely problematic.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "My dad’s mother believed dancing was a sin. I was taking a social dance class, and when my grandmother was visiting I asked my mother if I should just skip the class that week to keep the peace. My mother told me no, that we are who we are, I had nothing to be ashamed of,  and we won’t pretend for her. My mother had the talk with her. I went to dance.  My grandmother was not happy, but she loved me and never said a word to me about it. My mother taught me that day that I should do what I think is right for me no matter who it upsets, and I knew she had my back. YTA.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This. Misogyny is bigotry OP and it has an impact on girls.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4241,
      "content": "YTA. You’re teaching them their comfort doesn’t matter and it’s their responsibility to cater to how other people think they should dress and act. It’s misogynistic and gross. Stop it.",
      "id": 192,
      "comments": [
        {
          "score": 547,
          "content": "This- why I don’t talk to my parents- fix urself before it’s too late",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "I was trying to figure out why it bothered me so much when i too, was thinking, it’s just a dress? But this is what i couldn’t formulate into words. YTA op i would never want my kids to feel that way.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Body autonomy and boundaries—who needs those? /s",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "It's also dangerous. Teaching their daughters to forgo bodily autonomy to make someone else comfortable will not keep them safe from dangerous men when they enter adulthood. \n\nThat is a necessary boundary to teach daughters. OP is setting their children up for low self-worth and unhealthy relationships.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yup, I bet the men don’t have to wear a suit and tie",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3050,
      "content": "YTA, and being forced into skirts/dresses against their will may well be part of why your daughters hate visiting.  If you let them wear shorts or pants, your in-laws would have to learn to accept what they cannot change, or learn to live without their granddaughters when they alienated them enough that they refuse to come.\n\nThe fact that some cultures don’t accept women’s rights is a terrible excuse for imposing on your daughters.  Plenty of cultures are accepting of parents beating their children, would you use that as an excuse to occasionally hit your children?",
      "id": 198,
      "comments": [
        {
          "score": 1185,
          "content": "Right? Arguing that women in many cultures don’t have the *right* to wear pants isn’t the argument you think it is. \n\nYTA- I’m glad your daughters are strong enough to see through your misogyny and stand up for themselves. Sad their own mother won’t but at least they’re likely to have each others backs.",
          "id": 199,
          "comments": [
            {
              "score": 437,
              "content": "Right?! \"Other women around the world don't have the right to wear pants, so why should my daughters have that right?\" is a shitty argument.\n\nNot to mention I think being forced to wear dresses is the *main* reason OP's daughter's hate visiting. If there aren't others. It's clear the grandparents care more about what their grandchildren wear than about their actual grandchildren and considering OP's daughters are teens now I think they can definitely tell that by now.\n\nGrandparent's narrow minded view of the world is going to lose them their grandkids and if OP doesn't start defending them they might lose their daughters. YTA",
              "id": 200,
              "comments": [
                {
                  "score": 13,
                  "content": "Yep there will come a time when those daughters will realize not only were their grandparents unreasonable misogynist but also that their parents were unwilling to stand up for them. I'm going to feel terribly sorry for those children when they realize that. And then there will also come a time when the parents are \"I don't understand why my children don't talk to me\"",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "Wel I hope OP doesn’t vote, be financially independent, have a job, had a full education or drive because in other cultures women don’t have the right to do those thing. \n\nBut on a more serious note, what ever in the F? Women started wearing trousers in the 1890s, and they really got popular starting in the 40s, that’s 80 years of women wearing trousers.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "It’s such a bad take. Women in Iran are literally dying for the right to dress themselves. \n\nAlso I am totally aware of what family pressures to conform to traditions are like. Most of my family are Muslim. I went to a Muslim school. I refused to cover my hair. I got flack for wearing too short shorts from a family member once and I swear to goodness did I not mentally disown them right that second. \n\nUnless I’m forcing you to wear pants coz I want to wear pants, don’t try to stop me from wearing them. \n\nAll of that said, I get where the mum is coming from. It’s the easy way out for her because actually wearing a dress isn’t such a big deal etc. \n\nBut telling them they need to dress a certain way for them to just be treated with respect - by their grandparents - is not a solid message for young women. \n\nLastly, I still wound up traditional (not religious). But it’s my choice and I will be damned to the hell I don’t believe in if I ever stop petitioning for people to have a CHOICE.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "If it’s just a few hours a few times a week, surely the grandparents won’t mind!",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "They likely would also hate visiting in pants bc of the gruff they’d get. YTA but not as much as the grandparents (yet)",
          "id": 205,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2611,
      "content": "[removed]",
      "id": 206,
      "comments": [
        {
          "score": 411,
          "content": "[removed]",
          "id": 207,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2294,
      "content": "[removed]",
      "id": 208,
      "comments": [
        {
          "score": 996,
          "content": "And they make the kids do this A FEW TIMES A WEEK. \n\nThis isn't \"wear a dress for granny's birthday because she's gonna be dead soon and it's her special day\" .... They are exposing their kids to these narrow minded grandparents and forcing them to follow their misogynistic dress code several times a week.",
          "id": 209,
          "comments": [
            {
              "score": 262,
              "content": "The way they aren't allowed control of their own bodies because of the disapproval of their grandparents tells you everything you need to know about the messages they are getting several times a week.",
              "id": 210,
              "comments": [
                {
                  "score": 19,
                  "content": "I'm sick to my stomach thinking about those young women having to deal with that bullshit several times a week. I wouldn't blame either for going NC with all four of these sorry excuses of adults. All four deserve the YTA award. Infuriating.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Also, how do they even have time for several visits per week? With school and activities, I can’t even imagine.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It's like they're unwittingly making the kids go NC even harder. Thing is, if OP continues to make the girls placate the bigot grandparents, they will go OC on HER too.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "I wish my own mother had been courageous enough to stand up for me with my horrifically bigoted \"traditional\" grandfather.",
          "id": 214,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "It isn't easy to stand up to parents or inlaws, but as a parent, you have yo do it for your kid. You need to be their voice, and advocate for their rights. Otherwise you're sending your children a very strong message that they need to dress the way other people want, and behave how they say, regardless of whether it makes them uncomfortable or not.\n\nMy in laws made a lot of negative comments about the way my children dress, and the way they have their hair and we were very clear that as long as it isn't a health o safety issue,  our children get to choose how they dress and how they have their hair, because it's their bodies. If they couldn't abide by that and respect it, then we don't visit them and they're not welcome here.\nI don't blame your daughter for planning to cut contact at 18, since you've made it clear you won't be standing up for her. That, if nothing else, should tell you exactly how serious this is for her and how important it is.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This.\nAlso this seem to be that kind of people who are using religion the way it suits them.\nThere is not a part in the bible that says \"Men wear trousers women wear Dresses\" that's bs. There is nothing Christian about trousers or skirts. Jesus did not know or wear trousers.\n\nOP, this is a very important lesson for you girls. Stand up for them and show them that they are the masters of their body! It's one thing to Dress appropriately for an occasion and the other thing to let make them wear something they hate regularly. You teach them it's okay for other people to decide over their bodies because they are girls, which is something you don't want. \nUs women, we have fought so hard for the right to choose our own clothing. Please do not allow mysoginst patriachy-people to steamroll over them.\n\nStand Up for your girls. Tell them they enjoy their visits significantly less because they are forced to wear something they don't feel comfortable in. Tell them you want them to like to come but constant nagging will shoo the Girls away.\n\nI really feel for your daughters.\nStory time. When I was little, I was all dresses and ponies and pretty things. When I hit puberty my style did a U-turn and for about five years I did not own one skirt or dress. Being the only Girl on my dad's Side my grandma and aunt could not get over how I prefered jeans and hoodies and such in the beginning and I hated every family occasion for it. But they got used to it after my parents were clear and firm about how my clothing was neat and clean and just normal stuff.\n Now I have both but skirts and dresses mostly for going out or summer. Those are not practical. No Pockets, you always have to think about how you sit and move and there is a lot of things you can't do in them. \nPlease free your girls.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1721,
      "content": "YTA - You are forcing gender stereotypes and religious fundamentalism on your daughter's while ignoring body autonomy.",
      "id": 217,
      "comments": [
        {
          "score": 418,
          "content": "This has never made sense to me, forcing women to wear skirts for modesty. Skirts are easy access and back in Jesus times men didn’t wear pants.",
          "id": 218,
          "comments": [
            {
              "score": 125,
              "content": "everyone wearing tunics and feeling that good breeze",
              "id": 219,
              "comments": [
                {
                  "score": 19,
                  "content": "Free balling like a god.",
                  "id": 220,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "This! ^ I was going to to say if they really care about religion so much then everyone has to wear skirts & dresses. It's not about it being Christian it's about being sexiest.\n\nEdit: sexist*",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I feel so vulnerable in a dress. Never again!!",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1408,
      "content": "YTA. Why do your in-laws sexist ideals matter more to you and your husband than your children?",
      "id": 223,
      "comments": [
        {
          "score": 174,
          "content": "If I had to guess, I'd say the answer begins with \"I\" and ends in \"nheritance\".",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 149,
          "content": "This! A million times this!!\n\nYTA",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "OP sounds like a people pleaser, at the expense of their own children.",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "> It's not that they aren't allowed over if they wear pants, it's that they won't shut up about how much they hate it. \n\nYa know what might shut them up about it? Wearing pants. \n\nThe grandparents will either tire themselves out bringing it up, or they will make a big deal about it and then they can decide if they're blowing up the relationship. \n\nThe kids are definitely getting old enough to make their own decisions,  as one of them has already told you. Let them decide. \n\nYTA.",
          "id": 227,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}