{
  "post content": "Odd title I know. \n\nI haven't done it yet but I want to put up a garden fence on my side of the property line in order to prevent my neighbor from mowing my property. The reasons why are:\n\n1.) My neighbor uses a large riding lawn mower to take care of their yard and often mows a portion of my yard in order to avoid items in their backyard (trailer parked right by - but not on the property line, trampoline placed 6 inches from line). \n\n2.) About a week ago they mowed and damaged one of my sprinkler heads. It didn't cause my yard to flood and I was able to fix it without having to replace it, but it was still annoying. I saw my neighbor do it, notice that they did it and move on. \n\n3.) They recently (within the last 12 months) moved in, and we have waved and said hello to them but they have ignored us. They are friendly with other people in the neighborhood by seem to ignore us and the other neighbors who share a property line with them. \n\n4.) They tore out the property boundary stick between our house and theirs. There is a hole where is was and I want to place something (anything) in that spot before the hole fills in. \n\nI want to separate out my assumptions because they are based on my observations which may be different than what the neighbor is actually doing (two sides to each story and whatnot).\n\nFirst, I have a feeling they are trying to slowly encroach on to our property. They have the smallest lot and have it full of stuff (shed, trailer, trampoline, boat, etc.) and we have the largest lot and keep it pretty empty. Secondly, they don't seem to respect our property since they damaged our sprinkler. Lastly, they haven't been very friendly to us and I want to create a barrier between us and them. \n\nI am not a large fence person, in fact based on city rules I can't fence a large portion of my yard. I have planted trees between us but can't have them on the property line. I am allowed to place a small decorative garden fence. For reference they are those two to three feet tall metal fences that can be hammered into the ground, they are 100% decorative. I want to place it on our property to prevent them from mowing our yard. I would plant shrubs and flowers next to it so it doesn't look stupid.\n\nI have told family and friends this idea and they seem to be split on if I am being a petty asshole. So am I?",
  "id": 1,
  "comments": [
    {
      "score": 12805,
      "content": "NTA and I hate neighbours. Fence it immediately\n\nEdit: Thanks for the awards! Glad to see us all coming together to hate next door.",
      "id": 2,
      "comments": [
        {
          "score": 2163,
          "content": "I feel this so much. Had bad neighbors awhile ago. One lady in our neighborhood cut tulips my mom had growing in our front yard. Neighbors are horrible and the good ones are few and far in-between.",
          "id": 3,
          "comments": [
            {
              "score": 1548,
              "content": "We have neighbours on one side that poisoned all our plants over time so their clothesline would get more sun. We know they did it because on several occasions we caught them in our yard with poison bottles. Also, the head of a large coconut palm fell onto me whilst I was in our paddling pool one summer. When we looked at the tree, there was a cork placed in a hole drilled in to it and the entire head very rarely just falls off in one complete piece. \n\nWe spoke with our local council and put up the tallest privacy screen we were allowed to. It’s a pity because now their clothesline gets absolutely no sun and they had to put in a second clothesline in the middle of their pristine, manicured lawn.",
              "id": 4,
              "comments": [
                {
                  "score": 711,
                  "content": "I literally breathed a sigh of relief over the last bit about the clothesline thing backfiring. What kind of complete wretch poisons their neighbors plants??",
                  "id": 5,
                  "comments": [
                    {
                      "score": 353,
                      "content": "They really are awful. We’ve never had any issues with neighbours in the past. My husband thinks it’s because the old couple we bought our home off were complete pushovers. They let them dictate pretty much everything regarding the gardens, fencing, etc. \n\nThen we moved in and brought small dogs (who are always kept inside unless we are in our yard with them) and we didn’t agree with everything they wanted to do. \n\nIt wasn’t obvious at first that they were dying. It was a concerted effort over about 12 months. By the time we realised what was happening it was too late to save most of the trees, plants and shrubs that bordered their side of the yard.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 211,
                      "content": "Well... actually... I am that kind of dick..  In my defense, the plants I've poisoned are extremely invasive bamboo that our back neighbor planted to hide his pool mechanical equipment and as a privacy screen along the fence line between his and all his neighbors' yards.  It's taking over our back yard in a number of places, and I've spent 3 years poisoning the shoots and spraying the growth.  Some of the spray hit the plants on his side of the fence, too, and now those plants around his pool pump & stuff have died.  We're still fighting it in a number of other places along that back area, though.  \n\nThis neighbor also originally routed his pool backwash to drain into our yard because he didn't want to pay the fee to drain it into the city sewer.  He disguised the pipes, and we didn't figure it out until a huge trench had been cut into our yard -- but we caught him doing it one day and put a stop to it.  He's also routed other stuff to drain across our yard.  He's a thoroughly horrible neighbor.\n\nOP, you are absolutely NTA.  I hope you can get a lovely fence -- and maybe set the posts in some quick-setting concrete so they can't be easily pulled out!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "And here my biggest yard complaint is that I have a huge Holly tree (I hate Holly trees due to many experiences living with them) and I planned to take down. But when we moved in, the neighbor came over (super sweet lady) and told us how the previous owners had never kept up with the landscaping  and she had worked for years to take care of  the plants bordering her yard. She was so proud of saving the beautiful Holly and nursing it back to health. It IS beautiful. Told the hubby we'll just wait to take it down. They are great neighbors and it is worth nurturing that relationship to keep a perfectly healthy tree.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I had terrible roommate that tried to poison all my houseplants as I was moving out.. Half didn't recover and they all got sick the same week.. They had all been easy maintenance plans. People suck.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "I think I had the worst neighbor in existence. He got really drunk one night and passed out on his living room floor, so his wife asked my partner to help get him into bed (we were friends before all of this). At some point in his incoherent state, he decided my partner was a burglar and literally attacked her. They brawled for a while before my partner was able to escape but he followed her, got a gun out of his boat and proceeded to chase her around the neighborhood brandishing the weapon and firing it. He was pointing it into other neighbors windows. He had completely lost his mind. He caught multiple charges and did some time. It was super awkward living next to someone who has a no contact order with you (and several other neighbors). It was even worse that I worked at the only store in our town and he would constantly come in in hopes that I wasn't working so that he could buy beer (which he wasn't supposed to be doing). It was always super obvious bc he'd pretend to use the ATM machine and then leave without making any purchases. Guy was a total douche canoe.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Holy snapping ducks! What a complete nutter!!!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "My dad had to chase their neighbour around with a sword because he broke in while drunk.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 74,
                  "content": "Can you explain more about the coconut? Do you think they threw it at you or something? Was the hole and cork to get the water inside?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 374,
                      "content": "The entire head of the tree fell down. So if you imagine a palm tree with coconuts growing on it, all the palm fronds fell at once in a complete and intact “crown.” The hole was drilled so he could pour poison into the tree and then cork it closed so the poison didn’t run out. We live in Australia and it is a common way to get a palm tree to die without immediately chopping it down. The crown is incredibly heavy and I was just lucky that the paddling pool had a shade sail over it. It took most of the force but I was pinned under the crown for a little while. Destroyed the shade sail too, those fuckers.\n\nETA: the husband always waits until I am home alone to yell at me belligerently whilst drunk. My husband is ex career military and this spanner of a man knows he will not win in a fight, so he cowardly waits until he’s not home.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "My partner is convinced that our neighbor killed his rose bush. I thought he was crazy, but I guess if it's happened to you it's very possible that they could have poisoned and killed the rose bush. The bush and a small cedar tree next to it died suddenly after he had talked with one of them about moving their bushes off our property because he wanted to put a fence up.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "You are very kind the results at my house would have been infamous.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Oh. That’s Karma. She’s been known to be a bitch.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Before my parents and I moved into our new house we lived at the same place for 16 years. My childhood neighbors were super sweet, older couple who owned a few chain restaurant locations around town. They also had 2 granddaughters that would visit during the summer and they would come over to play... Unfortunately they ended up moving and we had a nightmare with the new neighbors. \n\nWhen they moved in they were told the fence that they had was actually like a foot onto their property so if they wanted to move the fence and have a new one placed in the right spot to let us know as we had redone the back fence and it had some type of design at the top that needed to cut in a way so it wouldn't look funny. We offered to help pay for that section of fence because we didn't want it to look stupid.. we came out a few days later to them cutting the fence in half with a chainsaw. Completely ruined our fence, and then built their fence 7 ft tall when bylaws said only 6ft. We had a lot of issues with them but this was the biggest issue I can recall. Occasionally you'll get that 1 neighbor who is AWESOME but other times I legit think the devil lives next door",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Whaaaaat cut tulips that’s rude. Any more details?",
              "id": 20,
              "comments": [
                {
                  "score": 122,
                  "content": "One day my mom  caught her and the lady was saying they were so pretty to look at and that's why she took them home. My mom agreed and added \"THAT'S WHY WE PLANTED THEM IN OUR YARD\". Not long after that our lawn was mysteriously mowed and my dad re-mowed it. The neighbors were watching.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Mom sass is the best sass.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Wow creepy neighbors!!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "We live in the lower on a duplex, and we've had some annoying neighbors over the years. One liked to turn her TV up to the point we could understand the dialogue, and another occasionally got too loud while the kids were trying to sleep. The worst, though, were our first neighbors.\n\nThey were a couple who may or may not have been drug dealers. We're not sure, but they did have random cars pull up, someone knocked on their door, and 5 minutes later left, and we know it wasn't food delivery because this was before stuff like doordash really existed. We occasionally found their clothes in our dryer, too.\n\nThe worst point was when they had 2 kittens. I once had to rescue one off the gutter under their balcony and they didn't even know it had escaped. Another time, I heard meowing while I was grilling and thought it was from an open window until I realized it was coming from their trash can. I found a black kitten in a bag of litter, clearly overheating. I wish I hadn't given that kitten back, but I was young, stupid, and believed it was somehow an honest mistake. About a month later, they gave us the other kitten as they needed to rehome it for some reason. I don't know what happened to the one I'd found in the trash, but I'm afraid I failed to save its life by giving it back. As for the kitten they gave us, we rehomed it with one of my wife's coworkers as we couldn't afford a second cat at the time.\n\nSometime after they'd moved out, I don't remember how long, the cops came by looking for the woman. I kinda wish I knew why, but I'm probably better off not knowing.",
              "id": 24,
              "comments": [
                {
                  "score": 18,
                  "content": "Oh love. Try not to beat yourself up about the poor black kitty. Hindsight is 20/20 and while reading it, it definitely sounds like that kitten was put in the trash intentionally, I can see why you’d want to give them the benefit of the doubt and believe it was just carelessness considering the fact that one had gotten stuck in the gutter prior to that.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This happened when I was a kid, but near where I lived then this little kid picked the flowers in their neighbors yard. The flower house’s owner came out and shot the flower picker kid’s father full in the chest with a shot gun. The guy lived. Maybe it was bird shot. Not sure, I was pretty young. But they were having a BBQ when this happened so there were a lot of witnesses. I knew some of the people who testified in the trial when it aired on court TV back in the day. Great stuff.",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I'm lucky in that the worst things I can say about my neighbors is that I think ones dog poops in my yard a few times a year when it gets out and one's a little too chatty at times.  In fact I'm probably the bad neighbor 'cause my yard looks like garbage all the time because of some home renovations we are doing. 😂 On the bright side from what all the neighbors have told me we are at least 100% better then the last guy who was basically a recluse who never mowed or raked or did any yard maintenance and the yard was basically being reclaimed by nature.",
              "id": 27,
              "comments": [
                {
                  "score": 3,
                  "content": "I'm the recluse neighbor but I'll keep my stuff pretty at least. I just prefer not to talk to neighbors if it can be avoided",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Good fences make good neighbors.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Damn man, is it really that rare someone has good next door neighbors? I live in a real rough area and both my next door neighbors are nice people. One is an old man with lots of old dogs and the other is a very handy Hispanic fellow who works on cars. \n\nThat being said some of the people on the other side of the street aren’t so nice, lol. The dude living in the house directly across from me got kicked out and now there’s dudes camping out in there. Since then there’s been a shoot out and a fire in that house",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is why I'm so scared. The sweet little old lady living next door to me is officially too old to live alone and is moving. I hate the idea of sharing a yard with new people.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I would flip my shit if someone cut my mom's flowers(without her permission. I've asked b4 and she let me cut a couple). My mom's flowers came from her mom's garden. I've seen her cry over someone accidentally stepping on one of her flowers. I would drop kick that neighbor straight into next month",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 347,
          "content": "Good fences make good neighbours.",
          "id": 33,
          "comments": [
            {
              "score": 301,
              "content": "I see a lot of people disagreeing with this, so I just wanted to add my two cents. Good boundaries are the key to any relationship, be it neighborly, romantic, friendly, etc. A fence is a physical boundary that often denotes a relationship boundary. People who blow up over physical fences will often ignore relationship boundaries, and thus reveal themselves as bad neighbors with or without a fence (and I refer to being irritated by a fence existing rather than property damage or incredibly ugly constructions. It’s possible to be legitimately irritated by a fence).",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "I would not be able to recognize my neighbor if I ran into them at the local grocery store and I like it that way. \n\nI stay out of their business, they stay out of mine. It's great.",
              "id": 35,
              "comments": [
                {
                  "score": 2,
                  "content": "Can I be your neighbor? If I'm not already",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "THIS!",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Fences or walls inbetween houses are pretty much the norm in the UK, I'm always surprised at how many houses in the US are often completely open, even to the rear.",
              "id": 38,
              "comments": [
                {
                  "score": 6,
                  "content": "I live in the UK in a 4 in a block - so boundary is middle of the garden is shared, side is ours and the back is our neighbours. We fenced off our owned property and my neighbour couldn't care less: I think she's happy to have it all separate and even if she wasn't there's fuck all she can do because it's my property. It's mad some places in the US you can't even build a bloody fence.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 262,
          "content": "OP get a surveyor out there to make sure you all get accurate  dimensions of the properties. Then put up a fence. A friend of my mom lost nearly an acre because the owner of the property behind her put up a fence. She didn't think much of it until years later she had the land surveyed and found how far over the fence was. In some states there are laws that basically mean if the fence has been there long enough, too bad that's theirs now. You also are not allowed to remove a fence on your property without a court order, because that is their property. Very weird.",
          "id": 40,
          "comments": [
            {
              "score": 110,
              "content": "Sounds like they did have a surveyor and the neighbor removed the boundary stakes. \n\nI do agree they should have one come again before the fence is installed, but doubtful the neighbor will respect it unless they can’t cross the boundary.",
              "id": 41,
              "comments": [
                {
                  "score": 32,
                  "content": "Masonry fence. Just try to move it. I dare you.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Nah put up one of those wavy British brick fences",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Most states it's illegal to remove that marker.  Suck down the $600 for a new survey and fence them off.  Our neighbors suck and we'd do the same if we didn't plan on moving in the next year or so",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Do this asap.Make sure to put up a no trespassing sign so they can't say anything",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "And get a title company involved, there may be easements. Don't let them get away with this.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "And I thought you weren't allowed to remove the boundary stakes?",
              "id": 47,
              "comments": [
                {
                  "score": 14,
                  "content": "My neighbour took out boundary stakes then tried to claim my shed was on his property.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 6,
                      "content": "What an ass.  And a dumb one at that.  Did your neighbor think you would just forget where the stakes were and hand it over?  Is that what the plan really was?",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "AFAIK the wood pegs are only meant to be temporary anyway, it's the iron pins and the concrete monuments that are supposed to be permanent, in most of NA it's a crime to tamper with them.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's what I understood too. I think it's near impossible to take those metal stakes out.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Can you put up your own fence, without touching theirs?   Just put up a fence along the true border, right through what they’re presenting as ‘their yard’?\n\nIt would be petty and pointless, but it would amuse me to build a wall from nowhere to nowhere just to mark out the boundary.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "So much hate. There was so much tension in my household growing up because our neighbors had an easement that allowed them to use a bit of our property to access theirs. The previous owners of that house were the kids of the previous owners of our house. It was a mess. They used this to slowly encroach...first mow then plant flowers that spread and finally a fence that was juuuuust over their property and onto ours. And then they got a new one that was juuuuust that much closer. It took years of legal action to get them to halt and even then it was never pleasant to live there. OP, put up a lovely fence with a smile.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "NTA.\n\nAlso, if you're in the US (and you may want to double check by state); if your neighbor pulled up a boundary pin that was laid by a surveyor, that's a 2nd degree misdemeanor. You may want to look into it and mention it to your neighbor.\nI only throw that out there because we had a property dispute a few months ago and our neighbor removed the pin, needless to say the surveyor had a lot to say about it.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Not to mention that they broke the law if they ripped out the *permanent survey monument* (it left a hole in the ground, temporary survey markers are a wooden stake with an orange flag on it, so I'm betting it was the permanent metal marker).",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Yep, fence it in. I've yet to find a neighbor I've liked... my last neighbors would use my garbage cans/recycling bins, park at the shared driveway entrance, do construction work at 2AM in the morning.\n\nI moved away, but 6 months before I left they were raided by the police. Never did see them again. I did quite enjoy my time at home for those 6 months.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I don't hate neighbors and, based on the OP, I say fence as much of your yard as you possibly can, OP- it's only going to go downhill from here.\n\nNTA",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Depending where you are if they mow for some period of time they can eventually claim that area as their own. That is a long time but if you don’t protest the clock starts ticking.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Well said\n\nNTA- since you can't plant trees how about some evergreen bushes? They grow fast and as high as you want & if planted side by side make 2-3' apart make a great wall.\n\nSame problem at our cottage so we planted 25 of them along our property line and keep them at about 7' high in the city we back onto a park and have 10 on a 35' wide lot and keep them at 15'-17' feet high but with 2.5' gaps ( city bylaws ) as our back fence & works perfectly at keeping nosy neighbors out of our business.\n\nDefinitely NTA",
          "id": 59,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2461,
      "content": "NTA - simply put, it is your property. I would be remiss of I didn't add: good fences make good neighbors.",
      "id": 60,
      "comments": [
        {
          "score": 180,
          "content": "Also, it's not like theres any kind of relationship to worry about ruining with these rude turds",
          "id": 61,
          "comments": [
            {
              "score": 2,
              "content": "Speaking of turds, some years ago, the house next door to me was sold. The new owners (who turned out to be perfectly nice) engaged some creeps to do renovation work before they moved in. I found human feces in my backyard twice during this period and there’s no way anyone from my family had deposited them, I knew. So I made sure to be home one day when they were working, and had my garden hose all set, and “accidentally” blasted the culprit up the butt when he dropped his pants. Needless to say there were no more poops in my yard after that.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1968,
      "content": "[deleted]",
      "id": 63,
      "comments": [
        {
          "score": 171,
          "content": "This exactly, who knows what they could do next. Better to nip it in the bud than have them think it's ok.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Also! Legal recommendation, install the fence a few inches shy of your property line. This makes it harder for them to contest the fence, hang or decorate anything on it, claim part of it is \"theirs\", and if they damage it, may add trespassing to their property damage charge. \n\n(Not a lawyer, just read a lot of r/legaladvice.)",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Add a security camera for good measure",
          "id": 66,
          "comments": [
            {
              "score": 8,
              "content": "Also hire 2 security guards, one for morning and night shift",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Yup, the whole point of fences is to make sure boundaries are enforced. \n\nI would get a surveyor to triple check prior but that fence is going up",
          "id": 68,
          "comments": [
            {
              "score": 2,
              "content": "Why did it take this much scrolling to see the word \"surveyor\" mentioned? OP may not even have the official property lines.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1024,
      "content": "NTA. If your neighbor keeps damaging your property, you have the right to do something to prevent it",
      "id": 70,
      "comments": [
        {
          "score": 322,
          "content": "Even if there was no damage they have a right to put up a fence.",
          "id": 71,
          "comments": [
            {
              "score": 58,
              "content": "Yes, you're right",
              "id": 72,
              "comments": [
                {
                  "score": 32,
                  "content": "Thank you.  Hope you're doing good in this pandemic.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I an doing alright, hope you are too :)",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 694,
      "content": "No, so long as you've had the property surveyed and you know where boundary is located. Arbor vitae nature's fence, you can plant them and have them feed and they will grow in fairly quickly. One of my greatest regrets was not fencing the exposed side of the yard. Would have saved me years of grief.",
      "id": 75,
      "comments": [
        {
          "score": 477,
          "content": "This! Get it surveyed, don’t assume the old marker meant anything at all, then build the fenciest fence you’re allowed to build.",
          "id": 76,
          "comments": [
            {
              "score": 219,
              "content": "I was looking for a similar line of comments. Get the survey done. And, in many areas it's illegal to remove/move a surveyor marker.",
              "id": 77,
              "comments": [
                {
                  "score": 104,
                  "content": "Yeah, but regardless of what laws might surround the survey marker, imagine the fallout if the marker was already in the wrong place before it was removed and a fence was then constructed based on this incorrect position?\n\nIt could result in the neighbour removing the fence and passing on the costs to our OP if the marker was wrong in one direction, and/or if wrong in the other direction, in some years adverse possession could result in a loss of that portion of the property.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 27,
                      "content": "This might be a stupid question but I'm not in the US and here most houses already have a fence. But how can the surveyor tell where the boundary is?",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Surveys cost like thousands of dollars. I wanted to get my 5500sqft lot surveyed in Oregon and they said it would cost a minimum of $3000-6000. Like, I can get it if you're going to invest 30k in a new structure on your property or something but jesus I could not justify it for a fence. At least not on my property.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Yes. You can explain the survey if needed as ensuring your fence doesn’t encroach on *their* property...but meanwhile, the fact that you’ve had it surveyed communicates to them that you know your stuff and that any efforts at future encroachment won’t be easy.\n\nAlso, if you can afford it, I might throw in some other improvements (flower border, whatever—stuff you would actually like to have out there!) at the same time as the decorative fence, to help give it the feel of just being part of a more general upgrade. The less overtly aggressive you can be about maintaining your boundaries, the easier it might be to keep the door open to eventual friendly coexistence.",
          "id": 81,
          "comments": [
            {
              "score": 38,
              "content": "Yeah put in flowers, rock garden, water feature etc. Make a nice little garden that just happens to have a decorative fence as a part of it.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Seconding the flower idea! Our next-door neighbors are nice, but they mow into our yard a lot and their kiddos used to ride bikes across our front yard. We planted a sunflower border, with a little knee-high decorative wire \"fence\" to protect the flowers while they were small enough to get mowed over.\n\nFun fact: before we got on with the little wire fence, one of the young sunflowers did in fact get mowed over. It grew back split, with two full stems going off at angles from each other, so it's now some kind of giant mythical sunflower hydra. It's actually pretty great.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "They need to put in one of the decorative WIRE fences. First time the neighbor runs over it with a riding mower, they won't have a lawnmower. Ever tried to clear wire from the cutting deck of a riding mower? Ask your local bush hog guy about it. And he has lots more wiggle room to clear it.\n\nEdit for autocorrect.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "My sister's neighbor threw a fit when some power company people were \"in their yard\" When she got a survey and they found her yard is actually about a foot larger than where the old fence was and the power company guys were not on the neighbors land. Surveying is worth it.",
          "id": 85,
          "comments": [
            {
              "score": 27,
              "content": "Also, the power company almost certainly has an easement.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Arbor Vitaes are terrible plants though if you don't have the perfect climate and drainage.",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 284,
      "content": "NTA I don’t know what it is with reddit and putting up fences but fences are so standard where I’m from. It’s normal to not want people on your property and if you’re in the US it’s private property so it’s yours to fence if you’d like.",
      "id": 88,
      "comments": [
        {
          "score": 135,
          "content": "I find it extremely weird for people to just not have a fence around their garden? I’ve never seen that where I live, everyone has a fenced off garden and they’re high fences so it’s all private. At most our neighbour can pop his head over the fence to talk with us. But I can’t imagine anyone just walking into my garden because I didn’t have a fence",
          "id": 89,
          "comments": [
            {
              "score": 56,
              "content": "Same. I'm British and I can't think of anyone without a fence. Even my parent's garden which is over an acre has a fence around it.",
              "id": 90,
              "comments": [
                {
                  "score": 2,
                  "content": "Yep, and also British. The only part of my garden not fenced off is one of the sides at the front, but the land it’s connected to is owned by the management company, not any neighbour.",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "Where I live it’s common for people to have fenced off back yards but the front yard is usually not. Luckily our neighbors always had rocks on either side of us instead of grass so we always knew where the property lines were. But others had grass on both sides and it was harder to determine the property line. I would definitely put up a little garden fence with plants if my grass touched my neighbors. I want as little to do with anyone who lives by me as possible.",
              "id": 92,
              "comments": [
                {
                  "score": 2,
                  "content": "I gotta say where I live almost everyone has a fence around the front garden too, even a little 15cm wooden fence just to say “hey this is mine don’t walk on here”. Guess we love our privacy lol",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Houses in the cities in the US are often like that, at least the backyard. But out in the suburbs and exurbs, lots of houses have no fence at all.",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Hardly anyone has a fence where I live in the Southern US.",
              "id": 95,
              "comments": [
                {
                  "score": 2,
                  "content": "But like, why? Why would you want people to just be able to walk into your garden and see what’s going on in your garden? It makes no sense to me",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I think its a Midwest American thing, they seem to have big unfenced yards for historic reasons.  It's semi colon in Australia depending on your suburb to not fence your front yard but fence from house back, really depends on the individual",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "American here. I have to keep in mind that garden means backyard to y’all But it’s a completely foreign concept to me to not have a fence around that area. Front yards don’t have fences usually in my city/state unless you don’t have a backyard but I can’t think of anyone in my state that doesn’t have a fence",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Same here, if it's not fenced off, it's most likely a public park or field of some sort. People do get creative though, lots of decorative fences like OP mentions, and hedges, etc.",
              "id": 99,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Some parts of the US have HOAs that do not allow fences or if they do it can only be a chain linked fence of some sort",
          "id": 100,
          "comments": [
            {
              "score": 3,
              "content": "Then that’s a place I would not live... I want my privacy, I’ve heard one too many stories of people lurking in backyards without fences",
              "id": 101,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 171,
      "content": "NTA. Good fences make good neighbors. It isn't petty to protect your property from damage.",
      "id": 102,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "NTA. They are encroaching on your space, as well as damaging your property. A garden well is a perfectly acceptable solution - it's not permanent or unsightly, and easy enough for you to put in without causing further problems.",
      "id": 103,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 96,
      "content": "NTA. Moving property markers is a huge red flag. Breaking your sprinkler and not caring is downright disrespectful. Fence it.",
      "id": 104,
      "comments": [
        {
          "score": 3,
          "content": "I hope OP gets a security cam to monitor their yard",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 58,
      "content": "NTA. I don't understand what could possibly make you TA in this scenario",
      "id": 106,
      "comments": [
        {
          "score": 20,
          "content": "It's prompts like these where it seems obvious, but they OP closes by saying some of the people OP knows thinks he or she would be an asshole, that makes me thing there's info we aren't getting.",
          "id": 107,
          "comments": [
            {
              "score": 20,
              "content": "There are always those relatives that think that going along to get along is the smartest thing and that if you dare speak up for yourself then clearly you're asking for trouble.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That's true. Who knows, we only ever get certain details in these scenarios",
              "id": 109,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}