{
  "post content": "\nMe F35 and my exhusband M37 got separated 1 year ago, we share custody of our 15 yo daughter.\n\nMy exhusband has her for certain days, and his birthday didn't fall on one of these days. In fact, it fell on one of the days where my daughter is supposed to be with me. He called me so we could discuss letting him have my daughter on the day of his birthday but I told him no because it is not his day to have her, he got my daughter involved and she said she really wants to go but I said no because I have my reasons. My exhusband dropped it but on the day of his birthday, I went to pick my daughter up from school but I discovered that he came and took straight to the restaurant where his birthday party was taking place. I was fuming I called him but he didn't pick up, I then called my daughter and she said she was with him. I used location feature to track her phone and got the address.\n\n\nI showed up and interrupted the party, My exhusband started arguing with me but I told he had no consent to have my daughter with him that day but he said my daughter wanted to be there for his birthday. My former MIL tried to speak to me and I told her to stay out of it then told my daughter to grab her stuff cause we were going home. My exhusband and family unloaded on me and I tried to ignore them and just leave but my daughter made it hard for me. I took her home eventually and grounded her for agreeing to leavd school with her dad when it wasn't his day. Her dad called me yelling about how bitter and spiteful I was to deprive my daughter from attending his birthday, I told him it's basic respect and boundaries but he claimed it was just me being spiteful and deliberately hurtful towards him that I didn't even care how it affected my daughter. I hung up but more of his family members started blasting me on social media saying I showed up and made a scene at the restaurant. Went as far as calling me 'unstable'.",
  "id": 1,
  "comments": [
    {
      "score": 54332,
      "content": "YTA\n\nYou should have let him have her on the birthday. Why make such a big deal?\n\nYes, your ex shouldn't have picked her up after you said no to the switch. But once he did, you should have left her and dealt with it afterwards.\n\nAll you're accomplishing now is alienating your daughter. She's 15 and enjoying her time with dad. Let her.\n\nEDIT thank you kind redditors for the awards and votes!",
      "id": 2,
      "comments": [
        {
          "score": 17659,
          "content": "Also no one seems to care she used go's to *track* her daughter? Massive invasion of privacy? She's 15. When I was 15 I had to be home by 10 and let my mom know where I was, but beyond that I was pretty free. Like... Would you stop her from going to a friend's house because it's \"your night\"?",
          "id": 3,
          "comments": [
            {
              "score": 6728,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 3231,
                  "content": "Yea, I'm 18 and my parents still track me no matter where I go, ask where I'm going and who I'm with.\n\nEdit: A lot are saying I'm 18, an adult and can do what I want, which yes I see what you mean. Asking where I am going and who I am with is a given that all parents should ask for, and I agree with tracking a phone to an extent. In my eyes, it should be used in an emergency and not to see if I'm lying where I am going. My parents do pay for my phone, so it makes sense. Just sometimes it's nice to have privacy and to be trusted to where I am going, without being tracked.\n(And to those who say that being a teen I must be more tech savvy than my parents, I am not, I got this phone at 18 and before that had a flip phone that I named Chris (: )",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2007,
                      "content": "Just turn off the tracking app. Ur 18 they have no right to do it.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1154,
                      "content": "My parents tracked me until 22 when i said no more and got kicked out over it. Its sickening and absolutely disgusting in everyway.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "My kid is only 12, he always tells me where he’s going and I trust him implicitly and I will do until he gives me a reason not to. I do have an app to see where he is but I have never actually used it and I wouldn’t unless he was late home from school or something. \n\nWe have the best relationship he’s never given me cause to be concerned, so I’ve never invaded his privacy. I am a very young parent so it wasn’t all that long ago my parents were going overboard with stuff like that, when I really wasn’t lying or doing anything I shouldn’t have and it 100% caused me to rebel because it was so stifling, when you’re accusing teenagers of doing something they aren’t, you bet they’re gonna do it because why not they will be accused of it anyway!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Nothing wrong with the last two of those.  I'm a 48 year old Dad.  I don't track, I ask.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "My parents tracked me well into college. I had to sit my mom down and tell her that I was a single college girl, and if she kept tracking my phone at 2 am she might not like which bed she finds me in. She stopped after that, I was 21",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "No I am a bad child for wanting to poop in peace. My mother needs to have access to check on me at all times. Locking the dot means I'm a terrible person for locking her out of a part of an her house.\n\n/S of course as now I do understand. This was my life once. I was over 30 before someone mentioned something similar and I realised how messed up this behaviour was. Escaping abuse doesn't end when you leave. It takes years of working out what normal really is so you don't pass abnormal on",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I knock on the bathroom door when my 8 year old is taking a bath or shower and I’m leaving him PJs or a towel.  He has said “Dad we are both boys abs you’re my dad so you don’t need to knock”. I tell I do because I respect his privacy",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "My kid had to show me how to use the “Find My” on my phone feature lol",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Too many posts on here of kids not having locks, or even doors at all, and wondering if they're the AH for retaliating.\n\nKids don't respect their parents when their parents won't even treat them like independent human beings who have the right to privacy.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "It is nuts how many parents use various apps to track their kids. I don’t go in the  big kids’ rooms without knocking, I don’t go through their stuff, and for the ones I co-parent, I was always willing to do a switch for a birthday or other special occasion. If you have that week, switch one day on two consecutive weeks so it evens out.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I think the worst part is getting grounded…. For doing absolutely nothing wrong. That’s going to ruin the relationship really quick",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Just because you can track her, doesn't mean you should.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My mom’s coworker has teens and asked my mom how she went about monitoring our phones when we were that age.\n\nMy mom was surprised and said she didnt, we knew they could check if they wanted to but they trusted us.\n\nSadly that seems uncommon now.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3906,
          "content": "The daughter *wanted to be there!!!!* She wanted to celebrate her father's birthday, and she didn't want to leave!!!! OP is on some obnoxious \"well-rules-are-rules\" power trip, and it is 1000% going to bite OP in the a\\*\\* sooner rather than later. YTA!",
          "id": 19,
          "comments": [
            {
              "score": 1769,
              "content": "YTA-OP\nI'm sure if it were the mothers birthday she would insist on the daughter being there regardless of who's turn it is.\n\nThis is basic coparenting stuff. My mom and dad got divorced when I was 7 and they were flexible about holidays and birthdays. They would even attend parties at the other's house with the new partners.\n\nBeing a parent is the focus not being an ex. You had your kid at 20, time to grow the fuck up.",
              "id": 20,
              "comments": [
                {
                  "score": 386,
                  "content": "Yup this. My parents divorced when I was young and the divorce decree spelled out which days & weeks we should be with whatever parent we weren’t living with but since one of them was military that pretty much went straight out the window. They were both super flexible and never dreamed of not letting us kids see the other because “it’s my day”. What petty nonsense is that?",
                  "id": 21,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Sounds like OP just wants to get back at her ex.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "The way I see it, it's good to stick to the agreement if one parent repeatedly disrespects the agreement, but that's not what happened here, I think.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "So petty. I have a week to week agreement with my ex as well, and I'd never dream of helping the kids away for a special occasion, especially so close to the seperation. \n\n12 months is nothing to a kid. They need to see the parents put them first not use them in some power game. \n\nYTA.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 329,
                  "content": "OP is probably the type that will demand a switch for her to get Mother’s Day but refuse to let dad get daughter for Father’s Day.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 24,
                      "content": "And after this debacle, the daughter would probably refuse to attend Mother's Day, or (rightfully) raise hell on that day if forced to spend it with her mother.\n\nKarma is a bitch, and so is the OP here.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Yes! Best advice I got when I got divorced was to try not to think of him as \"my ex\" and think of him as \"my kids' dad.\"  It's a good way to keep your focus where it should be, on what's best for the kids.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "OP is obviously full of resentment toward her ex. Too bad the daughter has to get caught in the middle.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "This is how my husband and his ex wife are mostly.  We've attended joint birthday parties and even other cookouts.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 854,
              "content": "It kills me that OP talks about consent here. Daughter’s consent is the one that matters in this scenario, not OP’s. Bitter and unstable are warranted insults. YTA OP.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 576,
              "content": "If my mom ever told me I couldn’t see my dad on his birthday after they split I would have died laughing. That’s my fucking father and he’s a very good one. One day I won’t have my dad anymore and not getting to spend time with him because my mom is petty would make me resentful",
              "id": 31,
              "comments": [
                {
                  "score": 45,
                  "content": "My ex passed away and I can only imagine the anger my kids would have towards me if I ever pulled some crap like this on them while he was alive.\n\nI didn't, because I'm an adult who didn't take whatever bitterness and anger I had out on their relationship with their father.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 472,
              "content": "And they went to a restaurant with his family at a seemingly appropriate time (I.e not late on a school night)\n\nIt’s not like he’s taking her out to a club with his weird old friends or putting her in danger.",
              "id": 33,
              "comments": [
                {
                  "score": 28,
                  "content": "Exactly.  It was about seeing her dad and HER FAMILY.  Just because they're not her mother's family, they still are her family.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yup. OP seems spiteful and controlling. Not surprised everyone is mad at her. YTA",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 428,
              "content": "shes also probably just one of those people who say \"rules are rules\" when it suits them. \n\nwhen it doesnt then its \"oh what rules?\"",
              "id": 36,
              "comments": [
                {
                  "score": 46,
                  "content": "Yeah, I'm sure if OP's birthday falls on one of dad's days there's going to be a million reasons why OP needs to keep her.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "When her daughter pulls an UNO card she does the ‘I am your *mother*, I make the rules’ bullshit. Yuck.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Lex mala, lex nula.\nA bad law is no law",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 380,
              "content": "OP had her reasons, which she didn't share with us.  What's the betting she didn't share them with her daughter either, because her reasons are unreasonable?",
              "id": 40,
              "comments": [
                {
                  "score": 216,
                  "content": "What do you want to bet her “reasons” were: dad has a new girlfriend who is there too!?",
                  "id": 41,
                  "comments": [
                    {
                      "score": 128,
                      "content": "probably with a bit of \"how dare you, daughter, to not hate this man\" sprinkled in there.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "It doesn't really matter much.  OP is obviously very angry and having a hard time being a divorced parent.  She needs counseling.  Her daughter will be of age any minute now, and she's running the risk of losing that relationship.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I wouldn't be surprised at all.  It's not worth betting on.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Ding ding ding",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "\\>What do you want to bet her “reasons” were: dad has a new girlfriend who is there too!?\n\nBINGO. How dare my daughter have a good time with that B\\*\\*\\*\\* in the room?",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Sounds like her reason was “I hate my ex”",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "Not taking that bet lmao, because I'm pretty much positive the \"reasons\" are \"I hate my ex and want him to suffer as much as possible.\"",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Exactly! It doesn’t seem like they had plans to do anything because she said that after she basically forced her daughter to leave the dinner they went home …… to do what??? It seems OP probably just wants to be petty .",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Exactly, her reasons are spite and looking for a fight I would expect. I’m sure that she might come up with a half baked reason to try and justify it, but I’m confident there isnt one",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I was looking for this exact comment. As soon as I read  she had her reasons with no hint as to what they might be I knew that OP was TA",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Exactly.  And I think the title is so misleading. I first thought she meant the daughter’s consent. The daughter was there with consent. OP, what you’re talking about is permission.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Imaging how devastating this must have been for his daughter breaks my fucking heart. This woman seems like the kind of “parent” who is not interested in the wellbeing of their child at all if it means they can stick it to their ex.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "YTA. Listen, it's not ok that he picked her up from school without consent, but you acted out of spite here and succeeded in angering and alienating every person involved. You should have let them have the birthday dinner and then discussed consequences and coparenting afterwards. Hell, you really should have just let him have her for a couple of hours for his birthday dinner and then she could have come home to you and everyone would have been happy. Or traded days. Your daughter is not going to forgive you for using her as a pawn in your angry game.",
              "id": 54,
              "comments": [
                {
                  "score": 9,
                  "content": "Seriously! It would be different if the daughter didn’t wanna be there but she did",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "OP probably started a 3 year countdown",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2158,
          "content": "She wants ALL the control, I think we found the reason why she has an ex husband. She will soon have an ex-daughter too. YTA",
          "id": 57,
          "comments": [
            {
              "score": 146,
              "content": "Absolutely",
              "id": 58,
              "comments": [
                {
                  "score": 107,
                  "content": "She actually grounded her daughter for going to her dad's birthday. Told mil to stfu.\n\nAm guessing new wife is hot..",
                  "id": 59,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Yeah that was a weird use of discipline in my opinion. You discipline your kid when they do something that is morally bereft, something that could potentially hurt them – – you don’t ground them for spending time with their parents. That’s ridiculous. It was clearly a power-play and the mom was angry because her position of authority was challenged and compromised.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Of course when dad has the kid and OP wants her for something then it'll be my ex is such a jerk. Or if OP needs dad to take kid in an emergency",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yes, this. \n\nIt would be one thing if the daughter said she didn't want to be with her dad on his birthday. But that she did and OP had to show up ruining the birthday and causing an obnoxious scene shows that OP is a mom with zero class, zero tact, and zero give a shit about anyone else's feelings. \n\nOP will be totally alone soon enough because the daughter will resent her forever for this. \n\nOP- YTA",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1676,
          "content": "Agreed. I’d love to hear the “reasons” she has because I assume if any of them were valid she would have shared them to begin with. Sounds like she’s just weaponizing their child to hurt dad, and clearly hurting her kid in the process.",
          "id": 63,
          "comments": [
            {
              "score": 477,
              "content": "Her reasons is that she’s spiteful and wants to be in control of everything and feel like she has power. Even if it was his day with her, she probably would have done *something* to make it about herself. She’s more worried about spiting her ex than making her daughter happy.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 329,
              "content": "It’s a year into their divorce. I’m willing to bet OP is still in the “I gotta prove I’m the better one so she’ll side with me more” stage and doesn’t understand co-parenting yet",
              "id": 65,
              "comments": [
                {
                  "score": 228,
                  "content": "Which is ironic given that she just alienated herself from her daughter even more",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Which is going to bite OP in the ass in the long run. She's using her child as a pawn to spite her ex and her daughter will end up resenting her for it, if she doesn't already.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Interesting if her definition of better one is the controlling asshole who doesn't let child go to other parent's birthday. If that's her goal she shot herself in the foot with her actions.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Makes you wonder why they divorced, right?",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 179,
              "content": "Yeah I would too, sometimes divorced parents on here make a huge deal about swapping days or making small adjustments in a custody schedule and it’s difficult to understand why.",
              "id": 70,
              "comments": [
                {
                  "score": 141,
                  "content": "[removed]",
                  "id": 71,
                  "comments": [
                    {
                      "score": 91,
                      "content": "I teach and I’ve met kids whose parents communicate through notebooks because they physically cannot stand to be in each other’s presence for too long that still swap about custody days when needed.\n\nCustody is about what’s best for the CHILD not what’s best for mom and dad. As long as there’s no safety concerns for being with the other parent obviously.\n\nAlso I hope OP realised that at 15, if her Ex took her to court to change custody her daughter is more than old enough to say “to hell with you” and live with dad full time.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Same and my ex is an asshole to me, he knows I’m not fond of him. I probably wouldn’t piss on him if he were on fire. If there’s a problem with “his weekend” we just swap it’s not difficult. \n\nHe’s recently had another kid so missed his weekend, I’m not unreasonable and took them to visit on “my weekend” the weekend after instead. \n\nI don’t see my kids as much as I’d like in the week because I’m having to work a lot as it’s just me right now. So I cherish my weekends, but of course I will give it up so they can meet their new sibling! \n\nA lot of people seem to hate their ex more than they love their children and it’s not fair on the kiddos, they aren’t stupid, if you’ve got something to say it needs to not be in front of the kid, no excuses for that, ever!",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I am so fortunate that my ex and I are extremely flexible on our schedule with our son.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Your son is fortunate too. \n\nMy divorced parents were great about this and it made the divorce easier for us. Divorce does seriously fuck kids up, even when it goes well and is smooth. And it was good that they did their best to mitigate the negative effects on us. \n\nWhen you add in drama like OP… one word: Yikes.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Its petty.  There is no why",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Especially the ones that are like \"I wouldn't take the child for x, because when I wanted him to take the child for y, he/she wouldn't.\"",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Yeah, that was suspicious to me.\n\nI've never seen someone with a legit reason withhold it in a post like this.  Even just a quick \"he was abusive\" or \"he lets the kid(s) do things that that are harmful\".  \n\nPeople explain their bad reasons too, but it's really odd to just drop a \"I have my reasons\" in this context.",
              "id": 78,
              "comments": [
                {
                  "score": 19,
                  "content": "Also makes me wonder if she explained her \"reasons\" to the daughter. If she just went \"because I say so\", it's not surprising that the daughter decided to go anyway.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "And considering daughter was in a public place with a bunch of her family, not just dad, I’m inclined even more to believe OP was just being petty. It’s not like the dad had snuck her off to some underground booze spring. They were eating dinner. With grandma and grandpa. In public. Ffs.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Op knows her “reasons” are bullshit that’s why she didn’t put them in the post.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "100%. They've just separated and she's still in the being-petty-to-cause-pain phase. Hopefully she gets over it in enough time to still have a relationship with her daughter.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Right? I read \"I have my reasons\" and thought oh stfu you have control issues and you're bitter. No better way to make sure your kids go no contact with you ASAP. Also, isn't a 15 year old allowed to tell the court who they want to live with?",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "That's what I was thinking. If she really had a legit, serious reason then she's not the asshole. But if that was the case I assume she would have said so. Saying \"because I have my reasons\" sounds a lot like \"I don't have any reason beyond being a petty b****\" in which case, massive YTA, obviously.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yawp",
              "id": 85,
              "comments": [
                {
                  "score": 25,
                  "content": "Yeah, I was thinking if she’s wanting us to side with her she can’t just say, “because reasons”",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yep this is exactly what I was thinking. \"I have my reasons\" but didn't post those reasons because she knows it would just give more evidence that she is TA.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 969,
          "content": "How little love must a mom have to her daughter if they're willing to use her kid to hurt her ex.",
          "id": 88,
          "comments": [
            {
              "score": 437,
              "content": "That she’s willing to HURT her daughter to hurt her ex, I think you mean…This was more than just using her; it was blatant abuse.",
              "id": 89,
              "comments": [
                {
                  "score": 24,
                  "content": "And it hurts the relationship between Mother and Daughter, more than her Ex.\n\nIn a few years, there won't be boundaries or custody, she'll be a grown woman and the daughter will remember how she was treated on this occasion with a simple decision to attend a party and the embarrassment that was caused because of her Mom's behavior.\n\nAre some battles worth painting into your daughter's head that winning is better than compromising for family, even if it's your ex, op? Because that's how your daughter will see it from now on.",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "It comes down to her hating her ex more than she loves her daughter.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "I've watched this kind of divorce/custody battle from the outside a few times with people I know. It's sickening, watching parents weaponize their kids against their ex. They'll use their kid for whatever they feel will score points against their ex, then scream about how their ex is mistreating their child because they don't stock the right snacks or some nonsense.",
              "id": 92,
              "comments": [
                {
                  "score": 16,
                  "content": "My parents got divorced and my dad was a scumbad towards my mom. My mom never ever used me and my brothers against him and made sure we had a relationship with him even when we were rebelling against him. I am forever grateful to her for it, it couldn't have been easy.\n\nI am a lawyer and have also seen this happening way too often. People are so petty when they are hurt over a broken heart it just makes me want to shake them and get some sense into their minds.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 18,
                      "content": "It's awful to watch. There's a woman I work with who has been waging war on her ex for 10+ years, with their daughter in the middle. Just when things die down a bit, one of them will start poking the bear over someone dropping their kid off 10 minutes late or some such nonsense. I always imagine the opposing attorneys meeting on the weekend to toast these two idiots, because they're the only ones winning in this situation.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "And! She punished the daughter for going to the party. Wtf!",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 861,
          "content": "OP \"has her reasons\". Yeah, I don't really care what those reasons are. All I care about is the way she's treating her daughter like a doll with no shred of autonomy. This is maddening!",
          "id": 96,
          "comments": [
            {
              "score": 350,
              "content": "OP purposely didn't share her \"reasons\" because she knows they're petty. I am also divorced, with teenagers, and share custody. We have a set schedule but it changes all the time. My kids are 17 and 14. If they have plans with friends or want to go with their dad on a day that's not their dad's day, they go. If they'd rather stay home on dad's day, they do. OP is going to drive her daughter away. Kids don't like being used, OP. Your daughter isn't dumb. She knows exactly what you're doing.",
              "id": 97,
              "comments": [
                {
                  "score": 39,
                  "content": "I was almost 17 when my parents got divorced. A junior in high school. I had my own car and my own life. I resented the fuck out of the idea that I was supposed to give up my Saturdays because all of a sudden my father, who had been mostly absent from my life despite living in the same home, wanted to play parent. That lasted a few weeks and then by that spring he was yelling at us (my brothers were younger at 15 and 12) for never calling him. \n\nAnd if I had ever been told that I couldn't spend my mother's birthday with her because it was my father's \"day\" well fuck that. My mother's birthday is also my birthday and there's no fucking way I would have got along with that. I imagine OP's daughter felt similarly when told she couldn't spend her father's birthday with him. I hope she goes with her father on OP's next birthday too.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "And if the reason was good, say it! “Sorry, but remember you have a dentist appointment and it’s hard to reschedule. How about we see if they are still there after.”",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Dad has a new girlfriend, I guarantee it.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "THIS! Unless her “reasons” are legitimate endangerment of her child (which, it’s not or she would have said so in the post)… girl is 15 and old enough to make her own decision about whether or not she wants to spend time with her dad on his birthday. Like wtf???",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 759,
          "content": "Notice how OP always refers to her as \"my daughter\" and never \"our daughter\". OP has serious issues which go far beyond a birthday party.",
          "id": 102,
          "comments": [
            {
              "score": 205,
              "content": "This stuck out to me as well. Not to mention the “because I have my reasons” and then no reasons are provided…",
              "id": 103,
              "comments": [
                {
                  "score": 45,
                  "content": "Reasons:  I hate my ex",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Yeah staying quiet about her reasons is like pleading the Fifth - legal ass-covering but private citizens are going to be suspicious",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Had to scroll too far to find this comment. The number of times she said “my daughter” tells one everything they need to know about her “reasons” for not letting the kid spend time with him on his birthday. She probably yelled “my daughter” at dad and dad’s family when she showed up at that restaurant. Oh, yes OP, YTA. Good job alienating your daughter to spite your ex. She will never forget how you made her feel that day. If this power trip is how you’re trying to “win” the split, this ain’t it.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 741,
          "content": "Woahh, hey mate, hey.  She said exactly why:\n\n> ...Because i have my reasons.\n\nOkay, so maybe not exactly, but there are *reasons*",
          "id": 107,
          "comments": [
            {
              "score": 353,
              "content": "If they were good reasons then she would have listed them - the reason is very obviously that she hates her ex and wanted to spite him.",
              "id": 108,
              "comments": [
                {
                  "score": 151,
                  "content": "I can’t see why OP won’t list “the reasons” here on this sub. Especially when it’s essentially an anonymous post, and could lead to a “NTA” outcome. \n\nAnd as others have pointed out, the use of “MY Daughter” and not “OUR daughter” is kinda saying a lot.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yep, it’s that mentality that makes coparenting near impossible. Ppl fail to remember THAT KID HAS TWO PARENTS.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Would not be massively suprised if she is jealous at the ex-husband. \"Like how dare he move on with his life and give a party.. and while I have her too. Gonna ruin it\" mentality.",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "To be fair - they're probably stupid ass reasons if she's not willing to disclose. \n\nMy mom used to say the same thing when she alienated me from my dad.",
              "id": 112,
              "comments": [
                {
                  "score": 5,
                  "content": "I phrased it as i did for a *reason* 😛",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Reason 1. I want to hurt my husband\nReason 2. My daughter is MY CHILD and therefore my property. She is not a real person with opinions, desires or feelings\nReason 3. I want to use my daughter as a weapon\nReason 4. I am the main character\n\nOP better head back to that restaurant and pick her dummy up from the floor",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 514,
          "content": "Exactly. This is a great way to ensure that at 18 she never chooses to come see you.",
          "id": 115,
          "comments": [
            {
              "score": 450,
              "content": "Honestly at 15, I'm pretty sure daughter is old enough for her wishes to be strongly taken into consideration by a judge, should she and her dad want to change the custody agreement. I don't think they could or would force her to go to her mom's at all if she really doesn't want to at this point. Good job, OP. YTA.",
              "id": 116,
              "comments": [
                {
                  "score": 27,
                  "content": "It depends on the state and it's a bit more complicated in those states. There is a trend for states to move away from letting children voice a preference. And many require a lot of hoops to even get the child on the stand to testify at all. The reason for that is that it's going to create animosity no matter what the child says, they are going to be forced into a position of needing to disappoint one, if not both parents. It's also extremely rare for a parent to have all contact severed, so that child is then still having visits with the parent they maybe had to say bad things about.\n\nBut all that being said, Judges, though they don't officially condone it, understand that as the child ages they are going to \"vote with their feet.\" With a 3 year old that is refusing to go, you can just put them in their car seat and drive them over. With a teenager, you cannot. So motions to enforce the parent child contact schedule will then fall on deaf ears as the kids age, unless there is an actual concern for the child's wellbeing, e.g. the child isn't going to school, safety concerns, being left alone, etc.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Yep. In my state it's 14 where kids get to decide what they want to do.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "And the daughter has the entire family on her dad's side as witnesses to how OP acted.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 145,
              "content": "Even before 18. Unlike small children, the courts will take a 15-year-olds stated preferences into account when considering custody arrangements. If after this the daughter says she wants to live with her father and the father agrees, there won’t be much the mother can do.",
              "id": 120,
              "comments": [
                {
                  "score": 7,
                  "content": "That depends on the court and the judge. And him taking the kid against custody and against her agreement wouldn't look good in court.",
                  "id": 121,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "My parents acted this way; weaponizing us kids.  It made every event something to dread. Now imagine how that feels for a child. We all knew it, felt it, resented it and the moment that we could, we left it behind. YTA. You can feel however you want about your ex but your child is experiencing trauma as a result of your behavior. Divorce is hard enough on kids and is widely recognized as part of the ACE studies (adverse childhood experiences) as potentially causing harm. Why would you compound an already difficult experience for your child, out of spite?",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yup, OP seems to have mixed up \"What I'm legally allowed to do\" with \"What's good for my daughter\" and is going to reap the rewards of her actions when her daughter is no longer a minor.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I've seen too many people like OP who claim they've done nothing wrong.           \nOP is 100% the type of person who will want her daughter to spend time with her new husband or step dad while using HER time even if her daughter disagreed and wouldn't flinch if someone called her out on her BS because it's \"her day\" .        \n      \nYeah YTA OP. You don't care FOR your daughter, you only care about how to USE your daughter.",
              "id": 124,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 430,
          "content": "I hope OP understands the ramifications of her horrible actions. Mother's day doesn't fall during your time? TOO BAD! Birthday/funeral/2nd wedding/vacation opportunity? SORRY!\n\nTwo can play at that completely messed up game. OP has done herself no favors by taking such a hardlined stance.",
          "id": 125,
          "comments": [
            {
              "score": 329,
              "content": "I can see the post now.\n\n\"A few months ago I refused to let my husband have my daughter on his birthday. I found out she went to him behind my back so I tracked her, interrupted the party and forced my daughter to come home then grounded her for the stunt she pulled . Well, I won a trip and wanted to surprise my daughter with it, but the dates fall on her days my ex has her. I tried to ask him politely to change days so she could come with me but he said no (how rude is that!?). WIBTA if I just took her on the vacation without his consent?\"\n\nSeriously, I can't believe OP has to ask. 1000% YTA OP",
              "id": 126,
              "comments": [
                {
                  "score": 12,
                  "content": "Yep. Or when her bday falls on a day she doesn't have her daughter. I understand the need for court rules and whatnot but it's too bad there can't be a little bit of wiggle room, especially when the kid WANTED to be with her dad on his bday.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 8,
                      "content": "There is wiggle room! Both parties just have to be reasonable human beings. My ex and I trade dates/weeks all the time.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 31328,
      "content": "\"I have my reasons\" \n\nINFO: those better be some damn good reasons because until you elaborate, YTA in my book. \n\nYou hate your ex more than you love your daughter, and you proved it with your actions in this scenario.",
      "id": 129,
      "comments": [
        {
          "score": 8101,
          "content": "The last part is so accurate. She hates her ex more than she loves her daughter.",
          "id": 130,
          "comments": [
            {
              "score": 5276,
              "content": "When my ex cheated on me I divorced but was still civil and attended kid activities together.  When ppl asked why,  I said I love my kids more than I hate my ex. I've never heard anyone else use that phrase until today.  Yay! I hope it becomes a mantra",
              "id": 131,
              "comments": [
                {
                  "score": 677,
                  "content": "Cheating can certainly negatively impact children, but it appear here that:\n\nA.) dad’s awful choices stayed between the parents and did not harm the daughter’s opinion her dad.\n\nB.) mom cheated and it has negatively impacted her relationship with her daughter.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 340,
                      "content": "Not necessarily. You can think that one of your parents has been shitty but still want/have a good relationship with them. Either way, OP is TA in this scenario",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "C) mom's clear tendency to be controlling drove a wedge that broke her marriage\n\nD) the divorce is completely unrelated to adultery or anything in this post",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 139,
                  "content": "Friend of mine moved to another country to be with her then husband. They had two kids then she caught him cheating. They ended up divorced but she's still here in his home country because, in her words, \"he's an ass but he's the father of my children and they deserve to be able to have a good relationship with him\". I respect her so much for this.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 16,
                      "content": "In most other country's, she can't legally take her kids out of that country. So she's Kinda stuck there. Source - have a friend stuck in another country. They are free to leave, but without kids",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My mom has been saying it to me, to my friends, to her friends, since I was a little girl. My bio father is a piece of work, but my mom ALWAYS said, “Love your kid more than you hate your ex”. \n\nWhen my friends started having kids, she’d say it to them. When her friends would get divorced, she’d float it out. \n\nIt’s a fantastic mantra.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My parents had an *infamously* contentious divorce.  I mean that literally, as parts of their two-decades-long custody dispute have been excerpted (names redacted and anonymized) in at least two law school textbooks that I've heard of.\n\nI verbally unloaded on them in the lead-up to my 18th birthday -- you know, in the 6 weeks prior where they ask \"so what were you thinking for your birthday, 18 is a big deal,\" etc.  I told them that I explicitly resented the idea of them *seperately* each asking about their own individual plans, and essentially making me decide how to bifurcate myself across two separate calendar-days where I'd do my mom-thing on one date and my dad-thing on another date, whether I'd split it across consecutive weekends, etc.\n\nI distinctly recall telling them that they had until my 18th birthday to figure out if they wanted me to be the only mature adult involved.  I said that I didn't want \"a ten dollar bill from my mom and a different ten dollar bill from my dad,\" because if they wanted me to ever respect them again, then all I wanted for my 18th birthday was for them \"to become adults with me by cooperating to gift me a single twenty dollar bill.\"\n\nThey stepped up, I am proud to recall.  They enlisted my employer (I delivered pizzas for a local pizza-and-grinder place) and arranged a surprise party for me.  .... That party was ruined by weather and one of my friends enduring a minor vehicle crash, but that truly wasn't the fault of either of my parents.\n\nIn fact, I wanna call them now (*::sigh::* ... one at a time....) to remind them of how proud they made me that day.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It's a great mantra and it's surprising how many don't put their kids above hatred",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1733,
          "content": "If they were good reasons, she would’ve listed them.",
          "id": 140,
          "comments": [
            {
              "score": 642,
              "content": "It’s a commonality I see with these people, they come and post and ask for judgement and then cowardly back out when explanations are requested. Oh and OP YTA.",
              "id": 141,
              "comments": [
                {
                  "score": 404,
                  "content": "I wish I could find it again, but I stumbled across an article here a while back that analyzed parents of kids who had cut them off. The gist of it was that the parents were in such denial about any of their wrong doing that they were literally incapable of hearing/remembering why their kids cut them off.\n\nLike the kids could send an email/letter detailing what all they did wrong, the parent would read it and either immediately downplay it saying it wasn't that bad/that never happened, or simply would refuse to acknowledge a single point. They would go online and complain to other cut off parents about how unfair their kids are being to them.\n\nCan't remember it all, but I think it boiled down to narcissism. Some people are literally incapable of thinking they did something wrong. Every action they make, they make for perfectly valid reasons and anyone who disagrees just doesn't have the full context.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 300,
                      "content": "You're thinking of [The Missing Missing Reasons](https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html).",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "The narcissist’a prayer: \n\nThat didn't happen. \nAnd if it did, it wasn't that bad. \nAnd if it was, that's not a big deal. \nAnd if it is, that's not my fault. \nAnd if it was, I didn't mean it. \nAnd if I did, you deserved it.\n\nEdit: formatting",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 622,
          "content": "You mean children are just pawns to be used to hurt your ex? \n\nShe's one of the biggest yta I've seen",
          "id": 145,
          "comments": [
            {
              "score": 10,
              "content": "Yep. Parents seem to forget their kids don’t give a shit about agreed custody days, especially when they’re a teen. They just wanna live their life without their parents’ drama.\n\nThankfully my divorced parents let me decide my own days with each once I was old enough (like 11/12) - generally they had set days because yes you have to be realistic around work etc but it was also around MY schedule, like if there was something I wanted to do that fit better with the other parent they would work around it wherever reasonable and deal. Because teens also have a life outside their parents custody agreement and again, I can’t emphasise enough how little they give a shit about their parents’ agreed schedule once they hit a certain age.\n\nPlus the best way to make sure you have a shit relationship with your child as a divorced parent is denying them these kind of important relationship events with your ex spouse. She will remember this for a longgg time as an example of how petty and cruel her mother is.\n\nOP is definitely the asshole.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 551,
          "content": "YTA because of two reasons:\n\n1. OP knows full well that shared parenting plan is based on overnights. So what if Dad took the kiddo, who wanted to go to the dinner. Dad could still get her to OP to exercise the overnight while having the daughter there to celebrate, too. Both sides win. OP should have honored both. Not a hill I’d die on.\n2. OP is flying too close to the sun. The daughter is 15, and in many states a kid can decide which parent they want to be with by the age of 14. If OP continues to embarrassed and track down her daughter, OP might find herself with fewer overnights with her daughter. OP needs to tread lightly.",
          "id": 147,
          "comments": [
            {
              "score": 138,
              "content": "I had a coworker who divorced when their child was like 2 or 3. They did one week on one week off but did the cutest thing where the parent who didn't have the kid that week got a \"date night\" with the kid so it broke up the week and gave the other parent a night off. Their date night was flexible, usually mid week at some point.",
              "id": 148,
              "comments": [
                {
                  "score": 38,
                  "content": "That’s actually so sweet and that’s some damn good co-parenting. No petty bullshit and actively working together the ensure the happiness of the child. That should be the expectation for all parents, but people get too into their own emotions to care. Good on them.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 211,
          "content": "Dang that last sentence made me tear up. \n\nYTA OP. Do better for your daughter and hope it isn't to late.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Notice how she keeps saying “my daughter” not our daughter. Act like a mature adult and leave your kids out of your messy life.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "According to OP after that scene they went back home, so probably she didn't even have better plans to do",
          "id": 152,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "\"we can't just fire someone without cause\"\n\n\"i have cause it's beCAUSE i hate him\"\n\nbig michael scott energy from that",
          "id": 153,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I think this is the best post here. There may be some missing info, otherwise YTA. We all get that sometimes it's not his day, and you don't want to give your ex anything more than what he is entitled to. If the situation were reversed, where would you stand? You just screwed yourself if you ever want some flexibility from your ex in the future.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Yeah, dear, YTA.  I swear I'm seeing more of these custody battle posts on here, and it's always one ex trying to spite the other by withholding thw child. Ecause it's \"their day.\"  The reason you have a custody arrangement is because y'all can't be civil and agree on custody of your child, so a judge had to order certain custody arrangements that are enforceable.  However, you can still be civil and flexible with your days in the best interest of your child which should include being able to see her parents on their birthdays.  A judge really isn't going to look positively on you for this incident if your ex decides to file for change of custody.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16191,
      "content": "YTA.\n\nYour daughter wants to spend her Dad's birthday with her Dad. How is her attending the party affecting you. As far as I know custody agreements are negotiable for a day or two.\n\n>because I have my reasons.\n\nWhat is/are your reasons?",
      "id": 156,
      "comments": [
        {
          "score": 7316,
          "content": "\"It's not his day\".",
          "id": 157,
          "comments": [
            {
              "score": 4817,
              "content": "With behavior like this soon they will all be his days.",
              "id": 158,
              "comments": [
                {
                  "score": 1930,
                  "content": "Coming to say this, Im 90% sure she is of age where she van decide whih parent she has more time with or has influence if they they try to renegotiate custody.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 1016,
                      "content": "Not only would she have influence, the courts wouldn't really do much if she disagrees with what her parents agree on. At that age, it a kid refuses to switch homes on schedule, they pretty much just let it happen because  physically restraining and moving a teenager would be ridiculous.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 383,
                      "content": "She is. I was 16 when my parents split and we never actually followed the custody agreement. I spent time with my dad whenever I could, and my mom wasn’t an AH like OP and just told me to be home in time to do homework.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "My parents got divorced when I was younger, iirc 13 years of age you're considered \"of sound mind\" to deicide which parent you'd like to stay with. This attitude could really shift her daughter to thinking \"i'd rather be with Dad\". The Ex's family is kind of spot on calling her unstable over a single extra day. I'm sure if the situation were swapped and it was her birthday she'd be nothing but unbridled rage if he said no cause \"it was his day and he had his reasons.\"",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "At least influence, I'd hope. I know things vary by jurisdiction but a fifteen year old is nearly an adult and I feel like courts would at least consider their preferences.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Exactly.  In the US at least I believe by 15 you can choose which parent to live with in most if not all states.  Certainly by 16 this is true.  I predict the following:\n\nEx-husband: Asks to amend the custody agreement\n\nDaughter: Asks to live with dad full time\n\nOP:\n\n⢀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⣠⣤⣶⣶\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⢰⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣀⣀⣾⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⡏⠉⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿\n⣿⣿⣿⣿⣿⣿⠀⠀⠀⠈⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠉⠁⠀⣿\n⣿⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠙⠿⠿⠿⠻⠿⠿⠟⠿⠛⠉⠀⠀⠀⠀⠀⣸⣿\n⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣴⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⢰⣹⡆⠀⠀⠀⠀⠀⠀⣭⣷⠀⠀⠀⠸⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠈⠉⠀⠀⠤⠄⠀⠀⠀⠉⠁⠀⠀⠀⠀⢿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⢾⣿⣷⠀⠀⠀⠀⡠⠤⢄⠀⠀⠀⠠⣿⣿⣷⠀⢸⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⡀⠉⠀⠀⠀⠀⠀⢄⠀⢀⠀⠀⠀⠀⠉⠉⠁⠀⠀⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 523,
              "content": "And \" I have my reasons\"...definitely she is tA.",
              "id": 165,
              "comments": [
                {
                  "score": 493,
                  "content": "Wanna bet the reasons are \"I want to hurt my ex?\"",
                  "id": 166,
                  "comments": [
                    {
                      "score": 222,
                      "content": "\"And exert control.\"",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "nah dude my money's on \"I want my kid to move out and never speak to me again\"",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "\"I am a huge asshole\"",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "“Because I said so.”",
                      "id": 170,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "As a child of divorce who was used to hurt the other parent, I unfortunately agree. That’s what’s happening here.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "This infuriates me. It’s all just pettiness at this point. Unless said “reasons” are stated and are valid.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "« I’m jealous of my ex husband, I’m a controlling mother and I want to be petty just to spoil his birthday by keeping his daughter from him »",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I hope every holiday for the rest of the year including OP’s birthday falls on “not her day”",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It doesn’t even look like it would have been the whole day since he picked her up from school. It would have been one evening… maybe a night if it’s to far to drive to drop her off after the party. OP literally would not let her daughter go to her father’s birthday party…. At a Public restaurant…. YTA… even if your ex cheated on you… even if he was abusive… you’re losing your daughter.",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "She even specified that his birthday wasn't on one of his days, *in fact*, it was one of *her* days. Like it might've been on one of the days when the daughter is unattached and on her own. It's just a big power trip.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I had the opposite problem. For 10 years running we went on holiday for 2 weeks over the August bank holiday, whole family shin dig always 12+ of us and it was always my partners birthday while we were there. When we separated, he moved to a different city and wanted them one weekend a month. The holiday week wasn’t his weekend but he was mad because he wanted them for his birthday and he wants to take them on holiday. so I just let them go visit with their dad instead, I don’t want to be an asshole about it. He left them with his mum that weekend and went out partying, told them there is no holiday because he’s just got veneers and they’re expensive!! so he took their holiday away for nothing, just to spite me and my family, probably because we always had the best time and he wasn’t a part of it anymore. \n\nThe separation was his idea and I didn’t fight it, I think he thought I would and maybe was hurt that I didn’t, and that we’re all doing good and still having fun without him. \n\nThe same as this batshit lady shit talking around her daughter it’s called parental alienation and it’s really damaging for kids, also they see right through it. She’s trying to punish her ex but all she’s really doing is punishing and pushing her daughter away!",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Did I tell him to be born on a day thats not his day ? Not my fault I spoiled it all for my daughter !",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1387,
          "content": "I'll go with A: I hate him and want to stick it to him where I can.\n\nOr B: his younger/prettier new gf is going to be there too and I will not let them play happy family. If I'm miserable  they must be too.",
          "id": 179,
          "comments": [
            {
              "score": 404,
              "content": "It's bad enough, you don't have to make up a fake competition between her and another woman.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 883,
          "content": "“I don’t care about my daughter, I only care about making my ex miserable.” YTA.",
          "id": 181,
          "comments": [
            {
              "score": 134,
              "content": "Yup. \n\nQuit weaponizing your kid.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yep, OP sounds like my ex, who always wanted concessions when he had scheduling conflicts, but never wanted to reciprocate if I asked to switch when I had something that my son wanted to attend.\n\nHis “reasons” were that he was a narcissistic asshole, possibly the same reasons OP has for this.\n\nYTA, and if you keep this up, your daughter will cut you out of her life as soon as she’s able, just like my son did with his father.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 499,
          "content": "Can you imagine how embarrassed her daughter must have felt in the middle of that restaurant during all that commotion. YTA.",
          "id": 184,
          "comments": [
            {
              "score": 388,
              "content": "Then to add insult to injury, the daughter who is already torn and in the middle of this conflict with her parents, gets friggin grounded for celebrating her dad’s birthday with her family. Unbelievable. YTA OP",
              "id": 185,
              "comments": [
                {
                  "score": 71,
                  "content": "I feel so bad for this kid. I hope she can contact her dad and gtfo from OPs crazy control.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Seriously, this kind of pettiness and emotional torture is exactly what made me run away and live with my grandparents at that girls age. OP, YTA x 1000000",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 402,
          "content": "They \\*should\\* be negotiable for a day or two. What if the daughter has a \"Dad day\" on OP's birthday? What then? \n\nYou talk this out like adults of course, which is exactly what her ex tried from the start.",
          "id": 188,
          "comments": [
            {
              "score": 259,
              "content": "I hope she looked ahead at the calendar to see what day her birthday falls on this year before she went scorched earth over sticking to the plan.\n\nI coparent, and even when my daughter’s dad and I didn’t get along we were never so petty as to make our daughter miss important family events on either side.",
              "id": 189,
              "comments": [
                {
                  "score": 39,
                  "content": "How dare you be reasonable adults",
                  "id": 190,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "A smart co-parent would use this grace with the calendar as a “you owe me” day later.\n\n“Great, you need her on your birthday? I know she’ll have fun at the party. I’d be happy to say yes if I could trade it for an extra Thanksgiving break day to make it up? I wanted to do something special with my family.”\n\nOP is still reeling from her separation and divorce so this is a power move. She doesn’t realize that there will be many random days that healthy co-parents need to trade to make raising their daughter work.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Thing is with custody agreements, 99% of the time no one outside of the people involved are keeping track of shit unless one of the parties involved want to make a big deal of it. Like, no one is calling and checking up. My ex and I used to switch days often cos, ya know what, shit comes up. And if you're really interested in the child's welfare you'll be a little flexible. (Note I said 99% of the time. There are exceptions with supervised visits and the such. But those are outliers, not the norm.)",
              "id": 192,
              "comments": [
                {
                  "score": 8,
                  "content": "Of course. You make a schedule, agree upon it, and then you agree that sometimes life happens. But the schedule should be there to \\*help\\* keep the children safe and everybody happy, not to HINDER that.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "“reasons”",
          "id": 194,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Her reason that she probably won’t admit to is she wants to be the only parent the child loves, and in her mind the best way to do that is so control her time. It’s a birthday- she wanted to go, he wanted her there- why else wouldn’t she allow it?",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Her reason? She wants to be unreasonable. \n\nBut hey… she won. She should be so proud of herself for putting her needs to be petty and unreasonable first!  Mom (and ex wife) of the year nominee!",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "-because I have my reasons. \n\nYou’re bitter and keeping your teenage daughter from her own dads birthday. You’re the definition of an asshole.\n\nYTA",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "YTA, the biggest asshole! I had a bad breakup with my ex, we share custody of our daughter and we have a very specific custody agreement. We still always try our hardest to accommodate each other's schedule and do what's best for our daughter. We switch stuff around as needed to ensure we do what's best for her despite our own relationship being so strained. As a matter of fact I had my daughter scheduled to be with me this year on my birthday but her father was having his sister and her kid come in from out of town unexpectedly that day after two years of not seeing them. My daughter loves her aunt and cousin so I let her go to her dad's that day to spend time with her family. Because it is what was best for my daughter and what she wanted. OP sounds incredibly petty, cruel and selfish. You always put your kids first, it's your responsibility as a parent to put your kids before your own stupid issues and problems. You hurt your daughter to hurt your ex husband and that is beyond selfish and disgusting. The \"reasons\" she had were to hurt her ex, that's it. You are the biggest asshole OP. I feel so bad for your kid Jesus Christ, you should be ashamed of yourself. Also your kid shouldn't be grounded for listening to her dad. This whole situation put her in a horrible position. I doubt she felt like she could say no to her dad as she felt she had to listen to him cause he's her freaking father. I am sure she had no real control over telling her father no in that situation so OP you're also the asshole for punishing your kid for listening to her father. You suck, take parenting classes, get counseling and stop being such a petty, selfish asshole before you do some real damage to your kid. Ugh you suck so much.",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11142,
      "content": "YTA. \"my daughter said she really wants to go\" \"she said on the phone she was with him\". your child is 15, not 5. she can make informed decisions about whether or not she wants to go to he father's birthday party. she also was honest and told you where she was, so you knew she was safe. but that meant nothing to you, apparently. there was no reason for you to behave the way you did.",
      "id": 199,
      "comments": [
        {
          "score": 3135,
          "content": "Exactly. She was honest this time but she won’t be the next. All you did is teach her that being honest gets her in trouble.",
          "id": 200,
          "comments": [
            {
              "score": 813,
              "content": "lol this. I was raised by grandparents that even asking for permission terrifies me. So I always lie and sneak out during my teenage years cus there's no way they'd let me do things I want. It should always go through them even the air breathe. Lol. I'd get beaten up one way or another. Hahaha.",
              "id": 201,
              "comments": [
                {
                  "score": 316,
                  "content": "Be overly strict raise sneaky kids!",
                  "id": 202,
                  "comments": [
                    {
                      "score": 222,
                      "content": "Strict parents raise the best liars",
                      "id": 203,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "True. My mother was raised super strict and religious and she ended up being a crazy party animal that got disowned. She raised my siblings and I non religious and set reasonable boundaries and we all turned out way more chill and normal than any of her parent's kids.",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I was that kid! Snuck out in the middle of the night, lied about where I was going to be and who I was going to be with. Became a pretty good liar which screwed me up because then it got to the point I’d lie even when I didn’t have to.",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "100%. I was raised to be honest but once I was a teen I quickly realized that wasn’t going to work. I had the same type of mother as OP who would isolate her children. ..On the plus side, I am now a highly skilled manipulator.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "THIS.\n\nAfter getting yelled at for telling the truth, I vowed never to tell my mom the truth again. We still don’t have a relationship to this day and I’m in my 40’s.\n\nOP this was petty af, and you damn well know it. \n\n**YTA**",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Plus, I bet she'll just \"track\" her again to see if she's lying or not. \n\nYTA OP",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly! All her daughter has to do is turn off her data and wifi on her phone and her momster won’t be able to find her.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 832,
          "content": "This mother is going to find out painfully quick that her daughter is at an age that she can CHOOSE which parent she will interact/live with and a Judge will side with her.",
          "id": 210,
          "comments": [
            {
              "score": 305,
              "content": "And she is constantly saying \"my daughter\" not \"our daughter\". Like she is letting him borrow a leaf blower or something.",
              "id": 211,
              "comments": [
                {
                  "score": 37,
                  "content": "Yeah. \"I told him no because it is not his day to have her.\" Sounds like a child sharing custody over a toy. Jesus fucking christ OP, your child is not your property.",
                  "id": 212,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "So much this. When my father remarried he started pulling stuff like this just to hurt my mother, not caring that I wanted to go to certain events, too, and mom was willing to give him extra days to make up for the inconvenience. \n\nGuess which parent I remained living with all the way through college, and when I moved away which parent I always visited and called? Mom. Dad I stayed low contact with until finally cutting him out of my life entirely. \n\nBeing petty and using your own children as a pawn hurts your ex but hurts your kids more and ultimately they'll understand whose fault it was.\n\nYTA OP. Apologize and act better in future or risk alienating your daughter.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 336,
          "content": ">\"my daughter said she really wants to go\" \"she said on the phone she was with him\". your child is 15, not 5. she can make informed decisions about whether or not she wants to go to he father's birthday party.\n\nAnd this can be applied to anything. The daughter is 15 already, she shouldn't be forced to spend some days with a parent and some days with the other, she should be with whoever she wants to.\n\nIn fact, I feel like OP sticks to this day thing so bad cause she knows her daughter would abandon her for her father asap if given the chance.",
          "id": 214,
          "comments": [
            {
              "score": 40,
              "content": "Yup. And she’s only further pushing her daughter towards her father with stunts like this. But that seems like a good thing according to the post. The Ex-husband is right, if this post is any indication of OP’s normal behavior, then she is, in fact, bitter, spiteful, and unstable.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yeah she wasn’t able to build a bond/dependency in time so she’s actively trying to break any possibility for her daugther to grow a bond with her father. I have suspicions that was her goal.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Add to that she grounded daughter after embarrassingly removing her from a party she wanted to be at, it will be no surprise when daughter decides she wishes to live with dad full time, and judge grants her that. What a poor foresight from OP!",
              "id": 217,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Yup, something I mentioned in my comment as well. She keeps saying “my daughter” this and “my daughter” that, clearly showing that she wants the kid to have nothing to do with the ex. Not long before the kid resents her for it",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "In Finland the age is 12 and this story right here makes me very thankful for that law.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Especially because in custody disputes, when there is a teenager involved, they usually ask the teenager who they want to live with. She could lose her child because of pettiness",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7485,
      "content": "You hurt your daughter to be petty to your ex. YTA. \n\nA custody agreement is flexible as long as supervised visitation isn't required. You could have easily made up the day.",
      "id": 221,
      "comments": [
        {
          "score": 2267,
          "content": "Also what will happen if a special event of hers falls on a day that isn't hers? I'm sure she'll want her daughter there. Being lenient and agreeable with someone you need to co-parent with is in everyone's best interests. \nThis is the easiest way to alienate your child. She's old enough to know exactly what games OP is playing.",
          "id": 222,
          "comments": [
            {
              "score": 821,
              "content": "She's gonna lose her mind if her ex refuses to let the daughter be with her on mom's important  day.  I also guess that she can't see her daughter when the kids birthday is on a dad day.",
              "id": 223,
              "comments": [
                {
                  "score": 119,
                  "content": "So toxic! Using the kid as a pawn in her bitterness will backfire for sure. This is how some kids grow not to want anything to do with one or either of the parents. Hope they work this out.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "Tbh if I was the daughter, aka if the daughter is even slightly as petty as me, I would tell her \"it isn‘t your day\" and not show up, even if the ex-husband has a too-good-for-this-world-heart and lets the daughter attend.",
                  "id": 225,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Hopefully dad is far less petty. The only thing that could make the situation worse is retaliation, which sucks horribly in how unfair that is but that is what it means to put children first.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 212,
              "content": "That was my thought. What happens when the next semi big event (first date, birthday, school dance, etc) falls on the dad's day? Is she going to stay home and just bite the bullet, or is she gonna try to be there despite it being \"his day\"?",
              "id": 227,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Yes! This was the most shortsighted move, OP. In a few years when your daughter is not under a custody agreement and doesn’t need to be with you, you’ll wonder why she avoids you and doesn’t want to spend any time with you. Then you’ll think back to when your relationship with her really tanked, and you’ll come back to this day, where you were petty, selfish, and unreasonable. I don’t know what it will take to make this right, but humble yourself and find a way. If you care about your daughter and want a relationship with her, apologize and do what it takes to make it right.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Good point. How would she react if her ex refused to share on one of the mother's special occasions? Double standards?",
              "id": 229,
              "comments": [
                {
                  "score": 18,
                  "content": "But he won't cause  you know, he is not an asshole, unlike her.",
                  "id": 230,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Well to be fair, we don't know that, but I hope for the sake of the kid that at least one of them is reasonable and prioritizes what's best for the kid.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "And the father would likely let the daughter spend that day with her mom, because he’s probably not “bitter, spiteful, and unstable”, although he may find it in his heart to be spiteful after this childish stunt.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4947,
      "content": "YTA she is 15 she can decide were she wants to be ...and as soon as she is 16 that will be at dad's full time! Congratulations on pushing your teenager away",
      "id": 233,
      "comments": [
        {
          "score": 1011,
          "content": "Ding ding ding. As soon as she can drive say goodbye. She'll try and get as far away from you as possible",
          "id": 234,
          "comments": [
            {
              "score": 44,
              "content": "Doing all she can to cash in on negative social equity with her daughter... That girl will want nothing to do with OP when she turns 18.  Just because she hates him.",
              "id": 235,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 373,
          "content": "Maybe even sooner. I chose to live with my dad at 12. My oldest stepson chose to live with us at 10. All depends on the judge and the maturity of the child. But she’s definitely not going to stay with OP for long when she’s acting like this!",
          "id": 236,
          "comments": [
            {
              "score": 28,
              "content": "This was the comment I was looking for as a child of divorced parents. Once a child is old enough and mature enough to say “I want to live in this specific house”, usually the courts allow it so long as that guardian is deemed stable. The courts are supposed to act in the best interest of the child and not just cut the kid in half for each parent.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "OP is a bully and a coward for using her kids like that",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Depending on the state, it could be sooner.  \n\nI was a single dad when my son was 11 to 12, lost custody because I was in a bad relationship (which was ending as the custody battle started, but the court DGAF), and then my son decided *again* at age 14 to live with me -- this time his preference had legal weight.  His mom's actions for the last two decades have probably alienated him from her permanently.\n\nThis was in Georgia, FWIW.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3392,
      "content": "Yeah YTA \n\nShe’s 15 and wanted to spend her dad’s birthday with him. You made a scene and exerted unnecessary control to make a point.\n\nWhat you’re actually doing is being irrational and alienating your child. Keep it up and you risk permanently damaging your relationship with her.",
      "id": 240,
      "comments": [
        {
          "score": 739,
          "content": "Next month she is going to wonder why child wants to spend 100% at dads",
          "id": 241,
          "comments": [
            {
              "score": 273,
              "content": "And at 18 why she goes full no contact",
              "id": 242,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "Always think about the interest of the child first.\n\nWhen me and my ex separated I asked to take our birthday and any other days that are important to the kids and their parents in the contract (mothers and fathers day - so if they craft something in school for us they will be able to give it to us). According our contract the children can be with me on my birthday and with my ex on his birthday. When it's their birthday day are with me, but I always ask them if they prefer to go to their dad instead. When there is a birthday of a family member they can olso go on the day itself and /or on the day of the birthdayparty.\n\nWe used to have a lot of discussions, but never had a discussion about that. I only sometimes have to remind my ex to invite his children at his own birthdayparty (which is up to him, but I tell him anyway - behind the children's back - that if it were to me, I invite the most important people in my life on my own birthday. So I think it's a bit awkward that he does forget his kids) . I only remind him of that because I don't want him to hurt my kids feelings. If he still chooses to not invite the kids I leave it with that, if he chooses to invite them I facilitate things for him (like drive them there and get them to bed on time).",
          "id": 243,
          "comments": [
            {
              "score": 19,
              "content": "OP needs to learn from you. Might save the relationship with her daughter,  but I doubt it.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Don’t forget grounding her daughter for going with her dad.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2558,
      "content": "YTA your ex is right you're bitter and spiteful. Your only reason why he couldn't have her is because \"it isn't his day\" he didn't even want her for the day it would be a few hours at most but you're so hellbent on hurting him via your daughter that you cannot see how much of a huge gaping AH that you are. You could've waited until he dropped her off after and talked to him and explained your reasons, but you went and caused a scene in public. You have major issues.",
      "id": 246,
      "comments": [
        {
          "score": 292,
          "content": "Yeah, that's what I thought, too: she's using her daughter as a proxy for her vendetta against her ex. That's just shameful. YTA.",
          "id": 247,
          "comments": [
            {
              "score": 32,
              "content": "This is the kind of stuff that I watched seriously fuck up my friends. Their parents used them as pawns in their divorce and my friends were just … traumatized, frankly. Felt unstable, unsafe, no consistency, couldn’t trust their parents. \n\nOP is TA for 10,000 reasons. But hurting her daughter is number one.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "You’re assuming she actually had reasons. If she had legit reasons, a real adult would have shared those with the ex and daughter the first time.",
          "id": 249,
          "comments": [
            {
              "score": 16,
              "content": "She couldn't even share the reasons with us, the people who are supposed to know the full story so we can make an informed conclusion!",
              "id": 250,
              "comments": [
                {
                  "score": 12,
                  "content": "Exactly. I’m surprised she even posted this on here. The lack of self awareness is amazing. Sometimes I go to post things and by the time I’m done typing it out, I’m like, “nope, I do not need to even post this. Now that I spelled it out, I’m the asshole.”",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Also for grounding the daughter for going with her dad? It isn't the child's responsibility to adhere to her parents' custody agreement. Not her problem. And she's essentially being punished for wanting to see her dad. OP is being a really bad parent.\n\nYTA",
          "id": 252,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1463,
      "content": "[deleted]",
      "id": 253,
      "comments": [
        {
          "score": 417,
          "content": "Yep.\n\nThis mom hates her ex more than she loves her daughter.",
          "id": 254,
          "comments": [
            {
              "score": 16,
              "content": "This. Unless the reasons are abuse of some sort (sexual, physical, drug/alcohol) she doesn’t want to share with her daughter but knows has occurred and wants to shield her from, this is absurd.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 262,
          "content": "*he’s TA for violating your custody agreement\"*\n\nHe shouldn't have gone behind her back.\n\nBUT: a fifteen year old girl wants to go to someone's birthday party. This is an entirely reasonable request for a teenager. Is her mother really prepared to explain to a judge that that wasn't allowed \"because rules\"? \"Custody\" does not mean \"I have the right to keep her inside my house the entire day.\"",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "This. The asshole scale is definitely tipped more (OK, mostly) towards the mom, but dad shouldn't have picked up the daughter without consent. I suspect a judge would be pissed at both of them.",
          "id": 257,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1387,
      "content": "YTA, as much as you would like it to be the case your daughter is not your property. Your husband cannot steal a 15 year old girl. That’s her father and she wanted to spend his birthday with him. You don’t like him, so you turned up and caused a scene. \n\nYou don’t care about your daughters wellbeing at all. You only care about being spiteful. I really hope your daughter posts on Reddit one day and is given advice to fully move in with her dad. She’s old enough to make that decision. \n\nBefore I sign off - a custody agreement is for the benefit of the child. The courts keep in mind wants best for the child. Usually they want both bio parents involved in the child’s life in some way as it’s *usually* the best ( maybe not in this case because you harm your child). Do not for a second think the custody agreement is about you",
      "id": 258,
      "comments": [
        {
          "score": 145,
          "content": "Can’t believe I had to scroll to find this comment. The custody agreement is for the child’s best interest - so SHE get optimal time with each parent, including holidays and other special occasions. How would you feel if Christmas (or another holiday important to you) fell on your ex’s regular week for several years and he refused to let you see your daughter? Yep, you’d be livid. My agreement with my ex has our birthdays built in, so the kids can come celebrate with us even if they’re at the other’s house. \n\nIdgaf what your “reasons” are for not wanting her to go, unless your ex is a huge abuser, YTA.",
          "id": 259,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah, keep it up and you could lose her",
          "id": 260,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Yes, and dad could make a very reasonable accusation of parental alienation, which judges are typically very harsh towards.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Can you imagine what kind of shit OP talks about her kid’s dad? I bet it’s nonstop.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}