{
  "post content": "That title was intended to make me look like the bad guy here, but let me explain. My(21m) brother(26m) got a new dog. It was rescued by couple who apparently got told by the local authorities that they had rescued too many, and had to give some away. The one he got was a 6mo that seems to have some separation anxiety, and was, and still is, underweight. My brother had to go to another state for some job training, and left Luna (his dog) with me and my parents for a week. While he was here, he told us exactly how to take care of her. Since she is underweight, he has been feeding her slightly more than the recommended amount; 2 cups in the morning and 3 at night(the recommended amount for what she should weigh at 1yo) to be precise. However, he said he was eye-balling her servings, and when we brought out a measuring cup to make sure(since I absolutely SUCK at estimation), we found out that he was underestimating the size of a cup. What he thought was 3 cups turned out to be just 2 cups, so he was giving her something like 1 & 1/3 cups in the morning and 2 cups at night. I decided to just give her 2 cups in the morning and evening, since it was technically more than what she had been getting, but when I texted my brother, he got extremely upset, since the point was for the dog to gain some much needed weight, so she should be getting 5 cups of food a day. I understand that I messed up, but was I actually an a-hole for it, considering the dog was getting more food than she was before?\n\nP.s. I have already agreed to give the dog the 5 cups he asked for.",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "It appears to me that everyone is trying their very best to take care of this dog. The measurements weren't right, but that's a simple mistake. The dog wasn't starved and now you've added more, so she can gain weight. Your brother is just very worried about her I think. \n\nNAH",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH.  Your brother doesn’t know how to eyeball a cup and you were trying to give an amount in line with the portions your brother has been given\n\nLet’s hope your brother is better at estimating inches or he is going to probably have a very disappointed SO in the future :D",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "He took woodshop in highschool. I think he can get inches right.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "lol",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. Your brother should have had a specific scooper or prepackaged daily servings so there was no confusion. If he told you 3 cups but you realize that he's been under feeding her because he estimates then it's 100% on him for not being closer to accurate. \n\nObviously your brother sucks at estimating, seems to run in the family lol.",
      "id": 6,
      "comments": [
        {
          "score": 0,
          "content": "My brother was there when we figured out he was underestimating. In fact, he was the one who said he was underestimating, and still asked us to give Luna 5 cups of food a day. And no, it doesn't run in the family. My dad managed to hang a TV mount perfectly level this morning by eye, after getting the exact right size for two of the required tools on the first guess.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Feed by feel. If they have been exercised give them more. If not, then focus on treat training.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "He wants her to put on muscle weight, so alongside overfeeding her, I've been asked to give her plenty of exercise.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is a medically underweight dog trying to gain weight for medical reasons. You shouldn’t ‘feel’ your way through that, you should make every effort to abide by the nutrition guidelines given by the vet.",
          "id": 10,
          "comments": [
            {
              "score": 0,
              "content": "Doctors guidelines are important, but they merely guide. Listen to your dog and feed more if it will eat more or less if it doesn’t eat everything.",
              "id": 11,
              "comments": [
                {
                  "score": 2,
                  "content": "This is how dogs become fat. Or underweight.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Haha if it feels like they are getting fat feed them less and exercise them more. If it feels like they are underweight and acting hungry, then feed them more. It’s not that hard m8.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I gave my brother's dog 4 cups of food a day instead of the 5 he asked me to give her.\n2) I don't really need to explain the problem with underfeeding someone else's dog, do I?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again)*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Mild yta. He should have gotten a scoop, but that seems like he should have consulted with a vet sort of thing.\nYou should have just gone with what he said though.",
      "id": 15,
      "comments": [
        {
          "score": 3,
          "content": "This is precisely what he told, very loudly, over the phone. I have already agreed to do what he asked.",
          "id": 16,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThat title was intended to make me look like the bad guy here, but let me explain. My(21m) brother(26m) got a new dog. It was rescued by couple who apparently got told by the local authorities that they had rescued too many, and had to give some away. The one he got was a 6mo that seems to have some separation anxiety, and was, and still is, underweight. My brother had to go to another state for some job training, and left Luna (his dog) with me and my parents for a week. While he was here, he told us exactly how to take care of her. Since she is underweight, he has been feeding her slightly more than the recommended amount; 2 cups in the morning and 3 at night(the recommended amount for what she should weigh at 1yo) to be precise. However, he said he was eye-balling her servings, and when we brought out a measuring cup to make sure(since I absolutely SUCK at estimation), we found out that he was underestimating the size of a cup. What he thought was 3 cups turned out to be just 2 cups, so he was giving her something like 1 & 1/3 cups in the morning and 2 cups at night. I decided to just give her 2 cups in the morning and evening, since it was technically more than what she had been getting, but when I texted my brother, he got extremely upset, since the point was for the dog to gain some much needed weight, so she should be getting 5 cups of food a day. I understand that I messed up, but was I actually an a-hole for it, considering the dog was getting more food than she was before?\n\nP.s. I have already agreed to give the dog the 5 cups he asked for.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO: Was your brother rude when correcting you? Seems like a simple misunderstanding that you've already remedied so it's either no assholes here or not the asshole, depending on how he corrected you.\n\nEdit after answer: NTA",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "My dad put it this way(he was in the room when my brother called) \"In his everyday, most polite and mild mannered way. He has a point though.\" And to be clear, that first part was pure sarcasm. He called me an idiot several times, but I don't blame him for being mad. It's his new dog we're talking about, and he wants the best for her.",
          "id": 19,
          "comments": [
            {
              "score": 2,
              "content": "NTA then. He didn't need to be a dick about it and you weren't starving the pup. You can be mad and not be rude about it. Hope pupper gains the weight!",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH\n\n*I'm sorry.  I should have contacted you and let you know about the discrepancy in cup size.  Moving forward, I suggest we actually get a food scale and measure out the servings instead of eyeballing it by cup.  That way we can more accurately increase or decrease the caloric intake as needed*",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "YTA. You had feeding instructions for this dog. Your brother (Although misguided and semi negligent) believed he was abiding by these rules. You had no reason NOT to abide by them, and yet, you under fed the dog still.",
      "id": 22,
      "comments": [],
      "relation": "Attack"
    }
  ]
}