{
  "post content": "For the past few months I (17m) haven’t had a good relationship with my mom or stepdad. I’m angry at them because 2 years ago when my dad passed away he left me inheritance that I’m supposed to get on my 18th bday. I’m also getting survivors benefits that my mom uses for me when I need things so is not like she used this inheritance  for me. \n\nThey bought a house that we moved into. It was weird for me because we always lived in a 3 bedroom apartment. My stepdad is a substitute teacher and my mom’s a part time reception.  They never even had enough to go for a vacation or something but all of a sudden they had for a large house out of nowhere. Mg mom looked guilty about it until she finally admitted they used some of what my dad left me to buy the house. I lost my shit. \n\nThey tried to justify that it was for me too and I asked them does that mean they’re moving out when I’m 18 an the house is gone be in my name? And they’re like no. That’s what I thought. Supposedly the house was for my but max time I would’ve lived there was a few months. \n\nThere’s still some money left if I went to a cheap college but still can’t believe they used my money for something on themselves. That amount could’ve helped me get my own damm house. Also think is funny since my stepdad didn’t like my dad because since I was spending more time with him that meant my mom had to pay a little in child support. \n\nBut he doesn’t care using the money he left for me. Sorry if this a bit of a rant but where I’m asking it I was an asshole was last Saturday his family all came to stay at the house. They stayed Friday night so it was nxt morning when I’m getting ready to go to work. I made myself eggs in a hurry before I left my stepdad asked how come there wasn’t more for his family. And told him it’s because I’m already leaving for work there wasn’t gonna be time to make something for everyone. He acted like it’s not a big deal if I’m a little late since its rare they have people over at the house. \n\nWe got back in forth because I’m not going to stop to make breakfast whne he can do it himself. Then he pulled that don’t talk to me like that in my house. Btw there’s no door in the kitchen and that leads right to the living room so they could hear all this. I said loudly actually it’s *my* house since you paid for it with my money and don’t forget they stole from me. \n\nMy mom is expecting me to apologize for embarrassing him in front of his whole family because after I left they all had shit to say about it. They already went home by the time I got home but you could feel the tension. He straight up ignored me that’s how bad it was. I don’t feel like there’s anything for me to apologize for so that’s where she thinks I’m not being a good son and kind of an a-hole. Wanna know if others feel the same.",
  "id": 1,
  "comments": [
    {
      "score": 52055,
      "content": "NTA \n\nI think you should talk to an Estate lawyer because if your Dad structured his will properly, I would say your mother has misused funds put in trust for you for her own personal benefit.  \n\nDon’t pick a huge fight with your Mom and stepdad over this until you have the facts.  But I really do think you should have a professional review the situation and let you know what your options are.",
      "id": 2,
      "comments": [
        {
          "score": 14397,
          "content": "👆\n\nI hope OP ses this. He might be able to do something about the spent inheritance or get it back.\n\nStealing from your child, what assholes.",
          "id": 3,
          "comments": [
            {
              "score": 7928,
              "content": "Depending on how the dad set things up, this could also be criminal fraud, complete with a prison term.",
              "id": 4,
              "comments": [
                {
                  "score": 3171,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3004,
                      "content": "I would believe that if they were homeless \nOp stated they lived in an apartment before, therfore they were already providing adequate housing",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 536,
                      "content": "That doesn’t mean they could use the money on that basis alone. Depending on the legal structure (trust, inheritance, etc) and what was written down, it could very well be the case that OP’s mum and stepdad did some real shady illegal shit.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 390,
                      "content": "I would argue that they didn't have trouble providing housing when living in a three bedroom apartment. They didn't desperately need this house, they just wanted it because with OP's money they could afford it.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 307,
                      "content": "Eh having gone through this when my dad died they most likely pulled early and took the tax penalty on the funds. But once he turns 18 he can definitely sue them and get damages for the theft.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 232,
                      "content": "my dad died and the survivor benefit was paid directly in to my bank account, until I was 18 or graduated, whichever came later.  my mom was not legally allowed to touch it unless I gave it to her.  it's literally there to ensure ur taken care of in cases like this, where parents try to take the money and not provide for their child",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 137,
                      "content": "Mom has a fiduciary responsibility to her son and that inheritance. If it wasn’t left to her it was for him and she would have to justify what she spent.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 132,
                      "content": "Providing housing for the child would be one thing if they were homeless, buying a house that the child will not live in beyond a couple of years sure is not. If they had put the house soley in the child's name then maybe but what they did was they stole this boy's inheritance for their personal gain",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 89,
                      "content": "He could always sell the house after he turns 18 and after getting the facts (assuming OP is a he).",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "If they had adequate housing previously, then went out of their way to buy this new home then yeah that’s not gonna fly. Either way OP is right. It is basically their house. Stepdad needs to back the hell off.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "There's a difference between an inheritance and support money that comes from Social Security depending on if he is living in the United States. If he is in the United States and a parent dies before the child turns 18 the state is obligated to send a social security check to help support the child until they are 18, almost like child support. Inheritance is a completely different thing",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 163,
                  "content": "When we were doing our wills the solicitor explained that it would be totally reasonable for the estate to be used by whoever looked after the kids including upsizingvthe home.\n\nHowever,  in this case,  it seems OP was not moving into an established family home,  but stop dad has replaced dad, so the living arrangements do not need to be larger.\n\nAlso I would consider the child to own a share of the house in these circumstances,  but to have donated a large prost to the bendy of the guardians.  What the mum and step dad are doing here is shady.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "NTA. Dude that was some CHEF'S KISS RESPONSE. I'm loving the pettiness of making sure step dad's family heard EvErYtHInG..well done my man!!",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "NTA. \n\nOP, your mother and step-father have stolen your future. DON'T let them get away with it. See a lawyer asap, as others have suggested. \n\nAnd steel yourself for their response to action; for I am sure they will whine, cry, and complain in an attempt to coerce you out of any money they can get their hands on. \n\nBest of luck to you, my friend.\n\nEdit: grammar",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": " Ding ding ding!  I'd sue their address tip get the money or the house.  They straight up stole from OP.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "When my brother stole my sister and I inheritance there was nothing criminal that we could do.  We would have to go after him civilly at our own expense and there was no guarantee that we would even get our money because he had already blown through all of it.  OP believe me when I tell you I know how angry and hurt you are because I have been there. Talk to a lawyer see if what they did is civil or criminal and if it’s criminal when you’re 18 get your money. I do t understand how people can do things like that to people they “love”.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "A copy of the will is required to prove fraud. This is pretty simple if his money was in a trust with his mom as trustee but not beneficiary.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 860,
              "content": "His mother is the biggest AH of the two. Imagine betraying your child like that.",
              "id": 22,
              "comments": [
                {
                  "score": 477,
                  "content": "Allowing the guy banging you after your first husband DIED to steal money from your SON?!\n\nYeah, special place in heck for people like this.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 277,
                      "content": "From the post, OP says he lived with his dad and his mom had to pay child support. Looks like they were divorced. Still pieces of shits though",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4357,
          "content": "This, but not an estate lawyer - go to one who deals with breach of fiduciary responsibilities; specifically a litigator. Mom/stepdad most likely breached their duties as custodians of OPs funds.  Bring the suit as soon as you turn 18 as there are time limits “statutes of limitations” involved. Not exactly my area, but I believe that in my state it is 1 yr from when you turn 18.\n\nEdit: my first awards - thanks all!",
          "id": 25,
          "comments": [
            {
              "score": 404,
              "content": "An estate or trust attorney would be able to do just that.",
              "id": 26,
              "comments": [
                {
                  "score": 1089,
                  "content": "Lawyer here. And estate lawyer would not. Estate planning lawyers are basically bank tellers. They are not litigators and run from real litigation work. A civil atty that understands probate law is what you need. It also depends upon the probate code in your state.\n\nIf they used the survivor benefits, which are likely social security then mom can use that. It's paid to her while he is under 18. She gets paid and so does he, but it goes to her. Actual inheritance is something different. If she lied, saying it was for an enumerated purpose, medical, school, etc then he can go after them. Regular living expenses, maybe. It depends.\n\nBut, civil lawyers not a joke estate planning nobody.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 2682,
                      "content": "1. Clearly \\*not\\* your area of law. 30+ yrs as a trial attorney, 20+ in probate/estate planning field. The advice about the statute of limitations starting at age 18 is the only solid piece of advice in the above post. \n2. Mom should have received SS funds for both OP and herself in equal amounts up until he turned 16. She is then expected to get a full time job. She was and remains legally liable to support him, not visa-versa. After age 16, she receives the funds on behalf of the OP. She can use the entirety if needed for \\*his\\* support, not hers, certainly not hubby’s. My youngest was 13 when her father (63) died (we were married and together). After age 16, I banked 25% for her personal allowance use, used the balance for her separate expenses such as music lessons, uncovered personal therapy (I paid half as parent), special travel, music subscriptions etc. I paid all the ordinary expenses. SS funds are not meant for step-anythings. Unless OP graduates high school at 18, funds continue to 19, graduation, whichever comes later. However, at 18, the funds legally belong to the OP. I brought my youngest to the bank shortly after her bd, helped her open a checking and savings account. I charged no rent or other basics bc she didn’t graduate until age 19, in June 2020. I worked with her on setting up her own appointments, getting own insurance, not even taking her as a dependent on my taxes. Adulting 101. I also handed over copies of all trust, life insurance, and SS information for her own file cabinet when she turned 18 and had her both open a personal bank box as well as speak with an experienced estate attorney without my being there.\n3. Parent owes a fiduciary duty to minor OP, irrespective of state.\n4. As a probate/estate planning/conservatorship/guardianship attorney, I was court appointed for a teen whose father and stepmother ripped him off. It involved a wrongful death payment for the mother he watched die in front of him at age nine. I seized their huge double cab 4WD truck, their beachfront home, their tax returns, the car they bought the stepdaughter, and the business assets he obtained through the use of his son’s funds. Not exactly the work of a “bank teller.”\n5. The OP should try to find out if the funds were his through a probate or by way of life insurance proceeds. He needs an advocate in his corner. If there is a trustworthy family member or friend of Dad’s, they may be able to help find an experienced litigator within the overall probate field. Also, there are probably records relating to his inheritance at home. Morally, thieves have no right to privacy from their victim  but OP DO NOT risk your safety to get them. If they are readily available, take private photos or make copies and send to someone outside of home keep them safe, keep no copies at home or on your phone. \n6. To the OP: no, you are NTA. Both your mother and step are TAs. \n7. FINALLY: Don’t confront them on this anymore for your own personal safety. Do \\*not\\* threaten prosecution. See also if there is an adult who could take you immediately in an emergency. A CPS/criminal complaint is not the starting place. And no, I’m not hustling for a job here. I’m retired, no longer a licensed attorney and am \\*not\\* looking for work. I simply spent decades actively protecting vulnerable elders, minors and individuals with disabilities from greedy people, most of whom were family members.\n\nBest of luck, OP.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 455,
                      "content": "Thanks. Maybe next time all that super helpful info but without the insults to entire careers and, by extension, the people performing them for a living. There’s nothing wrong with being either an estate planning attorney OR a bank teller.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 382,
                      "content": "Tell me an estate planning attorney made partner over you without telling me.\n\nAttorneys like you make me so glad I quit being a paralegal. Smug, condescending attorneys can suck it.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 221,
                      "content": ">Estate planning lawyers are basically bank tellers. They are not litigators and run from real litigation work.\n\nHmm, my family's estate lawyer *loves* litigation work and doesn't \"run\" from it.  He's done some civil litigation cases and won.  Now if it is med mal, he'll refer you to someone that does med mal.  Is he a \"joke estate planning nobody\" or do you want to revise your generalization?",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 119,
                      "content": "Survivors benefits like social security would be very unlikely be large enough to actually buy a house. OP said there is still some money left if they want to go to a cheap college so i strongly suspect it was inheritance.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 101,
                      "content": "You know, lots of people think that lawyers are arrogant and self-important, with immense illusions of grandeur. I'm glad people like you are here to clear up those misconceptions.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "There is a world of difference between advising/drafting/uncontested matters and litigating.  Many estate and trust attorneys handle the former, not the latter.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 36,
                      "content": "But I'd rather the estate attorney find/recommend the lawyer who will litigate it.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "Usually not.  They handle the planning.  What OP needs is a probate litigator.  (Granted, most T&E lawyers would know one to refer OP to.)",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 163,
              "content": "And OP's lawyer should file for a full accounting of his funds. This means mom and her husband must itemize every dollar, and it's helpful to have them put it into writing so the lawyer can go from there with the new evidence.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "OP Please do this and please update us",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "Once again, a quick reminder that the way the law applies depends greatly on where in the world our Carmen San Diego actually lives (sorry OP).\n\nAn attorney can provide excellent guidance in this matter using the law of the nation concerened.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "u/reddit_randouser\n\nPlease read the above comment - find yourself a litigator, as this lawyer suggested.  Find a legal aid group that can help people with little money, you can probably at least get a consultation.  Start searching for documents relating to your situation, like bank statements that show transfers, and that kind of thing.  Keep any and ALL correspondence.  Try to get your mom to send you something in writing, like a chat (LINE app, etc) where she admits using the funds.  Maybe even your stepfather too.  I really  hope you get your money back.  \n\nALSO - I think you can file a lien against the house, so that if they ever try to sell it, well, they can't until they pay you back.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "As a minor, would he be able to have a guardian ad listen if he were to explain the situation to social services or the DA’s office? I ask because if there’s a statute of limitations it may be best to find a way to get the ball rolling now?",
              "id": 41,
              "comments": [
                {
                  "score": 6,
                  "content": "Usually the statute of limitations for things that happen when you're a minor start when you reach legal adulthood. The law recognizes that you may not be in a position to make your own decisions till then.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Why not now, why 18? I'm not a lawyer, but it stands to reason that a lawyer could represent a minor for a fraud committed by a supposed guardian",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP's comment was likely more right than he knows -- if this will was structured the way OP thinks it was, it will be his house.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1217,
          "content": "This, lawyer up. Don’t “lash out” however warranted it may feel or may be. I can see a couple ways this could go and they’re all helped with being able to demonstrate as much maturity as possible and taking the high road until everything is settled out legally speaking.",
          "id": 45,
          "comments": [
            {
              "score": 376,
              "content": "Great advice.\n\nWhile lashing out might feel good in the moment, it can't help your case.\n\nAnd I guarantee that lashing out now wouldn't feel nearly as good as watching them move out of your house.",
              "id": 46,
              "comments": [
                {
                  "score": 84,
                  "content": "Or, even better, watching them get criminal charges.",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "Three words: Lawyer, Lawyer, LAWYER!! They have stolen from you!!\nNTA ABSOLUTELY DO NOT APOLOGIZE!!!!🤬😡😈👿",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I guarantee if he goes the legal route, it's going to taste much sweeter.\n\nOP NTA",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "And even when it's all settled legally allow your lawyer to lash out on them, you just get your popcorn and enjoy the fireworks.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 721,
          "content": "I didn’t think something about that could be done right *now* that I’m still not 18 yet but I’m gonna find out. Everything was supposed to go to me after I turned 18 that’s what they explained to me.",
          "id": 51,
          "comments": [
            {
              "score": 474,
              "content": "Something can be done. If your mom has access it's because she is likely an executor of thd trust meaning dhe has a legal duty to ensure the money is used properly as per the terms of the trust and its likely that buying a house for her and her husband is in violation of that. Thst is true whether you're 18 or not",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 345,
              "content": "Who explained it to you? If it was *anyone* other than your mom, go ask for more info and a lawyer recommendation if they can give one. \n\nSomewhere on papers from your dad's estate is a lawyers name. Ask them what your dad set up. \n\nAlso, did your dad have any family or good friends that would be willing to help you? If the child of a dear friend came to me to ask my help because the surviving parent likely stole inheritance money from them, I would be beyond livid! I would be in an attorneys office as soon as we could get an appt!!\n\nGood luck OP. keep us posted. Reddit loves a good update!",
              "id": 53,
              "comments": [
                {
                  "score": 914,
                  "content": "It was the lawyer that did my dad’s will and my mom was there too. Tbh I didn’t pay attention to all the details. Everything was still a big shock to me. My dad didn’t have any other family aside from his best friend (my godfather). Sum people already told me to try reach out to him maybe he can help so that’s what I’m gonna do",
                  "id": 54,
                  "comments": [
                    {
                      "score": 419,
                      "content": "Definitely call him now! He will be in your corner. Explain the situation and hope you think your mom and stepdad stole your inheritance and he can at least get you in touch with the lawyer that drafted your Dad’s will and executed it. That’s a great place to start. You are NTA and are possibly being victimized. Please update us.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 215,
                      "content": "In the meantime, DO NOT let your mom or anyone else know you're talking to him. You do NOT want them to have time to find ways to screw you over more. Everything is between you and your lawyer. NOBODY ELSE. Keep your cards hidden until it's time to play them, and most likely that won't be until you're 18.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 130,
                      "content": "Call that lawyer.  He is your dad's lawyer, and is morally and legally bound to protect your dad's interests.  If he is not a litigator, then he can help you find one.\n\nSecond, get in touch with the godfather.  You are going to need help.  If this turns nasty, you might even need a place to live.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "*EVERYTHING* was supposed to go to you. As in, it's not supposed to be touched until you're 18. Your mom stole from you. That was not her money. It did not go to her until you're 18, and then anything unspent goes to you. She was not allowed to use any of the money. She felt guilty because she knew she wasn't supposed to do it. Talk to your godfather, talk to the lawyer, and if he doesn't help you, talk to a new lawyer. You're right, that money could have gotten a house for *you.* It could have gone toward a college degree if you choose to go. It could have gone to so many things to benefit you, but she took that option away, and there's no way your father would have been okay with that.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "You need to call that man, your godfather, ASAP.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Your Godfather will be an excellent place to begin and he likely knows who the lawyer you met with is and can get you their contact info too.  Even if nothing can be filed till you are 18, starting the investigation quietly now will put you and your attorney ahead of the game.  Good luck OP!\n\nAnd absolutely NTA",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Pls give us an update about what he says when you do op! and I'm so sorry what your mom and stepdad did was terrible nta at all!",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "When you call that lawyer, confirm with him that the discussion is confidential to ensure he doesn't \"accidentally\" inform your mum if they're on good terms.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "That money is supposed to be YOURS. Your mom is using that money as child support, and that is NOT the intention of that money. The fact that they used YOUR money, without consulting YOU about it, is breach of contract.\n\nIn fact, your money should have gone into an \"Estate Account\" at the time of your father's passing. If your mom took money out of this account without you knowing it, that is illegal.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Talk to him asap!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "Talk to a Lawyer (several lawyers! Find one you want to work with!!) TODAY. \n\nGood news is the house is already worth more than they paid for it because the housing market is bananapants right now. \n\nCash out. Get your $$$$",
              "id": 65,
              "comments": [
                {
                  "score": 3,
                  "content": "Not sure that'll continue much longer, though.  Varies by area, but rising rates are already squeezing things.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 99,
              "content": "OP - take action NOW! Get a lawyer to get an asset freeze for you. They cannot freely spend your money. Trust me, if they are as irresponsible as you make them sound, you will have nothing left by the time you turn 18. DO not wait until you are 18. Take care of this now. I am assuming you are in the US. I used to be a lawyer. If you need assistance, depending on your location, I can help you find an attorney.",
              "id": 67,
              "comments": [
                {
                  "score": 9,
                  "content": "I'm willing to bet there *IS* nothing left if mom is executor.  She and stepdad are banking on OP doing nothing and just taking the hit.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "I don’t think you have to wait until your 18",
              "id": 69,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "I agree with the other comments, I don't believe you need to wait until you turn 18. Google an estate lawyer in your area and reach out; many offer free consultations and they can go over your options. Your mom and step-dad don't care about your best interest; they only care about themselves and what they did is not only incredibly wrong (I say this as a mother) but as others have pointed out, depending on how the will was worded, it's likely they committed a crime.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Don’t wait until 18. \n\nI’m not a professional in this area, but my understanding with a lot of trusts via estate is that the trustee/signatories have access to the funds in a limited capacity, as long as the use of those funds aligns with the provisions of the trust. \n\nIt’s likely they were able to convince themselves that “buying a new house is a benefit to you”, but since that house was not actually part of the estate your dad left, it almost certainly won’t be included as part of the estate/trust that is released to you when you are 18. And by that point it may be too late.\n\nThis needs to be addressed asap bro, set up a consult with 1-2 estate lawyers if you can.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You don't have to wait until you are 18 to get an accounting of your funds and where they have been \"invested\". You only have to wait until you are 18 to control (or whatever age is specified in the trust if there is one).",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If you don't have a copy of the will..go to probate court and get one..and look for free legal services..it's a start",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "OP, first off NTA.\n\nGet hold of your godfather ASAP and get an estate lawyer involved. Your godfather may be able to get the ball rolling before you turn 18.\n\nI hope that you are able to recover at least some of what your dad left you, from what your mom and stepfather squandered.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 362,
          "content": ">Don’t pick a huge fight with your Mom and stepdad over this until you have the facts. But I really do think you should have a professional review the situation and let you know what your options are.\n\nThe sooner the better, it's incredibly hard to get back misspent estate funds when the individuals stealing from the fund have no assets of their own to repay the estate with. If OP has any relatives left on his father's side he should reach out to them and see if they can assist.",
          "id": 75,
          "comments": [
            {
              "score": 250,
              "content": ">have no assets of their own\n\nWell, they have a house now. So they can take whatever equity is left in that and pay back what they stole from OP.",
              "id": 76,
              "comments": [
                {
                  "score": 93,
                  "content": "Yeah, That is the beautiful part of this. They have an asset that they cant just get rid of or completely ruin. Even damaged there is land value as well as insurance.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "OP about to get a whole ass house if they cant give the funds back",
                  "id": 78,
                  "comments": [
                    {
                      "score": 8,
                      "content": "No it's more likely that the court will hold his mom accountable for whatever amount she \"misappropriated\" with some extra for interest/court fees. \n\nIf they don't have this money, OP will be forced to go back to court in order to force his mom to pay her debt. At which point she will be faced with the choice of potentially selling her house to pay back the funds she used inappropriately",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Not necessarily.  We don’t know how much of the inheritance was spent on the house.  They could have made a small down payment and have a large mortgage.  Get a lawyer to demand an accounting and sue your mother and stepfather as soon as possible.  They are pissing away your money every second of every day.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Good thing they have a house. Pretty big asset",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Let’s make this top a top comment so OP can see it. OP needs a lawyer.",
          "id": 82,
          "comments": [
            {
              "score": 68,
              "content": "Yep. NTA. Lawyer up. It might not even need legal action. If the house has been purchased using trust funds it might actually already be in OPs name.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "It's also possible the house is in the name of the trust. You can look that up yourself in most places in the U.S. by typing your town and state followed by property records search.",
          "id": 84,
          "comments": [
            {
              "score": 4,
              "content": "Former title abstractor here. This is true. Go to the website for the county you live in. There should be an online records search. Go there, and you can type in the address of the house. It will provide the record of who is on the deed, and will also tell you if there is a mortgage on the house (or any leins), and who holds them. It'll even tell you how much they paid for the house. Usually you can spend around $2.50 to obtain a copy of these records. \n\nIf your county doesn't have this information online (typically they do, these days, but there are some places that don't), you can go to the courthouse (you'll want to go to the records room for deeds) find the person in the office and they'll help you right away. You'll have all of this info in minutes. You can also go to the fiduciary records room and look up your dad (if he died in the same county), and read his will. Get a copy, if you like, too. (this can also be obtained online, if they have the records uploaded.)",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "Yes, absolutely. My concern is that OP may be using the term “inheritance” when it could actually be life insurance or something else that may not be an actual trust. It’s best to find out exactly how the money was earmarked for use before starting a family feud. \n\nIt’s kinda sus that people who don’t work full-time could even afford to upkeep a house. Money doesn’t usually sit in an account somewhere - generally people will invest and ideally, get some returns. Did they maybe use earnings from the original amount? Have they moved that money into a different fund/account? Is there a financial planner involved that OP can talk to?\n\nIn any case, it’s going to take some time for a lawyer to establish a paper trail of where the money has been and where it’s been spent. If college is this September, OP better start moving on this asap.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Please read this comment, OP. Get your stolen inheritance back if you can.",
          "id": 87,
          "comments": [
            {
              "score": 96,
              "content": "OP, if you need help finding a lawyer, contact your State Bar. They usually have a “For the Public” section on their website. If they don’t, or if you’re unsure of which department to call, call the main line and briefly explain the scenario (“I am 17 years old and I believe my mom and stepdad have inappropriately taken money from a trust under my name. I need help finding a lawyer”). They should be able to direct you.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This right here OP",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8291,
      "content": "NTA you should probably contact a lawyer about them misusing the money that was meant for you",
      "id": 90,
      "comments": [
        {
          "score": 1833,
          "content": "[removed]",
          "id": 91,
          "comments": [
            {
              "score": 689,
              "content": ">  they've probably broken a bunch of ~~rules~~ **laws** by utilizing it to buy anything in their own name.\n\nftfy",
              "id": 92,
              "comments": [
                {
                  "score": 178,
                  "content": ">  they've ~~probably~~ broken a bunch of ~~rules~~ **laws** by utilizing it to buy anything in their own name.\n\n>ftfy\n\nftfy",
                  "id": 93,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Excellent catch - thanks! :D",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 469,
              "content": "Since they rushed to buy the house before he turned 18 I bet there’s a good chance the deed to the house belongs to the trust. They probably thought OP would find out after they died and he would just get his inheritance a few decades late and it would be no big deal.",
              "id": 95,
              "comments": [
                {
                  "score": 123,
                  "content": "Yea if it’s legit not in his name heads will fucking rolllll for this.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6765,
      "content": "Kiddo, it sounds like you might need to get a copy of the paperwork that says it’s your inheritance and who is in control of the decisions. You might need a lawyer. \n\nStay cool and non-confrontational until you know the truth and all your ducks are in a row. Think Big Picture. Play the Long Game and get what’s yours.",
      "id": 97,
      "comments": [
        {
          "score": 1134,
          "content": "Even if he himself can’t get a hold of the paperwork, I’m pretty sure that the judge will demand to see the paperwork and the parent will have to provide said paperwork.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 736,
          "content": "Start with the lawyer who structured the payment to you. If your mom was entrusted to keep funds for a minor, she could be seriously liable for fraud or theft or embezzling or something. What she did is totally illegal. You could also contact the bank or financial institution that released the funds to mom. Or a lawyer can. This is so not right. NTA",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "I would also ask if there is a trusted adult you can ask to help you figure this all out? At 17 this is a lot to do on your own! Super shitty that your mom and SD put you in this situation and really does seem like they were trying to sneak it in before you became a legal adult. Def NTA and I really hope you get this sorted out!",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "long game may be interesting since the step dad is a substitute teacher and mom is a receptionist. If he has a decent trust so that a lawyer knows he can get paid, he can bury them in legal fees they'll never dig out of.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "> a copy of the paperwork that says it’s your inheritance and who is in control of the decisions. You might need a lawyer.\n\nPlus... All his legal documents..",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3771,
      "content": "[removed]",
      "id": 103,
      "comments": [
        {
          "score": 2693,
          "content": "Trust me I been mad about it for months. This is the most I’ve talked to my mom since finding out how they bought the house because I’m just so done with them",
          "id": 104,
          "comments": [
            {
              "score": 931,
              "content": "Really sorry about your dad by the way. They needed to continue living as if your dad was still alive. The fact that they used his death as a bonus in their life, AND taking it away from you just a year away, is complete horseshit and they should be fucking ashamed.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 477,
              "content": "Please consider contacting a lawyer, OP. An estate attorney is what you need. \n\nDo you have a trusted adult you could talk to about this? An aunt or uncle on your dad's side of the family?",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 372,
              "content": "Why haven't you spoken to an estate lawyer?",
              "id": 107,
              "comments": [
                {
                  "score": 1024,
                  "content": "Cause I didn’t know I could do that tbh",
                  "id": 108,
                  "comments": [
                    {
                      "score": 837,
                      "content": "Well now you know that you can. When your godfather gets back from his work trip, tell him what happened and ask if he’ll help you find an estate lawyer. This honestly could lead to you getting possession of the house. \n\nNTA",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 235,
                      "content": "Please do this. Not an estate.lawyer, but one who deals with this stuff.\n\nYou can, and should. This sounds like a clear case of trust misuse. \n\n\nDo realise, this WILL cause a rift in your family. So know it's a line you can't uncross",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 51,
                      "content": "Play it cool\n\nAbsolutely never lose your cool and spill the beans until your winning play is in line",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I don't know much about this, but I imagine if you Google estate lawyers in your area that you might be able to find one to at least give you advice when they hear your story. Good luck, and please try to get what belongs to you!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "You can. Not an estate planning lawyer, but a probate litigator by preference; general civil litigator with probate experience at minimum. They can get the court to demand an accounting of EXACTLY what they spent, from what source and on what; and if it was done illegally, they can help you get it back. Even if it was put into the house, the court may make them sell the house in order to pay it back to you. \n\nPlease do it, OP. And please update us. We're worried for you and we want to see you get what's yours.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "They violated the terms of the estate.. \n You totally have a case.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Do NOT tell anyone on your mom's/stepdad's side you are going to - you don't want mom and stepdad putting together BS to cover this up.  Just contact one and meet with him/her.\n\n(this is life advice not legal advice, I am not a lawyer, etc.)",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "And if you're subtle about it, maybe you can gather evidence now, in light of this current fight, by texting your mom about the situation and why you're upset - if she admits anything, save the screenshots (save in multiple places, including a Cloud location that no one else has the password to)",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Not an estate lawyer, as others have pointed out - look for a litigator.",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 225,
                  "content": "**Because OP is feaking 17 and it's not completely weird or uncommon that a teen wouldn't know they can do that?**\n\nJesus, you don't have to be such an ass about it. You could have said it in a much nicer and actually helpful way, without blaming OP for not knowing shit about inheritance laws at the age of 17.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Heck I have almost 20 years on OP and I know almost nothing about inheritance law. He's allowed to be ignorant at that age. You don't exactly expect your parents to shaft you.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 152,
              "content": "DO NOT LET THEM GUILT YOU INTO LETTING THIS GO!! Any consequences for THEIR actions are on THEM, not you. Please reach out to an attorney with litigation experience regarding fraud in fiduciary responsibility. You may need to make a police report.  If you have any paternal relatives, ask for their help immediately. \n\nThis is a HUGE violation. Do NOT give them time to burn through the remainder of your inheritance and/or lose the house to punish you for standing up for yourself. \n\nI am so sorry that you lost your father and your mother is choosing to make poor decisions at your expense. \n\nNTA",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "Please get a lawyer.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "as another mentioned 'play the long game' there should be a legal way to get what is yours.  Get legal help, and keep a cool head.  You know how in movies the good guy tells the bad guy 'I know what you did!\" and then there's all sorts of chaos? Don't do that.  Don't let your folks know what you're planning, keep calm and be 'baseline normal you' around them.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Check at work & see if they have an employee assistance program. These are usually used for free counseling but many include legal consultations also. It’s an easy way to get some advice on how you should proceed. Good luck!",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Please fight to get your money back.",
              "id": 124,
              "comments": [
                {
                  "score": 48,
                  "content": "I’m gonna find out how I can",
                  "id": 125,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Please update us when you can.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I’d start with you and your godfather speaking to an estate attorney. Also, go a head and gather up all your important documents (birth certificate, etc) just in case your mom and stepdad try to withhold them from you.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Please update us when you do",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Please do update us ❤️",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Hoping for an update soon, tho I know these things can take time. I hope however it ends up, you are ok and everything ends up good.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "You should consult with a lawyer. They used YOUR money.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "go to an estate lawyer, a free consultation can help you plan future steps on how to get your money back. start having conversations over text with your mom about this so you can create proof of the theft.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 73,
          "content": "Honestly I say his mom is actually the biggest asshole. That's her child that she completely screwed, I doubt the stepdad was named trustee/executer of the funds, she had to have agreed to this for it to happen. I can't image betraying my kid like that.",
          "id": 133,
          "comments": [
            {
              "score": 21,
              "content": "Yeah I mean I agree, mom is more at fault for the whole situation, but step dad calling it his house? Knowing this kids inheritance is what made it happen? This kid deserves a free pass to do whatever the fuck he wants in that house",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Me too! Shit I’d drive him myself to a Lawyers office if he lived Close!",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "No especially fuck his mom for allowing and being a part of this. She took advantage of her own kid.",
          "id": 136,
          "comments": [
            {
              "score": 7,
              "content": "Yeah I mean overall she’s the biggest asshole, but in the scenario about his step dad calling it his house? Eat a fist man",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1516,
      "content": "NTA and no *should* about it, you need to talk to a lawyer ASAP. You may be misunderstanding the situation, but if you as the beneficiary take issue with the use of funds left for your benefit you have rights to have that addressed.",
      "id": 138,
      "comments": [
        {
          "score": 575,
          "content": "What is there to misunderstand?",
          "id": 139,
          "comments": [
            {
              "score": 1098,
              "content": "I think there are some distinctions to “stealing.” Like if your dad left the money for you but legally put it in your moms name and not yours, she’s morally a thousand percent wrong but you have no legal recourse. If the inheritance was legally in your name she shouldn’t have been able to access it, which is why it’s a bit confusing unless they went as far as to commit fraud and out your signatures on things. That’s why you’ll need some legal help and to see the documentation of this inheritance.",
              "id": 140,
              "comments": [
                {
                  "score": 1448,
                  "content": "I know for a fact the money was put in a a trust under my name but since I’m still not 18 yet my mom had access to it I believe not 100% sure how it works but for a fact it’s in my name",
                  "id": 141,
                  "comments": [
                    {
                      "score": 1273,
                      "content": "You need to get copies of all documents and get a lawyer to review the situation. Going on your mother and SF reaction, I suspect that they know they’re morally wrong but feel that they’re legally in the clear. I mean they’re more focused on the ‘embarrassment’ than begging you not to say or do anything. \n\nEstablishing the facts should be your no 1 priority.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 848,
                      "content": "There are always conditions on a trust as to how the money can be used... your education, paying for your wedding, buying yourself a house, etc.  If your mother was the trustee and used the money for herself, that's a crime.  She had no right to do that. Supposing she dies tomorrow, do you think your stepfather is going to leave the house to you?  GET A LAWYER!",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 157,
                      "content": "If there is still a lawyer (or CPA) attached to the trust, contact that person. If they are still handling or investing the trust's funds (and so already billing for their fees), they can bill their services to you to the trust without you needing money up front. At least that's so where I live. Now if it's a more personal family trust with no professional oversight, I suppose you'd have to find a lawyer willing to look. I'm not sure. I sure hope you can find some guidance though. Maybe a family member on your Dad's side?",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "It sounds as if she was named as the administrator of the trust to manage until you came of age, and that she TOTALLY abused her access to the account in illegal ways.\n\nThat money was YOURS, and she had no legal right to purchase a home for HERSELF with YOUR MONEY. She had a fiduciary duty to ebsure the inheritence was only used for your direct benefit in ways you would approve of, and what she did is a classic example of how administrators get in HUGE legal trouble. There isn’t a judge anywhere who will believe their horseshit about \"we bought the house for your benefit!\" \n\nThe paperwork likely spells out how it works, but that is generally how it works in my experience. I'm a paralegal, and it isn't my specialty, but I had a great professor who taught the subject. You need an estate attorney YESTERDAY.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "OP please listen to the people telling you this is something you should pursue. It's maybe not the most enjoyable process but it needs to be started right away. The sooner the better. Your mom and stepdad KNOW it wasn't theirs to take.  You have rights they are hoping you don't find out about.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "It is also a bit nuanced. Because she is using it to pay for your housing, depending on the terms of the trust it may be a valid use. However, that may also require the house becoming your asset, or perhaps she breached a fiduciary duty by spending an exorbitant amount on your housing costs for 1 year, etc.  There are just multiple ways this could shake out and it depends on their terms of the trust, the laws in your state, etc.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "If you haven't had your own lawyer review the document, you don't know anything.  Anyone can tell you what they want you to believe. \n\nGet a lawyer. Get to the bottom of this. Be smart.  And don't let your anger or emotions get you to make a wrong move (I.e. let your mom know you are getting a lawyer.  This should all he done quietly and behind the scenes).  You cannot trust anybody but yourself in this.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Because you are underage, she was put in charge of managing it.  Her husband talked her into spending it on them.  This is breach of fiduciary duty and they will have to replace it and/or go to jail.  She broke the law.  She was entrusted to manage your money.  Also, the social security benefits are supposed to be saved for you.  The Social security admin sends an annual letter to your mother to ask how the money is being spent with the expectation some is being saved.  when the benefits started, your mother was told to save part of for you for when you turned 18.  She is not supposed to spend all of it on expenses.  My husband died when my son was a teenager, I have been through this.\n\nGoogle or yelp probate litigator or trust attorney, pick ones with high ratings and local To you and call them and tell the receptionist you are 17, your dad died, left you money in a trust for when you turned 18, your mother used it to go on vacation and buy her and her husband a house in their names.   Can you speak to someone who can help you?  Make this call when your mom and her husband are not around.  You will have to go see the attorney in person if he chooses to take your case.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Then yes she used her position as your guardian to misuse your funds. Lawyer up",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "You need a lawyer fast. If you know the name of the lawyer who set up the trust and handled the will, start with them. They likely won't be able to litigate for you, but they'll be able to get you all the info you need and refer you to the right person. This is an emergency. You need to get on top of it before they spend it all, which they are likely doing.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Money left to an under age child often has an adult that can withdraw the money for specific things to care for the child.  It sounds like op’s mom abused that signing authority and is trying to claim the house benefits op.  The reality is mom and stepdad are nothing but thieves.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "depending on your father's will- your mother may have been allowed to use some of the money for costs associated with raising you. \n\nwhether that would extend to the down payment of a house, I doubt very much. and should be simple enough to resolve- but it all comes down to how your father prepared his estate. (and is one of the reason's that people suggest trust if you have minor children. even if it's relatively small amounts of money for an estate.)",
              "id": 153,
              "comments": [
                {
                  "score": 23,
                  "content": "It wasn’t a down payment. They bought an entire house and put it in their names.\n\n\n\nEdit a word",
                  "id": 154,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Think he meant \"i\" instead of \"you\" but you seem to be misunderstanding things as well. They stole from you. If you are the sole beneficiary, that was your money and they had no right to use it. You should ask a lawyer about that.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "One poster stayed above that where they live there is a statute of limitations on doing anything. In their area it was one year from the beneficiary’s 18th birthday. You’re the beneficiary. Please call an estate attorney as soon as possible!",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 936,
      "content": "NTA\n\nEmancipate immediately and sue them for your money. If the inheritance is large enough, a lawyer will help you. \n\nAre there any other adults you trust that could help you navigate a legal solution?",
      "id": 157,
      "comments": [
        {
          "score": 1113,
          "content": "My godfather maybe. He’s my dad’s best friend but rn he’s on the road for work.",
          "id": 158,
          "comments": [
            {
              "score": 469,
              "content": "When he gets back ask him to meet up with a lawyer. So you can sue your mom and stepdad",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 275,
              "content": "Definitely call your godfather. That’s a good place to start! If he isn’t able to help, don’t give up there. Lots of great advice for you in this thread",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "I would give that Godfather a call and confide that they used your trust to buy a house. You never know if your Dad informed him of his arrangements in telling him to just keep up and check on you before he passed. You need somebody who is in your corner, because this sounds all sorts of F-ed up. I'm sorry, OP.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Call him. I assume he is in an area with reception. For real, it's time to start a legal review. \n\nAs a side note, which is going to be wildly unpopular with the majority of commenter I think, I think you should go for the jugular, verbally speaking, the next time it comes up with step dad. That means telling him something to the effect of, \"I have no respect for you, nor will I ever. No respect as a guardian nor as a man. What kind of a man steals from a child? What kind of a man depends upon the labors of another man to provide for his wife and steals from his wife's child? That kind of a man can't be called a man at all and deserves no respect from anyone.\" \n\nTo your mom, \"how could you steal from your own child? Was it to provide for your husband? I hope it was worth it because you gained a house, and some dick, but I promise you you've lost a kid. Things will never be the same between us, no fit mother would steal from their child like this and handicap their future.\"\n\nFrom that point forward I would never say another word about it unless it's through a lawyer.  I have a feeling that house is going to be yours.",
              "id": 162,
              "comments": [
                {
                  "score": 49,
                  "content": "No confrontation might make them take actions to be prepared if he tried anything legally. Also as a minor he will have to stay with them for months no need to make it an awful time. \nConfrontation have the worst outcome in those situations",
                  "id": 163,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Agreed. It will be more satisfying in the long run to not mention a word of going after them legally. Let it be a surprise, just like what they did was.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I don't know if you understand how lawsuits work but there's a lot of mechanisms in place that literally make it impossible to not know you're getting served a lawsuit, it doesn't ever come as a surprise. He's also old enough to file for emancipation, and he's probably old enough to just leave and go stay with someone else. Your parents can kick you out when you turn 18 but in a lot of States you can leave before you turn 18 also.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I wouldn't recommend him to do that, it's kind of provoking a response & hinting to them he knows what they done & he's probably going to do something about it. His mom sounds like a narcissist already because she was trying to blame HIM for embarrassing HER (SMH). She was dancing over the details until she had to tell him the truth, unlikely she's going to play nice about it especially if he confronts her with the truth as you pointed out.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "Reach out to him!  At the very least, maybe he can help find a suitable lawyer in your area that can help you get started.  You might not be able to hire the lawyer until you're 18, but hopefully they can give you a list of things to gather to be ready.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Ask him if he knows the name of the lawyer your dad used to set up the trust. That's who you should get in touch with as soon as possible. It's his job to help you get your money.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Legally you can leave at 17 and they can’t stop you. Even if they call the police, the police can’t do anything about it. If it was me, it’d be my first priority to contact my godfather and find any relevant documents that I could, then I’d pack my crap while they were gone and go live at my godfather’s if he was ok with it. After he returns he can help you get a lawyer and find out your options. 17 is old enough to stay at home while he travels for work. There’s no reason you should stay there if you are uncomfortable and can find another place to stay. I hope this situation works out in your favor!",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I suggest you to get in contact with your godfather. Will and Testament a usually done with a lawyer, he will probably have an idea who’s the lawyer that did it. Those type of documents are always keep in a safe place, so even if you mother disposed of her copy of the Will and Testament, you could find them easy by retracing your father’s lawyer. If you can’t find the lawyer, try to find the place that the documents were done, you could then present yourself in court asking to see the Will, as you are the sole inheritor it should be easy.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Emancipation probably doesn't make sense if OP is nearly 18. By the time it got through the courts, they'd be overage already. But they can start working on what they need to set up in order to get their own money back as soon as possible after their birthday.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Emancipation is not advisable in this case nor would it be granted. \n\nEmancipation would involve OP becoming completely cut off from all benefits from his parents. This includes all medical insurance and his survivor benefits. \n\nHe would have to prove he is already living on his own and able to provide a roof over his head and have a steady source of income.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 652,
      "content": "Lmao my mom pulled this same shit with the money my dad left me. Her and her husband built themselves a nice little McMansion. \n\nNTA dude.",
      "id": 173,
      "comments": [
        {
          "score": 652,
          "content": "Damm I’m sorry about that. It’s so fucked 😕 I never knew my mom would go this low ever. It’s been hard ever since looking at her the same",
          "id": 174,
          "comments": [
            {
              "score": 252,
              "content": "I’m so sorry for both of you, something similar happened with my Ex. please don’t let them guilt you out of taking legal action, get this looked into asap.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I am so sorry and hope it gets better for you",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": ">It’s been hard ever since looking at her the same\n\nYou shouldn't be trying to. She showed you who she is. A cruel, selfish woman who values dick over her son's future.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I wanna start this off by saying im sorry for your loss and OP I really hope you get this figured out and get it done fast and it goes well. If for some reason they lose the house or depending on some situations (and the state your in) it can make  it hard to get the money back (coming from experience grandfather passed, my money was in a savings, father spent it and has to much debt when i could claim it my state won't collect from him). The best you can do is talk to a laywer(s) (multiple opinions and quotes are good) and figure your plan out.\n\nI really wish you the best of luck with this. Everything with this will be stressful now, but it'll get better and this fight will be worth it.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I'm so sorry honey. I am a mother of an only child, a son, and I don't know what possesses these people to treat their children like a bank.\nMy Dad and Step-mom have used my name and destroyed my credit. They did this when I was struggling as single mother of a one year and student at the age of 20. I STILL can't even get a credit card over $500. That's how bad it was. Can't get a car. Lucky my apartment was grandfathered to me from a dear friend and the rent is low for a big city. no house until I rebuild the credit. My own mother stole money from my bank account (student loans at that!) and she works at the bank. This is all after practically enslaving me to be the babysitter of their six (three on each side) children. My only escape as a teen was running away at night and hanging out with friends, music and partying.\nMakes me sick. I hope and pray you get the justice you deserve. It will get better. There's nothing wrong with releasing people from your life. Sometimes we have to take hard line boundaries with the people we love the most. Those people often take advantage of us. \nIt's hard having to sever ties, especially after loosing your beloved father. But it is needed. If you have a trustworthy adult in your life, please seek them out immediately. Please move in secrecy- do not tip them off!! \nAlso! Consider getting some therapy. The trauma of betrayal and loss weighs heavily on us, but we often suppress because we need to be \"strong\"\nWell, you don't need to be strong all the time. But you do need to be smart, sharp and honestly, cunning. \nI wish you luck.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "same thing happened to my partner. his dad was in the military and died young so he would’ve gotten social security but his mom kept it from him til he was an adult and it ran out. plus that money didn’t go to raising my partner either because she was a drug addict and lost their house and CPS had to get involved multiple times. so she just used his dads money for her own benefit for 10 years.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Was there anything you could do about it? Did you attempt any legal action?",
          "id": 181,
          "comments": [
            {
              "score": 20,
              "content": "Probably, but I never really looked into it. By the time I realized what had happened I was too busy just trying to get the hell out of dodge. I'm in my 30s now and I've brought it up once or twice to my mom, but it's not something I think about too often.",
              "id": 182,
              "comments": [
                {
                  "score": 8,
                  "content": "I'm so sorry to hear that happened to you!",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Did you lawyer up? Does your story have a happy ending, at least?",
          "id": 184,
          "comments": [
            {
              "score": 26,
              "content": "Nah. By the time I realized where the money for that gaudy-ass house came from, I was more focused on getting far the hell away. I took the L and only really think about it when I see a post like this one or when my husband wants to remind me that my mom is kinda shitty. \n\nI guess you can get a really petty sense of justice from the house being condemned a few years back. It was built shortly after hurricane Katrina and apparently \"Chinese drywall\" was used in the construction. That shit is toxic and it's probably why my mom's husband has so many health issues now.",
              "id": 185,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "This is exactly why my beneficiary is my best friend (and my kids godmother) and not my kids dad. I trust her to actually make sure it all goes to my kid.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 332,
      "content": "NTA.\nAnd honestly, I would actually reccomend you go and talk to a lawyer about suing them for your money. That money should have been held in trust for you, and they have likely broke all kinds of laws by using it to purchase an asset in their own names.",
      "id": 187,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 280,
      "content": "NTA\n\nSpending your 17yo child’s inheritance on a house with your new partner is SO selfish and foul. Even IF you were 10 and had 8 years left to live in that house, they had no right to spend your inheritance on a house. That money was for YOUR future not theirs. Expecting your 17yo to cook breakfast for the family when they are late for work…when you are completely free to do so yourself is incredibly selfish (sensing a pattern here). Tbh I don’t think you did anything wrong by expressing it’s your house. Was it petty? Yes. But justifiably so. It doesn’t even sound like you were trying to humiliate him. You simply stated the truth. He wouldn’t be embarrassed if there wasn’t merit to what you said.\n\nAlso to echo everyone else, contact a lawyer!\n\nAlso might be a good idea to text him or your mom about this at some point just to have a paper trail documenting them affirming they used your inheritance to buy a house for themselves. Idk if that will be usable evidence going forward but nice to have in your back pocket. (Ex. “Mom said to apologize to you for embarrassing you in front of XYZ. I’m texting because I’m still upset and You probably are too. I wasn’t trying to embarrass you, Ive just been holding in a lot of anger about my inheritance and just blew up. I’m trying to plan for college and it really still bothers me that even though my dad left me the money for my future, you and mom spent part of my inheritance on this house that feels more for your futures than mine.” etc etc) that way he responds (thinking this text is a just a shitty apology) and argues that they used the money “for your benefit”  you will have some preliminary evidence that they misused your inheritance \n*again not sure if this would truly be helpful w/ lawyer but can’t hurt to have",
      "id": 188,
      "comments": [
        {
          "score": 96,
          "content": "GET a LAWYER NOW! You have rights. This is not what your father wanted. \n\nNTA, but your mom sure is!",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "> Also might be a good idea to text him or your mom about this at some point just to have a paper trail documenting them affirming they used your inheritance to buy a house for themselves.\n\nThe mortgage company knows where every penny of the down payment came from. There are few things that create a paper trail as long as buying a house.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Brilliant! That is a Great suggestion!",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 174,
      "content": "NTA get an attorney and get back what’s rightfully yours",
      "id": 192,
      "comments": [],
      "relation": "Support"
    }
  ]
}