{
  "post content": "I have an older brother who ive been estranged with for a long time. Not even sure where/if he lives at this point. Don't really care. Apparently when he was in his mid 20s he sold some sperm to a clinic for easy cash. We know this because his spawn \"Jake\"23M recently tracked my family down after taking one of those DNA tests. He was unable to contact my brother (no shock there) but found me on LinkedIn, reached out and we met for lunch. Based on his messages originally I thought my brother knocked someone up and abandoned her, but at lunch I found out he was conceived using donor sperm of my brother's. He does look a lot like my brother did when we were younger but based on his origination, I dont really feel any sort of familial bond if Im being honest. I have my own family that I care about deeply and I really dont need much more.\n\nI guess Jake is feeling somewhat of an identity crisis from not knowing where he came from so he wanted to meet. When I met with him I told him I would though I feel weird about it. I did feel like I should at least meet him to share the very limited info I know about family medical history (luckily we're pretty healthy but I have had some extended relatives diagnosed with cancer in the last few years). So I told him that but it was clear he wanted more. He asked about my weekend plans and I told him I was on Easter duty and hosting an event with friends and family. He asked if he could come, meet my kids, and some other relatives. I told him, sorry but thats too weird. I have no ethical qualms with sperm donation, IVF, or any of that but I feel like it makes a difference that he was \"created\" that way. So I told him no and that I dont want to pursue another meeting with him.\n\nHe seemed upset but left with no incident. Then lately he's reached out again telling me that Im treating him like shit when we are technically family. I told him no again, he wouldn't stop pushing so I told him I dont consider him family whatsoever, that I was blocking him, and if he reached out again I would speak to my attorney about a restraining order. My wife thinks I was too harsh to say those words but agrees we shoudln't maintain contact, it'd be weird to have him meet our kids given the situation. My friend however says im being kind of an A-hole because Jake is \"clearly having an identity crisis\" and Im in a position to help. I have mixed feelings on that.",
  "id": 1,
  "comments": [
    {
      "score": 3656,
      "content": "I mean NTA for not feeling like he was your family because genetically he is, but he was raised with another family.\n\nI think the way you've worded this post is a bit AH because it comes across as very condescending and very judgemental as to how he was born.",
      "id": 2,
      "comments": [
        {
          "score": 1247,
          "content": "This, OP is not the asshole for wanting no relationship with him but something tells me he (doner kid) might be dodging a bullet  \n\n\nEdit: Emphasizing Doner Kid might be dodging a bullet. Not OP",
          "id": 3,
          "comments": [
            {
              "score": 27,
              "content": "Oh I definitely agree that \"Donor kid\" is the one dodging the OP bullet.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Donor kid here - what a disgusting assumption",
              "id": 5,
              "comments": [
                {
                  "score": 19,
                  "content": "if it wasn't clear I was saying the Donor kid dodged a bullet due to the way OP wrote this post. Unless thats why you are angry",
                  "id": 6,
                  "comments": [
                    {
                      "score": 16,
                      "content": "My apologies..I thought you meant OP had dodged a bullet. Thank you for clarifying.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -19,
              "content": "You think he might be looking for a payday or something?",
              "id": 8,
              "comments": [
                {
                  "score": 3,
                  "content": "Maybe? But I think usually more often than not, these types of situations tend to be more about wanting to know where you came from biologically and be part of that.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1112,
          "content": "this is where I'm at. like he's right, the kid is not his family due to circumstances. But OP isn't like \"sorry but my brother just donated sperm and I doubt he was looking to be a father since that isn't the point. Plus he isnt even around, we aren't his family anymore because he does not keep in contact\". But OP has it framed as \"because you were created and not conceived in the traditional way, you don't count\" and I'm somewhat sure that isn't what OP meant but it totally came off that way",
          "id": 10,
          "comments": [
            {
              "score": 247,
              "content": "This. And if the kid was having an identity crisis, OP could have told him a lot about his brother. That might have really helped this kid. Instead, this whole post screams that he's looking at a bug under a rock and just wants to poke it away from him.",
              "id": 11,
              "comments": [
                {
                  "score": 44,
                  "content": "Why is that OP's job? He's clearly not close to his brother and seems to actually kinda hate him. Why is it fair to OP to make him relive memories he doesn't want to remember?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 62,
                      "content": "He made it his job once he agreed to meet with him.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 53,
                      "content": "You appear to have forgotten that Jake is a human being.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "What’s the harm? And why is it fair that he harbors this information when all this poor kid wants is something to connect to and identify with?",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "Of course donor children don't count as family and have no rights as such. \n\nIf donor children started to reach out like this the social fabric will be in shambles legally and morally. The donor's identity should be confidential. \nThis kid has no right to op's family as he was born to his own parents (donor's family is not this kid's family at all).",
              "id": 16,
              "comments": [
                {
                  "score": 127,
                  "content": "Truly and deeply feel for people who donated eggs/sperm before the advent of cheap and easy DNA ancestry testing. \n\nThey made the decisions to donate under the expressed and legally contracted condition of anonymity. And now decades later, that anonymity has been completely shattered. Putting not only them, but all their extended family is really really uncomfortable situations.\n\nSame goes for closed adoptions honestly. Women who adopted out their infants, and sometimes never told their families about it are now being forced to address it decades later to their current spouses, children and families. \n\nIt just stinks all around. I'm sure alot of these people would have made very very different choices had they known that in a few decades that may have any number of surprise offspring popping up at any time.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 2,
                      "content": "So you feel for the donors and not those of us who just want to know where we came from. I grew up with a single mom who died young and I don’t have much other family. I found a half sibling on 23 and Me and would love to find more connections. Your lack of empathy is stunning.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "“Shambles” really? lol. Dramatic much. i mean. Some people want a relationship with anyone that shares their genes. And some people don’t. The hard part is when the people that do get rejected by the people that don’t. \n\nThe thing is, in the US anyways, Sperm/Egg donors info is private. (My niblings are from partially from donations). \n\nI’m adopted, it was open but it was a foreign adoption. Having any kind of warning about health would be great, but I probably will never get that. \n\nThere are ways to say what op said. But fuck. That would be so hurtful to hear.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -5,
                  "content": "Donor child here. Your lack of empathy is astonishing.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "Thank you. I am a donor kid and I found this post dehumanizing and devastating. I had no idea we were viewed the way OP views us.",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "At the end of the day he’s NTA, he didn’t donate the sperm, it isn’t his responsibility, even if he did donate the sperm, that’s like saying that every child born through a surrogate or to a same sex couple should have the right to the info of the person who’s dna was used, I’m sorry you feel dehumanised, but at the end of the day, the person who donated only wanted to help others who couldn’t have kids and potentially make a bit of money at the same time, they have no legal obligation to you or any other child their DNA has helped to creat in that scenario, you should be entitled to medical history, but you aren’t entitled to their life when they never signed up for it, if they wanted children in their lives then they would have found a way to contact/be in your life, donors are not the parents, they are just the person contributing dna",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 513,
          "content": "Not born. “Created”\nThat part, to me, reeks of judgment",
          "id": 23,
          "comments": [
            {
              "score": 101,
              "content": "Right?! Because the kid was born, he didn't spawn solely from a giant test tube like in some sci fi movie.\n\nI feel bad for the kid, he's trying to find out who he is and the only biological family he can locate is pretty much a judgmental jerk. \n\nOP, you don't like your brother. No reason to. But how your nephew came to exist isn't his fault. He's here and he is family. I get wanting to protect your family, but get to know the kid, he sounds like he's got his act together compared to his dad. And maybe turn off your visibility on 23 & Me/Ancestry so you don't have any more \"donations\" come calling if you're going to treat them so harshly.",
              "id": 24,
              "comments": [
                {
                  "score": 151,
                  "content": ">he is family. I get wanting to protect your family, but get to know the kid\n\nI disagree. Yes, they're genetically related and if both parties were interested in pursuing a familial relationship, sure! But even if OP does come off as a total asshole here, he isn't obligated to pursue a relationship he nor the rest of his family is interested in. He's still an asshole, but not for refusing to have a relationship with Jake.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 83,
                      "content": "[deleted]",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "It’s weird to say this cause if he wasn’t a sperm donor baby, it seems OP would have been ok with speaking to him more. Weird but whatever I guess.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "If OP was my brother I’d be estranged from him too.",
              "id": 28,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "I wasn't trying to be judgmental. I have friend's who conceived using donor sperm. I used that terminology to separate my brother from Jake. Im realizing now \"Spawn\" was taken offensively. Son doesnt feel right because he has two parents. I was just explaining the situation.",
              "id": 29,
              "comments": [
                {
                  "score": 172,
                  "content": "Uh buddy you sounded judgmental for a lot more than just “spawn” - that your whole attitude towards him changed bc of how exactly your brother’s sperm entered his mother is VERY weird and judgy because what difference does it make? If you’re not in contact with your brother regardless, why does your willingness to interact with this kid hinge on whether your brother’s penis vs a turkey baster went inside his mother?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 146,
                      "content": "[deleted]",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 73,
                      "content": ">that your whole attitude towards him changed bc of how exactly your brother’s sperm entered his mother is VERY weird and judgy because what difference does it make? \n\nWhat difference? If brother abandons his son, op might have or feel a legal or moral responsibility for the child. But since that didn't happen, there's no responsibility. I don't think that's far fetched.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -9,
                      "content": "\"if only my brother had fucked your mom in the bathroom at a bar I'd happily introduce you to the rest of the fam\"......this is the kind of mind blowing shit DCP deal with daily.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 76,
                  "content": "You’re nta overall but your entire post was dripping with *at best* utter contempt for Jake’s mere existence. You don’t owe him a family or anything like that but to be honest, he’s lucky you shut him off because you sound like incredibly hard work to deal with.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "\"I wasn't trying to be judgmental\" OOOOF\n\nOP, the way you talk sounds like a very, very condescending AH to me.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Calling another person \"spawn\" is literally dehumanizing.  I think OP only met him to reject him in person.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "BS I bet you don’t call your friends kids “spawns”. You dislike your brother and that dislike reflects in how you talked down about and treated Jake. You never should have met him in the first place.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Donor kid here - you were extremely offensive and the way you spoke to Jake was cruel. If I found an uncle who spoke to me the way you spoke to him I would be devastated.",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -1,
                  "content": "The one thing I'm worried about here is if there are any genetic things from a health perspective that could be shared. I feel for that reason alone, some info could be exchanged, even if you have decided to be no contact with this personperson, as that is completely your prerogative. Just something to think about if it applies or not.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Thank you. I am a donor kid. I didn’t choose to be a donor kid. I didn’t choose to exist. And this post makes me feel like worthless garbage.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "It might be fair to argue that the person was born after they were \"created\" by utilizing science!",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Not to mention he refers to Jake as “spawn.”",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -4,
              "content": "The line “due to his orientation” told me a lot about why brother is no contact.",
              "id": 43,
              "comments": [
                {
                  "score": 8,
                  "content": "Umm, it's says origination. Not orientation.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thank you; my mistake.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 103,
          "content": "I'm willing to give benifit of the doubt that he is annoyed and frustrated at the situation. Just because they share blood or genes dont make them family, he was born into a different family unknown to everyone in OPs family. but referring to someone as \"his spawn\" and \"was\"created\"\" is pretty gross.",
          "id": 46,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 39,
          "content": "Right. Because honestly, what's the difference really between whether this kid was conceived during a one-night stand for IVF in terms of the relationship? Either way the brother didn't raise him",
          "id": 47,
          "comments": [
            {
              "score": 163,
              "content": "I think because with sperm donor it is a conscious choice to have the kid, so it’s different. The sperm is donated, so it’s not really “his” anymore. People chose to have a child with it and therefore the family unit is theoretically complete. \n\nA one night stand leaves something a little more unfinished. He would have grown up not having a dad. and not necessarily by choice. \n\nI think there are nuances, but I do see why it is different.",
              "id": 48,
              "comments": [
                {
                  "score": -11,
                  "content": "What’s the difference between this and adoption then? In terms of relationship with child and bio father that is.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I feel like there isn't much of one. Adopted children also very commonly seek out and want to get to know and be part of their biological families even if they have a loving adoptive family. I think it's just human nature to be curious about where you come from, genetically.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "its a matter of duty.  If his brother donated sperm, he never undertook an action that would normally obligate him toward the product of that donation, there was never any burden placed upon the recipient of the donation as the child was explicitly sought after.  impregnating someone conventionally means that the brother would have had sex with that individual, thereby meaning the child was an unintended consequence of his own behavior.  This child, even if they're completely loved by their parent(s), is something of a burden (at a minimum a physical one while the mother carries the child).  Given that the consequences of brother's actions would have imposed a burden onto the mother, and likely, the child (having likely been raised in an environment without a father -- one that we can statistically show is likely to lead to material hardship) the brother would have an obligation toward them.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -16,
              "content": "The difference is with sperm donation you intentionally choose from the beginning to have no relationship with your biological child rather than it being an unfortunate accident - yet for some reason the industry has convinced everyone that intentional child abandonment is cool and great. It's bizarre.",
              "id": 52,
              "comments": [
                {
                  "score": 31,
                  "content": "When you donate sperm, you are giving someone the opportunity to have a child that would otherwise never become a parent. It's a gift given without strings. To call it intentional child abandonment is disingenuous. The fact that modern technology allows unwanted contact is kind of a travesty.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Too think when OPs brother donated, nobody would have thought that you could track down the DNA. You thought your anonymity is safe. Otherwise so many wouldn't have done it. Now those kits are out and everybody see it as their chance to track down their donor. But they choose the way of anonymity for a reason. \n\nYou can maybe try to contact, but to think they expect you with open arms is -sorry - just stupid. They aren't family. They just share the same DNA. \n\nHere OP isn't even the donor. Still the young man let out his frustration at him. He was nice enough to met. But sharing a DNA doesn't make family. I guess he had parents that raised him, feed him, gave him a home.(I meanit more general  since i don't know his situation).\n\nI wonder how much the rate of sperm donors went back because of those kits and that anonymity is no longer guranteed to be anonym. \n\nNTA",
          "id": 54,
          "comments": [
            {
              "score": 0,
              "content": "I am a donor kid. We have feelings too.",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Maybe when he referred to the young man as \"spawn\"",
          "id": 56,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Imagine if some people got flustered and tripped over their own words while trying to tell the internet a difficult part of their family history...?\n\nNot everyone is a world class writer.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Also calling him “spawn”.  He’s a human being.",
          "id": 58,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Every time I see a super mean click bait title but the inside is totally reasonable it makes me think the whole story is fake and they used to the title to get you in and make you feel obliged to comment because the contrast is so significant.",
          "id": 59,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1292,
      "content": "NAH\n\n* Jack is Not TA for wanting to know about his heritage and even wanting to connect\n* OP is Not TA and did the right thing in providing medical information. \n\nBesides that, Jack is a total stranger and is not family just because they share some DNA.",
      "id": 60,
      "comments": [
        {
          "score": 385,
          "content": "I agree with all of this. The only thing that pushes OP towards being an AH for me is he seems to be judging Jake using the lens of his brother. His brother was useless and troublesome so his “spawn” (using OPs hateful term) isn’t worth any effort.",
          "id": 61,
          "comments": [
            {
              "score": 8,
              "content": "That struck me as unnecessary HATEFUL!",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -8,
              "content": "[deleted]",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -17,
              "content": "[deleted]",
              "id": 64,
              "comments": [
                {
                  "score": 17,
                  "content": "Op would be an asshole for their treatment of Jake whether they were female or not. This has NOTHING to do with them being male.",
                  "id": 65,
                  "comments": [
                    {
                      "score": -11,
                      "content": "[deleted]",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 220,
          "content": "I would say that Jake leans a bit more to the AH here, because he keeps pushing. OP said no and that no should be respected. Sperm or egg donation doesn't get you entrance to a family of origin. \n\nThe one thing that I think OP did wrong here is that he didn't open this option up to other family members. OP may not feel like opening the door, but perhaps others do.",
          "id": 67,
          "comments": [
            {
              "score": 106,
              "content": "I agree. But Jake is a young 20 feeling alone in life and hopeful that he found a \"family\". I understand him being a little pushy at the start. Also, OP's language \"spawn\" and the like is a bit assholy. So I opted for N A H as viewed those two things mostly cancelling out.",
              "id": 68,
              "comments": [
                {
                  "score": 47,
                  "content": "I think this is where I land.\n\nBringing Jake to a family gathering kind of feels like bringing someone you're dating home to meet the parents. It just feels a little too soon with 1 meeting, especially with kids in the mix.\n\nJake really needs to work out his identity crisis with a therapist. He is never going to find fulfilment in others.",
                  "id": 69,
                  "comments": [
                    {
                      "score": -5,
                      "content": "I'm not really sure that a therapist is a jump that would be needed. OP is in an ideal spot to fill another role for him-a friend.  Jake thinks he has a connection with him through DNA. OP doesn't see him as family. That's fine. But this is giving a cold shoulder to someone that is searching for...something he doesn't even know what it is. OP could be the one person best able to help Jake find some sense in his world of chaos DUE to that DNA connection Jake already has, in his mind, with OP. There is some semblance of trust there for OP from Jake. Maybe I'm just that empathetic of a soul, that I would still want to help this kid figure something out if I was in a position to do so, but...Jake may not be quick to trust a licensed therapist here. He already does to an extent the OP. There may be a bridge of friendship to build here, and that may be enough to start a healing process for Jake here.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Does being the product of a one night stand again you \"entry\"?",
              "id": 71,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I agree, but I'd like to add one more point; OP is looking at it from his stance as well as his wife's, but they don't speak for the rest of the family (their children excluded, depending on the age). I think OP does have an obligation to see if others in the family want to get in touch. OP doesn't know how the rest of the family feels about the situation, and it's not OP's place to make a decision for them.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 604,
      "content": "NTA, this seems to becoming up a lot recently but just because a kid is \"biologically' a sperm donor's doesn't mean they are a part of that family. Either genetics counts or it doesn't but in every other context (adoption, men raising kids that aren't theirs etc.) we as a society decided it doesnt so that applies here. I feel bad for the kid but his family are the people that raised him, not some dude who jerked it into a cup for some cash in college.",
      "id": 73,
      "comments": [
        {
          "score": 554,
          "content": "> I feel bad for the kid but his family are the people that raised him, not some dude who jerked it into a cup for some cash in college.\n\nThis is basically my view on the matter. We are not his family in my eyes, the people who chose to have a kid via sperm donation and then raised him are his family.",
          "id": 74,
          "comments": [
            {
              "score": 103,
              "content": "This!!  His mother needs to field his questions and set him straight.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -40,
          "content": ">but in every other context (adoption, men raising kids that aren't theirs etc.) we as a society decided it doesnt so that applies here.\n\nIn every other context? \n\n\nHow about when you try to have a bio kid as opposed to adoption/fostering? When you don't want to use sperm/egg donation when it turns out your sperm/egg is the problem? When you spend thousands on IVF or a surrogate? When your girlfriend cheats and the kid isn't yours? (yeah I know you mentioned it but I disagree that that's always the same answer)\n\n\nWe do have one way of deciding these things, one thing you are also demonstrating and that's: the kids opinion doesn't matter, only what the parents wanted matters. Whether that's genes > raised or raised > genes, parents choice.",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 400,
      "content": "NTA and I think these DNA tests are really messing up the whole thing of donating sperm/eggs. You should be able to donate completely anonymously.",
      "id": 77,
      "comments": [
        {
          "score": 176,
          "content": "Yep, but the offspring can choose to undergo DNA testing, and your third uncle twice removed could also take a test, and poof! There’s the start of tracking down a donor. \n\nWe pretty much need to accept that anonymity in this regard has virtually evaporated. Anyone operating under the guise of it is kidding themselves these days. You very nearly need to accept its inevitability if you adopt, donate, etc. It’s quite unfortunate, in some ways.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "You’re more right than you know: there’s a worldwide donor shortage for this exact reason.",
          "id": 79,
          "comments": [
            {
              "score": -52,
              "content": "This is false.",
              "id": 80,
              "comments": [
                {
                  "score": 55,
                  "content": "My best friend is going through the process right now…it’s not false.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": ">You should be able to donate completely anonymously.\n\nSpeaking as an egg donor, no, you really shouldn't. It's easy for people who aren't donor-conceived to wax poetic about how the recipients are the \"real\" parents, DNA means nothing, blah blah blah. Meanwhile these children conceived via egg and sperm (or embryo) donation are growing up being lied to for much of their lives, wondering why they don't really seem to fit in with their family, getting a nasty shock when they finally learn the truth about where half (or all) of their genetics come from, and then having the door slammed in their face because the anonymous donor wants nothing to do with them. The donor's anonymity was agreed on in the contract between the donor and the recipients, where the donor benefited by getting money and the recipients benefited by getting a baby. What does the child get? They weren't present when those agreements were made and they're not obligated to follow them. Seeking out their biological family doesn't make them an asshole, and they should have the right to know the donor's identity. Anonymous donation is very much a thing of the past and in my opinion (and that of practically all of the donor-conceived adults I've spoken to), that's a great thing.",
          "id": 82,
          "comments": [
            {
              "score": 86,
              "content": "As someone who was adopted anonymously, my opinion is almost but not quite the opposite of yours.\n\nI agree that someone trying to find out about their genetic heritage isn't an asshole, but, I do *not* agree that they have a *right* to know the donor's identity.\n\nI like the way 23-and-Me handles this, where people can opt in or opt out of the \"identify relatives\" feature.  If both parties are open to it, the connection happens, but if one isn't, it doesn't.  That's how, late in life, I *did* eventually get in touch with my birth mother.  It would have been no disaster if that hadn't ever come about.\n\nEDIT: And for the record, there don't have to be any lies when a child is raised among a family that's not their biological one.  That doesn't come from the adoption or donation, that comes from the unreasonable *stigma against* those things.  I've always known I was adopted, for as long as I could talk.  Certainly before pre-school.  Likewise with my sister.  There was never any attempt to be even slightly deceptive about it, and they'd even tell us stories about the process of getting us.",
              "id": 83,
              "comments": [
                {
                  "score": 13,
                  "content": "I don't have much knowledge on this subject, but if let's say I'm a donor and my cousin does a DNA test and leaves it open, won't it create a familial match? So where the donor wants to remain anonymous if a member of their family does it, would they be matched with the family member?",
                  "id": 84,
                  "comments": [
                    {
                      "score": 14,
                      "content": "That's true.  A *blood relative* of one of the people involved can deliberately screw up the anonymity.  But the service won't screw it up for them itself, and, if *neither* party wants to contact the other, nobody can mess that up.\n\nBasically, the service itself will only connect the dots between parties that want to.  Sometimes those parties themselves don't respect that kind of thing.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Professional genetic genealogists and some amateurs can determine parentage even with distant cousin matches. It’s how they found the golden state killer",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -6,
                  "content": "Personally I think every one should be registered in a global genetic database from birth with no opt out.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Today, that would cause more problems than it would solve.\n\nI'd like to live in a world where that wasn't true anymore, though.\n\nEDIT: Shorter-term, I'd like easy to use fully at-home (no service involved) full genome sequencing kits, coupled with purely at-home (no service involved) analysis software that could point out stuff like \"this person has increased risk of so-and-so condition\" or \"these two people would be at risk of producing a child with such-and-such problem\".  That'd get you a bunch of the benefits of a system like that without some of the problems we can't easily solve in today's world.  It's still pretty far off, though.  (I'll admit I've started to look into building that software, as part of my dabbling in bioinformatics.)",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "[deleted]",
              "id": 89,
              "comments": [
                {
                  "score": 7,
                  "content": "I'm using a sperm donor and will start telling my child about the donor at a young age.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Then this will have a chilling effect on donations,  which is what was previously mentioned.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "Whether you \"should\" be able to donate (or adopt) anonymously or not, the fact is that it is no longer possible. People have figured out who their donors are by finding a few second cousins, doing a little sleuthing, and putting the pieces together.   \nAnd by not knowing, you could inadvertently marry a half sibling.   \n\n\nAnyhow, my vote is, OP, YTA. You don't have to have any contact with this kid, but that doesn't mean you should be a dick to him. It's not his fault you share genes. Apologize and then politely say you don't want further contact. But maybe some other blood relative will.",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 175,
      "content": "I’m gonna say NTA, although you are being kind of a dick about it. You don’t have any familial obligation to him other than medical history stuff because he does have a right to know that. But you were a bit of a dick in the whole situation although I understand taking the defensive stance with him which honestly was the right thing to do. I also want to address what some “YTA people” have cited for their reasons, and you DO NOT have an obligation to put him in contact with the rest of your family; regardless extended family or what their personal beliefs might be. He was never intended to be part of your family in any sense and nothing changes that, so all those people can go get fucked. If you want to appease any of those people for any reason then just point adult family members social medias to this guy and say go through there, so there is a safety barrier and they have the ability to make a decision to shut him out or let him in or pursue a relationship. But you do not have a responsibility, obligation or any sort of reason to do that. Like I said, he was never intended to be a part of your family; extended or otherwise and nothing changes that",
      "id": 93,
      "comments": [
        {
          "score": -19,
          "content": "\"Intended to be\" is such a bizarre argument to make. OP's brother might not have intended for his biological children to want to have a relationship with his family, but donor parents don't actually get to make those choices for their donor children and other relatives.",
          "id": 94,
          "comments": [
            {
              "score": 41,
              "content": "Yeah they don’t have a choice in that but that’s not what I was talking about. People are acting like just because he is biologically related to OP OP has an obligation to them. OP has no obligation to make that relationship happen or to facilitate relationships with OP’s actually family members. This isn’t a case of an accidental pregnancy from a one night stand, the only thing blood should guarantee in this situation is the medical information. Otherwise OP’s brother’s sperm-donation-kid is not a part of OP family",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That could be a way of stopping donations, I would think",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 108,
      "content": "NAH but I don't really believe you when you say \"I don't care about IVF or donations and all that\" but you just don't seem to care until they relate directly to you. \"Spawn\" and other terms are pretty callous towards someone who you admit is going through an identity crisis (I assume you didn't call him that to his face, but it does kinda show you think of him lesser than a natural born birth).\n\nYou have very reasonable reasons to not want to have a relationship with someone you don't know, but you kinda talk about it in the most condescending tone I've seen about it? Why so vitriolic about it. So you're NTA for the situation but you sure talk like one.",
      "id": 97,
      "comments": [
        {
          "score": 11,
          "content": "Fair summary.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 85,
      "content": "NTA for not wanting a relationship, but YTA for how you handled things.\n\nIf you had zero interest in a relationship with Jake, you probably shouldn't have agreed to meet with him. It definitely sends the wrong message, and telling him to his face that you and zero of your family will ever have a relationship with him is pretty harsh. You could have just sent him medical info over email and let him know you prefer not to meet - generally you made this much harsher than it ever needed to be.\n\nSecondly - do you speak for your entire family? Of course you don't need to have a relationship with Jake, but some of your extended family very well may be interested in meeting him. It doesn't seem at all like you gave the rest of your family that choice.\n\nBased on the way you describe the situation, it does sound like you made no effort to be friendly or mince your words, so I'd say your wife's & friend's view on the situation is probably correct. You should ask your family if they want contact, pass along his personal contact info, and just personally block him rather than threaten him with a restraining order.",
      "id": 99,
      "comments": [
        {
          "score": 36,
          "content": "Honestly the rest of the family hadn't even occurred to me and it seems like it didn't occur to a lot of people here - i'd love for OP to answer this to confirm whether or not the rest of the family was informed about Jake. I find it really hard to believe that every single person in this family share's OP's view. \n\nAnd yeah, it's so strange how OP seems to be taking out all this hatred/resentment of their brother on Jake. I don't think this really has anything to do with the circumstance in which Jake was conceived, rather I think they just hate this guy for being their brother's \"spawn\" (what a shitty term to use for a HUMAN BEING). I think even if Jake was the result of a one night stand, OP would've done the same thing. And if not, that's still kind of shitty to me personally. Like, yeah, you're not obligated to treat him like family, but when a child is looking for some sort of connection to their biological family and you shun them because of your own biases or prejudices, whether that's a bias against sperm donation or a bias against your brother, it's still not something to be proud of. He's not asking OP to adopt him ffs",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 80,
      "content": "I feel bad for Jake but this isn’t really your problem. NTA.",
      "id": 101,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 59,
      "content": "NTA for how you feel.  And NTA for going no contact with any relative, sperm donated or not, that you feel is harassing you.  I feel sorry for the kid, but he's clearly not going about creating a relationship with family the right way by badgering and insulting you.",
      "id": 102,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "[deleted]",
      "id": 103,
      "comments": [
        {
          "score": 1,
          "content": "Ibbligations lmaoo",
          "id": 104,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}