{
  "post content": "I’m 23M. I’ve known I was adopted all along. For whatever reason I became obsessed with learning more about my birth parents at age 13. I was told all my life that my parents met both of my birth parents before I was officially adopted. My mom was white from South America and my dad was white from Italy. They specified these two locations to explain why I had tan skin.\n\nAs I was growing up certain things about my physical makeup made me more curious about my birth parents. My hair was kept short as a kid but as a teen I wanted to experiment. I grew it out and it grew out curly. Big curls but still curly. This upset my parents so they asked that I not grow it out. When I moved away for college I began to let it grow again. I met my girlfriend in school. She is Black American so she also helped me care for it. She once braided my hair before I FaceTimed my parents who lost it on me for wearing it that way. \n\nThroughout my time in school I still searched for my birth mom but would always come up empty. My girlfriend hinted that there must’ve been a mistake with the information, even down to the name my parents claimed I had before they adopted me. She gifted me a DNA kit on my birthday that I didn’t get around to until the lockdown hit. I didn’t think anything would come of it because my parents weren’t American so I didn’t know if it would work that way. So I sent it out of boredom and got my results weeks later which have changed everything.\n\nI’m Black and Middle Eastern. I have light skin and my curl pattern is so loose that I hadn’t considered it a sign before. I have ancestral ties to Iran which can explain a more “European” facial structure. I’m sorry for my wording, I’m still learning. I sent my gf a screenshot and she called me right away. We were both stunned though she long suspected. I tried to believe that my parents were innocently misinformed but my girlfriend kept pointing out the inconsistencies. My parents claimed to have met my birth parents therefore they couldn’t have mistaken them for white. \n\nI confronted my parents who became enraged at me for doing a DNA kit. I was very angry, yelling, swearing. They robbed me of my identity and hindered my search with their lies. My mom told me through tears that my racial background comes with a stigma. That I passed so she wanted me to have an easier life fitting in. My dad yelled at me that I had to abandon what I just learned. I rage broke my phone and left. My siblings have been hitting me up on social media reprimanding me for being upset because our parents reasoning is sound. I do pass, I did have an easy life. I’m not asking to be part of a struggle all of a sudden. I just don’t think I should’ve been lied to and I think they’re reasoning is bullshit and racist. I’m just supposed to act like 10 years of me searching with the wrong info isn’t that big of a deal?\n\nEdit: \n\nThere’s no way I can respond to all of you. Some answers:\n\nDNA kits can be wrong/Parents can be White South Africans:\n\nMy parents admit that my mom was black. My oldest sister also recalls seeing my mom at some point. Both verify that she was black. Yes they could be lying again. I have plans to continue to look into my background.\n\nYTA for having a temper/breaking your phone:\n\nOkay, that’s fair. Someone was shocked that I could break my phone. I threw it. I didn’t break it with my bare hands. I walked out and threw it out of anger and it shattered. \n\nHow do your parents treat your girlfriend:\n\nThey tried to treat her poorly. They were okay at first but eventually some comments were made that caused me to put some distance between us. My girlfriend was very hurt by their statements so I chose to keep us both away from them. \n\nClaims that I’m race baiting: \n\nI don’t understand how. I’m angry about being lied to and how that lie has made my effort into finding my birth parents completely void while also rewriting my heritage. \n\nYou likely didn’t pass to other POC: \n\nThat’s my girlfriends stance as well. I’m tan enough that going to an all white school still got me called slurs. Whatever issues my parents were trying to shield me from it didn’t work. Maybe this is a lie that I bought into alone.\n\nThe current state of my relationship with my family:\n\nIt’s chaos. Two of my siblings are trying to be supportive. I deactivated my Facebook and unfollowed some people on Instagram. I can’t entertain the argument that I should forgive my parents and move on. I’m not there yet. I get that it makes me ungrateful for feeling this way.\n\nFor those who asked about my hair lol. They are big curls? My girlfriend says they are 2c/3a. My hair texture is not unique to any race group but drastically different from my family’s. \n\nFor those of you who are pming me slurs and telling me to go back to my shit hole country, thanks a lot. \n\nI appreciate your support. I appreciate those of you who shared your personal experiences with adoption and race with me, for giving me resources, books, and documentary suggestions, for welcoming me into your groups and giving me some kind words. I’m overwhelmed by your support. I’ve written down a lot of those recommendations. I’m still reading everything you guys have written as well. I appreciate the kind comments about my parents as well. I don’t hate them, I’m just really upset and disappointed in their decisions.",
  "id": 1,
  "comments": [
    {
      "score": 14500,
      "content": "NTA  You have the right to know information about yourself and your background.  Your parents may have had good intentions, but they went about it in a really terrible way.  Not only have they lied to you for your whole life, they then got pissed at you when you learned the truth--a truth you wouldn't have had to go looking for if they hadn't lied.  \n\nEven if they were worried about the \"stigma,\" they should have at least told you and let you choose if you wanted to embrace your background or not.  Them getting mad at you makes it seem like they are more worried about how the \"stigma\" of your background reflects on them, rather than worrying just about you.",
      "id": 2,
      "comments": [
        {
          "score": 7188,
          "content": ">Them getting mad at you makes it seem like they are more worried about how the \"stigma\" of your background reflects on them, rather than worrying just about you.\n\nThey weren't protecting OP by lying, they were protecting themselves. You hit the racist nail right on the head. Sorry OP.",
          "id": 3,
          "comments": [
            {
              "score": 306,
              "content": "EDIT: My better explanation is in this comment... https://old.reddit.com/r/AmItheAsshole/comments/hmyyq4/aita_for_being_angry_at_my_family_for_lying_about/fx9qg5a/\n\n_____\n\nI dont think OP's parents are racist in the sense that they treat people of color different, but rather racist in the sense that they dont want to be judged for adopting a baby of color, or to have him held back by current oppression. It's entirely possible they are angry because they are scared he will lose the advantages he had thinking he was white.\n\nTo further explain: I dont think it'd be fair to say they treat people differently based on race, but I think they **judge** them differently. \n\nRacism is racism, but what I'm saying is that they adopted OP and loved OP and are, in their own way, hurt by this as is OP. They don't hate OP for being black, they didn't want to *not* adopt him for being black. They don't hate black people, they view them differently though. Not enough to hinder their progress, but enough that they aren't making any personally, and feel they'd be judged for adopting OP.\n\nBoth are bad, but at least they don't overtly hate people of color and are willing to help people of color, in their own, fucked up white-ashing kind of way. Still, I'm just sad they took that route... Poor OP man... \n\nRegardless of all this, OP is NTA. The parents are TA, and OP now gets to really dive into a full, rich history and learn all new things, which is exciting.",
              "id": 4,
              "comments": [
                {
                  "score": 916,
                  "content": "I think you're drastically underplaying the severity of passive racism. Being silent & complacent is still a HORRIBLE form of racism. They are 100% complacent with systemic racism. They are perfectly happy being part of the problem, being a part of the system that keeps people like OP's birthparents oppressed. He has every right to feel **extremely** personally attacked by the measures they have taken to keep him ignorant; many people would cut their parents off forever for something this serious if they don't pull a complete 180° *immediately*. I don't know how they could ever redeem themselves in his eyes. I can barely imagine feeling such deep, crippling shame for my adoptive parents.\n\n(I am adopted too BTW)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 408,
                      "content": "I’ve adopted 4 beautiful kids, all different mixed racial backgrounds. Though my kids are younger, I can safely say that even 23 years ago, OP’s parents had the resources to learn that lying to their kid was wrong. Any decent adoption agency would have educated them about this to some extent. And if not, they’ve had many years to educate themselves in order to raise their child with a healthy self-image. They actively chose this lie, which seems to go beyond passive racism (though that alone would be bad enough).\n\nWhen we chose to adopt transracially, we became a family of color, with all the joy and responsibility and hurdles that come with it. Simple as that. If someone isn’t willing to embrace their child’s culture and celebrate it, then transracial adoption is just not the right choice for them.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I'm not saying OP should forgive or even talk to them, I'm saying that what they did **is racist**, but it's entirely possible they had the \"best intentions\" at heart and did some fucked up shit. Their anger could pheasbly be them becoming mad they tried so hard to cover his history and now he is putting himself in danger of \"losing his advantages,\" and we will never know.\n\nKind of in the same way Nazi Germany was. Hitler did terrible shit, killed millions, and was one of the most fucked up people ever. However, reading history, he did it because in his odd, fucked up head he was trying to \"save Germany\" or whatever crazy shit he used to rationalize it. I am 100% not saying he is a hero, or that he needs sympathy, I am just pointing out that according to *him,* he was doing it for Germany and willing to take the heat for all the murder. Some \"Movie villain that is a villain for trying to do whats right in a gruesome fashion\" mindset stuff. It sounds like his parents were more \"mentally delusional\" racist, rather than straight laced racist.\n\nI'm not saying OP's parents are correct in what they are doing, or that they shouldn't be reprimanded. I am simply saying they may have this complex where they thought they were going to do something \"good\" at the sacrifice of their own image to help OP get advantages he wouldn't have otherwise.\n\nPeople respond really oddly, rage, sadness, confusion, when their entire reality is challenged. I think that his parents are just not in their right of mind, and if you pair that with 60's mentality you get a bad combo that thinks it's great. \n\nThat's all...",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This. I forget who said this, but being not racist isn't *enough*. It's not enough to not be actively racist - you *have* to call racism out when you see it, you *have* to actively fight against it, because when you stay silent you're *accepting* racism as valid. And that causes even more harm. Anyone out there who just stays silent in the face of racism - they are part of the problem.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 217,
                  "content": "What are you talking about, they lied to their adopted child about his own ethnical identity and tried everything to pass him off as white, trying to erase any hint of his blackness. If they respected black people they wouldn't try to erase his blackness, that's literally racist **as fuck**.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "Racists can have black friends and racists can raise non white children. This has happened many times before, from the slave era, on up through to the present day. Remember those white lesbians who were raising a bunch of black kids (until CPS was going to take them away, then they drove them all off a cliff in a murder/suicide)? Racism doesn't prevent you using a non white child as an emotional salve. It does however prevent you showing pride in that child's heritage and letting them take pride in their heritage as well. \nBy your logic, the people who historically stole Native American children weren't racist since they raised the children they stole and paid for their educations.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 22,
                      "content": "> Remember those white lesbians who were raising a bunch of black kids (until CPS was going to take them away, then they drove them all off a cliff in a murder/suicide)?\n\nThe. What.\n\nI never heard about this.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 87,
                  "content": "I think it could be related more to the 60s scoop. White family’s adopted First Nations children (forcibly removed from their homes) to remove them from their culture. You think those parents wernt racist and in on the destruction of indigenous culture? \n\nParticularly being as they got mad at him for trying new hairstyles that would have been more based in his actual heritage and not the fabricated one that tried to erase his background.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 45,
                      "content": "This is an EXCELLENT point. That’s exactly what it’s like. they are racist at their core. and they robbed this boy of his heritage for all of his childhood. Thanks to modern technology he’s able now to reclaim it.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "The same happened (and still happens in some European countries) to us Roma. In England the Catholics and Protestants both had fake adoption agencies (1911-1970). A team of blokes would steal the kids, take them t the agencies, the Catholics would adopt the kids out to white English families, the Protestants would ship them off to Australia and [Canada](https://www.travellerstimes.org.uk/news/2018/03/children-forcibly-migrated-state-should-get-compensation-says-inquiry-historic-abuse) by the thousands to work on farms, get adopted to ‘good white Christian families’ etc.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "> but rather racist in the sense that they dont want to be judged for adopting a baby of color.\n\nThat's treating people of color differently.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "I’m not a transracial adoptee, but I am biracial and raised by a white mother. It took me awhile to realize it but this is a very harmful and racist thing to do. They probably didn’t want to have a black baby. My mother views me as white and any acknowledgement of that not really being true makes her angry. She still sees me as white. She still treated people of color differently, you cannot judge someone differently and not treat them differently. Maybe her parents are not shooting people or insulting them, but they likely are treating people differently. Even if that just means avoiding them, and perceiving them as criminals or as less in some way. It’s still racist and harmful, OP likely didn’t escape subtly racist ideas growing up. \n\nOP is NTA and yes having a rich history to look into can be exciting it’s bound to involve mixed feelings and overcoming unknown biases. OP parents are racist.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 20,
                      "content": "When I was a kid and learning about family history and the “1 drop of blood rule” and so forth in school, I asked my mom if having a little Native American blood meant I was technically biracial. (Note: I do not and would never identify as biracial esp as an adult—I was a child who was trying to figure out what the “rules” were about race etc). She snapped, “WHAT? NO!” and seemed super pissed and uncomfortable. Even as a kid, I remember thinking, wow that’s not a great look. That might’ve been the first time I noticed my mom’s casual racism.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "[deleted]",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "That's a hell of a lot of speculation on your part to their benefit. They whitewashed their own kid- it's beyond fucked up, and definitely racist.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "This is a WHOLE lotta excuse-making for racism.\n\nMaybe just... don't?",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I think you underestimate their racism.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Disagree with your views on this. Just because they adopted a child who is of color doesn't mean they are not racists. They can love OP but still hate the race which clearly seems to be true in this case. Judging people differently because of race IS treating people differently. One cannot be distinguished from another. They are ashamed of his race and would rather hide it from him by lying to him all his life, despite knowing how much he wanted to learn the truth. That is not love. Their reasons for lying to him seem self serving.   By trying to distinguish their racism you are trying to give justification for what they did when in fact they are simply racists.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Hopping onto this comment to say the same thing. They were protecting themselves of all the stigmas that come with having mixed children. I am biracial, my mom and stepfather are white and for years they tried to convince me I’m white as well so that I would stop focusing on what made me “different”.\n\nI am sorry OP. This isn’t an easy thing.",
              "id": 23,
              "comments": [
                {
                  "score": 18,
                  "content": "yes...people have a right to choose for themselves what race they identify with.  Both of my kids are half white (from me) and half hispanic (first husband).  They both *choose* to label themselves as hispanic, and they embrace both sides of their culture.  I've never cared either way, why would I.  Even though they caught some shit in our somewhat backwoods southern town that we moved to when they were teenagers.  I think it made them a bit stronger, and it definitely bonded them together better.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 25,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thanks mom",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1382,
          "content": "I'm not trying to make assumptions here, but the way they reacted to you wearing your hair a certain way and the fact that they insist you unlearn what you know, makes it seem like they are more ashamed of the stigma associated with your race than anyone else. \n\nYou have a right to know your heritage and if they have your best interests at heart, they can help you embrace and understand the struggles of your identity. Ignorance isn't going to magically fix anything.",
          "id": 27,
          "comments": [
            {
              "score": 465,
              "content": "INFO: Speaking of heritage since they told you you were Italian did they ever try to connect you with your Italian heritage? If so that's an even more damning because they were comfortable with you learning and identifying with a white heritage that isn't yours but not with the Black and Middle Eastern heritage that actually is yours. This is deeply fucked up and I am so sorry this happened to you. You should really find a culturally competent therapist to help guide you through this.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 298,
              "content": "They are ashamed.  They've also lived their whole lives in this lie...all their friends and family.  This coming out will make them look really bad.",
              "id": 29,
              "comments": [
                {
                  "score": 157,
                  "content": "I'm not saying this for an argument it's just a point that popped into my head; if the OP parents were ashamed of having a non-white kid, why would they adopt that kid in the first place?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 269,
                      "content": "It's often easier for parents to adopt non-white vs white children, there're more non-white children in the system than white children and often those who have the means to adopt happen to be white, so, there's a higher demand, and thus more expense, in adopting a white child.     \n      \nVery possible parents here couldn't easily get a white kid so opted for one that was as near white as possible, to use their (and OPs words), to \"pass\" as white.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": ">I'm not saying this for an argument it's just a point that popped into my head; if the OP parents were ashamed of having a non-white kid, why would they adopt that kid in the first place?\n\nBeing racist doesn't mean you hate others of a different race. It means you consider them inferior.\n\nPeople consider dogs inferior but will still adopt a rescue dog. It makes them feel noble and charitable. Adopting a child from another race can, in rare occasion, have the same motivation.\n\nIt doesn't make you less of a racist. It does perhaps you you are a good person in other ways but many \"good people\" are also racist.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Well he still looks white. Can pass as white. Then they can ignore the fact that he has black (and probably wanted to forget middle eastern heritage as well). The minute he started showing his “blackness” they didn’t like it. Also, I think the post about the 60s scoop is an excellent reference, all these white families took on these First Nations children to work on their farms and they stripped those kids of their language, culture and heritage. \n\nYou don’t do that to a child if you don’t think “white” is better.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Dear friend of mine adopted 5 or so years ago. He and his wife got the call near midnight (baby was being born). \n\nHe never, ever, ever expected it to be the adoption attorney. They were #20 or so on his list, and had been told it could take **years**. The attorney asked if they were interested in a baby about to be born, he screamed \"Yes!!!\" woke his wife, \"You're a momma!!! I'm a daddy!!!\"\n\n\"Wait, wait, wait...the baby is definitely *half* brown (mom is Hispanic) but the father's ethnicity is unknown. Are you still interested?\"\n\nLike the kid was a mutt dog at the pound. (Was my horrified thought)\n\nHe was puzzled for a bit, and remembers thinking \"This has to be a prank...\" because no one gets an adoption attorney and six months later gets to adopt a newborn. \n\nNo one else in front of them wanted the baby because of the ethnicity. Double digit couples who just \"want to complete\" their family, didn't want to complete it with a perfectly healthy *brown* baby.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Assuming that their friends and family are also racist AH's.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 6,
                      "content": "No, sorry, I meant the lie to their friends and family would be exposed, not that those groups are specifically racist, my apologies for the confusion.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Or they are afraid the poster will get attacked just for the race.",
              "id": 37,
              "comments": [
                {
                  "score": 43,
                  "content": "OP is 23, it’s very likely he was adopted around when 9/11 happened. This doesn’t excuse the parents’ actions, but it may help explain their thought process. They didn’t want their son labeled as a “terrorist”. It’s fucked up, but that may be part of it.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 37,
                      "content": "But OP passes as white and was raised by white parents, so I don’t see how the chance of him being attacked increases just by him being aware of his race.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I don't even think OP's parent's reasoning makes sense- they didn't want him to deal with stigma? How does knowing your racial background automatically give you stigma? There isn't going to be a sign on your forehead that says \"I'M BLACK\" in big bold letters. They didn't want to admit to themselves that their child was black. That's all.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 459,
          "content": ">Even if they were worried about the \"stigma,\" they should have at least told you and let you choose if you wanted to embrace your background or not.\n\nPrecisely. I can imagine if they adopted him as a baby, they possibly even didn't set out to lie about his heritage. But as he aged out of toddlerhood, that was right as America was going through 9/11, and it just so happened that OP could \"pass.\" It might've started out as a white lie (forgive the pun) so that he wouldn't tell everyone in school he was \"from Iran\" (kids can be real assholes at that age to anyone who's different, and ppl were no kidding getting bullied for being middle eastern at that time pretty badly). Then over time, it might've just become a bigger secret as in, how can we tell him we lied the whole time?\n\nNTA, OP and your parents need to apologize for keeping this from you after you were old enough to know what to do with this info (ie, 13 or so when you got interested in it).",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "This.  NTA",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "The road to hell is paved with good intentions.    \n\n\nBut yea they really went about it wrong for sure, makes it seem like they were insecure about it for which ever reason.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I agree; and I want to add another level of Gaslighting/fucked up here- genetically, because of OP's ethnic background, medically OP should take some medications and avoid others. There are some malarial medicines (primaquine) are to be avoided if you're middle eastern and/or African; and some other blood pressure medicines are of the same issue- black individuals don't react well with them, and could prevent OP from being healthy.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly could not of said it better",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Thanks for saying it better than I could NTA",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "every thing I wanted to say, you said, and you said it better than I would have been able to say it.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "To add to this, if you needed this info for anything medical it could have fucked up the doctors process of finding out what was wrong with you",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4735,
      "content": "NTA.  That was racist of them.  There’s nothing wrong with knowing your race and ethnic makeup, even if you are adopted.",
      "id": 49,
      "comments": [
        {
          "score": 2200,
          "content": "NTA.\n\nAlso, to point out, if you \"pass\" as white, knowing your heritage wouldn't change that! You would still look white to anyone who thought you looked white before. It isn't like we give our entire family history everytime we look at someone.\n\nYour parents wanted to adopt a baby, they wanted a white baby. They couldn't get one exactly, but you were close enough, so they just lied. I'm really sorry, but I genuinely believe there is some racists motives behind your parents actions.\n\nNow you know, and eventually you can decide how you want to handle your parents. For now, focus on you though, and give them some space.",
          "id": 50,
          "comments": [
            {
              "score": 564,
              "content": "Clearly she doesn’t pass well enough that she could wear her natural hair without them freaking out. They controlled her appearance all her life to make her chances of passing higher, and gave her a fake background to explain her dark skin. As a light skinned mixed woman who was told all my life by fellow POC that I passed, I found out how untrue that was the minute I actually entered white spaces. Like OP I can maybe convince people if I straighten my hair and claim Southern European ancestry, but hair and skin together, I’m not fooling anybody (or trying FYI). They knew she wouldn’t pass for white with her natural appearance and tried to alter it to make it so, lying to her in the process. That’s super shitty.",
              "id": 51,
              "comments": [
                {
                  "score": 349,
                  "content": "It's a he.\n\nBut I get your point!\n\nI think it is really crappy all around for the parents to do this.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 216,
                  "content": "What's funny is that my ancestry is what the OP's parents claimed and I don't quite pass for white. Most people usually think including Hispanics, think I'm Middle Eastern. While there are a lot of people in Italy who look like me, most Americans assume Middle Eastern, and especially Iranian.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 143,
                      "content": "Genetics are wild. I had a friend growing up who was half Italian and half Mexican. Her dad has fairish skin, but his mom had a darker complexion and both parents immigrated from Italy. Her mom has an olive complexion. Her mom's parents were also immigrants from Mexico; I met my friend's abuela a couple times, she reminds me of Miguel's abuela from the movie Coco. \n\nYou would expect my friend with that genetic background to have a tan complexion right? Nope. She is as pale as the moon. She does develop a tan in the summer though.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Yeah, my ancestry is similar to what OPs parents claimed (Mexican rather than SA) and I have tan, but light, skin and similar hair to what OP describes. I'm pretty ethnically ambiguous and I have often had people mistake me for Middle Eastern. I rarely get pegged as 'white'.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "I am Italian. My American friends says i would be considered white while my sister, dark skinned very curly black-hair, would be considered black. We are both considered italian in italy. it is rather wild.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 10,
                      "content": "America is weird like that. Despite my grandparents being right off the boat from Italy I'm still just another white girl in America. What can ya do.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "This is what's crazy to me, getting actively angry at OP for growing their hair out and the parents trying to suppress OPs blackness",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I will add that plenty of us Italian people, especially in  Southern Italy, have curly hair and the range of skin colour changes from person to person and even on the same person depending on the season. I for once have curly hair and I'm ghost pale during winter months and super tanned during summer despite using UV protection religiously (just for health reasons not to avoid  tanning) \n\nI really don't understand OP's parents despicable behaviour. NTA",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "This. I am white, I haven't had to experience racism myself so I may be wrong, but surely it's not about your knowledge of your race but more about whether or not you look a certain way that creates a stigma and lets people treat you differently. Like....OP could have been convinced he's white and still gotten passed over for being too tan, or known full well what their ethnic make up is and still experience white privilege for 'passing'. What the parents did wouldn't actually make a difference other than screwing up OP's sense of identity.",
              "id": 60,
              "comments": [
                {
                  "score": 83,
                  "content": "> but surely it's not about your knowledge of your race but more about whether or not you look a certain way that creates a stigma and lets people treat you differently. L\n\nIt depends.  Among strangers, no, you won't face any stigma. If you are white-passing, people generally treat you like you're white.\n\nUntil you tell them otherwise.\n\nI have a cousin who is black (his mom is black) but he is white-passing.  He was in a fraternity when he was in college and everyone thought he was a helluva guy.  It came out somehow that he's black and suddenly everyone started treating him differently--giving him the cold shoulder and treating him \"unbrotherly\". Mind you, he never lied about his background.  He just didn't announce it with a bullhorn.  \n\nSo some people do act funny when they find out what your ancestry is.  That's how awful racism is.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I can relate. I look very white with pale skin and red hair. But legally I’m black. It’s on my birth certificate. Because my state has the one drop rule. If you have a drop of black in you then you’re black. And my dad is black but genetics are funny and I look pure Irish. \n\nMy mom initially put “father unknown” on my birth certificate so the government wouldn’t classify me as black. And since my dad wasn’t around, she intended to keep it a secret forever I guess. But when I was 12 my dad came back into my life, and so then the cat was out of the bag. At the time when she told me she said to keep it a secret because if ppl knew they’d treat me differently. \n\nI was like whatever. I’m gonna tell all my friends about this very weird thing I never knew. Over the years I’ve learned she was right though, and now I’m very cautious about who I tell.\n\nIt’s been a mixed (ha!) bag of responses. Some are accepting, tickled, or say they always secretly knew because of my XYZ feature. A past boyfriend was like oh cool! Well let’s never tell my parents because they wouldn’t like you then. But then others become hatefully racist to me. (Now I have to be super confident a white person isn’t a total racist before I’ll say anything.) At the same time, I would say I’m most reluctant to tell a black person about it. That’s just such a loaded situation. Because in no way do I seem black, so it’s been met with derision before. I actually find that way more stressful than a white racist.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Thank you for clarifying, that is a really useful addition.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "This. I had a friend who is Cuban. She is 2nd generation cuban american and really fair skin, I'm talking about sunshine through the rain would burn her. . .  Her hair is super curly. . . I thought she was Italian when I first met her. Anyway, she is white passing. It was cringey when we would hang with her friends, who are white and how they looked at her when she would break out into speaking Spanish in public. One girl actually said to her, \"honey you don't always need to speak that way when we are out\". . . She and I had a talk about how wrong this was. She understood, but she enjoyed the upside of the treatment she received as white passing. . . But the microaggressions she put up with were awful. I'm black and when her other friends realized that we were actually like best friends, they stopped inviting her, iced her out. . . She eventually told me that she never had her friends over to her house because she didn't want them to know she wasn't white, she is the lightest person in her immediate family. . . It was heartbreaking.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m white but I’m adopted so I understand wanting to know where you come from in that sense. I know I felt with being adopted I’ve lost a part of my identity. I can’t even imagine the anger I’d have at my parents if they lied to me about what they knew. \n\n\nI don’t care if he parents were trying to ‘protect’ him or were acting on racist tendencies. I don’t see any good reason to purposely lie. He deserved to know the only bit of personal history that was available to him. He didn’t need protecting from himself because that’s what his family lied about - who he is. He needed the truth and a supportive family.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Agreed NTA. It could also impact future medical or other health related issues. You deserve to know who and what you are. They should respect you enough to tell you the truth.\nEdit: Genetics are not based on whether you are American or not but your DNA. Considering the variety of people in America and how genetics work I'm not sure how that logic works either way. But again NTA.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3292,
      "content": "\"My mom told me through tears that my racial background comes with a stigma.\" \n\nYeah, which your parents upheld!!!!!! They robbed you of your identity. \n\nNTA. Grow out your hair if you want to. They wanted to keep a cookie cut mold of you so no one would know.",
      "id": 67,
      "comments": [
        {
          "score": 382,
          "content": "This is the thing about stigma! It cannot be navigated on someone's behalf!\n\nI struggle with pretty bad anxiety. And I would be pissed if anyone, no matter how much they cared about me, tried to navigate the stigma of mental health on my behalf. It's not their stigma to bear, it's mine (and OP's). \n\nOP is right to be pissed, absolutely. Being robbed of a cultural narrative like that, I cannot fathom. Learn Farsi or something to rub it in.",
          "id": 68,
          "comments": [
            {
              "score": 68,
              "content": "Also anyone who sees that as a stigma is, to my  mind, only putting a sign on their forehead that says, “I’m not worth getting to know or having in your life.” Unfortunately, OP has the stigma now of having racist parents, so he’s going to have to decide how he wants to handle that.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "They say that it's the best time to learn a language while a child is still young. Even if he learned his biological parents' languages, he's been robbed of the opportunity of learning his cultures with supportive parents. It's never going to be what it should've been and that's an evil the world should not know.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My mom denied me my hispanic heritage because of what she went through growing up.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Plus it's not like OP doesn't have to deal with any stigma if he doesn't know what his identity is. Racists aren't going to ask you what his exact identify is, they'll just treat him badly based on how he looks. They just robbed him of being able to relate to others of your ethnicity who might have the same issues.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Can someone explain to me how adoptions usually work? Did they not *know* the identity of the parents well before saying yes to adoption? Or is it genuinely a surprise?\n\nWhy would they do this to someone?? Why not just adopt a white kid if they didn't want to have to lie to them their whole life? That sounds horrible to say, but it's even more horrible to do this to a kid who probably could have had a more enriching life with another family.",
          "id": 73,
          "comments": [
            {
              "score": 19,
              "content": "It depends on where you adopt from, and when you adopted.  In the 1970s and 80s, from what I was told, it was kind of like adopting from strangers, the baby was in a foster home, you went and saw them, then took it home if you wanted. In the 1940s, from what I understand from my uncle's adoption,  it was almost like getting a puppy You applied, got approved, and picked from what was available,  often with no history.  In later years you usually meet at least the mom, and sometimes the dad, and often they choose you or are matched to you. That was probably the case with OP. Of course there were other variations,  but that's what I know from my family and a family friend who fostered adoptable babies for years with a catholic agency.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It’s a lot harder to adopt a non-white child in the US because there’s less of them in the system. Maybe OP’s parents didn’t feel like waiting around for a white child so they took OP who was close enough.",
              "id": 75,
              "comments": [
                {
                  "score": 3,
                  "content": "Sounds so cavalier!",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Well said. I'm wondering why they continued to stay where they were located instead of moving to a place where there's less stigma. The parents themselves could've learned a lot about their child's heritage if they were more willing to expand their minds instead of trying to shut down something they didn't like. It was a great opportunity for the parents to educate themselves, but they made the decision to stay ignorant. OP should never be seen as TA for wanting to learn about himself, the parents should only he seen as TAs until they learn to let their actions live up to their words. If they loved their son, they shouldn't have judged him for being curious, only supported him to learn more about himself and his people.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2436,
      "content": "NTA - and I’m surprised no one else in the comments has mentioned this- your parents CLAIM they were hiding your race because of stigma- but the fact that they got upset when you grew out your natural hair and wore it braided shows much deeper racism at work.",
      "id": 78,
      "comments": [
        {
          "score": 1463,
          "content": "Yeah the issue of my hair has been ongoing. I didn’t even bother to put the more derogatory descriptions they’ve used whenever they’ve seen me without a cut closer to my scalp.",
          "id": 79,
          "comments": [
            {
              "score": 1046,
              "content": "Ooooooh...your parents are racist af. I am so, so sorry.",
              "id": 80,
              "comments": [
                {
                  "score": 400,
                  "content": "And the interesting sociological point of this is when the racist parents are presented with a person of that race who isn’t horrible (OP) rather than using that as a stepping off point to look at their racism, realize they were wrong and make amends; they merely doubled down and figured “this one” is good because he was raised correctly. SMH",
                  "id": 81,
                  "comments": [
                    {
                      "score": 329,
                      "content": "My dad was racist af. But. Every single Black person he got to know was \"an exception.\" Every. Single. One.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That's pretty much the standard response in my experience.  Black people are x y and z, this black person is different.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 131,
              "content": "Ouch. That’s not okay and it’s definitely, objectively, inarguably racist. I’m so sorry.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Are they acting like that towards your girlfriend as well?",
              "id": 85,
              "comments": [
                {
                  "score": 150,
                  "content": "Oh man I didn't think about the girlfriend! They probably started shitting their pants once they found out about her.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 90,
                      "content": "And they're going to use that she \"went behind their backs\" and uncovered their lies to treat her even worse than they already might've.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "They're probably rooting for him to find a white girl and breed the black out of him so they can have blonde and blue-eyed grandbabies.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "My thoughts as well when I read that she was African American, and then I really began to tell where this was gonna go.\n\nNTA, OP and I wish happiness upon you and yours when this is over. I just don't have the best advice to give; as a white woman, I can't wholly put myself in your shoes. \n\nBut, I do know that what your parents did was awful and self-serving, and it screams \"racist\" to me, which I am so sorry for. Nobody deserves that kind of psychological mistreatment from their parents, biological or not. Keep doing what you wanna do, it's your turn to be a little self-serving and whether that means growing out or braiding your hair or starting your search for real, with the right materials and what seems to be a very loyal and compassionate girlfriend by your side, just do it. \n\nA whole new world and identity has been opened up to you; I don't know if you'll want to keep in touch with your adopted parents, but either way, you've got some kickass history to explore and an honest life to live and I hope it brings you so much joy.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "I'm guessing they called your hair what a Brit would call a diaper.  Interesting that they'd try to protect you from racial prejudice by insulting features relating to your race.",
              "id": 90,
              "comments": [
                {
                  "score": 6,
                  "content": "They went the ole Don Imus route",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "Oh yikes. Yeah, your parents don't care about you facing \"stigma\", they care about the judgement they'd get if their other racist friends found out they adopted a non-white person.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "I am black. Just know that racist ppl and bigot people have always had a problem with black peoples hair and they want control over it. This is what your parents did. I’m happy that you are finding out more of your background. I hope you learn all of your history. I just ordered a DNA kit for myself last night and I hope to find out more. Many blessings and hopes for healing for you.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I'm going to drop links to a number of books on the question of both trans-racial adoption and adoption of Black kids by non-Black families below. Sometimes, for me, seeing that parts of our lives as racialized people are part of phenomenons and patterns that experts study helps me understand how to navigate them. \n\nYour parents are racist. That's going to be a lot to deal with going forward, and it sounds like your siblings are no help, but that your GF is chill af. You can choose how you connect, if you connect. Reconnecting in my community (Native American) is very common because there are generations of Native babies well we're purposefully taken from their Native parents to be raised by white families because racism. (See: Generation Removed by M. Jacobs for citation). Good luck, and I'm so sorry you've been placed in this fucked up situation. \n\nhttps://books.google.com/books?hl=en&lr=&id=zKW2uiZusEMC&oi=fnd&pg=PR5&dq=black+white+adoption+racism&ots=nthoDtjawk&sig=fV5jPLJ5QkbWwkEizLDQQwknFIY\n\nhttps://books.google.com/books?hl=en&lr=&id=0X8gmhu7MHsC&oi=fnd&pg=PR11&dq=black+white+adoption+racism&ots=xNO7My95zC&sig=UDq3wWFoFOPO-tJj5IWHvKMM-98\n\nhttps://www.utpjournals.press/doi/abs/10.3138/jcfs.42.2.193",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I'm wondering if maybe your parents kidnapped or illegally adopted you and the fake papers they acquired say your birth parents were white.  Have you thought about looking into that?",
              "id": 95,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "As soon as hair was mentioned, I knew what was going on. \n\nRegardless of what they I'll see you soon be good intentions, their plan was a colossal failure. They tried to rqise him as being white, but people still noticed he wasn't. \n\nThe fact that people still have to try and pass for another race in this day in age for safety is off the wall.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 855,
      "content": "NTA. What about medical conditions that may be more prevalent in your heritage? If doctors think you are white, they could overlook something like thalassemia.",
      "id": 97,
      "comments": [
        {
          "score": 736,
          "content": "I tried to appeal to them about this and they just waved it away. I’ve never seen them react so unreasonably. I have plans to attend to my own genetic predisposition to conditions very soon.",
          "id": 98,
          "comments": [
            {
              "score": 297,
              "content": "Woah. Its bad enough they hid your racial background and put you at a disadvantage when searching for your birth parents, but to wave off your concerns about possible predispositions about your medical background?! Now they're racist and dismissive of your *health!* \n\nYou're absolutely NTA here, and after reading this comment and your post, I think it would be reasonable to go low contact with them. I understand that they're your parents and the people who raised you, but they actively robbed you of knowing your genetic background and your autonomy by misleading your racial background, to the extent of controlling how you wore your hair to lessen the chances of questioning it. You don't owe them anything. They *chose* to be parents - whether to you, any other child they adopted, biological children. Don't let that \"we chose *you*\" bullshit fly. Their only choice was to be parents and accepted the responsibility that comes with raising a child; financial, emotional, physical - all those responsibilities.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "You are not, no matter what your adoptive parents may say, in the wrong to be learning anything about your heritage. It IS your heritage. And they have no rights to be taking that away from you. \n\nI have two boys just a couple of years younger than you. While I gave birth to them, my ex’s side is a bit more complicated than mine. My older one has requested my assistance in learning more about it. And you know what I’m going to do? I’m going to help him, because as a mom, it’s my job to help him learn who he is. \n\nYour parents have, unfortunately, shown themselves to be racists. If they did care about you, they wouldn’t have lied. They wouldn’t have freaked out at your curly hair. They wouldn’t have freaked out at your braids. And they most definitely would not have freaked out and told you to forget about everything you’ve learned about who YOU are. What makes you who you are. \n\nI’m sending you soft, gentle, mom hugs, and a reminder that you are beautiful, and wonderful, for who you are, even if it’s something that they don’t want you to be. They’re job when adopting you was to love you for exactly who and what you are. They failed. YOU DID NOT FAIL. You’re a wonderful, amazing, beautiful human being, braids, curls and all.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Depending on the state, it may be very easy to request your adoption records & birth certificate even if it was a closed adoption.  Try going through your state adoption records if you haven't yet although I'm assuming you have from your post.  Hope things work out for you soon.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Honestly maybe you should look into family counseling with a black counselor. Maybe they can change? \n\nIf it were me i would make an ultimatum, either we all go to therapy or I will go no contact",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I'm glad to see someone else pointed this out.  The racism alone is sickening, but the abject dismissal of possible genetic health factors adds a whole new level of negligence to this whole ordeal.  I'm so glad OP found a supporter who helped him figure out his heritage.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is so important, I have a friend who is adopted but never really wanted to go into her heritage for obvious reasons and I spent so much time trying to convince her for health reasons to look into it.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 719,
      "content": "NTA! Oh my god are you me? I was also adopted at a very young age, but have always known I was adopted. I was told growing up that I was a mix of Italian, Native American, and South American ancestry, to account for my olive skin and dark hair. My mom would always become absolutely livid if I brought up to her that I may have been partially Black. I turned 18 and took a DNA test because I was curious about my ethnicity and wanted to check for any potential genetic health issues. And low and behold I have more African ancestry than anything, the rest is European, and very little Native American. I was so hurt when I found out because I felt like part of myself had been a lie for so long. You have every reason to be angry and disappointed in your parents.",
      "id": 105,
      "comments": [
        {
          "score": 168,
          "content": "Wow... I'm sorry your adopted parents did that to you. \n\nDo you mind if I ask if you were able to connect more with Black culture after learning the truth? It's ok if you don't have the emotional labor to answer a random white person on the internet tho.",
          "id": 106,
          "comments": [
            {
              "score": 156,
              "content": "Honestly as much as I want to it has been hard for me to do so. I was almost completely isolated from it for 18 years. Both my adoptive parents are white, they enrolled me in a predominantly white school from the time I was 3 until I graduated, and the town where I grew up was also predominantly white. I’ve done my research on the cultures and heritage of my ancestry but actually connecting to the culture in current forms is a bit more difficult, if that makes any sense.",
              "id": 107,
              "comments": [
                {
                  "score": 117,
                  "content": "I was thinking recently about the logistics of adopting a kid a different race from me, and decided it would be best for the kid if i lived somewhere diverse enough there's other people of their same heritage, so they can interact w/ that cultural heritage even if not from my household. Your comment definitely reinforces that idea.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 51,
                      "content": "I think that’s a wonderful idea for anyone considering adopting. And as bad as what I have stated previously sounds, I definitely lucked out in the adoption lottery, my parents weren’t perfect but they did do their best.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "I just suggested a documentary called “Little White Lie” to OP, and I think you should check it out as well. The woman who made the documentary grew up in very similar circumstances, but when she got to college, she found that she was more comfortable bei around black and biracial people because the subconscious discomfort of her ambiguous racial identity wasn’t as strange to them as it was to her white peers. It was a very eye-opening look at what seems to be an increasingly common situation.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "I'm also adopted, and where I am, adoption records are typically sealed except for medical info until the child is an adult.\n\nWhen I was 9, one of my friends was a girl who proudly told me about her mixed background. She looked black, and her older sister looked white. That made me curious, so I went home and asked my mom if I might be like my friend and her sister. She got upset and insisted there was no way I wasn't white. (She could not have known that).\n\nAs an adult, I took a DNA test. Turns out I am mostly white, but I have some Chinese background as well. I can't help but wonder if that could have changed my parents' minds about adopting me. \n\nWhy do so many people adopt a child with so many terms and conditions placed upon them being loved and accepted?",
          "id": 111,
          "comments": [
            {
              "score": 48,
              "content": "I know right. When I was adopted my adoptive parents were there for the delivery, apparently a somewhat rare occurrence, and my mom used to tell me the story about the nurse congratulating her on a “beautiful black baby” or something similar, and my mom reassuring her that no I was white. She would tell me this laughing, and it wasn’t until a few years ago that I started questioning that story and some other comments she made throughout my childhood when it came to my race.",
              "id": 112,
              "comments": [
                {
                  "score": 24,
                  "content": "That sucks so much that they denied so much of who you are. It's only a small part for me, so I can barely imagine.\n\nOne thing that stuck out for me is that my mom has always insisted that my hair was red/auburn as a little girl. I've seen the photos. It's the same as now, dark brown, not far from black, and completely straight. She also said my eyes are hazel. They're not, they're brown. As a teen, I started getting red highlights dyed into my hair. My mom always loved it and told me how pretty it was.\n\nI don't think it was intentional, but the message that white = pretty was there, whether she meant it or not. Because of my mom, I always thought I wouldn't be pretty unless my hair and eyes were lighter. I shouldn't be ashamed or feel that I'm less because I'm not all white. And I know I'm lucky that I'm mostly white and pass as all white. That crap obviously hurts so many others so much worse than I've ever felt.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Yeah I think my mom had an aneurysm when my hair started to curl when I was around 13, and even then she was convinced it was just puberty. I remember when I was starting Pre-K a few of my male classmates started making fun of me for being black. And I of course went and cried to my mom and she just said “but you’re not black are you?” Instead of taking that time to encourage me she decided to dismiss a part of who I was instead. It lead to a lot of white = beautiful thinking especially when I reached my teen years.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Hey, it me! My dad was the one adopted but we didn’t find out until he was an adult that his birth grandmother was Chinese. We were lucky enough to meet her before she passed but it’s hard to come to another culture as an adult. How have you navigated it, if you don’t mind me asking?",
              "id": 115,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "If you haven’t checked out r/mixedrace, feel free to stop by",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Are you sure you're parents knew this? South American ancestry could be anything, most people there are some mixture of white, black and native. It's possible that your parents just didn't know what your ancestry was.",
          "id": 117,
          "comments": [
            {
              "score": 3,
              "content": "They had a lot of information on my biological parents so even though it is true that they may not have exactly known, I find that very unlikely. And even if they were totally ignorant to my ancestry the main issue stems from the fact that I received push back any time I referenced that I may have some Black ancestry.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 611,
      "content": "Nta\n\nYou have every reason to be upset.\nYour parents make it seem as if you should be ashamed of your etnicity/race.",
      "id": 119,
      "comments": [
        {
          "score": 215,
          "content": "And more than that, there's medical history to consider, especially when there are conditions that are known to specifically crop up in particular ethnic groups. Would they rather that OP found out if/when they became ill or had a child affected by one of these conditions? Or would they stay in denial and try to claim the doctors were mistaken?",
          "id": 120,
          "comments": [
            {
              "score": 78,
              "content": "That's one of the first things I thought of; there are so many conditions where certain ethnic groups might be at higher risk for developing, including some fairly rare and difficult to diagnose ones. Hiding this kind of information could be really dangerous.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": ">Or would they stay in denial and try to claim the doctors were mistaken?\n\nOr their child could be extremely ill from something like sickle cell and not be tested very early on because it doesn't normally occur in white people.\n\nThey could do dozens of horrible tests and basically torture the baby before finding the answer because OP didn't know their own genetics.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This is exactly what I came here to say",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "What I came here to say. Surprised it’s not farther up.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "NTA. I'm so sorry that your family did this to you. I can't imagine how it feels. It sounds like you have a supportive girlfriend and other friends. I'm glad for that. Hopefully your (adopted) parents learn to come around and apologize.",
      "id": 125,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 124,
      "content": "NTA. You were stripped of your identity, and your parents knew since you were 13 how important your identity was to you. I’m sorry that they did that to you. They’re reaction makes me wonder if it was their racism they were afraid of as well as society’s. \n\nGood luck on your search for your birth parents. I encourage you to continue to hold your family accountable for their actions and let them know they have to accept the real you, not your parents’ lie, but I hope you are able to patch things with your family in the end, but it should be on your terms, not theirs.\n\nAdditional question: are your siblings biologically white? Because their response seems very culturally insensitive but wrapped in the idea of “good intentions” which is the kind of thing that leads to the systemic racism America is fighting right now.",
      "id": 126,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "Hell yeah buddy!! As a persian guy, I’d like to welcome you to the family! I’d recommend reading up on Cyrus the Great (big deal dude) and also ordering some Koobideh Kabob (koobideh is “ground”) at your local persian restaurant. Congrats.",
      "id": 127,
      "comments": [
        {
          "score": 23,
          "content": "This is a very sweet comment! Thank you for your kindness! I hope OP sees it!",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Lmao dude is gonna go on a food adventure, there’s so much to try! After the koobideh he’s gotta get some tadig and gormeh sabzi",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Iranian culture is ancient and glorious. There’s nothing to be ashamed of.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}