{
  "post content": "I went out the past weekend with 2 friends.  I'm 29 but I have a \"babyface\" so I still get carded regularly.  I'm used to that and have no issues. \n\n\nWell we went to a sports bar/restaurant place and the bartender \"Trent\" carded me. No big deal. Then some random guy was sitting a few seats away said \"how old is she?\"  Trent said \"well she was born in '92 so...29\" I was holding out my hand expecting to get it back because I thought he was done. Random guy said \"no way let me see\" and Trent walked over and  handed him my license. I said \"um excuse me can I have my license back?\" Bartender said \"yea just a sec\". Then the guy next to random guy took it and looked at it. \n\nWhen Trent finally gave it back I sarcastically said \"thanks for passing my personal information around \". \n\nMy friend Lilly that knows Trent said \"they were just messing around calm down \"  so I didn't say anything else about it til when we were on our way home.  \n\nI said \"I can't believe you're friends with that tool\". Lilly said \"he was just kidding around you need to lighten up\" and apparently him and \"Billy\" and \"Rob\" are friends.  \n\nIf it was something that just had my age, I wouldn't care but my license (like everyone's) has my first name last name, address, and I don't know Billy and Rob from a hole in the wall.  \n\nWhen I told my boyfriend he laughed and said \"they were probably trying to flirt \" and I should just let it go, that my past is causing me to be paranoid.  Because I had a coworker borderline stalking me a few years ago, luckily he didn't know where I lived but he'd \"show up\" randomly when I was in public A LOT. I'm sure if he knew where I lived he'd have shown up there too. \n\nIt bothered me Sunday and Monday. I could easily not go back there, and probably won't but my thinking is if he's passing around my ID he's doing it to other people.  \n\nI called the place yesterday and asked to talk to a manager and said what happened.  \n\nLilly called and yelled at me earlier, she said that \"they were just messing around,  it wasn't serious enough for me to call and get him in trouble, that I embarrassed her by acting like a uptight bitch and making a big thing over a joke\".  \n\nMaybe they are harmless and it was probably just a joke, but it's more the principle of it. \n\nAITA should I have just let it go?",
  "id": 1,
  "comments": [
    {
      "score": 11029,
      "content": "NTA, you didn’t consent to the bartender passing around your ID to begin with. That is private information, and the fact that your so called friends are bf are defending it is bs. You expressed how uncomfortable you were with that, and nobody seemed to stop and really think about how the “joke” isn’t funny and you didn’t appreciate it.",
      "id": 2,
      "comments": [
        {
          "score": 2706,
          "content": "I feel like if I was OP, I would be like “yeah, you are right. Let me see your ID real quick. Oh random stranger that my friend doesn’t know, you want to see my friends ID with her state identification number (used to verify checks sometimes) and her address so you can possibly show up randomly”\n\nThen hand it right back to her.",
          "id": 3,
          "comments": [
            {
              "score": 453,
              "content": "Ohhh OR op could take friend's license, snap a pic on your phone, and say something like \"omg I HAVE to show this to my friends Bob and Rob from the internet! I don't know them super well and we've never met in person but they seem really chill and we have this inside \"joke\" that your license is the perfect example of. Btw don't worry, I told them not to share the picture around. They seem like solid dudes, I'm sure it will be fine. We met on 4chan.\"",
              "id": 4,
              "comments": [
                {
                  "score": 214,
                  "content": "Oh, man, I think I was somewhere in this kind of thing years ago. The bartender said he had never seen a DC license before (I was far away from DC), and a fellow patron of that bar piped up and said her son wanted to get a picture of every US license plate, and DC was super-rare! I said I had a picture of my old DC license plate! She gave me her email address and I sent her the photo. \"But you said 'old'?\" \"Oh, yeah, I sold my car like 3 years ago and the city has shredded that license plate at this point. Owning a car in the city sucks. But you got the great 'Taxation Without Representation' tag!\" She seemed very defeated by that...Oh...were you trying to do some shady shit? Yeah, you got a defunct license plate number and only saw my license in a fleeting moment!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 55,
                      "content": "scammers always blow my mind with how fast they drop \"the act\" when they realize you're onto them.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "As a non American, I just find it very odd that full address is stated on a drivers license. We just have city it was issued in.",
              "id": 7,
              "comments": [
                {
                  "score": 22,
                  "content": "Uk here, mine has my full address",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "It’s not just an American thing. It’s very common to have addresses listed on drivers licenses. I think Canada, Mexico, and many South American countries do it as well.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 6,
                      "content": "But why, since i got my license i moved three times. Would i need to get a new one each time? I prefer the system where my license just shows in allowed to operate certain vehicles, nothing more nothing less.\nIf more is needed, the right authorities should be able to get my info from the system.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Australian here, it has my full address.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Yep, UK licences have the full address on.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Canada has full address. It's a primary if not the primary form of identification after a passport.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Do your passport also have full address? Caus we don't have that in their as well.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1194,
          "content": "I hate it when when people defend things that are technically illegal as messing around. Those random guys have no right to demand Id from anyone, and the bartender can't give it to anyone.",
          "id": 15,
          "comments": [
            {
              "score": 694,
              "content": "I work in a pharmacy and you have to be so careful. All we can ask is first/last name, and verify the STREET they live on. NOT THEIR ADDRESS. Only the street, if they want to volunteer their house number then that's on them. We can ask to see ID, or ask for their DOB or phone number if we need to, but this is all information they consent to giving us and we are literally never allowed to repeat to anyone outside of our coworkers. If someone says \"no I won't give you the information you need to verify my identity\" we say \"okay, we can't give you anything if we don't know who you are, but its up to you\"\n\nI can't say \"oh hi John! Are you picking up your wife's medication too?\" Because we are literally required by law to never verify or imply any information about someone to anyone else, including the fact that they visit the pharmacy. Even if someone is standing in line next to someone else, if one of those people come back a week later and ask if that other person gets medication at our pharmacy, we say \"who? I don't think so.\"\n\nGiving someone's ID to a stranger without their consent and letting them read it is SUCH A CRAZY VIOLATION AND DANGER OMG. This guy should be fired and that sounds harsh but bars are already very dangerous for women, the last thing that guy needs is to know where this girl lives so he can spike her drink AND follow her home.",
              "id": 16,
              "comments": [
                {
                  "score": 239,
                  "content": "Seriously, so much of this. Any job that requires you to handle peoples PPI (protected personal information) has insane liability, and therefore comes with incredibly strict guidelines for what you can do with that info (and usually training, ad naseum, so you know those rules clearly). I’ve never been a bartender so I don’t know for sure if what Trent did was illegal, but it for sure was unethical and wildly inappropriate. At the very least the bar owners/managers need to be alerted so they can retrain Trent, if not fire him. \n\nOP, I’m sorry you’ve had to deal with stalking before, that’s awful. I’d guess that the odds of anything terrible coming from *this specific incident* of two strangers looking at your ID is low - your bf is probably right that they were just goofing around. But that doesn’t excuse Trent, and you’re definitely NTA here for being upset.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I used to work where we sold lotto and smokes, we look at ID literally make sure the picture is of the person and the year they were born. Full date if they'd be of age that year. \nObviously make sure it's not fake thats it. It's like a 30 second glance",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I'm a fed, and we can't even email any of our PII (edit to note that in fed parlance it's \"PII...personally identifying information\") to someone who needs it without using an encrypted email service. When we give it to our coworkers (because we do...I have several coworkers' birthdates and passport numbers, so we can help each other if things go sideways on international travel), we do it by post-it. If we tried to email, even internally, it would be blocked by the PII filtering \"bot.\"",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Funny story, my friend is a pharmacist and her wife came in to say hi. There were no customers at the time, just 2 staff. \nFriend says 'hi *name* are you here to pick up something for that terrible gas you have?'.\n\n 1 Staff member had just started there, not knowing that it was a joke, and that they are married, went and spoke to the pharmacist about being discreet with people private information. \n\nPharmacist explained, wife agreed it was a joke, and that staff member has ended up promoted for being assertive, and showing integrity, and is also at uni studying pharmacy due to the encouragement.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Haha my pharmacy definitely asks for the address. But they are very careful about meds for sure. \n\nI'm disabled and while they ship most of my meds, I have 2 that have to be picked up in person (and if there's other ones there at the time I have him grab those too). They make him confirm all my info, and record his ID (so that if I told them I didn't get them or he wasn't supposed to or whatever it can be resolved). And we even have the same last name and address lol. I do appreciate that though, because I'd need a hospital stay if there was an issue with my meds that took a while to clear up.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I’ve thought about this many times because my husband gets Rxs for me, and I pick up Rxs for him. Our pharmacy requires only the person’s name and DOB, and the pharmacists will hand the Rx to anyone who can provide that info. Because this is convenient for my family, I’m actually appreciative of this…but I’ve always thought it’s strange and dangerous, and I’ve wondered if it is against HIPAA guidelines and store policy.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Frankly, the idea of giving pharmacy my name or address is strange nowadays. I live in a country, where you give pharmacy equivalent of SSN and prescription access code. That's it.\n\nYou may give consent to process additional information (phone number), if the medication is not on site, but otherwise...",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, when I lived in a small town, the pharmacist was married to my partner's friend so no issues with ID there. When I lived in the city, however, my pharmacist would ask for the house/apartment number only or the last 3 digits of the phone number etc",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "Yup. Hey, stand here a second, I'm gonna go Rob this bank.m don't worry... its just gonna be messing around...",
              "id": 25,
              "comments": [
                {
                  "score": 5,
                  "content": "Maybe some light stalking too, LOL.  It’s all fun and games, right?",
                  "id": 26,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeaaah! All fun n games! Now gimme your wallet and ain't no one gonna get hurt. 🔪",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "It's not technically - it's just illegal. And in certain countries - a cause for a criminal investigation.\n\nIn some countries, the bartender would have been fired for cause, just because of the sheer amount of the paperwork and headache he created for his company (an incident report would have to be filed with country's data protection office upon which company's policy related to processing of personal data would have been investigated, including the training of employees).\n\nObviously, OP is NTA.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "If it wasn’t a big deal like OPs “friend” said, the bartender wouldn’t have gotten in trouble !",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "It's just a prank bro",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "\"It was just some light, playful embezzlement! I didn't mean it so srs, brah!\"",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 264,
          "content": "> it wasn't serious enough for me to call and get him in trouble\n\nWell, if it actually wasn't serious enough, Trent wouldn't have gotten into trouble for it. Sounds like the manager thought it was pretty serious, so clearly NTA.",
          "id": 32,
          "comments": [
            {
              "score": 59,
              "content": "Exactly. The manager was obviously concerned about this behavior. Trent is a d-bag for doing what he did. And he should get into trouble for it. If I was at the bar and saw the bartender handing randoms someone else ID, I'd be super sketched out and not want to go back that bar.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "If I was the manager I'd be very concerned too. Trent broke FTC guidelines and this could become a very serious issue for the company. Trent should be fired at the very least.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "OP need a normal friends and boyfriend. People like who dismiss your trauma is better to be avoided like a plague.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "To add: If the tool got in trouble, is because the manager agrees with OP that what he did is, at the very least, unproffesional, otherwise manager would have ignored OP's complain",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Also, it’s disturbing that her friends and bf just wrote off her past experience as “paranoia” when A. That is OPs legitimate lived experience and there is no reason to believe it couldn’t happen again, and B. Of course OP would be triggered by that incident and their reaction is completely valid. Just because OPs reaction is triggered caused by experience/trauma does not delegitimize it or mean it is unreasonable. Precisely the opposite actually!! And even if the reaction was disporportionate (which it wasnt), they would still be the AHs for being so callous when this is clearly very personal.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "If it wasn’t a big deal, he wouldn’t get in trouble for it when she called to report it to his manager....",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Thats illegal as fuck\nI would fire any of my bartenders for that shit",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Especially considering her friends and bf should know about her history with being stalked and why she might be particularly on guard with this stuff. Yikes.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This exactly. And one of those guys could be a stalker, robber, or worse. Too dangerous... I would have been furious  😠 \n\nNTA",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2654,
      "content": "NTA if your licence works like it does in my country your address is on it! Contact the owner and tell them what their employee is doing, it's unsafe and I'm not sure if its even legal. Any of those men could in theory turn up at your address how fucking stupid is this trent prick. Not okay not ever!",
      "id": 42,
      "comments": [
        {
          "score": 1066,
          "content": "This.  Also, u/whothatisnow you chose an excellent way to handle the situation.  Reporting to the manager while you were there would have opened you up to abuse from the bartender and patrons, calling the manager afterward was a great choice.",
          "id": 43,
          "comments": [
            {
              "score": 344,
              "content": "Absolutely this I've worked in hospitality for over 25yrs now and highly suggest to anyone to do it this way.\n\nGoing to the on duty manager doesn't actually do anything unless that manager decides to let others know about it.\nGo to upper management with things like this because its too important for the guy/girl who happens to be \"manager\" that night to decide what happens. \n\nThat manager could literally be the person that happens to of been there the longest and the owner and  actual bar manger are not in so they are \"in charge\" especially when it comes to bars and that actually means their just another bartender/employee and they will not put their colleague/friends job in danger.\n\nFind their website (everywhere these days has one) and contact them through there. Add as many details as you can (time,date,people around if you can describing them if possible) that way when they check the cctv they an see your details given and interpret the situation the right way, many bars have cctv behind the bar/facing the bar practically none of the will have sound. By giving details the bartender can't say you gave permission and get away with it.",
              "id": 44,
              "comments": [
                {
                  "score": 95,
                  "content": "I called the manager of a local strip club after the valet on duty demanded that I stop my bike and then jogged to keep pace with me when I refused. I was so concerned that I’d just blown everything out of proportion but when I expressed that to the guy, his exact words were “No, I am the manager and I am upset.”",
                  "id": 45,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Im confused and feel like there is a story here.  You rode a bicycle past a strip club and a valet chased you telling you to stop your bike?",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 218,
          "content": "If she's in the US I would take it one step further and call ATF because there is no qay they want someone who is serving alcohol to also be using their position to dox patrons and endanger them by giving put their personal info. Trent should lose his license allowing him to serve alcohol.\n\nEDIT TO ADD: I've actually called the ATF office in my city about a bartender putting patrons in danger in a not dissimilar fashion. They did take it seriously. The establishment was fined, that bartender was let go and lost the card allowing them to serve alcohol. Maybe atf passed it off to a smaller agency at the local/state level, I don't know. But they did respond to me and action was taken.",
          "id": 47,
          "comments": [
            {
              "score": 35,
              "content": "From ATF website\n\nATF's Alcohol and Tobacco Enforcement Programs purpose is to target, identify, and dismantle criminal enterprises with ties to violent crime, that traffic illicit liquor or contraband tobacco in interstate commerce; seize and deny their access to assets and funds; and prevent their encroachment into the legitimate alcohol or tobacco industry.\n\nThey aren’t gonna care about some bouncer showing off OP’s ID to their friends",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "[deleted]",
              "id": 49,
              "comments": [
                {
                  "score": 189,
                  "content": "In my state you would be wrong. I worked in a bowling alley and every bartender and every server had to have a license to serve alcohol. I am in Indiana and it is called Bartender License and is issued by Alcohol and Tobacco Commission.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 71,
                      "content": "Oregon has a similar license for restaurant employees.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "In Montana there is training and licensing you have to get to serve alcohol, even if you are pouring beer at a Beerfest.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "Louisiana has a Bar card you have to do a training program to get. And in California you definitely have a bartender's liecense. Sorry most states do; mainly to hold bartenders accountable if they serve underage guests or if they continued serving someone obviously to intoxicated.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Yeah in Australia is called an RSA, responsible service of alcohol. This would definitely fall under the list of shit that gets you in trouble.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Chiming in internationally to say that in Australia everybody who even opens a bottle needs to have their Responsible Service of Alcohol certificate.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "In WY, you have to be \"tip certified\" to serve alcohol. If the servers aren't certified, the establishment can have their liquor license revoked.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 46,
                  "content": "In Ontario we have smart serve. Someone who serves and sells alcohol must legally have it, and yes you can lose it if you are caught overselling or other unsavory behaviour regarding personal information. Source, I've worked in restaurants for 24 years now.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Alberta's version is Pro Serve.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 33,
                  "content": "They do in my state. All people who serve alcohol must have a license from alcohol and beverage control. But cool that you don't know that.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "In my state ypu would be wrong. I worked in a bowling alley and every bartender and every server had to have a license to serve alcohol. I am in Indiana and it is called Bartender License and is issued by Alcohol and Tobacco Commission.",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Lots of states make anyone who serves alcohol attend a class and get a card. I had an OLCC card that was good for 10 years because I was a bartender. I also had to have a food handler's card to work back of house; even dishwashers needed them!!",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -9,
              "content": "ATF doesn't police bartenders. Bars have local liquor licenses; the feeds aren't involved. And bartenders don't have licenses at all in my state.",
              "id": 62,
              "comments": [
                {
                  "score": 8,
                  "content": "Most people conflait ATF with the state Boards/Commisions on Alcohol and Tobacco that several states have.\n\nIn states that do have them, they tend to police bartenders.",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "They are in my state. But glad you know about the laws in every state. Super cool.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "This was literally my first thought. Best case scenario, some idiots OP will never see again know a little too much about her but worst case? Well we’ve all seen Dateline…",
          "id": 65,
          "comments": [
            {
              "score": 120,
              "content": "Yeah, if Trent liked the buzz he got from withholding her docs from her (let's face it, it was totally a powerplay on his part) and showing them to the creeps at the bar, and decides to make it a regular entertainment, then one of them might decide to memorise the address.\n\nMost crime of any kind is opportunistic",
              "id": 66,
              "comments": [
                {
                  "score": 41,
                  "content": "yep.  It was a little game of \"keep away\"",
                  "id": 67,
                  "comments": [
                    {
                      "score": 29,
                      "content": "oh that makes me super glad op got him in trouble actually. maybe next time he'll think twice before treating someone that way. not as powerful as you thought you were, huh bud?",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I could see them working together. One of the guys having his camera going while the other says \"really? Let me see.\" I could be overthrowing, but I'd be worried.\n\nDefinitely a power play and rude as hell to make fun of her for looking young.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Individual people definitely have to have licenses to serve alcohol, but I doubt this would be grounds for someone to have theirs revoked.",
              "id": 70,
              "comments": [
                {
                  "score": 5,
                  "content": "Not in Florida! (I've been a bartender for 20 years)",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "NTA.  This so creepy as hell.  I’m a 6’4” dude, and i would be pissed.  That is how you get followed home and attacked.  I would put this all over social media.   People need to know this bar tender is putting people at risk.  \n\nEven if is was a joke, it’s a terrible thing to allow to happen.  Trent needs to lose his job.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "In the post OP says her address is on it and that she already called the manager and that's why her friend is mad.",
          "id": 73,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "She did and her 'friend' called her up screaming at her about getting Trent into trouble.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1246,
      "content": "He’s showing strangers at a bar your literal address…NTA. That’s crazy!  And it’s none of the other guys business how old you are if the bartender has verified that you’re of drinking age.",
      "id": 75,
      "comments": [
        {
          "score": 128,
          "content": "So rude of him! \n\nHe might not have thought about the implications but he should have taken you seriously and apologized. Telling the manager was appropriate",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Yeah. Telling these guys her birth year was bad enough. The fact he passed around her freaking ID? Hello identify theft?",
          "id": 77,
          "comments": [
            {
              "score": 8,
              "content": "If he memorized her address, identity theft is the least of my concerns...",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 799,
      "content": "NTA imo. That whole routine just reads to me like me like a bunch of barflies sexualising a young looking woman either as a misguided joke or some uninvited attempt to flirt. Either way; just fuck off and mind your own business huh? And that's not even to mention that strangers in a bar being able to see and possibly remember your home address is potentially dangerous.\n\nThe bartender is an ass. Isn't their job, other than pouring drinks, to make people feel welcome rather than fuckin uncomfortable?",
      "id": 79,
      "comments": [
        {
          "score": 247,
          "content": "I casually dated a bartender/bar manager  and he always talked about his job is to guarantee the safety of his patrons. He is responsible in making sure they aren’t over-served and not being harassed especially women. He would flip shit on a guy if he witnessed this or got a complaint.",
          "id": 80,
          "comments": [
            {
              "score": 73,
              "content": "Now that is a bar I could comfortably be a patron at. We love to see it.",
              "id": 81,
              "comments": [
                {
                  "score": 36,
                  "content": "Exactly! I would go often even if he wasn’t on shift because I knew I would be safe and treated well. \n\nHe worked for local, middle to high end small business where the owners understood that reputation was key.  They didn’t tolerate much buffoonery when it came to employees or patrons not showing respect to one another.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yup! Good bartenders keep an eye out. Apparently, my boyfriend has many “girlfriends” in our city bc some creepos won’t back off unless a woman is claimed. He definitely wouldn’t flash someone’s info around like that.",
              "id": 83,
              "comments": [
                {
                  "score": 10,
                  "content": "Yeah same here. although one of them ended being his actual girlfriend.  That I had no clue about.  It is  a really long story. 😂😂😂",
                  "id": 84,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Whooooa. Guess he only took respect seriously at work.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Definitely the bartenders an asshole and should get in trouble, but I'm a guy and other guys do the same type of thing at bars with me.",
          "id": 86,
          "comments": [
            {
              "score": 32,
              "content": "And do you make them stop?  Do you report it to police? Because what you are seeing is illegal in many jurisdictions, and dangerous in all of them. People who think this is no big deal are fools. People who allow it are abetting dangerous harassment. Those who engage in it are morally responsible for crimes that they may never hear about-they have no way of knowing what they have actually allowed to happen, and it might be really really horrifying. Imagine living with that knowledge for the rest of your life, and never, ever being sure about the harm you have allowed to be done to someone you will never be able to apologize to. That weight would be crushing to someone with a normal conscience.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "NTA fuck that. Who would want a bunch of strangers to have their full name and address? NTA at all. Honestly you shouldve made a bigger scene",
      "id": 88,
      "comments": [
        {
          "score": 121,
          "content": "Seriously. Is this dude **trying** to get someone to rob OP's house",
          "id": 89,
          "comments": [
            {
              "score": 50,
              "content": "Theft might sadly be the best out come were anything to actually happen. (Really hoping nothing does though)",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Right?! I would have walked over and snatched it back.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 242,
      "content": "NTA. In the UK and Europe this would be illegal under GPDR laws. You were absolutely right to complain.",
      "id": 92,
      "comments": [
        {
          "score": 31,
          "content": "And in the US",
          "id": 93,
          "comments": [
            {
              "score": 19,
              "content": "GPDR doesn’t apply to the U.S.",
              "id": 94,
              "comments": [
                {
                  "score": 9,
                  "content": "Well, technically it can apply anywhere but only to data collected in relation to EU citizens. So if you're a business in the US and you have employees or customers who are EU citizens, you need to comply with GDPR provisions in handling / managing data relating to those persons.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 7,
                      "content": "And yet, if this bar is in the U.S. and OP is a EU citizen, it still wouldn’t apply.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This ^^",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 224,
      "content": "Nah NTA. Stalking is a very real and serious issue. He had no business passing your info around bc as you mentioned, you don’t know these people like that. It’s quite a privilege to not worry about things like that and I truly hope no one has to experience it. However the world can be unkind and even less empathetic to victims so I understand your concern.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 196,
      "content": "NTA\n\nThat bartender seriously crossed the line.  It doesn’t matter if they were “messing around” - their form of “messing around” involves sharing people’s personal info with complete strangers!!!\n\nHonestly this could have been so much worse too.  Some people use their military ID instead of their driver’s license - if that bartender had started showing strangers my military ID I would have raised a scene right then and there, and not felt a lick of guilt about it.",
      "id": 99,
      "comments": [
        {
          "score": 37,
          "content": "I would have asked the bartender and other stranger for their ID so you can go pass it around to other strangers and get their opinions on their face and how old they might be.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 139,
      "content": "Naw. No way in hell are you the a-hole on this one.\n\nNTA\n\nYou just got doxxed against your will. I get it that your friends know this guy, but the fact is you didn't.",
      "id": 101,
      "comments": [
        {
          "score": 2,
          "content": "Just FYI, your comment would be classified as a NAH by the bot.",
          "id": 102,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 98,
      "content": "By reporting this you saved someone else from this. It may have been intended as a joke, but they can have real consequences regardless.",
      "id": 103,
      "comments": [],
      "relation": "Support"
    }
  ]
}