{
  "post content": "My (30sF) husband (30sM) is graduating college. His class decided to go out to celebrate with drinks after their exams. He said significant others weren't invited. \n\nI had a routine check-up with my primary just before the celebration started and she found a lump on my breast. I'm young, but have a history of breast cancer on my mom's side (my aunt died before the age of 35 from it). She wanted me to get a biopsy that day and referred me to the correct place. \n\nIt was going to be a few hours before they could see me as they were doing her a favor and it was obviously short notice. I was a crying mess, so my husband reluctantly agreed for me to come wait with him at the bar for my appointment time. \n\nI got to the bar, introductions were made and although I was quite scared, I felt I was nice to everyone and as talkative as I could be. \n\nI left my husband at the bar with his classmates and went for the biopsy, followed by a mammogram. It was terrifying, but my doctor was great and a nurse held my hand through it all. \n\nWhen I got home, my husband was pissed at me. Apparently I offended his classmates because I was standoffish and rude to them, and in their words \"just an overall downer that brought down the mood of the celebration\". He said I embarrassed him and he regretted having me join them.\n\nI now feel terrible like I ruined his day to celebrate with his friends and maybe should have just kept the situation to myself so as not to bring him and them down.\n\n*Edit Key Points*\n- Yes, husband knew all details of cancer scare as soon as first appt ended. \n- I'm the only one working while he's in school. I do NOT pay for his school. \nAnd just in case anyone other than the super kind person is wondering:\n- I've taken him to a nice dinner after every milestone was passed (and as a consolation if things haven't gone great).\n- I worked a side job while he's in class to save up secret money and bought him a private deep sea fishing charter for his graduation gift. I am not a bad wife. I do what I can within my limited means.\n\n\n\n*Edit/Update*\n\nFirst of all, I need to thank each and every one of you for the outpouring of love and support. I've never felt that in my life and I'm beyond thankful for it now. This subreddit and all of you not only changed my life in a 24 hour whirlwind, but you may have also saved it. \n\nWhen I came on here, I really didn't realize any of the things I know now. I truly thought I was in the wrong, but had a nagging feeling that wouldn't go away. I saw this subreddit on a FB post and felt it could help me figure out if the nagging insistence had a purpose. I'm glad I did. Even with the not so nice responses, I realized I'm not only NOT TA in this particular instance, but I probably haven't been for a lot of instances. \n\nI copied what I commented yesterday and have included it below. It was an interesting and educational night so, I'll include anything that may be important before the commented update. \n\nWhile I have acquaintances here, I don't particularly have anyone I'd call a friend and I'm only just realizing through contacting people that any friendships I tried to make were thwarted by my husband. \n\nI spent most of the night doing research about various things and I'm feeling confident that pretty much all of you are right in your suspicions about him and what my next steps should and will be. \n\nIf I'm allowed to, I'll update with my results when they come in, but unfortunately still no word yet. \n\nSorry for the book. 😬 \n\n*Commented Update*\n\nA girl from my husband's class saw this post and recognized enough of the situation to reach out to me. She was present at the bar when I was there, I was too dazed to give her a second thought. My husband was so upset by me needing to make an appearance, because he had led everyone to believe we were in the midst of a divorce. Significant others were more than welcome, my husband told me that so I wouldn't go. He saw me calling and stepped away from the group. She said he looked like he was yelling at someone, even though his tone was calm and low to me. She also said it was the only call he received and that he did not make any calls. \n\nWhy would he say we're getting divorced if we're not? Because he is having an affair with the girl that reached out. He didn't tell anyone why I was really there at the bar. No one said I was a downer (to her knowledge). She saw my post, put two and two together and felt sick. So she reached out. He gave her a sob story that made him sound like a hero for \"taking care of me through the divorce process because I'm broke and alone\". She had screenshots of conversations between them and details that make me dizzy. This has been going on for almost the entire length of the program he is in. \n\nI confronted him. \nI'm livid. I'm nauseated. He told me they said I was a downer so I'd be too ashamed to reach out to any of them following me meeting them so he could keep the lie going. He planned on leaving me once he graduated because he wouldn't need me anymore. Me possibly having cancer threw a wrench in the plan. He is unapologetic. She was apparently a fling because he was bored with school. \n\nI didn't cry. I didn't yell. I am in my bathroom currently trying to figure out wth my life has become and what I need to do next. \n\nSide note, he finally asked me how serious the biopsy went. \n\nSo... at this point, even if I was the ass hole, I'm not sorry. Except for the fact that I can't get a refund for the stupid fishing trip. \n\nI don't want this to be my life. I really don't.\n\n\n\n\n\n*Final Edit/Update*\n\n\nI hope this doesn't break the rules. \nI apologize that it has taken so long to update, things have been very bad and moving faster than I can handle. \n\nFirst and foremost, the results were not nearly as good as hoped and were worse than expected. I have Stage II Grade 3 TNBC. My doctor did a blood test and I have the BRCA1 gene mutation. Lucky me. I'm working very closely with my doctors and intend to fight like hell. \n\nI'm separated from AH. He told me he wasn't sorry for how he treated me until my results came back and now he feels bad because \"there was a reason to be worried after all\". He wanted me to ignore everything I'd found out (the lying, the cheating, etc) and let him \"be there for me and take care of me\"... I'd rather go it alone. \n\nI will not be seeking a friendship with the girl he cheated with as one redditor suggested. She has outted him to their class and has blocked him. She continued to try to reach out, but I told her that due to obvious reasons, it's just upsetting and preventing me from moving on. \n\nMultiple people I know have shown this all to my family, they're trying to make amends, but they're toxic as well so I'm avoiding that.\n\nI know I need a support base, but it seems to be slim pickings. \n\nI won't be updating here again. I have a fight and a half ahead of me that will require all of my attention and energy. Thank you for everyone reaching out and requesting updates. I really do feel less alone because of you. \n\nSo, yeah. That's all I have for you.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "NTA I've been through what you went threw and I'm so sorry your sad excuse for a husband wasn't buy your side supporting you and fuck his friends! I hope there next shit is a hedgehog... Good luck op you deserve so much better",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. \"Sorry, lads, I have an unexpected personal issue that I have to attend to. I won't be able to make it out after all. I'll catch you next time.\" is all her should have needed to say to clear his availability to be with you, WHICH IS ABSOLUTELY WHAT HE SHOULD HAVE DONE.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH only because you didn't know that you were ruining the mood and you were reasonably anxious, and your husband is right to be pissed off that his friends were kinda angry at him for taking a downer to the party, but you should still say sorry to him and he should excuse himself for blaming you for something you can't control.",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "[removed]",
          "id": 5,
          "comments": [
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 6,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Shall I also apologize to him for ruining his lie that he told his classmates and mistress? Just wondering how far I need to take this apology.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 8,
          "comments": [
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "I’m sorry to hear you married this dude. He’s the AH, hands down. You are not even on the same planet, you are so, so, so NTA. Here’s how it should have gone: you — this happened, can I wait with you. Him — no way, I’m leaving now to come with you, where shall we meet? Because what kind of Asshole stays at a party while his wife is getting a breast biopsy?!?!? How lovely that there was a nurse to hold your hand, but that should have been your husband. I am furious on your behalf.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "I'm so sad for you, I really really hope you find a good support base because you really need it. I hate that your husband did this to you",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA- but could your husband be a bigger asshole? I think not!",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. You found out really scary news and rather than meet you at the clinic and stay with you through your testing, your husband had you wait at the bar with him and was upset you weren't cheery enough while waiting for a biopsy?\n\nI hope that degree is not in a helping profession because he should have failed out.\n\nI hope you hear good news soon.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "All things considered I'm a pretty piss poor husband, but I would have been at your appts and not a bar.\n\nNTA. Hope you're ok!",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Hope you feel better OP",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Man. This post is a downer because I'm tired of seeing what people do to their partners. That doesn't make you a downer or a bad person. Was he not allowed to go to your appointment? Eta: OP said yes in a comment. OP deserves better. \n\nThe only reason I would ever get married was to have someone hold my hand when I was scared otherwise what are you doing? I hope you can refund the fishing trip and use it for a divorce.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    }
  ]
}