{
  "post content": "Months ago, my wife and I got a great deal on a family cruise with our kids up to Alaska (late summer trip). Since that time, I have paid off the cruise, scheduled/paid-for a number of upgrades (tours, drink packages, etc.), flights from our home city, hotel arrangements so we can tour the port city, airport parking, etc. I have also made arrangements with family in the port city to visit with them for a few days before our sailing date. My wife on the other hand has been watching cruise videos on YouTube, as well as talked to friends that are in a much higher income bracket than we are and decided the ship we are sailing on is too small (it’s the smallest ship in this particular line’s fleet). She has been on one cruise in her life on a similarly sized ship and had a good time but apparently this one does not have enough activities to keep our kids out of her hair (it has a kids club, arcade, and pool, etc. but what do I know). She has looked online for other cruises and found one on the same line that is leaving the same port a day earlier and is three days shorter that she likes better. She has asked (it feels more like a demand) that I call the cruise company and change over to this trip, then change everything else associated with it (flights, car rental, hotels, time with family – which will now be a day less, etc.). I looked at just the base cost of the new cruise on the bigger ship and it would cost us significantly more (new shorter cruise = old longer cruise with all of the tours and add-ons added on). I already think our budget is being stretched by this trip as it is presently scheduled. My answer was and continues to be a very firm “no”. She is now upset with me and thinks I am being unreasonable (code for A-hole).",
  "id": 1,
  "comments": [
    {
      "score": 6968,
      "content": "NTA. This feels like it has less to do with the activities for your children and more like she’s clout chasing and trying to keep up with her wealthier friends. She doesn’t seem to appreciate any of your effort. If this trip isn’t good enough for her, I’d offer to cancel the entire thing.",
      "id": 2,
      "comments": [
        {
          "score": 1729,
          "content": "Or you and the kids go and enjoy it and she can have a staycation at home and try to fake pics showing her on the bigger fancier boat as it seems the only thing that matters to her is looking like she’s on the same financial level as her friends/ the people she sucks up to to make herself seem important. \n\nNTA- you planned the trip it’s already booked and paid for the Time for changes has long passed.",
          "id": 3,
          "comments": [
            {
              "score": 502,
              "content": "lol. I like the thought of them going without her. I imagine she's going to be a jerk the whole time, complaining about everything.",
              "id": 4,
              "comments": [
                {
                  "score": 279,
                  "content": "My father will regret for the rest of his life not taking my mother’s luggage out of the trunk and taking me and my brother to Baltimore himself instead of the three of us sitting in the car for an hour waiting for her while she did some critical weeding of the flowerbeds. Inconsiderate people who ruin vacations just by being themselves is the worst.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 61,
                      "content": "That sounds so unhinged.\n\nLike, how did she come back from that? Throw the weeds away, wash her hands and say \"okay let's go\"?\n\nMy father was the one who tormented us, but he was just aggressive-aggressive about it, so everyone was crying, or fighting, or frightened. \n\nSorry such things happened to you. I hope you're free and happy now, in a safe place!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Sounds like my exhusband. The running joke was “are you sure you don’t want to just refinish the floors real quick before we go?” We were late for literally everything because he felt the need to do things that he put off for weeks right before we had to leave for something.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Seriously? Wow just wow!",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "She had a weed emergency",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I’m picturing him honking the horn until all the neighbors stared at her. Too bad he was too polite.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "She sounds like my oldest sister.  My husband and I do not have children and she has 4 young boys.  The last family vacation that we went on involving her was met with \"it's not fair, we wont get to enjoy the trip like you guys can!\" (ie. she was annoyed she would be responsible for her 4 boys even though my mom paid for her friend and their nanny to come with us.)\n\nShe even tried to conveniently leave 1-2 of her kids with us while she  and my BIL wandered off numerous times.  4 adults to take care of 4 boys and she still tried to leave them with me and my husband.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yup, every family event, my sister expects everyone else to watch her kids. I ran out into the road to save her kid that suddenly decided to dart, and thankfully the driver was being cautious, and she had the nerve to be shocked that I went off on her instead of my 2 year old niece. She's not only late to every event but over stays her welcome, and some things have now become \"kid free\" solely because of her. If a TV is on, one kid could be murdering the other, and she wouldn't notice.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 207,
              "content": "Apparently, she does not realize that cancellation fees are no joke.",
              "id": 13,
              "comments": [
                {
                  "score": 53,
                  "content": "I found that out late last year when we had to cancel a cruise due to my husband's open-heart surgery.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I hope he’s doing well now.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "For real!  With our parents aging and our kid's school/sports schedule always changing, we have started springing for trip insurance.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -10,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 9,
                      "content": "that wont cover all the other altered fees like the hotel stay, car rental and flight changes... presuming the cruise company are kind and good and wont charge a fee for the \"upgrade\" to a larger and fancier boat than what is in their budget",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "…As long as you haven’t made the final payment, which is usually due 60-90 days before the cruise. Once FP has been made, you’re stuck with it. \n\nOtherwise, if it’s for medical reasons, then that’s where your travel insurance comes into play.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "If she stays home at least then, the kids will be \"out of her hair.\"",
              "id": 20,
              "comments": [
                {
                  "score": 79,
                  "content": "Parent of younger kids here. If you want the kids out of your hair, you don’t go on a “family vacation,” you go on a couple’s vacation. Traveling with kids and proceeding to pawn them off on other people is not a family bonding experience.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I've got a kid and the difference between bringing them along and having them stay with family/babysitter is astronomically different. It's a lot more relaxing when you only have to worry about yourself instead of making sure your kid is happy and behaving as well.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "It sounds like she needs new friends. Nta at all op",
              "id": 23,
              "comments": [
                {
                  "score": 11,
                  "content": "And OP needs a new wife that isn’t broken with entitlement.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well damn.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Honestly, it should be her responsibility to find some extra money if it’s important to her and even then, it’s really too late to change this particular trip. But if she wants to be fancy next time, she can start selling baked goods or crafts or babysitting or dog walking on the side. Or she can give up her personal spending budget (if you don’t have one, I strongly recommend that you each get a small fun budget each month so she can save up for frivolous things that she wants so she can learn the value of saving).",
          "id": 26,
          "comments": [
            {
              "score": 104,
              "content": "Don't forget to hand her the hassle of changing all the plans.",
              "id": 27,
              "comments": [
                {
                  "score": 84,
                  "content": "don't forget the fees associated with changing all of those plans too",
                  "id": 28,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Could also be the family in the port city have already made plans for the day that would be cut out because of the changes. She'll get to deal with that too.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 207,
          "content": "Honestly I'd rather go on a longer cruise on a smaller ship with multiple activities that you've paid up for.  \n\n I love to travel and sometimes you get a better experience not going big.  (Ex:. If I go on a trip I book a cheaper but comfortable hotel and splurge on a fancy dinner because for me a high end dining experience is fulfilling.)",
          "id": 30,
          "comments": [
            {
              "score": 56,
              "content": "We try to book the nicest but cheapest place to stay and spend $ on activities.  Like we're visiting my SS out of state over summer and will find a reasonable airbnb but also picked up some used OHVs and will buy safety gear and maybe rent a boat for fishing to have experiences.\n\nI've found quality of life has improved significantly since focusing less on buying things and more on having experiences.",
              "id": 31,
              "comments": [
                {
                  "score": 42,
                  "content": "Recognising what things you really enjoy is important for vacations.\n\nI mean, large comfortable hotel rooms, central location, fantastic dinners, great museums, interesting tours, luxury cocktails, popular shows, great seats at shows are all the perfect vacation for someone.\n\nBut you generally can't pick them all so get the cheap hotel close to everything or the nice hotel and Metro to the sites, etc, etc...\n\nIn this case, switching to \"nicer\" cruise would likely not be enough. So then you're buying all the extras anyhow.\n\nThen you're broke",
                  "id": 32,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[deleted]",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This is absolutely the way. We upgraded to wicked suite at rhe Ritz in San Juan. Do I talk about that? No. Do I have a 2 cocktail story about how we got stranded at the top of a mountain in Spain, after 4pm, in November? A million times to whoever will listen! No one can replace THOSE kinds of experiences",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I actually just commented on another post with a similar topic that we do the same. Reasonable AirBnB’s, try to cook most of our meals, travel off season if we can. That way we can spend more on what’s more important and usually stay a little bit longer. We also like a good mix of activities on our vacations",
                  "id": 35,
                  "comments": [
                    {
                      "score": 2,
                      "content": "They is /was the best part of rentals bring your own food and wine and hang in comfy clothes have friends come eat good (cheap) meal no stress about the bill so much more relaxed - no reservations needed 👍",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Just to add--smaller ships actually feel more luxurious because they're intimate and the staff are so attentive.  There's better staff-to-client ratio, less crowding, friendly and well-seasoned passengers, \\*more\\* activities relative to the ship size (unless the wife requires an ice rink and rock wall).  \n\nThe best cruise I've ever been was on a Silversea ship and there were \"only\" 500ish passengers, compared to 5000+ on Royal Caribbean.  OP's wife is shooting herself in the foot.",
              "id": 37,
              "comments": [
                {
                  "score": 27,
                  "content": "I really don't understand the allure of ships with capacities bigger than the population of my hometown.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I don't understand the allure of going on a cruise in the first place",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Ships like… Allure 🤣",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Jumping on one of the top comments, hoping OL will see this:\n\nI'm married to a senior officer for a cruise company. Even though I prefer bigger motor vessels, for no special reason besides that I don't want to see the same faces every time (I'm an introvert in disguise) the truth is that smaller vessels can go where the big ones can't. That is even more important in cruises such as Alaska and Antarctica. I've never been to Alaska, but that might be the difference between docking on the dock or having to use tenders. The dock is way better and saves you a lot of time. Keep the cruise you booked\n\nYou are NTA.",
              "id": 41,
              "comments": [
                {
                  "score": 12,
                  "content": "I lived in a port city for a few years and during that time a couple of those really big cruise ships visited. While they could dock it was only possible in the outer port which was normally reserved for container ships and possibly oil tankers. So the cruise lines had to charter buses to take passengers through rather ugly industrial areas into the city itself, and also make sure either journey was nowhere near rush hour. \n\nSmaller ships could instead dock smack dab in the middle of the city.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This!  Smaller ships are better--more like a ship than a floating resort.  If I wanted a resort, I'd do a land vacation.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I personally think smaller ships are better, fewer people should mean a better experience on excursions, faster loading & unloading. So much of these cruises are “at sea” anyway I’d think the longer cruise would have better exploration of the area too.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also, it's can be better to not have the kids on a super fancy cruise for their first cruise. That saves you from feeling like you need to \"top\" it for the next one. Kind of like flying first class for your first flight...",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I worked for a cruise line for a few years. The smaller ships tend to offer much better experiences all around. It’s funny that OP’s wife is clout chasing by booking the bigger ship as that’s the opposite of what the wealthy do.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Agreed, sounds very much like OPs wife wants a ' fancier ' cruise to be able to show off to others' . Everything is paid for now, it makes no sense to change everything for a trip that would be 3 days shorter. Just an unreasonable demand.",
          "id": 47,
          "comments": [
            {
              "score": 16,
              "content": "I don't know.  I did a 7 day Alaska cruise on one of the smaller/cheaper ships and it sucked.\n\nThere was very little to do on the ship and it was very boring. My kids were were adults and they were also bored silly.  I can only imagine how bad that trip would have been with smaller kids.\n\nOne of the few activities they had was a cooking class where they had a bunch of cooking stations where you'd follow along with the instructor to make yourself a gourmet meal.  We found out once we were actually aboard that it was only like that on the bigger ships.  For our ship you just sat on folding chairs and watched the presenter cook.",
              "id": 48,
              "comments": [
                {
                  "score": 5,
                  "content": ">One of the few activities they had was a cooking class where they had a bunch of cooking stations where you'd follow along with the instructor to make yourself a gourmet meal.  We found out once we were actually aboard that it was only like that on the bigger ships.  For our ship you just sat on folding chairs and watched the presenter cook.\n\nI was on one of the bigger ships - and it also was that you got to sit on the folding chairs and watch the presenter cook. Apparently they used to do it hands-on, but they stopped for liability reasons (one too many guests cut their fingers, got burns, and/or gave themselves food poisoning by not cooking properly)\n\nI wandered off in the middle, as it was more interesting to chat with the bored bartender than to watch the presentation and listen to the crackling distorted microphones on the pool deck.",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I see your point, but I wondered if anyone else noticed the comment about keeping the children out of HER hair.  It seems to imply that the entertaining of the children will, by and large, be her responsibility during this trip.  Which doesn't sound like a vacation. \n\nHad the husband said \"our kids: it would be one thing.  Maybe just a slip of the tongue. But it gives me vibes that he views the children as her responsibility,  so she wants more options so she can actually catch a break on this vacation.\n\nJust a different point of view to consider.\n\nEdited a typo.",
          "id": 50,
          "comments": [
            {
              "score": 35,
              "content": "I figured that was a quote from her, not his point of view.",
              "id": 51,
              "comments": [
                {
                  "score": 19,
                  "content": "That's how I took it, too.  It sounds like OP thinks there's enough to keep the kids occupied but his wife doesn't.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "[deleted]",
                  "id": 53,
                  "comments": [
                    {
                      "score": 9,
                      "content": "On the other hand, it could mean the exact opposite of what you think. Maybe OP doesn’t think it is her responsibility at all. It sounds like he planned for the kids to have things to do and for the family to do things together while she just wants to dump the children on him. There’s more than one way to look at this. That being said, there are two sides to every story, and it is hard for any of us to to really know the situation without actually being there and listening to the conversation.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Nope Just tell her you LL give her the budget for next year and let her organize everything. NTA",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Cruise lover! In my opinion the smaller boats are the absolute best! Same amenities with less people on board and less crowded excursions. Sounds like your wife is passing up on some serious happiness by not wanting what she has and wanting more! NTA",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "My wife is a recovering clout chaser. I agree with this comment 100%. NTA.",
          "id": 57,
          "comments": [
            {
              "score": 5,
              "content": "As far as things that are absolutely fucking toxic to bored wives, Clout Chasing is almost as bad as MLMs",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Cancel her ticket and take a grandma",
          "id": 59,
          "comments": [
            {
              "score": 2,
              "content": "Or a new girlfriend.",
              "id": 60,
              "comments": [
                {
                  "score": 2,
                  "content": "Omg hahaha why did I just GASP",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -23,
          "content": "You clearly have never been married",
          "id": 62,
          "comments": [
            {
              "score": 21,
              "content": "I'm married and if my husband suggested what this wife is I'd lay out a spread sheet for him to show him why the already planned trip is a better option (including the child activities available on the already booked cruise) and ask why exactly this one isn't good enough.",
              "id": 63,
              "comments": [
                {
                  "score": 16,
                  "content": "NTA this is \"keep up with the Joneses\" straight into bankruptcy.\n\nAlaska has fantastic wild landscapes, so if she insists, I recommend \"upgrading\" to a backpacking trip.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1372,
      "content": "NTA she sounds like a spoiled brat and it sounds like her \"friends\" convinced her that she should do more expensive things that she cannot actually afford. Keep saying no, and remind her that if she wants to go on an expensive trip like her friends then they can pay for it instead of you.",
      "id": 65,
      "comments": [
        {
          "score": 54,
          "content": "[deleted]",
          "id": 66,
          "comments": [
            {
              "score": 64,
              "content": "I think the commenter meant “they” as in the friends who are trying to convince her to have it changed to a bigger ship. I could be wrong though.",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "That is not how every couple arranges their finances. Some keep theirs separate for decades. Has nothing to do with being happy or committed. Even my parents have their own money and then joint account for shared stuff, and i literally do not know any couple that is happier than they are, they are still inseparable after 55 years of marriage, giggling and kissing... it is almost infuriating how they manage to be like it is still the first year of the marriage.",
              "id": 68,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "never said anything about his/her money but also at the same time, just because you are married to someone doesn't mean you automatically get to use the other person's money. Plenty of married couples have separate finances and then a joint bank account that they both put money into.",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "[removed]",
          "id": 70,
          "comments": [
            {
              "score": 11,
              "content": "u/RuleNo112 is a bot.",
              "id": 71,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "[removed]",
          "id": 72,
          "comments": [
            {
              "score": 2,
              "content": "u/Vegetable_Effect_496 is a bot.",
              "id": 73,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA. You need to encourage her to get friends in her income bracket or you will be getting divorced.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "I understand where you're coming from here...  but it makes me wonder WHY she can be a spoiled brat.  Does OP handle all the money and the wife has no conception of what they can or can not afford as a family?  Then a bit of financial awareness may solve this problem real quick.\n\nDo they potentially have the money, but disagree on how their money is budgeted?  If that's the case, why does OP's decision about how big the vacation budge should be, immediately overrun his wife's?\n\nWhat does their income and budget actually look like?  Is he spending tons of money on things she believes are superfluous, meanwhile he won't spend money on things she things are important, like family vacations and children's activities...\n\nthere's a lot left out here.  At best she's just unaware of their budget, and that's on BOTH of them for not having a clearly established budget they both agree on and can reference at times like this to determine what is or is not within their means.  At worst, OP's a gambling addict and his wife just wants ANY say in what their family spends money on...\n\nwe really have no way of knowing where in that spectrum this all falls based on what OP has told us.",
          "id": 75,
          "comments": [
            {
              "score": 65,
              "content": "The devil works hard but you’re working harder to put the blame on everyone except the adult woman here.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "\"It makes me wonder what factors could maybe possibly be there to blame this grown womans behaviour on the man\"\n\nFIFY",
              "id": 77,
              "comments": [
                {
                  "score": 0,
                  "content": "I'm just looking at this from my own life and experience.\n\nMy husband and I have a budget that includes saving for vacations.  We have sat down and looked at the places we want to take the kids, what that looks like in terms of money and time frame, and decided what amount of money we are able to save towards those goals... \n\nobviously stuff comes up, but my husband just started a new job in August, and I started a new job last May, so we just re-did this whole process in the past 6 months...\n\nwhen we plan vacations we both know what the budget we currently have is, and how much we're saving going forward.  So it's easy to look at options and know what is or is not realistic for us.  \n\nWhen I read OP's story he tells it like he found the deal, she okayed it, then he did everything else to arrange it, and now she's popping her head in, making suggestions that aren't realistic to their budget, which makes me wonder, why doesn't she know and understand their budget well enough to immediately know that what she's suggesting is not realistic for them?\n\nIt seems like there's been a breakdown BEFORE this particular situation started, where they are not on the same page...  so I wonder WHY?",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Nice try but it sounds like OP’s wife was fine with the vacation they booked until she talked to her rich friends and wanted to play Keeping up with the Joneses.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "It sounds like you expect all OPs to drop the entirety of their household budget within 3000 characters.",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Booking a family vacation takes alot of effort and planning! I feel for OP, i just booked my own family cruise vacation in March for Aug and it is stressful and exhausting. Finding the right cruise days that work around mine and my hubby's work schedule, mine you the cruise deposit ($600) is non-refundable for my cruise . Then looking for and booking flights for my family, its safer to book a flight the day before the cruise because of unforseen delays and to book your return flight in the afternoon in case debarkation takes long. Then the 1 night hotel near the port, parking for our car at the airport; excursion and cruise extras. Yes a lot of money but a lot of time and effort went into planning. I know if I was OP I would be very upset.",
              "id": 81,
              "comments": [
                {
                  "score": 2,
                  "content": "Planned a Norwegian Fjords cruise for my mom and I this summer because after my dad got cancer she realized how once things go bad you might not be able to do the traveling you always planned on.\n\nBetween picking an itinerary, finding dates that work for both of us, booking flights for both of us (including an extra leg to visit her mom in Germany for her), transport to/from the port, hotels before and after, and planning activities in a place I know nothing about, it has been a TON of work. And she’s just floating around, answering every question with, “we have plenty of time, we can just think about that later.”\n\nAt one point she asked what the benefit of having a travel agent would be and I said “they would be doing all the things I am doing instead.” It is an actual job!",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "I didn't say it wasn't complicated...  I said clear communication would have avoided this issue, and it's a red flag for the relationship, that the wife doesn't already understand what the vacation budget looks like.  She should be able to figure out for herself what is in or out of budget for their family without OP having to put his foot down about it.\n\nI just got back from a 2 week road trip to southern Utah with my 2 small kids and I wish all I had to do was pick a boat, select from a list of excursions that other people coordinate, get 2 days worth of hotels, and round trip flights...  instead I had to manage picking out hikes and backpacking trips based on weather changing, stream flows changing, and about 86 different deadlines for campground and backcountry permit reservations and lotteries.  Including some lotteries that can only be entered the day before the hike in question (which required finding internet service while camping).  So even though we started booking reservations 6 months ago, we still didn't know exactly what the itinerary would be until 18 hours before in some instances (lottery results at 4pm for a hike that starts at 9am the next day).\n\nBut we knew all that when we made the choice to take that vacation...  listening to someone say planning a vacation is hard is like listening to my old boss saying how hard it was to find a financial manager for her trust fund...  like, yeah...  what do you expect, it's still a privilege that that's how I get to use my time.  Complaining about how much effort it takes to plan a cruise just sounds ridiculous.\n\nObviously OP isn't going to rearrange THIS vacation, but he and his wife need to get on the same page so this doesn't happen again...  including sitting down and talking about how they want to prioritize their budget so they can both be happy with vacations.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The answer to “why the OP’s decision should overrun his wife’s” is that this particular trip has been planned for months. And now she suddenly wants to change it?\n\nIf she wants to try a cruise on a different class of ship they can do that on a future trip.",
              "id": 84,
              "comments": [
                {
                  "score": 0,
                  "content": "Yes, for THIS situation, they can't go back now.\n\nMy point was that OP is painting his wife as completely unreasonable in the broader sense of what they can or can not afford to spend on vacations, and that should be something that's decided together, as part of creating a budget and prioritizing what's important to them.\n\nIt should be clear to the wife what they can afford, but it doesn't appear to be...  so how do you fix that problem so that situations like this continue to occur?  It's a joint-relationship red flag to me that she doesn't seem to have the same priorities and understanding of their budget that OP does.  Makes me wonder where that disconnect happened.  That's all.\n\nSomething they should fix for the future.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 0,
                      "content": "You’re really reaching.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "What we do know is the wife agreed to this vacation when it was booked. She said nothing all this time as it was being paid off. Now that she's talked to her friends suddenly that's not good enough for her! You don't get to change your mind after the time frame for backing out without penalty occurs.\n\nThis is all about her trying to be like her friends that are richer than her! They might be right, that might be a better boat... But it's too late now! And she had all the information to begin with. If you go on a cruise line website you can see all their ships, so could have picked the different one in the beginning if that was actually what she wanted. They chose this one together and now only she wants to change it. She's the AH.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 749,
      "content": "NTA\n\nExplain how much these changes would cost.  Let your wife plan the next vacation.",
      "id": 88,
      "comments": [
        {
          "score": 361,
          "content": "Plan *and* pay for it.  Since wife wants the expensive upgrades, let her see just how much it will cost to have a lavish vacation.",
          "id": 89,
          "comments": [
            {
              "score": 188,
              "content": ">Plan   \n>  \n>and  \n>  \n> pay for it.\n\n\\*Without using credit cards that husband will be on the hook for.",
              "id": 90,
              "comments": [
                {
                  "score": 120,
                  "content": ">My wife also works and we have shared finances. This trip was paid for by both of us equally. I just handled all of the logistics.\n\nFrom another of OP's comments.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I realize this. But his wife still seems to not be realistic about what they can afford. So, if she was to plan a trip, he would be expected to pay for her going overboard because of the shared finances.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Right tell her she can plan and pay for the next one",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 474,
      "content": "Info. Did your wife agree to the original purchase and all of the tours and family meetup things or did you do it without her involvement?",
      "id": 94,
      "comments": [
        {
          "score": 758,
          "content": "She was 100% included in all of the planning and gave input and approval along each step of the process.",
          "id": 95,
          "comments": [
            {
              "score": 243,
              "content": "Nta",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "You should edit your post and include this, because that's the first question people will ask you.  Your post reads as if you planned everything without her input.",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "She’s nuts. Why does she care so much about the way people see her vs the way she actually is? That’s nuts. No one is gonna like her more just cause she went on a more expensive cruise, lol especially not her husband. Which is the only person’s opinion she should even care about 😹",
              "id": 98,
              "comments": [
                {
                  "score": 9,
                  "content": ">Why does she care so much about the way people see her vs the way she actually is?\n\nI mean...  OP implied that her rich friends are influencing her...  but SHE says she wants a bigger boat because it will have more activities for the children, which is probably true.  The larger the boat, the larger the number of common area activities.\n\nWe have no reason to think this is about Mommy-blogger, instagram, whatever stuff.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Sure, but the financial tradeoff means they can do more excursions from the smaller boat. So they can have more different experiences, which hopefully will also be enjoyable for the kids. Looking at a prior post from last year, the kids will be 13 and 9, so there’s lots of scope for them to enjoy the excursions. (Mind you, the prior post also says these are both boys with ADHD who can be a handful, so I can see why OP’s wife is looking for break opportunities.)",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I don’t find that as a valid reason to throw away all the money, time and effort they already spent. She should have thought about that when booking. She knew there was bigger boats when they first starting booking.\n\nAlso, the larger boat is a few less days then the original. You cant really do more with less time…",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Absolutely NTA. She is being thoroughly unreasonable, ungrateful and entirely feckless in re finances.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Then, absolutely NTA. This is supposed to be a vacation, not a photo op. From what you said, you’re stretching your budget to do this trip as planned. The family should be thankful that they even get to go on a cruise. Including your wife. It’s not a given to have to “keep up with the Jones’s”. Please enjoy your trip!",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "When you said that your wife wanted a different cruise in order to have the kids out of her hair, is it generally your wife who takes care of the kids, or is it generally more you, or do you both share equally? Does your wife agree with this assessment? I'm just curious on whether your wife is burned out and that comment about your kids maybe coming from a place of exhaustion **or** is this is a case of someone not really enjoying spending time with their kids? If the latter, then definitely NTA (and maybe this is a wakeup call for you?) if the former, I'd say that this may warrant a discussion with your wife about setting up a plan where each one of you will have some free time to relax without the kids for a bit so that you both get to reload your energy.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 201,
      "content": "NTA - it sounds like you put in a lot of time and effort into planning out the vacation so if anyone is unreasonable, it’s your wife. \n\nI also just can’t comprehend how she thinks that her suggestion is the better way to go considering the changes, the budgeting, etc. \n\nI guess my only question is, did you and your wife look at both options side by side to see the pros and cons of each?",
      "id": 105,
      "comments": [
        {
          "score": 4,
          "content": "[removed]",
          "id": 106,
          "comments": [
            {
              "score": 4,
              "content": "u/National_Profit7502 is a bot.",
              "id": 107,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 156,
      "content": "NTA and a couple of this i would like to add. 1) unless you got refundable tickets for cruise / airplane, you are not going to be able to change them without losing a ton of money. 2) Cruise lines use they smaller ships for Alaska cruise because biggest ones won't be able to dock in most of the ports, so even the one she found might be bigger, it won't be like a huge difference in classes. Also, Alaska is so beautiful that if the kids are \"bored\" take them to the top deck and look at those mountains!. Alaska is beautiful beyond words / pictures. I am confident you all will have a great time with the right mindset",
      "id": 108,
      "comments": [
        {
          "score": 47,
          "content": "Most of the time on Alaska cruises is spent off the ship anyway, the ships move between ports at night but you're docked all day and doing excursions or walking around the local town.\n\nOp is by far NTA, if his wife just wants to stay on the boat all day, Alaska cruise is not the cruise for that",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "For me I’d rather go on a smaller boat!  I don’t want to just be on a floating city- I want to see and experience things. A smaller boat likely will be closer to shore too",
          "id": 110,
          "comments": [
            {
              "score": 3,
              "content": "And closer to the glacier!",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And more personalized service.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Good point. The bigger ships have to dock away from the action so you spend more time on transport buses than is really necessary",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 132,
      "content": "She is the asshole, being able to even go on any cruise is a huge success that not many people in the world will ever be able to experience",
      "id": 114,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 96,
      "content": "Unless you purchased a refundable cruise fare it likely can't be changed or if so with lots of fees.  I'd call for your options and when they tell you no let it be the cruise lines \"fault\" you can't change.",
      "id": 115,
      "comments": [
        {
          "score": -4,
          "content": "[removed]",
          "id": 116,
          "comments": [
            {
              "score": 5,
              "content": "Bad bot! Report spam and harmful bots.",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "NTA big time. Sounds you have planned a great trip and I know how much work one have to put into this. \n\nPersonally I have a hard time with people snobbing up - I always go for longer, not so luxiorious trips  - The people you meet are often funnier, down to earth and who doesn't want to be away for a longer time. \n\nI would tell her she can plan, book and budget the next trip, but this one is perfect timed and arranged as it is.",
      "id": 118,
      "comments": [
        {
          "score": 14,
          "content": "I agree with your points and would add that as a fellow cruiser, I prefer smaller ships. They’re easier to navigate, activities rarely fill up so you can show up last minute if you decide to just go and wing it, and if you are social, smaller shops mean you run into the same people more and make those connections. \nMegaships just get so impersonal.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "NTA. Explain that you can't just call and change everything and get full value for what you paid. There will be change fees and you'll likely end up paying far more in addition to the fare differences. Suggest that next time you go on vacation, your wife plan the vacation, within a certain budget.",
      "id": 120,
      "comments": [],
      "relation": "Support"
    }
  ]
}