{
  "post content": "My MIL has made a small \"family quilt\" for all of her kids and their spouses (5 couples including us). The quilt is really cute, has the couple's names, their kids' names, and their favorite hobbies and things all done in stitching and cute little cloth pictures. I was really looking forward to getting ours because I admit I'm a bit of a hipster and I love home-made kitschy stuff like that for our home.\n\nShe recently finished her latest one for my husband's brother and I thought we were getting ours soon since my husband is the youngest. I asked my SIL (she got hers first) and she very awkwardly informed me that no such quilt will be coming our way. I was a bit upset and asked my husband to investigate. Turns out MIL has no intention of making a quilt for us because there's not enough to put on all the squares or whatever, basically meaning since we don't have kids we don't deserve a quilt because she can't be bothered.\n\nI message her directly about it because I'm just that kind of person. I like hearing it straight from the other guy. MIL says her fingers hurt after the first 4 quilts and she's taking a break. I ask her if it has anything to do with the fact that we have no kids (which she expressed negativity against in the past) and she says no even though I know it's a lie. I push her more and ask her when she thinks the quilt will be done after her little \"break\" and she kind of loses her temper and says there's no quilt and there never will be a quilt.\n\nI ask why and she says she's only interest in making quilts with her grandkids and things on them and we don't have enough hobbies and kids' hobbies to fill up a whole quilt. I tell her we have 2 beautiful dogs whom we love and could be put on there and she says \"I'm not making a whole quilt for a couple of goddamn dogs\" verbatim. I hang up and tell my husband and he's 100% on my side.\n\nBut now I got a really mean voice message from my SIL telling me that I crossed the line and am acting like a huge B\\*tch for no reason. I'm shocked because I have a great relationship with my SIL and she always defended me from other family bullshit. My husband wants no part in this now. AITA for what I said to my MIL?",
  "id": 1,
  "comments": [
    {
      "score": 24086,
      "content": "Honestly, YTA (with a side of ESH).\n\nYou are totally entitled to feel hurt that your MIL does not consider you quilt-worthy over what you probably correctly assume is the fact you do not have kids.\n\nBut you are not entitled to demand a quilt from her. This is a gift, she is free to choose to not give you one.\n\nYou are also free to make your conclusions about your relationship from that. She sucks, too, for not treating all her kids equally quilt-wise, but you asked about whether you were TA for saying what you did to her - and you were TA for demanding a handmade quilt, with a deadline to boot.",
      "id": 2,
      "comments": [
        {
          "score": 8874,
          "content": "Also the fact that the gift in question is a *quilt*. If this was any other gift, I’d say OP is 100% in the right but quilts are honestly so labor intensive and are generally meant to be passed down to your kids. \n\nAs someone who owns several heirloom quilts from great great grandmothers, I’m honestly a tad bit offended by OP’s reasoning for having one (“it’s hipster and kitschy and will make a fun throw!”). \n\nLike on one hand it’s never nice to give gifts that clearly exclude one party but on the other it feels wrong to be so demanding of such a heartfelt gift like a quilt.",
          "id": 3,
          "comments": [
            {
              "score": 3059,
              "content": "Yeah since I've started quilting people have demanded hundreds of dollars of free labor and materials of me. If you want a quilt, buy a vintage one or commission one. I'm not into the kitschy bit either, a handmade quilt isn't something to pick up at a home goods",
              "id": 4,
              "comments": [
                {
                  "score": 731,
                  "content": "Honestly that's the reason why I will most likely never own a quilt.   \nI think they're great but they're really expensive (and rightfully so) and I feel I would not \"get enough out of it\" to spend so much money on them.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 449,
                      "content": "Yeah I feel like that's the problem with handmade goods in general. I've wanted to get into making and selling a couple little things, but when I think of how much I would pay for x thing, vs how much that would mean I get paid per hour for making it, the math just never makes sense. If you're compensating someone adequately for their time, you're often overpaying for the use you're going to get out of it. \n\nThe solution is not to demand free shit like OP though. The solution is to cut your losses and get something factory made, or scrounge Goodwill (a good way to get inexpensive art), or fork over the cash and do it right.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 218,
                      "content": "I have so many, my grandma was a quilting Fool for years and years- well over five decades worth of art. And we are a small family, so the quilts got distributed as best as they could, landing me with 5, including my dad’s BEAUTIFUL huge baby quilt he took to college. \n\nThey are in storage. I want to showcase them but I just don’t have the room! They are treasures, though, and I can’t imagine ever parting with them.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "[deleted]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 279,
                  "content": ">Yeah since I've started quilting people have demanded hundreds of dollars of free labor and materials of me. If you want a quilt, buy a vintage one or commission one. I'm not into the kitschy bit either, a handmade quilt isn't something to pick up at a home goods\n\nI'm quite sad that the quilts my mother made me when I was 6 were destroyed in the intervening years, but she recently rediscovered her enjoyment of quilting and is considering joining her sisters, nieces and now her sister in law on a quilting conference!",
                  "id": 9,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That's awesome! It's so soothing and you really make something with lifetime quality.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "I’m a crocheter rather than a quilter, and it pisses me off when people demand gifts off me. Yarn costs money, nice yarn (which they want) is even more money. Then the sheer amount of time gifts like these take is ridiculous. Crafts are a labour of love, not an entitlement. \n\nOP is absolutely TA here for demanding a gift off their MIL. Especially when it’s reduced to something kitschy or quirky. If they want a quilt so badly they can learn to make one themselves.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I knit and the only person who ever gets to ask me to make anything is my wife. Demanding I make something for you is a good way to ensure that I will never make anything for you.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My mom makes quilts, and I am surprised how many people ask her for one. They take months and typically $200-300. Of course most don’t know that but it’s handmade. What do you expect?",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1849,
              "content": ">  (“it’s hipster and kitschy and will make a fun throw!”).\n\nThat made me cringe so hard.",
              "id": 14,
              "comments": [
                {
                  "score": 738,
                  "content": "Oh Gosh, me too!  My Mom was a quilter.  Her quilts were never kitschy!  They were beautiful works of art.  Sewing, knitting and crocheting 🧶 are expensive!  Yarn and materials are not cheap!  It can cost up to $40.00 to make a queen size blanket with the most inexpensive yarn.  Way more with the fancy stuff!",
                  "id": 15,
                  "comments": [
                    {
                      "score": 324,
                      "content": "I think you left out a 0 there — even cheap yarn can cost $400 in blanket quantities. If you want a blanket that feels nice, you could easily spend $1000 or more just on the yarn.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 293,
                      "content": "[deleted]",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 120,
                      "content": "If you spent more time on coupons and sales than on the actual crafting, and get the crappiest of crappiest yarns you can MAYBE get a baby blanket for 40 dollars. Not a queen size.   \n\nThis is why I'm not making stuff for others, I don't mind the time spent, I do mind the money.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Oh yeah, I'm a knitter and people are like Oh have you seen those poofy blankets knitted with giant yarn?  And I'm like yes, good luck washing it it will felt into oblivion and also that \"yarn\" is roving that will pill like fucking mad if you actually use it and also a blanket will probably cost $300 just in materials.    Most things I bring into my house have to pass the \"what happens if a cat vomits on it\" test.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "> Her quilts were never kitschy!\n\nThat's just so insulting to call her quilty \"kitschy\" the more I think about it.  \n\n\"Hey MIL can you make this really intimate and work intensive piece because I find it to be ironically cheep and ugly?\"\n\n\"FUCK YOU MIL YOU JUST WONT MAKE IT BECAUSE WE DON'T HAVE KIDS!\"",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "[deleted]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Up to $40?  Not these days.  I'm crocheting a queen sized afghan right now.  I have used fairly inexpensive yarn and waited for it to go on sale.  I searched all of the shops on the internet and used coupon codes and free shipping.  So far, i have about $160 invested.  I'm hoping that's enough.  \n\nQuilting is very labor intensive and expensive.  And you don't call an heirloom piece \"kitschy.\"  You don't toss it over the back of the couch where the dogs could get to it.  You put it in a place of honor and treasure it.\n\nYTA, op.  I wouldn't make you anything either.  You seem to think you're entitled to it but it doesn't sound like you deserve it.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "A double bed sized blanket that was basically a giant granny square cost about £50 worth of bernat chunky blanket skeins. Took about 3 weeks of almost non-stop crocheting. My boyfriend’s mum never asked for it, and she almost cried when I gave it to her for her birthday. \n\nI can’t imagine putting that much time and effort in for someone who nags and basically demands one.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "same, grandma quilts and has made me a nice one. but man that attitude hurts",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": ">That made me cringe so hard.\n\nThe one, two punch of that plus inferring that her dogs are equivalent to kids made me want to irrationally just judge OP as YTA.  Like, I love animals too, but they're not children, and I'm sure grandma doesn't show off pictures of OP's dogs when comparing grandkids with their friends.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I've got a solution for everyone.\n\nOP can just have a kid. It's hipster and kitschy to have kids these days. Then MIL will make a quilt. Problem solved.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I know, might be the real reason mil doesn’t want to make it. I like to craft but would rather give my creations to people who appreciate them.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "to be fair - OP did not say \"and will make a fun throw\" unless there was an edit I didn't notice. It's not nice to misquote (DudeComeOn - was actually quoting another person who (I believe) misquoted.  \n\nAll that said YTA. You feel how you feel, so that isn't the problem - but the confrontation and demand of a work of love is cringeworthy.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 5,
                      "content": "If you look at the \"bot post\" that posts the original post the comment section.    There was no mention of \"It's hipster and kitschy\"\n\nSo it could be a misquote but I am inclined to think OP has edited this a few times.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "that is where they lost me too.  \n\n\nand \"I message her about it directly because i'm that kind of person\"\n\nand \"I push her more and more\".  Maybe it wasn't about the OP not having kids, but after all the pushing and confrontation over an extensive project they were fed up!",
                  "id": 30,
                  "comments": [
                    {
                      "score": 9,
                      "content": "> I message her about it directly because i'm that kind of person\n\nI always assume that anyone who uses \"because I'm that kind of person\" in any context.  Is a douche.\n\nDon't forget\n\n> I asked her when I thought she'd be done with her break and when she thinks she will get the quilt will be done\n\nThat's paraphrased.   But still.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 909,
              "content": "Agree 100%. I get the feeling OP has no idea how much work goes into a quilt, and the thought of making one that will only last one generation before it ends up in a charity shop is sad. \n\nOn top of this, I much prefer knitting and sewing gifts for children as I feel like children don't care too much about style, and appreciate the item for what it is, even if it's not perfect. And parents are really appreciative of such a personal gift. I know it's a gross over generalisation, but homes with young families tend to be filled with children's drawings and sentimental stuff and a quilt will fit right in. If I was OPs MIL I'd be nervous to knit a quilt for someone with a distinct \"kitschy\" and \"hipster\" style in case I missed the mark. It's SO personal and SO MUCH work just for OP to potentially decide it doesn't go with their colour scheme.",
              "id": 32,
              "comments": [
                {
                  "score": 514,
                  "content": "Yeah - \"I'm not making a whole quilt for a couple of goddamn dogs\" made me lol",
                  "id": 33,
                  "comments": [
                    {
                      "score": 532,
                      "content": "I get real tired of people acting like their dogs are equal to children. I’m totally on grandma’s side here.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "That needs to be embroidered on the quilt if it ever materializes!",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 754,
              "content": "Yes if she wants it so badly she could also make one herself. Or she could have asked her MIL to make one together, since the other one's were apparently made with the grandchildren. So her MIL is also passing on a skill to her grandchildren while making these.",
              "id": 36,
              "comments": [
                {
                  "score": 175,
                  "content": "I sew, and agree with this great suggestion! A great way to bond, for sure.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Yes I loved the bonding with my grandma when she was teaching me",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "My grandmother crocheted all her grandkids blankets, except me. I’m the youngest and she just never got around to mine, then her eyesight went bad. I’ll admit it hurt being the only grandkid without one. But, instead of getting mad or resentful about it, I taught myself to crochet and gave her a blanket I made for Christmas one year. She was very touched that I did that and gave me the book she had used to learn how to crochet. Now I have something special that she gave me that I’ll keep forever.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "missed that on the first read, that's a good point. the real gift isn't the pieces of fabric, it's the grandmother teaching her grandchildren how to quilt, passing on a skill, and making memories with them. she'll cherish that until she dies, and they will always remember that.\n\nSaying \"hey can you make me one too, lol maybe put my dogs on it, that would be cute\" is pretty lame.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "When OP said \"with the grandchildren\" I believe she meant with them on the quilt, not making the quilt with them.  I do agree that it is a great way to bond, one of my favorite childhood memories was my grandma teaching me to sew on a tea towel.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Absolutely. If she had simply said, “Can you teach me how to make a quilt?” I’m sure the MIL would have been excited that she took such an interest. OP should apologize and make amends.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Now that would be a very good way to do it. It would be a great bonding experience too. Hopefully that ship hasn’t sailed.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 647,
              "content": "Yeah a fucking handmade quilt is hard work for future generations, OP's MIL is right to not go through all that hard work for someone who will take it for granted and think of it as kitschy. The MIL is trying to be polite about it to not hurt OP's feelings, too.\n\nOP, YTA for being extremely entitled. It's like if you showed up at your MIL's house uninvited and got pissy at her over the free beer being Budweiser and not some obscure hipster brewery.",
              "id": 44,
              "comments": [
                {
                  "score": 241,
                  "content": "OP is def the asshole, but this analogy is bonkers.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Someone just really hates hipsters I think.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 635,
              "content": "Yeap. Don't think OP understands what quilts like these are about. These aren't rando throws OP they are like family gifts. \n\nYTA here for pushing a scenario because as much as you want to \"hear it straight from the other guy\" sometimes it's necessary to read the room before that step. \n\nIf your MiL had out right denied you to your face this MIGHT have a hint of ESH. She didn't though she tried to diplomatically dodge it until you forced an answer and now feel entitled to a gift. Gifts are given voluntarily, no one can demand one. How would you feel that now after this argument she makes you one? It won't feel proper or wholesome. Its unfortunate maybe but YTA for making the situation sour.",
              "id": 47,
              "comments": [
                {
                  "score": 251,
                  "content": "Didn't even think of this.  Actually serves OP right that now, even if her MIL changes her mind, OP will never have a quilt that isn't tarnished by the shit attitude she displayed.  MIL should make her a cheap ass blanket featuring a turd emoji.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 35,
                      "content": "I have a feeling there are lots of things in OPs life that are tarnished by their shit attitude...  but being so completely self absorbed, she's the persecuted party in each case - thus anything gained from it at all is viewed as a victory/ earned/deserved.\n\nOP is the worst kind of \"every day\" person.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Loooool. Hobby square [turd emoji]!!",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 197,
                  "content": "And who knows, maybe her reasons were legit and OP just talked herself out of a quilt. I don't quilt, but I do crochet and someone acting like OP did would put me off ever making anything for her even if I may have been inclined to previously.\n\nFirst, OP called to ask about when she would be getting a quilt, which is rude to start with. Then she dismissed the totally plausible reason that her MIL's hands hurt. I generally need a break, sometimes a long one, after finishing a big project. Someone ignoring that would definitely bother me.\n\nThen the OP demands other reasons since she won't accept that an old lady's hands might hurt after making a big quilt. She won't accept the answer about those other reasons and continues to press. I think that would drive most people to a breaking point.\n\nEven if I had been planning on making something for OP, this interaction would have made me mad enough to never want to make something for her.\n\nPerhaps MIL never wants to make a quilt for OP due to the lack of grandkids. Perhaps she does want to make a quilt for her son but needs a significant break before she's ready. Perhaps she doesn't currently want to make them a quilt because of the lack of kids but in the future will gradually change her mind as she comes to accept their decision.\n\nOne thing is for sure though, OP is never getting a quilt now.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yeap. And to top it off we got this one wierd poster (even made a sep thread for it lol then deleted it) running about calling the mil the asshole, and absolutely internalizing the issue regarding child bearing, totally ignoring that OP is being an entitled person.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "and can we maybe make the educated guess that OP is blunt and demanding in general?  OP was really rude and didn't adhere to social norms, I don't think it's a stretch to think maybe OP has been rude previously.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I feel like if she wanted it straight, she should have directly asked, \"I was told we weren't getting a quilt because we don't have children; is that true?\" And if she had said yes, then said, \"hey, it hurts is that we're not being included as much as part of the family since we don't have kids.\" Also, her husband should have confronted her, not OP.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 534,
              "content": "YTA\n\nExactly this! I know a lot of \"family quilters\" are typically a gift given to the grandchildren. If there are no grandchildren, then there are no quilts. It's a tradition from the old country, and there's a lot of love and work that goes into making these quilts. It's also one of the last things that grandparents can do for their grandchildren before they pass away, so it means more to the grandparents than the kids. \n\nGeneric/basic quilts don't mean anything and there's no sentimental attachment to them. You're asking the MIL to make a quilt for you because you're a hipster and don't appreciate the love, care, and effort she puts into them. There are thrift stores, rummage sales, and yard sales where you can find one.",
              "id": 55,
              "comments": [
                {
                  "score": 41,
                  "content": "For me the reason why it's YTA is it feels that this is a gift for the GRANDCHILDREN.  If this were a gift for MIL's kids than you might have a case (still probably could've handled it better) but it's more likely a gift for the grandchildren which you don't have.  This is coming from someone who is only one in my family who isn't married/long term partner.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "[deleted]",
                  "id": 57,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Sounds like you have a very loving family, u/FancyATitWank.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Gifting a quilt is so sentimental and important. In my family we only give quilts to those who have just overcome a struggle or made a big step or improvement in their life. When my mom had to get her heart surgery the whole family made a giant quilt for her (she uses it all the time). My Grandma got a quilt when she was pregnant with my aunt. \n\nOP shouldn't be demanding for a quilt no matter how much she wants one.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 329,
              "content": ">Also the fact that the gift in question is a   \n>  \n>quilt  \n>  \n>. If this was any other gift, I’d say OP is 100% in the right but quilts are honestly so labor intensive and are generally meant to be passed down to your kids.\n\n&#x200B;\n\nNo one is in the right to demand a gift of any sort from someone else.",
              "id": 60,
              "comments": [
                {
                  "score": 208,
                  "content": "Of course not, but it's not like OP was left out of ordering family t shirts or engraved glasses or something. This is hundreds of dollars worth of labor and materials. It's like demanding her MIL landscape her yard or re-tile her bathroom.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "THANK YOU.  Doesn't matter what the gift was, \"everybody else got one but we didn't!\" is so fucking childish.  Make a mental note and hold a little grudge if you want to, but don't go at someone or even ask why you didn't receive a gift.  Be a goddamn adult, you're not entitled to gifts.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "... especially the child-in law. If you feel your own parent is treating you unfairly, by all means confront them. However, I'd never do that as a child-in-law. You have less rights in that aspect.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yes!  If anyone was going to say something (and no one should!) it should have been the husband.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 163,
              "content": "And its fucking *expensive* to make a hand made quilt! My Husbands grandmother made us a beautiful quilt, and it took almost 2 years to make and a shit ton of money. A quilt is not a gift to demand!\nEdit: a word",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I get why OP is hurt but she seems to be great at stirring up the drama. Some things stuck out at me from the post. \n\n-She wants one because she is a hipster and thinks they’re fun and kitschy (cue the eyes rolling here)\n-The SIL that told her off has always stuck up for her in other family issues/conflicts (making me think OP has stirred up the family drama previously)\n-Putting a deadline on when she wants her MIL to “gift” her with a hand-crafted quilt by asking how long her MIL’s break will last\n-Equating her “beautiful dogs” with her MIL’s grandkids. Now, I have dogs, I have always had them and I will have them til I die most likely. However, to try to make pets equal to grandchildren to a grandmother is not only a losing battle, but will come off as highly offensive to her MIL and likely the entire rest of her in-laws. \n\nIn addition, quilts are very highly labor-intensive. I make jewelry and it’s also fairly labor-intensive and costly buying semiprecious beads and gems. I can spend a couple of hours just figuring out the style and beading on a single bracelet and it pisses me off when people see a piece I made for myself or someone else and want me to make it (free of charge of course) for them or their second cousin’s boyfriend’s coworker’s grandma whose birthday is coming up tomorrow. Grow up, OP. And for the record: YTA",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1429,
          "content": "Plus, the way /u/StockTurnip handled it completely blew any chance of MIL changing her mind or her other in-laws coming to her aid.  She should have let it go instead of interrogating her MIL.  Let MIL take her break, she may change her mind on her own, siblings-in-law may say something to their mother about maybe she should make one for OP and her husband too, etc.  Instead, OP has pretty much galvanized all of her in-laws against her with her entitled attitude.",
          "id": 67,
          "comments": [
            {
              "score": 1594,
              "content": "I almost can't believe after a woman made **four quilts** she was like \"my hands hurt, need break\"\n\nand OP actually went \"oh yeah? I know you're *lying* and you really just *hate me* because I don't have kids and *that's* why you haven't made me a quilt! Admit it you birch!\"",
              "id": 68,
              "comments": [
                {
                  "score": 944,
                  "content": "r/childfree in a nutshell. When you make “not having children” part of your political identity you start feeling persecuted for it, which is what we’re seeing here (with a side of “I have fur babies”).",
                  "id": 69,
                  "comments": [
                    {
                      "score": 769,
                      "content": ">with a side of “I have fur babies”\n\nTry handing down that quilt to those \"fur babies.\" Because (a) they'll die before you do, and (b) they'll just chew and piss on it. \"Fur babies\" are not the same as people. Jesus.\n\n\\[thank you kind gold-awarding redditor!\\]",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 400,
                      "content": "You can be childfree and not be a total bitch about it you know, it’s possible.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 149,
                      "content": "\"\"\"Dog mom\"\"\"",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "as someone who is childfree, vegan, and an atheist, i maintain that these groups are the most *absolutely irritating* internet communities out there. it drives me up a wall.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "I generally don't care who has or doesn't have kids, but people who think having pets is even remotely comparable to kids makes me lose my mind.\n\nIt's a great life choice for some, but when someone says \"that's just like when Fido...\" I just want to hit them.",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 321,
                  "content": ">Admit it you birch!  \n\nAt least she didn't call her a cedar",
                  "id": 75,
                  "comments": [
                    {
                      "score": 127,
                      "content": "Yew don't really know that she didn't.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "Ya darn maple!",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Hey, watch your language",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Cedar? I hardly know her!",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 274,
                  "content": "This is just gold r/choosingbeggars material right there.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I was going to say this too lol",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 240,
                  "content": "This is the part that pisses me off most about the story. She already made *four quilts* no shit she's tired! She also ran out of material so that's a good time for a break  If OP had any decency and just kept her mouth shut maybe she *would* have made another one at a later point.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 53,
                      "content": "[deleted]",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Just wait for OP to post this to r/JustNoMIL and be celebrated for her bravery to stand up to her MIL.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 416,
              "content": "Yeah I make gifts sometimes. Someone coming at me demanding to know when I would be dedicating hundreds of hours to make *their* gift would 100% guarantee that I would never effing do it. \n\n&#x200B;\n\nEntitlement is bad enough. Entitlement over hand-made gifts? YTA.",
              "id": 85,
              "comments": [
                {
                  "score": 16,
                  "content": "I do this with wood.   handmade and carved, sanded, finished items. After a few incidents with cavalier attitudes toward my effort (50+ man hours for each piece) - I've become a lot more picky about who i make things for.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I’ve been knitting for a few years and my husband’s cousin had a baby a few month ago so I made little baby shoes for the baby, showed them to a few friends who wanted to see it and said they’d love to learn now to knit. Anyway like 3 of them were like “omg when I have kids will you do some for them ? I’d need like 10.” And I’m like 1 it’s fucking expensive I made the baby socks/shoes with cashmere and merino wool 2 it takes time like sure on full speed I can make a shoe in 3 hours but after a pair my hands really hurt and 3 DON’T EVER DEMAND GIFTS ! It makes the situation so awkward ! Also if I did make their babies shoes it would be 1 pair not 10 ! \nIt’s one thing to be like “omg it’s so cute, I really wish I could make that/it makes me excited to see what you’ll do when I have a baby :P” but straight up place an order ? Like no.\n\nEdit: by the way OP YTA",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 406,
              "content": ".",
              "id": 88,
              "comments": [
                {
                  "score": 270,
                  "content": "She wanted to give them to her grandkids when they hit a major milestone into adulthood. Not everyone will hit the same milestones, take the same path, or on the same timeline, and it sounds like she understood that.\n\nShe sounds like she was a lovely lady, and you sound like you're a good, grateful grandchild who appreciates all the effort she put into it. If you'd been as entitled as the OP and demanded a gift, I suspect that you'd never have gotten one.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 27,
                      "content": ".",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Right in guessing that before OPs little outburst, they would have eventually gotten a quilt at some other milestone.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "For real.  If she had just let the MIL take her break then she might have become interested in making another quilt in a few months/years.  Who knows, by then they might have kids (or different dogs).",
              "id": 92,
              "comments": [
                {
                  "score": 15,
                  "content": "(or different dogs) LOL.  I see what you did there.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yea, if she had asked, MiL would have realized OP was interested in having one change her mind and make her. OP really screwed the pooch and just acted so entitled.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "\"Wtf??? We have two beautiful dogs why don't you consider them to be your grandchildren!!!?!?\"",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly what I was coming here to say. Either OP has just ruined their chance of receiving this gift orrr if mil takes the high road and makes the quilt anyway it will be a gift laden with resentment, and will likely be rushed and generally lacking in the love meant to be involved with these types of gifts. The physical quality would suffer but more importantly the emotional quality attached. \n\nYou blew it, OP.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "MIL: No sweetie I need to take a break, my fingers hurt\n\nOP: Okay but like could you make me one now tho? How long of a break? I totes love quilts\n\n&#x200B;\n\nYTA OP",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 924,
          "content": "Maybe MIL didn’t feel like making her a quilt cause she’s the “kind of person” who will call someone up and berate them for not giving her a gift.",
          "id": 98,
          "comments": [
            {
              "score": 382,
              "content": "Makes sense. look at the wording she uses for her mil.  \"When you'll be done from your LITTLE break\".",
              "id": 99,
              "comments": [
                {
                  "score": 291,
                  "content": "\"my hands are in pain, I have arthritis and I just finished 4 damn quilts\"\n\n\"shut up old lady, keep working, you get 15 minutes then you keep sewing my quilt. make sure you show the proper breed of my dog, get it wrong and you start again\"",
                  "id": 100,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Lol for some reason this reminds me of Dewey in Malcolm in the middle, \"the future is now old man!\"",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "\"The picture you used for my furbaby doesnt really capture his true personality. Start over lady, I'll be in the corner posting to r/childfree\"",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "\"My fingers hurt.\"\n\n\"Oh, well, now your back's gonna hurt, 'cause you just pulled landscaping duty. Anybody else's fingers hurt?... I didn't think so.\"",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "She's a shitstack AND a condescending one at that.  Even better.\n\nHubby needs to run while it's still cheap (pre kids)",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "As OP said herself \"I message her directly about it because I'm just that kind of person.\"   - The disrespect has probably happened before and MIL just doesn't give a fuck-all about this entitled shitstack of a woman. \n\nOP is really upset because she's a self professed hipster who really really really wanted to feel special over a homemade quilt.  If this emotional child had ever done an ounce of laborious work in her own life she'd understand how much work a quilt is, and how the \"my hands hurt\" is probably the exact right truth.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Sounds about right with OP saying her SIL has had to defend her in the past several times from the rest of the in-laws. It sounds like shes the wife everyone hates and I'm beginning to see why.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 792,
          "content": "I feel like this would fit into r/choosingbeggars if it were told from the other side.",
          "id": 107,
          "comments": [
            {
              "score": 245,
              "content": "Even this version belongs there",
              "id": 108,
              "comments": [
                {
                  "score": 20,
                  "content": "You're right, for some reason the anecdotal posts just stick in my mind better than the screenshot posts (aside from NEXT lady but she transcends the genre)",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "My first thought...",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "YES",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Here from r/ChoosingBeggars",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 548,
          "content": "The mother in law tried to bow out somewhat gracefully. Said her finger's are tired (they probably are). When badgered into it says she doesn't think she could fill up a quilt for two people. OP then demands her dogs are treated the same as grandchildren. I have pets. I love my pets. That's a level of entitlement that fucking boggles my mind. \n\nThere's some other info that could really shine a light on who the asshole is here. Are OP and her husband unable to conceive? Have they had miscarriages? Does the MIL know this? Then MIL is an asshole in my books.\n\nDid OP and her husband choose to not have kids? Are they just freshly married, young, and waiting to have kids? Then OP is a massive fucking asshole. Either the MIL was going to wait until they had kids, or OP needs to realize just as they're choosing to not have kids, the MIL can choose not to make them a quilt.\n\nIn very family oriented families, mine included, grandparents pass their inheritance down to the grandkids, split equally. It's a bit of a family tradition. It specifically will exclude people who don't have kids from inheriting. It's not on purpose, it's because they figure someone in their 50's or 60's is established and doesnt really need the help, while the grandkids do. Imagine OP in that scenario.",
          "id": 113,
          "comments": [
            {
              "score": 203,
              "content": "I’m going through some stuff with my family where my DH and I are being treated as lesser because we aren’t providing grandchildren. We have chosen not to have kids because my husband has a serious genetic heart condition that we feel is unethical to pass on. \n\nThere are many reasons people don’t have kids, including ones like ours or inability to conceive. Thank you for at least recognizing that may be the case here and that while OP is being a jerk for demanding a quilt, the MIL is not necessarily totally in the clear.",
              "id": 114,
              "comments": [
                {
                  "score": 48,
                  "content": "Sorry to hear that. Hope you guys live your lives to the fullest.\n\nI don't have kids when my siblings do. They for sure monopolize the grandparent time. Does it suck? Yeah, a bit. On the other hand, grandparents get all the fun stuff from parenting, without having to do any of the heavy lifting, and it gives them purpose later in life.\n\nI don't think it's intentional.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Thank you! We do try to live lift to the fullest, though what that means has changed for my husband over time. \n\nIt just would nice to be treated with a little more empathy from especially my parents regarding our procreation status. Under other circumstances, we likely would have given them the grandchild they so badly want. Instead we have a dog (and no, I don’t insist that she be considered equal with a grandchild) and we try to spoil our nieces/nephews as much as possible.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "I feel for OP though because my grandparents have made it obvious that I am not a favorite grandkid. No one is obligated to get a gift but when all the grandkids get a gift except for me and my siblings, something is wrong. My reaction was just to limit contact",
                  "id": 117,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yes - as a victim of some pretty revolting parental favoritism (and my son is catching it even worse) , it's really hard for me to not side with anyone who is getting the short end of the stick in that respect. And in other cases, I've seen the anger from that come out in a single incident that wouldn't seem like a big deal if you didn't know the context. \n\nIt wouldn't surprise me to hear that this isn't the first time OP's husband has been the forgotten one when MIL is handing shit out, and this is a symptom of things coming to a head. If the OP was newer, I'd probably do an INFO request about that.\n\nMy reaction to my parents is similar to what you're doing, BTW... very limited contact and an assurance that I'm not doing a goddamn thing to help them when they get infirm.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This is what I was thinking.  There may be a lot of hurt feelings on OPs side bc they have chosen not to have kids and the in laws are treating them much differently bc of it.  I *hope* this isnt *just* about a quilt, but we dont have that info.  \n\nShe definitely had no right to berate the mil bc she wasnt getting a quilt, but if I were OP, and my husband were the only one out of four (? Am I remembering that right?) Siblings, not getting a quilt, i would feel indignant on his behalf.  I would never act like this, though.  If the quilts came up in casual conversation, I would say, well, DH feels pretty left out he doesnt have a handmade quilt from his mother... or something like that.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 424,
          "content": "OP is a selfish, possibly super entitled, individual..\n\nThis bit was telling for me \n\n> because I admit I'm a bit of a hipster and I love home-made kitschy stuff like that for our home.\n\nIt's just decoration for her, it would have no actual value.  I suspect she is not being honest about the phone call...\n\nHow accusatory was her tone etc?\n\nShe is TA, the MIL is not, although being treated unfairly sucks the quilts are family themed, and OP is planning on ending that part of the family for selfish reasons.  Why bother making a time and effort investment like a quilt for someone who is just going to spend all *their* time and and effort on themselves anyway?",
          "id": 120,
          "comments": [
            {
              "score": 14,
              "content": "> because I admit I'm a bit of a hipster and I love home-made kitschy stuff like that for our home.\n> \n> It's just decoration for her, it would have no actual value. I suspect she is not being honest about the phone call...\n\nThis reminded me of reading Raisin in the Sun back in high school. How the oldest daughter wanted to take the family quilt with her to preserve and \"admire\" it while the grandkids would \"ruin\" it by using it. Nope they are meant to be used",
              "id": 121,
              "comments": [
                {
                  "score": 21,
                  "content": "That’s not Raisin in the Sun. That’s Everyday Use, the short story by Alice Walker. And I thought of the same story reading this situation.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Must have been the same \"unit\" then. I definitely remember them from the same time",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 294,
          "content": "> you were TA for demanding a handmade quilt, with a deadline to boot\n\nChoosy beggar much?\n\nOP you need to call your MIL and apologize for your entitled behavior",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 268,
          "content": "> She sucks, too, for not treating all her kids equally quilt-wise\n\n----\n\n> I ask why and she says she's only interest in making quilts with her grandkids and things on them and we don't have enough hobbies and kids' hobbies to fill up a whole quilt. I tell her we have 2 beautiful dogs whom we love and could be put on there and she says \"I'm not making a whole quilt for a couple of goddamn dogs\"\n\n----\n\nThe quilts aren't really for her kids, they're for her grandkids and I absolutely cannot fault her for not holding her grandkids in equal regard with dogs.\n\nOP is TA and the mother is not.",
          "id": 125,
          "comments": [
            {
              "score": 27,
              "content": "I think you're spot on. They aren't family quilts, they're baby quilts. People give them as gifts all the time. But no baby, no quilt.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 260,
          "content": "Yea.  Definitely TA. She gives off that vibe of the stereotypical stuck up,  entitled hipster.",
          "id": 127,
          "comments": [
            {
              "score": 5,
              "content": "I think the word you're looking for is narcissist",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 198,
          "content": "Yeah your SIL is right, you're being a huge B. You're the one dishing out the bullshit here, OP.",
          "id": 129,
          "comments": [
            {
              "score": 23,
              "content": "You think having SIL, her white knight, yelling at her would clue her in.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10182,
      "content": "YTA\n\n&#x200B;\n\nI don't think you're the asshole for being upset at being left out, but it's pretty obvious you went out of your way to pick a fight with her. Personally, I'm on your side on the quilt thing itself, but I'm not sure what you expected to get out of deliberately antagonizing her, other than the satisfaction of picking a fight where you felt like you had the moral high ground. \\*That's\\* what makes you the asshole.",
      "id": 131,
      "comments": [
        {
          "score": 2913,
          "content": "And the MIL might have made them a quilt eventually if she hadn't been badgered about it. OP went in hot at MIL right after she just got done a quilt. Like MIL probably really did need a break from quilting and here comes OP who is pestering her to death about a quilt. She was practically pushing for a due date for christ's sake. I bet if OP had her husband ask a few months from now, MIL very well might have made them a quilt.",
          "id": 132,
          "comments": [
            {
              "score": 1433,
              "content": "That’s what makes her TA here. She’s not wrong for wanting a beautiful, heirloom quilt, but she is wrong for badgering her MIL about a free gift that takes quite a bit of effort and time to make. If a couple of years from now she hasn’t made one, then OP could inquire about maybe working on the project together, so she can learn how to make the quilts herself.",
              "id": 133,
              "comments": [
                {
                  "score": 907,
                  "content": "kinda think the ship has sailed on them happliy quilting together",
                  "id": 134,
                  "comments": [
                    {
                      "score": 511,
                      "content": "If OP put effort into repairing the relationship and came at the issue (a few years later) from the perspective of 'I'm making my own quilt, got any tips?' she could get some quality quilting time with MIL. \n\nBut, OP seems hellbent on being the victim instead of putting on her big girl pants and actually being constructive, so that's probably not going to happen.",
                      "id": 135,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 213,
                      "content": "She could make an “I’m the asshole” apology quilt.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "Well, yeah, if she’d approached this situation with any kind of tact she might have been able to do this and have a beautiful bonding opportunity with her MIL. But you’re right that the ship has likely sailed, when OP decided to “break” her down.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "A fight isn't always the end all be all. If op apologizes and expresses sadness at being left out but also focused on how her actions were wrong forgiveness isn't something impossible to get.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 249,
                  "content": "but she wants the kitschy throw now... in a few years it won't even be hipster anymore and would only be good to use as a blanket for the dogs... She deserves  the free months of labour now that it's still kitsch.  (do I even need to do the /s thing lol)",
                  "id": 139,
                  "comments": [
                    {
                      "score": 28,
                      "content": "That was odd sounding. A quilt because hipster, not sentimental or anything.",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 99,
                  "content": "This is the right answer. OP You are a huge asshole. \nYour sense of entitlement is off the charts",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Definitely TA. People who don’t do crafts have no idea how much work goes into making things like a quilt. Demanding any kind of gift would make them the asshole but something like this? SMH",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I agree that she's definitely not wrong in wanting this amazing heirloom quilt. However, her phrasing leads me to believe she really doesn't truly understand or appreciate the gesture and importance of such an heirloom--she's a \"hipster who loves kitchsy handmade stuff for her home.\" It seems like she doesn't appreciate it for the sentimental value (even if she never has kids, she could eventually pass it down to a niece or nephew she's very close to)--she just wants a fun unique conversation piece to show off. And I get the sinking feeling that once her tastes change or the kitchsy homemade trend dies down, that beautiful quilt would end up in storage--or worse, dropped off at Goodwill.\n\nTLDR; op just wanted a custom quilt for free.",
                  "id": 143,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 295,
              "content": "I do hand embroidery and this post got me so angry. The number of people who ask me to make them things, with zero thought about the time, energy and materials that go into it DRIVE ME NUTS. \n\nA project of mine can take full days of stitching! I've had to tell friends straight up 'no I wont stitch that. It takes me so long to make a project x\" by x\" and I'm not going to spend time embroidering something I'm not passionate and excited to just for you.' \n\nI've tried making quilts, I'm trained in patternmaking and sewing apparel and I GAVE UP at quilts. They are so difficult and require so much patience I can't do it. When OP makes 5 or 6 handmade quilts for her family she can ask her MIL for a quilt.\n\nOP YTA",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 172,
              "content": "yeah, firstly going in with the mindset that MIL MUST be lying in saying she needed a break, she secondly had the nerve to ask her, when the break would be over and when could she expect to get her quilt - THAT´S called entitlement, NOONE owes you a gift, especially not a hand-made one. Maybe she'd given you guys something else, who knows, but the way OP handled it made her TA and if I were MIL I would not even want to give anymore.\n\n&#x200B;\n\nI mean, being sad or disappointed does not make you TA but being entitled AND rude, makes you one in my eyes.",
              "id": 145,
              "comments": [
                {
                  "score": 9,
                  "content": "Honestly if she had any decency she would have stopped when the MIL she needed a break and her hands hurt.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "I love crafting but I definitely need a break from a big project and I've never tried something as labour intensive as a quilt.",
              "id": 147,
              "comments": [
                {
                  "score": 21,
                  "content": "Absolutely. And quilting does take a toll on one's fingers. I get the impression that OP has absolutely no idea. (YTA btw, OP.)",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I’ve done small quilting projects and find myself exhausted after doing a few squares and needing a break after those, so of course it makes sense that MIL would need a couple of months to reset between quilts. I can’t imagine being badgered about one right after I finished one.\n\nOP, YTA. You don’t deserve a quilt after acting like you’re entitled to someone else’s hard labor!",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "She said it was \"their turn\" for a quilt, as if she's underestimating the effort that goes into making a quilt. YTA OP",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "\"... because I'm just that kind of person.\"",
          "id": 151,
          "comments": [
            {
              "score": 317,
              "content": "Translation: “because I am an assh*le.”",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "They’re an “If you can’t handle me at my worst” kind of person",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "\" I just tell it like it is..\"",
              "id": 154,
              "comments": [
                {
                  "score": 8,
                  "content": "\"Straight shooter\"",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "Except she doesn't have the moral high ground.\n\nThe tradition of making a quilt is because its supposed to be passed down.  Generally this happens when someone starts to have grandkids / generational things going on.  Its like a little piece of grandma for the grandkids when shes gone.",
          "id": 156,
          "comments": [
            {
              "score": 99,
              "content": "Fucking thank you. it's not for her its \"for\" her its for the kids.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 141,
          "content": "This right here. You've summoned up the entire situation & everything wrong with it perfectly.",
          "id": 158,
          "comments": [
            {
              "score": 264,
              "content": ">  If a couple of years from now she hasn’t made one,\n\nBut OP needs one now because it will look so good in her apartment!! /s   \n\nShe doesn't actually care about the family value.    She just wants to be able to tell her friends that she has a handmade quilt that you can't buy anywhere, even on etsy.",
              "id": 159,
              "comments": [
                {
                  "score": 39,
                  "content": "I kinda think she just wanted to tell her friends that she 'owned' her MIL for judging their 'child free lifestyle' more than anything. I got the impression the quilt was just the fight to pick and feel vindicated over and OP could not resist.\n\n(And I say this as a child free person who thinks that, much like vegans, we should stfu about it and live our lives.)",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "She's like Ben Stiller in the quilting sweatshop in Happy Gilmore",
          "id": 161,
          "comments": [
            {
              "score": 12,
              "content": "My friend made the quilt that was used in that movie so I love the reference!",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Well now your back is going to hurt, because you just pulled landscaping duty.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I think maybe it's more than just that they don't have kids. She doesn't sound appreciative at the idea at all, to her it's just a hipster decoration, to mother it's an heirloom. Nobody is entitled to a handmade gift. They're labor intensive and honestly if I was the mother and I didn't think it was going to be appreciated the same way as it would at my other kids houses I wouldn't make one either. I don't think the mother made it for the kids she made it for the grandkids based on the comment about she's not making it for the dogs. She's not an a****** for wanting a quilt, but she is an a****** for her entitled Behavior and for picking a fight with her husband's mother. She could have also tried to get over herself long enough to understand why the grandmother was making them and why she might not be getting one.",
          "id": 164,
          "comments": [
            {
              "score": 8,
              "content": "> She doesn't sound appreciative at the idea at all, to her it's just a hipster decoration, to mother it's an heirloom. Nobody is entitled to a handmade gift. They're labor intensive...she's not an a****** for wanting a quilt, but she is an a****** for her entitled Behavior and for picking a fight with her husband's mother.\n\nMy mother, grandmother, great-grandmother, aunts, and great-aunts all did old-fashioned hand-stitched quilting.  To say that making a quilt is labor-intensive and time-intensive doesn't cover the half of it.  In the case of my great-grandmother, she also spun and wove the fabric\n\nIf the OP had come at me or any of my women relatives with that sort of entitled attitude and non-appreciation of the amount of work it takes to make a quilt, she likely would have gotten a [quilting hoop](https://www.dutchcrafters.com/Amish-Hardwood-Quilting-Hoop/ppc/47157?gclid=Cj0KCQjwitPnBRCQARIsAA5n84nrM9S8WDVwPMs1vjxJimvqhUZ1w5MDnIr1zhnVUe6C6qDOHbGXOdcaAnc4EALw_wcB) shoved up her backside.  \n\nI have quilts that were made by my late grandmother for me, and I treasure them something fierce.  I can't begin to comprehend the attitude that would lead someone to be so inappropriately demanding.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Imo, OP has some unresolved issues about choosing to be child free so when they encounter an aspect of society that caters to those who have children, those issues come back up and they lash out at the \"unfairness\" of it all.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Also just to point out... it wasn’t her son that phoned the MIL and complained about being left out. It was his entitled hipster wife who decided to phone and pester about it.\n\nLike wtf?\n\nIt’s the OP’s mother in law; if she was hurt and really wanted it discussed, that’s a discussion for the OP’s husband and his mum... not for the OP. It’s utterly mental what the OP did.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "[deleted]",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Op herself said that she thinks of the quilt as some sort of kitschy decorative element, like something you throw over your couch to make it look more comfy. The MIL made it clear that she made those as some kind of family heirloom, from her to her grandkids. And then OP said that her dogs are basically the same as MILs grandchildren. On top of that quilts are a huuuge amount of work. Knowing this, are you still on OPs side regarding the quilt?",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8909,
      "content": "YTA. With how unpleasantly you dealt with the situation, I think the reason you're not getting a quilt is not solely down to the fact you don't have kids. Firstly, a quilt like she makes is meant to be passed down to your kids, then their kids, and so on and so forth. So since you don't have kids then you can't really do that, you can't pass it on to your dogs. Also, your dogs don't have hobbies so how is she going to put them on there? The fact that you feel entitled to a handmade, labor intensive gift is just adding on to your MIL's desire not to make you one. Your SIL was right about her assessment of the situation:\n> I message her directly about it because I'm just that kind of person.\n\nYou mean you're a needlessly argumentative person who loves to start family drama? Because that's what it looks like. I'm being quite harsh here but you need a reality check.",
      "id": 170,
      "comments": [
        {
          "score": 1696,
          "content": "This. I don't quilt because it's expensive and time consuming and lots of hard work. If someone demanded me to knit them something \"just because\" or demanded when I was going to make them the same thing I'd just be stubborn back and not do it. No one is entitled to my labour. I wouldn't make an ornate time consuming blanket for my brothers cat because I made them for my cousins kids. I did crochet them a cute cat blanket though but I wouldn't put people's pets above people's kids.",
          "id": 171,
          "comments": [
            {
              "score": 705,
              "content": "I bake and decorate cakes and I absolutely would not put so much time and energy into something for a person like OP. My brother invited me to his daughters' baby shower and asked for a cake. I told him I would see if I could make it to the shower. Then he asked for me to send the cake with someone else if I couldn't. I realized the invitation was for a free cake and not for me. So I declined to make it. Relationship is important when giving a gift and I'm getting the idea that OP probably doesn't have a good one with her MIL, which is the biggest reason they're not getting a quilt.",
              "id": 172,
              "comments": [
                {
                  "score": 101,
                  "content": ">wow, that's incredibly tacky of him.  Glad you didn't go/bake for them.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Could have gone the other way with r/maliciouscompliance and sent a really shorty cake or like a crappy store bought one. I only say that because IATA",
                  "id": 174,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I like how you think. 😂",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 669,
              "content": "For me it was the “I don’t believe your hands are sore” that cinched it.\n\nI knit very well, and I have knit garments for my older brother and his two children, and his wife, and my mother.   My younger brother has expressed to me that he would like me to knit him something - to be “put on the waiting list”, so to speak.   I don’t mind that, at all, and I don’t even mind that he asked me in a vaguely obnoxious way that showed he had no *true* understanding of how much labour is involved in knitting a sweater. \n\nBut when I warned him that it might take me a while to get to it because of the arthritis in my hands, he cheerfully agreed and then jokingly threatened to confiscate my knitting bag if he found me pushing myself too hard and in pain.   We had that conversation a solid year ago and he hasn’t brought it up again.\n\nIf he had instead dismissed my arthritis, told me I was lying, and gone on a rant about how obviously I don’t love him because he’s not married and doesn’t have kids (or whatever) and that’s why I haven’t knitted him a jumper yet, then I flatly would never, ever, ever make him anything.   Ever.   I think OP shot herself in the foot here with this one.",
              "id": 176,
              "comments": [
                {
                  "score": 29,
                  "content": "All of this, but also to add its mentally exhausting as well. I recently finished a large cross stitch project, and had one lined up that I was genuinely excited to start, but fuck me I needed a *break* because all my energy and enthusiasm for such a project had been depleted - took me six months of doing other non-sewing projects before my zest for cross stitch started to return. You have to have your heart in it, you have to *want* to do it, otherwise it ceases to be a hobby and becomes a sweat shop.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My mother crocheted for a while and really enjoyed it. She made me a twin sized blanket and made my oldest son a crib blanket. By the time I got pregnant with my second child, her arthritis was too bad to think about making anything else. While I am a bit sad that she isn't able to continue making these little blankets for my kids, I'd never push her to continue crocheting. I've seen her hands lock up from arthritis. I'm content with the gorgeous pieces she's made already and have every intention of passing my blanket to my kids (and then their kids) if they want it. And if anyone (my brother included) demanded my mother make them something I'll happily tell them to kick rocks.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Exactly. I just finished a month of physcial therapy because I crocheted so much I developed a cyst in my wrist and tendonitis! I had just finished a blanket for myself and had started one for my husband. I was just cleared and he told me to not overdo it! I crochet for me, him, our kids, friends and family. I love to help when they ask, but I would be pissed if someone demanded it!\n\nArthritis is not fun to deal with! I was told to ice after each session. Repetitive anything can cause injury or inflammation.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "As a knitter with arthritis, I would like to add a \"oh \\*hell\\* no\".  Friends and family who are knitworthy know that it may take years before they get a sweater as a gift, because it's a hobby, not a job. Some friends will only let me knit something if they pay in yarn, and they protest that they're not paying me cash.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Also, can we talk about the total lack of respect for the soft “No”?\n\nOP if you don’t respect a soft no you deserve what you hear when you get the hard one. \n\nYTA",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I quilt. A design like the one OP describes is literally hundreds of hours of what sounds like handwork. I definitely see where OP would feel left out, but she does not understand what she is asking of her MIL. I frequently make quilts for friends having babies and often people without kids will kind of passive-aggressively ask when they’re getting their quilt. Dude, a quilt for a baby is 1/4 the size of a bed quilt. I do make bed size quilts but not for random acquaintances - you’re talking about months of work versus a fast, simple baby quilt I can throw together in a weekend.\n\nEdited to add: also, quality raw materials for a large quilt (fabric, batting, etc) can easily cost $100+.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 744,
          "content": "With a side of choosey beggar.",
          "id": 183,
          "comments": [
            {
              "score": 659,
              "content": "[deleted]",
              "id": 184,
              "comments": [
                {
                  "score": 412,
                  "content": "I'm glad someone said it. I mean it's cool and all to put the \"dog mom\" bumper sticker on your car, but this grandmother isn't going to your dogs graduation or wedding. A dog isn't a grandkid.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 253,
                      "content": "[deleted]",
                      "id": 186,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "This is what strikes me about this situation. The MIL is clearly doing it as a labour of love not only for her kids and their partners, but \\*at least as much\\* for her grandchildren. For OP to demand a quilt is seriously misunderstanding the MIL's motivations and betrays some real self-centredness and a lack of self-awareness.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Ok yes thank you.  We had a dog before we had human kids that we always joked with my parents and said it was a \"grand-puppy\" or \"the first grandkid\" but we never ever ever expected my parents or anyone to treat the dog on the level of a human child.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I heard my mom refer to my cats and my sister's cat as her \"grand-kittens\" a few times...until a real grandchild came along. Mom still likes our cats, but I don't think I've heard her say anything of the sort since my nephew was born.",
                      "id": 189,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Yeah I thought that was weird as well. Like it doesnt feel good to be left out but a quilt is something that is meant to be passed down...\n\nits like being upset that the grandparents set up a college education fund for all the other parent's kids but not their dogs.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "As a \"dog mom\" I find it weird and forced when people go out of their way to wish me happy mother's day or include me in motherhood things.  I love my dogs and would do anything for them, but I'm aware it's not the same and the people that go out of their way to \"include\" me in motherhood via my dogs, just tells me that they think my life is somehow lacking. Pass. Next.",
                  "id": 191,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Oh Em Gee this is probably what pissed me off the most. Does she really think grandma loves and adores her grand dogs… Insert eye roll… Nearly as much as she adores and cherishes her own grandchildren? OP is delusional. Pro tip: no one loves your dogs as much is you.",
                  "id": 192,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 139,
              "content": "With 12 cups of r/entitledbitch",
              "id": 193,
              "comments": [
                {
                  "score": 17,
                  "content": "As soon as she said she messaged the MIL directly “because that’s what kinda person I am” I was like ooookay YTA. And to be a self proclaimed hipster.... the worst kind of hipster.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 520,
          "content": "> Also, your dogs don't have hobbies so how is she going to put them on there?\n\nI dunno.  My dog's hobby is sleeping, burrowing under covers, and playing with his Winnie the Pooh.  My husband's dog's hobby is devouring rawhide bones.  My son's dog's hobby is eating shit, knocking over the garbage can, and destroying shoes.  Those are *totally* hobbies worth commemorating on an expensive, labour intensive handmade quilt. \n\n/s, obvs.",
          "id": 195,
          "comments": [
            {
              "score": 117,
              "content": "My dogs hobby is collecting things and putting them on her bed. Can I get a quilt now too?",
              "id": 196,
              "comments": [
                {
                  "score": 18,
                  "content": "my cat's hobby is shitting on the floor",
                  "id": 197,
                  "comments": [
                    {
                      "score": 22,
                      "content": "My cat’s hobby is bringing food into the bedroom, attracting mice, and then being too lazy to kill the mice.",
                      "id": 198,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "I know you’re being /s  but I’ll admit I would love it if someone made a quilt of my dog  and/or ferret and their hobbies.",
              "id": 199,
              "comments": [
                {
                  "score": 37,
                  "content": "Frank the Ferret\n\nHobbies: Fucking steals my shit and hides it like he’s the only goddamn one in this house that matters fuck you Frank. Love you.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 14,
                      "content": "This is accurate I can assure anyone. And I don’t even know Frank.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Some quilters will do custom quilts on commission. Support a local artist and get a one of a kind piece of art commemorating your pets. Win-win!",
                  "id": 202,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Same lol\n\nMy dog loves his Minnie Mouse, loves wrestling our kitty, etc. There’s some stuff that I think is unique to him that would fit on a quilt pretty well.\n\nThey’re not comparable to grandchildren, but dogs still have their own little quirks, hobbies, favorite things, blabla.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I feel like a quilt about dog hobbies without a large center square featuring the dog licking its crotch would be incomplete.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Now I want to see a quilt with a dog eating shit",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 486,
          "content": ">*I message her directly about it because I'm just that kind of person.*\n\n*You mean you're a needlessly argumentative person who loves to start family drama? Because that's what it looks like. I'm being quite harsh here but you need a reality check.*\n\nI know, this made me cringe so hard. I mean, if she wants a quilt with her dogs on it so badly, why not ask MIL if she'd show her how to make her own?\n\nThe way she handled it was really entitled and rude and plain unnecessary. MIL might have decided on another gift for them down the line, who knows, but with the way OP handled this situation, I would not be surprised if that ship had sailed, at least for now...",
          "id": 206,
          "comments": [
            {
              "score": 15,
              "content": "Then to add “my husband agreed 100 percent” like she was pumped to bring as many people into the petty drama as possible. It’s sad to turn something really thoughtful the mil was doing and use it to make people feel bad.",
              "id": 207,
              "comments": [
                {
                  "score": 11,
                  "content": "Is the husband even 100 percent? If he now wants no part in this.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Right? Seems to me like she told her version of the story and the husband was on board, then when he found out things weren't what they seemed, he chose to sidestep the situation.",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah that line got me the most. I thought \"oh yeah, you are that type of person.\"",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "The fact she thinks her dogs deserved the same treatment as the MIL's grandchildren just shows how entitled OP is, imo.",
          "id": 211,
          "comments": [
            {
              "score": 28,
              "content": "\"How's your grandson?\"\n\n\"George?  He's doing great.  Just graduated from Preschool into Kindergarten, loves drawing, he's such a little artist.  Here's him at graduation, and look at this drawing of Ninja Turtles he made for me the other day.  How's your grandkid?\"\n\n\"Here's a picture of Fifi.  She likes to shit on the carpet and, um...sleep in her dog bed, oh and she also loves to run away if she burrows under the fence.  Never a dull minute...^I'm ^so ^lonely, ^why ^don't ^my ^kids ^ever ^visit ^anymore? \"",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Seriously. Most of my siblings have children, and I don’t. I have a dog who I love very much and have had for 13 years. My mum is a sweetheart about my dog and buys her gifts and calls her her “granddogger” \nIt’s nice of my mum but I would never *expect or insist*  my dog be treated on the same level as a human grandchild.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "I think she isnt getting a quilt because she is also hard to deal with.",
          "id": 214,
          "comments": [
            {
              "score": 20,
              "content": "Oh my God so instead of the cute thoughtful things my MIL usually sews on her handmade quilts she's sewn cartoon dog bones onto mine because I don't have kids! Wtf! This will not look cool and kitschy in my awesome home. She's practically separating me out and calling me a bitch! I love strawberries and my dogs love the sun, why couldn't she have sewn images of those on!!",
              "id": 215,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I love when people say “I’m just that kind of person” as a justification for acting like an asshole. Like, “oh, my bad, I didn’t realize you’re just the kind of person who is generally an asshole. It’s all good then!”",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "That's the part that got me.  She says that she's the kind of person that directly confronts people about things like this, but then admitted that she asked SIL about their quilt (not the person making it) and then had her husband investigate further when she found out she wasn't getting one.  So which is it really?",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I'm just that kind of person who need to speak directly to someone and assume they are a liar",
          "id": 218,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3741,
      "content": "YTA - It's a gift she makes on her own time so she gets to decide who she makes it for. It's not up to you.",
      "id": 219,
      "comments": [
        {
          "score": 635,
          "content": "Yeah she sounds like she's part r/choosingbeggars",
          "id": 220,
          "comments": [
            {
              "score": 29,
              "content": "With a dash of r/entitledbitch",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I've seen this over and over in here. Either \"I did something for Person A, and now Person B is now insisting I do it for them\" or \"Special Person did something for someone else but doesn't want to do the same for me!\" Demanding the same gift as someone else is always the asshole move. Unless you're a child sharing a treat with your sibling, you aren't owed a fair distribution.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3154,
      "content": "YTA are you trying to coerce someone into making you something. She has no obligation to make you something. You are not her child and even if you were making something for one child does not put an obligation up there to make one for every child. Her reasons are not important. However, the reasons she gave you are valid. The quilts take time and she makes them to be family heirlooms for her kids and grandchildren. It takes significant time and effort. Dogs are not grandchildren. The fact that you cannot let it go and want to stir up family drama over it is possibly an indication of also why she does not want to do it for you.",
      "id": 223,
      "comments": [
        {
          "score": 2226,
          "content": ">\tDogs are not grandchildren.\n\nIt’s actually kind of funny how OP was so adamant with her “but we have two beautiful DOGS” line lmao.\n\nIdk if anyone remember but a long time ago there was a huge relationships post where this woman was majorly upset bc her MIL refused to bake her dog a fucking birthday cake. She was just as indignant as OP, saying things like “but she made one for all her grandkids, why not for my *dog*? Why is she so unreasonable?”\n\nIt was honestly hilarious. Can’t imagine people like this actually existing.",
          "id": 224,
          "comments": [
            {
              "score": 910,
              "content": "YTA\n\nI have to hesitatingly agree. While I am a strong believer that a pet is a member of your family, I also recognize the stark reality that it is, at the end of the day, an animal, and not everyone is going to feel as strongly about it as I do. \n\nWould it be cool for MIL to make a quilt with the dogs? Yes, I probably would. Demanding that one gets made is not cool, though.",
              "id": 225,
              "comments": [
                {
                  "score": 763,
                  "content": "it also sort of increases the chances\nof the quilt ending up in a closet within 10 years. Like, now that Barky and Growls have both passed the quilt just makes me sad. We need a new quilt with Ankle Biter and Stinky now.",
                  "id": 226,
                  "comments": [
                    {
                      "score": 559,
                      "content": "Yeah, the whole, \"I'm a hipster into kitshy stuff\" kind of threw a curveball at me too. These kinds of quilts aren't the kind that get thrown over a couch, they get handed down. So to piggyback on what you're saying, I guess the fact that they'll outlive their fur babies four or five times over sort of adds to it.",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Will you name my future children?",
                      "id": 228,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 174,
                  "content": "MIL probably intends the quilts to be passed down to the children and be enjoyed by future generations as well since she made them as kind of scrap books on the family members' lives. Dogs really can't do that, and I understand why MIL wouldn't consider them equivalent.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 151,
                  "content": "The dogs are not her progeny she likely doesn't give two fucks about some dogs.\n\nI crochet toys and I'd be fucking livid if someone from my circle was like oh you made a giraffe for family friend's newborn why not for my dog.",
                  "id": 230,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I have a dog that I love more than most people and I would do anything for, but fuck those people. She's a dog. She's gonna care about labor intense handmade gifts as much as she cares about empty water bottles and old t-shirts.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "All family members are not created equal. I'd be pretty pissed if people didn't care that I have a cat just expected me to ditch her to spend a whole week at grandma's over the holidays because \\~family\\~, kitty is my family too and she needs me there when fireworks start going off. But I'd be equally pissed if people started demanding their pets get their own seat at the dinner table, because your teacup poodle do not need to sit in a high chair and be part of the dinner conversation.\n\nYou don't get baby showers or heirloom quilts for pets. Being family does not make them human.",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I mean i feel like my pets are a part of my family but j also realise they could not give a fuck about their birthdays they are animals why would they care?",
                  "id": 233,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 394,
              "content": "As a childfree man I get really annoyed at the way childfree people treat dogs. Every annoying thing childfree people complain about parents doing on /r/childfree they do the exact same for their \"fur babies\"",
              "id": 234,
              "comments": [
                {
                  "score": 64,
                  "content": "Maybe you’ll prefer r/dogfree",
                  "id": 235,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Nah I still love dogs, but I just don't want to own one myself.",
                      "id": 236,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "OMG yes, this is so true. Why can't my dogs come to work with me, the store, the restaurant, to stay at a relative's house, yada yada if my dog isn't welcome, then I'm not coming either! Don't they bitch about kids being in public places and whatnot?  \nI don't hate dogs, but I'm not a dog lover and I'm allergic. Dogs don't need to be everywhere. They aren't people.",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 252,
              "content": "Yeah...listen. I have a dog who is the light of my life, and I sometimes refer to myself as her mom. And I am never having children as I don't like kids. But it's WILD how much some people on the internet are willing to die on the hill of \"my dogs are my children, and that's JUST as important as your human kid.\" \n\n&#x200B;\n\nThat's so ridiculous to me. I have a few friends with kids and the sacrifices they had to make (not just the giving birth part, but everything after that) to have their kid don't even compare. It's a completely different lifestyle and you're making those changes FOR THE REST OF YOUR LIFE since your kid will likely outlive you. It seems so disrespectful to people who give their blood, sweat and tears to try and raise their kid to be a productive member of society whereas I just have to come home from work at a decent time to walk the dog.",
              "id": 238,
              "comments": [
                {
                  "score": 156,
                  "content": "I couldn't agree more. My eyes roll right out of my skull whenever I see people trying to say that dogs are children and they're just as challenging and meaningful to have as children. I have a dog who I adore, and I frequently refer to myself as her mom and my husband as her dad, but...it's not the same thing. It's just not.",
                  "id": 239,
                  "comments": [
                    {
                      "score": 87,
                      "content": "At the VERY LEAST, you can legally and ethically leave your dog home alone any time you want to go do something.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "Dogs are also really short-lived compared to children. Like, if my parents had gotten a quilt with their dog when they got married, that would've been their third dog together and by 2019 would have been 11 dogs ago, and their dogs all lived long healthy lives. Most people don't cycle through 15 children in their marriage who all die after 10 years.",
                  "id": 241,
                  "comments": [
                    {
                      "score": 18,
                      "content": "> Dogs are also really short-lived compared to children.\n\nNot if you’re anti-vax",
                      "id": 242,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "Right? Like I love my cat and consider her a pseudo child (not to that extent)\n\nBut like I don’t expect her to have the same rights as human and entitlement that babies have. She’s a cat. I love her very much but if my mom doesn’t want to do something for her that she’d otherwise do for a grandkid, that’s cool and I understand that. OP should too.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "Yeah, that really got me too. \"We have two beautiful dogs!\", seriously? Dogs are members of the family, but they aren't kids and they absolutely aren't grandkids. It's just not the same. \n\nAnd yeah, I do remember that relationships post. Didn't MIL even offer to make a different cake and the OP was offended because it wasn't going to be as fancy and nice as the cakes she'd made for the grandchildren?",
              "id": 244,
              "comments": [
                {
                  "score": 70,
                  "content": "Bro, on top of that, the average lifespan of a dog is like 10 years. That quilt is going to be a sad memory real quick. Also, you can't pass a quilt down that has 2 random dogs. I love dogs, I don't like children, but dogs are not people.\n\nThe whole idea of a family heirloom is to pass it down your line. It's absolutely their right not to have children, but that kind of defeats the point of family heirlooms as well.\n\nHell, it sounds like the quilts are for the grandkids not even the MiLs kids.",
                  "id": 245,
                  "comments": [
                    {
                      "score": 18,
                      "content": "OP didn't see it as a family heirloom. She saw it as a quirky cute hipster decoration. She didn't consider \"hey, it's not for the siblings, it's for the grandkids\".",
                      "id": 246,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I really want to see this cake post but I can't find it...",
                  "id": 247,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I really can't stand people who appropriate their dogs to be the same as children.  It's not the same.",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "What really? No way. Can you link it or do you not know it anymore?",
              "id": 249,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 67,
              "content": "There are people who celebrate Mother’s Day because they have a dog. Fuck them. It’s not even remotely the same. You didn’t give birth and you probably leave it home alone in a cage all day, don’t take it for walks because it’s chilly or too hot, didn’t train it, and ignore it unless it needs to eat.",
              "id": 250,
              "comments": [
                {
                  "score": 14,
                  "content": "[deleted]",
                  "id": 251,
                  "comments": [
                    {
                      "score": 8,
                      "content": "That's the same type of person who thinks their untrained asshole dog is an Emotional Support Animal and should be allowed anywhere, just because once every few months she decides she just has to take it with her to the mall.",
                      "id": 252,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "The point of the quilts, all those hours and hours, seens to be so that her grandchildren have them after she's gone, so the dog suggestion is completely insane, like the dogs will remember her or something.",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Damn, do you have a link for that? Seem fun",
              "id": 254,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "As much as I love dogs, we're all kind of ignoring the fact that these dogs will be dead in a relatively short time and the family will probably have different dogs or no dogs at all for most of their relationship, which is... pretty different from how having kids usually works. I know kids can die prematurely but dogs absolutely 100% definitely die in under 17 years, usually like 8-10 for big dogs.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 173,
          "content": "[deleted]",
          "id": 256,
          "comments": [
            {
              "score": 33,
              "content": "Even more it's not like you have to either have a dog or have children. There are plenty of people with children and dogs. And I'd be appaled if they treat their children and dogs the same.",
              "id": 257,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "[deleted]",
              "id": 258,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "This gets on my nerves from a different angle. People who treat their dogs like children often raise vile dogs. \n\nDogs need boundaries, they need to understand that you’re in charge otherwise they will never listen to you; now I’m not talking aggression or being a Caesar Milan, just being firm and actually training them.",
              "id": 259,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "> The quilts take time and she makes them to be family heirlooms for her kids and grandchildren.\n\nAlso, is OP going to demand another quilt if in a few years they change their mind and decide to have kids?\n\nWhat about if they got another dog or cat?\n\nDid the other children wait until they had kids to get their quilts?",
          "id": 260,
          "comments": [
            {
              "score": 70,
              "content": "They are guaranteed to get another dog before too long. That's kinda how dogs work over the long term.",
              "id": 261,
              "comments": [
                {
                  "score": 7,
                  "content": "lol, I mean I did want to say that but I didn't want to seem to insensitive.  While I am sure they love their dogs more than anything.   I loved my dog more than anything 20 years ago too and it died.   We've had new dogs raised from puppies and die within that time also.  I don't love the first one any less it's just... different than a human child.",
                  "id": 262,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "When the current dogs inevitably die in the next 10 or so years and OP gets new dogs is MIL supposed to take the quilt back, take out the blocks with the old dogs and put in the new ones? Rinse and repeat every time they get a new dog? How inconsiderate of MIL /s",
          "id": 263,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "> Dogs are not grandchildren.\n\n  \n\n\nTHANK YOU. In this time and age it has to be stated.\n\n  \n\n\n\"But my pets are my babieeees\"  \nYou treat them like babies, Karen, they are not children.",
          "id": 264,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3031,
      "content": "YTA - First of all, you are not entitled to a quilt. Your mother in law is mainly making those for those quilts for her grandchildren, not her children. She's also saving herself some time because she doesn't know if you might have children one way or another in the future. She also doesn't have to make a quilt for you and your dogs. People like us love our dogs like they're children but not everyone feels that way. She does not have to dedicate her time into a quilt because you love your dogs. \n\nYour entitled approach was also wrong. You literally got mad, went and harassed your mother in law, then demanded that she do something for you. You were the true definition of an entitled asshole based on the whole conversation you had with her. You pestered, demanded, challenged, and pretty much threw a tantrum with your husband because you didn't get what you wanted. \n\nThere were better ways to handle this situation and you chose to be aggressive, greedy, and entitled. She makes gifts for her children and grandchildren. You were wrong to demand one. You were wrong to force her into a corner about why she wasn't making you one. She could have done it better but she was trying to be nice about the reasons why you weren't getting one. You literally damaged multiple relationships because you felt entitled to a quilt. Do you not see how immature that is?",
      "id": 265,
      "comments": [
        {
          "score": 910,
          "content": "I'm seconding this one. \n\nOP, you wouldn't have been TA if you'd tactfully told her how much you love the other quilts and how you were hoping she'd get around to making one for you & your husband. But instead you had to demand and hound her. Quilts take a lot of work to make (I quilt, I know), and even if it's wrong of her to make them for all but one of her kids, you have no right to demand that much work.",
          "id": 266,
          "comments": [
            {
              "score": 641,
              "content": ". I push her more and ask her when she thinks the quilt will be done after her little \"break\"\n\nthis phrase annoyed me so much. She's for one  belittling the need for a break by calling it 'a little \"break\"' so she does not appreciate how much work it is. Secondly she's ordering a time to be promised (idk how to word this)\n\n&#x200B;\n\n\\*edit:  some of the worse spelling mistakes",
              "id": 267,
              "comments": [
                {
                  "score": 280,
                  "content": "Right? She's treating this woman like she's her employee or something. \"I don't pay you to take little breaks, I pay you to work!\"",
                  "id": 268,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "She's basically asking the MiL for a deadline. So rude and tacky.",
                  "id": 269,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "This is the one that won me over. I was thinking NTA but that first paragraph makes a lot of sense from the perspective of the MIL.",
          "id": 270,
          "comments": [
            {
              "score": 11,
              "content": "Yeah plus she could easily be waiting in hopes that maybe in the future OP and her SO have a kid, maybe they’re too young for them now but might have them later (no mention of them not wanting any ever)",
              "id": 271,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I also second this, and also want to add that you've now put your partner in an incredibly awkward situation between his wife and his mother, got the sake of quilt that actually doesn't have any meaningful value to you, but looks 'hipsyer' and would 'make a good throw'. Just go buy one. It would have saved all the arguments.",
          "id": 272,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2015,
      "content": "YTA\n\n> I tell her we have 2 beautiful dogs whom we love and could be put on there\n\n*Seriously?*\n\nIf you don't want to have kids, then fine. But don't make a mockery of other people's kids and family traditions by trying to equate your dogs with people's children.\n\nI adore animals but you can take it too far.",
      "id": 273,
      "comments": [
        {
          "score": 211,
          "content": "[deleted]",
          "id": 274,
          "comments": [
            {
              "score": 162,
              "content": "I like this sentiment. I actually don't think it's unreasonable for OP to be hurt that they're being excluded. To know that every other sibling got a wonderful, handmade gift and you never will stings. It makes it seem like she doesn't care about having you in the family because you won't give her grandchildren. \n\nThe issue comes in the fact that OP pestered and argued instead of waiting patiently and talking to her MIL like an adult. If she isn't going to give you a quilt after a few years, it would be reasonable to sit down and explain how you feel excluded. Demanding instead is taking it over the top.\n\nPlus, let's be honest, this type of quilt is not meant to be passed down. Maybe the grandchildren will enjoy it too, but who beyond that wants a quilt full of other people's hobbies unless they just want it for the hipster, kitschy value.",
              "id": 275,
              "comments": [
                {
                  "score": 81,
                  "content": "[deleted]",
                  "id": 276,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yeah, OP’s reaction was absolutely not cool. But I know that I would be very, very hurt if my mother made a beautiful handmade gift for my siblings and left me out of it.",
                      "id": 277,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "This could have been handled sooooo much differently. If she had asked because she was hurt, that's understandable. If the issue with them not having kids had came up as the reason why she wasn't making it, she could have said, \"your quilts are lovely, and it would mean a lot to us to own one. You don't have to do the same thing you did for the others - any quilt would be fabulous if you're up to it.\"",
                  "id": 278,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She called to pick a fight before her MIL ever said that. She was pissed she wasn’t getting a quilt regardless of MIL’s reasoning.",
              "id": 279,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Side note for all of those people who get bent out of shape by people referring to animals as their kids (because I see this everywhere):\n\n*Not everyone can have biological children, even if they really want one. That bond with their pet may be the closest they get to being a parent. Don't be a dick about it. You don't know everyone's story.*\n\nThis has stuck with me since my cousin and her husband got a puppy and everyone gave her so much crap about posting so many pictures of her son and dog until finally she came out and told everyone that she found out she couldn't have more children.",
          "id": 280,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1629,
      "content": "This was NTA until...\n\n> I ask her if it has anything to do with the fact that we have no kids (which she expressed negativity against in the past) and she says no even though I know it's a lie. I push her more and ask her when she thinks the quilt will be done after her little \"break\"... \n\nThen it's full blown YTA. You poked and prodded her and you got an answer you didn't like (that she was probably trying to spare you from). I get that it sucks feeling left out or being made to feel like your family is less than your other in-laws because of a perfectly valid lifestyle choice. But it's also a dick move to pressure your MIL into making you a gift that clearly has a lot of significance to her. You even double down by sounding like you wanted to rush her to make one. \n\nHonestly, it's not surprising that your SIL called you out on the voicemail. Had you not have gone about asking in such a callous way your MIL might have considered making you one down the line or one of your in-laws or even your husband could have tried to convince her. But nope, pretty much guaranteed that you aren't getting anything from her AND you look like a massive ass to your husband's family.",
      "id": 281,
      "comments": [
        {
          "score": 617,
          "content": "I wish people like this didn't use throwaways.  I wanna see what other bullshit they throw around from their fucking high horses.",
          "id": 282,
          "comments": [
            {
              "score": 52,
              "content": "Because majority of the time they are fake as fuck to drum up random Internet drama.",
              "id": 283,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "[deleted]",
              "id": 284,
              "comments": [
                {
                  "score": 13,
                  "content": "I feel like people post on this sub to reassurance that the thing they did wasn’t fucked up. I see other OPs conmenting on their thread when people agree with them, but when they disagree the op is nowhere to nor found.",
                  "id": 285,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "If someone talked to my mom like that, demanding shit that takes so much time and energy to make, I would call them up and roast the fuck out of them. Glad SIL stood up for her mom.",
          "id": 286,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1519,
      "content": "YTA. I make quilts, bitch probably IS TIRED",
      "id": 287,
      "comments": [
        {
          "score": 374,
          "content": "With her saying her hand hurts it sounds like she does them by hand too which is mad respect from me as a machine quilter!",
          "id": 288,
          "comments": [
            {
              "score": 210,
              "content": "I machine quilt too, I think that's why I was so quick to say this. Sounds like she's doing complex hand applique based on OP describing little pictures. Who knows how intensive that it without pictures but probably a ton of work.",
              "id": 289,
              "comments": [
                {
                  "score": 16,
                  "content": "Even just handing sewing binding on that many quilts would be a huge amount of work.",
                  "id": 290,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah exactly! Can she be my MIL I feel like I could nlearn so mucb",
                  "id": 291,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My grandma is teaching me how to use her long arm right now and I can’t even imagine trying to do that by hand. It’d take me a lifetime to do one queen size quilt.",
                  "id": 292,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "[Literally OP.](https://youtu.be/uPsbDUZvfFo)",
              "id": 293,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "Right? YTA. OP has no idea what she is asking of MIL. I am not a quilter, but I am a knitter, and someone who was so demanding of my hobby would never get a pair of socks. These things take hours upon hours of work and planning, and hundreds of dollars worth of supplies - plus her experience, which is invaluable. The thought of gifting someone a piece I made and having them smugly accept it *as if I owe it to them* makes me feel ill.  Bad OP!",
          "id": 294,
          "comments": [
            {
              "score": 10,
              "content": "The OP should spend a few hundred dollars commissioning one if she needs the quilt so badly for home decor",
              "id": 295,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Exactly! I crochet, but my grandmother made quilts (still have mine 20 yrs later!).... this lady is certainly pooped out. I’ve crocheted a few blankets, and omg... I would be LOSING MY SHIT if a family member demanded a blanket from me because I’ve made them for others. Like, do you not have ANY idea how labor intensive these handmade items are?! Not only that, OP sounds like a nightmare to deal with, and idk about everyone else who makes things like this, but when I’m making something for someone, I think about them with every stitch and reminisce about time spent together.... I wouldn’t want to make OP a quilt and give her that much of my headspace if she was acting like an asshole.",
              "id": 296,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Right! My mother is a quilter and the amount of time, effort, energy, and money she spends on just one quilt is mind-boggling. She’s limited her quilting to close friends and family (generally when someone gets married or has a baby coming) because people were taking advantage of her — without even a thank-you. My cousin asked if she would make her daughter another quilt so it would “match the room better” and “we’ll give the old one to [second daughter]” my mother was ready to cry, because she’d spent weeks if not months working on the girl’s original quilt and suddenly it wasn’t good enough.",
          "id": 297,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 988,
      "content": "YTA a lot because of \"I love home-made kitschy stuff like that for our home.\" Seriously you suck for this one, I quilt and I'd be so insanely pissed if one of my quilts was described this way. She can choose to make a quilt for whoever she does (or does not) want to quilt for. You sound bonkers entitled just automatically expecting one of these was coming your way. I make a best faith effort at trying to put together a baby quilt for all the new family members but occasionally one will slip through the cracks if I happen to be super busy during that year. If this is a bed sized quilt then that's even more bonkers that you are behaving this way as that can be up to a year of work.",
      "id": 298,
      "comments": [
        {
          "score": 326,
          "content": "‘bonkers entitled’  Yup!   OP is definitely TA, but I have a suggestion:\n\nOP - do you want to be a better person, and NTA? Apologize to your MIL, and then ask her to show you how to quilt.  It will be your special bond with her, your fingers will get the workout, and you’ll have a quilt when you’re done.",
          "id": 299,
          "comments": [
            {
              "score": 231,
              "content": "Lol OP's not coming back from this one, dude",
              "id": 300,
              "comments": [
                {
                  "score": 27,
                  "content": "An honest apology comes a long way",
                  "id": 301,
                  "comments": [
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 302,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "It does, but OP doesn't have the spine to admit what they've done wrong, and will probably just go further down the rabbit hole of entitlement.",
                      "id": 303,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "OP doesn't want to come back from this one.\n\nShe's \"that type of person\" and disgustingly proud of it.",
                  "id": 304,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "I hope she does try because then she'll realize how time consuming and costly it can be... designing it,  planning everything, putting it together. Maybe months of creating. Intense. It's not just buying a gift from a store.  And she just expected one? Blah. May be one of the few things that can mend this relationship is if she asked to be taught and they can make something nice together .",
              "id": 305,
              "comments": [
                {
                  "score": 15,
                  "content": "Honestly, it's so expensive. Fabric, batting, tools, patterns, templates, machines and maintenance ... plus the hundreds of hours of time spent planning, cutting, piecing, quilting, binding. I mean, come on. OP is def TA.",
                  "id": 306,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "[deleted]",
          "id": 307,
          "comments": [
            {
              "score": 11,
              "content": "Yeah, like if Op weren’t an asshole they could have asked her to teach her to quilt as well and pass the tradition down (to the others’ kids if not her own) and made her first one together, with the dogs or whatever she’d like; even a small four square thing maybe. But, OP is an asshole unfortunately.",
              "id": 308,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Like holy shit my blood boiled at that one. I have a quilt my mom had made for me, one I had made for my husband and my most precious - one my grandmother made by hand and holy shit of any of those were described as hipster kitsch they’d be picking up teeth. Those are all massive labors of love to make and so thoughtful to give.",
          "id": 309,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I winced at that (mother is a passionate quilter, and it can take weeks for a basic quilt and months for a more intricate one/large one). OP is ridiculous.",
          "id": 310,
          "comments": [
            {
              "score": 14,
              "content": "My grandmother has been making a double wedding ring quilt for me for the last 6-7 months.  I am beyond psyched and actually in awe of how fast she pumps quilts out.  OP made me so mad demanding a deadline.",
              "id": 311,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yep. OP doesn't want a gift, they want a handmade, personalised quilt for free, and they demand it be made as soon as possible, because it fits with their personal aesthetic.",
          "id": 312,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}