{
  "post content": "**warning...warning...** THIS IS NOT A VALIDATION POST. I KNOW WHO I AM. I do not need validation from strangers. I want to know if I SHOULD have done something different and as such IF I should do something different the next time this type of thing comes up. \n\n**preface:**\n\nSome background is in order. I am one of four sisters. I am the second oldest. I have always been a bit a black sheep in that my genetics take after my mom's side of the family and I am much heavier than my sisters who are all spectacularly gorgeous, thin and athletic. I am \"pretty\" but I also weight 250lbs (which I was ashamed of for a long time, now I try to accept who I am which is why I don't mind saying it here). \n\nEarlier in the year my dad mad a huge amount of money from selling some stock options at his work. His dream has always been taking a huge family vacation so my parents, myself, two of my sisters and their spouses and kids (all under 10) with my other single sister rounding it out are all on the trip. We were at an absolutely gorgeous beach resort for Christmas. \n\nI decided since I've accepted my weight as it is, I was also going to not be ashamed and \"cover up\" like I used to. In fact, I figured \"screw it, I'm 28 and was going to catch me a hot foreign dude on the trip. I'm showing some skin!\" So I got three new swimsuits, one is a full on thong one piece, the other two are very \"cheeky\" bikinis. \n\n**the incident:**\n\nMaybe four days in I finally felt confident enough to wear the one piece without a sarong. when I got down to the beach with the rest of the family I took off my robe and laid down, first on my back. I could see my older sister just staring daggers at me and when I turned over to get some sun on my bum, she said something like \"seriously Janey? There's kids here!\" I asked her what she was talking about and she said that it was totally inappropriate that my ass was \"hanging out.\" I told her I didn't appreciate her comment. She said she didn't appreciate me embarrassing her. I told her to take a look at our youngest sister (who is 19) and she was literally wearing a string bikini with mere inches of fabric that showed more of her ass than mine. \n\nMy oldest sister then told me that if I didn't understand the difference than there was something wrong with me. I asked her if it was because I was fat? She told me something really rude like \"Janey this is why we don't have a relationship, you make everything fucking difficult.\" She then packed up her husband and kids and left the beach and I didn't see them until dinner that night. \n\n**The fallout:** \n\nMy oldest sister didn't say a friendly word to me the entire rest of the trip. She has some wicked mean girl abilities and because of her I was pretty much isolated from my family from the rest of the trip. I did get to go to a few dinners but no one would tell me when they were going to the beach so for the rest of the trip I didn't see get to see or play with my nieces and nephews on the beach. It sucked and made me feel really sad, neglected and even guilty for standing my ground. \n\nWe all independently flew home and I have gotten emails from my oldest sister, my mom and my dad all saying that \"your clothing choices essentially ruined a family vacation and we are so disappointed.\" Just on a lark I called my youngest sister and said something like \"hey sis, crazy how our family is freaking out about thong swimwear, even though its the style everywhere now...huh!?\" she responded with \"what are you talking about? no one is freaking out about my swimwear.\"  So yeah...they are again freaking out because I'm a bigger girl. Skinny girls can show their ass, fat girls can't. \n\nWell to top all of this off, I just found out that my two sisters with kids are planning on meeting up in Destin for Spring Break because their kids had so much fun on the beach with each other. The trip has been mentioned to my younger sister, I don't think she's technically invited but I'm sure they wouldn't say no if she wanted to go. Guess who hasn't had the trip mentioned to them...even though I spoke with my other middle sister. Yup. \n\nSo did I cause all these by being the asshole by wearing the swimsuit of my choice? Or is this my family being shitty to me?\n\nAITA?\n",
  "id": 1,
  "comments": [
    {
      "score": 520,
      "content": "ESH. \n\nObviously it sucks that they have a double standard. It sucks that your sister got away with a string bikini and you didn't\n\nBut\n\n>\"screw it, I'm 28 and was going to catch me a hot foreign dude on the trip. I'm showing some skin!\"\n\nMaybe neither of you should be wearing \"fuck me\" swimwear around kids on a family vacation in the first place..?",
      "id": 2,
      "comments": [
        {
          "score": 148,
          "content": "I agree. My only issue with OP is that there were children around. If it were purely an adult vacation I’d 100% say the family sucks. Still seems like the family is making a much bigger deal out of it than they should though. Final verdict: ESH.",
          "id": 3,
          "comments": [
            {
              "score": 70,
              "content": "I think the kid issue really depends a lot on culture. Living in a river front town I see all manner of swimwear. I have seen just so, so many people skinny dipping (i paddle competitively and spend a lot of time on the river) in just about any body of water here, and we have a nude beach (maybe two?) within city limits. It's weird to see naked people but string bikinis won't raise any eyebrows. I see it a lot like men's athletic suits (interestingly, women's athletic suits are far more modest whereas men's athletic suits are dick-huggers). It leaves very little to the imagination, but it's contextually okay.\n\nAmerica is kind of unique for western countries with our \"hide your shame!\" culture around nudity. OP mentioning bagging a foreign guy makes me wonder if it was more appropriate in that setting than it would be in your average American beach. ",
              "id": 4,
              "comments": [
                {
                  "score": 24,
                  "content": "I had these thoughts as well. Given the context of bagging a foreign guy, OP was probably totally within cultural norms of whatever country they were visiting. However, within traditional American norms OP is “wrong”. Being American I can understand why her sister might be annoyed, but I think they took it too far and/or are making a bigger deal of it than they should. Americans are also horrible with double standards, so I can almost guarantee her size plays a factor into why they’re upset. Sucks for OP, but I think she is partly to blame. However I think the family is MORE to blame for overreacting.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 30,
                      "content": ">However, within traditional American norms OP is “wrong”. \n\nNope, even that doesn't follow. Like I said, I an American and we have nude beaches within city limits here. It's also legal to be naked so long as you're not acting obscene or visually aroused.\n\nAmerica is a huge place with a diverse set of cultures and values.\n\n",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Sexualizing bodies is a learned behaviour. Kids don't see bodies as sexual unless they are brought up in a culture that encourages it. That's why 4 years olds run around naked and walk in on their parents shitting. Because naked isn't shameful... yet. \n\nDragging the kids away and making such a big deal about it is teaching these kids that showing body is shameful. ",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "But if that’s the case being all about too much skin around kids why did no one care about the 19 year old’s bathing suit?",
              "id": 8,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Do you really want to be around your family in a thong though?   I don’t and i definitely don’t want to see my family mostly naked either.  ",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Don’t take kids to the fucking beach if you don’t want them seeing any ass",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Pretty much all swimwear is revealing, one bikini is just as much fuck me swimwear as the next. ",
          "id": 11,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "\"fuck me\" swimwear\n\nHahahah that's gold.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 292,
      "content": "YTA. Wearing a thong on a family vacation is kind of disgusting. You said you think they’re the trend, but I know of no beach (except maybe South Beach) where thongs are acceptable forms of swimwear. \n\nFurthermore, your “is it because I’m fat” comment is embarrassing. Sounds like you were daring your sister to say something to you, as if being fat is some protected class or somehow off limits. It’s not, but this is not about your weight. It’s about your attitude. Your sister was right. You sound exceptionally difficult. ",
      "id": 13,
      "comments": [
        {
          "score": 115,
          "content": "[deleted]",
          "id": 14,
          "comments": [
            {
              "score": 50,
              "content": "To be fair, specifically going to a nudist beach isn’t the same as going to a regular beach. Not wanting to see someone’s private bits doesn’t make you ignorant, it makes you conservative. I’m not arguing OPs point but regular beaches are for more common unless you’re in Europe maybe. ",
              "id": 15,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "i go to the beach every year and i always see at least someone with their ass out. idk where you go, and i’m not sure it’s appropriate if the vacation is meant to be focused around the kids, but it’s not out of the ordinary in any way (and they definitely are the trend, literally look at women’s swimwear ads targeted to young people)\n\nalso, why would her sister comment on something she’s wearing... if it was an attitude problem...? sounds to me like op has dealt with a lot of criticism over the years from her family and this was just a tip in the right direction to have her finally stand up for herseld ",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 220,
      "content": "Alright, I'll be the one to say it, and I say this knowing im gonna get shit on since this is clearly a validation post thats gonna be filled with, well, validation.\n\nYou know that if you're fatter, your ass is going to stick out an absurd amount in a thong. You know this for a fact. You said it yourself. You knew you would get a different type of reaction. Now if you want to accept your body, whatever, who cares but yeah some kids would be put off seeing a giant bare ass on the beach. A smaller ass wouldn't envelope the cloth as much so it wouldnt look like your sister was naked.\n\nHeres what I don't get, I know fat guys. I work with them. If their fatness becomes an issue, for instance they're blocking a doorway or they're taking up multiple seats or they're slowing down the people behind them, I can just talk to them about it and they'd laugh it off and fix the issue.\n\nThey don't get involved in fat pride movements or get offended when they're treated differently for their own choices. \n\nIMO, YTA",
      "id": 17,
      "comments": [
        {
          "score": 230,
          "content": "Hey dude guess what? THONGS GO UP YOUR ASS whether you’re fat or thin. That’s the entire design of a thong. ",
          "id": 18,
          "comments": [
            {
              "score": 56,
              "content": "Yeah, but you should still be able to tell someone is wearing a thing without having to use a magnifying glass. A big ass in a thong would look indistinguishable from a bare ass, a smaller ass would not. \n\nAnd some parents just dont want their kids looking at giant, naked asses. Sorry but its true.",
              "id": 19,
              "comments": [
                {
                  "score": 123,
                  "content": "Be honest - have you ever worn a thong? \n\nI'm a woman and I'm finding it really hard to understand what you're saying. It's the exact same regardless of body type. The waist will still be visible above your ass, the back will still be covered by your buttchecks. Hence why they're famously uncomfortable. Like, of course your butt itself will be bigger if you're a bigger person, but the thong visibility is the same.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Am I the only person who finds them comfortable? ",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "I'm a man so no, but I have seen women in thongs before and I don't see how you can't see the difference. I mean just taking a step back from this logically if you have two giant ass cheeks your eyes are going to focus on those cheeks and not so much on the upper part of the cloth.\n\nTwo smaller cheeks and its easier to decipher that a woman is not just baring her ass to the world all willy nilly. Also, a smaller ass is generally easier to ignore than a larger one.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 58,
                  "content": "But big bums are the rage - just not on fat women, right? ",
                  "id": 23,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Look if you're not even willing to come down to earth and admit that theres a difference between a toned brazillian ass and a fat, cellulite ridden ass then theres no point in continuing. ",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "you’re not going to get shit for not validating op you’re gonna get shit for being sexist lmfao",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 125,
      "content": "ESH\n\nIt’s obvious why the family is in the wrong but you came with full intent on showing skin, and bringing a thong wasn’t very appropriate for a family event. Challenging your sister with the fat shame line was not very mature either.\n\n",
      "id": 26,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 96,
      "content": "NTA - they are for having double standards. ",
      "id": 27,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 76,
      "content": "NTA. Your family is acting like a bunch of dumbass children. I was a bit skeptical because okay, I could get how maybe someone might be put off by a thong style around kids (although at the same time it’s not like any swimsuit is gonna cover that much, why care so much about cheeks when most women are gonna be showing major cleavage?) but when you said your sister I believe it was, was wearing a string bikini showing almost as much ass, you sold me. Let them be pissed off, and if they try to bring it up just play dumb and ask them to explain exactly what the issue was and why no one said anything to your sister who was showing just as much ass. Beyond that, let them go on their shitty vacations together without you. Go on your own vacation and don’t bother telling them. If they get pissy tell them since you apparently embarrassed them so much last time you figured they simply don’t want to be around you at all. Cut them off until they’re willing to have an actual discussion about this because this behavior is ridiculous. ",
      "id": 28,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "NTA. \n\nIf what you say is true about your youngest sister showing more/just as much skin as you and you’re the only one getting this treatment then it’s clear that your family are just not  comfortable seeing your body type so exposed. \n\nMost people expect bigger girls to be more modest. People at my job will say that certain women shouldn’t wear leggings because it’s so unflattering on them and would probably say the same about a bikini. It’s asinine. \n\nDon’t let their hang up become yours. You did nothing wrong. Them being so fixated on such a minor thing is on them. The trip wasn’t ruined in the slightest until they made it that way. ",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 43,
      "content": "ESH with a hint of NTA. I do think if you are bigger sized you should cover as much of you as you can, and this is coming from a hefty girl too. You should wear what you like and what makes you feel comfortable, but at public places you should dress with some modesty. Even thin girls who wear bikinis don't have their asses out, the bottoms cover it. A **THONG** is not something you wear at a public/family place.",
      "id": 30,
      "comments": [
        {
          "score": 47,
          "content": "just to be clear this was a very European friendly beach resort in Jamaica. Even little kids were wearing thong and banana hammock swimwear. My swimsuit choice didn't stand out, even slightly. I was certainly the biggest woman who wasn't covered up in a Mumu but my swimwear choice was very much in line with the rest of people on the beach. ",
          "id": 31,
          "comments": [
            {
              "score": 14,
              "content": "Nta - because you clarified here the choice of clothing didnt stand out. your sister's opinion is just a double standard.\n\nWhen i was in hs, though, one of my chubby classmates (im also chubby) wore sorta tighter, sligthy skimpier clothes, i think it was shorts and a tube top. One of the guy classmates made a comment (behind her back) about how what shes wearing was trashy and indecent because she didn't have the right body for it.  The guy who said it had a reputation of being a good guy (like good citizen). \nThat sentiment is idiotic to me then and now. I think all i said was i dont think she looks bad, but i didn't make a big deal out of it. Anyway sis is ta but shes not going to be the only one who thinks like that :p",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 37,
      "content": "I dont think its appropriate for a family trip but I don't think you're an asshole for it.  It also wasnt appropriate when your sister did it. That double standard is unfair.  ",
      "id": 33,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "NTA. This is sexist, fatphobic bullshit and you need to cut the rest if your shitty family off as much as possible. You deserve better than that sort of abuse.",
      "id": 34,
      "comments": [],
      "relation": "Support"
    }
  ]
}