{
  "post content": "Growing up my mom always taught me body autonomy, and also not to be an asshole to women. As a result I've never been controlling in my marriage and don't think highly of men who try to control their partners.\n\nNow for the issue. My mom and my wife hate each other. They can hardly be in the same room and obviously I chose my wife, but I'm not ready for full no contact with my mom, so we do still see each other on important days such as her wedding.\n\nMy wife wasn't excited for my mom's wedding as she thinks my mom ruined our wedding with her complaining, refusing to wear what she was told, refusing to brush her hair, calling us assholes for having a black tie wedding, and basically showing up in a gown, but everything else looked underdone, hair, makeup, etc. She felt she was showing off, and showing how she didn't care.\n\nI was nervous about how she would act at my mom's wedding. She came down in a full on gown, like a wedding dress, and I begged her to change, but she said no, and if i wouldn't drive her she would uber, so I was like fine whatever. I don't think I get to be the ultimate authority on what she wears, and also I doubted my mom would care. I cannot even describe how laid back she is.\n\nI'm not sure if my mom even saw the dress. If she did there was zero reaction. She didn't really talk to us, but her friends were there, and I'm not sure she likes us much these days. My wife was embarrassing me as she was massively overdressed and clearly trying to be the bride.\n\nThe issue is my grandmother, my grandfather (divorced) and the groom's mom cussed us out. I was really verbally abused over it, so I snapped at them that maybe their marriages suck, but I have no control over my wife. I even texted my mom after the fact and asked if she was mad. She said she thought it was funny and told them to calm down, so I feel vindicated but idk.",
  "id": 1,
  "comments": [
    {
      "score": 455,
      "content": "ESH\n\nSounds like your mom and your wife are acting like teenagers with this ongoing feud and you have chosen to be in the middle of it and try to be Switzerland, which is clearly not possible. Of course you don't \"control\" your wife or what she wears. But as two adults, you should both be acting better than this. You end up being an AH because you are trying to walk a very fine line between your mom and your wife and you'll never succeed doing that.\n\nMeanwhile, you're humble bragging sounds disingenuous and a cop-out for actually mediating peace between the two women in your life. Good luck, dude. Hope you don't have kids.",
      "id": 2,
      "comments": [
        {
          "score": 75,
          "content": "This is unfair. Here's a guy who's doing what women want - giving women autonomy, respecting their independence  and not controlling them and you're insulting him?\n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 140,
              "content": "Let's say the issue wasn't clothing, but that the wedding was potluck...the bride was vegan...and the wife wanted to bring ribs.\n\nOP would step in.\n\nThere's bodily autonomy, and there's appropriate attire designed to show respect for your hosts/the occasion. \n\nThe wife was being an asshole because her MIL didn't wear makeup to her wedding and get her hair done. They both sound awful, but OP's wife seems to have put a lot of effort into being an asshole.",
              "id": 4,
              "comments": [
                {
                  "score": 25,
                  "content": "He did ask her to change. I guess he could have called her bluff and let her take the uber but other than that I'm not sure what you expected him to do to \"step in\". Hire emergency security to kick her out??\n\nMom doesn't sound awful at all. She is laid back so didn't go all out with makeup/hair for her son's wedding but since she wore a gown she was not inappropriate.\n\nWife WAS awful here as she intentionally overdressed to be petty. The consequence was that she embarrassed herself and OP. Unless you think OP is an ass for loving a petty person I don't see what he did wrong. He knew his mom wouldn't care- so he wasn't being spinless by letting his wife hurt his mom.\n\nI'm like the mom - I would think the wife was kind of pathetic and it would not impact my day. Lot's of women don't allow themselves to get drawn into this crap.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I also have side eye for the wife, she was mad his mom “wouldn’t wear what she was told to wear” hmmm… that combined with this move makes me think most of the problem is his wife. \n\nBut absolutely NTA. All he could have done was refused to drive with her and she would have Ubered. I’m not sure what else he could have done…",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I’m wondering if mom just did her makeup and hair like how she normally does. My mom almost never wears makeup beyond lipstick so was very uncomfortable wearing makeup for my wedding.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "okay but vegan potluck or regular potluck?",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "[deleted]",
              "id": 9,
              "comments": [
                {
                  "score": 9,
                  "content": "> she said if I didn’t drive her she would Uber\n\nSame result either way",
                  "id": 10,
                  "comments": [
                    {
                      "score": 36,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -1,
                      "content": "Exactly. She was free to go if she wanted. It wasn't really his problem in the final analysis.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "He couldn't really stop her going. Not without being extremely controlling and getting physical. He told her how he felt and really that was the limit of what was reasonable.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Look. If he had called her bluff and she had stayed home or actually taken that uber then he could say there was nothing he could do. \n\nHe did drive her to the wedding thus enabling that and giving it tacit approval.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -10,
              "content": "Apparently, giving women what they want = being the biggest doormat ever. This guy basically married a younger version of his mom, and both women walk all over him.",
              "id": 16,
              "comments": [
                {
                  "score": 1,
                  "content": "Again you're insulting a man for having the decency to treat women as human beings. Being independent and making your own decisions s I'd not \"walking all over someone\". It's simply being a normal adult.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 1,
                      "content": "There is nothing normal about how horrendously those women treat him.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I mean what exactly do you want OP to do? Lock his wife up?",
          "id": 19,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 111,
      "content": "ESH This whole thing is an impressively gargantuan dumpster fire.",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 81,
      "content": "[deleted]",
      "id": 21,
      "comments": [
        {
          "score": 36,
          "content": "I'm sorry, but how the fuck is he going to stop her from going if she would just take an uber if he didn't drive her? Seriously what could he have done short of locking her up?",
          "id": 22,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "she said she would get an uber to the wedding if he wouldn't drive her--so let her, OP. have a backbone and show her you don't condone her actions. you don't have to control her to not enable her",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Exactly. Get a backbone OP-YTA",
          "id": 24,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 51,
      "content": "Wow. ESH, you included. Stop humble bragging (\"body autonomy, me is\") and figure out why you're in this horror show.",
      "id": 25,
      "comments": [
        {
          "score": 5,
          "content": "“I’m such a nice guy, I respect women and let them know that so they’ll never doubt I’m one of *those* guys who disrespects women, also did I tell you I’m a good guy?” - OP probably",
          "id": 26,
          "comments": [
            {
              "score": 2,
              "content": "This is a common motif on AITA, isn't it.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 39,
      "content": "Wow. What a sucky situation your wife put you in. How old are you guys? \nThis really seems immature and your wife didn’t give two ducks about your feelings at all. If she really couldn’t stand your mom then she could have stayed home.\nNTA",
      "id": 28,
      "comments": [
        {
          "score": -3,
          "content": "Mom should of stayed home on their wedding too",
          "id": 29,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "YTA. But you’re well suited, your wife is an even bigger AH. Good luck to you dude. You’re going to need all you can get.",
      "id": 30,
      "comments": [
        {
          "score": -7,
          "content": "The wife is the ah? When the mom did the same thing? Y’all weird",
          "id": 31,
          "comments": [
            {
              "score": 6,
              "content": "Mom did not do the same thing. Mom wore a dress appropriate for a black tie event, but did not have her hair or makeup well done. \n\nBride wore an elaborate, wedding-like gown to a wedding that was not black tie.",
              "id": 32,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29,
      "content": "Have you expressed to your wife how her actions hurt YOU, not just your mom?  If this keeps up, what will your wife do next to humiliate you?",
      "id": 33,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 20,
      "content": "NTA for not controlling your wife's fashion choice. \nYTA for enabling your wife's massive AH-ness. There's a difference between not controlling someone and being an accomplice. Sure, you don't get the decisive vote on what she wears. But you can put your foot down and tell her she's not being invited to your mother's wedding if her purpose is to go and ruin it. If your wife wanted to flaunt her wedding gown up and down the local mall, whatever. But a GUEST to a wedding needs to behave appropriately and understand the wedding is not about them and certainly not a venue for exacting revenge. \n\nAlso, YTA kind of, for the way you spoke to the upset family members at the wedding. There was no need to insult their marriages to get your point across.",
      "id": 34,
      "comments": [
        {
          "score": 2,
          "content": "She’s just copying what the mom did. If the mom wasn’t cool with it, she shouldn’t of done it either. He can’t stop his wife, but let his mom do it, that’s picking sides and would be worse in the end. The grandparents have a lot to say about the wife, but what did they say when the mom did it? Or were the silent? They prolly had it coming tbh.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "I don't understand your conflict, it sounds like your mother didn't care if your wife wore a Disney princess gown or  a potato sack to her wedding.",
      "id": 36,
      "comments": [
        {
          "score": 5,
          "content": "My mom doesn't care about literally anything. You couldn't even make her react, but it was still a deliberate FU, my mom knew, everyone knew. My grandmother might never forgive us.",
          "id": 37,
          "comments": [
            {
              "score": 24,
              "content": "Maybe you need to take a lesson from your mum and give less of a sh*t. As you say, you can't control your wife (who I note you call controlling), your mum didn't give a damn, so your wife failed to annoy her target and merely hurt you. Perhaps she should realise that as stop wasting her energy on pointless attempts to punish your mother which is doing nothing but hurting you.\n\nHonestly, i rarely side with MIL, but I think this is the one time she might actually be in the right.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">My grandmother might never forgive us.\n\nWhy should she?",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Well, it may have been your wife's intention to rile up your mother but she didn't care so you don't have a conflict.",
              "id": 40,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "NTA— you begged her to change. I don’t see what else you could do— refuse to go with her and so miss you mom’s wedding? Threaten divorce?  Violence? \n\nBut it was shitty of your wife. She’s the AH here. I don’t see how it’s at all comparative— your mom wore no makeup and didn’t get her hair done, that’s not comparable to wearing a wedding dress. And it was shitty to humiliate you.",
      "id": 41,
      "comments": [],
      "relation": "Support"
    }
  ]
}