{
  "post content": "\n\nHello again reddit. Last time I was here I complained about my mother's and my relationship. This time I'm here to talk about my father. This happened just last week and I can't seem to get out of my mind. \n\nMy(15f) parents (38m and 38f) relationship has been a bit rough these past couple of days. They still very much love each other and there are no signs of divorce or anything jurassic but they have been arguing alot.  And last time they argued my dad took it too far. I was upstairs playing games on my pc while my sister (11f) was in hers.\n\n My parents went out to get supplies for a event we had the next day. I wasn't sure what happpend but my mom returned home by herself. She was pulling out supplies when she turned to me and said \"Papi is walking home. He jumped out of the car at the drive thru and told me he was walking home after a arguement\" \n\nI was shocked and she told me she had to leave again. There was one more place she needed to stop by. So she left again. She brought us food but I ate it so fast out of stress eating. Something about my dad is that he is narcissistic. He thinks he's indestructible but I know he isn't and yes our neighborhood is very good but my anxiety went throught the roof. \n\nI opened our garage and waited for him. After 10 mins I broke down Panicking. I wanted to leave to go look for him, I knew the general area of where he could be, but my sister was home and I knew I couldn't leave. I broke down crying pacing the garage and after another 20 mins he got home. I ran into his arms and hugged him. Then told him how stupid he was. Hers how the convo went. \n\n\"NEVER do that again you had me worried\" keep in mind I'm still bawling my eyes out\n\n\"Worried? About what it's me we are talking about cmom\" he said with a chuckle\n\n\"YOU NEVER FUCKING KNOW PAPI\" at this point I'm shouting\n\n\"(my name) you are crying for nothing\" He said at this point laughing. \n\nI told him I can't stand to look at him and ran upstairs. \n\nI can't forgive him. I've never felt fear like that before in my life. The next two days I gave him a bit of a cold shoulder and my moms telling me it's not my battle and I should forgive him and I'm being a jerk for holing a grudge that isn't mines. \n\nAm I?",
  "id": 1,
  "comments": [
    {
      "score": 9,
      "content": "NAH but man, consider some therapy for your panicking, yeah?",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "I mean op can say they need it but if they’re parents don’t sign off on it then 🤷🏽‍♀️",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I've considered it many times but idk how to tell them I need it. I come from a family where mental illness simply is all in your head and you just need to turn to the lord. or what ever bullshit it is",
          "id": 4,
          "comments": [
            {
              "score": 4,
              "content": "See your school nurse or guidance counsellor and get some flyers. They may be more open to things that way.",
              "id": 5,
              "comments": [
                {
                  "score": 2,
                  "content": "Thank you I'll try",
                  "id": 6,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Hope it all goes well.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH. I got mad at a lot of irrational things when I was 15! This seems a bit of an overreaction but it seems there is more to the situation and more on your mind. I also struggle with anxiety and definitely recommend therapy, you might have to shop around to find one that you mesh with.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "Thank you so much",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action is me being mad at my dad for the results of a fight my parents had and if me being mad makes me a asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again/)*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "You sound fucking cracked. Your parents needed to get you in to therapy last year.",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "Probably 💀💀",
          "id": 12,
          "comments": [
            {
              "score": -1,
              "content": "No, you are. Your reaction to literally nothing is completely abnormal.",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "It's weird I think I panicked cause he was so mad like if he told me he was gonna go for a run or a walk I would've been fine but idk 🤷‍♀️",
                  "id": 14,
                  "comments": [
                    {
                      "score": -2,
                      "content": "An adult doesn't have to check in with children.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\nHello again reddit. Last time I was here I complained about my mother's and my relationship. This time I'm here to talk about my father. This happened just last week and I can't seem to get out of my mind. \n\nMy(15f) parents (38m and 38f) relationship has been a bit rough these past couple of days. They still very much love each other and there are no signs of divorce or anything jurassic but they have been arguing alot.  And last time they argued my dad took it too far. I was upstairs playing games on my pc while my sister (11f) was in hers.\n\n My parents went out to get supplies for a event we had the next day. I wasn't sure what happpend but my mom returned home by herself. She was pulling out supplies when she turned to me and said \"Papi is walking home. He jumped out of the car at the drive thru and told me he was walking home after a arguement\" \n\nI was shocked and she told me she had to leave again. There was one more place she needed to stop by. So she left again. She brought us food but I ate it so fast out of stress eating. Something about my dad is that he is narcissistic. He thinks he's indestructible but I know he isn't and yes our neighborhood is very good but my anxiety went throught the roof. \n\nI opened our garage and waited for him. After 10 mins I broke down Panicking. I wanted to leave to go look for him, I knew the general area of where he could be, but my sister was home and I knew I couldn't leave. I broke down crying pacing the garage and after another 20 mins he got home. I ran into his arms and hugged him. Then told him how stupid he was. Hers how the convo went. \n\n\"NEVER do that again you had me worried\" keep in mind I'm still bawling my eyes out\n\n\"Worried? About what it's me we are talking about cmom\" he said with a chuckle\n\n\"YOU NEVER FUCKING KNOW PAPI\" at this point I'm shouting\n\n\"(my name) you are crying for nothing\" He said at this point laughing. \n\nI told him I can't stand to look at him and ran upstairs. \n\nI can't forgive him. I've never felt fear like that before in my life. The next two days I gave him a bit of a cold shoulder and my moms telling me it's not my battle and I should forgive him and I'm being a jerk for holing a grudge that isn't mines. \n\nAm I?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "YTA\n\nAlso, you seem to be all about the drama. Seriously. A freak out over a grown adult deciding to walk home in order to cool down after an argument and you day he was having a tantrum. You sure you weren't looking in the mirror when you diagnosed someone as narcissistic?",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "I know my father. He is very much narcissistic. He thinks he's indestructible and noting can hurt him all because he was a wrestler in high school. Based of information from my mom she told he he got out the car and that's it. he ignore her calls and her texts. When she told me it just put me into high panic mode. If he like just told her he needed to blow off steam then she told me then that's fine I wouldn't have been worried. But I know him well enough to know what he did was being petty. And I completely understand what your saying but I am in no way a narcissistic person. It's him and I dont want to like put all of our drama out but just know it's never been me its him. Also I'm not sure if this was kinda clear but I texted him and asked him where he was and if he was alright but he ignored all of my texts and left me on read which probably sent me into a large panic mode. Which may have been where I was over the top.",
          "id": 18,
          "comments": [
            {
              "score": 1,
              "content": "I would also like to state I know that I shouldn't have to keep tabs on my parents and I don't have to know where they are every second so he shouldn't have to respond to me. But in our family we prefer to check in with each other nothing to gnarly but generally we know where each other are and every like 3 to 4. hours we will check in. So me not being exactly sure where he is scared me :/",
              "id": 19,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Most 15 year olds are narcissists tbh 😂 I think she’s just an anxious teen struggling rn honestly, but we really don’t know her!!",
          "id": 20,
          "comments": [
            {
              "score": 2,
              "content": "Well true, they don't call them teenage drama queens for nothing-although my 15 year old daughter is more of a cantankerous shrew. She just leaves the drama for the stage.\n\nOP does need a reality check though that her response was 100 percent over the top.",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "Oh definitely she needs to work on it, but I’m just expressing that they are not unusual growing pains as a kid 💜 damn I would be pretty hurt tho if my parent called me a cantankerous shrew though when I was just trying to figure stuff out as a teen",
                  "id": 22,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Well, she calls herself that-says it's better than calling herself a raging B. She's pretty self aware of how her mood swings can be and isn't afraid to call herself out for how she comes across. Old soul kind of stuff.\n\nAlso, I am her mom and honestly, she's actually pretty calm and collected, unless she is stressed with a dance performance then she's got massive mood swings which I try to mitigate where I can, such as no tests during stress time (she's homeschooled), supportive nutrition, offering to help with some of her less sensitive laundry so it's done, and most important, being a sympathetic ear when needed.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}