{
  "post content": "My father was never present in my life even after various attempts I made to have a real relationship with him. The little time I spent with him as child he was very abusive (it took me longer than most to lose my baby fat and he'd always make snark comments about it; he'd also compare me to evey other child he knew and I'd always not be as good as them). \n\nWhen I was ten my mother was diagnosed with schizophrenia and depression. Things got really tough, we had to move in with my grandma who became responsible for the both of us. Money was always tight (mental ilness treatment is very expeny in my country). My grandma tried to contact my father to ask for  help with me because it was really tough for me to see my mother in the state she was in. He always said he couldn't take me in or help with extra money because he had a new family that need his attention. After a while he moved to the other side of the country and didn't talk to me for years. \n\nEventually things got better, the meds started to work and now you couldn't even tell my mother has any kind of mental ilness. However, money was still short for us, especially after my mom got pregnant again even after the doctors said that was impossible (abortion is not a option in my country). \n\nAfter I finished HS I had no hopes of ever going to college because we couldn't afford, but my mom still made me take my country's equivalent of the SAT. Somehow I got a 50% scholarship for one of the best schools in the country. The problema was, even with the scholarship, we still couldn't afford and I couldn't work to pay for it because the school was in the next town and I'd spend literally every time off in traffic (we also don't have college dorms here).\n\nAt this point my dad was back in town, so I decided to give it a try and contacted him to see if he could help. He wasn't rich, but he had money and was alwaysdoings stuff with his family so I figured he would have at least a little to help me. \n\nBut all he said was: \"can't help you,,you know that. Just find a job\". And after that he never tried to contact me again.\n\nRight after that my mom received a very high restitution form the state and literally gave it all to me. I went to college, graduated, got a amazing job and now I paying for my sister's college.\n\nLast month my mom made a FB post saying how much she was grateful to have me as her daughter because I was helping with my sister education and then out of the blue my dad decided to contact me and ask for me to help with his other daughter college too. I said I couldn't because I was already paying for my sister's and I was saving to buy a apartment. I also said that maybe she should get a job. I felt really great, but then them he started to say I was being a vindictive a-hole. He made a FB post about it and now a lot of people are agreeing with him to the point where I'm reconsidering it.\n\nEDIT: \n\nWow, this really blew up. I decided to make this edit because it would take me forever to respond every individual message. \n\nFirst, I want to thank you for how nice all were. Also, really thank you for whoever sent the wards, you didn't need, this is just a troaway account. \n\nSecond, I decided I wont be making a FB post to respond to him. A lot of you said I should post my side of the sorry, but tbh I don't think people will care. The ones that are on his side knows he was never present and knows my mom was sick, they just think I should help because we're \"family\" and nothing will really change their mind. \n\nThirdly, I decided to help his kids. I know I have no obligation to them, I know that maybe he's lying about his money problems, but it's just hard for me to see a person I'm technically related to in a situation I struggled so much with. But I won't be given them money per say. A very good friend of mine works teaching for a college in my city, it's far from the best school, but they offer a lot of scholarships and they are cheaper than most. He said he could get up to 25%. As I said, it's really not the best school, but it's still better than nothing if you're in need. They could try getting a loan for the other 75% or something.",
  "id": 1,
  "comments": [
    {
      "score": 16048,
      "content": "NTA. Your father is an asshole. There’s no other way to put it. He doesn’t help at all for your entire life to “help his other family.” Now that you can help him he comes to you. Screw him. Don’t help him.\n\nEdit: Silver! Thank you kind stranger.",
      "id": 2,
      "comments": [
        {
          "score": 3743,
          "content": "I like it how OP said the same on what hier father said years ago.",
          "id": 3,
          "comments": [
            {
              "score": 3674,
              "content": "> I know. It's called a \"cruel irony\", like my dependence on you.",
              "id": 4,
              "comments": [
                {
                  "score": 645,
                  "content": "I never liked your spinach puffs!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 308,
                      "content": "[GASP]",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Hmm I never had one..",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 206,
                  "content": "Pull the lever Kronk!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 166,
                      "content": "Why do we even *have* that lever??",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 126,
                      "content": "Wrong leverrrrrrrrrrr!",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 109,
                      "content": "“WRONG LEVAAAHHH!!”",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 80,
                      "content": "WRONG LEVER",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 103,
                  "content": "\"Hey, that's kinda like what he said to you when you got fired.\"",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "Yzma, put your hands in the air!",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Is there a thread for unexpected emperor's new Grove",
                  "id": 15,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I swear that's one of Disney's most underappreciated movies.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 66,
                  "content": "The poison. The poison for Kuzco. The poison chosen specifically to kill Kuzco. Kuzco’s poison.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That poison?",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Happy Cake Day!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I was literally going to post that quite but I'm glad to see someone did!! You made my morning!",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Literally just watched this again last night.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "Right? And then it's all vindictive? My ass it is, revenge is when you up the game, she simply refused to help after not having been helped herself.",
              "id": 22,
              "comments": [
                {
                  "score": 3,
                  "content": "Happy Cake Day!",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 982,
          "content": "Even if he wasn't a total asshole, OP is not obligated to help a step-sister or half-sister in any way.",
          "id": 24,
          "comments": [
            {
              "score": 811,
              "content": "It also seems like OP doesn't have a relationship with half-sister. OP was literally abandoned by their father so he could focus on his new family, and didn't have visitation because father was 'busy focusing on his new family'. So father essentially wants OP to financially support a stranger.",
              "id": 25,
              "comments": [
                {
                  "score": 104,
                  "content": "Didn't do much of a job of it, did he, since the daughter he \"focused on\" he can't afford college for, whilst the daughter he dumped is out here 100% bossing it and caring for her mom and sister.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 18,
                      "content": "A-FREAKIN-MEN!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 332,
              "content": "OP isn't obligated to help anyone. Step, half, full, identical twin... the only way she'd be obligated is if it were a conjoined twin, and that's simply out of self-interest.",
              "id": 28,
              "comments": [
                {
                  "score": 121,
                  "content": "As an identical twin I find that hilarious.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 10,
                      "content": "As a fraternal twin; I also find it hilarious.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "Idk in this situation she would be an asshole for not helping (the sister she is currently helping) because her mom gave her all the money she had to go to college.\n\nNot obligated in any way to help her asshole dad's kids, though. She should post the real story on his timeline for his friends.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 51,
                      "content": "FWIW, I read it as the state finally gave the mom all the money she was owed for years of child support for OP, so that money was OP’s. Either way, I like that she’s helping the sister she wants to, but I don’t think she’s obligated to do so.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Or share the link to this story.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Well that kind of across-the-board selfishness is literally the definition of being an asshole. A father is normally expected to help his wife and children, that's what he signed up for when he became a husband and father. A woman is not expected to help her father's second family. That's nuts.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Or full sister, yet she did, and that is her choice.   She is justified in not wanting to help this other, random family of strangers that just happens to share partial genetics.\n\n\nDon't second guess yourself OP.  He hasn't been a father in a long time.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Also if OP gives dad or his kids money it's most likely not a one time thing, he'll keep demanding more down the road. Better to just not engage and shut him down straight away.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "Yeah... NTA. That guy is the fucking asshole. Don't give him the time of day let alone any money.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "NTA, propose to turn this aita post into FB post. Two can play this game.",
          "id": 38,
          "comments": [
            {
              "score": 83,
              "content": "I agree, post the whole story with how your dad abandoned and treated you and tag all those ppl. Two wrongs don't make a right but slandering and all that can really go a long way and possibly ruin you career, etc, OP.",
              "id": 39,
              "comments": [
                {
                  "score": 11,
                  "content": "I think if she does that people will twist it and accuse her of taking out her anger on the half sister. That is not the case- the father can help his other daughter, even if he lies. He has never made any sacrifices for OP and is a selfish A. But people feel very entitled to other people’s money without any reciprocity. OP asked their dad which is utterly reasonable. But the people being critical now on behalf of other daughter need to back off.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I was about to say that. Lol \n\nOP - post a link to this on his Facebook post!",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "What makes the father more despicable, is that he contacted after seeing the fb post.  Implying to me that maybe he is able to afford his daughters education, but seeing that there was “free” money to be had from OP he figured he’d give it a shot.  Actually even worse is that when that failed he’s trying to bully\\guilt OP.  Ultimately, who the f knows what he would spend the money on!  Don’t do it OP!  NTA",
          "id": 42,
          "comments": [
            {
              "score": 5,
              "content": "yeah, maybe, if OP is willing to and has enough for it, she can directly contact her half-sister and check with her if the father will provide enough for her education. Will be kind of shitty that this girl, who isn't responsible for her dad's behaviour, might not get an education. I agree that OP should never pass through her dad to help her half-sister tho, the money might never arrive to where it was supposed to go.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "Yeah NTA. OP doesn't owe him anything, he treated OP like they didn't exist and now suddenly because he needs money he does? Fuck that it's so slimey and wrong.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "He's a double A for whining about it on social media.   The OP should respond with some tidbits about how he abandoned them with a mentally ill mother, didn't support his children while their grandmother struggled to keep them then refused to help her with her education.",
          "id": 45,
          "comments": [
            {
              "score": 4,
              "content": "100% she should do this. I would defend myself in the comments and let everyone know the truth. Why would she help a sister she doesn’t know? Or a father who abandoned her?",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Completely agree with this. OP is NTA. OP should also block him on social media.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Completely agree with this. OP is NTA.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA. Good Lord, he is ballsy...and awful. Stop looking at Facebook, it's bad for your brain. You owe them nothing.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4939,
      "content": "NTA - Why the heck does he think you should help his other daughter that you don't really have anything to do with?",
      "id": 50,
      "comments": [
        {
          "score": 2353,
          "content": "From the messages I'm getting, it seems like he's not in a good financial spot anymore. He also has another child, so I'm guessing he's trying to get help from whenever he can. Tbh, I'm feeling bad about his kids mostly.",
          "id": 51,
          "comments": [
            {
              "score": 3544,
              "content": "Not your responsibility. He showed no inclination to even be a family member to you. Ignore the money part. He outright didn't bother being a part of your life. You owe him nothing.",
              "id": 52,
              "comments": [
                {
                  "score": 826,
                  "content": "[deleted]",
                  "id": 53,
                  "comments": [
                    {
                      "score": 102,
                      "content": "You deserve a gold star, this is perfect",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 581,
                  "content": "What this guy said, take the money out of the equation entirely and look at it that way. Your dad has turned his back on you from the start. Don't feel sorry for him. I'm gonna guess his FB post was very one sided.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Not only doesn't the OP owe her father anything, he technically still owes HER years of back child support. Just because she made it to adulthood doesn't mean he stops owing that money in a moral and, if things were just and fair, legal sense. She will never see whatever an equivalent is to a penny in her country of that money, but he still very much owes it to her.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 521,
              "content": "If you feel poorly about kids in need, donate to charity and help those who can't afford food, clothing and shelter. As much as it's a cold thing to say, going to college is a luxury not a necessity.",
              "id": 57,
              "comments": [
                {
                  "score": 39,
                  "content": "I wouldn't really call College a Luxury in this job market. The highest-level job I've seen that doesn't require *some* college or trade school is Dunkin' Donuts manager, which according to Glassdoor, makes about 27k-55k a year.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 30,
                      "content": "They are not in the US.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "It depends on where you are, and OP also doesn't live in the US. If you're struggling on 50,000/year, you probably have more problems than not having a college degree.\n\nEven if you're really struggling on 27,000/year, there are usually options which are doable for most people, even if not preferred.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Trades can be learned through an apprenticeship rather than school.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 365,
              "content": "He made his bed now he has to lie in it.\n\nIf I were you I wouldn’t have even responded to the message. Your dad is a selfish asshole.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 267,
              "content": "He chose not to be a part of your life and decided his new family was more important than you. Turning around and asking you for money now makes him a selfish, hypocritical AH. His kids are not your responsibility. If he can't afford to put them through college, that is unfortunate but not the end of the world - he certainly didn't think it was a big deal when you were the one who couldn't afford to go. NTA.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 191,
              "content": "His kids are not your responsibility. You're not an atm, your dad didn't even keep in touch to see if his daughter is alive and well. Your mom helped you first chance she had and now you help the sister you grew up with. It makes sense. \n\nIf you feel bad for his kids, get to know them to see if you could have a relationship with them. But don't give them money out of guilt, that doesn't make sense. All the people making you feel bad for this either don't know the full story, but if they do, they're are TA for expecting you to hand out money left and right. His kids are strangers to you, are you expected to pay for college for every kid on your street or your cousins? No.",
              "id": 64,
              "comments": [
                {
                  "score": 77,
                  "content": "I agree with you first paragraph. However, probably best not to get to know her half-siblings. If she becomes at all attached to them, their deadbeat father can use that to drain her financially.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yeah probably, given his behaviour. But if she's even considering paying for her half sisters collage, at least have a relationship with her first. She could have the same mentality as the dad and this way OP would know and stop feeling guilty.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Agreed. If she has a desire to get to know them, she should wait til after her father dies to do so. It may take years, but doing it now would just be inviting him to play on her emotions and take advantage of her. The OP is clearly a good person -- she feels like she might be an asshole for refusing to give a ton of money to her utter asshole of a father as it is... imagine how she'd feel if she actually had feelings for her half-sister?",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "yeah if you want to help the kids out then great, that's your choice. It's not their fault their dad can't afford to pay for them to go to college and things. You can have a good relationship with them if you want - they are your siblings after all! \n\nBut - and this is the point - you should do it because you *want to* not because your dad is guilt-tripping you.  He's the asshole. Don't give them money because you feel bad.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "[deleted]",
              "id": 69,
              "comments": [
                {
                  "score": 108,
                  "content": "But they are, can't you see all those likes and internet points????\n\n&#x200B;\n\nYes, that was sarcasm.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If this post gets 100,000 likes, Bill Gates will give me a scholarship.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "I'm assuming the people agreeing on fb have to be his side of the family.",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I am also betting that the side of the story he shared is not indicative of the entire story.\n\nTo be fair, OP's story might not be the entire story either. Truth is like a coin, it has three sides. Just when you flip a coin it almost never lands on it's edge.",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 113,
              "content": "Where was he when the mother of his child, and his child, were struggling? Nowhere. You owe him nothing. You owe the children from the new relationship nothing. Don't set yourself alight to keep others warm. Look after your mum, your sister, and your grandmother.\n\nYou are NTA.\n\nGood luck with your future.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "OP this is not your problem. Do not feel obliged to help here - He and his second family are practically strangers to you. Look after you and yours, you owe these people nothing. NTA",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Do you even know his kids?\n\nIf you have a relationship with them, then they should ask you for help. If you feel for them, then maybe you can help in other ways. Help them get work, get cheap accomodation, etc.... You don’t have to help with cash. Also, what are the chances that these kids would even see said cash?",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Please don't let his nastiness guilt trip you. You own him nothing. \n\nI can understand worrying about his children but you can't support everyone. You have no relationship with them (thanks to him). They may as well be the neighbor's kids. If you divert funds to them it could take away from your sister that you do have a relationship with. \n\nCongratulations on your successes. I am glad you are in a good place, your mother is healthy and you are able to help your sister.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2965,
      "content": "NTA - Your dad tried to exploit you, and he was surprised to find out you had a backbone. \n\nNow he's moving on to Plan B: misrepresenting the situation to your shared social network to guilt you into giving him what he wants without him having to show any remorse for abandoning you and your mom. \n\nBlock him and ignore anyone who takes his side.",
      "id": 78,
      "comments": [
        {
          "score": 1217,
          "content": "He's taken the nuclear option on OP, I'd say go scorched earth on his ass. Reply to his Facebook with every single shitty thing he's done to OP (sounds like they could write a book). Then block, ignore and get on with their life without him. Fuck being the bigger person here.",
          "id": 79,
          "comments": [
            {
              "score": 444,
              "content": "This. Take no prisoners.",
              "id": 80,
              "comments": [
                {
                  "score": 57,
                  "content": ">Take ~~no~~ one prisoner~~s~~\n\nTAKE THE FATHER'S PRIDE",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Agreed! Post a link to this thread on the facebook wall",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 332,
              "content": "NTA. This, and make sure you include every time you or your Mother tried to contact him to help you and how he responded, verbatim. Let him and everyone who might for just a second feel bad for him know what a waste of carbon he his and why you gave him the heave ho. You are not responsible for him in any way. If you want to have a relationship with your half siblings, have one, but don't have it in a monetary form they may be more like him than you know.\n\nEdited: Fixed a word lol",
              "id": 83,
              "comments": [
                {
                  "score": 88,
                  "content": "Financial help for OP's dad: buy him a small plant to carry around with him to make up for all the wasted oxygen",
                  "id": 84,
                  "comments": [
                    {
                      "score": 14,
                      "content": "The poor plant is gonna have to breathe in this man's toxicity",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is a fabulous comment! lmao",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "« A waste of carbon » fucking love it!",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Yep, do him the same favor he is doing you and comment about how you were abandoned and how we refused to visit you and support you listing out every time you asked and his responses. Any comments you get telling you that it is the \"right thing to do for family\" tell them to kick dirt and that they can send him money. Block his number, sit back, and watch the fireworks because I guarentee he is only telling his friends the side that makes him look innocent and you look evil. After you have had your fill of watching his friends turn on him, block him on FB and move on with your life.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "As satisfying as this sounds: Don't do it. I have a father and a family just like that. Don't underestimate how entrenched people are in their shitty positions. They'll see that post and go: \"See? She IS a nasty person, saying all this mean stuff about her father.\"\n\nIgnore, block, mute, just don't engage. The facts may be on your side, but facts don't matter on Facebook.",
              "id": 89,
              "comments": [
                {
                  "score": 50,
                  "content": " \"facts don't matter on Facebook.\"\n\nTruer words were never spoken.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yes, this. Block his sorry, entitled backside",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "No no, don't waste time getting mad at him. Don't go writing shit on his Facebook. Just completely ignore him.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Copy and paste all of this, remove the part about the Facebook posts, and post that on Facebook.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "100% agreed. And I would add: block anyone who takes his side, too. She doesn't need people in her life trying to manipulate her on his behalf.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "OP, you should go read Gerald Ford's life story. His biological father wanted nothing to do with him until he got a football scholarship to Michigan and then his biodad shows up and is like \"Hey, I'm your dad, you should give me money!\" because his bio dad, who had been rich but ignored Gerry, had fallen on hard times (and had a second family even!). And Gerry Ford was like, \"Ummmmmn NO,\" and then became president of the United States.\n\nSo, NTA, and you are in very good company!",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "She should post the *real* story on Facebook, to counter her father's nonsense, and basically say \"For these reasons, I am blocking my father and, if you think I am wrong for not handing my hard-earned money over to this man, I will block you too\" and then follow through with that and live in peace.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This is the right path. Going and stooping to his level by making snarky replies or anything on social media would make you the AH. Don't bother replying to anyone who defends him, it's not worth the effort. \n\nTo those wondering why OP is getting friction from other people remember that his culture is likely different from your own. In some cultures, family (especially parents and grandparents) are above all, no matter previous history. It's a \"do as we say, not as we do\" sort of thing. Hard to convince people with that mentality and again, not worth the effort.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1188,
      "content": "Holy shit NTA\n\nLike...\n\nWow.\n\nThat guy is a complete asshole. You are not the asshole even remotely. Not even a tiny bit.\n\nIf you care about any of the people who are agreeing with him, you can explain the situation to them. If they already know and still agree, you know who your friends are now and it's not them. \n\nBlock him completely. He has told you who he is time and time again.\n\nYou and your mom and grandma are pretty damn amazing. Keep it up.",
      "id": 98,
      "comments": [
        {
          "score": 3,
          "content": "This!!",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 680,
      "content": "NTA his kid is his bill.  You're \"paying it forward\" which is great!Mom could have held money back for your sister but she didn't and you all recognize it.  Your stranger bio dad is trying to manipulate you.  Since he is ok being an ass on FB you should respond truthfully in what had happened, how he was, and such.  If people still bug you then let them help him.  Do not pay for him and his other family.  Take care of you and your family!",
      "id": 100,
      "comments": [
        {
          "score": 71,
          "content": "Exactly, dude wants to throw his cake in the trash and have it too. This is worse than a random stranger asking OP for money, because not only does OP not owe him anything, *he* owes *OP*.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 570,
      "content": "100% NTA!! Seriously he avoids you for years, never even gives money to your mom to help raise you and shrugs you off when you ask for help. It's so nice you are paying for your one sister who i assume you're close to...but do you even have a relationship with your other sister? Anyhow he made it obvious that his other family was a priority and that you don't matter. I'd start by deleting him off Facebook. No need to play fake family/friends with someone who clearly has made no effort to be a real part of your life. Thank him for his genetic contribution and go about your happy life!",
      "id": 102,
      "comments": [
        {
          "score": 526,
          "content": "I'm helping pay for my mom's other daughter's college. We're not very close because of the huge age gap, but I still love her and wanted her to have a better future. I don't really know his other family.\n\nTbh I'm having a lot of mixed feelings. I feel bad for his kids because they seem to be having a lot of money problems right now and I know how hard that is, at the same time I just want to tell them all to fuck off.",
          "id": 103,
          "comments": [
            {
              "score": 653,
              "content": "Yeah but you’re doing that for your sister *and* your mom. You two share a mom. Your mom made it possible for you to go to college. It sounds like she gave you quite a bit of money. So it’s reasonable (and honorable) for you to carry that on and help your sister. \n\nYour father didn’t do anything at all to help raise you. He didn’t help educate you and even though his kids are technically your siblings, any help you give is 100% you being a nice person. But know he sounds like a manipulative a-hole. He’ll do whatever he needs to get what he wants. \n\nMy advice, ignore Facebook. Work, ensure your sister finishes school and save for that apartment. Make sure you always have a safe, warm roof over your head. Your grandma did that for you, and now you can do that for yourself.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 308,
              "content": "6 billion people in the world have money problems right now, but they're not entitled to your hard-earned cash just because they have problems. Their need isn't your problem.\n\nTell them all to take a flying fuck at the moon.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "Well the fact that he hasnt taken any part of your life means you should treat him like the guy that lives down the street or that you pass in the grocery store. Would you give those random strangers money for their child to go to school?? Seriously think about every person you come in contact with rather you talk to them or not. How many of those people are having money problems? You owe him nothing, you owe his children nothing. If your sister passed you by would you even know who she was? \nAnyhow if you truly want to financial help someone out you could probably search GoFundMe and find a story that connects to your heart or a charity. Or search your friends' pages on Facebook to see any charity pages they have set up... obviously not saying you need to give anyone your money to anyone, haha...just trying to say that there are millions of people with financial struggles that need help. You don't actually truly know your father's financial situation because he's not even close to you and if he was would he let you check out his bank account(s)? He may not be filthy rich but maybe he's trying to save his money and get yours... because any bit of money you put towards her school is like putting money in your dad,'s pocket. So, don't let your good deed for your younger sister be a reason to be guilted. You guys share a mom and grandma who have been active parts if your life. Stick to your gut and say f-off...and start but cutting ties with him...and maybe ask your mom if she really thinks it's cool to be his Facebook friend.",
              "id": 106,
              "comments": [
                {
                  "score": 2,
                  "content": "hes actually worse than the guy who lives down the street because he had a moral and possibly legal obligation to provide for OP and chose to abandon it.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "They got to live and easy life with a dad doting on them and part of that came from his neglect of you and his responsibilities. Now that's he's blown it on vacations and fun now he thinks you're supposed to pick up the slack. Its not your problem. And if other people feel some type of way then they can pay for it.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "**Even if you give your money, they will STILL have money problems because of his poor management.**  You will also bankrupt yourself out of a sense of guilt (which you do not deserve).",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "He is doing a huge wrong.  His kids can work hard for scholarships like you did.  He is a sperm donor more than a father and you owe him nothing.  His kids need to help themselves first and foremost.  Who knows if university is even the right choice for them.  I worked all through college.  It didn’t kill me.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "You. Are. Doing. Enough. Do NOT let your father and all of his flying monkeys convince you that you are responsible for him or his daughter. This is NOT your responsibility. I would leave a message on his FB post saying \"Like THIS time you didn't help me? How about THIS time? What about that time you told me to get a job when I asked you for help? Na. I don't even know your daughter, and you don't know me because you never bothered to care. I am not responsible for you or your daughter. Don't go crying to Facebook saying I didn't help you when you were never there for me.\" and then block him and ignore him. He's manipulating you and gaslighting you. Do not let him abuse you further.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Block him and his family. He’s going to play on your guilt and manipulate you.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Honestly, you owe his kids no more help than if a stranger on the internet was asking you to pay for their college. If this comment, a person you don't know and have no relationship with, asked you to pay for my college, or my kids college, would you have any obligation to do it? No. So, you have no obligation to do it for his kids either. You CHOSE to help your little sister out of love and kindness. He's asking for a handout after not helping you ever. Your response was perfect. Hold your ground, you got this 😃",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Let him know that you'll be paying back 3 times the amount he gave you and your mom to help with schooling. \n\nYou seem generous on social media to get those annoying people off your back.  And your mooch of a father will know that 3x0=0",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 297,
      "content": "NTA\n\nYour father is a fucking joke.\nYou did the right thing.\nLet him make his FB status.\nLet him manipulate people into thinking you're the asshole.\nAnyone with half a brain can see he's a piece of fucking shit.\nEverything you have accomplished has absolutely nothing to do with him.\nFuck him.",
      "id": 115,
      "comments": [
        {
          "score": 67,
          "content": "They can't though. They really can't see that. That's the horrible thing about manipulative assholes: Anyone who doesn't dig deeper will think they're angels.\n\nYou should have seen how many people showed up to my uncle's funeral. I was honestly shocked. I went out of solidarity to my cousins, but hundreds showed up because they thought my uncle to be a great man... which he really wasn't.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 197,
      "content": "Not only are you NTA, but you need to respond to his FB whining by telling everyone that he abandoned his kids and his wife and repeatedly refused to help any of you when you were in dire need of financial assistance. So why should any of you help him now when he never saw fit to reach out to you when you were a child? IMO, this man is repulsive. You owe him and his new family absolutely nothing.",
      "id": 117,
      "comments": [
        {
          "score": 13,
          "content": "i like this. just make a FB post, tag him, and let everyone know your side. then block him.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I wouldn’t. Take the high road. If he’s as manipulative as OP says he is, he will just twist this into saying you are making his children suffer for your grudge against him. Block him, remove him. Tell your close family, and move on.\n\nYou are already paying it forward to your sister. You are a good person. Don’t let this guy tell you otherwise.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 167,
      "content": "Holy shit. Block your dad. Never speak with him again, be abandoned you!\n\nWho cares what he posts on Facebook? (Your better off without Facebook too, but that's a different discussion.\n\nNTA",
      "id": 120,
      "comments": [
        {
          "score": 33,
          "content": "Facebook is so toxic.  I doubt any of those people would say those things to her face, or help her Dad pay for the other school if he asked them to.  \n\nIf they lived here they would have applied for student loans.  The student loan place would have contacted the father and forced him to pay a pro-rated portion based on income.  You don't get a pass on being a father. He should know that.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I feel like I had to school really far too find the advice to block him. This dude is toxic AF. Block on every service you can.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 105,
      "content": "NTA OP. It's not your job to pay for or raise your half-siblings even though you're already doing it for one. If you knew them well, grew up with them etc that might have changed some things. But honestly, nobody is entitled to your time or money or even emotions. Certainly not an absentee father who is now hoping you'll take over and save him some cash. These people are strangers to you. None of them reached out or expressed interest in you or advocated for you. So screw 'em. This is money you've earned through your hardwork and efforts and you can decide where you want to spend it. \n\nPlease don't let people who only know his half of the story dictate what you should or shouldn't do. Ignore the Facebook crowd. Focus on your financial stability and pay for your sister's education and your house. Your bio-dad's kids will manage, like you did when he refused to help. There's always a way for someone determined enough. Ignore your bio-dad and block him and his army of flying monkeys.",
      "id": 123,
      "comments": [],
      "relation": "Support"
    }
  ]
}