{
  "post content": "I know the title sounds off but here me out, please be honest with me if I am the asshole. Hey there, I (13 F) is going to an amusement park with friends (13 F , 16 F) and my sister (13F) so roughly around the same age. In this amusement park there is a water park. All the people involved in going (not including me) have already planned about going to this water park. Here’s why I might the a-hole, I my sister that I didn’t want to go to the water park as I am not comfortable with going in a swimsuit. Mind you there is no adult. I don’t know why but I broke down crying when I was telling her, she told me to “grow up” and said “everyone decided we wanted to go to the water park and you said it was ok” \n\nSo am I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH.\n\nevrybody has a valid view point here. but tellign someone to grow up wont make you grow up fast and it wont fix the situation.     can you wair a coverup to make you feel more comfortiblle? id encourage you to wiar your swimsuit with pride and know you are fine how you are. but im just some stranger on the internet. so i know that wont help.\n\nsomeitmes when we have feelings of disscomfort,selfconshuness,or insecurity it makes our body react with tears. im 33 and this still happns.  i hope yall can work it out and have fun.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Thank you so much. I needed that",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "If you don't want to go then don't go. Don't try to control what the others do, though. it sounds like they all want to go to the water park. Also, I don't get what not having an adult around has to do with this. NAH",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Nta. That age is rough and crying is nothing to be ashamed of. Grown-ups cry all the fucking time. If it's uncomfortable to wear a traditional swim suit, and that's the only reason you don't want to go then wear board shorts or male swim trunks and a tank top or t shirt. They even male ones specifically to swim in. In case the park has rules about over clothes. There is nothing wrong with wearing opposite gender clothes. It's all just fabric. Do what you need to be comfortable. Even if that means not going.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "Ty",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA\n\nBody image issues are common, and your sister should respect your wishes, however you may have some options for cover ups or a compromise that may make you both comfortable.\n\nYour sister just wants to be with friends and go to the waterpark, I don't think it came from a place of malice. \n\nYou can get long sleeve swim cover ups and even swim shorts and dresses if you aren't comfortable. When I was in my teens I would just wear board shorts and a rash guard. \n\nSomething to remember (and I know this can be hard to put into practice) is that nobody is going to take any notice of you. People at the waterpark are there to have fun and swim, your swimsuit, or the amount of skin you are or arent showing, wont effect anyone.  You got this.",
      "id": 7,
      "comments": [
        {
          "score": 3,
          "content": "Thank you!!!! I’ll do that",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > It might make me the asshole because I’m acting bratty and I might make everyone else unhappy\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Your body, your comfort level. The crying might be a bit out of place, but you're 13 and hormones can be crazy with emotions. Either way, make up YOUR mind on what YOU want to do. You can go in clothes and hang out (probably going to be kinda boring and lonely while everyone else is in the pool) or stay home. Or go and bring a suit in case you change your mind there.  Side thought, can you shop for a suit that you would be comfortable in?",
      "id": 10,
      "comments": [
        {
          "score": 0,
          "content": "I could but I’m going tomorrow (Wednesday July 7)",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA \n\nHonestly when I go swimming (I'm a dude btw) I dont like to take my shirt off, so I just wear a regular shirt, and I also swim with briefs on, I just dont feel comfortable without it, I would recommend wearing just regular clothes but if you still dont want to go to the park than whatever.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nIt is okay to feel uncomfortable. \"Grow up\" is a very childish response to this situation. Actual \"grown ups\" know that even as adults there are times when we feel uncomfortable wearing certain things....and that's okay. It is okay to cry. It is okay to feel the way you do.\n\nJust wear something you're comfortable in, that you don't mind getting wet. \n\nYour comfort comes first. Everything else will work out and be okay.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI know the title sounds off but here me out, please be honest with me if I am the asshole. Hey there, I (13 F) is going to an amusement park with friends (13 F , 16 F) and my sister (13F) so roughly around the same age. In this amusement park there is a water park. All the people involved in going (not including me) have already planned about going to this water park. Here’s why I might the a-hole, I my sister that I didn’t want to go to the water park as I am not comfortable with going in a swimsuit. Mind you there is no adult. I don’t know why but I broke down crying when I was telling her, she told me to “grow up” and said “everyone decided we wanted to go to the water park and you said it was ok” \n\nSo am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA\n\nYou did nothing wrong. You were trying to express how something made you uncomfortable and got overwhelmed with emotion. It's perfectly natural at your age and still happens to me (21M) every now and then. It might feel like you ruined their day and feel like TAH because of it, and maybe you did mess up their day a bit, but it was nothing intentional and was done in no malice.I know that I always felt uncomfortable when I was away from my parents at water parks, and that is coming from a cishet white guy. If you want to, I'd say apologize if you think it would help how you feel about the situation, but I think you should be fine!\n\nOn the topic of  not wanting to be seen in a bathing suit, don't feel bad about not wanting to wear one in public, it's perfectly normal. My sister has always been uncomfortable in anything but swimshorts and a rashguard shirt, and I never judged her for doing so. Do what makes you feel comfortable (though do be willing to push your boundaries when in safe environments)",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "Thank you",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}