{
  "post content": "So growing up my bestfriend Amber and I were inseparable we grew up next door to each other.\n\n\nShe was even the first person I came out to. And was the biggest supporter after. \n\n\nBut when she was 19 Amber got pregnant. The father wanted nothing to do with it and went completely off the map. \n\n\nAmber didn't want to have a abortion and decide she was going to have the baby. I agreed to help her every step of the way. \n\nBut she then found she was having twins.\n\nThis resulting in her having to drop out of college once she gave brith. \n\nI tried to help to the best of my abilities but I myself was a broke college student.\n\nBecause of this she fell in to a deep depression and treated it with alcohol and eventually drugs. And she start doing stupid thing that put her kids in harm's way. \n\n\nShe never internally hurt the kids  but her action due to her substance abuse have put the kids in extreme danger on mutiple occasions.\n\nShe eventually got reported to DCS by a anonymous party and her kid's were taken from her. \n\n She herself ask me to agree to take them so they wouldn't go into foster care. Which I did. \n\nShe was allowed visitation. But would show up drunk and or high.  This was not a pretty side of her. She say and donstuuf that scared the kids. Would tried to start physical fights with me and my fiancee and on mutiple occasion she down right insult us mostly using homophobic insult on us. \n\nThe she show up high out of her mind talking no sense and tried to run off with the kids and when we wouldn't let her she completely trashed our apartment. That was the last straw.\n\nWe called the cops and she was arrested. \n\n\nMe and my fiancee agree not to press charge if she agreed to give up her custody rights temporarily. \n\nShe agreed to sign the papers \n\nThis all happen over the span of 2 and half years\n\nShe also had a few drug charges that we had no contorl over.  But she ended up getting probation for those and is now posting about how we stole her kids. She still a heavy drug user and has completely converted to homophobia. She tells people we are corruption her children with our reationship. \n\n\nNow here's the part that might make me the asshole. I was the anonymous reporter. I reported her in the first places.  I never thought she lose her kids. As I wasn't aware of how bad she was in the hole with her drug use. I was just hoping the visted might get her to striaghten up her act. \n\n\nEdit: this post should of said temporarily parent rights. Meaning she had the option to get them back of she get sober.\n\n\nSo AITA for \"stealing\" my ex best friend's kids.",
  "id": 1,
  "comments": [
    {
      "score": 12720,
      "content": "NTA. in fact if you hadn't been the one who reported I'd be actually mad at you. The kids needed to be out of there you did not steal them. You did the right thing.\n\n\n\n\nEdit: thank you kind people for the awards, this is the most I've ever gotten :,) so nice. I really thought this was gunna be an unpopular opinion and I'd be downvoted into oblivion. \n\n\n\nOP good luck and thank you for taking care of those kiddos. I'm sure birth mom will give you guys trouble for the rest of her life, but here's to hoping she can get clean and at least be something positive for her children.",
      "id": 2,
      "comments": [
        {
          "score": 1668,
          "content": "This right here! Soo agree! \nOP did the right thing",
          "id": 3,
          "comments": [
            {
              "score": 1571,
              "content": "NTA. And we all knew you were the anonymous reporter before you admitted it. Because that was the right thing to do even if you knew she was going to lose custody. You’ve saved these kids from a horrible life. Just think of that and let go of the rest. And move away for safety.",
              "id": 4,
              "comments": [
                {
                  "score": 842,
                  "content": ">And we all knew you were the anonymous reported before you admitted it.\n\nLol I whispered \"it was OP\" when reading this. NTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 162,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 81,
                      "content": "It was..... Rebekah Vardy (anyone in the uk will get this reference 😂",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Me too :)",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Lol same 😂",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 250,
                  "content": "Part of me will never forgive my family for not reporting my mother. She punched me in the face in front of them. I saw multiple drug deals. Random people in the house. No one did. I am still dealing with everything I experienced.\n\nIf I were those kids I would love to know OP did it. That tells me OP cared about their wellbeing and was willing to take any possible arguments that came from reporting.\n\nNTA, OP. I'm proud of you.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 83,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Yeah, next time OP should ask her if she’d have been happier if her children had been put into the system instead.\nNTA",
          "id": 12,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "In a really sad way, OP is still exactly the best friend the mom friend has always had and needed. She can't see it now, but the kiddos will.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "For real I was screaming in my head \"and what were YOU doing?\"",
          "id": 14,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Exactly my thoughts. NTA.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yep. I was hoping it was OP, too. NTA, thanks for what you’re doing for those children.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Completely random but I love your username",
          "id": 17,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "This.\n\nBest comment here.\n\n&#x200B;\n\nNTA (of course)",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Exactly! OP is not the AH **because** of the report. NTA. You can't save anyone that doesn't want to be saved. And ofc she will blame you, humans are weak creatures that prefer to put all their problems into one enemy they can physically fight instead of trying to take responsibility or, in many cases, accept it was beyond your control.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "NTA. You didn’t steal those kids, you saved them.",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2070,
      "content": "NTA \n\nThose children take priority over the dangerous habits of their so called mother. You reported her and that's good. There are some people who are more dangerous to their kids then beneficial and you did the right thing.\n\nShe can tell people whatever she wants. Those kids are safe with you and your fiance.",
      "id": 21,
      "comments": [
        {
          "score": 254,
          "content": "Exactly. Besides anyone who knows the egg donor, knows she's on drugs and knows why she lost her kids.",
          "id": 22,
          "comments": [
            {
              "score": 71,
              "content": "Bingo! Who's gonna believe anything she says?",
              "id": 23,
              "comments": [
                {
                  "score": 77,
                  "content": "Her friends that are also on drugs, and who's opinions don't matter 🙄",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I agree, OP absolutely did the right thing! I'm so glad those kids have OP and fiancée to look out for them. \nNTA",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1220,
      "content": "NTA.\n\nYou didnt steal those kids. You saved them.",
      "id": 26,
      "comments": [
        {
          "score": 40,
          "content": "Exactly.",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Should have reported her for visiting high/drunk, or denied her entry. OP allowed her to continue harming the kids for far too long.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 437,
      "content": "You're NTA. The health and safety of the kids is paramount. All other considerations are secondary.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 260,
      "content": "NTA. Your focus is right where it should be — the wellbeing of the children.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 202,
      "content": "NTA they’re not her kids and she had other options from the beginning to work with social workers, drug treatment, etc.  That said, beyond the homophobia as being homophobic isn’t a legal issue.  Legally, those are now your children, they’re not hers, she did things to have them taken away and hasn’t done anything to try to get them back.  It would be different is she was clean for years and you didn’t let them see her, but that’s not the case.  That said, it’s hard to get your kids taken away, judges WANT kids to stay with their biological mother, they’ll work hard to make that happen, so this is on her.  Allllll of that said, it is important that they know she’s their biological mother and why (according to their age) she can’t see them right now.  But just like with any adoption, it’s important that kids knows the deal, of course according to their age.",
      "id": 31,
      "comments": [
        {
          "score": 19,
          "content": "NTA. I agree! I think OP went above and beyond as a friend. And now it's time to say goodbye to that friend. She's the legal guardian of these children and needs to put their wellbeing first. Which might mean taking visitation away from bio mom until she changes her behavior. OP also needs to get comfortable with the fact that her old friend may never change. It's honestly a sad situation, but I'm glad the children are safe.",
          "id": 32,
          "comments": [
            {
              "score": 2,
              "content": "Yes...hopefully in time, Amber will realize that she needs to get help, and once she's sorted out her life will thank OP for being the kind of friend her kids actually needed.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "What do you mean they are not her kids ? lol",
          "id": 34,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 186,
      "content": "NTA. You got those kids out of a bad situation and welcomed them in your family. You did the right thing OP.",
      "id": 35,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 176,
      "content": "As someone who was once like those kids. I commend you for caring for them.\nThis actually happened to me. But in stead of best friends,  it was a brother and sister. \nMy mother was a junkie. For the first years of my life I fought both heroin and valium addiction because that was the only way my bio mom could control me and keep the child docile so she could go out and get her fix until I'd go through withdrawal and she drop me off to my grandmother who was 60, blind and suffering from cancer.\n\nHer brother (my adoptive dad) did this. She was basically told to sign her rights of me to him. In fact, some paperwork was filled out wrong and a judge told my now dad to grab me and run and getme away from her, they'll worry about the paperwork later. By this time I was 5 and had ZERO social skills because I never socialized with kids. \n\nI'm 51 now. I'm happy. I was/am loved.\n\nMuch love and strength to you and yours.",
      "id": 36,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 155,
      "content": "> AITA for \"stealing\" my ex best friend's kids.\n\nYou spelled \"protecting\" wrong and you're NTA.",
      "id": 37,
      "comments": [
        {
          "score": 2,
          "content": "This",
          "id": 38,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 126,
      "content": "NTA \n\n>Now here's the part that might make me the asshole. I was the anonymous reporter. \n\nYou would have been TA if you hadnt done so.",
      "id": 39,
      "comments": [],
      "relation": "Support"
    }
  ]
}