{
  "post content": "Several years ago, I purchased for my sister a very expensive dog to comfort her during her battle with cancer. Sadly, her cancer became terminal about two months ago and she died last week. Last month she went into hospice care and my brother went over to her house and took the dog. At the time, this seemed ok because someone had to look after it temporarily, but now he's planning on keeping the dog. Here is the issue: my sister's daughter, now an orphan, wants the dog and I agree she should have it. I don't think my sister would have ever let him take the dog if he'd told her he was going to keep it and I'm certain she would want her daughter to have the dog. My niece did not initially take the dog because she lives several states away in an apartment but in a few months she will be living in a house. I think the best thing for both the dog and my niece is for my niece to have the dog when she gets a house. She is a responsible girl and the dog is one of her last things on this earth that she has to remember her mom by. My brother has been like some kind of Disney villain - taunting my niece and telling her he'll never give it back and it loves him the most now. He was not even very close or nice to our sister, even as she was dying of cancer and I now realize taking the dog in the first place wasn't any kind of generosity to help a dying woman - it was an opportunistic dog-napping. Frankly, I am disgusted by his heartlessness. Anyways, at the funeral, I was eulogizing my sister and complimenting our other family members on their kindness to each other and my sister but when it came to mentioning my brother I just looked at him and the only non-profane words I could muster to describe him were \"my brother, the dog thief.\" Thankfully, everyone laughed and it brought a brief smile to my niece. I've talked to some friends and they are divided on who should get the dog so now I'm reflecting on the situation and wondering AITA for calling my brother a dog thief at my sisters funeral.\n\n&#x200B;\n\nEdit: To those offering their condolences: thank you, that is very appreciated (even if you also concluded I suck ha). My sister had a big personality and a flair for the dramatic. She would have loved to see the outpouring of support for her daughter and it wouldn't have been an event in her honor without a little bit of drama and some brotherly jabs. Her daughter and her dog were her whole world and she would've raised hell against our brother for this.  \n\nTo those suggesting we seek legal guidance: Thank you for your concern. Fortunately, the law is pretty clear in my niece's state. The dog is legally hers, so we're dealing with more of a practicality issue than legal one. \n\nTo those requesting an update: the dog is currently still with my brother, and probably will be for at least another few weeks until my niece can reclaim it. I will try to update then. \n\nPlease do not criticize her for being unable to take the dog right now. If she could, she absolutely would and she is making arrangements as quickly as possible. She's had a lot going on and there is no way she could have better prepared for this situation. \n\nTo those doubting this is real or the full story: I just have to chuckle and be glad not everyone's family is polluted with toxic sadists. I obviously tried to include all the important details while preserving some privacy and brevity, but it's accurate. ",
  "id": 1,
  "comments": [
    {
      "score": 791,
      "content": "ESH - You could not have picked a more inappropriate time to air this grievance publicly, and you know it.",
      "id": 2,
      "comments": [
        {
          "score": 420,
          "content": "I think I just discovered my wife's reddit handle. Hi honey! ",
          "id": 3,
          "comments": [
            {
              "score": 456,
              "content": "I've been fucking Dave for months.  The divorce papers are on the kitchen counter.",
              "id": 4,
              "comments": [
                {
                  "score": 580,
                  "content": "Jokes on you - I've been fucking Dave too!! hahaha",
                  "id": 5,
                  "comments": [
                    {
                      "score": 167,
                      "content": "Damn, me too. Dave knocked me up. Anybody got his address so I can have him served?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Everyone fucks Dave\n\nbut no one asked Dave...\n\nPoor Dave.\n\n*All around me are familiar faces \\*sees op and op's wife\\**\n\n*Worn out places. Worn out faces.....* ",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "r/suddenlygay",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "r/gay_irl",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Dave's got game. ",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 569,
      "content": "NTA, that doesn't seem very offensive.  To clarify, your brother taunts his niece about how her deceased mother's dog loves him more than her.  ",
      "id": 12,
      "comments": [
        {
          "score": 296,
          "content": "Correct. He has been rubbing this in her face and will bring it up even when she doesn't just to compound her grief. It's infuriating. ",
          "id": 13,
          "comments": [
            {
              "score": 90,
              "content": "You went easy on him. I'd say keep repeating it. Maybe even go to social media. Well, maybe that would backfire, but what the fuck is wrong with him? ",
              "id": 14,
              "comments": [
                {
                  "score": 10,
                  "content": "This was my thought as well: ramp up the pressure, particularly if you sense that the rest of your family/social circle would be on your side.  But I can be a bit vindictive so...",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I am not a lawyer, but my understanding is that a dog is technically property, and all property of the deceased, if not addressed in a will, should go into probate if there is any conflict about it.  Probate court (not sure I am using the right term) would then decide ownership, and are likely to side with the daughter, particularly since there is no spouse involved.  ",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Dude if it was my brother who was doing this to my niece I'd beat the living shit outta him and take the dog. Fuck that guy he's the asshole here ",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I mean, the simple phrase isn’t that bad but during the eulogy is the wrong fucking time. ",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yeah I would say you were easy on him.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Honestly he's lucky he's not getting knocked the fuck out for that type of shit ",
          "id": 20,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah, that pretty much says it all. He's terrible.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 349,
      "content": "NTA Your niece can take him to court since she's the heir ",
      "id": 22,
      "comments": [
        {
          "score": 223,
          "content": "Yes, that is true and I've assured her that if it comes to that I will absolutely support her. ",
          "id": 23,
          "comments": [
            {
              "score": 119,
              "content": "[deleted]",
              "id": 24,
              "comments": [
                {
                  "score": 36,
                  "content": "Since it belongs to her sisters estate, if she didn't have a will the daughter is legally (bound? not sure if that's the right word) to get the dog and pretty much everything else. ",
                  "id": 25,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Legally entitled",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Legally entitled, and if the sister was unmarried at time of death and had no will, then (in most jurisdictions in the US) yes it goes to her children. I find it unlikely her dog would be sold yo satisfy any outstanding debts.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "Tbh, you may want to consider just outright taking the dog before it comes to that. I've heard too many stories of people taking things out on the animal in cases like this. \n \nI mean, don't break in or threaten him or anything. But if your niece is ever around the dog, well, maybe she could just leave with it? \n \nI'm NAL, but also, you can't steal something you own,right? ",
              "id": 28,
              "comments": [
                {
                  "score": 9,
                  "content": "It is correct that you cannot steal your own property. If someone steals your phone, then sets it down for a second, you're well within your rights to pick it up amd walk off with it.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 194,
      "content": "ESH\n\nYour brother sucks for, like you put it, being a huge disney villain.\n\nYou suck for bringing it up at the funeral.  If you wanted to talk to him in private about it, that'd be one thing - Instead, you did so in public, during the fucking funeral where the daughter that you claim to be thinking about was grieving the hardest.\n\n",
      "id": 30,
      "comments": [
        {
          "score": 132,
          "content": "Fair enough and I accept your judgment. I'll just reiterate that my niece laughed at the comment. She thanked me later and I have brought this up to my brother in private as well. ",
          "id": 31,
          "comments": [
            {
              "score": 30,
              "content": "nta. you were hurting and the guy did something wrong and you could not contain yourself.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "IMO just because you're justified doesn't make you NTA. Even if it's deserved, make your sisters funeral about this is the wrong way to go about it",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 139,
      "content": "NTA-\n\nHe can mourn when he's not being evil to her child. Steal the dog back with your niece. It'll be bonding. Or threaten to take him to court over it. She'll have some legal standing over her dead mother's possessions.",
      "id": 34,
      "comments": [
        {
          "score": 64,
          "content": "\"Steal the dog back with your neice. It'll be bonding.\" \n\nThat's one way to think of it. lol",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "NTA. This asshole mocks his dead sisters daughter. He needed to get called out in public. Not everything should be discussed behind closed doors. That's where manipulators thrive. ",
      "id": 36,
      "comments": [
        {
          "score": 43,
          "content": "I concur. People who say that it’s not ok to call people out like that in public do so because most of the time it’s not.\n\nBut this is /r/AITA. Shit is weird here, and most cases aren’t really your run-of-the-mill acts of assholery. Now, there’s always a chance that OP is completely lying about everything, but that’s not the job of this subreddit to decide on that. The point is that if OP is being truthful and complete about the details, this is way beyond “taking things private”.\n\nYou do not “take things private” with someone like this. If that kind of person could be reasoned with privately, none of this stuff would have gone down, and OP wouldn’t have needed to make this post.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 65,
      "content": "NTA does your brother have something actually wrong with him? ",
      "id": 38,
      "comments": [
        {
          "score": 94,
          "content": "He's just your run-of-the-mill undiagnosed sociopath. ",
          "id": 39,
          "comments": [
            {
              "score": 34,
              "content": "If that's true, then I would be concerned about him putting the dog down instead of giving it back to your niece.",
              "id": 40,
              "comments": [
                {
                  "score": 10,
                  "content": "I had the same thought, but I am also dealing with run-of-the-mill sociopathy in the wake of a parent's death.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yes, I hope he wouldn't harm the dog but my daughter suggested this as well. ",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 38,
      "content": "NTA- Your brother really does sound like a Disney villain. I think that it's nice that you could make your niece laugh and bring a little bit of levity to such a difficult situation. ",
      "id": 43,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "NTA\n\nIf your sister wanted her daughter to have her dog, she should have it.  Given that it an expensive dog, if your niece shoes not want the dog, it should be returned to the person who purchased it. Either that, or your brother should purchase it, with a contract, from you.  Unfortunately, expensive dogs are property (I hate thinking about my fur babies like that, but it is a legal fact).  If you had purchased a diamond studded necklace for your sister, and your brother took it to look after it, no one would doubt that keeping it would constitute theft.",
      "id": 44,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 28,
      "content": "NTA\n\nHe deserved that. He torments a grieving girl shamelessly? Fuck him. You did right by blasting him.",
      "id": 45,
      "comments": [],
      "relation": "Support"
    }
  ]
}