{
  "post content": "My (30F) and bf (32M) have been talking about our future quite a bit, and he wants to get married and start a family. We’ve been together almost 2 years. We generally get a long really well and we both love each other very much. This whole issue is over whether I’m being as A*hole for wanting this engagement ring. \n\n\nWe’ve been long distance our entire relationship, and I drove up 5hrs each way see him 100% of the relationship. About 6ish months ago when our future came up I mentioned that my family is Muslim and the dowry requirement is practically non negotiable and is fairly sizable. We talked about it and nearly had a falling out, I wound up telling my family that I wasn’t getting a dowry and that would be it. I nearly lost my relationship with my mom and brother, and I don’t already have a relationship with my dad. This was very devastating since my family is extremely important to me, and so is my culture- but I conceded to this bf it was a huge ask. \n\nWell later we talked weddings, and he said he absolutely hated weddings and didn’t see a point to them and were a huge waste of money. Again, my family is huge on weddings and marriages are a family affair. Also I kind of wanted a wedding since my culture we have amazing weddings and I grew up going to and being a part of everyone’s wedding and I always wanted my own that my mom could shine at. Anyways, I also conceded to this since his reasoning makes sense we decided we’d both like an elopement. \n\nAbout a 5mos ago he asked me to move in. This meant I’d leave my job that I love more than anything, and was incredibly difficult for me to consider. The only job I could find was in my old field that I worked hard to leave and am taking a 23K pay cut for the next 2 years. But I did this for love. Plus I’m moving my whole life to be with him. So I said “the only thing I ask is an engagement ring that I’d like that is 2cts which is about 30K-ish.” He responded “okay” which I thought he meant he was good with it. He makes about 50K more than I do, and Well into 6 figures no debt. \n\n\nIt’s now 2 days into me moving in. He asked me to send him a few rings I like, and he was genuinely shocked at the price. I didn’t really understand why. He said he could afford it but it would be half his savings- which he doesn’t mind spending, but he thinks an engagement ring is too frivolous. \n\nI was shocked and upset because I already quit my job, moved in, and locked into a new job that I hate all for him and the one thing I thought I mentioned clearly he scoffed at. \n\n\nI get that it’s expensive. I’m extremely financially savvy, and even conceded that we cut back on a lot of spending in the future. Also I even offered to help him find a stream of income to help him make back the cost and more. \n\n\nI get it’s not a good look, but is my one ask of an engagement ring I want really make me an asshole?\n\nEdit: The dowry was a 6 figure investment (real estate or stocks/bonds) that would be ours unless there was a divorce that was his fault- then it’d be mine. He said he’d only buy into that if it would be ours 50/50 defeating the purpose of a dowry. So I told my family we weren’t going to do this. \n\nWe talked about finances a year ago and I mentioned that I’m very okay financially, but changing job/career would set me back. He then told me recently after this ring debaucle that He didn’t know I would ever actually hold him to this expectation. \n\n\nHe has done a bit for me. He paid for most of our  meals when ever I’d visit. Then he said he didn’t like how much he spent and that I should be helping pay so cost sharing went to 60/40 between him and me. \n\nEdit2: I showed him this post and there’s something he’d like me to add which is fair- I am not paying the mortgage or any form of “rent” (but I am paying utilities and groceries) to make up for the cost of my move up to be with him. This is until we actually get married. Once we’re married I want to split everything equally. \n\nAlso it’s 23k less annually.\n\nDowry explained: A dowry in our culture is a gift to the bride that the family is witness to.\n\nMy family traditionally has it  to be a year of my salary- or his salary if I’m unemployed. I negotiated with my family that it be in the form of investment (like real estate) and it be transferred to my name in the case of a divorce, otherwise it’d be ours while we’re married. And since I work it’s a year of my salary which is significantly more than 30k (several times more). \n\nI’m the last to be married so there’s a ton of pressure from my grandparents.\n\nThe purpose so that if anything happens and my husband leaves me- I’m financially okay. He didn’t want any of it, he didn’t like the idea of buying something that’d eventually be all mine worst case scenario.",
  "id": 1,
  "comments": [
    {
      "score": 6106,
      "content": "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩\n\n🚩\n\n> I drove up 5hrs each way see him 100% of the relationship.\n>I’d leave my job that I love more than anything, and was incredibly difficult for me to consider. The only job I could find was in my old field that I worked hard to leave and am taking a 23K pay cut for the next 2 years.\n\n\n🚩\n>my family is Muslim and the dowry requirement is practically non negotiable and is fairly sizable.\n>I wound up telling my family that I wasn’t getting a dowry and that would be it.\n\n🚩\n\n>nearly lost my relationship with my mom and brother, and I don’t already have a relationship with my dad. This was very devastating since my family is extremely important to me, and so is my culture- but I conceded to this bf since he said that was a huge ask. \n🚩\n\n>and he said he absolutely hated weddings and didn’t see a point to them and were a huge waste of money. Again, my family is huge on weddings and marriages are a family affair.\n\n>I also conceded to this since his reasoning makes sense we decided we’d both like an elopement. \n\n🚩\n\n>he thinks an engagement ring is too frivolous. \n\n>I was shocked and upset because I already quit my job, moved in, and locked into a new job that I hate all for him and the one thing I thought I mentioned clearly he scoffed at. \n\n**Are you so desperate to be with someone that you will make all the sacrifices and GET NOTHING YOU WANT IN RETURN??**\n\nIn case no one ever told you **you deserve to be happy, and have your needs met**. This \"man\" is **not** the one to build your future with. You have given up everything and he doesn't seem to care.  Love means compromises, yes, but from BOTH of you AND it also means you try to make the other person's dreams and desires a reality.  Please stop selling yourself short. Find someone who wants to give you all those things, who aims to make you happy.\n\nAnd NTA for wanting a giant ass ring, that's the **least** he can give you.",
      "id": 2,
      "comments": [
        {
          "score": 2566,
          "content": "In isolation, completely understand the boyfriend not wanting to spend half his savings on an engagement ring. That's just a poor financial decision. But looking at the rest of the situation, it seems pretty freaking evident these two people are wildly incompatible and the only reason this relationship has lasted as long as it has is because the OP is willing to bend over backwards to make this work. \n\nI really hope the OP takes a step back and realizes that she's the one putting all the work in here and that's not fair to her.",
          "id": 3,
          "comments": [
            {
              "score": 1114,
              "content": "Which is how he presents the conversation and uses that to bolster his argument. He tells people “she wants a 30K ring because she’s taking a job that less than ideal, and moving up for me…” which is a massive understatement.",
              "id": 4,
              "comments": [
                {
                  "score": 1315,
                  "content": "The way you have phrased it here makes it seem like he has brought this up to people outside your relationship. The idea that he could be belittling what you have done for him not only to you (huge red flag, of course) but to others? Completely abhorrent. Furthermore, I agree that all of these things stated above are red flags and you are NTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1132,
                      "content": "He has. He put it on here actually and phrased it not only like that he even told me “guess what? The responses weren’t looking good for you!” Yeah no shit- when you tell a bunch I strangers 1/3 of a complex situation in a way that’s favorable it’s a self fulfilling prophecy.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Again. Wildly incompatible. It seems so culturally also",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 660,
                  "content": "I've been married for 32 years, so take this for what it's worth. You are doing all of the giving in this relationship, and he is doing all of the taking. He would be paying the mortgage either way,  so I'm not giving him credit for that. \n\nYou need to think long and hard about how you want to spend the rest of your life. Marriage doesn't change people,  it only amplifies who they are. Do you really want to spend the rest of your life having this argument over and over?",
                  "id": 8,
                  "comments": [
                    {
                      "score": 102,
                      "content": "This op. Yeh thanks for not letting you pay the mortgage — whose name is the house under?\n\nNTA. Move the fuck out. He doesn’t know what taking care of a woman is. Unless you like mothering your partner.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yeah, and also it sounds like he makes significantly more than you? So even after the wedding you should not be paying half. I don't pay any 'rent' or utilities really at all because my fiance makes in one month what I make in four. I tried initially to split it somehow but I pay for groceries and that is basically an even soliton the percentage of income we're both paying to live. THATS what's fair, not half just because you are 2 people. Don't let this man make you pay his mortgage. \n\n\nBut you seem fundamentally incompatible and also he clearly doesn't give a shit what you want. You deserve so much better OP. I know it might seem like you've sunk a lot into this relationship and it would feel shitty to have quit your job and moved out there just to leave but it will be so much shittier when you've sunk more years in and have to divorce because he is not going to change, and he's made it clear he cares more about being right and comfortable than compromising with you on literally anything. \n\n\nMy fiance and I have different things we wanted for our wedding. I'd be MUCH happier just eloping because I think big weddings are a waste of money, but it's really important to him that our families and friends are there. So we compromised and are doing a larger wedding on a budget, because it's important to him and I want him to be happy.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 256,
                  "content": "If you lose  $30K in income each year to be with him... Or, well, you could just buy yourself a ring and still come out ahead as long as you dump him.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 189,
                  "content": "how does he make six figures annually and only have 60K in savings?  Girl, he is lying to you.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 72,
                      "content": "Depending on where he lives that's pretty easy. Six figures doesn't go far in Boston Seattle San Francisco LA New York etc",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "I mean… I make six figures and only have $5k in savings (not counting retirement of course). Cus I own my place, am paying off uni debts and have only been earning that for a year. Savings take time to build up.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Rich people don't just keep their cash in a big pile to swim in.  Having 60k in savings is already an enormous amount of liquid assets that are sitting there doing nothing but losing value.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This is the real question. I would be concerned if I was dating someone making over 100k and have 60k in savings",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 77,
                  "content": "You will be able to find a boyfriend who actually loves you and cares about you. This guy is not guy only person who will love you. \n\n**You have almost destroyed your life for someone who doesn't want to marry you.**\n\nINFO: Why?",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "He disrespected your culture TWICE OP! You almost lost your relationship with your family. \n\nYour fiance sounds really really suspect. This sounds like the opening for long term abuse!! Please leave this man. Go find someone who will respect your culture and give you everything you deserve because what you have rn IS NOT IT!!!!!\n\nNTA",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Who cares how he presents it. It doesn't change the fact that he would rather get other people to tell you not to expect anything from you then actually talk to you and compromise or give you a \"win\" over something extremely important to you. Where has he been inconvenienced at all in this relationship? \n\nYou drove 5 hours round trip and he has the audacity to ask you to split the cost of food. Did he pay you gas money for coming to see him?",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Given that he has refused a dowry, an expensive ring is your future financial security if he ever leaves you.  Frankly, considering how far apart you are in values and how little he respects you and wants you to give up everything for him without him giving an inch, I don’t see the marriage lasting anyway.  Then where will you be?  You have given up a good job, moved away, burned bridges with some of your family, no dowry, and not even an expensive ring to sell to help restart your life.  Pardon me, but you are being an absolute fool to throw everything away on this guy.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Woooow, first of why is he saying  this to people isbso freaking  rude ia your relationship why is he sharing your problems around, and also he come across as a cheap ass, a ring should be the sealing of the commitment he giving it to you as a special gift because it come from his heart and he said ok to it first it's  pretty swlfish of him ask you to move your whole life , you even cut so much cost by not getting a wedding why he doesn't give you the freaking ring at least as an appreciation of all you have done for him. Ut he lied to you about ut",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "NTA\n\nThis man has zero respect for your culture, your persona, and your family. He has made zero effort to accommodate you with the minimum, so far all the major points that are important to you he has refuse to honor them, and now he's refusing the ring? Please think long and hard about continuing this relationship, because is quite unilateral, you're giving up everything, and he has yet to reciprocate with something of value",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "> completely understand the boyfriend not wanting to spend half his savings on an engagement ring\n\nOh definitely. I actually came into this post ready to call OP out for being T A based on the title. I mean it's a waste of money and I'd never want to receive an expensive engagement or wedding ring. \n\nBut then I read the whole post and I was like??? This issue is not about a *ring*.",
              "id": 23,
              "comments": [
                {
                  "score": 72,
                  "content": "Yes. It looks like OP is clinging to the expensive ring because she’s already given up everything else.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 50,
                      "content": "That’s exactly what it is, and that comment in the edit about “how were you gonna hold me to it anyway” is disgusting. My ex would promise stuff all the time and then tell me to my face “I just said that so you’d do XYZ” or “I was hoping you’d change your mind when it came time”.\n\nOP, don’t do it. Cut your losses and find a Partner who values you, and I don’t mean a ring. I mean someone who is willing to drive to you, who wants to mesh cultures and families, who wants to make you as happy as you want to make him. Please stop settling for this AH",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It’s clear they are together because they love each other and even so are ignoring the incompatibilities ....sometimes you have to reason as much as you and your partner love each other sometimes you are too different and incompatible and that’s ok life happens.",
              "id": 26,
              "comments": [
                {
                  "score": 35,
                  "content": "If you genuinely love someone, you'll do things to work with them. OP has put in all the work and he's been reaping all of the benefits.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I don’t disagree sadly not all people think like that though which is a clear red flag imo but that's more to what i was saying you proved my point right.\n\nLove is blinding them :P",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "They don’t even seem to be on the same planet and how would their life look when they are so far off on everything?  They need to reconsider if they are right for each other and if they still want to try to make it work, serious pre-marital counseling is required so they can work out everything and make sure they can come to some understanding about each other and what life would look like together. If he won’t consider that I’d say he’s not really interested in doing anything to make it work and expects her to be making all the sacrifices.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yes. This. I was with someone where the relationship limped along for years longer than it should have because I was so ok with being “chill” snd giving up things that were important to me, snd it was miserable. Op is the only one driving to this man, she’s the only one that’s had to concede her marriage dreams snd traditions. The fiancé has not compromised at all. Now this can seem silly to most, because people dont need big weddings or rings, but it shows a very strong level of incompatibility between them. Op seems to value certain traditions snd her partner does not. Let alone him never coming to her. I’d definitely try to settle this before any more wedding talk, whether that be compromise, couples therapy, or they possibly recognize the incompatibility snd break up",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "This this this. None of these things alone is huge, but together it paints a story of him continually dismissing things that are important to you and expecting you to make huge sacrifices, while he contributes nothing. RUN",
          "id": 31,
          "comments": [
            {
              "score": 42,
              "content": "Exactly NTA...She's just supposed to give up on all that so he doesn't have to do anything..\n\nOP dreamed about a nice wedding since she was little. If they elope/or just stay common-law forever (I really hope not) she will regret it. He sounds horrible and she deserves soo much better!!. I hope she finds that one who will do all the things she wanted and is supportive. This guy ain't it\n\n*forgot nta",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "He's all taking and no giving. She asks, he says no, she says 'ok'. Rinse repeat. Over and over. \n\nShe needs to cut her losses, look up Sunk Cost Fallacy. Because he'll bleed her dry, then walk away without a qualm.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "Her update says he wanted her to add that she doesnt pay rent. Which is irrelavent and just controlling asshole.",
          "id": 34,
          "comments": [
            {
              "score": 32,
              "content": "He owns the house, so he was paying a mortgage anyway, no loss on his part.",
              "id": 35,
              "comments": [
                {
                  "score": 4,
                  "content": "I know, im saying him putting that out there makes him more of the ass cause hes all but im not charging u, on something he already pays and losses nothing on in comparison to all she gave up",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "What the actual f*ck is he contributing here? Even if he has a golden d*ck, that still wouldn't be worth all the sacrifices that you have/are making!!\n\nPlease really reconsider this relationship. You are worth more than this.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "THIS!  He has invested NOTHING in your relationship.  If you stay with him and get married, you need to understand that your marriage will always be about what HE wants.  Though my guess is that marriage will never come.  He will always have an excuse why the timing isn’t right.  Save yourself and get out now!",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "EXACTLY THIS!! OP, you’ve done ALL the giving and your bf is taking taking taking. Why are you tolerating this? Don’t you know your worth? Please dump him and find a PARTNER, not a USER. NTA",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "You forgot to highlight my favorite  \n\n>We generally get along very well \n\nWho says that about someone they love and want to marry?? That sounds like something I’d say about a coworker",
          "id": 40,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Not to mention, he makes 50k more than her (not sure if before or after the move/paycut) and wants to split everything 50/50? That's not fair.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "God, this so much.  You're giving up EVERYTHING YOU WANT to be with him and he is doing nothing.  Marriage is compromise.  This is not.  This is hkm pretty much telling you to jump and you say \"how high?\"  You deserve SO MUCH BETTER than him.  It seems money is more important to him than you.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1582,
      "content": "Man I don’t even know what to vote here. 30k for a ring is exorbitant. Take a step back and think about that. Think about what that amount of money means to the majority of the world. It’s honestly grotesque, no matter how you justify it. \n\nOn the other hand, literally what has this man ever done for you? You talk a lot about the sacrifices you’ve made and are making for your relationship. What has he ever sacrificed to make it work? He couldn’t even be bothered to come see you one time. And you’re throwing away your passions and security for him? Open your eyes. \n\nI guess ESH. I really hope this is a wake up call.",
      "id": 43,
      "comments": [
        {
          "score": 479,
          "content": "I appreciate the second part. I mentioned the 30k to him beforehand he never said anything about it. If he had raised an issue and could talk about it I would have. The amount is “obscene” but it’s subjective. The issue isn’t whether he can or can’t afford it- he can, but just doesn’t want to spend it on an engagement ring. I’ll be losing a lot more than 60k by leaving my old job before I can even make my old salary. \n\nGenuinely appreciate your input.",
          "id": 44,
          "comments": [
            {
              "score": 1103,
              "content": "As a brown girl who was in a similar relationship previously, girl, run. \n\nRun run run. \n\nI hear a lot of my old relationship in this one and even paid for half the ring when my ex proposed. I never expected him to pay a dowry but guess who fronted all the expenses for almost everything?? \n\nI moved in and the relationship became emotionally abusive and then physically abusive. Worst time of my life. \n\nI know other people are focusing on the ring cost or dowry but hear me out. He has no investment in your relationship and you have all the investment. He has nothing to lose.",
              "id": 45,
              "comments": [
                {
                  "score": 645,
                  "content": "Thanks sis. Yeah this whole post has been a reality check.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 392,
                      "content": "My big regret in life was not walking away. \n\nIf I could back 6 years and shake myself out of that relationship, I would.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 107,
                      "content": "Please listen to this commenter, OP. Do you want to spend your life erasing yourself and your desires for this man? I don't know you but I know you deserve better than this.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 96,
                      "content": "Agree to a $5k ring and a $25k dowry. If he refuses, he doesn’t care about providing for your future or investing, he just cares about hoarding his money for himself.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "Please update us once you dump him. Most of these comments are saying the same thing-you’ve done all the giving and he’s put in nothing. And never will.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Can you get your old job back or have you been replaced already?\n\nIt may be time to go back to long distance - and btw, if those meals still weren’t equalling the amount in petrol money you paid to drive 5 hours, then he is still taking advantage. It’s also worrying how confident he is in his position and dismissing the blatant self-centredness. \n\nWhy on earth wasn’t HE driving five hours?! \n\nNTA - that’s overall bc to be clear, I do think that amount on a ring is crazy. But I think this guy wants you to make all the financial sacrifices (driving, paying for your dinner when you are his guest, taking the pay cut and so on) when he gets to keep alllllll his benefits. That’s not an equal relationship at all. Ask yourself - would he have taken a 23k pay cut to move and be with you?? I’m doubtful.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Is there any chance you can return to your old job?",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": "'He has nothing to lose.'\n\nThat is devastatingly true.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "I support you a 100% in wanting more out of a relationship. Your s/o and you do sound wildly incompatible and your relationship sounds very one-sided. You should want and deserve better.\n\nThat being said, I'd just utter a gentle word of caution against pinning your own worth or a man's commitment on the amount he's willing to spend on an engagement ring. It's a silly gesture, at the end of the day. A man willing to drop $30k on a ring is not necessarily a man who loves you and will be a good partner. For future reference.",
              "id": 54,
              "comments": [
                {
                  "score": 111,
                  "content": "Thanks for both words of wisdom. \n\nThis is kind of vulnerable- but honestly I don’t know how to even identify a good man anymore. I see shittier women get married and have their feet kissed by men who would conquer the world for them (I work with these men). \n\nI’m terrified of being single at 30.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 460,
                      "content": "Single at 30 is FABULOUS compared to being married to a man like this. Run!",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 188,
                      "content": "I’d be more terrified of being married to the wrong man, one who doesn’t respect anything about your family heritage or traditions, one who expects you to literally give up everything for him and then ridicules you for the one thing you’ve put your foot down about. One who makes you feel like you should be grateful that he pays for your food when you go so far out of your way to see him. There are great men out there. Being single at 30 is GREAT.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "Girl, I got divorced at 30 and had to hit the dating pool as an adult for the first time. Y'know what? It's awesome. I got therapy after my abusive marriage and being able to talk over the dating process and figuring out what's important to me with my therapist has been so helpful. I've realized that I'm a frikin delightful person and I'm holding out until I find someone who appreciates that and makes my life better. I don't need to settle because there's nothing wrong with being single.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "Nothing worse than being married to the wrong person. And a lot more expensive to get out of. I wasted six years of my life, and escaped scarred, but with my life. It wasn't worth all I put into it. \n\nI'm going to nudge you over to Captain Awkward (google will lead you there) and dig into the archives. So much wisdom.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "OP, if you go through with this, you may not be single at 30 but you will be lonely. In a marriage with a man who doesn't seem to value you at all and doesn't seem at all willing to meet you half way or compromise. And in a situation where you're stuck at a job you hate, in a city you don't want to live, and estranged from your family. Is this man really worth this?",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "I understand how single at 30 can sound terrifying. But divorced with two kids at 39 is far more terrifying. As is being in a one sided relationship. I wish I hadn’t ignored the red flags in my relationship.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I don't know if this is a cultural difference coming through but it might be.  If you are in the US, being unmarried at 30 is A-OK and is not a reflection that \"something is wrong with you or a man would have wanted you by now.\"  Sorry if that's off the mark but based on the remarks about weddings, dowry, etc etc., I'm getting the feeling you're from a pretty conservative family with a lot of strong opinions you might have internalized along the way.  The human brain isn't even fully developed until 28, there is nothing wrong with waiting till 30s to make huge life decisions like this.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Being single at *40* is still better than being married to the wrong man. \n\nThis one has ignored your cultural traditions, hasn’t compromised on ANYTHING, and doesn’t want to see to your future financial well-being if you divorce - if NOTHING else, you need to get a prenup to make SURE that you get something out of this for your financial future. Maybe he is the right guy for you and maybe he isn’t, but it damn sure doesn’t sound like he is to me.\n\nI was 37 before I got married. And my husband was willing to discuss and come to an agreement about everything related to the wedding and kids and everything since then. \n\nAnd he wanted to buy me a super expensive 2 carat plus engagement ring, but I said that I’d rather have a smaller stone that is better quality. He ended up with a great quality 1.25 carat diamond that sparkles like crazy, and it’s perfect- and was still about $10K in 2004! \n\nTrust me, life is not perfect, but the right man is worth waiting for. Best of luck to you.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Hi OP, not sure how old you are now, but I also had built up “single at 30” to be this huge deal. And now I’m single and 30 and honestly, even though it wouldn’t have been my first choice if given one, it’s actually pretty great so far. \n\nPlease don’t stay with someone who is happy to take and take and take from you without giving anything back for a reason like that.\n\nYou seem like a person who will go above and beyond for what you want, so I have no doubt you’ll be just fine without him!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "\\*Hugs\\*.\n\n\\> I don’t know how to even identify a good man anymore.\n\nI hear ya. A few things that have helped me over the years:\n\n1) Friends who are intelligent, emotionally mature, and in the types of relationships you aspire to be in. I had two friends like that. One coached me to communicate in my first relationship. The other friend showed me how a great couple can have different interests and give each other both space and accommodation. I learned a ton from them on what makes a supportive, equal, and joyful relationship.\n\n2) It's not about what the guy will/will not do for you (\"kissing your feet\"): it's about the kind of people they are. A guy who kisses your feet because he is infatuated with you can easily leave you as he become infatuated with someone else. A guy who is steadfast, generous, and loving as a person will be steadfast, generous, and loving as a partner and \\*that's\\* a good man.\n\n3) Unless your family is abusive or dysfunctional, a good man will not take you away from your family, but rather will help you grow closer; a good man will not make you hate or doubt yourself, but will help you grow into a better version of yourself.\n\nIt sounds like rainbows and unicorns, but plenty of my friends and myself have discovered that, when you work hard at being a loving, good person yourself, rainbows and unicorns appear!",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": ">A man willing to drop $30k on a ring is not necessarily a man who loves you and will be a good partner. \n\nIt's just as likely to be a man who wants to buy a wife and has a lot of unspoken expectations from the purchase.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Why would you think he would buy you a $30,000 engagement ring? \n\nHe has never inconvenienced himself physically or financially to visit you.\n\nHe flat-out told you he would not be participating in your culture's dowry tradition.\n\nHe hates weddings in general and has you giving up your dream of one.\n\nHe put you in a position of taking a $23,000 pay cut for his own convenience and pleasure.\n\nEverything you've said about this man makes him seem stingy and unloving. This is not a guy who's going to plunk down five figures for a ring. If he gives you anything, I'll bet money it turns your finger green.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "I hope things work out for you. It sounds to me like you deserve someone who puts as much effort into your relationship as you do. Please really think over your future. You don’t want to be looking back in five years thinking you threw your life away on a man that didn’t deserve it.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "30k is crazy for a ring and there is no other way to look at it.  With that said, There are so many red flags coming from him and honestly with you too, both of you should run in the opposite direction.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "He can afford it, but he doesn't think you are worth it. He doesn't value you, your family, your culture, nothing.  Get out before you put anything else into him, this will not get better.  \n\nYou are worth more than this.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Here's the thing, a dowry is supposed to be yours no matter what, not only if the divorce is his fault. It is a gift to a muslim woman that is hers and hers alone.  Don't let misogyny taint an otherwise lovely tradition.",
              "id": 71,
              "comments": [
                {
                  "score": 3,
                  "content": "You're buying a bride... And claiming it's not misogyny, but the opposite?",
                  "id": 72,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It's a gift befitting the seriousness of the occasion and one that is the woman's and woman's alone no matter what happens.  It is her property independent of her husband.  I think making sure that a woman has independent property as part of starting a marriage is pretty darn empowering and cool.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "If you were buying a bride, you could expect a refund if you divorced.  Don't be obtuse.",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "“Afford” means different things to different people. He might literally have the money for the ring but it doesn’t fit into his financial plan, therefore he can’t afford it. ESH for sure. If he can’t compromise with you then I’m not sure he’s worth marrying.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Take it from a brown Muslim girl. He is not for you. Just run. Cut your lose and run. He will never respect your culture. This won't last. He isn't budging on anything to make you happy while you are doing everything.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It is not subjective. It is objectively disgusting to want/expect a ring for $30k. You have to be in another reality to genuinely think otherwise.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 65,
          "content": "Especially since a $30k ring, if you for some reason needed to resell it, goes for at most $3-5K. It is a *terrible* \"investment\". \n\nAre there options for you both to relocate so you can have a job you don't hate? Have you both discussed how finances will be shared?",
          "id": 78,
          "comments": [
            {
              "score": 43,
              "content": "I’m voting ESH bc obviously there’s red flags, but also sometimes cross cultural relationships don’t work purely because of different values.\nThat being said.. a $30k ring and then previously wanting a huge wedding on top.. I’d be running. That ring could pay my rent for a year and a half. No way would I spend that money on a ring. \nBut I also wouldn’t marry someone with such different cultural expectations than me who made me quit my job to move in with him. Everyone here should cut their losses.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "That is what I was going to say. Diamonds are basically a scam and gave little to no resale value. Certainly only a fraction of what you pay for it. So if you want a ring worth that much for security you are sadly mistaken. Much better to invest the money in something else. Or, you know, find someone who values you. ESH.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "On the one hand, this relationship is entirely one-sided. He has literally and figuratively refused to meet her half-way. She’s given up her home, her job, her field, her salary, her childhood wedding dreams, and her cultural customs, jeopardizing her familial relationships in the process. She’s spent nearly two years driving 10 hours (!!) round-trip to make this relationship happen. Has he conceded a single thing to her? He can’t even pay for dinner? It sounds like it’s all about what *he* does or doesn’t want. Where’s the compromise in any of this? What won’t he expect her to sacrifice in order to cater to his will? Where are the limits of his selfishness?\n\nOn the other hand, as others have stated, 30k is a ridiculous amount of money to spend on a ring. But the real bone I have to pick with OP is that she’s completely sold herself out for this relationship. She’s betrayed her family, her culture, and most importantly, herself to keep this guy happy. She’s been a total AH to herself. So I completely agree with this judgment - ESH.\n\nOP, please love and respect yourself enough to listen to the comments here. This man isn’t looking out for you. He’s only looking out for him. This is bigger than the ring. The history and patterns you describe about this relationship are alarming. You have already given up so much. And for what? A man who complains about paying for dinner when he makes plenty of money and you’ve traveled TEN HOURS just to be there?? Please consider this your wake-up call. Your partner has shown you exactly who he is and what your life with him will look like. You deserve better.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "30k for a ring may be exorbitant, but that’s what she wants. More importantly, that’s the one thing she wants after yielding to his wants repetitively. Don’t forget that a lot of the ‘extravagant’ asks she has are not merely hers, but her culture’s. The dowry, the huge wedding etc are cultural norms for this woman. I would be shocked if there were no religious differences to add to it all. This is clearly a very successful woman, making what? 6 figures annually. He makes that too. So what if she wants something frivolous that she will have have forever? It’s not going to cost them their quality of life. She is allowed to want something ridiculous and frivolous. A nice engagement ring is hardly that. It’s symbolic and something she may very well be buried with or passed down for generations to come. Again, it’s okay for a person to want something frivolous. Especially something that will be cherished.",
          "id": 82,
          "comments": [
            {
              "score": 3,
              "content": "To repeat myself, it’s a grotesque waste of money no matter how you try to justify it with arbitrary circumstances.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "She is also venting.  There is no reason to put anything in here that he did. I assume he is paying the bills since she moved in with him.",
          "id": 84,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 756,
      "content": "You keep giving up your dreams and your wants for him. Over and over and over again. You dreamed of a large wedding - he doesn’t want that so you gave that up. You have a job you love - he wants you where he is so you gave that up. You expected a dowry to match up with your culture - he didn’t like that so you gave that up too. \n\nYou deserve better and this ring, while expensive and getting people all up in their feelings about the  cost, is the least of your issues. \n\nNTA and please know you deserve much better than this.\n\nEDIT: OP, I hope you see this because your ‘edit’ based on his feedback DOES NOT ADDRESS the ridiculous imbalance that is in your relationship. AT ALL. You might not be paying rent, but you also are not on the deed and get nothing if you break up. And he thinks that sometimes paying for meals when he makes (at least) 66% more than you AFTER you have traveled multiple hours to get to him? Girl. The flags are WAVING AND MULTIPLYING.  🚩🚩🚩🚩🚩",
      "id": 85,
      "comments": [
        {
          "score": 274,
          "content": "I’m not even convinced he loves OP. Loved her enough to pay for a few meals when she travelled 10 hours round trip each and every time they saw each other and he says no to everything. No, no, no, seems to be all he says to whatever OP wants. I agree that $30,000 is an obscene amount of money for a ring but that’s not really the point here. This man seems to disrespect everything about OP, especially her culture.  And she just gave up everything — everything! Her job she loved, her income, her home, (almost) her family. What else will he require her to give up? I don’t know, but this guy seems awfully controlling and I think she’s going to find that soon she’ll be giving up her autonomy. Ugh! A gazillion red flags.",
          "id": 86,
          "comments": [
            {
              "score": 64,
              "content": "Yeah this is not about the ring for me but everything else that’s come before",
              "id": 87,
              "comments": [
                {
                  "score": 3,
                  "content": "Agreed.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "I couldn’t get past OP being the one to drive the 5 hours each way 100% of the time!  Selfishness right off the scale.",
          "id": 89,
          "comments": [
            {
              "score": 30,
              "content": "That alone would've been a deal breaker for me.\n\nThe rest of it is just WTF territory.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 448,
      "content": "ESH . Half his savings is an excessive amount to spend on an engagement ring.\n\nBut more importantly it really sounds like you two have wildly incompatible views about weddings and other important stuff. Maybe you need to discuss your respective views on other topics like what religion your children will be raised with to make sure this is the man you want to marry.\n\nI'm also seriously worried about how many sacrifices you're making for this man. Your relationship seems very one side.",
      "id": 91,
      "comments": [
        {
          "score": 49,
          "content": "You’ve hit the nail on the head I think - They seem to have different attitudes to a lot of things here which doesn’t seem sustainable, or at the very least will be challenging.\n\nAgree that ESH. OP - you and your partner need to have some hard conversations about your world views, to at least save yourself from having them for the first time in the heat of the moment. Getting a pretty ring won’t make your bigger issues go away.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "\"half his savings\"... Dude is in his 30s and making six figures. How the hell does he only have 60k saved up? I'd bet anything the dude has at LEAST 500K in stocks or other liquid investments, if not 7 figures. More likely though is he's just straight up lying and has way more cash. This is fishy as hell.",
          "id": 93,
          "comments": [
            {
              "score": 27,
              "content": "And depending on what city they’re living in, half of that income might go to rent. It’s also possible he had a lot of student debt and focused on paying that off before building a savings. Don’t be so quick to assume someone’s financial situation.",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "Around where I live, a 2 bed apartment in a decent neighborhood can clear 3k/mo easy. Avg sale price is well north of 1m$, so that’s about 5k/ mo mortgage (taxes, ins incl) with a 200k$ down payment. \n\n60k in savings ain’t much.",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I'm not sure how you can be so blatantly wrong about the world, but congratulations I guess.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "My first thought was that he might have studied for a while to gain a 6 figure salary or only recently started earning that much. I earn a 6 figure salary (as of 2-3 years ago) but went to University for 6 years before that, and live in an expensive city, so definitely do not have huge savings!",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Just because he makes that much now, doesnt mean he made that much in his 20s. Its pretty obvious. He could have recently started making good money.",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 364,
      "content": "Don’t marry this person. It doesn’t sound like he’s going to meet you halfway on anything that’s important to you. An expensive engagement ring is like a consolation prize.",
      "id": 99,
      "comments": [
        {
          "score": 152,
          "content": "[deleted]",
          "id": 100,
          "comments": [
            {
              "score": 100,
              "content": "He outright lies claiming she didn't want a wedding when that was entirely his choice.  What a dirtbag.  Oh and of course he doesn't mention the months of 10+ hour drives or refusing her cultural dowry and causing a massive rift in her family.  He lied to the internet so he could further manipulate OP.  She really needs to rethink moving in with him, let alone marrying him.\n\nEdit: almost forgot that he promised this ring to trick her into giving up her job and moving in with him and then reneged once she couldn't go back on her end of the deal.  This man is a lying manipulative scam artist.  I would be calling up my old job and landlord to see if you can walk this whole thing back.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "This makes it even worse…. Run.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "Not her boyfriends post, she said she is 30 and her bf is 32",
              "id": 103,
              "comments": [
                {
                  "score": 18,
                  "content": "[deleted]",
                  "id": 104,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh, ok.",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 290,
      "content": "What sacrifices has he made for you? What that you wanted and he didn’t did he give you anyway? Why are you giving up on everything in your life so easily for a man who won’t budge on anything for you? NTA, but you are the doormat.",
      "id": 107,
      "comments": [
        {
          "score": 145,
          "content": "Dang that hit right in the gut. Thanks for the frankness.",
          "id": 108,
          "comments": [
            {
              "score": 36,
              "content": "You deserve so much better OP. \n\nDoes what you want matter to him at all? It sounds like it doesn’t. Your family doesn’t matter to him, nor does your relationship with them, your culture doesn’t matter to him, your job doesn’t matter to him.\n\nIf you stay with him it will likely always be that way. You will bend over backwards to meet his wants and demands, and he won’t make any effort to meet any of yours. Marriage should be about compromise, not strong arming your partner into submission.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 231,
      "content": "ESH. \n\n\nAnd when I say that, I mean you’re being an AH to yourself, not him. But he is being an AH to you. What is the purpose of such an expensive engagement ring? Is it like a way to say you didn’t get literally anything else you wanted so you get at least an expensive ring? What I will tell you, is that you’re going to resent this man. You’re going to resent him so hard for all of this, it may not be today but it will be down the line when he continues to make you sacrifice for him but he won’t for you. \n\nIf you continue with the relationship, I definitely already suggest couples counseling so he can understand how many sacrifices you’ve made for him and how little he’s done to accommodate you. He seems to not respect your culture, your family, your values, nor your happiness. In the rest of the world, a $30k engagement ring is… a lot… and that’s downplaying it. Don’t let him buy you off with a big ring because you’re not getting compromises in any other aspect of your relationship. Please reevaluate… and if you continue with the relationship then please go to couples counseling.",
      "id": 110,
      "comments": [
        {
          "score": 98,
          "content": "I feel like the high priced ring is a way to get him to invest something in the relationship.",
          "id": 111,
          "comments": [
            {
              "score": 4,
              "content": "Yes!  Sure everything depreciates a little when you take it off the lot, but jewelry can be an investment and it’s a symbol of trust and value, like, I’m liquidating my\nmoney and wrapping it around her little finger. \n\nAlso also also, there are payment plans and ways to structure even credit card purchases to spread the cost over time, with or without interest and with churning benefits… so it’s not like he actually has to get rid of half his savings at once",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I can’t imagine wanting such an expensive ring; $500 is the absolute maximum I would accept, and even then, I’d feel ill about it. \n\nBut I also know that if my partner and I were to part ways, we’d both be just fine, because we have never asked each other to make career sacrifices or give up any assets that we each own (or will someday own) outside of our partnership.\n\nBut if I were asked to give up my career and my inheritance (dowry), maybe I would change my tune and, in turn, want some value-dense items that I could sell in a pinch if I were suddenly on my own.\n\nI strongly suspect that the cultural tradition of gifting jewelry to fiancés and new brides evolved for exactly this reason. It’s something extremely valuable and portable that a wife owned all her own—an assurance that she was not *completely* screwed if something went wrong in the marriage.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 211,
      "content": "Out of all the things in your relationship, choosing a 30k engagement ring as your hill to die on is a weird a choice.\n\nNormally I'd say you're crazy for putting so much emphasis on the price of one ring, but clearly this isn't about the ring. It's about him doing something for YOU for a change. \n\nHonestly, it feels like you're desperately trying to 'win' at least one thing in this relationship, and that's frankly quite worrying. \n\nPlease take some time to reflect on what's really bothering you here. Because you do not seem like a superficial person who values expensive things above all else, rather you sound like a women who's been beaten down a lot by the choices of her partner and is trying to draw a final line somewhere. Or rather anywhere.",
      "id": 114,
      "comments": [
        {
          "score": 44,
          "content": "You’re overlooking the fact that there are cultural differences involved here. OP’s culture and family values large weddings and even dowries, neither of which he will compromise on. Is it so superficial to instead want a large investment into a ring? The average wedding is potentially $30k+, I don’t know what the going rate for dowries would be but it’s probably not cheap, and OP will get neither of those things.\n\nThe ring is not the hill OP has chosen to die on. OP had one request, he agreed to it which prompted OP to drop her job and life and move in with him only for him to renege.\n\nOP has sacrificed far more than her SO, the hill is not about the ring it is about his unwillingness to sacrifice or even compromise. What has her SO done to prove he even wants to be with her? Pay for her food? He’s treating the whole situation like he’s settling for her and she should be happy with that.\n\nNTA.",
          "id": 115,
          "comments": [
            {
              "score": 37,
              "content": "That's the same as what I (was trying) to say though? OPs partner has been terrible to her, and she should have put her foot down much earlier when he was unwilling to compromise on much bigger issues. \n\nThat she's now refusing to compromise on an expensive ring feels like she just really wants something, anything, to go her way. Which is worrying, because at least on some level she realizes what an ass her man has been to her, yet instead of facing the bigger issues she's focussing it all on this one ring. \n\nOP needs to have a serious look at the relationship and if this is the kind of man she wants to marry.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Cultures are not indefensible and there is no compromise on dowries that still isn’t just a smaller dowry…",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Rings are not “investments.” You will never ever re-coup the cost of the ring. Honestly, not that I would ever agree to something like that, but the dowry investment thing sounds like a better financial decision.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It sounds like this whole relationship is a hike in the Himalayas, and the wedding ring issue is the one that pushes her high enough to get oxygen deprivation.\n\nI actually suspect that this kind of thing happens a lot with abusive relationships: the thing that makes the abused person choose to leave often isn't dramatic. It's just the point at which they get too tired to try to fix things.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 127,
      "content": "ESH \n\nYou because That is an insanely expensive piece of jewelry and a huge price tag for something that isn’t an investment. So I think it’s assholey to expect that. \nHim because he’s not compromised on anything for you. You did all the travel, you’re giving up your job and city, your family gave up on a dowry and you’re not having a traditional wedding. This marriage sounds doomed before it’s even started.",
      "id": 120,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 71,
      "content": "Info: how do you date and get engaged to someone and not know each other’s stance on marriage yet? \n\nBut you know tbh, I would have said YTA based on the title, but seems like you gave up a lot for your partner. You didn’t even compromise, you straight up just did whatever he wanted to make him happy. Seems like he doesn’t want to give you anything to make you happy, so that makes him the asshole",
      "id": 121,
      "comments": [],
      "relation": "Support"
    }
  ]
}