{
  "post content": "I got a dog 2 years ago (Corgi) and she is very much so my side kick. I've been with my fiance for 5 years. My fiance does like the dog but she is currently pregnant and experiencing massive migraines and has been snapping at everything. \n\nSo every morning when I get up I find my fiance already awake and at the table relaxing. As soon as I get out of the bed, my dog goes nuts. It's like super energy where she is running sideways, barking up a storm, jumping from the bed to the floor a million times (causing the apartment to shake because it's old asf), etc and I will sit there and sing made up songs to her and just fuck around with her. It is pretty noisy and I can be loud. It's just my way of interacting with my pet. I also have ADHD, so I'm fully aware that I can be ridiculously loud and sometimes I simply forget to tone it down. My fiance has complained about it a few times and I will absolutely try to tone it down for awhile but as fucked up as it sounds, the second she stops complaining and it's \"out of sight, out of mind\", I start doing it again. If I catch myself I apologize immediately but sometimes I don't even catch myself doing it. \n\nSo she has been getting up earlier than normal because she says she needs \"peace and quiet away from you and the dog\" because she can't hear herself think when we get up and then she starts getting migraines and being overall pissed off. But now she is complaining because I can sense her not in the bed anymore probably after twenty minutes of her being gone and her warmth no longer there and then I'm wide awake and the dog senses it and ya know. So she's now getting pissed because she thinks I'm purposely not letting her have space and purposely annoying her with my behaviors. I'm not, truly but it seems like it I guess. I've tried just laying in bed for awhile so she can relax but I get stir crazy and I also don't feel like I should have to stay in bed so she can be alone when I live here too. \n\nBut she flipped this morning. I felt her sneaking out of bed this morning at 5am and tiptoe out of the room. I watched her sit at the table with her book. Well, the dog saw me awake and immediately goes ballistic. Jumping on the bed, whining, barking, etc. She comes in and says \"will you guys calm down so I can have time to myself for once?\" I just side eyed her because I'm getting pissed at this point with her demands. She says \"well?\" I tell her to get over herself. Just because she's pregnant doesn't mean I have to change who I am or change how the household works or change my dynamic with my dog. She immediately left after telling me to go fuck myself and won't answer my calls. She's been gone for 6 hours.",
  "id": 1,
  "comments": [
    {
      "score": 54288,
      "content": ">the second she stops complaining and it's \"out of sight, out of mind\", I start doing it again\n\nYTA this mindset is how women get branded as \"nags\" when in reality their partners can't just hold the smallest bit of consideration for others. Your partner is literally sneaking out of bed in the early morning hours to just have a moment of peace and quiet to relax and you can't let her have it because if she isn't actively complaining you can't respect her need to a few minutes of quiet!",
      "id": 2,
      "comments": [
        {
          "score": 36284,
          "content": "OP sounds like the most annoying asshole in existence",
          "id": 3,
          "comments": [
            {
              "score": 15627,
              "content": "She’s probably out looking for a new apartment for her and the baby",
              "id": 4,
              "comments": [
                {
                  "score": 9943,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7199,
                      "content": "He’s going to be doing that thing where dads start tickle fights and wrestling matches at bedtime to “wear them out.” When, in reality, it just gets the kids all worked up and mom has to hang out in bed with them for 2 hours before they’ll go to sleep.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2545,
                      "content": "I mean he's literally training the dog to act in the most obnoxious way possible. As soon as he wakes up, he's participating in and encouraging this unholy racket. And I hope he doesn't live upstairs, because his neighbors probably DESPISE him.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 750,
                      "content": "Or the favorite line of 'kids will be kids' if it's a girl and 'boys will be boys' if it's a boy. Taking no responsibility whatsoever.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 432,
                      "content": "Hopefully she finally got the wake up call that his \"parenting\" will probably be limited to turning the kid into a little monster the same way he did with the dog.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 282,
                      "content": "Yep, he'd totally undermine any attempts at discipline and setting limits.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 252,
                      "content": "seriously 😭 this sounds horrific, I hope she finds her peace and quiet away from OP",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 240,
                      "content": "[removed]",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Exactly.  He’s going to be time of those annoying AH fathers where everyone privately hates having to be in the same room with him or his kid if it takes after him.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Oh, fun really starts when the baby is here. In the beginning babies only sleep for a couple of hours. If the baby is finally asleep and then this dude starts his morning circus waking the baby, I would loose it completely. So latest then, his fiancé will be looking for new apartment if she isn’t already.\n\nOP YTA!!!!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Hey OP'S fiance if you're reading this, this could be your future with the OP. DON'T MARRY HIM! Also, OP YTA!",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8044,
                  "content": "She's probably out wondering how TF she is going to keep you quiet so the baby can sleep. \n\nYTA\n\nI mean, why don't you and the dog go outside, take a walk or drive to a park, and get the noise and nonsense done?  \n\nI love dogs and love playing with mine, but someone else lives in your home now.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3644,
                      "content": "Seriously.  He needs to break this habit now before the baby is born so he isn't constantly waking up a newborn.  He doesn't think he needs to change his life for his pregnant girlfriend????? He's about to have a baby!  Every part of his life will change.   And getting a dog all worked up and jumpy around a baby is a terrible idea too.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 949,
                      "content": "Seriously can you imagine if he’s up to help with the baby at night and the dog is just going crazy. I feel bad for her",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "This is probably the best advice here! Dogs are perpetual toddlers. Take the dog for a nice long walk or just outside to play. They get worn out and will take a nap!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 654,
                  "content": "I hope so. OP isn’t ready to have a fiancé, baby or any adult life. YTA OP",
                  "id": 20,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Also he is not ready to have a dog. This dog should be trained ASAP, this behavior seems frequent and it isn't something new, he should have done something about it way before.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3127,
              "content": "He won’t let her have time to herself, quiet, or space without the dog. She is pregnant, dealing with morning sickness (presumably,) physical discomfort (likely), migraines (definitely,) and OP won’t let her have some quiet. OP is killing his relationship with his selfishness because this untrained dog can’t be behaving like that around a newborn. And if she can’t have her needs met before the baby comes she is completely screwed once she has the baby.",
              "id": 22,
              "comments": [
                {
                  "score": 1803,
                  "content": "Right. YTA. It’s like op has zero empathy. Pregnancy is hard and speaking from experience migraines suck ass. I couldn’t imagine dealing with pregnancy and migraines as well. \n\nThen I guess when the baby is born op will just act crazy with his dog in the mornings still after his poor gf has been up with the baby all night, waking her and the baby, and causing them both distress. I feel for his gf. I hope she’s finding somewhere else to stay for her and the baby.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 920,
                      "content": "And just telling her she'll have to \"get used to it\" after being up all night with the little munchkin, having little to no sleep, wondering if she'll even get a shower that week and hopefully her migraines have subsided.\nBut hey, she'll get used to it, right? 🤦‍♀️🤦‍♀️🤦‍♀️",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Plus being pregnant means she won’t be able to take most migraine meds. Horrible.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1173,
                  "content": "It sounds like he is purposely winding the dog up, not  even making an attempt to calm it down. His fiance just wants a few minutes peace and he won't even try to be considerate. OP is YTA.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 790,
                      "content": "I am struggling to understand why OP can't see his wriggly buddy getting excited, leverage his a$$ out of whatever comfy object it is ensconced in, and go have a happy puppy dance party somewhere else then...leave the lady alone some more?\n\nAnd I have ADD, mind.\n\nLike, just go be happy and prance around together somewhere that is not directly on top of this woman. I'm sure she'd be able to deal with 2 minutes of pass-through noise if they took the party elsewhere for the rest of it. He's deliberately allowing this explosion right on top of her like it's the only place it can happen.\n\nI have 4 mad lad hounds. If they get all crazy in a room that's not right for that, I just do the excited talk and take them where they can be nutters for a bit. My one hound has a greeting bark that is... ear-splitting at its mildest. He often does it when I wake up to do the diabetic dog's insulin at the a$$ crack of dawn, joyous at the fact I lived another day. My partner can sleep through one or two, but if he gets his whole groove on there's residents in the cemetery up the road who complain it woke them. Instead of standing in the bedroom doorway until it's out of his system and wakes my partner, I just go take them outside for morning pee pees and let him get on with it.\n\nIt's honestly not hard. Timid old ladies and small children can manage it with a bit of practice.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 479,
                      "content": "Yes those pregnancy migraines are the worst. All you can take while pregnant is Tylenol and it never goes fully away. I think I'd loose it dealing with a loud obnoxious AH on top of a migraine.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 668,
                  "content": ">He won’t let her have time to herself, quiet, or space without the dog.\n\nI'm not even pregnant but I'm a mega introvert who has done things like getting up really early just to have my alone time. \n\nIf that was repeatedly getting infringed on I would snap. The poor fiancée. She's articulated her needs so many times and OP is being such a callous asshole to her.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 292,
                  "content": "And once that dog constantly wakes the baby and it cries, guess who's fault it will be for \"not being able to care for a baby\"",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Oh the dog has been trained into being a noisy, bouncy asshole. He could be trained out of it if OP cared to, but he'd rather just \"be himself\", so.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "I disagree with your claim that OP’s dog is “untrained.”  Really, OP trained his dog to run around, bark and generally be obnoxious every morning.  The dog is doing what OP wants.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Sadly true. It’s the OP who needs training!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "And she should just tough all that out, but it’s an onerous hardship for OP to stay in bed to give her a bit of peace.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 829,
              "content": "The word 'exhausting' gets used a lot on this sub so I usually avoid it but in the case I'll make an exception.\n\nOP, you are 100% the AH and bloody hell you sound exhausting.",
              "id": 35,
              "comments": [
                {
                  "score": 327,
                  "content": "But he's \"getting pissed at this point with her demands\" after the big fat zero amount of change he's made. Seriously acting like he's the one being martyred here.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "I also like 'insufferable'",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 608,
              "content": "Does he have an idea of what a migraine is and how painful it is? On top of a pregnancy. I don't know how but any pain feels magnified during pregnancy. I can't imagine how OP's (ex)fiance feels when the migraine strikes. When I have a migraine I go into a quiet and dark room. Any noise makes it worse. Then there's this asshole who's proudly telling us about how loud he gets with the dog with no regard to the poor woman's health. If I knew this lady I'd house her just so she gets far away from OP. Obviously YTA OP.",
              "id": 38,
              "comments": [
                {
                  "score": 275,
                  "content": "Now I'm imagining a home for people to stay when they need space and quiet with a migraine. Like a bed and breakfast with cool sheets and limited lighting.\n\nAnd I want to go there. Now.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 14,
                      "content": ">Now I'm imagining a home for people to stay when they need space and quiet with a migraine. Like a bed and breakfast with cool sheets and limited lighting.\n\nI want to go there too!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 186,
                  "content": "Also when you're pregnant, you can't take migraine meds, not even ibuprofen. It fucking sucks!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 296,
              "content": "And how does he think this is going to work w a newborn and a dog so poorly trained that it goes ballistic regularly??  And the lack of self awareness and compassion for gf, jeez. Huge YTA.",
              "id": 42,
              "comments": [
                {
                  "score": 37,
                  "content": "Yup.  It’s five am. Baby has been up all night. You and baby just get back to sleep and this asshole goes ballistic with the dog. And then is like ‘hey man, I can’t change who I am….’   YTA.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "It's fine. 0 chance that his fiancee is staying with him after this, ESPECIALLY when she realises that badly behaved loud dog is going to be around a newborn. She'll want to sleep too, at some point.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "You're loud every single morning",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "“Don’t blame me, it’s my ADHD.”  /s",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3760,
          "content": "Seriously, this is weaponized incompetence using his ADHD. If OP isn’t medicated for his diagnosis, he 100% needs to be before this baby is here, because you can’t leave an infant lying around with an “out of sight out of mind” mindset.\n\nEdit: I know ADHD doesn’t cause rudeness, I have it myself. Yes OP is TA. Just pointing out something that he should address sooner rather than later.",
          "id": 47,
          "comments": [
            {
              "score": 1341,
              "content": "Have ADHD. Had to go off meds for pregnancy. It sucked and I accidentally lit a coffee table on fire. It didn’t, however, make me an asshole with no consideration of other people. Yeah, sometimes people with ADHD can get overexcited and louder than they mean to be, but if it was a problem multiple times, I would have figured out a way to prevent it.",
              "id": 48,
              "comments": [
                {
                  "score": 399,
                  "content": "I am very interested how you set a coffee table on fire and yet I can still remember trying to wrap my mind around how Mom set the night stand in fire.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 396,
                      "content": "One of my siblings managed to catch spaghetti on fire while it was partly submerged in a pot of boiling water. \n\nThat sibling also has ADHD. \n\n(As an ADHD person myself who's had my own share of accidental fires - though none quite as impressive as my sibling's spaghetti fire - I swear improbable fire is an ADHD superpower.)",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 101,
                      "content": "Me too! \n\nMaybe inattention types have elements? Mine might be water elemental, because one time I flooded the neighbors because I started filling a kettle and walked away.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "I was eating a bag of chips and set it down on the coffee table to go into the kitchen. In the 30 seconds I was gone, it tipped over into a candle and when I came back — coffee table en fuego.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 141,
                  "content": "Yes, please, *please* tell us how you accidentally set a coffee table on fire. Was it from not putting something under a candle? Because candles and ADHD are a dangerous combo. Lol. When I was a teen, I once sat too near a candle while wearing grunge-era torn jeans and set my pants on fire.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 195,
                      "content": "were you by any chance more often prone to lying than your average teenager?",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "I have ADHD that just got worse when I was pregnant. Sometimes, I don't think doctors consider the ramifications of us not taking medication during pregnancy.  Thankfully, mine looked up the safest, so I could continue. My son is 3 and appears fine. Worried he could have ADHD though lol.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Our hormones impact our ADHD, which most doctors definitely don't consider.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Adhd can be passed on, it was doctors mentioning that my little one might have it that prompted research and a referral for myself lmao\n\nThat being said, don’t worry about it too much because if they do have it, at least they’ve got a parent that understands which is huge for them.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Am also pregnant and off meds for the duration. Can confirm I didn't suddenly turn into an inconsiderate asshole according to anyone. I might put my phone in the fridge and trail off midsentence but I'm not shoving my adhd into anyone's face just cuz",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 469,
              "content": "Medication doesn't fix rudeness, which is OP's real problem. I have ADHD, am unmedicated, and I still know how and when to STFU, because I taught myself. OP just doesn't give a fuck.",
              "id": 59,
              "comments": [
                {
                  "score": 51,
                  "content": "Yeah. Autistic person here. He doesn’t care and is using his disability as an excuse. You learn to be quiet and if you’re accidentally loud and someone says after the fact you need to be quiet *gasp* you STAY quiet!",
                  "id": 60,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Or go somewhere else if you don’t trust yourself to remain quiet.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Right?! My 10 year old son has adhd and is loud af! In the mornings he leaves the bedroom quietly and stays out, playing quietly until the rest of us get up.  If a child can do it, so can OP. Methinks this guy is looking at a lovely, noisy, pup-filled future, just him and his pet.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "And OP doesn’t even need to teach himself when to STFU. She is telling him, it sounds like daily. Like you said, the problem is that OP just doesn’t care.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yeah, we ALL have ADHD and likely Autism in this house. 2 adults and 2 kids. The 3 boys (partner prefers that term, not infantilising him) can get pretty loud and hyper while I have a lot of sensory overload issues. \n\nNONE of them (kids are 7 and 9) take it personally if I ask them to calm it down. Not only that, they also put in a real effort to remember to do so. \n\nYTA, OP. We can try to work with our ADHD and not use it as an excuse to hurt other people.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 433,
              "content": "i rolled my eyes so hard at that. he thinks that his medical condition justifies his asshole behavior, but he doesn’t think that his gf’s medical condition justifies her need for quiet time",
              "id": 65,
              "comments": [
                {
                  "score": 55,
                  "content": "But you don't understand, he's just so tired of her being pregnant and making demands like \"please be quiet when i have a migraine my head feels like it is exploding\", it impacts his ability to be badly behaved with his dog!",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 399,
              "content": "And he needs to train his dog better! Unless she’s a puppy (which I doubt since she’s shaking the entire apartment) there’s no excuse for him to not be directing her energy better.",
              "id": 67,
              "comments": [
                {
                  "score": 444,
                  "content": "That part got me too, the whole apartment is shaking and dog is barking loudly first thing in the morning EVERY morning? God, the neighbors must hate them so much.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 221,
                      "content": "Imagine when the baby comes and they’re trying to get him/her on a sleeping schedule, then the floor-shaking dog gets going…",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Don't miss the part about how he's nonstop singing made up songs to his dog. I doing it interesting that he said \"I got a dog 2 years ago\" and \"I've been with my fiance for 5 years\" and \"my dog is my sidekick\". I wondered if they were already living together and OP just up and brings himself home a dog?",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "As an ADHD & migraine-having person, I would be fucking livid at this guy if he were my neighbor, let alone my partner. ADHD is not an excuse to be an asshole, and I honestly hope that if his partner moves out (because raising a kid with no partner is generally better than with a partner who actively makes your life worse) that his neighbors complain and get this guy out of their building. I may be harsher than usual because the pain of my most recent migraine is still fresh in my memory, but c’mon dude. Try to be a decent human, and decent dog owner by, you know, training your dog and taking other people into consideration. And maybe stop using buzzword phrases about our lack of object permanence to “justify” your shitty behavior.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 272,
                  "content": "And Op says “she likes the dog fine”. \n\n…Unless you’re the most patient of dog people, it’d be pretty hard to “like” a dog who is being extremely loud, behaving badly, and having it’s bad behavior encourages by your partner when you’re exhausted, pregnant and have a migraine…",
                  "id": 72,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I love animals, even ones that are less than perfectly behaved. But if I was pregnant, having daily migraines and was living with an asshole who had a loud, obnoxious badly controlled dog rampage every morning, I'd hate that animal living with me - or that person living with me.   \n\n\nThe dog is probably lovely, just badly trained. OP, however, doesn't have that excuse.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 63,
                  "content": "The age of the dog doesn't matter. It isn't sustainable to have a dog that behaves this way. The dog ounds stressed af",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Corgis are working dogs not apartment dogs so it’s no wonder the poor thing gets so loud, energetic, and wild. You can’t really train that kind of energy out. They are meant to chase cattle. Mine turns into a total AH if I don’t let him run around our big backyard for enough hours in the day. I feel bad for the dog and the fiancé.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah my first thought is why is he letting the dog run around the bedroom instead of taking the dog out for a walk? If he's not taking the doggo for a walk when it obviously has that much energy, is he taking it out at all? Sounds like he isn't taking care of the dog like it needs.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 376,
              "content": "Yep. My husband has ADHD and very much lacks impulse control before he takes his medicine in the mornings. I let him be most of the time because I love him and want him to have time every day to give his brain a break. But if it ever gets to be too much for me, he immediately starts trying to control himself a little more or at least goes to a different part of the house so I can have some quiet time. \n\nI’m also 6 months pregnant at the moment, so I’ve been more irritable than normal (thanks, hormones) and have needed calmer mornings more often than usual. And he’s been very understanding about it. Just because his ADHD lessens his impulse control doesn’t mean he CAN’T control himself if he really wants to (I’m talking to you, OP). YTA. Give your poor fiancée a break.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "I've been diagnosed ADHD since i was a kid. Quit my meds in high school. So over 10 years unmedicated ADHD and I'm not this rude. My husband is also unmedicated ADHD and he ain't rude. Our oldest child was just diagnosed as ADHD, and she's unmedicated, and not rude. Op is doing it intentionally and using ADHD as an excuse. Before anyone says that's just me and my husband and kid. No it isn't. I know a LOT of unmedicated ADHD people who also aren't as rude as OP is being. Op is the AH.",
              "id": 78,
              "comments": [
                {
                  "score": 19,
                  "content": "I'm unmedicated and if I ever am rude or think I've been inadvertently rude I ...apologise? Imagine that lol.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 15,
                      "content": "But see that's the difference if you or anyone else whose commented even slightly feels they've done something rude we apologize, then not do it again. This person does it daily constantly all the while knowing they're pissing off their partner and then telling them to just \"get over it\". No that's being rude and NOT an ADHD thing.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "See my partner and I both have varying degrees of ADHD and possible ASD, his being more severe, so I do end up reminding him of things a lot but the difference is he genuinely tries his best and apologizes profusely when I have to remind him of stuff. I KNOW he’s trying his best but OP just sounds like he’s just being a complete jackass to his pregnant fiancé.\n\nAlso OP train your dog. Seriously. What level of apartment are you on? Because I also feel sorry for your downstairs neighbors or really all of your neighbors if you are THAT LOUD. YTA",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1330,
          "content": "OP\n\nI’m going to propose a new way to interact with your dog. You at 6am leave the bed and take your dog outside for a walk. Because you know ADHD keeps you from actually remembering to stay quiet. So if you are outside for let’s say 1 hour to interact with your dog and let him whine bark and jump, your wife will get the quietness she deserves. And ya know the bed won’t need to be warm anymore…",
          "id": 82,
          "comments": [
            {
              "score": 379,
              "content": "That seemed the simple short-term solution to me. If they want to be annoying, do it in the local park.\n\nMedium-term, OP needs to train his dog and it does appear to be his as he has been with his fiancée for 5 years but starts this whole thing by saying 2 years ago he got a dog. I imagine his girlfriend at the time agreed to it to shut him up as long as he looked after it and trained it properly, which he hasn't.",
              "id": 83,
              "comments": [
                {
                  "score": 68,
                  "content": "Imagine when the baby comes and OP and the dog are acting like this every fucking morning.\n\nOP: Actually babe, if I do any night care for the baby, you know the dog will get riled up! \n\nOP: Sorry sweetie, I have to take care of the dog, I can't possibly go calm down the baby after the dog woke her up! \n\nOP: Sorry daughter, I can't have custody of you! The dog doesn't like it when you cry, and dog is more important than human!",
                  "id": 84,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Every time the wife gets up to tend to the kid and husband feels the bed get cold ya know, then everyone is going to be up 2 am, 4 am, 6 am",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Ugh I love that he's totally helpless about it. \"Well the dog knows I'm up, there is literally nothing I can do to prevent it from being loud and obnoxious\" when we known damn well he has created that pattern...seeing as the dog doesn't do it with the fiance...\n\nI wouldn't want to raise a kid with that guy.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1189,
          "content": "Pregnancy hormones are fun.  I’ve noticed that people who are pregnant aren’t irrationally upset in most cases. It just gives them zero tolerance for people’s bullshit that they might have allowed to happen before.",
          "id": 87,
          "comments": [
            {
              "score": 490,
              "content": "Forreal. If this guy was paying even a modicum of attention to his fiancée’s life he would know that 1. The only painkiller you can take during pregnancy is Tylenol/acetaminophen, and 2. Tylenol does jack shit for migraines. Not every emotion and reaction had by women is hormonally induced, she’s angry because she’s in pain and her “partner” insists on triggering the pain on a daily basis.",
              "id": 88,
              "comments": [
                {
                  "score": 59,
                  "content": "If anything, being hormonal is just like being tired or having had a bad day - it doesn't make what you do irrational, but it just lowers your tolerance for bullshit. So things that she may have let slide before she simply does not have the engergy to let slide any more. I don't have hormonal swings right now (thanks, contraceptive implant!) but I DID notice that I was more likely to be upset or have 'talks' with my partner or family after night shifts or exhausting weeks of long hour shifts, because things that would have been a minor annoyance felt a lot bigger when you're bone tired and just don't need more shit.\n\nThe feelings would have happened anyway, because NOBODY likes loud noise at 5am in the morning, least of all when they are having a migraine.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I think Tylenol might be verboten now too? Or at least there’s a class action brewing for it.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 304,
              "content": "This is what I keep trying to explain to people around my period. I've had multiple people tell me I snap \"over nothing\" when I'm PMSing, and I keep having to explain that the things I snap over are things that bother me THE WHOLE MONTH, I just no longer have the patience to deal with it.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I'm learning firsthand that menopause is much the same way. I'm not upset; I'm just increasingly out of fucks to give.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 469,
          "content": "I want to know how in the world OP expects to handle the massive amount of change a baby would bring to his household, if he can't even give his fiancée some quiet time.\n\nFortunately, I think she's broken up with him.  Given he can't accommodate that small request, he's in no way ready to be a parent.",
          "id": 93,
          "comments": [
            {
              "score": 55,
              "content": "100% he'll handle the change by changing nothing about himself or his routine",
              "id": 94,
              "comments": [
                {
                  "score": 43,
                  "content": "And complaining loudly about \"my nagging wife\" who gets stuck doing all the childcare probably while working full time as well.",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "He's going to expect the fiancée to handle it because \"he's got ADHD\".",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 395,
          "content": "This! Also YTA for thinking you don’t need to change the dynamic. The way you let your dog act crazy all the time and be super loud won’t work when the baby comes either. The fact that you won’t even be a little bit more considerate for your fiancé who is experiencing migraines as a direct result of your behavior makes you an incredibly self involved AH.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "Right?! I hate people who own dogs and then refuse to walk them! GAWD dude, take your dog outside and walk 'til you and your pet are tired. Give some peace,  you and your pet get obviously much needed exercise!!",
          "id": 98,
          "comments": [
            {
              "score": 189,
              "content": "Or give the poor dog some mental stimulation! A snuffle mat breakfast is a great way to burn off some mental energy in a nice, quiet way. Or a puzzle feeder. Or how about *gasp* a training session!",
              "id": 99,
              "comments": [
                {
                  "score": 69,
                  "content": "Need two, one for the guy!!🤣",
                  "id": 100,
                  "comments": [
                    {
                      "score": 13,
                      "content": "The training session or the snuffle mat? 🤣",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Yes, this whole post I was thinking, \"OP, have you not tried getting up quickly and quietly and slipping out the door and off to a local dog park, trail, puppy playground, state park, or anything?\" The dog needs exercise and mental engagement. So many people get dogs who were bred for a particular task - working dogs - and then fail to understand that the dog NEEDS THE JOB. Or something similar.\n\nOP, YTA, and you sound a lot like you are saying, \"well, I've tried nothing and I am all out of ideas!\" Do better.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "You deserve an award for this",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "and if she’s actively complaining she is told to get over herself and she is annoying to him.",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "Yeah, this line just sealed the YTA for me.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24996,
      "content": "Do you think this morning routine is going to be helpful once the baby is born?\n\nYou're loud every single morning and not caring about the physical distress of a person growing an new human in her body. A new human that I'll assume is also yours...\n\nStart working on another way to relate to the dog in the morning that allows other people in the house to have peace.\n\nYTA",
      "id": 106,
      "comments": [
        {
          "score": 11415,
          "content": "For real. Grab the leash and head to the park for an hour or so, win win for everyone. What the actual fuck.",
          "id": 107,
          "comments": [
            {
              "score": 4545,
              "content": "This is the answer right here.\n\nHonestly, it seems like OP just wants to take up all the space in the room every waking moment.",
              "id": 108,
              "comments": [
                {
                  "score": 2552,
                  "content": "*All the space in the apartment. He can't even give his fiancé a single room to herself. What a massive AH",
                  "id": 109,
                  "comments": [
                    {
                      "score": 343,
                      "content": "Didn't he make a comment that it's \"only\" a tiny 3 bedroom apartment?",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 983,
                  "content": "[removed]",
                  "id": 111,
                  "comments": [
                    {
                      "score": 387,
                      "content": "And a dog that sounds exhausting!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Well, sort of 3 if we’re including the dog.",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 42,
                  "content": "YTA\n\nYou need to get over yourself and appreciate that you've poorly raised this dog and can't put your shitty routine aside for a pregnant woman. The more stress you choose to put her through, the more stressful pregnancy and your relationship will be. You are inconsiderate and selfish.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 12,
                      "content": "HAHA--I thought you were replying to ME and was like, \"Holy crap...how does this random Redditor know I'm shiite at training my dog?!\"",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 37,
                  "content": "I sense that OP is very “main character”. I have ADHD as well and I feel no need to act like this. I am the first person up in the mornings and I do everything I can to keep the dogs the quiet so they don’t wake my family up.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Plus he seems to be overbearing enough she can’t get ANY time for herself. She wakes up early, he doesn’t feel her there, he and dog start ruining her peace.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1228,
              "content": "Seriously, start training the dog NOW. Not when baby is already here. More time outside in the morning instead of driving the whole house crazy.",
              "id": 118,
              "comments": [
                {
                  "score": 886,
                  "content": "Not just a house! They live in an APARTMENT which means he's an asshole to not only his fiance but his neighbors too.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 221,
                      "content": "YES. I live in an upstairs apartment with two apartments below. One has a little yippy dog who barks constantly at the slightest noise. I get it if I drop something and it gets startled but I can't walk into the kitchen or down my outside steps without hearing it. And he does nothing about it. OP is a major AH.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 325,
              "content": "Literally the best solution I’ve seen. OP and the dog can get their obnoxious energy out and the GF gets the peace she so desperately needs.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "This is the best solution in my opinion!! Good shout.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Or even better: train the dog to be quiet on command. \nImagine the not unlikely situation of the baby waking up at night. It will wake you up. The dog will notice you are awake and go into its usual frenzy and will make it impossible for any of you to fall back asleep. \nCrying baby. Barking dog. Sleep deprived. Thats your future if you dont do anything. \n\nYTA",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "This should be the top comment. The way the dog is acting it obviously needs a long walk first thing in the morning. OP needs to get over himself.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1501,
          "content": "Seriously. If you wake a sleeping newborn over this nonsense she's going to be furious, esp after a night of no sleep.",
          "id": 125,
          "comments": [
            {
              "score": 953,
              "content": "My first thought. That man would be gone if I were about to have a newborn. He has trained his dog to be a baby waking machine. (And no OP, the dog doesn't \"just do this\", you have habituated/trained him to do this by the way you interact with him. Anyone who has trained dogs - or babies/toddlers/kids, it's all the same tactics - knows that you've accidentally trained this animal to be unbearable. And your would retrain him if you weren't such an inconsiderate Ahole)",
              "id": 126,
              "comments": [
                {
                  "score": 527,
                  "content": "The proof in these wise words is the corgi doesn't act like a tornado when the fiancee Wales up.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Exactly. That dogs knows that when dad is around there are no rules. That’s the environment he’s fostered",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 227,
                  "content": "He’s trained the dog to be an outlet for his ADHD. He has to be loud for it.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 903,
          "content": "Yeah, my dog is also very much my partner in crime and used to getting up early (4:30 during the week, 5:30 weekends.)  \n\nGuess what I do if I have someone staying over? I take my dog for a fucking walk. Maybe we get donuts to bring back. Or get coffee. Maybe we just go for a really long walk. But the point is just that neither of us is banging around the house making noise.\n\nIt's not hard to continue bonding with your dog early in the mornings and also not disturb the entire house.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 762,
          "content": "This is my immediate thought. WTF are you going to do once your child is here? Continue this BS nonsense?? FFS. Figure something else out, NOW. Teach your dog to be respectful of others - of yourself, of your pregnant fiance, of your child-on-the-way, ASAP. Because when you have a newborn, who's still asleep, and who the stupid fucking DOG is waking up, just because it wants to play?? Yeah. That's not going to fly. \n\nYes, YTA. And so is your dog.",
          "id": 131,
          "comments": [
            {
              "score": 376,
              "content": "I don't blame the dog. It's not puppy's fault that they live with an asshole.\n\nThe dog will also be just as happy with proper training and exercise - maybe happier because then the other adult in the household might like it better.",
              "id": 132,
              "comments": [
                {
                  "score": 306,
                  "content": "Yeah.  OP is the kind of dog owner who sounds like they’ve done 0 training or behavioral development because “it’s just my style of interaction.”  Bro’s dog needs to be taught to relax and get more exercise, for everyone’s sake.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "What is this new trend of grownass people going \"I have ADHD so I can be a little loud and obnoxious\". Pop a pill or meditate or do whatever your therapist tells you, ADHD in an adult is not \"well what can you do, that's how I'm built\" situation. Neither is any other mental health issue by the way, you're responsible for your own actions.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 499,
          "content": "People that refuse to train their dogs drive me nuts. It is possible to teach them commands to chill out. He needs to teach the dog to chill and then take it on a walk or to the park and let it run around there.",
          "id": 135,
          "comments": [
            {
              "score": 404,
              "content": "Worse yet, people like OP who train their dogs to have bad behavior. The dog acts like this because it has been trained to expect this behavior every morning",
              "id": 136,
              "comments": [
                {
                  "score": 20,
                  "content": "I am genuinely concerned for the newborn baby’s safety around this dog. He’s going to be poorly behaved, loud, jealous. This is the type of dog who Jumps up on people relentlessly, scratching them with their claws, and the owner just laughs and shouts “he’s friendly!”",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "This. \n\nI stopped going to a friends house completely because of her large, untrained dog. She claimed she “tried everything” and decided it was easier to let the dog run everywhere and constantly and unrelentlessly jump all over everyone. A 70 pound dog. No thanks",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "He's basically training the dog to act like this - the dog freaks out and he rewards her with lots of attention and pets.  He's giving a ton of positive enforcement for bad behavior.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 442,
          "content": "The way OP is writing this, it sounds like his fiance got herself pregnant somehow and OP just happends to live in the appartement. \n\nLet me think, do you have to change your routines when becoming a parent? YES YOU DO OP!!",
          "id": 140,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 219,
          "content": "This is part of the reason I find crate training so important. My dogs love their zoomies in the morning but I’m a super light sleeper. Originally this meant every time I opened my eyes the dogs would get up, walk around the bed and stare at me or try and nuzzle my face up. On the flip side though, if they’re in the crate then they know it’s time for sleep until the door gets opened in the morning. Pets take their cues from their owners and it doesn’t take much effort at all to train them when it is and isn’t appropriate to play. Especially at 2 years old.",
          "id": 141,
          "comments": [
            {
              "score": 98,
              "content": "I believe in crate training too. All of my dogs have been well behaved because they were trained.\n\nI don't know how someone who can't teach a dog proper behavior thinks that they'll be a proper parent",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The thing is, the dog knows when it's not an appropriate time to play. Because when fiancé gets out of bed, the dog stays quiet and relaxed. He is 100% causing the dog to freak out as a morning routine.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "I was a little worried about the comments section when I saw dog + ADHD, but glad to see that people are seeing through OP’s bs. OP talk about his fiancée’s pregnancy as if it were *her* problem and just an annoyance to him. He’s not planning on changing at all. when the baby comes. I hope she has the sense not to come back.",
          "id": 144,
          "comments": [
            {
              "score": 27,
              "content": "Yeah, I’ve got a dog and ADHD. That’s not the problem. As you ID’d, OP is the problem.\n\nThe fact that he’s willing to let his dog wake his wife up just BLOWS MY MIND. Walk your damn dog, asshole.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Those of us with ADHD have extra low tolerance for people using theirs as a BS excuse for doing obnoxious ish. \n\nWe have to fight for reasonable accommodations like being able to sit alone in a silent room for a test and then yahoos like this guy are like \"I dOn'T hAvE tO tRaIn My dOg oR Be CoNsIdErAtE bEcAuSe ADHD\". \n\nIt's like how someone w/a misbehaving pet in a service dog vest because they want to take their dog to a movie or whatever can ruin it for people with actual service dogs.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Just wait until the dog wakes up the baby",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Exactly- he sounds like he will care for his dog more than the baby so I hope she’s out looking for an apartment. YTA",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17871,
      "content": "YTA: You noise is literally causing your fiancé physical pain by triggering migraines! Get up and take your dog outside to play! And, TRAIN YOUR DOG before the baby is born! Pay for a professional trainer if needed! Do it NOW!!!",
      "id": 149,
      "comments": [
        {
          "score": 4718,
          "content": "Exactly — this dog needs to be trained! When I read this all I could think was good lord this is a poorly trained dog. I’d be so pissed if my partner’s dog acted like this.",
          "id": 150,
          "comments": [
            {
              "score": 3461,
              "content": "nono, it is a trained dog. He just trained him to be absolutely awful.\n\nBy getting up and instantly hyping the dog and being loud he trained his dog to do the same, and the dog gets rewarded by more hype and noise.",
              "id": 151,
              "comments": [
                {
                  "score": 1259,
                  "content": "Yeah, a cycle of manic energy continually feeding itself.  If I was OP’s fiancé, I’d have snapped a looooong time ago.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 617,
                      "content": "Snapped and LEFT long before the “fiancé” was even a question — I can only imagine what other things he puts “out of sight out of mind”. I have ADHD too, but since I’m living with somebody I listen when he says something I do is too loud and monitor how loud I am whenever I do it again, and vice versa.\n\nYTA OP, learn some respect for the person you apparently want to spend the rest of your life with AND the child that is growing inside of her.",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Me too. I wouldn't even have to be pregnant or have migraines. My sensory issues and general hate of mornings would've had me freaking out long ago over this kind of thing. \n\nAnd I have ADHD too so while I get the \"out of sight, out of mind\" thing, that's not an excuse. If OP has trouble remembering not to be an AH, he has to change the situation that is causing it so that he doesn't even have to try to remember. Like if he quietly took the dog outside to a park or something before getting all loud, it solves the problem entirely. That's how you work around terrible memory in ADHD. You have to figure out how to make your own accommodations sometimes.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "All very true. And I'll add that he needs to start with a sincere heartfelt apology",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "And when I have a migraine, sound is painful.  I deal with bad ones by being in a silent and dark room.",
          "id": 156,
          "comments": [
            {
              "score": 21,
              "content": "Oh, and, yes, most definitely YTA.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "OP, also attend the classes so maybe you'll learn too!!",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10852,
      "content": "Nobody has even addressed how incredibly rude this is not only to the gf, but also to his neighbors?!?!",
      "id": 159,
      "comments": [
        {
          "score": 2634,
          "content": "Right god forbid they live above someone! I would be pitching a fit.  OP sucks he’s definitely the AH.",
          "id": 160,
          "comments": [
            {
              "score": 224,
              "content": "Exactly what I was thinking. He says the \"whole apartment shakes.\" I can't imagine how awful it must be for his neighbors as well. I can't fathom being this inconsiderate of others. Fucking wild.",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1633,
          "content": "If he can tell he’s “loud asf” and it’s an old building than OPs a migraine for the entire building. Real big I don’t care about anyone else’s feelings energy from this guy. I’m surprised the fiancé would want to raise a kid with him…",
          "id": 162,
          "comments": [
            {
              "score": 449,
              "content": "The pregnancy miiiight not have been intentional.",
              "id": 163,
              "comments": [
                {
                  "score": 242,
                  "content": "And she'll probably reconsider having this so called partner for co-parenting the baby she's forming inside while dealing with migraine AND his rudeness on top",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "And I bet the complete lack of respect for her is recent or more blatant now that he feels like she's trapped. A partner who lacks empathy, does things like this to exert power over you, and meets any attempt to hold him accountable with contempt and anger is not only incompatible with healthy relationships, but often leads to abuse. Hell, this could very well be an abusive tactic already. Thinking a reasonable boundary of someone you claim to love is an act of control you're entitled to steamroll is a big red flag. There's not really a logical explanation for it aside from intentionally making her miserable because he can.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Abuse does tend to ramp up during pregnancy (along with other events like moving in together, getting engaged and getting married). This isn't ADHD- this is abuse.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This guy sounds like the type to forget a condom and then say \"whoops, I have ADHD!\"",
                  "id": 167,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "And in the early hours too! I’m a late sleeper and I’d be PISSSED if I had a neighbor who let his dog go batshit every single morning on the other side of the wall, shaking the entire apartment.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 518,
          "content": "THANK YOU, this is legit all I could think about reading this. “The whole apartment shakes,” omg OP, what a nightmare it must be to be around you, live near you, have an apartment in your general proximity. YTA x 100.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "For real, I live in an old ass building and I have an average sized cat (about 10lbs) that does periodic zoomies and I’m terrified that even she’s too loud for the neighbors. I’d be so fucking pissed if I was his neighbors and he had his dog acting like that",
          "id": 170,
          "comments": [
            {
              "score": 11,
              "content": "I was honestly so focused on the poorly trained dog and his insistence that he's not going to change how the household works or his dynamic with the dog to accommodate his pregnant girlfriend who he's giving migraines to that I forgot about the old ass apartment shaking. OP is just a massive AH all around.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "YES! Train your dogs people - especially when you live in an apartment. Why should all your neighbours pay for your choices? You´re making their lives misserable. OP and his dog is making all this noise at 5 AM, what the hell.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "As soon as I saw they live an apartment, all I could think was how much his neighbors hate them for all that racket at 5AM. If the building shakes from a corgi jumping then you know everyone in that building can hear the barking and singing.",
          "id": 173,
          "comments": [
            {
              "score": 20,
              "content": "Can you imagine. It’s 5am and suddenly the building is shaking, some damn dog is thudding and barrelling around everywhere whilst barking hysterically, and on top of it all, some self-obsessed loon is belting out off-key tunes to his manic corgi. I’d have made a noise complaint by now. Probably more than one.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "He must be the worst neighbour ever.\n\nI hope fiancée and is plottling with the neighbours on how to get OP out of the building.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "This.  The neighbours must be absolutely furious.  And where I’m from, this shit would absolutely get you evicted or the landlord would refuse to renew your contract. He’s putting his child’s home at risk by not training his dog properly.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9391,
      "content": ">Just because she's pregnant doesn't mean I have to change who I am or change how the household works or change my dynamic with my dog.\n\nYou are correct, her being pregnant does not mean you have to change anything about how your household works. Unless, of course, the two of you are starting a family, and you wish her to consider it her household too.   \n\n\nTake your dog out to go play somewhere else in the mornings. It'll be good for all three of you. On your way back, pick up something nice for your fiance. Just... do the minimum.  \n\n\nYTA.",
      "id": 177,
      "comments": [
        {
          "score": 1470,
          "content": "Yeah, are there just no dog parks near him? Even if there aren’t, is he just keeping the dog locked in the apartment? That honestly sounds cruel. What if the reason the dog is so energetic is that poor thing is bored and has nowhere to release all his energy?\n\nIf OP is so energetic at 5am as well, he could go on runs with the dog, and everyone would win. He’s a huge AH for not even considering anything other than “you have to put up with me being obnoxious, cause that’s just me, and I can’t do anything about it :3” No OP you absolutely can.\n\nYTA",
          "id": 178,
          "comments": [
            {
              "score": 1001,
              "content": "Also, OP's singing and generally being loud has trained the dog that this is what we do in the morning, encouraging doggo to react this way to OP waking up. OP needs to change the routine and I'm sure you're right and outside is the answer \n\nBoth my dogs know morning means getting into our bed and cuddling because that's what we do. I actually set the alarm early so we have cuddle time before I have to get ready for work on weekdays!\n\nYTA",
              "id": 179,
              "comments": [
                {
                  "score": 485,
                  "content": "Yeah, this is the wildest part to me! Doggo isn't \"just this way\" in the mornings, the dog has LEARNED to be this way in the morning, because OP REWARDS IT. One of the biggest challenges with high-drive herding breeds is teaching them to relax, and any dog trainer worth their salt would emphasize the importance of this skill to anyone with a corgi in an apartment. Yet somehow, this dog and owner are oblivious to the importance of being able to tell when it's quiet time, and that says a lot about OP's responsibility as a dog owner.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 49,
                      "content": "> this dog and owner are oblivious to the importance of being able to tell when it's quiet time\n\nNope, the dog knows. How can you tell? Because it stays quiet when fiancé leaves the bed. It only \"goes ballistic\" when it sees OP awake.\n\nJust OP who's oblivious- and even that's more selfishness imo.",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "It's not part of our morning routine, but I accidentally taught my dog to bother the older dogs when he wants outside. I got him as a puppy, and the other dogs in the house are a bunch of grumpy old people. So when he jumped around and acted like a puppy, they would go off barking their little fool heads off and I'd throw everybody outside in the backyard. \n\nI finally noticed recently that, if no one is paying attention to his other signals he wants outside, he'll walk up and paw one of the older dogs in the face to set them off, and then run to the back door.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 470,
          "content": "This mindset OP has would have me already considering the benefits of being a single mom tbh it’s hard enough to be a parent, even harder with a partner that doesn’t respect you and adds to the mental load.",
          "id": 183,
          "comments": [
            {
              "score": 84,
              "content": "By the way he acts, she's gonna be a single mom either way.\n\nRight now, her choice is single mom of 3 or single mom of one.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 321,
          "content": "As a mom, that particular statement really gets to me. When you bring a child into this world, it *does* require both parents to change things about who they are and the dynamics in their household. OP needs to grow tf up if they're going to be a parent.",
          "id": 185,
          "comments": [
            {
              "score": 52,
              "content": "I can’t believe this type of response isn’t higher up. What the f does OP mean, “just because she’s pregnant doesn’t mean I have to change who I am”. Umm… if he’s trying to actually be a father to this kid, then yes it absolutely does. What would he do if his fiancé said the same thing? “Just because I’m pregnant doesn’t mean I need to stop smoking/drinking/partying. I don’t need to change who I am”. Ludicrous. OP needs to get his head out of his ass. YTA",
              "id": 186,
              "comments": [
                {
                  "score": 21,
                  "content": "... And just the basic thing of giving the slightest consideration to the human being carrying his offspring??\n\nJesus.",
                  "id": 187,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "True!\n\nIf OP  doesn't Shape Up and own this,  he might expect that 6 hours to turn into 6 days... into 6 weeks... into 6 months ... and...",
          "id": 188,
          "comments": [
            {
              "score": 19,
              "content": "I suspect it'll be 6 decades before he even hears from her again. OP was a MAJOR AH for telling her \"to get over herself\" when she's been struggling for weeks at this point. Pregnant and a migraine and he thinks it's okay to tell STILL tell her to get over herself?! Dude is only most likely never going to see his kid except on weekends and that's if the stress already hasn't done major damage to the fetus.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Exactly. When I read that I was like \"bruh, that's exactly the opposite of what having a baby means\"",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9053,
      "content": " \"Just because she's pregnant doesn't mean I have to change who I am or **change how the household works or change my dynamic with my dog.**\"\n\nYes, it does.  \n\nYTA",
      "id": 191,
      "comments": [
        {
          "score": 2209,
          "content": "Yeah OP is going to be in for a world of anger when this routine wakes the baby every morning right after she gets them to sleep.  When she leaves in the morning to go nap at her mother's and leaves him the screaming baby and the out of control dog, he'll be posting again.",
          "id": 192,
          "comments": [
            {
              "score": 1245,
              "content": "Doubtful. I have a feeling that it will be just the dog and his child support order keeping him company in the future. The only individual who’s noise his fiancée is required to put up with is the one who she’s literally expelled from her body.",
              "id": 193,
              "comments": [
                {
                  "score": 269,
                  "content": "I can definitely see it happening. I can't imagine he's going to want to help with the baby any.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Like OP said, \"out of sight, out of mind.\" 🙄",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I wouldn't trust him to if he can't even just be quiet for a little while in the morning!",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 270,
              "content": "Sounds like she already bounced",
              "id": 197,
              "comments": [
                {
                  "score": 215,
                  "content": "Yeah that was my thought too. Because even if OP isn’t, she is surely thinking about how impossible a sleep schedule with an infant will be if there are no changes.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 119,
                      "content": "If it’s this bad when she’s pregnant, they’re in for a world of hurt with a new baby.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 462,
          "content": "This was definitely the best part of the post 😂 does he think once she stops being pregnant, life will go back to normal or something?? Pregnancy may be temporary, but this is actually the beginning of a huge & permanent change for both your household dynamic and your relationship with your dog. Start training your dog, and yourself, ASAP. Good luck OP.",
          "id": 200,
          "comments": [
            {
              "score": 65,
              "content": "it will go back to normal for him, because i can already tell he's going to be a fucking deadbeat and not give a single fuck about his child",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Right? That part was hilarious.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "ESPECIALLY when the baby finally arrives. like wtf is this dude on?? literally everything will change. he has no choice.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This man sucks. I have ADHD and if I used it as an excuse to mistreat my partner I HOPE they would leave me. It's a bullshit reason to not consider the feelings of someone you love (ESPECIALLY if you have put no thought into what this will be like for YOUR ACTUAL BABY)",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "It shouldn’t even require her being pregnant. This is what living with other people means. What I can’t get over is how his wife has worked to find solutions and he’s not looked for a single one himself, only sabotaged her solutions.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6038,
      "content": "YTA. Both you and the dog are in need of behavioral training.",
      "id": 206,
      "comments": [
        {
          "score": 893,
          "content": "😂 \"you and the dog\" is killin me",
          "id": 207,
          "comments": [
            {
              "score": 145,
              "content": "I had a dog trainer relative who always said her job was training the humans first.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Well you can’t train a dog if the owner reinforces negative behaviour. Both needs to be trained. In this case, owner needs to be whipped.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I trust the dog will get it down sooner than the OP.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Oh yes. The human is almost always far more in need of rehabilitation than the dog.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "YTA. Having ADHD won't let you slip out of your  responsibilities once the baby comes, unless you want to be *that guy* who makes his wife do everything herself, sits and watches TV and fucks around with his poorly trained dog. \n\nI hope you understand that this cute little morning routine at least, you shouldn't want to... Reading your post, seems like you don't give a rat's ass. \n\nYou have to start thinking long term. Not mentioning everything that you're doing to your wife right now since people already have worded it better than I can. \n\nYTA. Do better or you'll be a horrible father and husband.",
          "id": 212,
          "comments": [
            {
              "score": 25,
              "content": "I’m still struggling to understand how ADHD is at all relevant here, anyway. I’m in the process of being evaluated for ADHD, and I don’t purposefully rile up my pets, sing loudly at 5am, forget my husband exists when he leaves the room, neglect to be considerate of my neighbours, or tell pregnant women with migraines to piss off.",
              "id": 213,
              "comments": [
                {
                  "score": 29,
                  "content": "He's using his diagnosis to excuse his shitty personality.",
                  "id": 214,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "My god, yes. I also have a 2 year old corgi. If he was exhibiting this behavior, I would do some serious separation anxiety training and “settle” training.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3856,
      "content": "YTA - your pregnant/migraine-prone fiancée is trying her hardest to find some quiet time for herself, but you can’t bother to change up your own routine or your morning routine with your dog?\n\nGo outside and take the dog on a walk. Go into the bathroom and close the door while your dog has morning jumps. Do something different than what you are doing so you can show your preggo fiancée that you are at least trying to make some changes.\n\n>I’ve tried laying in bed for awhile so she can relax but I get stir crazy and I also don’t feel like I should have to stay in bed so she can be alone when I live here too. \n\nI encourage you to re-read that comment…a whole lot of me, me, me.",
      "id": 216,
      "comments": [
        {
          "score": 1392,
          "content": "I feel for his fiance. He is not ready or able to raise a kid",
          "id": 217,
          "comments": [
            {
              "score": 696,
              "content": "He acts like he's still a kid himself. I know having ADD/ADHD doesn't help.   But sometimes you have to understand your weak points and adjust your behavior to fit into society. I know this because I have it too",
              "id": 218,
              "comments": [
                {
                  "score": 504,
                  "content": "ADHD is an excuse. I have ADHD, and I physically remove myself from spaces to stop myself from antagonizing my partner and give him a break. I go have coffee with friends on the weekend or grab a drink or dinner with them during the week. Dude's just an asshole.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 68,
                      "content": "I know a few people with ADHD, and two of them are like OP. They act like assholes and then claim it’s the ADHD. Like no? The rest of the people I know aren’t like that, it’s not a universal thing for them. Both those two people I know are giant pricks, they’ve done some horrible shit and then complained that I didn’t like this mistreatment. I’m autistic so what I do when I’m near meltdown time or I want to just hyper focus on something, I stay in my house. I don’t mess anyone else’s shit up, my behaviours aren’t always conducive to socialising. \n\nOP clearly knows this is some irritating shit, he admits how bad it is, but he feels like because he’s got ADHD, that should explain it. No sir. He needs to go out of the friggin house if he wants a dance party with his dog. \n\nI’m saying this as a cat owner who regularly has a dance party with them, with full songs and zoomies on my cat’s part. But I live ALONE. Fuuuuck",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Exactly. I have ADHD also but it doesn’t give anyone an excuse to be an asshole. It’s not a “get out of jail free” card. You have to know what you struggle with and find ways to work with it, like you say you do by physically removing yourself from spaces. That’s what OP needs to do—physically remove himself and the dog from the apartment for a little while. And work on training the dog to not be so wild when he gets up.",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "ADHD is a reason this can happen... And he knows it and uses it as an excuse instead of ensuring he is aware and accomodations are put in place to ensure he's respectful",
                      "id": 222,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "ADHD is too often an excuse.  My spouse has ADHD, and is the most considerate human being on the planet.  There are medications and coping mechanisms to help.  This guy is just selfish and using ADHD as an excuse for his bad behavior n",
                  "id": 223,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "I have AHDD, autism, PTSD, and many more and I can already tell you being more considerate than OP is a very low bar to leap over.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "He can’t even train a dog to be someone anybody would want to be around. Can’t imagine how he believe he can be a father.",
              "id": 225,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 48,
          "content": "\"I also don't feel like I should've to stay in bed so she can be alone when I live here too.\"\n\nYeah well I don't think your pregnant wife should have to wake up early to avoid you and your dog when she lives there too.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "He actually did change up his routine though, he bow wakes up even earlier to steal the little time she’s managed to carve out for herself. I’m shocked he didn’t ask her to stay in bed until he’s ready to wake up.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Also, this thing where the pregnant lady is giving up sleep just so she can get a minute of quiet.... This is awful.\nI'm currently pregnant and I'll tell you, pregnancy is exhausting and sleep is often hard to come by, she should not be forced to wake up extra early to get her quiet. Dude needs to let his fiance sleep.\n\nEdited to add: give her ample opportunities for alone time without having to give up sleep. Just let her say I need quiet and then get the fuck out of the way.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Totally, it's like he was raised with his ADHD being catered to all his life. And now it's his crutch and justification for flat-out bad behavior.\n\nRegardless of ADHD, the man's an AH.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2994,
      "content": "YTA. You're using ADHD as an excuse to keep being an AH to your pregnant fiance who you know is struggling. And you need to train your dog before the baby comes.",
      "id": 230,
      "comments": [
        {
          "score": 742,
          "content": "I hate when people use mental health as an excuse. Like yes it's an explanation but not a reason to continue being a dick.",
          "id": 231,
          "comments": [
            {
              "score": 334,
              "content": "Seriously. I have adhd, and I get the whole “if you aren’t currently telling me about x, it doesn’t exist anymore” thing. BUT that’s absolutely not an excuse to cause your partner physical pain by being annoying!! You can use adhd as an explanation, but not an excuse. Massive massive YTA and don’t be surprised when your fiancée wants to move out.",
              "id": 232,
              "comments": [
                {
                  "score": 49,
                  "content": "Exactly since it doesn't sound like the OP is trying to change anything. Also being ADHD isnt an excuse to lack compassion for his wife's quiet time. The wife is already dealing with so much stress being pregnant and you add the noise on top of it thats causing migranes????? \n\nHave some compassion OP",
                  "id": 233,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Also ADHD doesn’t make you lack in common fucking sense. \n\nI might forget something if a reminder isn’t right in front of me, like a load of laundry in the washer or a doctor’s appointment I didn’t put on my calendar, but I still possess basic cognitive ability. I know that riling up a dog to bark and run around at the crack of dawn while I sing at the top of my lungs is going to irritate the fuck not only out of my husband, but all of my neighbours as well.\n\nI don’t need repeated reminders to not create a bunch of racket at 5 o’clock in the morning. I’m forgetful, not completely oblivious to the existence of other people.",
                  "id": 234,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "[deleted]",
              "id": 235,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2668,
      "content": "Just because she's pregnant doesn't mean I have to change who I am or change how the household works.\n\nEr, hate to break it to you mate but that's exactly what becoming a parent means.",
      "id": 236,
      "comments": [
        {
          "score": 560,
          "content": "Seriously. Also betting OP knows absolutely nothing about children or being a parent because if this is what he’s expecting (no change) he’s fucked.\n\nOP, YTA. Train the dog, take them out first thing in the morning so your poor fiancée can get some rest, and sign up for a parenting class at the minimum.",
          "id": 237,
          "comments": [
            {
              "score": 91,
              "content": "I would be EXTREMELY worried about the dog accidentally hurting the baby too. Especially one that's been that poorly trained. I love dogs, more than most people even on a good day but they really don't understand their own strength. And now add a fragile newborn into the mix? The dog's lack of control could very well lead to OP in jail for negligence or the dog being put down if he somehow got custody of the kid. OP's most likely ex gf did the right thing. OP is not even remotely fit to be a parent.",
              "id": 238,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "Also doesn't bode well how he distances himself from the baby with that language. \"Just because SHE'S pregnant...\" like it's just her thing? Like his girlfriend being pregnant doesn't have any larger implications for him? I think he's in for a rude awakening once the baby is born.",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Just because her body is under going massive, monumental changes as part of a decision we made as partners you’re saying I have change one single routine of mine that already annoyed her?",
          "id": 240,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}