{
  "post content": "Hi,\n\nSo I run a youth group and myself and the other youth leaders were talking about dressing as the entire scooby doo gang for halloween. I was gonna be Scooby, and get a Scooby Doo onesie from Amazon. It's the whole body costume with ears etc., and a hole for a face.\n\nI was telling a group of friends what we were doing, and how I was going to then paint my face brown with some of the Scooby freckles etc. One in particular suddenly had a face was like I'd just slapped him. \"You can't do that!\" he said. \"That's blackface!\"\n\nTurns out he, and several others at the table, think that me, as a white guy, painting my face Scooby-Doo brown, would be blackface. To me I hadn't even considered that there would be any racial connotations whatsoever - it's a dog, not a person of another race - and that I shouldn't do it. Not sure whether it matters, but everyone saying it would be wrong was white, the one black guy at the table had no problem with it at all.\n\nTo me, this seems like an incredibly unhelpful level of insensitivity which is only aimed at getting outraged wherever possible, not at actual injustice.\n\nSo, if I go ahead with dressing as Scoob for Halloween, face painted brown (AS A DOG) - WIBTA?\n\nEdit: Forgot to mention, one guy said \"Even if it's not wrong, if you took off the costume you'd just be left with a brown face and that'd be really bad\" which I guess is true that I'd have a brown face but I don't think brown face instantly equals racism so I think unless I run for prime minister of Canada in 40 years time and the photos resurface I should be good?\n\nEdit 2: I'm gonna scooby dooby do it",
  "id": 1,
  "comments": [
    {
      "score": 4713,
      "content": "Your friends are idiots\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 1124,
          "content": "Amen brother",
          "id": 3,
          "comments": [
            {
              "score": 1715,
              "content": "How do I ask this politely ...?\n\nAre your friends white? \n\nWhite people seem to be complaining about racist face paint quite a bit ... while black people are worried about cops murdering us in our homes... There’s not a black person in America worried about your damn face paint. \n\nI’m not saying the new awareness and focus on racism isn’t appreciated, it is. I’m saying it’s focused on things that don’t affect the daily lives of minorities. It also pisses off non racist white people while providing zero benefit.",
              "id": 4,
              "comments": [
                {
                  "score": 161,
                  "content": "This comment is everything",
                  "id": 5,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Honestly, this comes across as a shitpost.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 107,
                  "content": "As a Black Person I can complain and be concerned about many things especially dehumanizing Black and Brown people. As far as the poster if he’s wearing the dog ears for the entire time and collar it’s obvious he’s playing a dog. If it’s just coloring his face brown and out of context photo might look like he’s mocking minorities. If he wants to do it that’s on him.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Facts. \n\nI’m just unimpressed by the white people who don’t hire black people at their companies but have loud opinions on the evils of blackface.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "that's because scooby doo is not black people brown, he's middle eastern people brown.\n\n&#x200B;\n\n/s",
                  "id": 9,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Thank you for the insight u/CrackaAssCracka.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I think white people are so afraid of being called racist that they actually become racist by being so overly-sensitive about the wrong issues. I’m a white female. If I was inadvertently racist it would mortify me and I can imagine that making someone hyper-vigilant to the point of being ridiculous. Dressing up as Scooby Doo - which is a fictional brown dog, FFS, is very different from dressing up as an oppressed black person, real-life person of colour or minority group.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "IDK why you asked you and I know they're white.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "This is very well said.  And very sad.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I like to believe that these people are just misguided. They want to help, but they don’t know what issues black communities face. The cynic in me thinks it’s just an easy way to feel superior.\n\nIt would be more helpful to ask why our schools are still segregated. Or why inner city schools arrest students for things we handle with suspensions in suburban schools. \n\nFace paint is just not a significant part of the issues we face. The focus on blackface makes no sense at all.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Just fucking tell them that they just equated black/brown people with a dog. Now whose fucking racist.\n\nNTA",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 268,
          "content": "I think this needs to be a choice.\n\n“You’re not the asshole, but your friends are unbelievably stupid.”",
          "id": 16,
          "comments": [
            {
              "score": 103,
              "content": "YFAUS",
              "id": 17,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I'll sign that petition.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "Have an upvote for saying what I was thinking!  Sheesh....",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "And therefore, OP is NTA!  (just has idiot friends).",
          "id": 20,
          "comments": [
            {
              "score": 20,
              "content": "OP is TA for having idiot friends.",
              "id": 21,
              "comments": [
                {
                  "score": 13,
                  "content": "I mean, I have idiot friends, too, but it's more because it's fun to watch the absolute shit storms that occur in their wake.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "They're idiots, but at the same time, for the sake of your reputation, don't do it.  It's just not worth the trouble. Outside of your friend group are many more idiots who will wrongly judge you, or kids who will say unkind things behind your back to be 'virtuous'. This isn't a hill worth dying on.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agree and also much of Reddit is. \nNTA",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Lol exactly what I was gonna say he is dressing as a dog not a person",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I mean they kinda have a point so...",
          "id": 26,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Hey, just FYI as the current top comment, if you dont edit in a judgment before 18 hours you don't get a point for this. The bot gets confused. Wouldn't want you to not get a point over something silly like that!",
          "id": 27,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Get new friends.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2016,
      "content": "NTA. I'm brown and honestly I think your friends are absolutely overreacting. This isn't like the Justin Trudeau thing obviously. One thing that you may want to keep in mind as your friends have pointed out is to make sure you retain elements of Scooby even if you take off your costume whether it's a dog nose or floppy dog ears because it can always be misconstrued differently (whatever your intentions).",
      "id": 29,
      "comments": [
        {
          "score": 437,
          "content": "Exactly. If the scooby costume is too hot then just wash your face paint off too. NTA.",
          "id": 30,
          "comments": [
            {
              "score": 195,
              "content": "Also OP, don't let [https://www.reddit.com/r/WatchPeopleDieInside/comments/dlox7q/halloween\\_gone\\_wrong/](https://www.reddit.com/r/WatchPeopleDieInside/comments/dlox7q/halloween_gone_wrong/) this be you.",
              "id": 31,
              "comments": [
                {
                  "score": 40,
                  "content": "[deleted]",
                  "id": 32,
                  "comments": [
                    {
                      "score": 30,
                      "content": "It's also really good for irritating your skin. Most face paints will include instructions on how to remove safely if you need more than water.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Shaving cream, gel to foam one. That's what we were taught when learning special effects and body painting",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I mean those people are idiots too ... Shit washes off with baby oil",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "> If the scooby costume is too hot\n\nStupid sexy scooby",
              "id": 36,
              "comments": [
                {
                  "score": 95,
                  "content": "“Reels like I’m wearing rothing at all!”",
                  "id": 37,
                  "comments": [
                    {
                      "score": 23,
                      "content": "...rothing at all...\n    ...rothing at all...",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "\"Rhaggy, rome rake a raste rof rhy Rooby Racks\"",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "This exact scenario was brought up a couple of weeks ago in a thread about blackface.  Dude dressed up as scooby doo, proceeded to dance his ass off, lose the Scooby costume, and look in the mirror to discover he had become the accidental poster boy for blackface.    \n\nAmazingly enough nobody flipped out on him.  Worst case scenario keep the damned ears on or something.  I have no idea if this is just a regurgitated shit-post but anyone who *actually* thinks dressing up as a cartoon great dane is racist should probably rethink their position.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "As another brown person\n\nThe Trudeau thing was equally stupid",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1548,
      "content": "NAH\n\nBut please don't just \"brown up\" and walk around without the rest of your costume. It's not always your intent that matters but what other people will take from it.\n\nGo the whole Hog with the face paint and have your face painted like a dog, instead of just simply brown. Leave the blue collar on at all times, or get that painted on too!\n\nYour friends aren't arseholes either but they are just trying to avoid a situation where someone takes offence and the whole group of you get labelled racists over a simple misunderstanding.",
      "id": 42,
      "comments": [
        {
          "score": 692,
          "content": "\\^\\^\\^ Your friends are right to give you some advice on the optics. NAH\n\nHonestly, painting your face is hella uncomfortable--super itchy and stiff. I would, for the sake of simplicity and comfort, just paint on the freckles and whiskers without doing the whole face. \n\nOr like they said above, do a sick full paint/make-up job. Don't just slather on brown without any texture/details.",
          "id": 43,
          "comments": [
            {
              "score": 281,
              "content": "Yeah NAH, I feel like everyone voting NTA is forgetting that 'it was a dog' ain't gonna do shit in 20 years when someone manages to dig up a photo of you. In a bizarre coincidence, I've seen a (lackluster) Scooby Doo costume implemented with facepaint, and it just looked like intentional brownface.",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 160,
              "content": "It's not just uncomfortable, it's *hideous*. Most people are not talented enough with makeup and doing skin art to paint their face like an animal and have it look good. Animals are furry. Brown paint isn't furry, it's flat. Painting your face brown is never going to make you look more like a dog. \n\nHave you ever once looked at someone wearing a brown painted face and thought it looked good???\n\nOP is better off just drawing a cute dog nose and be done with it.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "Love the idea of just doing the features and not the background colour!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "I agree with this NAH . Your friends are trying to save you from getting cancelled in 10 years when the photos come up with no context.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I agree, either go for nose and whiskers or go all out and do the full make-up. Personally, I would just do the nose and whiskers so cleaning up is a breeze.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Something like [this](https://i.imgur.com/yQECQkv.jpg) would be good with the correct coloring. Adding black outlines will help give it a cartoony look too. u/Jopkins",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Also, can we take into account that this guy runs a youth group, he isn’t just going to a random Halloween party? I don’t know how old the kids are but I think we can assume both that they are looking to OP for some sort of leadership and, being younger, they might not appreciate the same nuance we are arguing here.",
          "id": 50,
          "comments": [
            {
              "score": 13,
              "content": "That is an incredibly good point and one I completely missed.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I can see it brown face and a collar  mabey not the best thing to do \nmabey just paint a dog's nose on ur face or not take of the costume off",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Exactly! If there’s a possibility that you would offend someone, don’t do it. It’s a sensitive topic for rightful reasons, and his friends are right to tell him the possible situation he’ll face.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 794,
      "content": "Would you be engaging in blackface? No. \n\nIs having your face covered in brown facepaint, inevitably in photos, a look that might damage you in the future? Yes.\n\nI've seen a bad Scooby Doo costume that, until you 'got it', looked just like Trudeau-esque brownface.\n\nI think the question that you should ask isn't what would be technically correct, but rather what the personal outcomes for you, in the long run, might be. For that reason, roughly NAH.",
      "id": 54,
      "comments": [
        {
          "score": 235,
          "content": "The best response so far. A dog face is clearly not black face. But it can end up looking dangerously close and does OP wanna be associated with something as awful as blackface? The friends were just offering insight that may not have been considered. OP is potentially setting himself up for a world of hurt over a costume that can be just as easily achieved with a dog nose and freckles.",
          "id": 55,
          "comments": [
            {
              "score": 118,
              "content": "Exactly. This is almost like a watered down version of the Buddhist swastika discussion.\n\nAs an aside, there's also something unintentionally hilarious about a load of people motivating OP to wear the face paint:\n\n'We think that this is a matter of free expression in an age of over-sensitivity, and to prove that, OP is gonna have to die on that hill, dressed as a cartoon dog. We'll wait here.'\n\nLike good luck dude, but personally I'd switch with Shaggy.",
              "id": 56,
              "comments": [
                {
                  "score": 7,
                  "content": "Better OP than me. Someone has to die on that hill and if rather it not me so.....",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Exactly. I was looking for this response. Bad in theory? Nope. Could still come across wrong in the wrong context and then you’re in the impending Buzzfeed  article coming out on who was stupid enough to do black face for Halloween. Intention won’t help you if someone posts a compromising photo of you out of costume with your face painted. It’s not necessary for your costume, CYA and leave it be. Paint a dog mouth and nose if you really feel you need to. Skip the brown altogether and save the potential headache.",
              "id": 58,
              "comments": [
                {
                  "score": 5,
                  "content": "yeah, especially when you're the representative of a youth group. You never know how a parent or student could react!",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "In terms of sheer comfort, the dog nose and freckles sounds ideal.\n\nUnless he's a skilled artist and can do it *right*, and is willing to deal with the general annoyance of full face-paint. \n\nHonestly, if you're not competing on a contest -- why bother with the full face paint anyways?",
              "id": 60,
              "comments": [
                {
                  "score": 6,
                  "content": "Otherwise it just feels like an excuse for OP to paint his face brown....",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "It won't look good with face paint either. Just paint a dog nose and some black dots for whiskers around the mouth.",
          "id": 62,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 90,
          "content": "Exactly this. Also painting your face is probably completely unnecessary. No one's gonna be like \"who are you supposed to be\" in a Scooby Doo onsie unless literally every inch of your skin is the same color as Scooby Doo.  \n\nThe face paint sounds like a pain to put on, a totally unnecessary component of the costume AND possibly damaging out of context. Why bother with it at all?",
          "id": 63,
          "comments": [
            {
              "score": 34,
              "content": "Yeah, this is really just a weird hill to die on. You want to add more hassle to your costume while adding basically nothing to it and you're really adamant about wanting it for some reason. \n\nHonestly, I'm more leaning on don't do it, because it's just not gonna look good.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Best answer here. Like ... is it racist to wear a charcoal face mask? No. It is a bad idea to upload a picture of yourself in your pajamas with just that smeared all over you? Yes.",
          "id": 65,
          "comments": [
            {
              "score": 11,
              "content": "My gf made me do charcoal face masks with her. No big deal. Then she took a pic of me and put it on her snapchat story. I requested she take it down because I didn't want anyone thinking I was in blackface.",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This. NAH. You're not a bad person, and your instincts are right. But your friends are just looking out for you.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I definitely want to see an update on this one.",
          "id": 68,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 314,
      "content": "NTA, that's not blackface.",
      "id": 69,
      "comments": [
        {
          "score": 15,
          "content": "Probably still a best practice to just not darken your face as part of a costume.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Not intentionally",
          "id": 71,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 303,
      "content": "NTA\n\nIt’s. A. Dog.",
      "id": 72,
      "comments": [
        {
          "score": 4,
          "content": "NAH",
          "id": 73,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 287,
      "content": "NAH. There was a guy on here asking about dressing his little kid up in a bear costume and whether he should paint the kid’s face brown or not.\n\nEveryone told him to just draw a nose and some bear features on.\n\nMaybe to be better safe than sorry you could do your nose and maybe some spots? That way you’ll look like a dog with your costume on and not like a douche with it off.",
      "id": 74,
      "comments": [
        {
          "score": 150,
          "content": "That's the thing for me, I think animal face paint looks better when it's just the features anyways. I looked up pictures for that last thread and when people paint the whole face, it's messier and less obvious what you are. Features only avoids the issue and imo looks better 🤷🏾‍♀️",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I have used makeup and paints to make myself look like an animal for various costumes. Less is more. Hit the key features.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "If he wanted realism, he should just get a mask. No color of paint will give you the weird dimensions of Scooby's face.",
          "id": 77,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "[deleted]",
          "id": 78,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 247,
      "content": "YTA- your edits lead me to believe that your opinion has less to do with an accurate Scooby-Doo costume, and more to do with deciding what people should or shouldn't be offended by. People will get who you are without the face paint. You seem super extra interested in painting your face brown for some reason. Why? Just don't do it.",
      "id": 79,
      "comments": [
        {
          "score": 102,
          "content": "This. I might have been on board if painting your face was an important or major part of your costume, as it stands with the costume you described, painting you face does nothing to enhance your costume. So it seems you are just doing it to be TAH.",
          "id": 80,
          "comments": [
            {
              "score": 14,
              "content": "Yeah, I've seen exactly one time face paint with a costume was necessary and it was Darth Maul and she looked amazing.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "Get ready for 2000 posts on this sub of people trying stuff like this on some sort of technicality and half of reddit crying about SJW and how it is so unfair they have to put 4 seconds of thought into their costumes.",
          "id": 82,
          "comments": [
            {
              "score": 29,
              "content": "\"But if they're allowed to say it why aren't I?\"",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Get out of my head.",
              "id": 84,
              "comments": [
                {
                  "score": 4,
                  "content": "Great minds!",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "They even wrote a paper pertaining to blackface and how political correctness is over-used. OP is literally hoping to get called out so they can smugly say \"it's just a dog.\"",
          "id": 86,
          "comments": [
            {
              "score": 42,
              "content": "\"It's just a dog, kinda like your whole race.\"-OP",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 221,
      "content": "I mean, it’s not blackface, but they’re warning you of something that’s real. People do NOT take this sorta shit with any sense of humor, so that’s on you if/when someone gets super pissy over it on the night\n\nI’d say, makeup like that is HARD to do - if you’re not amazing at makeup and face painting, honestly, Scooby it without the face paint. You’ll most likely look back at pictures and think “man, my face looks like shit. Like literal shit - like I just plopped it in a pile of shit”. There’s a reason why face painters and makeup artists get paid to do it - it’s not as easy as you think. Just sayin!",
      "id": 88,
      "comments": [
        {
          "score": 112,
          "content": "That is sort of why I think the answer is YTA or at least NAH. Face paint is HARD,  rarely looks good unless you know what you are doing, and it messy and annoying to wear all night. This guy already has a full costume and he is insisting on painting his face, in my opinion, to prove a point. Just from his responses and general attitude, I feel as though he is trying to get off on some sort of technicality.  Why go to all the trouble to make your costume maybe 5% better? Why potentially ruin your night or someone else’s? I don’t think painting your face to be Scooby Doo is blackface but I also don’t think it is worth it and don’t think you would seriously consider it unless you are being contrary or naive.",
          "id": 89,
          "comments": [
            {
              "score": 98,
              "content": "I’d argue that by painting his face, he’s making his costume WORSE. Not because “blackface”, but because I am 99.9% sure his face paint is gonna look like shit.",
              "id": 90,
              "comments": [
                {
                  "score": 11,
                  "content": "Yes you are right- I stepped on my point there with my wording. I meant even if he did a great job, which is super unlikely, it wouldn’t add much to the costume anyway.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "[deleted]",
          "id": 92,
          "comments": [
            {
              "score": 110,
              "content": "Yeah I don't get why OP and so many of the people on the thread are desperate for him to 'brown up'.",
              "id": 93,
              "comments": [
                {
                  "score": 113,
                  "content": "[deleted]",
                  "id": 94,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Yeahhh he’s TA because he’s clearly trying to score some kind of point here, on a technicality. Oh well, karma will come back to bite him when his face is itchy and uncomfortable all night, he wakes up the next morning with brown makeup smeared all over his bed so it looks like a rabbit shit itself on his pillows, and he likely ends up with a stubborn, itchy rash from cheap makeup.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I did a Widowmaker cosplay a couple of months back, and I have no idea how people manage painted skin with her (though tbf blue probably looks better than the purple I used) cos I looked and felt awful.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Yeah exactly. One thing all these blackface photos that have been in the news have in common is that the people wearing blackface look both racist AND just terrible.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 122,
      "content": "YWBTA- even if this isn’t clear cut the same way dressing up and painting yourself brown like Shaft or whatever, you’re still skirting really close to the line, and I would question why it is so important for you to remotely go near the line when you could just as easily not- in fact, it takes less effort to not.\n\nAlso as your pal said the moment you take off the costume you are a dude in brown face. Other people aren’t psychic and are not required to wait for a white guy’s explanation that “hey I know it looked exactly like brown face but I totally have a reasonable explanation”.\n\nAlso, given your defensiveness on the issue, part of you doing this now would be influenced by a “I’ll show THEM” attitude, them being your friends and, frankly, any not-white person who might see you and need to roll the dice on assessing whether this was your way of doing a racism “but not teeeechnically”.\n\nI would encourage you instead to read up on blackface and brown face, and not by people who think it’s bunk. Knowledge and context is key.",
      "id": 98,
      "comments": [],
      "relation": "Attack"
    }
  ]
}