{
  "post content": "Lil bit of backstory: This friend of mine has been by my side for years on end. She took care of me when I was sick, was there with me when I was going through tough times and supported me whichever way she could.\n\nHowever, I’ve been noticing some “red flags lately. Idrk if they can be considered red flags or something but they’re just things that seem kinda off.\n\n1. She’s started making excuses and she’s trying to stay away from me. Now I know that she might want some personal space but I would invite her to play a game, she would say no, and she would be on 2 hours later playing with some other friends. This is starting to happen more often too.\n\n2. She’s kinda been ignoring me in class and irl generally, she tends to hang out with the other people in my friend group and i’m 78% sure she says bad things about me. Idk how to feel about this either because she’s still here for me and basically is the same when around me.\n\n3. She’s being quite an a/hole recently. She’s started dating someone and I fully support that but she’s starting to become a bit more mean. Our friendly banters started to hurt and she started “joking” around more. Honestly idk if she’s intending to hurt me or not.\n\nThere are other reasons but these are the main ones. I don’t really want to continue this friendship anymore and idk if everyone will hate me because I do have a bit of a bad rep.",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH. It sounds like she just needs some time for her. You need to let her have that.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH. I have experienced this. I was suggest trying to have a conversation with your friend first to see if you can find out the issue. Maybe your friend seems you too needy or is generally ready to move on. It really hurts but it can save you alot of grief to see where your friends head is. You may not get closure, especially if they just blow you off. If she does that, then you have your answer. Move on. You will grieve the friendship but its better than allowing yourself to wonder forever if you could have fixed it. Start investing in other friendships and activities. Gravitate toward what makes you happy to feel this void.",
      "id": 3,
      "comments": [
        {
          "score": 1,
          "content": "Hearing someone who has experienced the same thing really helps. I thought I was weird for thinking this, thanks!",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Nah. Just talk to her and tell her you can give her some space. Besides you never know what she's going through. She could be being verbally or physically abused by her bf",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "Yeah I guess so. I’ll try to talk to her.",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "I'd love to know how you got to the very specific \"78%\" certainty!",
              "id": 7,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH. People change and it's natural to drift. It doesn't mean she's purposefully trying to be TA. Give her space and give yourself space, it doesn't make either of you TA to do that.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "Thanks, this helped a lot!",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH.. you don’t need to cut ties with her in order to spend less time with her. Seems like you two are drifting apart. Just try to find some new hobbies or friends. I don’t think you need to do a dramatic confrontation or anything. But maybe if you keep yourself busy, she will want to hang out occasionally still, and you won’t feel like you are being ignored. Friendships sometimes go through periods of being close and being not so close. It can be normal. She may also just be maturing into a kind of mean person, so watch out for that.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "I’ll watch out. Thanks for the advice!",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLil bit of backstory: This friend of mine has been by my side for years on end. She took care of me when I was sick, was there with me when I was going through tough times and supported me whichever way she could.\n\nHowever, I’ve been noticing some “red flags lately. Idrk if they can be considered red flags or something but they’re just things that seem kinda off.\n\n1. She’s started making excuses and she’s trying to stay away from me. Now I know that she might want some personal space but I would invite her to play a game, she would say no, and she would be on 2 hours later playing with some other friends. This is starting to happen more often too.\n\n2. She’s kinda been ignoring me in class and irl generally, she tends to hang out with the other people in my friend group and i’m 78% sure she says bad things about me. Idk how to feel about this either because she’s still here for me and basically is the same when around me.\n\n3. She’s being quite an a/hole recently. She’s started dating someone and I fully support that but she’s starting to become a bit more mean. Our friendly banters started to hurt and she started “joking” around more. Honestly idk if she’s intending to hurt me or not.\n\nThere are other reasons but these are the main ones. I don’t really want to continue this friendship anymore and idk if everyone will hate me because I do have a bit of a bad rep.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH it sounds like you are doing your best to read the situation. it sounds like you can just stop putting in the effort to connect with her and things will naturally drift in the direction you both want the to.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. I don’t understand the people on here who are excusing her behavior. She’s being an asshole to you and it’s clearly affecting you to the point where you are considering cutting ties. There are ways to get space from someone without being a jerk.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH. I would suggest that you sit her down and have a serious conversation about your friendship. Hope everything works out!",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Thank you, but I don’t think I can. I’m not really the confrontational type and if I’m confronting someone I just listen to what they say and I assume the blame. I’m not saying she’s in the wrong here but I don’t think I have enough confidence to :p",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "It's ok. Do your best. I don't know how old you are but you can take her out for a bite to eat and talk about it there. I'm also non confrontational so I see where you are coming from.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}