{
  "post content": "My (25M) GF (24) had a double mastectomy 5 years ago; she had breast cancer, and thankfully made a full recovery. Unlike a lot of women, she didn't have any reconstructive surgery. This was before I met her. \n\nI'm a big anime nerd, and last weekend I invited her to a small anime con with me. She's seen a few episodes of my favorite shows, but she's not into anime; she does like cosplay, though, and she works seasonally as an SFX artist at a haunted house near us. So when I asked her to go to the con with me, she asked if she could cosplay, and I said sure. She got very excited and said I was going to love her costume, so I'll admit I thought she was going to do something sexy for me.\n\nWell, not exactly. The day of the convention comes, and she showed up at my house cosplaying Dabi from MHA- specifically a look he has later in the manga. It's a long white coat over white pants, no shirt. Her entire chest was exposed and she'd obviously spent hours applying burn makeup; she has short hair that she dyes constantly, this time she bleached it white and dyed a few red streaks. \n\nI wasn't expecting her to show up without a shirt. Her burn scar makeup only covered half her chest, so you could clearly see her mastectomy scar. It wasn't a verry attractive costume, especially since she'd gone all out with the scars and made them look raised and kind of realistic. \n\nWe went to the con, and while a lot of people came up to take photos with her, I noticed several others looking at her chest. That evening, she said I'd been quiet all day, and I honestly told her I was a little embarrassed that she was flaunting her mastectomy scar like that. She got mad and said she was making the best of her situation and said I was being insensitive, and she's been distant ever since. I'm starting to feel guilty. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 77908,
      "content": "Oh, how dare your GF not have a *pretty* little cosplay outfit. Obviously she has not gotten the message that her only worth is if she caters to the male gaze. (s)\n\nYeaaa. YTA",
      "id": 2,
      "comments": [
        {
          "score": 22775,
          "content": "“For me” being the key phrase here. Told me everything I needed to know about OP",
          "id": 3,
          "comments": [
            {
              "score": 19479,
              "content": "I was sold on OP being TA with \"she didn't get reconstructive surgery like a lot of women do.\".  I was fairly certain this post would be about boobies at that point.  He's into anime and wanted a sexy costume, then said out loud that she shouldn't show the scars from kicking cancers ass. I mean...holy.shit.",
              "id": 4,
              "comments": [
                {
                  "score": 11018,
                  "content": "Own. Your. Scars. OP doesn't deserve this woman. YTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5676,
                      "content": "Women like her are literally my heroes. She sounds awesome!",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1095,
                      "content": "I am sooo impressed with OP's gf!!!   She sounds awesome.  She needs someone better than this, some who is proud of her",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "YTA. I earned every scar that I have. I shed blood & tears for then. I have had multiple surgeries & have lots of scars. I also have scars from childhood abuse. My husband calls them my battle scars. He thinks they make me a bad ass. I created life with some & some saved my life. I’m turning 51 in June & he makes me feel beautiful. He thinks I’m amazing. I feel bad that you don’t feel the same way about you girlfriend. You don’t deserve her. Grow up.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "OP doesn't deserve *a* woman.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "I'm a burn survivor - and NO ONE tells me to hide my scars and stays in my life.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "“My GF spent a ton of time and effort on trying to engage in one of my hobbies, even though she’s not really into it, but I don’t like it because she didn’t do it in a sexy way.” Like good God man.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "When my dad had his liver transplant he used to boast about his scar. It looked like a Mercedes logo so he called it his designer scar. He would lift his t shirt to and show anyone. He was proud of it knowing it showed how his life was saved. \n\nEveryone needs to be more like this girl andy dad",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I've shaved half my head after having brain surgery because I love my scar. I have other scars too (bad car wreck) but its my favorite.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "As Illidan says “I am my scars!”  Yea he is fo sho YTA",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "This lady and her cosplay both sound rad as hell.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1547,
                  "content": "It was a combination of cos play in the title and reference to double mastectomy in the first line for me. As soon as oP thinks that is relevant you KNOW for sure we’re into massive asshole territory.. and he doesn’t disappoint.   Yta",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1059,
                      "content": "Oh yeah, i immediately went well I know how im gonna judge this but man did he beat my expectations. And incidentally that costume sounded awesome. And he’s all salty because it wasn’t what? A skimpy sailor moon cosplay? Oh no, she did something for herself and OWNED her scars as the proof of her SURVIVING CANCER and OP was embarrassed because people could see them and see she no longer had breasts and thus wasn’t a sexy cosplay waaaaaaaaaaaaah. Anyway YTA",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yup we all knew where it was going",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It is impressive, did he really think people would agree with him?!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1170,
                  "content": "Yeah the title and the first line did it for me. I could see this going a very misogynistic way. \n\nAnd the “something sexy for me”. \n\nOP YTA\n\nMaybe support your girlfriend that she showed the bravery to show off a scar from likely one most difficult things she’s had to do and kicked cancers arse. \n\nOr at least give her the satisfaction of dumping you.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 158,
                      "content": "[removed]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Hopefully by now she’s the EX girlfriend",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 784,
                  "content": "The type of anime fan that gives others a bad name. Her cosplay wasn't for his attention it was to express her love of character.\n\n I'm telling you right now if I was his place I would have loved to seen how she looked as Dabi.\n\nProbably nailed and hell her scars would've added to it.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 752,
                      "content": "He said a lot of people wanted pictures so I'm guessing she totally killed it.  I just can't get past not only feeling shame for someone else's cancer scars, but then being so fucking daring as to say it to them, and then ask the internet if that was the wrong move.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 201,
                      "content": "Thank goodness other people at the con appreciated her cosplay. With op as her boyfriend, who needs insecurities.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I'm a huge mha fan and the amount of research that went into this is admirable!! OP said Gf is not into anime, yet she cosplayed the look from current manga chapters.\n\nAnd the biggest indicator is the red streaks! There was only one official art that showed the character with red streaks, that means she went out of her way to find that image!!.\n\nYTA op. You don't deserve her",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Not even for the love of the character, probably, since op said she saw few episodes.\nProbably just to own her body, make the most of the situation, be proud of herself.\n\nTo me, op's reaction would be like a kick in the nuts, and I would leave him on the spot",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I was thinking this\nShe probably rocked that outfit!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "He said she wasn’t into anime so it really wasn’t even to express her love of the character, I think she did it for him because she thought he would love it and wanted to support him and do something awesome for him. Makes it even worse that he said what he did to her.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 523,
                  "content": "[removed]",
                  "id": 30,
                  "comments": [
                    {
                      "score": 563,
                      "content": "And she had it at 19! Good for her for being so comfortable with her body and proud of being a survivor.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "Me also, had multiple surgeries.  It doesn't matter if we do or don't get reconstruction.\n\nOP you are a massive YTA !!!!!!",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 71,
                      "content": "He’s oblivious to the fact that beating cancer means she’s faced her mortality. That shit is terrifying. YTA.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 484,
                  "content": "[removed]",
                  "id": 34,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Well said. Hopefully this opens her eyes to the little boy she’s dealing with and she’ll drop his ass for an actual adult who appreciates not only what she’s endured but the strength she shows to own that shit the way she does.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I bet he's brought it up several times. I really hope she ends up with someone better than this.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 376,
                  "content": "Especially considering what they’re finding in breast implants that are a few years old now 🙄\n\nI’m not gonna lie, there’s nothing wrong with my breast tissue but I was never particularly well endowed in that area and I was insecure when I was younger. I thought about getting implants back in the day when they were really big (pun intended lmao). I’m glad I didn’t. There are a lot of women right now facing a host of issues with either silicone poisoning or moldy saline implants.  Even the ones that haven’t made women sick end up looking ridiculous when they’re 60. This poor girl survived something horrific and is making the best out of her lot in life.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 388,
                      "content": "I'm on the opposite end- I've had giant boobs since I was not even yet a teen and as an adult they're stupid big. And I hate them. I hate the disgusting things men think it's ok to say to me because of them and that it makes it hard to find and buy clothes that fit without looking like I'm trying to be provocative.  I'm glad you kept your boobs! And I'm glad this chick is proudly showing her scars! And I hope she's single soon",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My mama had a bilateral mastectomy in her late 40s and found out her implants were bad 10 YEARS LATER. Insurance actually paid for a second reconstructive surgery, but jesus fucking christ, that is not an easy surgery.\n\nEta: the original surgery was in 2002, and she's going to be 21 years cancer-free this month\n\nHaving to go through breast cancer, surviving, and making the decision to forego reconstruction at *20* is a fucking warrior move, and woe be unto the asshole that diminishes her choice for not looking \"sexy\" in a goddamn costume, and still tries to convince people he loves her.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 319,
                  "content": "He sounds like an ignorant kid that doesn’t know shit and is stuck at puberty.\n\nEdit: and I don’t think so because of the anime/manga thing",
                  "id": 40,
                  "comments": [
                    {
                      "score": 25,
                      "content": "OP is 25. His attitude might be forgivable in a teenager, but this is a formally formed adult.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 186,
                  "content": "Once I saw that line I knew OP really does have an issue with it.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 246,
                      "content": "I bet he thought she was going to dress up with gigantic fake boobs",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "OP should also consider that a woman who was forced into a double mastectomy due to cancer, and may have also lost her hair during treatment (though that's just a guess based on how short it is), might feel rather mutilated afterwards, and might look to turn that into a source of empowerment through an *incredibly creative* cosplay of a character who (from the pictures I just looked up -- not familiar with MHA myself) appears to have suffered some significant disfigurement himself. If that's the case, then he just shat all over that. *and,* from looking at these pictures, he also shat all over a *metric fuckton of hard work and ingenuity,* because that does not look like an easy cosplay to construct. YTA, no question.\n\nAlso, a woman who has been through a double mastectomy due to breast cancer should, at the very *least,* be exempt from our society's weird hangups about women being shirtless. She should get to have that *one* fucking bright side after such a difficult and traumatic experience.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 735,
              "content": "“Flaunting her mastectomy scar”\n\nAs she should. She beat fucking cancer\n\nOP sucks!!! Mayor AH",
              "id": 45,
              "comments": [
                {
                  "score": 9,
                  "content": "Exactly “flaunting” it’s as if he wants her in a little box as his plaything just for him rather than a confidant adult and partner strong enough to be themselves, that the guy clearly doesn’t see it I suspect he is controlling in other ways maybe he projects his own insecurities into controlling her well what she did shows me she has an inner strength so unless he shapes up she is gonna ship out",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 344,
              "content": "Yep the “for me” made me gag 🤮. YTA OP",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "YTA\n A woman not embarrassed by the agony she had to go through, confident to show her scars. Brother! Could you have been any worse? It takes a great deal of courage to do what she did and you took that away from her by being embarrassed. 🤨",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "The \"a lot of people came up to take pictures with her\" told me everything.  She not only owned her scars, she busted ass and made a costume that the nerdiest of nerds wanted to be seen with, and all he could do was complain about his own embarrassment.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "What also read poorly was the line \"this was before she met me.\" \n\nAs if he were insinuating had this happened prior to their meeting, he would have ensured she followed up with the cosmetic/reconstruction surgery....the way he speaks of her is as though she ISN'T a badass beautiful woman, owning her battle scars with pride & dignity ... as if she's \"less than\" any other lovely & creative cosplayer with talent and beauty, strutting her perfection thru that hall with her head held high. \n\nI guarantee you that she felt SO PROUD of her outfit and makeup job - it absolutely took her HOURRRRRS that day just to apply - & after all the likely amount of self-psyching up it took her to get to that vulnerable headspace - & no doubt thinking he was going to be supportive! - to come back to a whiny, insensitive ass who acted as though SHE embarrassed HIM?!? \n\n--Hey OP, perhaps you need to be a bit more explicit with your invitations. \nYou didn't invite this beautiful badass to get to know more about her, to spend time with her & enjoy the self expression she was so talented in creating....you hoped for slutty arm candy, and something to drool over &/or to share amongst your buddies shared spank bank. And when she delivered something so cool that ppl STOPPED HER FOR PHOTOS!!! you acted like a real ugly AH. \n\n\nBut SHE....embarrassed YOU....?!!! 😂👍",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And the fact she had to ask permission to cosplay to begin with... 🤢",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I’m not sure why OP expected a different answer when the insinuation of a sexy cosplay “for me” was combined with the knowledge that his GF kicked cancer’s ass and has the battle scars to prove it. She, and her cosplay both sound amazing and inspiring. \n\nFor the bot: YTA",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "“I thought she was going to do something sexy for me” made me actively gag",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Yeah for anyone unfamiliar, she was “crossplaying” - Dabi is a guy. I had a bf who was unenthused by my crossplaying and told me if I ever had to have a mastectomy, I’d be unattractive because I’d be flat. My husband called him a “fool” when I told him. Hope she realizes her worth and gets far away.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2564,
          "content": "Okay also not to mention that maaaaybe gf picked this character because as someone with scars (or other visible difference and disabilities etc) it can be fun and cool to have a beloved character who looks like you. Like MAYBE gf was actually fucking stoked to be topless and have it go along with a characters scars instead of being made to feel ashamed/weird/different/like a negative spectacle when topless other times. Then OP comes along and is like \"why dont you feel ashamed about your grotesque body?!?!\" What an absolute asshole",
          "id": 55,
          "comments": [
            {
              "score": 143,
              "content": "[removed]",
              "id": 56,
              "comments": [
                {
                  "score": 133,
                  "content": "and those \"some men\" are disgusting.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 76,
                  "content": "100%.\n\n I can imagine his thought process, finally have girlfriend to take to anime convention so he can feel superior to other people there, but she's not following the script in his head of how it was going to go. Because if the girlfriend isn't dressed sexy then she obviously has no value",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I catch people checking out my wife, and it makes me happy cause she’s absolutely gorgeous. And yeah, seeing other people notice that makes me feel good. \n\nBut it’s not something she owes anyone. If she wants to go out in an old shirt and trakkie daks that’s her choice. If she wants to dress up in tight pants and a shirt that shows off the girls, that’s also her choice. \n\nFeeling proud that other recognise how much of a fox you’ve managed to somehow convince to love you (still not sure how I managed to get a woman so far out of my league) isn’t an issue. Expecting her to play up for that is.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "Yes! When he was describing how her body totally fit the character I was thinking that this young lady is a genius.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "She must have felt amazing when people started hyping her up and asking for pictures with her. I hope OP didn't manage to completely ruin it",
              "id": 61,
              "comments": [
                {
                  "score": 18,
                  "content": "I would have loved to see her cosplay, especially because I am a fan of Dabi and of MHA in general. I'm sure it looked amazing.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Ya she sounds fucking cool. Way too cool for OP.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2013,
          "content": "She had a double mastectomy at age 19 AND is not just comfortable with her scar, she is willing to flaunt it. She ROCKS!! \n\nOp, YTA.",
          "id": 64,
          "comments": [
            {
              "score": 300,
              "content": "This post makes me want to fight people. I am blown away by OP, WOW",
              "id": 65,
              "comments": [
                {
                  "score": 29,
                  "content": "Same. And I am not a fighter. At 19. 19! She had double mastectomy and now embracing her body. Not often I find a hero in AITA. OP is absolutely TA, a ridiculous one at that",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Seriously, OP sucks. What a massive lack of empathy. He's so deeply absorbed in how it feels for HIM that he doesn't even realize how incredibly fkn traumatizing and upsetting it is to have no choice but to cut your fkn tits off and then go through life as a woman without breasts. Surely that has been something she has had to struggle A LOT with. But instead of caring about how difficult it must've been for her and how incredible it is that she's comfortable enough in her body to flaunt it, he's just focused on \"omg IM embarassed!! you're not ashamed and embarassed enough of your body! You need to be more insecure about this terrible thing you went through!!\" Like... Gee, what an incredibly supportive partner who's really lifting her up, eh? 🙄",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I honestly believe that OP is going to try and strip away the strength and confidence if she stays with him.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP’s girlfriend is the physical embodiment of that feeling I get when shania twain says “let’s go girls”",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 970,
          "content": "“You’re going to love it” can only mean ONE thing, duh! Definitely couldn’t be about excitedly  sharing interests /s",
          "id": 70,
          "comments": [
            {
              "score": 697,
              "content": "Seriously, she went through all this time and effort to play a character from something she doesn't even watch because she thought OP would get a kick out of seeing a character from *his* show. If my partner took the time to notice a show I liked, research that show, and dress like a character from that show, I'd be so amazed and impressed!",
              "id": 71,
              "comments": [
                {
                  "score": 164,
                  "content": ">If my partner took the time to notice a show I liked, research that show, and dress like a character from that show, I'd be so amazed and impressed!\n\nI'd propose, tbh.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm not the type to take photos often, but I would have taken so many of her in that cosplay and complement her to the end of the world for her efforts.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 765,
          "content": "So he wanted a sexy outfit, which 99% on anime show skin, but he didn't want her to show skin in a non-sexual way?\n\nYTA",
          "id": 74,
          "comments": [
            {
              "score": 184,
              "content": "Sounded like he wanted some pretty little uwu senpai girl and now feels jealous cuz she was way more badass than him. OP, you are big time YTA. She deserves waaaaaaaaaaay better than you.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "He probably wanted to be the cool guy who brings a sexy cosplayer to the con so that other guys are jealous.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 432,
          "content": "YTA.\n\nAre you more mad that she has the confidence or the ability to pull this off like a badass?",
          "id": 77,
          "comments": [
            {
              "score": 10,
              "content": "That’s the bit that worries me is he a controlling ass that feels threatened by he confidence",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "can we break up with OP on gf's behalf, what a waste of time",
          "id": 79,
          "comments": [
            {
              "score": 8,
              "content": "Yes.\n\nSorry, OP, it's not us. It's you. It's best if we go our separate ways.",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This shit reminds me a bit of an ex boyfriend of mine I went to comic con with like 10 years ago. I’m a bigger nerd than he was and he’d keep commenting and taking photos with scantily clad cosplayers and then I realized no wonder he liked that I did my X-23 cosplay then wearing a skirt (I didn’t have the money to buy pants like she wears), and a corset. \n\nSome people just have to make shit all about them.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I'm furious. My wife is a cancer survivor with scars. I'd be proud as hell for her to go and do what your girlfriend did. That took guts and trust - trust in you that frankly you don't deserve. Hell, you're clearly not emotionally mature enough for a relationship yet, why not go home to mummy, get her to tuck you in and in ten or twenty years maybe you can try again to be there for someone else.\nTo be clear - YTA",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "The second he said, “unlike a lot of women,”\nI IMMEDIATELY knew",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 36816,
      "content": "YTA - Jesus, she went through cancer and a double mastectomy and you’re crying about being embarrassed??? Please break up with her so she can find someone that’s not an asshole.",
      "id": 84,
      "comments": [
        {
          "score": 10411,
          "content": "Not only did she go through all that she did it at 19!!! She barely got to come into her “woman’s” body before it was traumatically ripped from her. She empowering herself and embracing her history just for this AH to reinforce her fear that without breasts she’s not Beautiful. \n\n“Other people were staring” of course they were! It’s natural for humans to look at something new and different. It’s terribly rude but let’s be honest we all do it. AND if her make up job was that good, half of ‘em were probably trying to figure out how she “made it look that realistic”. \n\nThis dude is TA for sure and used the whole gallon of audacity when he made this post.",
          "id": 85,
          "comments": [
            {
              "score": 3169,
              "content": "I was so appalled by the mentality of this post that I completely missed her being 19 when she was diagnosed. WOW!",
              "id": 86,
              "comments": [
                {
                  "score": 1630,
                  "content": "As soon as I saw the mastectomy part I jumped back to the age and did the math. That is outrageously young to deal with all that. I can’t even imagine the emotional trauma.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 856,
                      "content": "She’s clearly a very strong woman who deserves much better than OP",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 656,
                      "content": "Seriously. It made me cry imagining being 19, going through that, then thinking you'd found a partner who loves all of you and being told your body is an embarrassment.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 214,
                      "content": "You hit the nail on the head w/“outrageously young.” We don’t even get told to have mammograms before 40!",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 293,
                  "content": "She was 19 when she had the double mastectomy. Wouldn't be surprised if she was diagnosed earlier than that - I imagine she tried other treatments before moving forward with surgery",
                  "id": 91,
                  "comments": [
                    {
                      "score": 240,
                      "content": "Possibly not. A lot of the time with breast cancer is more aggressive the younger you get it so she may have had to get the mastectomy straight out the gate",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 623,
              "content": "At a con, cosplayers specifically want to be seen, noticed, photographed. Usually the person staring thinks the cosplay is awesome and they want a picture but are shy to approach. And although cosplays might be sexy, if she was doing it for OP, it would have been a private performance (which he obviously does not deserve). \n\nYTA - Way to make your girlfriends double mastectomy about you. Self-centered much?",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 271,
              "content": "Yes! If we have the choice in the middle of the road to look at a birthday party or a horrific car wreck, we’ll choose to look at the wreck (want to make it ABSOLUTELY CLEAR I AM NOT MAKING A COMPARISON BETWEEN THE TWO , more so that humans are curious and rude beings like anything else in the animal kingdom lol).\n\nBut the fact people wanted to take pictures with her means her cosplay was spot on/interesting/amazing! OP was just mad his girlfriend didn’t dress sexy!\n\nIt’s such a shame too, because she doesn’t like anime. Like my girl spent HOURS with her awesome skills to make something that is of interest to her boyfriend and he just hems and haws about how it’s not sexy and brought attention to her.\n\nShame on you, OP!",
              "id": 94,
              "comments": [
                {
                  "score": 18,
                  "content": "My oldest daughter is special needs and in a wheelchair. She still stares at other people in wheelchairs! I tell her not to be rude, but yeah it happens!",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 264,
              "content": "\"other people staring\" is the goal and best compliment when you go this hard at a con. It's only beat out by someone requesting a pic with you. \n\nOp is YTA",
              "id": 96,
              "comments": [
                {
                  "score": 19,
                  "content": ">\"other people staring\" is the goal and best compliment\n\nI guarantee that's part of the reason he wanted her in a \"sexy outfit\" - his little trophy.",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 239,
              "content": "as someone with pretty obvious double mastectomy scars (although in my neck of the woods, it's referred to as top surgery ;) ), i can almost guarantee people were staring because this girl's cosplay was awesome, not because of the scarring. i can count on one hand the amount of people who have stared at my chest scars in my 5 years since surgery. \n\nbf is definitely the asshole here, and likely reading his own embarassment into other's reactions.",
              "id": 98,
              "comments": [
                {
                  "score": 44,
                  "content": "Mastectomy scars from cancer can look very different and traumatic than the scars from an elective, gender-affirming surgery. A mastectomy to treat cancer often removes the nipples and the surrounding tissue as well. It can be jarring if you’ve never seen it before.\n\nI’m not doubting that this girl’s cosplay was awesome, it sounds like it was! But it almost definitely doesn’t look the same as someone who’s had top surgery. \n\nSource: cancer survivor. I didn’t have breast cancer, but I know people who do/did",
                  "id": 99,
                  "comments": [
                    {
                      "score": 34,
                      "content": "This is true! Some top surgery patients also elect to remove the nipples--it's all patient preference, but I'm hoping as that becomes more common, it'll impact both the cancer survivor community and the trans community positively.The comparison on my part may have been rather inept. I was thinking along the lines of \"if there's sfx makeup incorporated, how many people will even be able to tell which scars are real and which arent, especially if many people are not the most observant in the first place\", and could have put it forward a little more clearly lol. i have several other scars from various skin grafts, medical procedures, etc and also know several women who have beaten breast cancer, so i definitely do not mean to gloss over how different things can appear/how much physical and mental baggage can come along with harrowing illnesses and surgeries, and that's not even considering individual healing rates! Whew. I do appreciate your pointing this out as i was generalizing perhaps more than was realistic (:",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It was 100% because her cosplay was amazing. If anybody thought about the scars, it was because they thought they looked really cool and admired the work. If I had to guess, I’d think there were a number of men she interacted with who would jump into OP’s spot in a heartbeat. And he’s here embarrassed, not realizing that the very thing he’s whining about is the thing that would have made it possible for her to get his replacement and upgrade with a snap of her fingers.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "For sure. Idk if you've seen a picture of Dabi from my hero academia, but I can easily 100% see her making her scars work with the cosplay because of how scarred the character is (if that makes sense).",
              "id": 102,
              "comments": [
                {
                  "score": 86,
                  "content": "My son watches MHA so I just had to look up which one it was. It was a great choice on her part, definition of “work with what you got”.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 23,
                      "content": "And probably half of why she got so much attention.\n\nPeople love a smart cosplay that works with the cosplayer's body.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That is probably exactly why she chose that character. And I know nothing about anime. But she was so excited about it so she thought she had it down cold. This guy is such a tool. I’m hoping she realizes this is a him not her problem.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Just googled it. Her outfit sounds amazing, and would look very empowering to others.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Honestly, I'd be one of those jaw dropped gaping starers, but because I'm so into SFX id be mentally cataloging it all.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Not only that but Dabi is covered in scars and burns and shit. They were staring because her cosplay was spot on",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This cosplay was probably very meaningful & relatable to her, she most likely resonated with a part of Dabi's backstory; (regardless of the character's moral compass) where a kid went through a traumatic situation at a young age that resulted in life altering physical scars. Then OP just stomped all over her good vibes.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "also the concept that people absolutely HAD to be staring at her bc of the mastectomy scars and not a cosplay she clearly spent hours perfecting is soooooo detached from reality",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1259,
          "content": "\"Flaunting her mastectomy scar\" Jesus fucking christ",
          "id": 111,
          "comments": [
            {
              "score": 462,
              "content": "I looked up who she cosplayed. It's the perfect character design for someone looking to use features she already has to make a stand out costume.\n\nOr should she have become like my great aunt? Destined from age 25 to be a lonely old maid because she was considered damaged goods.",
              "id": 112,
              "comments": [
                {
                  "score": 103,
                  "content": "I’m sorry your great aunt went through that. OP YTA. Your girlfriend went through a serious surgical procedure and honestly terrifying medical diagnosis at any age and she did it while so very young. Now she’s doing something (cosplay) to feel confident and proud of her body as it is after those experiences. You should be proud of her for showing her serious strength of character, not berating her for something she had no control over. And yes she could have gotten reconstructive surgery, but if she’s comfortable with the way she looks and is healthy mentally, she has no need for it. Apologize profusely. Immediately.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Your poor great aunt! Often, the people who are most cruel are the members of one's own family because they know where to twist the knife.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 265,
              "content": "it’s an immediate tell when they describe someone showing parts of their normal human body as “flaunting” something",
              "id": 115,
              "comments": [
                {
                  "score": 132,
                  "content": "Right?! Like op really said 'how dare she flaunt that she survived cancer and not be ashamed and disgusted of her mastectomy scars like I obviously am?' & thought he was the good guy 🤦",
                  "id": 116,
                  "comments": [
                    {
                      "score": 22,
                      "content": "yeah!!! like even if she was “flaunting” it (which in this case i think it was literally just visible) then…good for her?!!!! why shouldn’t she?!!!! she survived something horrible and terrifying why should she hide that",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Right? She flaunted her amazing talent, personality, and love and support for his genre. He doesn’t deserve to in her same universe.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "This phrase omg. That is four words to break up with the appalling ahole who said it. Flaunting. Her. Mastectomy. Scar.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "Seriously! Even if she WAS \"flaunting the scar\"... I say MORE POWER TO HER! This young woman not only survived cancer but is confident enough in herself to wear an outfit that she couldn't hide them with. That shows inner strength and self-love and acceptance. I have met many cancer survivor who are ashamed of the scars and actively hide them.\n\nHopefully, OP is now an ex. Cause holy fuck.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My son had top surgery at 18, and I cried the first time he went outside shirtless. If this were my daughter or my wife, I'd be so fucking proud I'd be speechless. This OP is a yutz.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 726,
          "content": "“Please break up with her so she can find someone that’s not an asshole” … I will upvote this forever.",
          "id": 122,
          "comments": [
            {
              "score": 59,
              "content": "If I could Upvote this constantly, I would.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Notice how he doesn’t like her more androgynous aspects (short hair, dyed) \n\nI just know he didn’t like the female attention she was getting at the con cause I know the girlies would have ate up that Dabi cosplay",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 323,
          "content": "I’m not joking when I say this but I think majority of people posting on here need to go to therapy. How do you lack that much empathy, social awareness to even ask this question to see if you’re in the wrong. YTA OP, please leave this girl, she deserves someone better and you need to work on yourself. You’re heartless.",
          "id": 125,
          "comments": [
            {
              "score": 191,
              "content": "The really sad part is she will NEVER forget his statements. The damage is done.",
              "id": 126,
              "comments": [
                {
                  "score": 15,
                  "content": "Well she seems pretty effing solid to do all this for him for his weird anime fetish, so I have a feeling her retelling will be about the tool she dated many years ago who didn’t get how badass she killed the character and he was the only idiot at the con who didn’t get it. All her friends will laugh about it. His mom will shout down to the basement and ask if he wants a pickle with his grilled cheese. And shake her head that her son is a 40 yearly old Incel ruining her retirement.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Agreed. I'm going through cancer treatment right now. The blow to your self-esteem is brutal. It takes huge amounts of work to be okay with your body again, on top of the hard work of healing and taking care of yourself. And now OP is trying to tear all that hard work down. It makes me want to cry.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Exactly. It s not on the same level but I still hear my mom in my head telling me I look like a street Walker (in regards to my outfit) and it’s been 10 years since she said it. Sometimes even once you’ve healed and you don’t really believe it, you still remember the comments anyways.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 121,
          "content": "She seriously deserves so much better than OP. Like the bar is so low there are countless people I think would be better because they can stumble over/meet the bar without attempting.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "At 19!",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "First time ever getting an award (let alone more than one) on here. Thank you so much! This is one of those topics that really hits home for me having a wife who has multiple marks of strength from her battles.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Seriously. As a trans guy with chest scars fuck **ALL the way off bro.**\n\nHaving your body changed when you really want it (like trans guys who get chest masculinization) is super fucking hard and rocking the scars is something you learn to do with pride over time. It sucks - you have to love your body over the sound of other peoples side eyes.\n\n**Now imagine doing that when the surgery and scarring was 100% involuntary** - like a cancer survivor.\n\nShe didn’t want to be scared. She didn’t want to fight for her life or confront her mortality. She probably didn’t want to lose her breasts (maybe, who knows), and she didn’t sign up for scars.\n\nBut she rolled with it, found a guy (you), engaged with him on his hobby at his con, and what did you do OP?\n\nYou shat on it.\n\nWay to go bro. You’re the human equivalent of cops at a party. Break up with her.",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Crying about being embarrassed because she wasn't *sexy*. I guarantee if she was getting her same level of attention for looking like creepy underage jailbait, he'd have eaten it up. \n\nHomegirl took an interest in wanting to join her creepy bf in his thing that wasn't her thing just to be an awesome gf. He took a shit all over her hard work and excitement because she didn't make everything about his dick. \n\nThe cancer and double mastectomy is just icing. \n\nIf his attitude and behavior weren't so typical, I'd say this story was rage bait, but alas...",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "i really hate OP's post; although i dont have breast cancer i have a massive scar across my back and hip from my tumor removal surgery. my boyfriend tells me that i look fine but its because of posts like OP i worry every day he's lying.\n\nYTA OP and i hope your girlfriend finds somebody that really loves her and appreciates what she's been through.",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 26463,
      "content": "This is why women have such a hard time being cosplayers - guys are always assuming they're doing it to be sexy for them. Your girlfriend did something scary and brave for herself.  Your reaction is disgusting.  YTA",
      "id": 136,
      "comments": [
        {
          "score": 5802,
          "content": "Ya, very weird that he assumed she'd do something sexy \"for him\". \n\nAlso it sounds like everyone else thought the costume was sick as hell, so it really sucks for her that her own boyfriend didn't appreciate it.",
          "id": 137,
          "comments": [
            {
              "score": 1953,
              "content": "I’m thinking everyone else recognizes it for what it is, and exactly what she said it is, making the best of a bad situation. \n\nIt’s weird that OP calls it “flaunting her mastectomy scar”. Does OP even realize how many women feel badly about their scars? Does he realize that if she still had two cancerous lumps of fat and tissue attached to her chest, her costume probably would have gotten her a ticket and kicked out? Maybe she left the scar unhindered (other than not caring about it/accepting her new body) so people would be able to tell, “*ohh*” and wouldn’t harass her about being *GASP* a shirtless female body?? Since rules are different for us? \n\nMost people probably went “oh wow! Cool cosplay. Oh wow! You’re AFAB? oh WOW, you survived cancer and that’s why you’re able to do this cosplay? Cool! Can I get a pic? Bye!” \n\nI’m still confused about the terms *flaunting* and *for me*. OP has some serious issues to deal with. If she’d had nice, fake, heavy, round implants put in after surviving, and wanted to bounce around in a feminine cosplay he’d still say she was *flaunting* - just something else. It’s beyond “she was shirtless and women should cover up god damnit” it’s also about her taking control over her own body and wanting to show it to strangers in an artistic and cool way that he doesn’t get to dictate, didn’t expect, and didn’t like.",
              "id": 138,
              "comments": [
                {
                  "score": 796,
                  "content": "Yeah \"flaunting\" is def a lot to unpack. Some men just hate when women get attention, even in totally appropriate contexts. You think of a cool cosplay that most women wouldn't be able to pull off because of their breasts? Flaunting your body. It's like when men get mad at women wearing flashy makeup, as if showing off your skills&creativity is just vanity.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 215,
                      "content": "Yeah, it’s sadly all too clear that he assumes she should make decisions about her appearance based on what makes him happy and comfortable. If “flaunting” any of her body parts achieved that end, that would be fine.\n\nIt also really bothers me that he’s being this way when she donned this get-up at the most appropriate venue imaginable. People go to these events EXPECTING to see some incredibly out-there costumes. If they had been invited to a christening or some extremely staid event and she showed up this way, that really would be disturbing. But this was the right time and place for  that costume.\n\nI assume he does find her desirable and must be very familiar with her scars. So, is the problem that he doesn’t want other people to see them? If so, why not? Does he feel ashamed of being seen with a woman others might think of as “damaged” in a way that makes her less desirable? Is it all about his pride?\n\nOr is he simply so invested in the idea the idea that she is there to make him feel desire that he’s actually not thinking about how meaningful this must have been for her? Is her “femininity” the only part of her values? \n\nI’m sure she is keeping her distance. Wow.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "It’s the same mindset behind society expecting women to be groomed and pretty, but absolutely not acknowledge that they’re aware they’re pretty, because then it suddenly becomes bad and vain and then they’re flaunting it. 🙄💀",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "She probably chose the words “making the best of a bad situation” to help him understand. But for her, she sees a character she can nail *because* of her body. It’s one of the times her body can feel like an advantage and I bet that was exciting for her, and she could never ever explain that to him. \n\nHe could have chosen to think of more cosplays that she could pull off with wicked accuracy because of her unique body, build her up, encourage her to embrace herself. \n\nBut no. He chose to be pouty about her not having implants **before he even met her** and deciding to expose her scars instead of hiding them. \n\nDude, if she can beat cancer, she can beat this relationship too. YTA.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "With what happens before a 19 year old ends up with a double mastectomy, if she still had her breasts attached she'd probably be dead! \n\nHope she flaunts her proof of life right out OP's front door.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "“Flaunting”\n\nPerhaps OP is that tosser who writes headlines for The Mail Online’s nasty little sidebar-of-shame?\n\nFemale public figures/ celebrities have been accused of flaunting* everything from their svelte figure, to baby bump, to post baby body for the paparazzi. From wearing shorts on a (private) tennis court, to knees (in a summer dress) at an outdoor restaurant table, to her bottom in a bridesmaid’s dress entering a church.\n\nI must admit though, even the bloody Mail Online has yet to accuse a woman  of “flaunting” her mastectomy scars alongside SPX scars in a cosplay convention. \n\nI would never have believed it possible, but OP is an even bigger YTA than the YTA’s that edit the The Mail Online. Wow!  This tosser ought to be kept away from women as a whole and humans in general. \n\n*Read: in possession of their own body within distance of a paparazzi long lens",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "> It’s weird that OP calls it “flaunting her mastectomy scar”.\n  \nWhat's so bad about that anyway? It's hers to flaunt if she wants to.  \n  \nYTA, OP.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I don't even know the character, and the description of what the gf did sounds bad ass",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 746,
          "content": "And I don't get it. Like if she dresses up \"sexy\" and all sexualized like a lot of cosplayer women and then men are taking pics with her for being \"hot\" and looking at her chest because they are checking them out how is that any different? Would op not care about all the gazing as long as it was because she looks hot? Cause if so then it sounds more like HES embarrassed by her mastectomy.",
          "id": 147,
          "comments": [
            {
              "score": 511,
              "content": "Some men like their girlfriends to get that sort of attention because it's a \"score\" for them. They feel like other men envy their possession and they gain social status off their partner being sexually appealing to other men. It's a gross mindset.",
              "id": 148,
              "comments": [
                {
                  "score": 53,
                  "content": "Yeah, I feel like he's upset that she's getting attention that he can't immediately use to bolster his own ego. \n\nWhich is ridiculous, because I'm super proud of all the accomplishments of my partner and friends, all of which have nothing to do with me-- I'm just happy to see their talents expressed!",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 278,
              "content": "For real. \n\nAnd for once her body has given her an incredibly unique and badass opportunity! (I definitely couldn't cosplay like that without getting cited for indecent exposure, lol)\n\nIt took guts to go like that, and skill to nail the burn scars, and all this dumbass thinks about is that now when guys look at her they won't think she's \"sexy\"?? \n\nThe absolute misogyny is disgusting. \n\nShe's being awesome, and he's worried other men won't find his woman sexy enough. \n\nI just can't wrap my mind around how disgusting he is.",
              "id": 150,
              "comments": [
                {
                  "score": 70,
                  "content": "I have so much respect for people who can actually cosplay. Ik I tried before at a ren fair and it was rough 😂 she sounds amazingly creative and talented",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And honestly, if this were my wife, I’d find her self-confidence and badassness sexy anyway.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Hey OP, if your (maybe ex) girlfriend approves, show us her cosplay! It sounds awesome!",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "I think it because he couldn’t show her off as a little prize.",
              "id": 154,
              "comments": [
                {
                  "score": 6,
                  "content": "He doesn’t actually think she’s sexy, so he needs to convince other people she is. Because otherwise they’ll know he had to settle for an uggo.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Let’s be for real she definitely settled and deserves a lot better",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "Am a female cosplayer, can confirm. Even when I DO wear a \"sexy\" cosplay, I'm doing it for ME because I like it and I feel good about myself. OP's GF sounds freaking awesome and I'd love to be her friend. This dude is 100% TA.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 231,
          "content": "I have to say, I read this post and I thought to myself... how could you type this all out and not realize what a massive asshole you are. Like wow. I'm actually blown away by this one.",
          "id": 158,
          "comments": [
            {
              "score": 11,
              "content": "It’s the case for a lot of post here actually. I could understand if in the moment you’re overreacting but then when you’re home and reflecting normal people would say « damn what an ah I was, I should call and pitifully excuse myself » \n\nBut lot of people coming here sounding completely clueless to their own assholery.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 98,
          "content": "I cosplay a lot my ex made me want to stop because if I didn’t cosplay someone “sexy” he would tell me I needed to stop playing dress up. But soon as I started cosplaying black cat or someone smiler he was more then happy to see it.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Bro crying she didn't stuff a bra and come as a big tiddy anime maid....though you fucking know that if she did go as a big tiddy anime maid he'd be on here crying that his girlfriend got loads of attention from anon deadpools and they where taking pictures all day. The anime costume was supposed to be for him not the deadpooools!",
          "id": 161,
          "comments": [
            {
              "score": 9,
              "content": "The accuracy...🎯",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yea guys like him are why I don't cosplay anymore. That and being quizzed about every goddamn anime/video game out there because I'm \"Not a real fan\" of the mediums if I can't answer questions about shows I watched like three or four episodes of and then dropped, or have never heard of.\n\nAsk me about the deep lore of Lord of the Rings, Fallout, Mass Effect, or Dragon Age and hooooo boy sit down I have got some STORY TIMEEEEEEE. (Also if I'm wrong about something, actually correct me like I'm a person not a three year old, I enjoy learning where I have been wrong)",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "> Your girlfriend did something scary and brave for herself.\n\nI know absolutely nothing about anime (just not into it), but her costume sounds absolutely amazing. OP is a huge AH.\n\n>  I thought she was going to do something sexy for me.\n\n> I was a little embarrassed that she was flaunting her mastectomy scar like that\n\nYeah, OP wanted her to flaunt her body. Just not like that. Yuck.\n\nOP, YTA.",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Sadly some men think everything women do is for them",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "She's a fucking rockstar and deserves a better partner!",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15447,
      "content": "**EDIT: Thanks everyone for all the rewards. Wild, never happened before. Living the redditor dream fr.**\n\n**Also, because it's been mentioned: Yes, since we are discussing something specific, \"wanting your girlfriend to dress as a woman\" should not be taken out of context. But I feel like most mature adults wouldn't need that explained to them <3**\n\nYTA. And, you know what? I'm going to bullet point this for you. So. A list of things that make YTA:\n\n* expecting your girlfriend to cover her scars\n* expecting your girlfriend to dress as a woman\n* expecting your girlfriend to be doing a hobby that she enjoys, for your sexual gratification\n* expecting your girlfriend to be sad and mopey about her situation, and not make the best of something.\n* probably, based on how you've spoken, expecting your girlfriend to be traditionally feminine in a way that caters to your sexual interests.\n\nYour girlfriend is seemingly a very fun and creative person who put time and effort into doing something cool and fun to interact with your hobby and find a meeting point between your interests. It's very thoughtful of her, and she's clearly very talented and was excited for you to see her costume, because she expected you'd think that her craftsmanship was amazing -- based on the con's reactions, I'd say it probably was.\n\nYou don't seem to appreciate her for the person she is, and expect a lot out of her in very superficial ways. Grow up, it's an incredibly childish way to feel about the entire thing. Maybe you're not meant for her if you can't handle her just being a person outside of the traditional femininity that you find attractive.",
      "id": 167,
      "comments": [
        {
          "score": 3171,
          "content": "She sounds like a badass, honestly. To have gone through that at 19 and to have found the confidence to show her scars in public. I hope OP sees these comments and recognizes that and makes a true and sincere apology, or she realizes quickly that she deserves better and finds it.\n\nYTA OP",
          "id": 168,
          "comments": [
            {
              "score": 8,
              "content": "Yeah, I want to high-five her for having such a creative costume and working her scars into it.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I have a huge scar from an accident when I was 18. I hid it for years because when it was visible people would stare and make comments. Took me 10 years to feel confident enough to not cover it. She is awesome and OP is absolutely the asshole.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yeah that is my takeaway as well. I want to befriend his girlfriend because she sounds amazing! I mean, imagine how many women saw her and were like, \"Damn, that confidence and EMBRACING of her cancer battle scars is so inspiring! Maybe I shouldnt feel so ashamed of my own c-section, surgery, etc. scars.\" \n\nAnd here is OP, \"Oh boohoo me she didnt dress up in a fanservice outfit for me, howdl dare she act like a confident PERSON instead oslf a sexy thing for me to look at!\"",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 232,
          "content": "I want to be his girlfriend’s friend she sounds badass and amazing!",
          "id": 172,
          "comments": [
            {
              "score": 14,
              "content": "I know me too, she sounds gutsy as hell and super cool.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Right? I wanna see this cosplay! I bet it looked cool as all hell",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "OP’S GIRLFRIEND, WHEN YOU FIND THIS THREAD (because it’s so specific surely someone is going to recognize it) PLEASE MESSAGE ME I WANT TO BE BESTIES.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "This post nails it. Op you are a massive AH",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "You missed the clear sadness he felt for her not having reconstructive surgery “like most women”",
          "id": 177,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Coming out of my spouse having breast cancer, I know all too well what this girl went through. It’s likely she’s barely out of being on some cancer related drug 24/7 and is probably just starting to feel human again. Cancer gets cut out of you and you finish chemo and everyone thinks hooray you beat cancer!!! Well it’s not that simple, it’s years of bs even if it goes “well”. If it goes “well” it’s still lifestyle altering for years at best. If it goes poorly you are dead in a few years. On top of it, it sounds like he resents her for not having reconstruction and I don’t think he will over that - even though that’s something he should have accepted going into the relationship. They should both move on.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "my lord I hope she reads these comments 🥺",
          "id": 179,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "He did not value her craftmanship. He only cared about the sexiness. He is embarrassed that other may see that he is a boyfriend to a \"damaged object\" and can't score points by fellow anime Incel men.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9828,
      "content": "YTA. \"Unlike a lot of women, she didn't have any reconstructive surgery.\" \n\nThat was the moment I suspected that you were TA.\n\n\"I thought she was going to do something sexy for me.\"\n\nThis moment confirmed it.\n\nI was not prepared for how bad your behaviour was going to get OP.\n\nShe survives cancer and is left with a prominent scar. Something a lot of people would struggle with to a huge degree. But this lady is awesome and proudly incorporates her scar into a cosplay (I'll admit I have no idea who the character is).\n\nYou see this, and you get embarrassed to be seen with her? You're embarrassed that she put a huge amount of effort into her cosplay to an event you invited her to?\n\nYou're embarrassed that she's not ashamed of her body.\n\nYou need a serious attitude adjustment OP.",
      "id": 181,
      "comments": [
        {
          "score": 4256,
          "content": "[removed]",
          "id": 182,
          "comments": [
            {
              "score": 482,
              "content": "I am so sorry for what you and your MIL endured, and I hope you are able to find some peace. This guy is a complete and total AH.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 302,
              "content": "I hope this doesn't get deleted, it's truth and powerful. And I'm so very sorry for your loss. 💙",
              "id": 184,
              "comments": [
                {
                  "score": 188,
                  "content": "We’re just relieved she’s no longer suffering.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 100,
                      "content": "May her memory be a blessing, and may you and the rest of her loved ones find peace with it 💜",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I hear you. I watched my mum starve to death thanks to cancer and there comes a point where death is not the worst thing that can happen. She was stubborn and refused all pain relief until the 48 hours before she died. Fortunately at the end she was heavily medicated and didn’t know what was happening. I’m so sorry for your loss.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "I wish I had not read this. I have stage 4 BC & it's already in a lot of places. I don't want to imagine how painful it will be in the end.\n\nI'm very sorry for your loss & I'm sure you were a great comfort & help to your MIL.",
              "id": 188,
              "comments": [
                {
                  "score": 135,
                  "content": "I am so, so sorry. I hope you have a better outlook than it might seem like right now, and I hope when your time comes—whenever that might be—you have such great care and support that you are more comfortable than this poor lady.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Thank you.  I'm doing well right now & hope it continues.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Wishing you the best, friend.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 156,
              "content": "My partner’s Mother passed away nearly 7 years ago from cancer. It started as breast cancer, she went into remission. Then it came back, but had spread. \n\nThis was before I met him. I now have his child. \n\nI mourn for this woman I have never met, who would have been a loving and caring Mother in law to me and Grandmother to our child. I mourn so much that I cry about it at least once a month. \n\nI am so so sorry for your and your partner’s loss.",
              "id": 192,
              "comments": [
                {
                  "score": 13,
                  "content": "This actually made me cry. If something happens to me I truly hope my children have spouses like you. Beautiful, kind, and loving in a cruel world.\n\nI’m trying to figure out why this made me cry so much as tears are streaming down my face but duh, I too lost my MIL, we had the chance to move to her when she was terminally ill and I had just had my daughter, my second born. We had a year or so with her. She never met my youngest but I got to see her as a grandma so I can tell him about her.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I’m only 4.5 months post partum with my third, so lately anything remotely sentimental has been making me cry. I understand you. \n\nI’m happy for you that you had some time with her before she passed and this is something you can cherish.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My mother’s got breast cancer but seems to be doing very well with treatment, caught quite early, nearly at the end of her chemo. But she’s going to get a double mastectomy because she’s at risk of secondary cancer. My sister will have to probably since we carry the gene for it. FUCK this guy so much oh my god",
              "id": 195,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 439,
          "content": "I honestly like my scars. I like showing them off because it showed I overcame a health problem. Scars are nothing to be ashamed off. Mine was something minor but no where as deadly as cancer. OP YTA and is prepare for being single quickly. I hope you take your inevitable break up as a learning moment and grow from ot",
          "id": 196,
          "comments": [
            {
              "score": 206,
              "content": "While not from cancer, I don't go out of my way to display mine - but if someone even suggested I cover them up or be shamed I'd raise hell.\n\nI refuse to be ashamed of being alive.",
              "id": 197,
              "comments": [
                {
                  "score": 44,
                  "content": "And there nothing wrong with not showing them off either. Yea if anyone does that to you or other people really do need a dose of reality . Exactly! I’m glad you recovered!",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Well you see this wasn't an ordinary scar, this was a *boob* location scar, one of the areas women must be most ashamed of their entire lives. Bet op wouldn't be having this reaction if his gf did a \"anime face scar character cosplay\" instead of her shameful *boob area* one!",
                  "id": 199,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I think this is the issue. The hang up comes from the fact that she was walking around without a shirt on as a woman. It struck me as wrong initially too, because society has conditioned us to think women aren't allowed to do that. But to be embarrassed by it to the point of basically ruining the whole event (and probably relationship) over it is pretty insane. Just a reminder of how puritanically silly people still act.",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Same. I have a scar on the side of my nose from surviving a violent event. It is mostly covered when I'm wearing glasses and/or a mask, but I'm by no means ashamed of it. And if anyone ever had the audacity to say anything fucked up about it, they'd have another thing coming.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Yep, I have scars from tumor removal (\"benign\") and IDC who can see them. It does bother me a bit that some people assume it was cosmetic - it wasn't - but whatever.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 355,
          "content": "I’m gonna jump in here to add:\n\nWhen my mom got breast cancer it wasn’t the cancer that almost killed her. \n\nIt wasn’t the radiation. \n\nIt wasn’t the surgeries. \n\nIt wasn’t when the cancer returned. \n\nIt wasn’t even the double mastectomy. \n\nThe reconstructive surgery after did though. It was so bad that even though only one of the implants made it in the end she chose not go through with surgery again because of how close to death she was the last time and only has one breast now. \n\nAll that to say, his vanity can have a very great cost to her.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 323,
          "content": "Reconstructive surgery is no joke either, the initial internal chest expanders can cause so much discomfort and pain.",
          "id": 204,
          "comments": [
            {
              "score": 117,
              "content": "so true!  my cousin had more complications and setbacks from her reconstruction surgeries than from her chemo and radiation.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "So true. And sometimes that method isn’t even possible. I was a poor candidate due to prior radiation treatment so I would have had to have a “breast” transplanted from my belly or inner thigh. No thanks. So I’m running around with a scar and I honestly don’t care who sees it. I’m happy not to be dead.",
              "id": 206,
              "comments": [
                {
                  "score": 5,
                  "content": "Glad you're still with us too, happy cake day🍰",
                  "id": 207,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "My best friend is on hospice due to breast cancer at the moment, she initially opted for reconstruction so she got expanders put in. Unfortunately, the magnets in the expanders meant she couldn’t get MRIs and it made tracking new mets as they spread throughout her body incredibly difficult. When she woke up one morning and couldn’t use one side of her body they suspected cancer had spread to her brain, but they could only run limited diagnostics due to the spacers. \n\nShe had to get back to back emergency spacer removal and brain surgery because they couldn’t do scans with them in. Fuck that noise. She was 50/50 reconstruction vs just rocking a flat chest from the beginning and honestly in the end she wished she just went with her gut that said to heck with beauty standards. A lot of people pressured her to go for the reconstruction because she was only 30 when she got her double mastectomy. Also, you potentially need to get new implants every 10 years unless you get a DIEP flap. So, you’re not only signing up for one reconstruction if you’re young, but potentially decades worth of implant swaps. \n\nGF sounds like an amazing and confident woman  who made the best of a really challenging situation (cancer/ mastectomy scars) and I can’t believe you don’t value her.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "My coworker went on leave to get reconstructive surgery. She developed an infection that nearly killed her. I don't blame OPs girlfriend for not wanting to take that risk after all she had been through previously.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Been there and often wish I'd skipped it. But we had to make all the decisions immediately to schedule surgery.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": ">You're embarrassed that she's not ashamed of her body.\n\nNailed it.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "The character wiki:\n\nhttps://myheroacademia.fandom.com/wiki/Dabi?so=search\n\nAnd probably the look she was copying:\n\nhttps://www.artstation.com/artwork/Xn09Oa\n\nYTA, OP.  Massively.",
          "id": 212,
          "comments": [
            {
              "score": 20,
              "content": "This is the outfit, and honestly I would KILL to see her cosplay 😍 Dabi is my favorite MHA character. \n\nhttps://twitter.com/keigohero/status/1540694823170097152?s=20",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I wouldn't be surprised if she even did a version of him where he had [even more](https://64.media.tumblr.com/d1e0927cded2be81420c34a9acab8196/fb0c0238129c7202-ef/s400x600/35dfff8ebb1071e0e665b9955573868f675d10da.jpg) scars.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Oh, dude, that's fucking awesome!\n\nI'll be honest in saying that I'm a guy who prefers my lady to act a little feminine, but if I were in OP's situation, I'd have offered to help her with the makeup for that.\n\nIf she can successfully pull that cosplay off and be proud of it, that would make me proud of her.\n\nYTA, OP.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 141,
          "content": "Lemme tell you about how cool what she did is. Dabi has a very sad and broken character, he’s son of a big hero and his dad only wanted him because he could be even bigger but, his body can’t handle his powers( blue flames) so if he over use his powers he will burn himself to death. \nSo, he has multiple scars all over his body and face and he thinks he’s scars are disgusting, theres more to the story he’s not a good guy but she probably related to him for having scars and survive them, those scars are proof of resilience for something that could kill you and still go on. \nWhat this man did, is beyond disgusting.",
          "id": 216,
          "comments": [
            {
              "score": 15,
              "content": "Good explanation and if he can’t see that there isn’t much hope for him",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Let's also not forget that a lot of doctors won't do an aesthetic flat closure for a mastectomy either. A lot of surgeons say they do but then they leave extra skin flaps just in case.  So it's not that most women want reconstructive surgery it's that a lot of women aren't given the option to forego reconstruction. \n\n So not only did OPs girlfriend have to deal with breast cancer, at 19 years old, she also had to deal with medical misogyny to get the surgery she wanted.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "As a breast cancer patient who also went flat, I want to hop on this comment to say my onc told me it was about 50/50 on folks who choose reconstruction vs flat. It's not \"unlike a lot of women\". It's not like it's 99% vs 1%. Op is YTA and I am appalled and offended for his gf.",
          "id": 219,
          "comments": [
            {
              "score": 7,
              "content": "My 2nd breast cancer diagnosis was enough to convince me these things were trying to kill me so I too went flat.  Make the best of what you don't have.  So happy I don't own or wear a bra anymore.  Yeah, OP is TYA.",
              "id": 220,
              "comments": [
                {
                  "score": 9,
                  "content": "I am glad I no longer have to wear a bra, too. We gotta hold on to those silver linings where they are for sure. I currently look like gollum with my bald head and pale skin. I miss my long mermaid hair from what seems like another lifetime. But I almost never wear a wig unless it's a special occasion or I feel like it. They are itchy and hot. I refuse to be uncomfortable for society anymore (aka people like OP!!). And hey I save a lot of money on shampoo these days and it helps me stay cool in the summer so.. heh.. silver linings.",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Literally every paragraph gets worse? How?",
          "id": 222,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2670,
      "content": "YTA, and she should find someone who actually likes her.  Thankfully, it seems like she's figured that out.",
      "id": 223,
      "comments": [
        {
          "score": 112,
          "content": "Spot on.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2270,
      "content": "YTA.\n\nYou wanted a sexy cosplay girl and you didn’t get it, so now you’re all upset. You’re embarrassed of HER scars that saved HER life. She deserves better.",
      "id": 225,
      "comments": [
        {
          "score": 356,
          "content": "That’s ok she knows that now too.  Pretty soon Op will be at the curb with the other trash",
          "id": 226,
          "comments": [
            {
              "score": 42,
              "content": "True! And maybe OP will learn a lesson useful in the future!",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "And you just know if he actually dated a sexy cosplay girl he’d then get all possessive and pissy about her “showing off” with her cosplays",
          "id": 228,
          "comments": [
            {
              "score": 69,
              "content": "Definitely getting that vibe.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Then he'll get pissed at people at the con staring at her chest and that she must be trying to get other men's attention. There's no winning with guys like OP, is there.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2143,
      "content": "YTA and a massive one.\n\nScars are part of our lives and hers show she fought and survived. There is nothing embarrassing in integrating scars or other body marks into cosplay. She's SFX artist and obviously skilled in this topic.\n\nThat you expected something \"sexy\" and were disappointed and embarassed is a complete YOU problem. And in case nobody told you before: cosplays aren't automatically meant to be \"attractive\". And instead of standing up for your gf when people staring at her you chose to tell her that you were embarrassed **after** the whole thing.",
      "id": 231,
      "comments": [
        {
          "score": 471,
          "content": "And they might just have been staring because it was awesome SFX makeup!",
          "id": 232,
          "comments": [
            {
              "score": 389,
              "content": "As a cosplayer this was likely very much the case. People who do Dabis full makeup get soooo much attention cause people are impressed not trying to see some skin",
              "id": 233,
              "comments": [
                {
                  "score": 38,
                  "content": "Also her cosplaying Dabi is cool as hell.",
                  "id": 234,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Literally!!!! I’ve had my best interactions as cosplaying Dabi. People love it because it’s such a difficult and intricate cosplay to pull off well",
                      "id": 235,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Right? I really wish I could see her cosplay. I'm sure it was fricking awesome.",
                  "id": 236,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "I was a professional make up artist. I worked things like London Fashion Show where you are doing five full smoky eye looks in what feels like less time than can exist to a precision some surgeons lack and then belting it to another venue with a 40 kilo kit. And I loved it.\n\nAll that. All the wedding make ups, counter sales and psychology side. The photo shoots and budget and 3am starts are nothing compared to the skill I appreciate in SFX. That is science, art, witchcraft and to do a chest piece on yourself using prosthetics mirror image is incredibly mind blowingly difficult. Blending prosthetics on scar tissue is another level. \n\nThat shit is hard as hell. You need way more understanding of the anatomy, dermatology, the chemistry of the products and steely nerves because that stuff is SO EXPENSIVE. Custom prosthetics or latex pieces you create are a one shot thing and can run to 100s per piece. \n\nI sat in on a few classes with a friend and could not fathom the expertise. (Admittedly I am possibly the most squeamish person alive and some of the stuff was so realistic I felt faint.) She loved it and it was her thing. She was absolutely baffled how I could find doing someone’s eyeliner while talking them through a break up and upselling craftily or intuiting what a director meant by Wes Anderson but if Margot Tenenbaum was in a British Nineties teen magazine 5 minutes before a show where the brief had been ‘kohl goes cool but strong lines no smudge’.\n\nI was like ‘yeah but I can bullshit it. You are doing reality. I can interpret that brief and recheck. You are doing specific scar tissue on scar tissue to match continuity? You can’t just pull every editorial artist and stylist’s fuck it button and go *glitter*.’ \n\nI ‘retired’ due to ill health. She works in Hollywood and damn she is next level. I don’t get cosplay until you break it down into micro detail about wigs, make up, textures, fabrics etc and then I’m ‘OH! Makes perfect sense. No idea who Dabi is but you are a details matter to me person. Tell me more…’\n\nBut I’m old. I used to sneak watching MTV when babysitting just to see the make up on music videos and take notes. Half the time the men were wearing the make up which is the only time the male gaze was relevant.",
          "id": 237,
          "comments": [
            {
              "score": 15,
              "content": "Just wanted to say this is such and interesting and valuable comment. I don’t have the background to understand the skill involved here, so you explaining it was really neat and made me appreciate even more what OP seems to have been oblivious to - his gf’s incredible talent",
              "id": 238,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yeah, OP definitely isn’t a fan of anime for the art styles or the storylines. A fan would have massive appreciation for his gfs cosplay, as clearly demonstrated by all the people asking for photos with her. OP is just a creep, a misogynist, a perv. I bet his browser history is horrific.",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "This.\n\nThey were staring because her cosplay was AWESOME. In the true sense. People were in awe.\n\nOP, your gf deserves someone who appreciates her courage and creativity fully.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1644,
      "content": "Translation: I wanted to show off my GF as a 14 yr old's fantasy b/c it would be a turn on for me. Althought I never communicated my expectation, I figured she knew enough about anime to know that is what is expected of her - it is what females are supposed to do at Cons for us, why else would Inhave invited her. \nShe dissapointed me b/c not only did she use her own creativity & skills to do something meaningful for her instead of meeting my sexist and selfish expectations, but her outfit allowed  complete strangers know she is a woman w/o boobies and they didn't like it either.\n\nYes, you are 100% TA.",
      "id": 241,
      "comments": [
        {
          "score": 415,
          "content": ">and they didn't like it either.\n \nCorrection, he *assumed* they didn't like it either. I bet a lot of them were staring bc of the awesome burn makeup she did. And maybe noticed the scars afterwards.",
          "id": 242,
          "comments": [
            {
              "score": 67,
              "content": "Or wondering how the scars were so realistic, given that scars in a cosplay aren't something people assume is real and probably thought it was impressive VFX makeup.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "💯💯💯",
          "id": 244,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Well you fixed his post for sure! So right!",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1100,
      "content": "YTA.  She doesn't exist to be sexy for you.  What the fuck is wrong with you?",
      "id": 246,
      "comments": [
        {
          "score": 317,
          "content": "Mans heard \"cosplay\" and immediately made it about him.",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}