{
  "post content": "I've worked at my office for 8 years. I'm on good terms with management and most of my co-workers.\n​\n\nFive months ago, a new guy was hired on a 6-month probationary period. I'm not his supervisor, but I'm definitely a senior employee. I'll call the guy Ted Faro, because he's a dick.\n\n​\n\nSupervisor was going around introducing Ted to people, and when he got to me said \"This is John\" and described my job.\n\n​\n\nTed: \"Hi, Jack.\"\n\nMe: \"It's John.\"\n\n​\nTed: \"What?\"\n​\n\nMe: \"My name's John, not Jack.\"\n\nTed: \"It's close enough for me.\"\n\nSupervisor: \"His name's John, not Jack. Let's move on.\"\n\n​\n\nThis continued for a few months. Despite reminders from supervisors (when he referred to me when I wasn't present) and myself, he continued to use the name Jack. I finally told him \"You either use my name, or I ignore you completely, no matter what the situation is.\"\n\n​\n\nHis response was \"Sure thing, Jackie boy.\"\n\n​\n\nSince I don't work directly with him, I figured \"screw it\" and that I'd ignore him.\n\n​\n\nRecently he had a 2-day business trip that required car rental. I work late some nights, and Ted came to me and says \"Hey, Jack, I'll be dropping the rental car off at 7 when I get back. See you there for a lift back to the office!\"\n\n​\n\n(they closed at 6 and there's a drop box)\n\n​\n\nAs promised, I ignored him.\n\n​\n\n7:15 rolls around on the night he's dropping off and I get a call. I recognize his number, so I ignored it. He called 7 more times, then starts e-mailing.\n\nThe first one was along the lines of \"Jack I'm at Enterprise. Come pick me up.\"\n\nE-mails pour in every 5-10 minutes, addressing me as Jack, Jack-o, Jackie, and Jackie-boy. The emails also started being laced with profanity and a couple threats.\n\n​\n\nI signed out and went home. It was raining hard.\n\nNext morning, I saw that Ted had sent a few more e-mails. I printed them off. At 10am, he storms up to my desk and  screams \"Where the [f-bomb] were you? I told you when to pick me up! I HAD TO TAKE A CAB! DO YOU KNOW HOW MUCH THAT COST ME?!\" He goes on like that for a bit until his supervisor came and hauled him away and asked to speak to me.\n\n​\n\nSupervisor: \"Ted tells me that you ignored his requests for a pickup when he dropped off the rental. He was caught out in the rain.\"\n\n​\n\nI relayed what happened, and showed him the printed e-mails. I'd highlighted the threats.\n\nSupervisor: \"I can see why you wouldn't want to spend time around him. But it was still kind of inconsiderate to leave him stranded in the rain. That's not the greatest neighborhood and he could have been hurt.\" he sighed and said \"With the threats and him being on probation, he no longer works here. Just try not to be an a-hole in retaliation to your coworkers.\"\n\n​\n\nA few people at the office have commented that I'm the jerk for ignoring Ted and getting him riled up, which got him fired.\n\n​\n\n*AM* I the a-hole on this?",
  "id": 1,
  "comments": [
    {
      "score": 22122,
      "content": "NTA what is that dudes problem? Why on earth would he think it’s okay to not call you by your actual name? Especially when repeatedly asked! The dude sounds like a massive a-hole and I’m happy for you that he no longer works at your company.",
      "id": 2,
      "comments": [
        {
          "score": 9573,
          "content": "Management's pretty glad he's gone, too. An off-the-record conversation I had was that he was likely going to be let go at the end of the six months anyway, but this was a tipping point to ditch him early.",
          "id": 3,
          "comments": [
            {
              "score": 3538,
              "content": "NTA.\n\nI have an easily confused name (Think like Brendan/Brandon, although I'm a female, but this is the best comparison), so I don't do this when people call me the wrong name that's very close to mine. But if someone just starts calling me some random name that just starts with the same letter, I will usually correct them. If they don't pay attention, I will start ignoring them.\n\nYou warned him what would happen. You were very clear. Your supervisor also expressed to him that he needed to call you by the right name. He really can't say he didn't know what was going to happen. It was a little dickish to leave him, but hey, it was just as dickish of him to use the wrong name ON PURPOSE, after you told him not to.",
              "id": 4,
              "comments": [
                {
                  "score": 730,
                  "content": "Wendy/Wanda? Jenny/Jenna? Kirsti/Kristi? Anya/Anna? Brittany/Bethany? Elsa/Ilsa? Lois/Louise?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 893,
                      "content": "Carol/Sheryl",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 411,
                      "content": "Ann/Egg",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 200,
                      "content": "I’m gonna go with Kirsten/Kristen here",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 100,
                      "content": "Susan/Mack? Nicole/Brunhilde? Vivian/kristopherson?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Brendanne/Brandonne probably",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Briar/Friar?  Rose/Nose?",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Mulva",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "KEERsten / KURsten / KAIRsten?  Or KRISten?",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 436,
                  "content": "Yanny/Laurel?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Why did I have to scroll so far to read this?",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Laurel.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 161,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Pam/ Pamm/ Pan",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "This got referenced three times - can you help me understand what it's from?",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 83,
                  "content": "Branda is that you?",
                  "id": 20,
                  "comments": [
                    {
                      "score": 74,
                      "content": "My daughter is Tyler, people say Taylor, which is understandable. Alot of people tho, call her Heather , no where near to Tyler.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "No it's Branda",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "My name is pretty common first name. It’s the same as an actress. And I hate said actress. I’ve been called by her name so many times it’s unreal and even the in patient doc saw that my last initial and hers was the same and freaked out thinking I was her when I’m clearly not. But by far the worst thing I’ve been called was when my sisters elementary school best friend butchered my name so bad that it sounded closer to Oreo with Anna slapped on the end. She still calls me that and refuses to stop.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 7,
                      "content": "[deleted]",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "NTA. Yeah the “oh well jack’s close enough for me” really got me going. He’s either a mindless douche bag or playing power games while being a complete a douche bag. \n\n\nHe’s a douche bag.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Omg, why are so many people trying to guess your name? lol",
                  "id": 26,
                  "comments": [
                    {
                      "score": 5,
                      "content": "HIGHLIGHT OF MY DAY\n\nEdit: I have found two child comments (not direct responses to my original comment, but responses to the top response) that have gotten it right so far. Only two. Haven't informed them publicly but I'll probably message them about it eventually. I feel like Rumpelstiltskin today. It's incredible.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 988,
              "content": "Deliberately not calling you by your name feels like some type of attempted 'alpha' move on his part. IMO you couldn't have handled this better.",
              "id": 28,
              "comments": [
                {
                  "score": 675,
                  "content": "That's what I thought as I read that first encounter. The whole \"close enough for me\" bit just reeked of testosterone-fuelled posturing.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 453,
                      "content": "Then calling him Jack-o, Jackie, what in the name of fuck?",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": "Testosterone or no testosterone. He is just a shitty person.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "> Deliberately not calling you by your name feels like some type of attempted 'alpha' move on his part.\n\nBingo. People trying to be some sorta power trip just because they want to be powerful...in the most pathetic ways possible.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Which is such a fucking stupid move while on a probationary \"new-guy\" period. What a dumbass.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Exactly he was undermining a senior coworker while on probation",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yup. It would have been less obvious if Ted had simply hiked his leg and pissed on John's trousers.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "The idiot was completely doing it on purpose. what an asshat",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It was clearly a power play.  Repeatedly doing it, after being specifically requested not to, and when specifically told that he would not reply?  That was a total Trump-style power move.  No wonder the company wanted to get rid of this guy.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 555,
              "content": "I can understand your supervisor giving you a light reprimand for the incident, but man....fuck Ted lol.",
              "id": 38,
              "comments": [
                {
                  "score": 274,
                  "content": "This is the supervisor's fault though. They repeatedly corrected Ted, saw the behavior was ongoing, and refused to do anything about it. It also sounds like beyond that they already knew he was a problem. They're just trying to shift the blame here.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 102,
                      "content": "[deleted]",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah that ain't happening here. Happens again it's a write up. Again after that you're gone.\n\n\nSimple leadership.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It's a typical step taken by the do-nothing management style: a light, informal reprimand devoid of any \"next step\" context.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I don't think the supervisor's reprimand was warranted at all since Ted was repeatedly asked by his supervisor to call him by the correct name and he was given fair warning that if he did not use the correct name that he would be ignored, Ted even said \"sure thing\" in response when told. If he had a problem with the proposition he should have brought it up then so I see that as an implicit agreement to be ignored when not using the correct name.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 377,
              "content": "NTA this guy clearly has respect issues if he thinks the name issue is funny and THEN when you don't pick up your phone (regardless of what else was going on) he threatens you. I don't care what you did, him emailing you profanity and threats is fireable, nuf said",
              "id": 44,
              "comments": [
                {
                  "score": 134,
                  "content": "Plus, he starts emailing with stupid Jack pet-names.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Lol this was the best part \n\nThe dude not only doubled down but triple quadruple and so on. \n\nHilarious. The guys a real unique one that's for sure",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I would not pick someone up in my car after they had made threats.  Can’t believe the supervisor gave OP any reprimand at all!",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 283,
              "content": "[deleted]",
              "id": 48,
              "comments": [
                {
                  "score": 109,
                  "content": "My first thought was to call him Ned, but I like Todd much better since it’s more obviously wrong while still being “close”, combined with the “Toddler Todd” linguistic killshot. \n\nThis guy had a major problem from the start and honestly management should have sat him down long ago to straighten him out or get rid of him.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'd probably start calling him Judy.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Toddler Todd is just gold. This is the best way to handle it haha.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This! There's an obnoxious version of my name that I hate. If my name was Rook, this would be Wook, for example. The only people allowed to call me that are still knee height. If you're old enough to pronounce my name properly then I expect you to do so. Twice now I've had people continue to call me the real life equivalent of Wook after I've explained I dislike it. The first person cut it out after I called her a cutesy version of her name twice or thrice. \n\nAfter I called the second person a stupid version of his name (Louis became Wee Lou-wee), he decided I was on some dick-measuring power trip and we called each other these stupid nicknames for a couple weeks before he gave up and we called each other by our proper names again. It's 50/50 in my mind whether his supervisor talked to him or he just wore himself out investing so much anger in a feud I was stonewalling (\"please pass the salt, Lou-wee, thanks\").",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 182,
              "content": "Supervisor probably only phrased it like that to cover his and management's ass. This guy is likely doing a total psycho move on them too behind the scenes, threatening to sue them or something. It's annoying that management phrased it like that, saying that he was more in the wrong but that you were in the wrong too (I don't think you were in the wrong at all). Them taking that attitude is probably why you have coworkers giving you shit. But that tends to be how management deals with threatening situations - cover their ass. I honestly think that is all this is.",
              "id": 53,
              "comments": [
                {
                  "score": 3,
                  "content": "Sort of, I wouldn't take such a cynical stance that it is only to cover his own butt.\n\nThe idea in how you want employees to interact when one starts harassing/bullying an other is not to retaliate, but to notify superiors and let them deal with it. Like kids learn in school. In reality it doesn't always work out that way, but this is the environment that policies try to create and would work if everyone would do their job properly. Hopefully with added safety measures/channels if people do not.\n\nFor example the business trip that gets ruined could cost the company as a whole a bunch, which if only one finger could be raised could be pointed at the harasser, but the retaliation also factors in making it worse. I think that is what the superior is trying to point out.\n\nIt managed to work out fine like this this time, but if a similar situation occurs, it would be preferred not to retaliate in this fashion, but to notify superiors of the strain the employee is putting on cooperation. If OP would mention it to his colleges and spread the idea the way to handle situations like that is through retaliation, it could hurt in the long run. If people who think they're justified to retaliate but many others disagree for example or someone actually gets hurt in the retaliation.\n\nI guess you could see it as covering their ass, but you could also see it as taking responsibility (or covering everyone's ass). Taking responsibility and covering your ass can overlap (thankfully), in judging those actions only difference is intent.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 4,
                      "content": "OP didn't retaliate to anything: OP had no responsibility in the matter to drop everything and drive to this \"bad neighborhood\" just because Ted told him to.  Without getting confirmation that this will happen, even: Ted just said \"Be there at 7, Jack!\" and was surprised that he wasn't obeyed.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "NTA. Holy hostile work environment Batman!",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "NTA and his supervisor sucks. He should have addressed this seriously, instead of waiting for you to escalate it. That's his job ; assisting his employees in solving interpersonal conflicts, instead of ignoring them.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Would have also been fun to pick up the phone and hear him out. Then go \"sorry, I think you have the wrong number, there is no Jack here\", before hanging up on him.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "  NTA.   He should've learned your name, asked nicely - not demanded - and given you 48 hours notice.  You have work of your own to complete. I'd tell mgmnt that you'll be nice to people that treat you with the respect you deserve.   Otherwise Karen/Freddyboys aka Entitled Assholes will be ignored.",
              "id": 59,
              "comments": [
                {
                  "score": 8,
                  "content": "Seriously. \"I TOLD you to pick me up\" so fucking what? Is he your father? Do you drive a taxi??\n\nFuck this guy.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 6,
                      "content": " Even a father or taxi driver deserves more respect than he gave.  I don't allow my 3yo granddaughter to speak to me like that.  He forgot the magic words please and thank you at the very minimum. Lol",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1024,
          "content": "> what is that dudes problem?\n\nHe didn't realize he didn't get the role as the main bully in a Disney high school movie.",
          "id": 62,
          "comments": [
            {
              "score": 571,
              "content": "[removed]",
              "id": 63,
              "comments": [
                {
                  "score": 559,
                  "content": "I had an employee like this about two years ago...  Everything seemed fine her first couple of days, but there was another employee she decided to bully this exact same way.  And it clearly wasn't a mistake, she was calling a female employee by a male name that starts with the same letter after being corrected many times (along the lines of Albert rather than Angie).  She even did it in emails; this wasn't even done in a subtle way. \n\nAfter about a week of this, I sat the bully down one-on-one (I'm the manager of the group BTW), and asked why she insisted on calling this employee the wrong name...  She denied everything (even while I was HOLDING the emails in my hand), I kinda stammered \"Uh, I have a lot of evidence to the contrary, so please knock it out\".  She went back to her desk, worked another hour or so, then quietly collected her things, sent an email to HR saying that she was resigning because of poor treatment from management, and that was that...  Some people are baffling, IDK LOL",
                  "id": 64,
                  "comments": [
                    {
                      "score": 247,
                      "content": "Professional victims, man.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 83,
                      "content": "I'm gonna go with narcissism, but that's the armchair internet psychologist in me. You called out her delusion that she could do stuff like that and she couldn't handle it.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Wow, baffling is definitely the right word. And the fact that she blamed poor treatment from management... wow. I guess wow is all I can say! You dodged a serious bullet there. If she couldn’t handle resolving such a simple issue, imagine what other trouble she could have caused.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">  sent an email to HR saying that she was resigning because of poor treatment from management\n\n\"Management won't let me demean and bully other employees, so I am resigning.\"",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "[deleted]",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "> OP is a little bit of an asshole for responding how he did to Ted in that situation\n\nno.",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Ted saved the company untold time and resources by revealing how unhinged the dude was early on.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 551,
          "content": "> what is that dudes problem?\n\nI don't see where he even asked OP to do him a favor?  \"See you there for a lift back to the office!\"  Really?  OP says he doesn't work directly with Ted, so why should OP be put into the position of driving who-knows-where to pick him up?  Unless OP's senior position is \"shuttle driver\" then Ted was completely out of line on multiple counts",
          "id": 72,
          "comments": [
            {
              "score": 219,
              "content": "And apparently Enterprise was unwilling to drop him off, which means he was either outside the branch's service radius, or was such an asshole that they refused.",
              "id": 73,
              "comments": [
                {
                  "score": 92,
                  "content": "The OP said the location closed at 6.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 164,
                      "content": "I know that’s what really happened but my headcanon is that he kept referring to them as Hertz or Avis or something and they just ignored him.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 129,
                      "content": "Either way, you would expect OP's company to pick up the tab for a cab. It's cheaper than paying for 2 peoples wages.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Ted could have called a friend, relative, significant other, etc., but his only option was OP, his coworker who didnt even like him, and had to ask-tell him to pick him up if OP's story is canon. \n\nI think its safe to assume Ted has no friends, relatives, or significant others who want to deal with his bullshit. Maybe he moved out of state for the job, but I'd rather believe hes just the asshole nobody likes.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 391,
          "content": "I’ve got a name that some people confuse with a similar sounding one. Think Tina and Gina. I used to work with an actual Gina and if people called me her name then I wouldn’t respond because it’s not my damn name. We have names for a reason! If OP gets called the wrong one then it’s definitely NTA to not respond. \n\nOP, this is some quality /r/maliciouscompliance right here and I think you’re awesome.",
          "id": 78,
          "comments": [
            {
              "score": 118,
              "content": ">if people called me her name then I wouldn’t respond because it’s not my damn name.\n\nI don't know about that, sometimes people just have a brain-fart. I'm a Mike and I used to sit across from a guy named Matt. Every now and then someone would come to me and ask for Matt and I would just point. More often than not, the person would respond, \"Oops, I meant Mike. Sorry\"",
              "id": 79,
              "comments": [
                {
                  "score": 119,
                  "content": "Yeah, but that’s an honest mistake. When it’s all the time, it’s just downright douchebaggery !",
                  "id": 80,
                  "comments": [
                    {
                      "score": 159,
                      "content": "True. I don't care if someone calls me Mike or Michael. Mickey on the other hand would get a non-response from me as the only Mickey's I know are Mantle, Mouse and the guy who was so fine.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Me and my supervisor look similar (we are both white and have goatees however I groom myself and he's a slob) and have names that start with the same letter. On a weekly basis a new director we have in the company confuses me for him (she even comes to my desk and not his, we are on opposite sides of the room.) and asks me if I have completed a task she gave my supervisor. At this point whenever she asks me something I point towards his desk and don't say a word.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "It’s a form of bullying- it’s a power and control thing.",
          "id": 83,
          "comments": [
            {
              "score": 96,
              "content": "Absolutely. This person was consciously making the decision to disrespect OP every time he refused to use his proper name.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It's true when I was in college I my roommate and people on my floor insisted on calling me Ted, because it was the name of a guy the previous year who basically capitulated to anything they wanted (and they thought I should do that). So I really didn't get to say hello to people, when they said hey Ted, I always replied not Ted, I didn't stay at that school.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "Maybe there’s a page in “Art of the Deal” about using someone’s wrong name to let them know how little you think about them.",
          "id": 86,
          "comments": [
            {
              "score": 91,
              "content": "I have heard it's a popular tactic in Pawnee",
              "id": 87,
              "comments": [
                {
                  "score": 44,
                  "content": "Thanks paul13",
                  "id": 88,
                  "comments": [
                    {
                      "score": 11,
                      "content": "GeorgeLazenbyOnceMore gets it.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 153,
          "content": ">Why on earth would he think it’s okay to not call you by your actual name?\n\nWhat really struck me is the fact that Jack is a nickname for John and is often used by John Jr's. So if your dad goes by John and you are also John, people might call you Jack to differentiate. Its the diminutive form of John, which makes me think coworker was trying to be subtly patronizing.",
          "id": 90,
          "comments": [
            {
              "score": 60,
              "content": "That would work only make sense if he knew his dad was named John tho.\n\nAnd regardless, he and his sup specified John multiple times. Guy was just being a dick.",
              "id": 91,
              "comments": [
                {
                  "score": 11,
                  "content": "It’s not only used for Jrs, and the sorts of assholes who do this don’t care anyway. The fact that it was this particular combo confirms that he is the asshole. \n\nI have a name like this and it happens all the time. Any James, Charles, William, Robert, Richard, Henry, Margaret, or Elizabeth could have a similar story.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Especially by calling him things like “Jackie-boy” - that is so unprofessional and definitely an attempt to be demeaning.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I had an Asian boss who took an American name. He would say his name was John when we were in the LA office and would say his name was Jack when he was on the East Coast. If someone came up to him at a trade show and used the name Jack, he would know where they were from.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This.  \"Jack\" wasn't some random wrong name to begin with like OP and others seem to think.  It was a nickname for John.  Maybe not specifically diminitive, I have a relative John who goes by Jack and he is not a jr.  If not dimunitive, it could be familiar.  Strangers and professionals refer to my Jack as John, only friends and family know him as Jack.\n\nStill, even if the first utterance was off hand, intentionally diminutive or familiar, what a very strange hill to die on.\n\nDefinitely NTA, till we get that justified ahole acronym going.  Its a professional setting, and anything other than being a good little robot is being a bit of an ahole.  A great, fantastically justified one though.",
              "id": 95,
              "comments": [
                {
                  "score": 6,
                  "content": "A diminutive name, which is called a hypocorism, can be any that shortens/mutates the name. Meg/Peg(gy) for Margaret, Tom for Thomas, Jake for Jacob, Abby for Abigail, Jenny for Jennifer. It doesn't have to just occur with juniors.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Peggy comes from Margaret!?! TIL",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Wait, seriously? I’ve never heard of this and both my dad and brother are called John.",
              "id": 98,
              "comments": [
                {
                  "score": 8,
                  "content": "Any historically accurate film or tv show set in the 60s will have at least one reference to JFK as Jack Kennedy. Or, even better, “Jack and Jackie.”",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Calling him junior. Got it.",
              "id": 100,
              "comments": [
                {
                  "score": 6,
                  "content": "Sport",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Right! Like come the fuck on, why is it on OP to be “better man” here? Sounds like Ted walks around being a dick and never gets checked for it, and for not using his co-workers real name he got fired. Lesson learned for him. Something small less to something big and it’s all on Ted.",
          "id": 102,
          "comments": [
            {
              "score": 5,
              "content": "My take on it is OP is being the better man. A lesser person would have picked him up and taken his crap.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "With guy's outlook you know he didn't tip the cab either.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Jack is a nickname for John. My grandad was John but went by Jack for most of his life. But to continue to use it after being adked to stop? Yea that's being an asshole.",
          "id": 105,
          "comments": [
            {
              "score": 6,
              "content": "Same here. Like John F. Kennedy as well. A lot of people call him Jack Kennedy.",
              "id": 106,
              "comments": [
                {
                  "score": 6,
                  "content": "And of course the character John P. Ryan (more commonly known as Jack Ryan)",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I guess, but most people I know use Jack as a nickname for Jacob. And even then it's not unreasonable to not want to accept being called by a nickname.",
              "id": 108,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13716,
      "content": "NTA\n\nOP: If you do X then I'll do Y\n\nTed: \\*does X\\*\n\nOP: \\*does Y\\*\n\nTed: \\*pikachu face\\*",
      "id": 109,
      "comments": [
        {
          "score": 2410,
          "content": "Came here to say this is all that needs to be said. Perfect response. NTA",
          "id": 110,
          "comments": [
            {
              "score": 869,
              "content": "I did the same thing when a co-worker decided it'd be funny to address me as \"millennial\" instead of by my name.\n\nNope.",
              "id": 111,
              "comments": [
                {
                  "score": 494,
                  "content": "People do realize millennials can be as old as their early-mid 30s now right? It's kinda ridiculous to use that term as a description for someone when we're grown adults and the term is very well linked to being a naive child.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 441,
                      "content": "At my last job I got to watch a GrandKaren call my 48-year-old boss a millennial because he refused to give her a refund for food she'd already eaten. It just means 'someone younger than me is disagreeing with me or doing something I don't understand' at this point.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 265,
                      "content": ">People do realize millennials can be as old as their early-mid 30s now right? \n\nIf you're going by the dates they use for the market research headlines you see [i.e. Goldman Sachs, who pays for it], the oldest millennials start turning 40 next year.",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "> People do realize millennials can be as old as their early-mid 30s now right?\n\nThe people who are using it to insult gen-z antics sure as fuck don't",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Yeah I think it's stupid and often misused. Some words change meanings and I get that, but in this case it doesn't make sense.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Bingo. People use the label with negative connotations 90% of the time. But they also do it in a way that suggests all millennials are between the ages of 15 and  22. Bitch I'm 34 years old. Just because I missed the cutoff for generation X don't make me a sixteen-year-old girl chewing bubble gum and fucking off on Snapchat.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I wasn’t even born in the earliest couple of years of the millenial generation, I’m a c-suite executive, and people in interviews or sales pitches still shit talk millennials to me. I’m always super clear with people that not only  I a millennial, but it is also likely that THEY are a member of my generation. I’ve only received an apology once.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "You couldn't just call him Boomer in response? Or 'geezer' or 'my octogenarian friend' or 'greatest generation... wait, no, sorry, the one after that that killed the environment through rampant consumerism'?",
                  "id": 119,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Not worth it. I'm not here to be best friends or coddle ass holes, I'm here to get paid.\n\nBesides it was funnier watching them spend two weeks figuring out why I wouldn't respond to them.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Are you kidding me. I’ll be goddammed.",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 217,
          "content": "Teddy bear threw gasoline on the nuclear reactor. OP was done at this point but calling OP jack and jack something over and over in emails where OP is the saving grace, buddy what the heck",
          "id": 122,
          "comments": [
            {
              "score": 132,
              "content": "Ted was doing it purposely to assert control. To admit to making a mistake is almost impossible for such people. I've known a couple, and admitting to an error or ceding control is, to them, like a wound to their person. Paying for a cab or walking home in the rain is nothing, they will pay almost any price to maintain their illusion of superiority.",
              "id": 123,
              "comments": [
                {
                  "score": 5,
                  "content": "Yep. It’s a sad life those people live.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I bet if he was emailing his work email, it was something like Jackjones@company or in his signature, too.",
              "id": 125,
              "comments": [
                {
                  "score": 7,
                  "content": "JohnJones@company",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Consequences and accountability?\n\nGTFO! 😲😲😲😲😲😲😲",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Why are you calling him \"OP\"? He clearly said his name is Jack.",
          "id": 128,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I agree that OP is NTA, but your formula is dumb. If the original threat is completely unreasonable you would still be the asshole if you followed through.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "\n\n ⢀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⣠⣤⣶⣶  \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⢰⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣀⣀⣾⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⡏⠉⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿  \n⣿⣿⣿⣿⣿⣿⠀⠀⠀⠈⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠉⠁⠀⣿  \n⣿⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠙⠿⠿⠿⠻⠿⠿⠟⠿⠛⠉⠀⠀⠀⠀⠀⣸⣿  \n⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣴⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⢰⣹⡆⠀⠀⠀⠀⠀⠀⣭⣷⠀⠀⠀⠸⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠈⠉⠀⠀⠤⠄⠀⠀⠀⠉⠁⠀⠀⠀⠀⢿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⢾⣿⣷⠀⠀⠀⠀⡠⠤⢄⠀⠀⠀⠠⣿⣿⣷⠀⢸⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⡀⠉⠀⠀⠀⠀⠀⢄⠀⢀⠀⠀⠀⠀⠉⠉⠁⠀⠀⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6845,
      "content": "Obligatory \"play stupid games, win stupid prizes.\" NTA.",
      "id": 131,
      "comments": [
        {
          "score": 1627,
          "content": "Obligatory \"oHmYgOd I hAtE tHaT sTuPid pHrAsE\"\n\nObligatory \"Well it's going to get used a lot in this particular sub because it is often relevant here so maybe get the fuck over it\"",
          "id": 132,
          "comments": [
            {
              "score": 877,
              "content": "Well, um, thanks for getting that out of the way, guys, I guess?",
              "id": 133,
              "comments": [
                {
                  "score": 445,
                  "content": "Pack it up we can go home",
                  "id": 134,
                  "comments": [
                    {
                      "score": 1483,
                      "content": "Yup. Time to go home. Come pick me up, Jack.\n\nEdit: Jackie boy, where are you? I'm ready for my lift home now.\n\nEdit 2: Seriously, Jack of all trades, where are you? I'm ready to leave.\n\nEdit 3: Hey, Jack Off, looks like it might rain. You better come get me soon.\n\nEdit 4: This is a pretty dodgy neighborhood, Jackminster Fullerine, you need to come get me immediately.\n\nEdit 5: Where the fuck are you, Blackjack Mulligan? It's now raining.\n\nEdit 6: Hey, Bojack Horse's Ass. Two punks just stole my messenger bag. Where the hell are you?\n\nEdit 7: What the fuck, Jack Sparrow, I'm going to beat your ass. Come. Get. Me. Now.\n\nEdit 8: Hey, Jackjack, it's INCREDIBLE, that you're not here yet. What's your ETA?\n\nEdit 9: Yo, New Jack City, those punks came back for my wallet and roughed me up a little. You really need to hurry your ass up.\n\nEdit 10: Yo, Jackalope, I was just talking a piss and thought I felt my phone vibrate. Was that you? Anyway, pick me up.\n\nEdit 11: Those punks came back again and now I've been stabbed fairly badly. We may need to stop at an Urgent Care. Jack.\n\nEdit 12: You are in for a world of pain when you finally get here, dijack_snow. So hurry up and get it over with.\n\nEdit 13: Jack jack jackjackjackjackjackjackjackjackkackjackjackjackjackkack\n\nEdit 14: I don't know what the fuck you think you're doing, Jacktoberfest, but if you're not here in the next five minutes I might get an Uber or a taxi or an ambulance.\n\n~~Edit 15: OK. John. I know your name. I'm sorry for the way that I have behaved and I really need your help. Please. Please. I need a ride. I'm hurt real bad. Please. John.~~   \n  \nEdit 16: Really, Snap, Jackle, Pop? You're still not here. I'm furious. I'm bleeding out. I am seriously considering getting a Lyft. I decided I don't approve of Uber's business practices.\n\nEdit 17: I'm getting pretty light headed out here, Jacky Tacky Tavi. I might not make it. I've lost a lot of blood and I'm drinking rain from a puddle. Tell your wife I love her.\n\nEdit 18: So... Are you close or what, Jacklemore?  \n  \nEdit 19: Jackass.\n\nEdit 20: Yo, Jackuzzi, I still need you to pick me up. The Lyft driver wouldn't let me in the car because he didn't want to get blood on the seats. He said Lyft would pay to get it cleaned and charge me but there's a ton of paperwork and he wouldn't be able to drive until after he got it cleaned so that's money out of his pocket. So I'm still here. Come get me.   \n  \nEdit 21: It's getting really late, Jacksonville. I hope you're already almost here. Bortles!",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 123,
                  "content": "Can we get a bot to post this on demand?",
                  "id": 136,
                  "comments": [
                    {
                      "score": 181,
                      "content": "A bot to automatically post \"play stupid games, win stupid prizes\"\n\nA bot programmed to reply to that exact phrase, complaining\n\nAnd a bot programmed to reply to people complaining about using a specific phrase, defending the first bot\n\nUsers lose their comments\n\nThe robot revolution has begun",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 54,
              "content": "Obligatory: EXACTLY just like \"not my circus not my monkeys\" I swear if Karen says it one more time I'm going to lose it. You should literally delete your account for using this because it gave me literal cansir.",
              "id": 138,
              "comments": [
                {
                  "score": 98,
                  "content": "i feel the same way about the use of „karen“. it is so old and beat to death.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 45,
                      "content": "I logged in just to upvote you. I roll my eyes SO hard whenever someone uses it. Same with Chad.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": " I lost a really good friend named Karen, I had a hard time with that meme when she first passed. I'm not a fan of shitting on names as stereotypes jokes. I'm sure others have lost kevins and Chads and beckys etc.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "Many sayings have a similar meaning (e.g., \"You reap what you sow\"), so  I don't think it's going to get used here just because it's relevant. I think it gets used because people think it's cool or sounds clever or something. I don't mind it much but it definitely has that \"It is what it is\" cringe factor.",
              "id": 142,
              "comments": [
                {
                  "score": 18,
                  "content": "it's one of the most snide-sounding things i see on this site.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Its also typically used as an excuse to \"turn off\" your empathy for people.\n\nEarlier today I saw people using it as an excuse for laughing at a guy who got beaten to death on the streets after a carjacking.\n\nOn reddit it seems to be a catchphrase for the despicable.",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I just hate that that when I start reading the sentence, I have to finish reading all 9 syllables even though I know what it's going to say",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2927,
      "content": "NTA Ted got himself fired. You didn't force him to swear/make threats and he could have asked the company for a reimbursement on the cab-fare. I don't know why people think they are entitled to favors (and what he was asking for was a personal favor, not something that's part of your job requirements) from people they're disrespectful to/",
      "id": 146,
      "comments": [
        {
          "score": 722,
          "content": "Yeah, does Uber not exist in OP's location? There are no buses? The guy doesn't have any other friends he can call? He seriously has no way other than OP to get to the office? And he just drops off a rental car in the rain before confirming his pick up (usually a check-in text or phone call, or waiting until the pick up actually arrives)? That's bananas.\n\nThis person would probably last about 5 minutes where I work, because we're not in the habit of handholding adults who should be able to get from Point A to Point B.",
          "id": 147,
          "comments": [
            {
              "score": 235,
              "content": "To add, it feels like a total power move by Ted on OP. Why ask him considering their relationship?",
              "id": 148,
              "comments": [
                {
                  "score": 209,
                  "content": "[deleted]",
                  "id": 149,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Yeah, that's what I was thinking.",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I think you mean John.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "That’s all it was. He was making a play for dominance",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I’m still wondering why OP was the designated driver at all. NTA",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": ">The guy doesn't have any other friends he can call? \n\n&#x200B;\n\nGuys like Ted don't have friends. They only have people who endure them. If Ted called one of those, they would demand compensation in some way. \n\n&#x200B;\n\nPlus, Ted saw OP as a resource, not as a person. He concluded he was entitled to tell John that John was to be there waiting for him because only Ted mattered. No, \"could I trouble you...\" or \"would it be possible...\" It was \"I need a ride. You'll give me that ride. You be there waiting.\"",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Also (in the uk at least) enterprise will totally drop you off where you need to be/ drop you there after you drop the car off",
              "id": 155,
              "comments": [
                {
                  "score": 3,
                  "content": "I'm not sure if Enterprise still has that in their commercials here, but it used to be there. I think it's that he dropped the car off after closing.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Not to mention he could have just used the correct name and everything would have been resolved",
          "id": 157,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2031,
      "content": "[deleted]",
      "id": 158,
      "comments": [
        {
          "score": 1412,
          "content": "It *was* a bit unprofessional. But I was also sick of a newbie being a dick. \n\nThough the people who think I'm a jerk are mostly the ones who I don't have the best work relationship with anyway.",
          "id": 159,
          "comments": [
            {
              "score": 1085,
              "content": "I don't understand how this was unprofessional. Just because *sometimes* you work late doesn't mean you're available to go pick up coworkers who are not on work time (I'm considering this is off the clock since Ted is no longer at conference and has dropped rental car off). \n\nYou never agreed to go get him and you weren't told by your supervisors to do so. His assumption that talking to you and telling you to get him was your agreement, tells you how much of an asshole Ted actually is.\n\nIf I were you I'd pull your supervisors aside and let them know that they perpetuated a hostile workplace by not sitting this dude down the minute they had to correct him 2x about your name. *Especially* since he did it when you weren't even there! \n\nThey're basically saying \"Well since we didn't deal with this everyone has a sour taste in their mouth cause this guy had to be fired because we let an easily fixable situation continue.\"\n\nNo. Nuh uh. Nope.",
              "id": 160,
              "comments": [
                {
                  "score": 797,
                  "content": "Or simply say \"he asked Jack to pick him up. I'm not Jack.\" End of story.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 258,
                      "content": "And then perform the hardest Dab ever. Completely. Un-Ironically. And just walk out of the room and putting on some sick shades.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 210,
                      "content": "I think this is the best response to his boss. \"He asked Jack. Since I'm not Jack, I assumed JACK had it covered.\"",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "If the DBCW had just apologized after the first 15 times and said \"John, I'm sorry for the jokes, I really need a lift\" I would lean towards OP being the AH if he left DB stranded in the rain  But that didn't happen. What a twat. Total NTA situation here. \n\nAlso: is there a reason the cab couldn't be expensed to the company?",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "\"Hey I thought you said you were picking up Ted?\"\n\nNah Jack has it covered.",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 196,
                  "content": "Honestly the name thing sounds like some bizarre power play that super backfired on Ted.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Can confirm. Had a classmate that called me Malakai because I \"look like a Malakai\". They pulled this shit in an effort to get me \"beneath\" them since I outperformed them in every subject (we usually fought for 1st and 2nd best in class)\n\n\n\nA semester in and literally everyone in class called them out on their shit. Rest of our school years together the classmate in question spent their time with people from other classes. They also decreased academical performance substantially by year 3.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "yeah, its definitely a power play raventhebridge.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Take it from me, don't take bullshit like this, it only begets more bullshit. And at least your coworkers know if they are assholes towards you, they shouldn't expect any favors. Fuck you, Ted.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Definitely a powerplay, especially  with  Ted  demanding  being  picked up.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "The fact that he wasn't directly told to do this by a supervisor is probably the most important point here. With that being the case, Ted literally had no confirmation from anyone that someone was coming to pick him up, and therefore no right to complain.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "> If I were you I'd pull your supervisors aside and let them know that they perpetuated a hostile workplace by not sitting this dude down the minute they had to correct him 2x about your name. Especially since he did it when you weren't even there!\n\nThis right here. It's completely unfair for your boss to call you inconsiderate when it's his fault for not correcting the shitty behavior in the first place.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Exactly. The people who are saying OP was a dick are victim-blaming. Honestly if OP were a woman and Ted was making sexist comments, it would look much obviously worse.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I get everyone's point here - I totally do. But to be honest....OP never agreed to actually pick Ted up and Ted made an assumption based on no confirmation. \n\nIf you were to ask someone to pick you up - wouldn't you wait for a verbal confirmation that that is what is going to happen? Most people would consider someone making that type of assumption without a response as an asshole. \n\nYeah, OP could've answered the phone but why concern himself with something that's none of his business? He never agreed and he was working...on stuff he is getting paid to do. I got to say I screen calls at work depending on what I am doing. If I know it is going to be a long convo, a short useless convo, etc. - I don't answer if I'm in the middle of something that it'll take me a while to get back into. \n\nYou can also only be as professional as the place you work. OP tried to be upfront with Ted, Ted ignored him multiple times. Others tried to say something..ignored. Nobody cared to sit down and talk about how purposively misnaming someone undermines their position at the company and how seriously they are taken by their co-worker. \n\nIt may just be me but I've been in situations where I'm being mistreated (not blatant stuff, little comments that eventually add up) and I've been beyond professional. Told myself water off a ducks back - the comments escalated - couldn't take it anymore and reported it. Nothing was done...I confront person. They stop for a while then start again. It's exhausting. You don't want to see this person, deal with them, etc. Nobody cares that these things make you feel like poo. \n\nI guess what I'm saying is - these are my lenses but I appreciate everyone else's lenses too cause we all have different experiences.\n\nsorry - I write a lot but I've had some bad workplace experiences that reek like this situation and I hate that workplaces allow this.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": "I suppose it wasn’t professional, but he really deserved it. It says something that the emails continued to address you as Jack repeatedly. He must have known things would have been different if he’d deigned to use your name. Is it part of your job to pick him up? Because if not, I don’t think I’d even go so far as to call the behavior unprofessional. Your coworkers don’t seem to care that he was deliberately disrespecting you.",
              "id": 175,
              "comments": [
                {
                  "score": 82,
                  "content": "The fact that Ted didn't take the time and reflect and finally call OP by name to get them to pick him up just shows how little respect there was in this relationship.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "It's extremely unprofessional to refuse to use someone's name, especially when told.",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "You're already NTA.\n\nbut for amusment...\n\nINFO: Is your work email something like JOHNLASTNAME@Company.com",
              "id": 178,
              "comments": [
                {
                  "score": 73,
                  "content": "and here is where we find out his last name is Jack",
                  "id": 179,
                  "comments": [
                    {
                      "score": 47,
                      "content": "john jacob jingleheimer schmidt",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 74,
              "content": "[deleted]",
              "id": 181,
              "comments": [
                {
                  "score": 21,
                  "content": "Professional seems to mean doormat here.",
                  "id": 182,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "In a corporate setting, even with hostile settings with coworkers maintaining professionalism raises the company's reputation and your own reputation. I understand OP had to do this and it was right. The situation here is a lose-lose situation. Professionalism means maintaining your composure always despite environmental influences. \n\nI worked at some hostile work environment so I would always get hostile in response but when I maintain composure and acted professionally, I really found myself happier. Not giving shit about your coworkers because they were being hostile still doesnt mean being unprofessional is right. It can get stressful putting on a face but to build your experience and reputation, professionalism is a must, especially since you are representing the company's image when you are working under a company.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 72,
              "content": "I'm still trying to figure out why it was on you to pick him up at the first place.  Was this a prior arrangement?  Whatever your job is I'm sure it's not company chauffeur.",
              "id": 184,
              "comments": [
                {
                  "score": 16,
                  "content": "That’s the biggest question I had too! “Hey dude I’m flying home next Sunday so pick me up okay?” No response “dude where are you???”",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 63,
              "content": "Is picking up people even part of your job description? Otherwise, why do folks expect this from you just because you're working late?",
              "id": 186,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah like surely the point of working late is to work, not drive around town picking people up.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "You could have driven down there, but refused to unlock the door until he said your name correctly. ;)",
              "id": 188,
              "comments": [
                {
                  "score": 124,
                  "content": "Honestly, given what happened I think that would have ended with Ted punching out his window or something.   \n\n\nNTA, but I probably would have sent a reply to the second email that said \"I didn't agree to pick you up. Take a cab.\" and then I would have ignored all further communication. There's unfortunately a gap between being morally in the right, and being professionally in the right. Sometimes there are things that are absolutely defensible that will still get you in trouble at work.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Or a reply that says something like \"I'm not sure who agreed to pick you up, but I'll make sure to forward all these messages to every Jack in the company to make sure he sees it and picks you up\"",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You want a true power move? Drive down there, crack his window and say you didn't agree to pick him up and then peel out of there.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Or just responded to the email with \"there's no Jack here, you have the wrong email, sorry\"",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "\"Say my name, bitch.\" hehe",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Its not unprofessional at all. Any manager that thinks otherwise does not understand or does not care about respect in the work place.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Honestly, if a coworker had a story like this and relayed it to me, I wouldn’t think worse of them.",
              "id": 195,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": ">unprofessional\n\nit's not - from my understanding of what you wrote, you're not expected to be on call, least of all to someone who's not even your senior. the fact that you are working is neither here nor there with respect to giving someone a lift - that's not in your job description, so it's NOT unprofessional!",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 149,
          "content": "I guess it kind of confuses me that OP was expected to do this. It seems like the guy assumed OP would do it without any sort of confirmation. It’s reasonable that OP might not have had access to their phone or email for a couple hours in the evening so like... would OP still be the bad guy if they hadn’t purposefully ignored this dude? \n\nI guess it rubs me the wrong way that the manager expected OP to pick this person up even though they apparently never agreed they would.",
          "id": 197,
          "comments": [
            {
              "score": 89,
              "content": "Yup, the only person being unprofessional was the one who:\n\n1: Demanded to be picked up\n\n2: Assumed without confirmation that he was being picked up\n\n3: Didn't make a backup plan, for when the person who didn't respond to him didn't pick him up\n\n4: Screwed himself and blamed someone else, complete with threats!",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Right? Even with a co-worker I'm \"friends\" with I'd be a little wary of picking them up on my own time with my own private vehicle if it wasn't my job description. Often times work insurance is null as soon as you leave the building; imagine if they got in an accident and this dick bag tried sueing?",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "Unless it was somehow part of OP's job to pick him up, OP had no professional obligation to pick him up.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Dude, demanding rides from coworkers is the unprofessional thing. OP never confirmed a thing, it's on Ted for assuming he'd take him home.\n\nOn another note, doesn't Ted know _anybody_ else that could have gotten him? That's pretty sad now that I think about it:/",
          "id": 201,
          "comments": [
            {
              "score": 13,
              "content": "THIS. \n\nIf the asshole needed a ride home he should have called a friend or family. \n\nIf he rented a car for something business related and needed a ride home then he should just expense the cab ride and get reimbursed.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "[deleted]",
              "id": 203,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "But you know damned well, nobody in the office will call him Jack.",
          "id": 204,
          "comments": [
            {
              "score": 97,
              "content": "[deleted]",
              "id": 205,
              "comments": [
                {
                  "score": 4,
                  "content": "I'm proud of Jason.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "> it kinda backfired, didn't it?\n\nIt also got Ted fired, though, and his shenanigans probably just would've gotten worse over time, and by then his probation may have ended, so I would count this as a bullseye.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "No. It was not OP’s job to pick the guy up. The guy just told him to do it. Not asked. Told.\n\nActually, he told Jack to do it. And Jack doesn’t fucking work here.",
          "id": 208,
          "comments": [
            {
              "score": 5,
              "content": "Well actually Jack DOES work here but he's been sick for the past 6 months because he knew Ted would be there. However he knew that John would get him fired so he switched nameplates to confuse Ted.\n\n\n\n\nNeedless to say Jack is a master tactician.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "i dont know.  theres a limit to \"professionalism\"\n\ni think theres a point you got to stand up for yourself and do something about it, even if others dont agree. \n\nsome people may think less of him, but i would respect him more.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "> NTA, but it wasn't professional. And if people in the office now think worse of you because of this, it kinda backfired, didn't it?\n\nIn my opinion, they did not have a professional relationship. I know some who work in the office/corporate world wont agree with this, but this dude had shown OP a ridiculous amount of disrespect that management had obviously known about and had not put their foot down about. That shit is not ok and is not condusive to a professional relationship. \n\nIn my opinion, it's management's fault(as well as Ted's obviously)for allowing this continue and *letting* this walking unprofessional catalyst fester.\n\nIf I had heard one of my co-workers had done this exact thing, I would have the utmost respect for them as a result.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "While it may have been unprofessional, it wasn’t his job to pick him up.  He wasn’t at work.  This was OPs personal time.  This was a personal favor he was expecting and didn’t even have the courtesy to ask if he was available to do it.  Just says he’ll see him at 7, as if it’s his job to chauffeur him home.   So really I don’t think professionalism plays into this.  \n\nUnless there was some work related obligation for OP to pick him up, the idiot is an adult and is capable of figuring out how to get home.  Most of us adults experience unexpected situations at some point in our lives.  We figure it out.  \n\nWhat really gets me is that he continues to use the wrong name even in his emails while he’s threatening the person he expects to give him a ride.  It’s like he’s doubling down....or he is just a monumentally stupid asshole.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1699,
      "content": "NTA. Your name is John. Those emails were to Jack.",
      "id": 213,
      "comments": [
        {
          "score": 223,
          "content": "best answer in the thread",
          "id": 214,
          "comments": [
            {
              "score": 12,
              "content": "Yeah you’d honestly have to be delusional to keep calling him Jack even when it came to that. That guy’s got a screw loose. \n\nNTA",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "John is cool and NTA.  Jack on the other hand is an incredible asshole.",
          "id": 216,
          "comments": [
            {
              "score": 7,
              "content": "Assuming that jack agreed to pick him up and then left him out in the rain, then yes. Otherwise Jack might have been asleep or drunk or maybe his phone was dead. Some people have speculated that Ted was asking Jack for a favor at the last minute, in which case that's not on Jack at all.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Hey, don't drag Jack into this, he's done nothing wrong.",
              "id": 218,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Well I for one, think that Jack is a pretty cool guy.",
              "id": 219,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "“I’ll forward your emails to Jack.  Hopefully he comes and picks you up.”",
          "id": 220,
          "comments": [
            {
              "score": 7,
              "content": "That would have been the perfect response. And then even HR can't really say anything against you.",
              "id": 221,
              "comments": [
                {
                  "score": 7,
                  "content": "Can someone who works in corporate validate this as a legit response?? It seems like HR could for sure nail you if you responded as such.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I don't work in corporate but if you say you're going to forward the emails to Jack and then don't then that is obviously malicious. Now if Jack actually works there and you forward the emails then that seems reasonable to me.",
                      "id": 223,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1682,
      "content": "[removed]",
      "id": 224,
      "comments": [
        {
          "score": 388,
          "content": "Agreed, OP Nta. It is not hard to call someone by their name. He repeatedly purposely called OP by the wrong name. Idiot is immature with high school jock mentality and act like some primitive to exert animal territorial dominance.  Go to HR. Also, be careful and stay safe, because he sounds unhinged. Don't want OP end up on the news.",
          "id": 225,
          "comments": [
            {
              "score": 20,
              "content": "For months! I get maybe a few days or weeks if they don’t interact a lot. But months! And as a new guy at work, that’s super idiotic. I have a very uncommon name that a lot of people change to be something more common, but not maliciously, if someone gets it wrong on purpose for months with multiple corrections, that’s unacceptable.\n\nPlus, the dude was emailing him, what are the odds that his name is somewhere in his work email address or signature or something? No excuse. And he called his phone, which probably has a voice mail, which says his name. What a douche.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Couldn't agree more. I personally would've been more of a bitch about it after asking repeatedly to call me by name - I would've started calling him anything other than Ted....Tina, Myrtle, Ursula......\n\nOP is definitely NTA here and saved the company a huge headache down the road!",
          "id": 227,
          "comments": [
            {
              "score": 6,
              "content": "There problem with that is it means you have to be just as immature as Ted in that case, which is depressing. NTA",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Agreed! Don't respect me, fine. Don't ask for my help then.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I would have probably laughed as he was screaming at me, then turned away and continued doing my work. Straight up the best thing you can do when someone else is blowing up. Like throwing jet fuel on a fire.",
          "id": 230,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "He even wrote every email calling him a variation of Jack. When he was desperate for a ride. What kind of idiot is he???",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 920,
      "content": "NTA, your supervisors should have dealt with this properly to begin with before it escalated like this, but you shouldn't be expected to take that kind of harassment. \n\nYou should have escalated it to begin with though.",
      "id": 232,
      "comments": [
        {
          "score": 229,
          "content": "If OP went to HR over being called the wrong name, he would have it on file, but the HR person would consider them a douche. OP handled it like an adult and Ted had to deal with the consequences. F Ted.",
          "id": 233,
          "comments": [
            {
              "score": 197,
              "content": "No, if the person is regularly doing it intentionally out of spite in the face of repeated reminders from multiple people that it's inappropriate, OP would not be a douche.\n\nOP handled it in a way that wasn't unreasonable, but they did have an alternative available that also would have been reasonable, and without a documented problem, some places would have fired both, depending on local laws and labor agreements.",
              "id": 234,
              "comments": [
                {
                  "score": 109,
                  "content": "Unless OP's job is to drive people around, then I don't see how NOT driving someone when he never agreed to it can be an issue.  \n\n\nThat said, some places can fire you for sneezing too loud, but in any case it is not a place worth working for and it doesn't seem to me that OP is the kind of person that would rack up tenure in such a toxic work environment.",
                  "id": 235,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I tend to agree, but the way it's written, it does seem like there was some sort of reasonable expectation, which may just be poor interpreting.",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "How could John be fired? It wasn't his job to pick the guy up to begin with and he never agreed to do so.",
                  "id": 237,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "What?\n\nThis isn’t just, oh he got my name wrong once or twice, this is obviously a deliberate effort by Ted to mess with John.\n\nIt’s literally HRs job to deal with this. Let them do their job. HR may not always be effective, but it’s not childish to depend on them- and often things can be handled better for an employee’s career if they work with HR rather than in spite of them.",
              "id": 238,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "People *greatly* overestimate how helpful HR is in cases like this at most organizations. I agree, you take something short of full-blown sexual harassment or leaving a noose on your desk to HR, you are going to be “that guy” very quickly.  Trying to argue a hostile work environment over something this petty...despite how gaping an asshole Ted was...isn’t going to be viewed favorably.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah the minute he said \"Jack is close enough\" that should've been enough right there for management to can him. Respect is important for every employee in a business.",
          "id": 240,
          "comments": [
            {
              "score": 4,
              "content": "I mean, at that point, it might be attempted and failed banter, but the second it goes to an obvious office power move, it should have been in writing.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 607,
      "content": "ESH,\n\nbut i approve.\n\nr/pettyrevenge",
      "id": 242,
      "comments": [
        {
          "score": 373,
          "content": "People don’t seem to understand you can be an asshole and someone deserve it.",
          "id": 243,
          "comments": [
            {
              "score": 290,
              "content": "[deleted]",
              "id": 244,
              "comments": [
                {
                  "score": 58,
                  "content": "I disagree. This is a moral judgement sub and I think esh should be reserved for cases where both parties are clearly in the wrong. If what OP did was justified then the other party should be considered *the* asshole of the situation, even if the OP didn't pick the most perfect response.",
                  "id": 245,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I agree with you. It's am I ***THE*** Asshole, not am I an asshole.   \n\n\nTo me, even if you were an asshole, if you were justified you are ***AN*** Asshole, but not ***THE*** Asshole.  \nESH, to me, is when both/all people are equally to blame and equally assholes.\n\nAnd YTA for when YOU are ***THE*** Asshole.",
                      "id": 246,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Many people don’t read the Auto Moderator comment and think the only responses are NTA and YTA.",
                  "id": 247,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Op gave multiple chances for ted to turn his act around and call him by the right name. Still was ignored even when ted had to rely on op for something. This is no worse than someone ignoring a kids request until they stop throwing a fit and asking nicely for something. Is the person an asshole in that situation? No. So it’s the same here.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "ESH kind of implies somewhat equal assholeness between two or more parties and sometimes that’s not the message you want to get across,",
              "id": 249,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Yeah. I understand why the boss said what he said. \n\nI personally think fuck it, and fuck that dude. But I’d probably just be like “yes sir, won’t happen again” and move on with my life",
              "id": 250,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "See I was gonna say ESH till I went back and read that OP explicitly told Ted that he was going to ignore anything he says if he does not use OPs real name. OP set the rules and Ted refused to follow him. \n\nAlso the fact that OP never actually agreed to pick Ted up, Ted just assumed because he told OP that OP was gonna do, even though OP never said a word.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Why is it an asshole move to ignore a request to pick him up?  Are we obligated to help anyone who asks?  Even jerks?",
          "id": 252,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 434,
      "content": "NTA He was forewarned after several friendly warnings that if he didn’t call you by your actual name that you would ignore him. If he was desperate to get a lift from the rental place, he would’ve used your actual name.",
      "id": 253,
      "comments": [
        {
          "score": 320,
          "content": "I know right. I bet that if he had sent a single email saying “please John come pick me up” he would have.",
          "id": 254,
          "comments": [
            {
              "score": 382,
              "content": "You got it. It's not too much to expect base-line courtesy.",
              "id": 255,
              "comments": [
                {
                  "score": 164,
                  "content": "What the heck is wrong with your managers/supervisors that it even got to this point?  If Ted's such an idiot that he can't use a coworker's name, this doesn't bode well for working/client relationships.\n\nThe fact that the supervisor would even throw shade at you despite seeing Ted's *threats* makes me think you should find a new job with more competent management",
                  "id": 256,
                  "comments": [
                    {
                      "score": 18,
                      "content": "yeah, the supervisors/managers aren't doing their job nor did they appear to question ted as to why it happened in the first place.  \"john, that was inconsiderate of you.\"",
                      "id": 257,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I mean, he was only there for less than 6 months, he was gone the first time he did something worthy of firing. They could have written him up beforehand, but you can't fire someone because he's too dumb to learn a name. \n\nHe sounds like a narcissist.  No matter how many people correct the name, the information is coming from someone other than him, so it doesn't stick. I think it goes beyond him just being a dick, he straight up believe ops name is Jack because that's what he heard the very first time, immidiately being corrected felt adversarial so he dug in and convinced himself he was right. Not once calling him by his real name through the entire begging him to show and progressing to threats indicates more than stubborn rudeness to me.\n\nRegardless, sounds like he needs to be talking to somebody but without a job probably won't. Kind of sad that people are either too dumb or too mean to function.",
                      "id": 258,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "I was going to ask if you would have responded if he called you by name. Now I know. NTA from me. I make up nicknames for people, but if they ask me to stop, or if I sense any discomfort, I cut it out immediately. It's all in good fun. This guy sounds like an ass.",
                  "id": 259,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It might have been fun to answer the phone, say that there was nobody by the name of Jack there, and hang up, too.",
                  "id": 260,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}