{
  "post content": "I (24 F) got engaged to Derrick (30 M) one month ago. Prior to that, we had known each other for six months. I know that’s not a long time, but when you know, you know. We are madly in love and ready to commit ourselves to each other fully. \n\nMy sister (26 F) has a problem with that though. She was supportive of my relationship with Derrick before we got engaged. When I sent her a text telling her we were engaged, she responded by saying “congratulations.” But then when I saw her the week after that, she got all serious and said I should strongly consider the marriage. \n\nShe told me I was young and could meet people I loved more. That was offensive to me because I love Derrick more than anything, and she’s basically saying my love isn’t that important. She also told me that Derrick and I could date for longer before we got married. But we are already fully committed to each other, so we might as well get married and be recognized as soul mates in the eyes of the law. \n\nAnyway, the conversation was so hurtful to me. I eventually asked her, very directly, “do you support me marrying Derrick?” She said no. So I stood up, told her she shouldn’t be at the wedding if she didn’t want us to get married, and left. I haven’t talked to her since, although she has texted me multiple times asking to talk. \n\nDerrick and I were working on the wedding guest list yesterday, and we both agreed my sister should not come if she doesn’t support us. So we are planning not to invite her. I mentioned this to my friend yesterday, and she pointed out that it may be a little rude of me not to invite her. So, AITA for not inviting my unsupportive sister to my wedding?",
  "id": 1,
  "comments": [
    {
      "score": 59977,
      "content": "YTA. You have not known him long enough to actually love him, you are infatuated. On top of that you are ready to ruin the relationship with your sister for a guy you actually do not know?\n\nEdit: The fact that he is ready to allow for estrangement is very concerning.\n\nSecond edit: Narcissists and abusers like to isolate their victims. That is my concern regarding him encouraging the rift with her sister.",
      "id": 2,
      "comments": [
        {
          "score": 28163,
          "content": "That stood out to me. Someone who’s 30 should/would understand that a 6 month relationship jumping to marriage is odd, even if they happen to be one of the few people where it ends up working out. \n\nThe age gap is a little sus too, there’s usually a lot of growth between 23-30. It’s not the worst in terms of gap, but it raises eyebrows. \n\nA mature 30 year old would say “she’s you sister, she has a right to be concerned, she doesn’t understand our relationship..” or whatever. He’s really quick to jump on the “isolate you from your family” train and that’s concerning. Sister being concerned isn’t toxic or unusual, any adult would see that. They both sound childish and not ready for marriage.",
          "id": 3,
          "comments": [
            {
              "score": 16253,
              "content": "\"Madly in love\" and \"recognized as soulmates in the eyes of the law\" told me the sister is right to be concerned. And I'm concerned with a 30yo going along with this fantasy. Best case is that he himself is a bit simple...",
              "id": 4,
              "comments": [
                {
                  "score": 6552,
                  "content": "100% bet that the soulmate line is something he said to her before. Also she claims THEY NEED to get married so they can buy a house or case one of them gets hurt… so reason to rush into marriage. Clearly doesn’t understand you don’t need to be married to do that, and it’s definitely a Tactic for him to Convince her to marry him right away. I definitely feel that as soon as they get married, she will be isolated more.\n\n\nPlus in the comments she said that her relationship is who she is?!?!? I pray that she listens to her sister and at least wait for marriage.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3104,
                      "content": "I'd really love to know how many times he's already been engaged prior and how many women he's said \"you're my soulmate\" to in hopes that they'd fall for his shit.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 650,
                      "content": "yeah i’m hearing the echoes of lovebombing MAJORLY in this post, especially taking into account the estrangement piece.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 609,
                      "content": "6 months means that they probably haven’t even lived together for 4 months. Derek is probably still on his “best behavior” the real nasty traits haven’t come out yet",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 386,
                      "content": ">100% bet that the soulmate line is something he said to her before.\n\nYeah, that is where OP lost me as well. Something tells me she has started just parroting things her fiance tells her and basically they have adopted the 'if you're not with me you're my enemy' mindset ... sister was an easy target for raising a question ... but who will be next?\n\nYTA",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 330,
                      "content": "They can buy a house and both be on the deed, even if not married & can have living wills that designate one another to make important decisions on their behalf — the fact that OP doesn’t know this is concerning.\n\nI bet she’s pregnant before they’ve known each other a year, and, within a year of that, back here to ask AITA for expecting my husband to help with childcare/housework/paying the bills/etc.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 202,
                      "content": "I’m going with his credit is absolute garbage and he needs her to be able to secure a mortgage.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Same here. As I was reading this, I could practically hear an unspoken “He completes me.” This situation has all of the elements of infatuation/unhealthy attachment. If there was real love and caring, the last thing anyone would want would to do is encourage division.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Also that whole bit about the sister effectively saying her love isn't important. I think that was the exact opposite of the sister's point. The sister wants her to marry somebody she has picked above all others, not a guy who could realistically still masking who he really is.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": ">in the comments she said that her relationship is who she is?!?!? \n\n\nOof, that's where Rebecca Bunch was before she got better.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "we found the reason for the engagement... he need a co-signer lol",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 779,
                  "content": "“Recognized as soulmates in the eyes of the law” 100\npercent screams “not ready to get married.” \n\nI’m 39, have been married for over a decade, and have a very happy marriage. Big fan of marriage over here. But being married makes you “Recognized as responsible for one another’s debts in the eyes of the law.” The law doesn’t give a shit if you’re soulmates or not.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 401,
                      "content": "After my second divorce, marriage felt a lot like \"I'm trusting you not to tank my credit score\"",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Debt in the eyes of the law is far more accurate 😂",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This exactly. I would call myself and my husband TEAMmates in the eyes of the law. Marriage isn't just some lovey-dovey BS, you are literally forming a team for Living.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yep. I wonder if this is her first relationship or if she's just so infatuated she's not thinking straight.\n\nWaiting to get married isn't a question of whether \"their love is real \", it's making sure that you're not being love bombed by an abuser or at least make sure that you're actually compatible and not on a new relationship high. \n\nSomeone who's been in a relationship before should know that that first few months to year isn't always an accurate representation is like. The shiney new love feeling makes you overlook A LOT that would actually drive you bonkers if you have been with them for years.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 697,
                  "content": "That’s the phrase that made me cackle - “Soulmates in the eyes of the law”! hahahahahaha!!!",
                  "id": 21,
                  "comments": [
                    {
                      "score": 509,
                      "content": "Last I checked the law does not recognize \"soulmates\" lol",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 181,
                      "content": "I'm slightly high and it gets funnier the more i read that back in my head.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Lawfully soul-bonded",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "That was the line that made me see that OP is nowhere near mature enough for marriage.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 400,
                  "content": "Exactly.  Those are terms use by a 16 year-old that has no clue what a serious relationship is really like.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Or someone who thinks Joker and Harley Quinn are “goals”!",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 361,
                  "content": "Those terms stuck out to me. While feeling that way is wonderful, it definitely suggests that early infatuation and not a mature relationship ready for that commitment.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 328,
                  "content": "My immediate thoughts when I read \"madly in love\" is that he is love-bombing her. Once she's married to him and isolated from her family he will have her trapped.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I'm madly in love with my boyfriend  too, we were fwb for a year, then became officially in a relationship & on Wednesday we will have have been living together as a couple for  another year & we're still not ready to jump into a marriage!",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "It's worth remembering that \"mad\" is a synonym for \"literally out of your mind.\"",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 245,
                  "content": "Yeah, the sister loves op enough to tell her something hard that she knows op doesn’t want to hear but desperately needs to. YTA, op. Listen to your sister.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Right? This reads so much like \"But daddy I love him\" from a bad romance movie. Idk how OP can't hear it as soon as she says it",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Something tells me this isn’t the singular situation in which OP has run into a situation with hair on fire. Maybe its travel plans, or a hobby, a job or some other general life plan. I might be reading into things but the way its described, I am getting vibes from the wording that this person might get extremely passionate about things more than just this once. And maybe sister is just thinking this shouldn’t be another one of those. Either way, OP YTA for not even listening to a valid concern and ready to create a rift over it.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "I wonder if you have to get a super-special marriage certificate for being soulmates. I don’t remember it being an option when I got married!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yes but it’s only available to immature starry-eyed 24 year olds who are so infatuated with an older man that they haven’t the slightest clue as to how real life relationships work. You were obviously too mature to be offered it!",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Yeah, the soulmates in the eyes of the law also jumped out at me.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 890,
              "content": "The age gap would’t have been bad at all if both of them weren’t ready to estrange the sister over this without even talking to the sister when she wanted to talk again after the argument. Like I feel the guy especially should understand as a 30yo why a 6 month relationship makes it question and tbh I would have thought the same as the sister “maybe you’ll love someone else more” but OP got the rose tinted glasses of love rn",
              "id": 38,
              "comments": [
                {
                  "score": 92,
                  "content": "Agree!! Definitely should be able to understand where she is coming from as a 30 year old",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "The immaturity of OP not being willing to even TALK to her sister is very telling.\n\nIf she can’t negotiate a relationship with her own sister over a disagreement, she is not going to be able to handle anything a marriage will throw at her.\n\nI’m going with YTA, but it’s more like “you’re the naive child”",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Tbh I think a 24 year old should be able to understand that too",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 707,
              "content": "Also, the sister wants to talk. Maybe have another conversation before locking her out completely. OP sounds impulsive and I think her sister knows that, hence cautioning her about this marriage.",
              "id": 42,
              "comments": [
                {
                  "score": 212,
                  "content": "Not to mention that being 100% committed to each other is still different from 100% living together. You can be 100% committed to someone you're not married to and/or living with -- after all, she already said they are!",
                  "id": 43,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Agreed! Why get married. They can be committed and live together. If it doesn’t work out. Go their own way. Divorce is a horrible thing to get into. She needs to live more of her life.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 649,
              "content": "Cutting her out really only makes the sister’s concerns *more* valid tbh.",
              "id": 45,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah. OP doesn't understand that her flippant attitude & immature reasons is actually not going to reassure anyone with concerns about her shot gun relationship",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 536,
              "content": "Or better “Your sister doesn’t know me.  Let me get to know her better”  rather than “ok, shut her out”",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 320,
              "content": "Yea I find it very concerning he wants to marry that early on. I’m dating a man who is also 30 and I said I require being in a relationship for 1 year and then living together for another before I will even consider marriage and he was like yes that is completely reasonable.",
              "id": 48,
              "comments": [
                {
                  "score": 314,
                  "content": "Personally I require 2 years and a road trip. You can pull off best behavior for one year but the year after that first year it's way harder. The road trip ( at least 5 days ) helps to sus out if you can be alone with each other for a good chunk of time without wanting to kill each other ( or leave them in the side of the road! ). Road trip ended 2 of my relationships so it was a good test.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 156,
                      "content": "Add in a trip to IKEA and you’re good",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Road trip is definitely a good test, other travel is also good, but dealing with someone in a car and driving gives a good indication of compatibility.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Damn, there are no downsides to a relationship road trip test. \n\nGoes well? Awesome!\n\nGoes bad? Still had a road trip!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "\\+1 for the road trip. It tells you so many things you need to know.\n\nDoes your partner drive like a jerk in traffic? Can you enjoy the same podcasts? Is someone *really* uncomfortable with silences? How does your partner handle adversity (for instance, high wind warnings as you drive around Lake Erie that make it feel like your car is about to blow off the road)? Will they sneak into the woods with you to pee in the middle of Upstate New York because there are no rest areas for *miles*?",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "There is an old saying that you have to winter and summer a person before you truely know them",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "Is he being childish, or is he intentionally separating her from people who have her best interests at heart?",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "It could be cultural. I grew up in the conservative Midwest, where short dating and engagement times while not common aren't as problematic. My parents have a 4 year age gap and got married within 3 months. (Still happily married). I myself can't imagine doing it, but I know a lot of people who have. So it's potentially not as unusual as it may appear.",
              "id": 56,
              "comments": [
                {
                  "score": 11,
                  "content": "In Norway you see everything.\n\nI know people who have been together for 2 decades without getting married because they didn't see the point.   \nAnd I know 2 people who got engaged within 6 months because \"if it's right it's right\".   \nThey're all very happy (far as I know, no reason to suspect otherwise). \n\nWe don't know OP, the husband to be, or the sister so people are making decisions based on their own bias here.\n\nMaybe he's a prick trying to isolate her, maybe she's a dummy who makes rash decisions, maybe the sister is cruel and just wants to sabotage her little sister from getting married before her or is trying to validate her own life choices by making her younger sister repeat them. \n\nMaybe everyone here has good intentions, are in the right in their own way, but are going about it very porrly. \n\nWe really don't know.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Love this comment. I agree completely. The top comment that the fiancé is a narcissist demonstrates our society's unhealthy misuse of psychiatric disease that is frequently used to mischaracterize good people.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It's not the age gap in itself, I would say, but more the age gap combined with OP sounding so... teenage-like naive in her view of romantic relationships. It just seems strange that a normal 30yo would be compatible with someone this, shall we say, young at heart. And not at least wanting to be the sensible voice, insisting they should get to know each other better, encouraging her to not cut ties with her sister, etc.\n\nOP, I don't understand what's the rush.\nEven if he's not a bad guy, you can't know for sure that you two are compatible. Because you are still seeing him through pink, heart-shaped glasses and fluffy clouds. Try living together first, be together for a few years, get to know each other in your everyday life. If it turns out that you were right, and 2-3 years from now you still feel like he's the one, well then good for you, you didn't lose anything.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2192,
          "content": "I wonder if they are Christian or evangelical because, “We are ready to commit to each other fully.” To me reads as, it’s been 6 months and we want sex, but the magical sky carpenter says good girls don’t have sex before marriage.",
          "id": 60,
          "comments": [
            {
              "score": 400,
              "content": "That was the vibe I was getting , too",
              "id": 61,
              "comments": [
                {
                  "score": 255,
                  "content": "Right? Which is obviously an atrocious reason to get married - like wait if you want that’s your personal choice but getting married after 6 months so you can have sex? Bad idea, bad, do not do that.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 266,
              "content": ">magical sky carpenter\n\nlmaooo",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 146,
              "content": "I’ve only seen military relationships marry this fast. They almost always end in divorce after the non military person realizes how insane the life is. \n\nI met and married my husband after knowing each other for a year when we were 21. Our 15th anniversary is this October.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "My brother dated a woman for 8 months and got pressured by the church to propose because \"he should know by now\". He did end up breaking the engagement but he was having major anxiety over it because he thought the church would punish him for it. \n\nLuckily he had me haha",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Or it's so he doesnt have to hide his abusive tendencies",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1345,
          "content": "THIS. People that believe they have found “the one” after such small periods of time are the reason divorce lawyers never have trouble finding work. OP’s sister is rightfully concerned.",
          "id": 67,
          "comments": [
            {
              "score": 1450,
              "content": "This is a 24 yo saying: \"when you know you know!\"\n\nMy sweet summer child..",
              "id": 68,
              "comments": [
                {
                  "score": 1192,
                  "content": "And “being recognized as soul mates in the eyes of the law.” \n\nOh dear. The law DGAF about soul mates. The law recognizes the merging and dividing of assets. That’s what marriage is, legally. (And spousal privilege while testifying, etc. at a high level). \n\nYTA, OP. Your sister is in the right here. The fact that you’re willing to throw away what sounds like an otherwise close relationship for this is concerning, and the fact that your fiance is encouraging it rather than being the voice of reason is beyond concerning.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 599,
                      "content": ">And “being recognized as soul mates in the eyes of the law.” \n\nI rolled my eyes so hard at that I think I hurt myself.  She sounds like an infatuated teenager.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "That’s basically why we’re getting married lol the financial security (and it’ll make my dad happy) we love each other but would happily have carried on without marriage",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Also the formation of a family unit to determine who gets hospital visitation, spousal privilege in court, who a parent is, etc.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 250,
                  "content": "[deleted]",
                  "id": 73,
                  "comments": [
                    {
                      "score": 211,
                      "content": "Me too. A colleague once berated me for getting a new wedding ring. She loved hers so much she would never take it off, her husband placed it on her finger and it would stay there til she died. I must have a strange relationship if I didn't value my ring like she did etc. 6 months later she was getting divorced, 25 years and 3 rings later me and my husband are still going strong!",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 155,
                  "content": "Just believing in and mentioning \"soul mates\" tells me OP is not mature enough yet for this marriage.",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 116,
                  "content": "My husband and I got married at 22, but had dated all through college. We “knew” , but waited to be sure. It’s been 45 years now",
                  "id": 76,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Right? There are other concerns to getting married beyond being in love. Y'all were smart to wait 'til you were done with school and starting to get established.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 107,
                  "content": "I haven’t seen this kind of naive view of love outside of teenagers. Absolute yikes",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 97,
                  "content": "My ex BIL asked 2 women to marry him in the span of a year. The second one was after a few weeks and that phrase was used. Guess who broke up a month later?",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "If on my early twenties I married my “when you know you know” love of my life I would be a lesbian married to a man. Not a great man either lmao.\n\nAnd our relationship was still longer than OPs",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Lol. Me in my late 30s:\n\n\"Nobody knows a goddam thing!\"",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "The entire tone was that of the prom queen in love with the high school quarterback.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "The number of times I “knew” and then the guy showed his true colors after a year or three…",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "Can they even get a divorce if they are recognized as soul mates in the eyes of the law? /s \n\nOP's sister is right to be concerned. OP sounds too naive to rush into marriage.",
              "id": 84,
              "comments": [
                {
                  "score": 9,
                  "content": "“I now pronounce you soulmate & soulmate. You may NOT get divorced”.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "If you legally declare yourselves soulmates in the eyes of the law. Upon divorce pinhead from hellraiser comes from the depths of hell to tear your soul apart.. as per your legally binding contract",
                  "id": 86,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "My husband and I were married fairly quickly but he never tried to isolate me from my family. That is a big marinara flag.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "And really, if he is the one, waiting doesn’t hurt either. Sister is correct, waiting doesn’t diminish actual love, but ensures it. So many red flags here.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 710,
          "content": "Yup, you nailed this one. YTA.\n\nI've had pimples longer than you've known your partner, yet you are already going to destroy a lifelong relationship when they share their concerns. She even tried to reach back out to you to see what can be done to fix this, and you ignore it.\n\nYou don't know everything about a person in six months, this is still the honeymoon phase where you are infatuated with them. I wouldn't be on your side either as it takes more than six months to know a person well enough to make a lifetime decision, IMO.\n\nAlso, sorry gotta say it, this is what an abuser does. They want to alienate you from your family so you have no one and it would be a torrential hole to dig yourself out of. You may not think it now, but once you're married, you're fully in it - including the dirty lies and secrets they didn't tell you before. I would tread lightly and have a long engagement to see if this is actually what you want.",
          "id": 89,
          "comments": [
            {
              "score": 31,
              "content": "You’re totally correct, but you should see a dermatologist at some point, ijs.",
              "id": 90,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 420,
          "content": "I have a friend who has been in love with “the one” three different times. She’s 27.\n\nWe are working on her understanding the concept “if he’s the right one right now, he will still be the right one if you wait a year or so.”",
          "id": 91,
          "comments": [
            {
              "score": 22,
              "content": "u/unsupportivesister needs to see this",
              "id": 92,
              "comments": [
                {
                  "score": 21,
                  "content": "SERIOUSLY. if they're the one, why is there a rush x50000  \npeople change sooo much over time and it's absolutely paramount to spend a few years together to see if you do in fact grow together cohesively! it's one of the beautiful things of getting to know your partner.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I completely agree with you, so please don't take this as me disagreeing, but in some of op's comments, she mentioned they want to marry now rather than later because they want to have an easier time buying a house together, which they want to do soon, and mentioned that it would be easier now to change her last name and get more established in the work place rather than get more established in the work place with her current name and change things later.\n\nImho, the risk of divorcing and having to change your name for a second time is more of a hassle than just waiting, but idk.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yes! Everyone here is so concerned about the engaged sister EXCEPT the boyfriend who is feeding the rift between sisters. I thought with dread that I hope we don't eventually hear about this lady on Dateline or the news or something. It's like a slow motion accident and we all want to prevent it from happening.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Exactly! My husband and I pretty much had that feeling the moment we met each other but we also knew that there was no rush as we both planned to stay together so we moved in with each other and after 6yrs we got married.  Guess the amount of people that questioned our relationship or feelings? Zero!  \n\nOP - Do you know why the first six months to a year is called “The honeymoon phase”?  It’s because this initial phase of excitement doesn’t last. It is brief.  Chemicals such as dopamine and oxytocin are released in your brain stimulating euphoria and mimicking love. This is why most people stress that it’s better to wait to get to know the other person longer before you make a life long commitment. Your sister sounds mature and sensible and concerned about you as a loving sister should.  The fact that your six month old boyfriend thinks it’s ok for you to cut contact with her over this is not only horrifying but extremely concerning.   \n\nYTA",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 402,
          "content": "One of the MAJOR red flags of an abusive partner is rushing a relationship. It’s super concerning…",
          "id": 97,
          "comments": [
            {
              "score": 25,
              "content": "u/unsupportivesister and it's frowned upon in many families to get a divorce, so the sister with stars in her eyes needs to listen to her sister who is NOT getting gold dust in her eyes.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 389,
          "content": "It actually sounds like your sister just wants what is best for you. Don't get me wrong, you can make your own choices when it comes to your relationships, but it's kinda sketchy to me that your fiancé is fine with you just cutting contact with your sister, instead of trying to be supportive and helping smooth things over. I love my husband to bits, and I would never encourage him to cut contact with his family with such ease.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 288,
          "content": "Yep, him agreeing not to invite the sister is worrying. When I had a fallout with my sister, my husband was the voice of reason, not enabling me. OP, your sister is rightfully concerned about your relationship with Derrick, she's not being toxic or trying to show him in a bad light! YTA",
          "id": 100,
          "comments": [
            {
              "score": 6,
              "content": "I found it helpful to listen to my sister even though I didn’t like what she said. I got accepted into the doctoral program of my choice. I called my oldest sister SO excited! She said, that’s wonderful Susie, now is life going to let you do I? I was taken aback, but it made me seriously analyze what it would take and eventually conclude that, yes, life would let me do it. I’m glad I went and glad my sister made me think about it first.",
              "id": 101,
              "comments": [
                {
                  "score": 9,
                  "content": "That's what sisters are for - supportive with a dash of reality!",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 276,
          "content": "YTA-Don’t shut people out of your life because they speak their truth. You do not have to agree with them, but hearing out people you love and respect will keep you honest.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "There is no use. She's so far in the fog with her Rose tinted glasses in the honeymoon phase of this relationship that she isn't going to see the red flags until she's so far gone in a strange from her family that it'll be too late.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23573,
      "content": "I don't know if YTA per se, but I think you're being very naïve and I agree with your sister.",
      "id": 105,
      "comments": [
        {
          "score": 7535,
          "content": "Agree, domestic abusers and generally bad people always try and get to marriage asap so they don’t have to put up a charming front anymore and much harder for you to leave especially if isolated from caring family members such as your sister. I work in gender based violence and it is super common. The point is all of the women feel like this before the marriage.",
          "id": 106,
          "comments": [
            {
              "score": 1876,
              "content": "Absolutely agree. My step father did exactly this. And then my mom was trapped for almost 2 decades, and all her children were abused. We need a lot of expensive and generally unattainable therapy now. I'm highly suspicious of everything going on here.",
              "id": 107,
              "comments": [
                {
                  "score": 790,
                  "content": "I've seen these \"soulmate\" relationships go off the rails too many times to count. \n\nThe most perfect couple I know got divorced when she got deadly sick. He had a new relationship and a child before the divorce was finalized.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 145,
                      "content": "That's so sad and so common...",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Tale as old as time unfortunately",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "My sister’s been in 3 of those “soulmate” relationships. \n\nShe spent every day last week at the magistrates office. Number 2 soulmate was charged with domestic abuse against their shared 12 year old son and he was arrested/served with a restraining order. Hopefully this is the end of their shared custody. \n\nNumber 3 was served with an emergency protective order while she gets things in order to leave their home with their shared 3 year old. \n\nNumber one? Oh he just got out of prison for heroin/coke distribution. What finally landed him in there was the hair follicle test done on *their* shared son, who was 4 at the time. Positive for heroin bc I guess he’d been using around him. \n\nThose relationships always end like this or worse. I wish people like OP and my sister cared enough about themselves to take their time getting to know someone before throwing their lives and concerned family members away.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I find it's weird that anyone would want to start a relationship (with the divorcing person) under such circumstances.... it's like, *providing they were informed of all the facts* wouldn't you worry that the same fate could eventually befall you if, God forbid, something similar were to happen to you? You've seen that they can ditch their partner in the most trying of circumstances, what makes you think they wouldn't do the same to you if s*t hits the fan?\n\nUnless there was something else festering in the relationship that you were writing about, and the people involved just managed to put up a façade for the outside world long enough until it was no longer viable for one of them...",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1000,
              "content": "Can confirm. I was 24 when I married my now exhusband(33 at the time). Rushed into marriage because the love bombing was so strong and manipulative. Right after marriage he had us move away, isolated me from everyone and got me pregnant immediately. The abuse that was just peeking around the corner before came out when I had no support system and ‘trapped’ with a baby.\n\nThank God I was able to get out of the abusive marriage, but it took four years.",
              "id": 113,
              "comments": [
                {
                  "score": 223,
                  "content": "Just want to say thank you for sharing your story, I’m glad you got out and I hope you’re doing well now!",
                  "id": 114,
                  "comments": [
                    {
                      "score": 196,
                      "content": "Thank you. I’m doing amazing now living my best life with my two boys (exhusband is the biodad for both boys).\nI’ve since remarried and every day I think about how lucky I am to have gotten out and moved onto a new healthy and amazing marriage that is a better example for my boys!",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I’m so sorry you had to experience that but so happy you managed to get free. Hope you have the best life 🥰",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 425,
              "content": "One of my friends is going through this right now. Her husband pushed to move in together after just 5 months, and proposed in under a year. He pushed to elope just two months after getting engaged, and it wasn’t long before he started talking about having kids.\n\nShe’s leaving him less than a year into marriage because he showed his true colors and is an emotionally abusive narcissist. I’m so thankful he was unsuccessful in his clear attempts to baby trap her.",
              "id": 117,
              "comments": [
                {
                  "score": 7,
                  "content": "So if I suspect that this may be happening to my friend, how do I warn her?",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 285,
              "content": "Can confirm: my ex husband waited all of 5 months to ask me; one of those months we were separated and I, foolishly, listened to a mutual friend trying to get us back together. He wanted to get married that week, the next day…I refused and got five weeks to plan a wedding.\n\nIn my wedding pictures, you can tell I just absolutely loved him. And you can tell he was absolutely basking in the attention everyone was giving us (and since I was an extension of him, really just him). I did all the planning, all the paying for things, including our rings, all the everything…man couldn’t even manage to find us a minister, the one part of the ceremony he took on himself. I left less than 4 months later…and only because I had to plan my escape carefully. Our marriage legally lasted longer than our relationship because I was too afraid to pursue court doings until I had moved to an unknown home, had a stable job, and was in therapy.\n\nGetting away from him was rough af. Don’t marry this dude OP.",
              "id": 119,
              "comments": [
                {
                  "score": 18,
                  "content": "Thank you for sharing your story, I’m sorry you went through this and I’m glad you got away 🙏",
                  "id": 120,
                  "comments": [
                    {
                      "score": 15,
                      "content": "💜 thank you. I just really want OP to hear that this is a very bad idea.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "this has made me rethink my engagement. kinda glad to have read this post.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "My abusive father taught me a lesson (indirectly): you don't have to be a good person to be liked, you just have to be a good person for 30 minutes to be liked. \n\nUnless OP has been living with this guy for the last 6 months, then she doesn't know him.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "To validate this: I was 24 when I started seeing a 32 year old. We didn't get married, but we were on a lease together after 5 months. It was the worst two years of my life.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This. And when the mask comes off,  she will wonder where her kind,  loving husband went and what *she* can do to help get him back. No mature 30 year old man proposes after 6 months of dating.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This. I had an ex start talking about marriage 2 months into casually dating. A few weeks later the mask started slipping and he started showing manipulative behavior, I noped out of that shit so quick. He later married another girl and from what I’ve heard he’s still manipulative.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "He might be a good guy and head over heels with her, but who knows if they are compatible once the glow is off.  Wait 6 months, take a road trip, and rent a tandem bike.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 984,
          "content": "Exactly. Even if this guy really is the love of OP’s life and they live happily ever after with kids and all that, the sister is still very reasonably expressing concern. It would be great if it all works out between them, but there’s no way to know that and OP’s sister is trying to protect her.",
          "id": 128,
          "comments": [
            {
              "score": 623,
              "content": "Your sister is your sister for life. Good or bad, that doesn’t change. I wasn’t a huge fan of my sister running off with a dude she met on the internet and moving in with him after 4 months (and about 6 states away) I didn’t sell her house for years after she got married because I was convinced she would come home. She didn’t. They’ve been married 12 years. He’s a good guy. I didn’t know that at the time and it’s my job to look out for her. \n\nMy grandpa wasn’t sure about my dad at first. He said so. My parents continued to date, and my dad earned my grandfather’s trust. They became family. \n\nSis doesn’t have to support your marriage on day one. She can voice concerns. She is supporting you. If this dude is in it for the long haul, he will prove himself through being a kind partner to you. You’re asking your family to endorse a man they barely know. Give them time and appreciate the fact that they are looking out for you. If they’re still frosty in a few years, THEN you go NC. \n\nYta today and YTA if you really don’t invite her. She will probably be there if you need her. Don’t alienate her.",
              "id": 129,
              "comments": [
                {
                  "score": 118,
                  "content": "This is a really good take and I hope OP takes it to heart. OP has been dating a guy two 90-day-new-job-period-lengths and is asking her family to endorse a legally binding relationship. Hell, doing a long engagement at this point would be a better idea than what she's currently doing.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 545,
              "content": "Also strange that OP is willing to give up a lifetime relationship w her sister over one conversation.",
              "id": 131,
              "comments": [
                {
                  "score": 229,
                  "content": "It's not smart to throw your personal support system out the window for a significant other.  Friends often last longer than marriages.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Even more true about siblings",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Also weird that her fiance is on board. If my spouse's sister thought this, I'd try to get to know her better so she felt more at ease.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Same. I’d be hurt but it would be like “look, we’re going to be family. We just need to get to know each other. We should still invite her.”",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Yep that’s a huge huge red flag",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 339,
          "content": "Yeah, sounds like sister is trying to be REAL. Perhaps neither are good at communicating it's not going so well because of this, but I think sister is coming from a good place. 6 months is NOT enough time to know someone. Do people have lasting marriage after such a brief courtship? Sure, it has happened and it can still happen. But the odds are SOOOOOOOO stacked against you.",
          "id": 137,
          "comments": [
            {
              "score": 135,
              "content": "[deleted]",
              "id": 138,
              "comments": [
                {
                  "score": 9,
                  "content": "Or the homicide detectives, for when he strangles her",
                  "id": 139,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I remember reading something somewhere (so I don’t know if it’s “real” or how reliable it is, especially because I can’t remember where I read it) that you should date someone for at least 6 months before even considering moving in together, because 6 months is roughly the amount of time that people can “hide who they are”. So if they were trying to “hide who they were”, then after 6 months or so they wouldn’t be able to hide everything anymore. \n\nI don’t know if 6 months is accurate, but I do agree with the general sentiment that it never hurts to wait. At the very least, OP and fiancé could move in together without actually getting married first to ensure that they’re compatible that way. I come from a culture where it’s VERY common to both get married young and quickly (we’re talking getting married before 25, and usually before they’ve known each other a year), and wouldn’t you know it… divorce rates are through the roof",
              "id": 140,
              "comments": [
                {
                  "score": 17,
                  "content": "Towards the end of her life, my VERY religious grandmother said, much to the chagrin of my grandfather, that it's probably best nowadays if people live together before marrying because, \"What is a greater mockery of marriage? Two people living together without being married or all the divorces because people rushed into marriage without knowing each other?\" That was an incredibly avant-garde of her to say.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Honestly I love that. I’m a big supporter of the notion of marriage and monogamy, but the reality is that a lot of people don’t understand the differences between actually living with someone and just dating them. They think it’s “not a big deal”, but stuff adds up, and there’s tons of stuff that doesn’t come up until you can live together for a while and see their habits.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "It was the \"soulmates in the eyes of the law\" line that convinced me OP is not mature enough to get married to anyone, let alone this walking red flag",
          "id": 143,
          "comments": [
            {
              "score": 7,
              "content": "A girl I went to college with married a guy in the military very quickly after meeting him. Went to a courthouse and did the thing and **she didn’t even tell her parents.** I will never forget her telling me how excited she was to “really be married” after they had the “big wedding.” I have never stopped myself from rolling my eyes harder - I wanted to shake her and scream **you are already married to this person.**\n\nThe “big wedding” never happened, as when he came back from deployment he straight up moved to a different state and told her he didn’t want to come with him. So, divorce.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Oh man I missed that line on my first reading. I'll never understand people that rush to get married(other than pragmatic reasons and even then I'm skeptical) Like if you're meant to be with someone forever, what difference does 5 years make?",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Yall know that Jesus meme \"they hated him because he spoke the truth?\"\n\nYeah that's OP with her sister right now.\n\nSorry kiddo. Your sis called it like it is.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17051,
      "content": "YTA. You’re upset because your sister expressed honest concern. Your response was childish. And kicking her out of your wedding is equally so.",
      "id": 147,
      "comments": [
        {
          "score": 4851,
          "content": "Yeah OP you need to understand... your sister is \"right\" here, her concerns are valid and you pushing her away because of them is an even bigger red flag. \n\nYou're dating a man several years older than you, and are getting married within 6months of KNOWING each other, and now you're considering blacklisting members of your family ie isolation. Like red flags all over the place.\n\nYTA",
          "id": 148,
          "comments": [
            {
              "score": 1599,
              "content": "My best friend is engaged to a man 18 years older than her. I expressed my concerns as anyone with any ounce of love would, and she responded well. Just saying she knows, she’s taking it slow, and they’re working on it together. They’ve been together for 7 years now and I can confidently say he’s a good match for my friend. \n\nIf she went head first into marriage with him, I think I’d see him a lot differently. If she responded as OP did because of my valid concerns, I would 100% feel like he’s alienating her and idk if I’d ever have any other opinion of him. OP is handling this in a way that potentially ruined relationships with people who care, or having those people not trust him because of her own actions (this being if he is actually a good person and not a creep, which is rare, but does happen.)",
              "id": 149,
              "comments": [
                {
                  "score": 267,
                  "content": "Yep. The age gap here isn't necessarily a problem, but it is enough that when combined with OP's responses and naivety scream pending abusive behavior.\n\nIts not that hard to be loving and sweet for 6 months not even living together.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I mentioned elsewhere that I got pregnant like an idiot while being in “love with my dream man” at around 6 months of dating. I almost married him! He’s in jail for possession of meth, something he was supposedly sober from years before I met him, after being completely uninvolved in our kids life from 6months old. \n\nPeople change, and knowing them for such a short time, you have no idea who they truly are. I love my son to death but I would much rather him have been a product of a healthy, understanding relationship instead of some “fling”. (But of course I wouldn’t change who his dad is because my son is perfect, but that’s also an emotion I hate dealing with. Happy I have my son exactly how he is and also wishing he had a better father, but knowing I wouldn’t have this exact Angel if it weren’t for his father too...)",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah I'd love to ask her how they have resolved their arguments, but at 6 months you've barely had any disagreements. Absolutely no way to know if you're compatible for life",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "more red flags than a Semaphore convention",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "“Marry in haste, repent at leisure” is a phrase for a reason. YTA",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 985,
          "content": "Her childish response immediately said 'she's not ready to get married' to me.",
          "id": 155,
          "comments": [
            {
              "score": 281,
              "content": "She handled it terribly. Tbf her bf’s response to agree to kick sister off the wedding list is equally concerning",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 366,
          "content": "Hoo boy. There are red flags all over this one. Your sister has a good reason to be concerned. It takes someone who really loves you to say something that might get you mad at them, but is important to say anyway. \n\nYour sister loves you. It sounds like she addressed the topic pretty tactfully, but has legitimate concerns. A parter who loves you should see this and NOT encourage the estrangement. Is he said, “I know why she is concerned but I will show her that I am the right one for you, we still need to invite her,” I would give him a little more benefit of the doubt. \n\nThe way you talk about him and your relationship sounds young and somewhat naive. I hope your sister is wrong and this works out ok for you. But YTA for not inviting her because of what she said.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": ">your sister expressed honest concern\n\nOP, YTA. \n\nYou are having pantsfeels for your fiance. That is good! However, you don't know (can't know) whether you are long-term compatible. If you're still madly in love 12 months after you met him, get engaged. Then wait another 12 months for the marriage. \n\nIf he really is The One, 24 months of dating will fly by. If not, it's a lot less hassle leaving someone you're cohabiting than someone you're married to.\n\nAlso, for the love of all that's holy, DO NOT PRODUCE A BABY WITH THIS GUY until the 2-year mark.",
          "id": 158,
          "comments": [
            {
              "score": 11,
              "content": "Honestly, 2 years is still so early for babies, imo.\n\nEither way, if you haven't paid some bills together and had to split chores and errands and make important decisions together, you aren't ready to marry each other.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Yeah, no one is saying that the marriage for sure wouldn’t work out. It’s entirely possible that this guy is as great as OP says he is and that they’ll have a beautiful marriage - but I think the sister is absolutely right to at least be concerned. There’s no need to jump straight to marriage, especially because a potential divorce brings in so many additional complications",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Yeah, whether or not the sister is right, expressing this kind of concern is what a loving sister does. Sometimes people _do_ rush into things when they shouldn’t, sometimes people _do_ make horrible mistakes, and it’s good for those who love them to point it out to them. That means sometimes people will get it wrong, and caution people who aren’t making a mistake. And that’s okay. What if people erred on the side of _not_ saying anything, because they might be wrong? A lot of people who needed help would never be offered it. A lot of much-needed interventions would never happen. \n\nI was once concerned that a friend’s husband was mistreating her. I talked to her about it, and she explained that both the bruising and the apparent isolation were due to a medical condition she hadn’t been telling people about yet. She also told me that my concern and reaching out made her feel very loved, and that if she ever did find herself in a bad situation she’d know she could come to me. She realized that if she had a friend who suddenly never wanted to come out and had bruises all over her arms when she did come out, she’d have the same very obvious suspicions.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yep! OP, You should recognize your sister is being super supportive of you. Even in your own post, from your telling, there is a red flag (him “supporting” you in cutting out our sister from a major life event). I’d be willing to bet there are other flags, and your sister is asking you to wait and see some of those flags for yourself.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9914,
      "content": "YTA, six years older man, 6 months total length of relationship. That is throwing red flags all over the place. Your sister is trying to protect you. It is possible that your relationship will be OK, but I'd doubt it.",
      "id": 163,
      "comments": [
        {
          "score": 3180,
          "content": "Not just the relationship. She’s only KNOWN him for six months. She doesn’t say how long they actually dated!",
          "id": 164,
          "comments": [
            {
              "score": 894,
              "content": "She stated they have been dating for one out of the six months.\n\nEdit: I misread, they got engaged a month ago. Still, they can’t have been dating for that long, so the problem remains",
              "id": 165,
              "comments": [
                {
                  "score": 213,
                  "content": "WHAT?",
                  "id": 166,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "The love bombing is so clear I don't even need my glasses to see it.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "“Known” biblically.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1634,
          "content": "She’s ready to ditch her sister of 24 years for a man she’s known for 24 weeks.",
          "id": 169,
          "comments": [
            {
              "score": 977,
              "content": "Oh my god, this is… this is the plot of ‘Frozen’.",
              "id": 170,
              "comments": [
                {
                  "score": 523,
                  "content": "At least Ana had the excuse of a) being seriously deprived of social interactions and desperate for affection, and b) knowing she might not get the chance to even *meet* another suitable guy after this one party. OP has no such limitations.",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "I read this and thought, I bet they finish each other's.... sandwiches.",
                  "id": 172,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 218,
          "content": "But \"when you know you know....\" lol. I hope everything works out for her but something tells me she is gonna be in for a rude awakening.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Ive had periods longer than their relationship",
          "id": 174,
          "comments": [
            {
              "score": 8,
              "content": "I literally have had ones longer than that thanks to nexplannon fail.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8018,
      "content": "YTA. I’m sorry, but 6 months ain’t enough. What’s people’s problems with waiting? I don’t get it.. y’all can’t be madly in love for like a year or something?? 😅\n\nAlso, your sister is just concerned. It doesn’t mean she doesn’t like your fiancé or is “unsupportive” of y’all’s relationship, just the ‘getting married so fast’ part.",
      "id": 176,
      "comments": [
        {
          "score": 3375,
          "content": ">recognized as soul mates in the eyes of the law.\n\nShe wants to be recognized as soul mates in the eyes of the law, because everybody knows true love requires government endorsement and a piece of paper.\n\nJust enjoy being soul mates. Leave the law out of it for now. It might prevent you from needing a lawyer later.",
          "id": 177,
          "comments": [
            {
              "score": 688,
              "content": "She wants to be recognized as soul mates in the eyes of her partner, because he has made her afraid to not get married soon enough.\n\nMarriage is a legal construct. You don't need to, and shouldn't, get married until you're making other commitments like buying a house together or having kids.",
              "id": 178,
              "comments": [
                {
                  "score": 303,
                  "content": "Oh I imagine he will get her pregnant soon enough, it’s the best way for them to feel they’ve trapped their partner",
                  "id": 179,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I wonder if he’ll try to get her pregnant if she asks to delay to wedding to try to force it faster….",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 71,
                  "content": "Hell, my “wife” and I have a son, been together 6 years. We wear rings, call each other husband and wife, love each other deeply. But we haven’t seen the need to be “recognized as soulmates in the eyes of the law”.  Curious if her family has money, or what. But dudes throwing some red flags for sure. \n\nOP soft YTA. Only because you really are blind in love",
                  "id": 181,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yup. My wife and I were together for 10 years before we got married, and that was largely because we decided we were ready to have kids.\n\nIn hindsight, I wish we would have sooner. First year of filing taxes jointly paid for our small wedding.  Left tens of thousands of dollars in taxes on the table over the years. Oops.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "You should consider marriage now that you have a kid, or you're going to get a big shock when you discover that you're not considered a family for several important purposes.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I remember this. I saw the light and heard the holy choir when meeting my hubs (or maybe it was cheap leds and loud high schoolers) but they told me my love will not flow unless *looks at documents* I sign a piece of paper and can post it all over social media.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Dude is taking out a life insurance policy on OP so he’ll be recognized as the rightful, legal claim when she goes missing/dead.\n\nYes, I watch too many real life murder shows.",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "This is where she fully lost me. That is just not an adult way of thinking.",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Don't tell Johnny Law, but my partner and I have been soul-mating for over a decade now and the government HAS NO CLUE!",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Agreed. That part made me roll my eyes. If you’re soul mates then surely your bond can withstand being paperless for a few more months/years lol",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 558,
          "content": "A year minimum imo, or you don’t even know who they are in every season or what holidays they celebrate! If my spouse only knew me during the summer when I play softball every weekend, they’d have a very wrong idea of how much of a hermit I am in the winter lol.",
          "id": 189,
          "comments": [
            {
              "score": 322,
              "content": "I also think you need some fights/arguments in before committing. It’s important to know how conflicts are handled",
              "id": 190,
              "comments": [
                {
                  "score": 205,
                  "content": "I'd add some time living together too, that's when both of you learn about each other's annoying habits and how well can you manage splitting chores",
                  "id": 191,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I have a general timeline for relationships I really hope my kids will consider. Don't move in together for one year, even if you're sleeping over every night. A year is enough time for the lust to settle and you're thinking a bit more clearly. \n\nDon't get married before 3 years. Enough time to really weather the ups and downs together, check long term compatibility and enough time to figure out if your life goals are similar.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "That’s a good point too. Personally, my spouse and I saw a couples therapist every month for a year before getting engaged. We’d already been together for a couple of years, but wanted to take a year to make sure we could work out major decisions (whether to have kids, whether we’d move to live near family or stay put, whether we would stick to our careers, who would stay home with the baby, etc.). I recommend it if your insurance covers it.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "Their relationship isn't even long enough for them to have had a chance to live together which is when you REALLY get to know someone.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I met the love of my life when I was 20. I knew I was going to change a LOT in the next few years. I had committed to myself (at the advice of my older and wiser colleagues) to not get married before 25. I did end up marrying this guy (after one COVID postponement) at age 27. No regrets on waiting even though we were madly in love for all 7 years prior to marriage. I did change a lot since then and I’m glad I waited till I was more mature.",
          "id": 195,
          "comments": [
            {
              "score": 12,
              "content": "I got engaged at 5 months because I knew. I was 20 at the time, he was 21.\n\nWe married two and a half years later because even though we knew it never hurts to be 1000% sure. Our engagement was even predicated on \"we're not going to actually make this official until we've been living together at least a year\" and we wound up not even discussing dates until that year was up, and insurance coverage was more a part of the decision than \"I want to be legally boundto my soulmate\" or however OP put it.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "[deleted]",
          "id": 197,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "My guess is that they’re in a conservative religion where they can’t live together before marriage, which is why they’re rushing to get married so quickly.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Fully agree! I've always said if this person was right for me they would be okay with waiting. You'd still get to that in the end if its a great relationship. Every relationship I've been in where they wanted to jump into marriage quickly turned out pretty bad because they couldn't keep the act up around 1 year into it. I'm not even the best at spotting red flags (definitely a work in progress), but I have decent boundaries and luckily that kept me from being stuck in a marriage at this point.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah me and my man are madly in love ( I mean besides the usual couple fights and stuff, nothing serious) for 5 1/2 years and we have no need to get married. \n\nWe aren't having kids together, we split everything, like, what really is the point? \n\nAlso we are Canadian so we can visit each other in the hospital, make decisions, blah blah",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The sister even suggested to just date the dude longer before jumping the gun, but I guess OP just “knows”",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "poor OP is so naive, just hearing her say \"we connect on a SPIRITUAL level\" hahahahaha I hope that all of us in the comments make mistakes and that you do well and that losing the relationship with her sister is worth it",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5409,
      "content": "YTA. Getting married is not being recognized as soulmates in the eyes of the law. You don't have a realistic view of what marriage is. Your sister is supporting you by giving you the best advice she can. Are you willing to torpedo your relationship with your sister forever because she hurt your feelings regarding your relationship? If your relationship is meant to last, it will  survive a reasonable amount of time before the wedding. Think carefully before you over react to your sister's words of caution.",
      "id": 203,
      "comments": [
        {
          "score": 1246,
          "content": "Yeah, getting married is more like being recognized as one financial entity.",
          "id": 204,
          "comments": [
            {
              "score": 529,
              "content": "That is literally all it is, OP is very confused about what marriage actually is. Looking at it through those nice new relationship rose tinted glasses.",
              "id": 205,
              "comments": [
                {
                  "score": 465,
                  "content": "When you’re wearing rose tinted glasses, red flags are just flags.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Damn, I need to cross-stitch that onto a throw pillow or something.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Bojack quote spotted",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I assume they talk about religious marriage, because otherwise... oh boy.",
                  "id": 209,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Soulmates = Two people filing taxes together",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yes!\nMy dorky self was excited to file joint tax returns with my spouse.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 612,
          "content": "Yeah, that “soul mates in the eyes of the law” comment let me know that OP is seeing through the eyes of a middle schooler. Big Sis is rightfully concerned and is probably well aware of how immature OP is.",
          "id": 212,
          "comments": [
            {
              "score": 311,
              "content": "Well and the whole \"Why should we wait. We are COMMITTED to each other\"\n\nUh no you're infatuated because you've been dating like 5 seconds.",
              "id": 213,
              "comments": [
                {
                  "score": 42,
                  "content": "It’s like, if you’re committed to each other, then why rush?",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Seriously, what a barf thing to say. OP sounds desperate.",
              "id": 215,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Yeah I literally winced when I read that part.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I didn’t know that she’d be the Gen X relationship advice guru, but: Juliette Lewis said, \"You have to be married before you get married. The marriage is the punctuation mark and the celebration of what you already have.\"\n\nYTA your sister is worried that you’re rushing headlong into this barely knowing someone.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This. Marriage is a long-term financial contract since both of you will be committing your time and resources into a single household. Hopefully OP has already taken that into consideration.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3771,
      "content": "You are not mature enough to be married. YTA\n\nEdited to add that the reason people wait until later in their relationships to get married is not always because they're not sure they love each other enough to commit. It's very often so that they can get a fuller view of each other as people. After six months, how many arguments have you had? Do you know how each other handles conflict? What about a life-altering situation like the death of a family member or a serious illness? Have you had to make any major decisions together about money, where to live, etc? Big experiences like this tell you a lot about a person and a potential future spouse.",
      "id": 219,
      "comments": [
        {
          "score": 1507,
          "content": "“Soulmates in the eyes of the law”.  That spoke to the maturity right there.  That one made me almost spit my tea out when I laughed.  Definitely not mature enough (at least in this relationship) to get married.",
          "id": 220,
          "comments": [
            {
              "score": 472,
              "content": "Exactly. Like the government cares if you’re soulmates.",
              "id": 221,
              "comments": [
                {
                  "score": 30,
                  "content": "Right? My high school home economics teacher told us that her son, while in college, got a prenup and legally married his friend just for the tax benefits with the intention to legally divorce once they both had more stable jobs. She explained to us how prenups and tax benefits work from that story. \n\nThe government could not give less of a shit about whether or not you’re actually in a romantic relationship, let alone “soulmates”",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 250,
              "content": "I laughed at that part too. When I first read this story, I was like, Is this the real life 90 Day Fiancé? OP’s sister is concerned for her safety and trying to help her. Derrick is also TA and a walking red flag🚩",
              "id": 223,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "The amount of genuine effort it took us to get married, in a state that *loves* its fucking paperwork: ~10 minutes setting up an appointment (only that long because we were able to pre fill a fair amount of the paperwork), ~20 minutes in the license office finishing the paperwork/ showing ID / signing (would have been about half that but we had to bring our toddler), ~10 minutes in the magistrate office with our 2 witnesses.\n\nGetting married is easier and far less expensive than getting divorced in every single US state I'm aware of, and they don't care at all about how much you actually like each other just whether you sign the paperwork.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 335,
          "content": "I'm in favor of waiting to marry someone *because* you love them. If you love and respect them for who they are, you need to give them the room to really experience who you are--and frankly, damn-near-nobody ever truly revealed themselves to someone else inside the first year. You can learn a lot! But so much of the time, you can't learn enough. You don't even know who this person is in all seasons (are they a pissy-in-the-summer polar bear? Do they get Seasonal Affective Disorder in the wintertime?) and you haven't been with them long enough to have a real disagreement or see them under real stress.\n\nAnd they haven't had that for you.\n\nI don't think real love should take shortcuts, because that's an easy way to hurt your partner later. As long as nobody's dying and there's no \"my visa runs out in a month\" sort of outside pressure, there's no reason to marry yet.",
          "id": 225,
          "comments": [
            {
              "score": 18,
              "content": "> (are they a pissy-in-the-summer polar bear? Do they get Seasonal Affective Disorder in the wintertime?)\n\nBelieve it or not, [Summer SAD](https://www.medicalnewstoday.com/articles/seasonal-affective-disorder-in-summer-causes-symptoms-treatment-and-more) is usually what makes people act like pissy polar bears in the summer.",
              "id": 226,
              "comments": [
                {
                  "score": 10,
                  "content": "That makes sense, and sounds awful!",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "And that's not about her age but about her childish attitude.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Hell has OP put together IKEA furniture with her soon-to-be-husband???",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3679,
      "content": "YTA, and she's not being unsupportive of your relationship, she's being supportive of  you.",
      "id": 230,
      "comments": [
        {
          "score": 718,
          "content": "Thank you for saying this. \n\nMy sister went through a similar path. She started dating someone right after the pandemic began, in March 2020. It was a long distance relationship as he lived in another state but would regularly visit friends in our area, about once a month or so. She was 29, he was 38. \n\nMy sister fell hard. This was her first real relationship. The first time they went on an actual date (she asked me to come along) she had me take a picture of them. Then they facetimed our parents and introduced him to our mom and dad. He chose not to talk to me most of the time, so I gave them their space. After we left, she posted the picture to social media with heart emojis. Then she got mad at me and said I wasn’t nice to him. I’ll admit I wasn’t a fan of his. \n\nWhen she went to his city to visit him the first time, she went alone. The second time, she invited her friend, and asked if I could go watch her dog. When I got upset and said I would help pay for any hotel or Airbnb, she said she didn’t want me to go because I would embarrass her in front of his mom (who he lived with at the time). \n\nWhenever we were hanging out in person, he wouldn’t engage me in conversation. He would only speak directly with my sister. \n\nThere were many other things that happened. Personality things, opinions he voiced, etc that made me hesitant about him, but then my sister told me they weren’t going to have kids. My sister has always loved children. Kids have always flocked to her and she has always had a strong maternal instinct. When she was younger and helped plan baby showers for friends, she would tell me exactly what kind of theme she wanted for her baby shower, what names she had already picked out, etc. But now, a major life goal she had is thrown away because he doesn’t like kids. \n\nI had my reservations before, but from that point, I refused to speak to her about him. If she was talking to him on the phone, I would go to my room. I told her about the red flags, I asked what her reasoning would be, there were many conversations. She would always go back me being unfair to him. I wasn’t giving him a chance. I needed to be nicer to him. \n\nThen in January of 2021, 10 months after they began dating, 90% long distance, he proposed. He had called my parents beforehand, asked for their blessing, said he wanted me there. When I explained I had reservations about his plans (wanting to go to a restaurant at the height of the pandemic, before vaccines were widely available—restaurants were also supposed to be closed in our state because of the pandemic so it being open was illegal.) I was disinvited from the proposal. I found out when my sister got ready for the dinner the day of. \n\nSo they’re engaged, and when my sister mentions the date, it’s a little over two months away, at the beginning of April. Just a few days after a year of dating. They knew before he had proposed they wanted that date—for what reason? She still hasn’t told me. \n\nMy sister was also going to be moving to the city he lived in. A city that she had previously said she hated. A city that she had no friends, no family, no job prospects. She had just landed a job that was full time and provided medical benefits, and she liked the work, and she was giving that all up. \n\nI begged her the day she left to rethink. To just slow down. I asked her where the rush was. They’re not planning on having kids, so there’s no rush for a biological clock. WHERE WAS THE RUSH?? She said something similar to OP, they were “in love and wanted to be together.” \n\nThey will be celebrating their 2nd anniversary this year. My sister isn’t happy, that much is clear to anyone from the outside, but she won’t admit that it’s because of him or her rushing into a relationship. She said it’s all of the other factors. The friends who don’t call or text her anymore. People in the community who judge them (she’s white, he’s black, so everyone must be racist to not be happy for them). I have had my relationship with my sister permanently altered. My sister was my best friend and now I generally only text her if there’s a family update about my parents. I won’t call or FaceTime because then she tries to have me speak with her husband. \n\nI wasn’t unsupportive of their relationship. I encouraged her to get to know him better, take a little more time to grow into their relationship. I was trying to be supportive of my sister, but because I wasn’t explicitly supportive of the relationship and of HIM, I became the enemy.",
          "id": 231,
          "comments": [
            {
              "score": 86,
              "content": "This is literally my worst nightmare and I’m so sorry you have had to endure this with your sister.",
              "id": 232,
              "comments": [
                {
                  "score": 41,
                  "content": "I never thought something like this would happen. My sister was my closest friend, and I thought I was hers. It revealed a lot to me, about our relationship, my dependence on her socially, who really cared for me and who was friendly with me because of my sister, and I hit a really low point as a result. I ended up reenrolling in therapy almost a year later and that’s helped a lot. And on the plus side, I’ve grown in friendship with my youngest sister, who also feels some type of way about how our sister went about getting married. Our little sister wasn’t even able to attend the wedding, and was only able to zoom in. It’s still carrying on, but I’m in a better place then a year ago. I truly hope you never experience something similar if you have a sibling with whom you’re close.",
                  "id": 233,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I can tell how much this weighs on your heart, because I, too, have word-dumped in the comments. I’m so sorry. I’ve been in a very abusive relationship, and so have both my sisters, and I hope that he dumps her, honestly- that’s the way I got out, against my will. It was only when he contacted me several years later “to apologize “, that I realized dumping me was the *single nice thing* that he ever did for me, because I was so turned around inside, I would never have left.",
                      "id": 234,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "I was almost your sister. Met a guy ten years older than me and lived 2500 miles away. We were engaged after a year of long distance. I cried when I told my sister. I tried to say they were happy tears, but she saw right through them. \nLuckily, he broke up with me a couple months later. Best thing that ever happened to me. \nOP, seriously reconsider what you’re doing. Don’t make the same mistake many of us have had.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I hope your sister finds her way out. It's hard waiting for someone to realize they deserve better.",
              "id": 236,
              "comments": [
                {
                  "score": 13,
                  "content": "I really hope so. But she’s always been a “giver” type of person, putting others needs before her own. I think in part, this is what she sought out.",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Poor girl, wanted someone to love her so desperately, that she forgot to love herself first.",
              "id": 238,
              "comments": [
                {
                  "score": 13,
                  "content": "Thank you. That really brought tears to my eyes. I think that’s exactly how she went into the relationship, so desperate for someone to love her that she forgot she should do it herself. I hope she’s able to learn that at some point.",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Same thing has happened between me and my sister-I’m so sorry that you’ve had to go through this. For me it’s a constant pain, I’m absolutely heartbroken that she can’t look back at the 24 years we’ve had together and see that I have her best interests at heart. She moved in with her much older girlfriend after 8 months. They’ve moved to a city a few hours away. She has no transportation and has to ask her girlfriend if she’ll LET her go out to see her own family. Won’t let my sister have phone calls to family members without her. Wont let my sister attend family events unless she is invited too. \nAnyone who criticised their relationship is a “homophobe” even though we are criticising the personality of the girlfriend, the fact that she groomed my sister straight out of uni (WHILST SHE WAS HER BOSS) and the fact that she’s using abusive tactics to divide us from my sister.  Every single attempt to explain to my sister that I love her and I’m concerned for her is met on deaf ears. I’ve looked back through the girlfriends social media and she’s done this to many girls before but there is just no talking to my sister anymore-she won’t pick up the phone anymore.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’m so sorry you’ve experienced this. Have you explicitly said to her that you would be willing to help her should she need a way out? I hope your relationship can one day recover from this before she loses too much of herself in it",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "This. OP, you want people in your life who will give you the straight truth, even when you may not want to hear it.  Don’t cut your sister out of your life.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "I wish I would’ve had an older sister to at least attempt to save me from an abusive relationship that immediately started out with red flags. I didn’t know any better, but I thought I knew enough. 2 decades later and I’m still unlearning unhealthy trauma responses & coping mechanisms I gained from that relationship.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2721,
      "content": "INFO: How much about Derrick do you know? because I feel like your sister maybe right about not wanting you to get married, I mean you've only dated 6 months and he pops the question, that's very suspicious if you ask me",
      "id": 244,
      "comments": [
        {
          "score": 285,
          "content": "Plus the age gap... Does he have debt he's trying to lay out? Some other ulterior motive? If it's meant-to-be whats the harm in waiting a bit?",
          "id": 245,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1695,
      "content": "YTA. Your sister said nothing negative about Derrick or your love for one another. She gave you incredibly GOOD advice. If my 24 year old sister got engaged after only a few months of dating, I’d give the same advice too. (It’s concerning to me how readily you and Derrick are to cut your sister out. This is a big red flag to me).",
      "id": 246,
      "comments": [
        {
          "score": 426,
          "content": "Huge red flag that she is willing to just cut her sister out. OP clearly has not considered that maybe her sister is giving her tough advice because she actually cares for OP. Also, “soul mates in the eyes of the law” 🤮",
          "id": 247,
          "comments": [
            {
              "score": 43,
              "content": "We all know how much \"the law\" cares about soulmates. I mean, it's why gay marriage has never ever been an issue.",
              "id": 248,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Huge red flag that Derrick is prepared to let her cut her sister out (and in reality he’s probably encouraging it). He should know better even if OP doesn’t.",
              "id": 249,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Same thing happened with my younger sister - as the only family member who expressed concern I wasn’t invited (nor did I care to go). \n\nThe marriage lasted 2 weeks until he bailed and my sister learned a life lesson the hard way.",
          "id": 250,
          "comments": [
            {
              "score": 26,
              "content": "At least she got out after 2 weeks.",
              "id": 251,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Only two weeks? Did she apologize to you after?",
              "id": 252,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yeah the fact the fiance is also ready to cut the sister out is not good imo. He's supposed to be her soul mate and want the best for her, yet he's totally fine with cutting out an important friend and support system outside of their relationship simply because she gave her advice that they didn't agree with. Surely, as a 30 y.o., he is mature enough to see that the sister is looking out for her? I can't believe neither of them see that the sister only had good intentions and it makes me wonder if there isn't something more nefarious going on with Derrick",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Piggybacking off you I’m hopes op sees this: tell him you want to wait a little longer to get married. See how he reacts. How he reacts might help your decision.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}