{
  "post content": "edit: I want to clarify two things. \n\n1. I am her dad, not sure why everyone keeps referring to me as her mother \n2. Everyone keeps telling me the grade due date is actually the post date. If I was allowed to I would post the link so that you could see that the calendar literally says \"December 19th: Grades Due From Faculty\" and \"December 20th Grades Posted\". She literally admitted to lying that they were due Sunday (today) so I'm not sure why people are so stuck on insistng I'm wrong about that  \n\n\nI'm 54 and daughter is 28. She is home on break from grad school getting her phd. She's only home for two weeks because she says she doesn't have any more time even though she has a month break. That's been a big thing with her lately, she is constantly to busy to do things with us or help us out even though she does have the time.\n\nI got my younger daughter a sweater and it turns out she already has it. I called my older daughter from work on Friday and told her she needed to run and exchange it for a different one. She said ok, she'd do it the next day. I said it needed to be done that day to get the best options and she said she was grading so she can't. I told her that it's not like she can't pause her grading, run out, and exchange it. She said she wasn't going to slow down her work and just said that I should do it when I got back from work that day. I said I was busy to and didn't feel like running out after a long day of work and she said neither did she. But she doesn't have a \"long day of work,\" she's sitting on her ass on her computer all day and doesn't even have scheduled hours to work, she can do it whenever she wants.\n\nToday things really kicked off because I needed her to pick up an online order for a gift for my mom, her grandma. She again used the excuse of grading (she hadn't even started working yet, it was in the morning and she was drinking coffee and having breakfast.) She said that she needs to have her grades done by today but I looked it up on the website and she has until Monday evening so I called her on her BS, and she said she had \"other work\" due on Monday so she needed to get the grading done today (but wouldn't enlighten me on what this mysterious \"other work\" is). I said well tough, this needs to be picked up today so I can wrap it and I was going into the office so I couldn't do it. She said that if I don't want to do it myself, then it will be done on her own time. I told her with that attitude she can stay somewhere else and she said \"happily\" and packed her things claiming she didn't want to stay here anyway but was only doing so because I insisted. She left her gifts and said to not expect her for the holidays and she'll go to her girlfriend's family instead. I think it's ridiculous that she is throwing a fit just because she can't constantly live like she's the only person on the planet but my wife and other daughter is now furious with me. So I figured I'd ask here because my younger daughter is always reading the stories with me. AITA or am I correct that my daughter is self centered and childish?",
  "id": 1,
  "comments": [
    {
      "score": 41715,
      "content": "YTA \n\n>am I correct that my daughter is self centered and childish?\n\nNope that's a mirror you are looking at.",
      "id": 2,
      "comments": [
        {
          "score": 26267,
          "content": "Seriously. This grown man is throwing a temper tantrum because his adult daughter isn’t willing to take orders and run his errands. I hope she has an awesome Christmas with her girlfriend!",
          "id": 3,
          "comments": [
            {
              "score": 12265,
              "content": "I have a feeling he made her take responsibility for his errands a lot growing up and she's come back home to see her family armed with boundaries because she knows what he's like!\n\nHe doesn't like not being able to order her around anymore.",
              "id": 4,
              "comments": [
                {
                  "score": 7878,
                  "content": ">I have a feeling he made her take responsibility for his errands a lot growing up and she's come back home to see her family armed with boundaries because she knows what he's like!\n\nYes! \n\nThis is also one reason that students who are the first in their family to attend college, graduate school, etc. can struggle, because they lack the support and understanding at home. They are still asked to chip in with chores and duties around the house because \"it's just school\" or \"they aren't working\". I don't know if that is what is at play here, though, because this just sounds like an entitled AH parent who is upset that he's losing control over his daughter.\n\nOP says himself that \"she's sitting on her ass on her computer all day and doesn't even have scheduled hours to work\", which adds a lot of color here to the situation. It seems clear that he doesn't view what she does as \"real work\", which is honestly really sad, and the fact that he's mystified as to what \"other work\" she has beyond teaching/grading tells me that they *do not* have a good relationship.\n\nIf you've ever met a graduate student, it's generally pretty hard to get them to shut up about their research interests once you get them going on it. That OP's dad is struggling to figure out what else his daughter might be doing tells me that he probably has little to no idea what it is that she actually studies. \n\nGood for her for setting boundaries.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2657,
                      "content": "Agreed with all of this, I also think it's sad because no matter what level of education she achieves, I feel like he's not going to take it seriously or downplay her achievements like he's downplaying her studies.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1252,
                      "content": "> It seems clear that he doesn't view what she does as \"real work\"\n\nThat's exactly what this boils down to. Whatever anyone else is doing isn't as important as what he's doing. \n\nI hope homegurl enjoys her newly AH-free life 💃🏻",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 632,
                      "content": "I was first gen college. Full ride merit scholarship to a really good university. My Dad not only wasn’t proud of me, he actually needed to *tell me* that he was T proud of me, as he drove me to McDonald’s where I worked 20-35 hours a week while also doing 3 sports and being salutatorian. He said “Everything that you do is for yourself. You used to be your mother’s right hand. Go to college if you want to, but don’t expect me to be proud of you. Your mother could use your help” ( I also cleaned an office with her one day a week, and watched and cooked for my too-numerous siblings). \nThat’s just one reason first gen kids struggle. My parents had such a chip on their shoulders about “not owing you” anything. It just..sucks.\n\nEdit: thank you to all the Internet Moms for the “I’m proud of You”s. I’m 58 now! And I’m doing well, thanks, and even better- so are my kids. I caught myself “being my Dad” ONCE when my son was not even two- and I hearing myself say the words to him, I was horrified and I never did it again. They are great and I’ll do my best to be a great Mom to adults. But thanks guys, it really meant a lot.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 609,
                      "content": "Haha it is very hard to get us to shut up that is true. If he doesn’t know what she is doing it means he probably hasn’t shown even passing interest. Also if she is a PhD student still taking classes she has not only grading to do (which is a lot of work and very stressful) but her own final papers etc to turn in. Not to mention she is probably working on other research etc. Also it’s not even like she said she wouldn’t do the errands, just she couldn’t do them when he wanted her to. OP, YTA",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 501,
                      "content": "Oh God this. I love my father, but he STILL doesn't understand why I can't just \"leave work a little early\" to get things done. My work is teaching college classes, Dad. The students kind of notice when I'm not there.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 342,
                      "content": "I really can't stand when people downplay mental work as not being work period but he also said he had to go into his office which makes this situation so much worse him because he's just revealed how sexist he is, too",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 335,
                      "content": "All of this. Also, as a person who has to grade a lot of work and has a reporting deadline, it's time-consuming, exhausting work. People who don't have to grade hundreds of assignments don't understand how long it can take, how repetitive it can be, and how many times you want to bang your head against a desk as you read yet another paper full of basic errors that show the student took less time to read the assignment outline then it will take me to mark what they handed in.\n\nOP, you sound like the entitled one. Your daughter is visiting. Cherish the time instead of ordering her around like a servant. Though, it sounds like you have already set that bridge alight.\n\nYTA.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 231,
                      "content": ">one reason that students who are the first in their family to attend college, graduate school, etc. can struggle, because they lack the support and understanding at home. They are still asked to chip in with chores and duties around the house because \"it's just school\" or \"they aren't working\". I don't know if that is what is at play here, though, because this just sounds like an entitled AH parent who is upset that he's losing control over his daughter.  \n>  \n>OP says himself that \"she's sitting on her ass on her computer all day and doesn't even have scheduled hours to work\", which adds a lot of color here to the situation. It seems clear that he doesn't view what she does as \"real work\", which is honestly really sad, and the fact that he's mystified as to what \"other work\" she has beyond teaching/grading tells me that they do not have a good relationship.\n\nThis is probably one of the reasons my college required that students live in the dorms for the first two years.  \n\n\nCut the damn cord, people.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 191,
                      "content": "I'm just a masters student right now, but when I say I don't have time during those last days of grading, I mean it. For one, I also have my OWN research to do, for two, grades are technically due at one time but I'm always told to get them done much earlier just in case. I would feel very unsupported if I was her.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 184,
                      "content": "Being a grad student who is taking classes and teaching as part of their assistantship etc IS A MORE THAN FULL TIME JOB. You are taking a full time load of courses and on top of that teaching two courses (or maybe TA’ing one or two depends on the award). These are classes undergraduates are taking. You lesson plan, create course materials, instruct, hold office hours, attend meetings in your department, and grade. I’d doubt he would think a regular instructor teaching courses is sitting on their ass all day so not sure why he thinks his daughter is? On top of that she needs to conduct original research, take qualifying exams, and do coursework. It really goes to show how little he knows of what she’s doing and he probably has taken little to no Interest I’m learning. \n\nYTA. She’s not your errand gopher. She’s got important sh*t to do.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 300,
                  "content": "Exactly! He thinks she's still a kid and that he has the grounds to boss her around. Honestly, my dad is waaay better than this guy but has similar problems bossing us kids around and \"drop what you're doing to do what I want\" and will argue about random stuff to get his way. Reading this post broke my heart because he's so much worse than my dad and I know how hard it is for me. Idk how daughter has dealt with him for so long. Since my dad has made progress and is starting to take \"no\" for an answer, I feel really lucky. If OP was my dad, I would 100% go NC. Reading this post made me feel panicky. Geez, I really feel for his daughter. This guy doesn't have a clue how much his daughter doesn't want to be around his toxic personality. If she is lying (I do with my dad) she's trying to preserve her sanity and avoid an argument. OP is checking her schedule and when her work is due. BONKERS! OP, you're like scary controlling. You're about to lose your daughter. Unless you get therapy and go a 180, I hope she gets away from you.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yup, he's such a trash selfish, AH of a Dad. Why would I come home for holidays when I'm expected to do a bunch of other people's errands. It's not even asking for her to cook for the family or something you might be asked to do when home for 2 weeks. It's just a lazy dude wanting to shirk his responsibilities and errands off onto her.\n\n I had him pegged for a dude after the first paragraph, a lot of the shit he expects her to do I bet he files away as \"women's work\". That, and not actually finishing his chore/errand 100% - typical dude behaviour. Yes, #notalldudes, but dudes in my experience will do half the task and rarely finish it 100%, or finish it haphazardly that you need to redo it.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I also think OP devalues his daughters work. He thinks his work is more valid then hers. Just because she sits down for her work, (which he says he works in an office so I'm curious to know how much non sitting he does) but he doesn't account for the metal load that comes with writing a dissertation, being what sounds like a teacher aid, and doing her own research. She's got a lot going on. She is clearly working on her \"holiday\" which it's much of a holiday. But OP thinks she's taking it easy?\n\nEdited to fix typo.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "There's a reason she's only home for 2 weeks even though she has a month break.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": ">armed with boundaries \n\nI love this and it's the energy that 2023 needs for any toxic people in your life.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Or the fact he's not even asking her to do the errands, he's straight up telling her.\nThen he's complaining she's only spending 2 weeks with them when she has a whole month off. Bro, it's you. You're the problem. She's dealt with being ordered around by you for years and she's over it. Be lucky she even came home.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 903,
              "content": "She took his ultimatum and ran!  😂 You go girl.  Happy holidays.",
              "id": 22,
              "comments": [
                {
                  "score": 320,
                  "content": "Fr, she was like \"FINALLY\" 💃🏻 \n\nGood for her, wish I could shake her hand.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 187,
                  "content": "Tell me you don't respect your daughter, without *telling* me you don't respect your daughter.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Except that he basically hired a skywriter with this post to spell out in detail how little respect he has for her, her job, her studies, her time, her autonomy, her ambitions, or even her students.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "This is almost exactly how I was able to move out of my father's house. He said it's his house and his rules and if I didn't like it I could pack my shit and leave. \n\nThis was after forcing a 9:30 pm curfew, and I was 19. Of course, it wasn't in effect on the nights I worked until 11:30. (Rolling my eyes so hard.)\n\nBut as soon as the words left his mouth, I jumped on it. Threw what I could in trashbags and bolted. Disappeared on them for two weeks. They only found me because my step mother went driving around looking for my car. It was a really small town.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "she's *getting her PhD* and he's asking her to run these menial errands for him.  good for her having the wherewithal to stake her territory!",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "As soon as he said \"I TOLD her\" and not ASKED, I knew this was going to be a YTA verdict. And how he writes about her \"sitting on her ass\" like she's doing nothing. Even if she was sitting there twiddling her thumbs I'd still say he's TA for expecting her to bend to his beck and call without being asked.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Let’s be real OP probably bullied his kids teachers for years because he has no respect for the profession, and now he’s doing it to his own kid. OP is a spectacular AH, entitled and a selfish jerk. Get off your happy ass and do your own work dude!",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Dude is bitching he can’t order around a 28 YO like she was 16.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "YTA- so do you sit on your ass in front of a computer all day at work? That’s what you’re basically saying about her work even though it’s done from home it doesn’t mean it’s not time consuming a difficult. She is not your errand, boy, and the way you ask her is so derogatory. Don’t be surprised if she ends up going no contact with you in the future.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "And he even went through extra effort, looking up due dates, to make her do his errands.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "He'll be on Reddit wondering why she won't let him walk her down the aisle",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Self-centered narcissistic male behavior. \n\nOnly HE has a real job because it’s scheduled. \n\nHe needs it done now for best selection. \n\nME ME ME….  And then to check her due dates online?  \n\nShe wouldn’t stay there at all if she didn’t feel obligated because he insists.    Should tell him everything he needs to know but he had to ask AITA because he still thinks he is right.  So sad.  Less and less contact begins. …",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2060,
          "content": "By god, couldn't have said it better myself.\n\n> But she doesn't have a \"long day of work,\" she's sitting on her ass on her computer all day and doesn't even have scheduled hours to work, she can do it whenever she wants. \n\n> She said that she needs to have her grades done by today but I looked it up on the website and she has until Monday evening so I called her on her BS, and she said she had \"other work\" due on Monday so she needed to get the grading done today.\n\nOP is an AH and must not know the amount of work and tight scheduling a PhD requires, even when it works at one's own hours. I'm doing a PhD, I'm exhausted 75% of the time and sometimes have unpleasant hours. I totally get OP's daughter wanting to enjoy vacations in peace jfc.",
          "id": 35,
          "comments": [
            {
              "score": 1682,
              "content": ">OP is an AH and must not know the amount of work and tight scheduling a PhD requires, even when it works at one's own hours. I'm doing a PhD, I'm exhausted 75% of the time and sometimes have unpleasant hours\n\nYeah OP sounds extremely ignorant about the workload of a PhD. I'm in my final year now and haven't had a full weekend off in months, even though half my work is \"sitting on my ass behind a computer\". The fact that he thinks his work is more important than hers says enough about what an AH he is",
              "id": 36,
              "comments": [
                {
                  "score": 461,
                  "content": "When I was in graduate school, I had a woman I'd went to high school with ask me when I was going to \"quit playing at school and get a real job.\" The amount of disrespect for graduate students is unreal.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 101,
                      "content": "I’m in my first year of grad school in biomedical sciences. And there’s already so much work AND for so little money that it’s hard to afford things. Don’t get me wrong, I don’t regret it (yet hahaha). But it’s a lot of work. And I’m in a program where I don’t have to TA",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yeah I never worked as much in my life as in my last year of grad school. Take care of yourself though, grad school burnout is a real thing! Spent the first few months of a postdoc basically recovering from my thesis. And I work in a field where I can really work whenever/wherever I want!",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "His *errands* are more important than her work!  What. An. Ass.  Yuck",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "In the last year of my PhD, I think I'd take off part of Friday evenings (to join the department drinks and avoid going insane) and Sunday mornings (to do laundry and grocery shopping) and that was about it. The rest of the time was either working or doing the bare minimum to keep myself functioning and basically presentable in public.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 634,
              "content": "And honestly, the times I’ve had to explain “other work” sometimes takes longer than the other work itself. \n\nAnd sometimes those with farther off deadlines, I finish first because people pestering me takes up time or it allows the parties I submit to to give feedback earlier which makes my next phase of work easier. \n\nThis triggered me. YTA",
              "id": 42,
              "comments": [
                {
                  "score": 326,
                  "content": "You're so right!\n\nSometimes urgent work is doing something that's due in two weeks just so the other 3 reallyyyy urgent things that are due the week before that can be done on time.\n\nFlexible working hours is not the same thing as having a lot of free time ffs.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 19,
                      "content": "You know OP would also not understand if someone was WFH that that meant that they had to work those hours and not do household chores. Heck, he's probably even a manager who wants asses in chairs because he doesn't trust anybody to manager their own time appropriately while remote.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Yes, it’s like, excuse me for the next 3 months, I have to write a book. I’m getting triggered too.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "It triggered me as well.   My father never respected the amount of time and work it took for grad school.  I suspect he was actually trying to sabotage my efforts on that one, at least subconsciously, as he stopped at high school.  He showed up at my door after his gf kicked me out and would tell anyone who would listen how he saved my roommate and I from disaster.  \n\nAny time I would sit at the computer,  he would come up with some kind of work that needed to be done around the house.   You could time your watch to it and like OP, he would throw a temper tantrum if I didn't immediately cede to his demands.   We had a very rough relationship and I moved out the week after I finished school.  We do better now, but it was a long journey.   \n\nOP, YTA and you're doing nothing but fomenting resentment by disrespecting your daughter's time, work,  and accomplishments.  Also, do some research into how exhaustive mental work in front of a computer is.  I did heavy manual labor throughout my teens/early 20's (commercial fishing/construction/butchery) and I was never as tired as I was during grad school and PhD is even further.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 546,
              "content": "Why do people always assume doing work on a computer isn't tiring? Sure, physically you are fine but the mental strain is still there.",
              "id": 47,
              "comments": [
                {
                  "score": 437,
                  "content": "There is a legitimate term called cognitive fatigue. The brain is not technically a muscle, but it kind of acts like one. When a person runs on a treadmill for an hour their muscles become fatigued. The brain does the same thing. When it is working at its peak for an extended amount of time, it gets fatigued. \n\nJust like physical endurance, everyone’s cognitive endurance varies. Some can run on a treadmill for an hour while others may need a break after 30 minutes. Though it is recommended that no matter the amount of endurance one may have, they should still take a quick 10 minute break every 50 minutes to really recuperate. Studies show that people who take these little breaks can maintain their cognitive endurance longer throughout the day, have higher productivity, and overall cognitive functions (like memory, executive function, etc) are improved after these breaks. \n\nThere’s so much more on cognition and highly recommend looking into the Allen’s Cognitive Disabilities Model as it really shows how cognition changes throughout the day and what can affect cognition. \n\nJust fun fact for ya.\n\nAlso, OP you’re AH.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I disagree that you are always \"physically fine,\" even. Sitting for long hours is bad for your body, and while that problem can be solved, it's not cheap (I paid $400 for my own standing desk and even more for various accessories to make it usable at home (anti-fatigue mat, cable management so nothing goes haywire when the desk is moved, etc.), and my office paid a lot for me to have the same in my workplace office). And my vision does NOT work right if I have a truly busy day where I forget to look away from the screens regularly. I paid extra for blue light filtering on my glasses, and it helps, but it's not a cure-all.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I have a feeling OP doesn't understand academic work AT ALL. Maybe he has never tried something similar and is surrounded with people talking about 'soft hands' and 'never doing a day's honest work'. But even so, he is a MASSIVE asshole for treating his adult kid like that. She is LITERALLY a guest in his home, and should be treated as such, and if he can't do THAT, treat her like an adult, it's the absolute minimum here!",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I recently got promoted. Prior to the promotion I did physical labor every day. Building giant liqour/wine displays, organizing storage areas. Probably lifting 100 or more boxes a day, some super freaking heavy. Now I maybe do that twice a week, maybe 3 times. It's majority computer work and talking to sale reps. I'm more exhausted on my sale rep days than any. I literally sit at the computer all day and talk to people about beer. I miss just lifting stuff and organizing sometimes.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 398,
              "content": "She literally said she had other things to do when the grades were due. OP only cares about what he wants not about anything else. YTA.",
              "id": 52,
              "comments": [
                {
                  "score": 267,
                  "content": "But didn't you hear? He doesn't wanna go on an errand after a long day of work /s \n\nI'm surprised he didn't stamp his foot and ugly cry",
                  "id": 53,
                  "comments": [
                    {
                      "score": 213,
                      "content": "the audacity of \"I need to exchange a gift I'm giving to someone and actually youuuuuu need to do it because i don't want to go after work but no not later you need to go noowwwwwwww to do me this favor!!!\" and \"well i online ordered a gift for pickup so YOU need to go pick it up for me nowwwwwwwww because i don't want to and you have time to eat breakfast so that means you have nothing else to do\"",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "And don't forget, if OP is not aware of every detail of those other things then it doesn't matter! /s",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "The fact the he checked up on the website just to try and prove he was right is very telling of how huge of an asshole he is.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "When I was in grad school, the end of the semester meant finishing up papers and other projects for the classes I was taking, and grading final papers and exams for the 2 classes I taught, and then calculating final grades, filling out the official final grade form and running to the Admin building at the very last second to submit the grades (in the days before everything was online). We had to submit final grades 48 hours after the final exam. No exceptions. \n\nThis OP sounds a bit like my dad, who once asked when my last class was. I told him. And 2 days later, he informed me that he had set up an appointment for a family photo 2 days after my last class. I just about lost it. I wasn't going to be able to go home for two weeks, what with finishing up my work and having to administer final exams. \n\nHe was furious with me. But he never asked, \"When are you coming home?\" He only wanted to know when my classes ended. Why he forgot completely about finals I will never know.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yep. Not to mention that if it's a module that has several groups / is graded by several people, then they also need to do moderation and sometimes double grade some essays.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "You can do it! I finished mine five years ago next month and admit that there were times only my refusal to quit kept me going. Good luck!",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1803,
          "content": "Right??\n\nOP, what in the Cinnamon Toast Fuck is wrong with you??\n\nDo you have ANY IDEA how tough grad school is?? She is NOT sitting on her ass, FFS.  She's managing her own time with the myriad of responsibilities that grad school entails and you're throwing a hissy fit because she doesn't have time to be your errand bitch??\n\nI really don't get parents like you.  You clearly don't care what's going on in your daughter's life.  All you see is what she can do for you instead of being proud of her accomplishments and hard work.  How about YOU get off your ass and return the sweater for YOUR child, instead of expecting your daughter to do it for you?\n\nYTA and your attitude sucks.  I hope your older daughter keeps her distance.",
          "id": 60,
          "comments": [
            {
              "score": 416,
              "content": "She’s “sitting on her ass” but he works in an office. Okay bud",
              "id": 61,
              "comments": [
                {
                  "score": 298,
                  "content": "Exactly. *He's* too tired to take care of his own shit after a long day, but she should go do it for him during her work day.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 320,
                      "content": "He sure had time to track down her university’s grading calendar though, as if posting grades is her only work task anyway.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "But his gift is for his mom, who is HER grandmother, so it's her responsibility to get HIS gift🙄🙄. /s",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "That was my favorite part, she's lazy because she sits in front of a computer... but he works in the office and has a \"long day of work\"? The fuck?",
                  "id": 65,
                  "comments": [
                    {
                      "score": 11,
                      "content": "And I absolutely guarantee that barring a very small percentage of office jobs(which he’s probably not in since he doesn’t get it), her PhD work and grading are more difficult and time consuming.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 414,
              "content": "\"Cinnamon Toast Fuck\" 🤣🤣 Thank you for making me laugh 😁",
              "id": 67,
              "comments": [
                {
                  "score": 17,
                  "content": "I’m going to be looking for opportunities to use this phrase now😂😂😂",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My new favorite phrase!",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "“What in the Cinnamon Toast Fuck?!“ has just been added to me favorite sayings, thank you for a fun upgrade, I love it!",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 638,
          "content": "Right?! OP, YTA. She has a month off and you wonder why she only wanted to stay a couple of weeks....maybe it's because you demean her work and act like she should run your errands like a good subserviant girl to the man of the house. \n\nThe 1940's called, they want their attitude towards independent women back.\n\nEdit to respond to OP's edits:\n1 - She is FUCKING busy and she's 28 working on her PHD...you ever work on getting one of those? Then fuck off about the deadlines, she's not in high school, she just wants you to lay off her so she can get work done for Christ's sake. \n2 - When you don't follow the standard of I (54M)... people will read it from the gender perspective in which they feel it is coming from - which for me, I thought you were a woman too until at the end of the post.Then it made sense. Patriarchy hard at work here.",
          "id": 71,
          "comments": [
            {
              "score": 189,
              "content": "Assuming that just because there is a month break between classes, that grad student have that full break is not valid. If her work involves any life sciences, she may have time with special equipment scheduled to run experiments or assays during that time, when less people are around, or just assays to run to keep on track, or research animals to take care of, run through behavioral assays, etc  I am sure chemists, physicists, others have similar things that happen over \"breaks\".  I do not know what a more liberal arts grad student might do- but I would bet they ALSO have stuff to do- at the very least prepping class materials and setting up the online stuff for next semester teaching load.\n\nJust because a grad student is not in class does not mean they do not have work to do. Also OP- YTA X 1billion, signed a PhD that remembers grad school)",
              "id": 72,
              "comments": [
                {
                  "score": 12,
                  "content": "Well, I don't know about any other liberal arts program, but the students in my theater program were running shows, doing and supervising build work and other prep for other shows, auditioning for summer internships, etc. I'd imagine it would be similar in other programs, that any time not spent grading would be spent either working on your own projects or supervising undergrads working on theirs, applying for internships or conservatory programs, etc.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "My daughter lives abroad and comes home for Christmas and she spend some time with us but also time with her  friends and I understand that because she’s a grown ass adult. It’s a gift that she wants to spend time with us and I cherish it and don’t make her do my work.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 403,
          "content": "How is it that somebody who admittedly reads these all the time doesn't realize what an obvious bag of dicks they're being.",
          "id": 75,
          "comments": [
            {
              "score": 103,
              "content": "Cognitive dissonance is a hell of a thing, and insight can be a rare commodity it people like this.\n\nOP, you're a false tyrant, trying to hold on to the last shreds of your perceived superiority.\n\nWhy in the ever loving flying fuckerdoodle do you think you have a right to tell her how to work and earn her degree?\n\nYou're going to become a regular poster here if you don't change, because your daughter chose to leave over dealing with you.",
              "id": 76,
              "comments": [
                {
                  "score": 18,
                  "content": "Flying fuckerdoodle 🤣🤣🤣",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 372,
          "content": "This is the perfect reply and I wish I could upvote it more than once.",
          "id": 78,
          "comments": [
            {
              "score": 122,
              "content": "I had freebie coins.  Award sent on your behalf.  :)",
              "id": 79,
              "comments": [
                {
                  "score": 10,
                  "content": "That's so cool of you",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "Yeah, former grad student and grading is HARD, especially when you’re doing it first time and probably following someone else’s rubric.  And your stipend that keeps you in school depends on not p*sing off the professor you’re working for.  And you need to have YOUR grades done by a certain date so that the PROFESSOR can have THEIR grades in on time and yeah…\n\nGrading is HARD work, and she is also a grad STUDENT, meaning she is also finishing up her OWN exams/final papers/thesis/dissertation/what have you (depending on how far along she is), which ALSO have firm deadlines that grad school professors don’t generally allow slack on.\n\nOP, your daughter is BUSY.  She doesn’t have TIME to be your personal assistant.  Grad school is HARD, it is DELIBERATELY designed to be the academic version of boot camp, and it is TOTALLY unreasonable and unfair for you to categorize her IMPORTANT work as “sitting on her ass all day.”\n\nI hope she goes NC with you.  I surely would.  YTA",
          "id": 81,
          "comments": [
            {
              "score": 149,
              "content": "Since you brought up the grading, can we also talk about how this dude had the time to look up when the grades were due, for some kind of gotcha moment, but couldn't return the sweater. At that point he is just being petty",
              "id": 82,
              "comments": [
                {
                  "score": 13,
                  "content": "Which I don’t understand at all. The grades are due tomorrow. It’s probably not the best idea to be working on them the day they are due.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Also, as a Uni admin... we tell all our profs to get their grades in EARLY the portal has a tendency to crash the last hour of the deadline if too many people try uploading at once.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "I couldn’t even finish it. Why does the older daughter HAVE to go out and get the younger daughter a replacement gift for dad that he MESSED up.  It’s weird that the dad expects his daughters life to revolve around his own.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "College faculty get added to a “list” that goes out to the entire division if our grades are even close to the deadline. If they are due Monday, somebody is already paying attention Friday to who hasn’t submitted.\n\nI am college faculty, and yes I have flexibility in my schedule, but the work needs to be done when it needs to be done. And it is very hard to start and stop and start and stop. It makes it take sometimes twice as long. \n\nI was 28 and in graduate school. And if my parents had treated me this way, I wouldn’t have wanted to have a relationship with them. My parents understood that graduate school is a full time job, sometimes more than one, and they had reasonable expectations of me. I didn’t realize that was something I should have been grateful for from my parents. Op has shown me I took that for granted, and their understanding about my schedule and boundaries is a major reason they are a big part of my life today and I moved to be closer to them. \n\nYTA",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "As a university faculty member myself... what the website says for when grades are due and what your department requires are vastly different sometimes. My department requires all grades to be submitted within 48 hours of the final exam date and time. This means I had to work all day last Saturday and Sunday to submit my grades by noon on Monday, even though the universities website says grades are due the 20th...YTA",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15842,
      "content": "YTA. This must be a joke… too many ridiculous assertions. The first, suggesting that sitting at a computer isn’t work/hard work. Mainly, that you can be surprised she doesn’t want to visit when you just use her as an errand girl when she does. \n\nAlso, none of your requests were urgent so why on earth can’t she get them done in her own time?? If you’re asking a favour,don’t be so demanding.",
      "id": 88,
      "comments": [
        {
          "score": 5766,
          "content": "My friend who is a radiologist always works from bed in his pj and a bag a chips and makes close to 500K, reading images. My husband is a lawyer and most of his days he is in his pj in bed “writing some comments” for top law firm in the country. You ignorance about work from home, is not your daughter’s problem. And her having some breakfast in the morning is just a healthy way of starting a day. You are so bitter towards her, cannot sense any love from you. She deserves better.",
          "id": 89,
          "comments": [
            {
              "score": 1773,
              "content": "[removed]",
              "id": 90,
              "comments": [
                {
                  "score": 650,
                  "content": "Yeah. I've been in grad school, and I've been employed full time. Grad school is *definitely* busier and runs into personal time a lot more.",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 248,
                  "content": "I don’t know how a phd program is run in the us, but she also can’t be grading her own work. So whether it’s paid or not, or it’s a requirement of her enrolment or not, she’s doing work for the school in addition to the minimum requirements of her phd.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 180,
                      "content": "Yep. And my bosses during grad school all had their own dates for when grades needed to be in to them, usually earlier than the final grade date.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "For sure! It’s probably that she has to be a teachers assistant for a professor’s other courses. She could be grading 250 papers which could be 1-10 pages each. I bet the dad hasn’t even read 250 pages all year. Much less crammed into 2 weeks before the grades are due.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Just adding for clarity, the ability to arrange for a comfortable work environment does not mean it isn't work. People like OP might read bed, pajamas, and snacks as if you had said naps, binging Netflix, and texting all day, which is generally not the case.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It doesn't matter how/when people work. The fact remains that everyone has their own priorities and they don't revolve around this person's priorities. \n\nIf my parent spoke to me like this I'd tell them to fuck off and sort their own shit out cos I've got enough on my plate.\n\nI have no problems helping out where I can but the demands here are ridiculous and entitled",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "That breakfast comment was so ridiculous! “How dare she eat when that takes time away that she could be running my errands.” Like WTAF.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Kid sounds like she doesn't want to be around this shit for the holidays and is only here on pity and the dad does this. As if he isn't the one who needs her. My god.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "my bestie programs AI and I've never seen him NOT in bed while working.  Tons of high paying, professional jobs require you to \"sit on your ass on the computer all day.\"",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1852,
          "content": "I struggled not to dismiss this immediately as either fake or written by the daughter, but it’s too deranged for the latter??\n\n> I think it’s ridiculous that she is throwing a fit just because she can’t constantly live like she’s the only person on the planet\n\nPOT. KETTLE. BLACK.\n\nEdit: thanks for my very first award!! 🥹",
          "id": 100,
          "comments": [
            {
              "score": 359,
              "content": "I got the same feeling as you, but on the off chance that it is real, someone needs to figure out that he has a grown up daughter who isn't really thrilled to be in much contact with such a controlling parent.  I bet the only reason that she was there was because she was doing it for her Mom and sister, not him. \n\nSomeone is in for a rude awakening when they find themselves alone......",
              "id": 101,
              "comments": [
                {
                  "score": 34,
                  "content": "It’s very real. Check out the raisedbynarcississts or estranged subreddits and you’ll see these parents exist.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Anyone want to bet on the likelihood of mom and sister spending Xmas with this grad student and her girlfriend, and OP spends it alone, or with his mom- trying to explain why he is alone?",
                  "id": 103,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Not taking that bet, but OH!! how I wish!!",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 214,
              "content": "I agree except nothing in this indicates that the daughter is living like she is the only person on the planet, so while OP definitely qualifies as the pot, I am not sure that the daughter qualifies as the kettle.  Grades are typically due by 24 hours after the final with all due by some deadline.  Daughter may very well have had grades due followed by something owed to her advisor in time for them to post grades.  Calling his daughter a liar without all the facts is yet another reason OP gets YTA",
              "id": 105,
              "comments": [
                {
                  "score": 25,
                  "content": "Additionally, if she needs to upload them to a virtual learning environment, at the same general time as all her colleagues... Well, it's definitely prudent to upload as far ahead of the deadline as you can, lest you be sat for hours crying down the phone to IT",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "There is no “kettle” here as OP’s\ndaughter isn’t an asshole like OP is.  OP’s daughter isn’t asking anyone to run errands for her because she’s too lazy to run them herself.  She isn’t demanding that those errands be run on her schedule, instead of the person she’s asking a favor of.  She isn’t doing internet sleuthing to prove the person she asked a favor of is a liar when they said they need to work before running those errands.  She also didn’t tell anyone that if her errands aren’t run when she wants, then that person need to leave.",
              "id": 107,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "My personal favorite is \"the worm calls the snake legless\"",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Except it is the POT calling the brand new, shiny stainless steel or aluminum, or whatever, cookie sheet, black. Cause that girl is NOT acting like the center of the universe- she was willing to run the errands, as they fit with her on work schedule, not daddy dearests personal agenda and timeline.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My ex and his spouse treat my kids this way, sending them to do all of their personal errands all the time, and they say the SAME THING if there is any push back.  Telling them how selfish they are and that they aren't the only people in the world.  It's such a ridiculous insult since the errands are ALWAYS for them, and never the other way around.  They are the ones being selfish!  Do your own errands!",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "If you haven’t met ppl like OP, who don’t consider anyone else’s time or needs as important as theirs, you’ve been lucky.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 747,
          "content": "I’m just wondering, if daughter wouldn’t be there how on earth would all the gifts been picked up/ exchanged/ bought?! Would OP miraculously have time to run all these errands? I’m guessing now she has to… Dobby is free!\n\nOP, YTA. You can ask someone to do you a favour, but if you are demanding when and how it must be done, then do it yourself! You don’t think your daughter is working hard/ her work is important. She doesn’t think that she should drop everything when you tell her to do something. At the end of the day, she would have been doing you a favour. Your lack of organisation is not an emergency of hers!",
          "id": 112,
          "comments": [
            {
              "score": 272,
              "content": "He’ll find out next Christmas, cause I guarantee she won’t be back.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 189,
              "content": "Remember, eating breakfast is a crime as is doing your work on a computer. She's supposed to jump at his command with no questions asks while he smugly treats her and her work as irrelevant because she's not in an office.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Unless her name goes on the gift too I’m not sure why it’s so important for her to do it. Plus, grad school is hard as fuck, typically more tedious and time consuming than the job you do after graduating. “Sitting on her ass on a computer” is studying or writing papers. YTA",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I was waiting for OP to say that he had mobility issues or was sick or something. \n\nNope just lazy.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 363,
          "content": "His daughter is a fully-grown adult. Even if she was sitting on her ass all day doing nothing, that is her right. Having free time does not require her to take on his duties or responsibilities. \n\nSir, YTA for sure. I hope the rest of your family joins her and the girlfriends’ family and leaves you to think about your selfishness.",
          "id": 117,
          "comments": [
            {
              "score": 183,
              "content": "He feels like one of those people who complain about Millennials and their avocado toast and lackadaisical work ethic and how when he was young… not realizing that A) Millennials are fucking adults now with families, B) they can barely afford bread let alone avocados, and C) they have plenty of work ethic, but they learnEd that they also need a healthy work/life balance and the way to accomplish that is by setting boundaries.",
              "id": 118,
              "comments": [
                {
                  "score": 31,
                  "content": "Also his generation raised those millennials. I also hate when they complain about the “participation trophies”. Kids don’t give trophies to themselves. It was the parents’ idea to buy them!",
                  "id": 119,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yep my parents asked me and my sister recently if we wanted any of our old soccer trophies since they are cleaning out their house. I said no since I couldn’t care less about those trophies and my sister only wanted her fishing tournament trophy lol. Those participation trophies though, they wrecked our whole generation /s. 🙄",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I know I used to LOVE taking my very rare UNPAID time off from grad school to go \"home\" over holidays/for big family events only to have \"family\" decide that meant I was their personal errand girl. One year, my brother decided that the ONLY weekend he could move his home was over Memorial Day when I was home for another family event and to se our parents, and already had scheduled plans with them- he fully expected me to take 4-5 days of my PTO, USE MY RENTAL CAR to help him move, more than 4 hr in the wrong direction from my parent or other family events, and further away from the airport where I had flown in from. But to him, my noping out and going to stay with friends form those days of that trip has made me a raging AH for more than 20 yr. No one let me know ahead of time- guessing he hoped to \"trap\" me into having no options. But again- I am the AH in his eyes for not falling in line with his plans.  An others in extended family agree with him- I am the AH.  And they wonder why I avoid spending any time with them like the plague ever since.\n\nJust for more perspective, even when we lived in the same small city, he NEVER helped me move, and he certainly never bought a plane ticket, rental car, or took PTO (or time away from his business) to help me move either. But somehow I was supposed to do it for him, with no advance notice.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 256,
          "content": "Plus, he's angry she's not spending her entire break with him. She's a 28-year-old adult and he's treating her like a teenager. He didn't even ask. He told. She's VISITING now, not living there and he doesn't get to treat her like his personal assistant. He should know she has absolutely no obligation to come home ever. I think he needs to learn a few lessons about adult children. You don't own them for life. YTA",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "My boyfriend's family is like this. Part of it is cultural (family comes first always) but he ended up having to work on his thesis and work for his master's program at absurd hours of the night because cleaning and errands for the family and everything came first and the only time he got was after his parents went to bed. His family are good people but it was like they just didn't understand that leaving to do errands out or around the house left no time for a degree. He still got his degree but it made it so much harder on him.",
          "id": 123,
          "comments": [
            {
              "score": 28,
              "content": "Do they have degrees? A lot of families without legit don’t understand just how much work it is.",
              "id": 124,
              "comments": [
                {
                  "score": 23,
                  "content": "Oh good point. No, neither of his parents had the opportunity to get a degree.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "PhDs are insanely hard. You can tell that op is one of those ‘if you’re job is on a computer it doesn’t count’ people. YTA",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "dude works at an office, so i imagine a good deal of his work involves sitting at a computer. but he had to put on pants, maybe a tie? perhaps even endure small talk with Pete from accounting? he's the real hero here",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I work from home, the job I do requires work to be timely and done that day, some work as to be done before certain times during the day. I also have to review reports and get those done by certain times of the day. OP gotta realize someone in front of a computer doesn’t mean scrolling through Facebook. It means they’re actually working and doing stuff that is timely.",
          "id": 128,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "More importantly,  why cant OP run their own damn errands on their own time????",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9130,
      "content": "YTA. OP, you’re only 54 and are expecting your daughter to run errands for you like she’s a paid shopping assistant. You played the “I’m your mom and you must obey me” card and you lost.  I’m pushing 80 and I never ask my young relatives to do something for me that I’m capable of doing myself or hiring done. My mother had your philosophy — children are supposed to DO for their mother — and she died alone in a nursing home because nobody could stand to be around her. Read and learn.",
      "id": 130,
      "comments": [
        {
          "score": 1812,
          "content": "This is the dad.",
          "id": 131,
          "comments": [
            {
              "score": 1931,
              "content": "Message still stands.",
              "id": 132,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 187,
              "content": "Same difference",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "Yes, but I think she/he was relating their personal experience, figuring that he would understand the general message. Which I think fits perfectly in this situation.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 260,
          "content": "I'm confused why OP is 54 and he hasn't figured out he's a grown ass adult and can run his own errands 🤦‍♀️",
          "id": 135,
          "comments": [
            {
              "score": 14,
              "content": "Because in his mind he \"works a real job\"and she \"sits around all day in her pajamas doing nothing\". \n\nNever mind that not only is she grading papers, she's grading ENGLISH papers which means it's not a page of multiple choice answers or math problems where your checking to be sure the student proved their work, she's reading pages and pages of ESSAYS. \n\nDepending on how many students she's grading that takes hours to days. And, that deadline OP is waving in our face probably isn't her deadline, it's probably her co-ops deadline and she needs to get the grades in to them earlier so they can review and make changes if needed. \n\nOP just obviously has no respect for his daughter or her choice of profession. Hope he likes being alone because she's just about done with him from the sounds of things.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 232,
          "content": "This! I bend over backwards for my mother because she’s my mother.. but she never demands it and I have told her “no” plenty if she ASKS! To be respected, one should respect. I am the same age as your daughter, and my mother OPs, and OP is wasting a lot of valuable time (because she’s a PhD student, she’s working her ass off to work more!) with her adult child. \n\nAlso, I love you lonnielee. 😙",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I'm 10 years older than OP and I take care of my own errands.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "My mother told me she had me as a retirement plan. Guess who's going to a nursing home.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5873,
      "content": "YTA\n\nHow can you not see what a major AH you're being? She's a 28 year old grown woman and you're trying to boss her around like she's 14. She is very busy with her phd, yet you seem to think she's sitting on her ass doing nothing all day. \n\nGuess what? She doesn't have to do a thing you tell her to do, just because you say it. Get over yourself, you're not the center of the universe. I hope you're happy that you drove her out of the house and won't see her over the holidays, all over not being able to accept that she's now an adult with her own life.",
      "id": 140,
      "comments": [
        {
          "score": 1698,
          "content": "Sounds like he is jealous of her getting a PhD and surpassing him in life.  Instead of being proud, he is looking for ways to sabotage her success.",
          "id": 141,
          "comments": [
            {
              "score": 1304,
              "content": "I suspect this is exactly it. \n\nMy dad behaved like this during my PhD. Like, I swear my dad wrote this post while I was reading it. He is the reason I limited contact and why I felt like garbage during holidays. He legit told me many times that \"you're in for a reality check when you get a REAL job\" because juggling teaching, taking classes, and doing research isn't a real job. Working 60 hour weeks isn't a real job. \n\nTurns out my dad was jealous and felt threatened that his child was getting a PhD. He didn't even finish his bachelors (and has successfully lied about it for 30 years, saying he's got one in computer science). I have a BS and PhD in a multidisciplinary STEM field. I was a very successful grad student. And that success somehow threatened him, a grown ass man who had a job of his own, and that meant he needed to take me down a notch at every opportunity, including sabotaging me when possible. The grading situation in this post? EXACT same thing happened to me. \n\nI went no contact with him a while back and while I do miss having a dad, it's really nice not being actively sabotaged just because I don't fit in his box of what an ideal child should look like. And yet he has no problem bragging to others that I've got a PhD nor does he have any issue trying to take credit for it. He seriously tried to take credit for me being successful at my graduation by posting on fb about it but couldn't be bothered to even text me \"congratulations\".\n\nIt's all about maintaining control and trying to uphold the \"image\" he wants. That's all this is, and fuck anyone who gets in his way even his own child. \n\nGod I feel salty now.",
              "id": 142,
              "comments": [
                {
                  "score": 268,
                  "content": "[deleted]",
                  "id": 143,
                  "comments": [
                    {
                      "score": 16,
                      "content": "My dad did the same thing. I did a successful 4 years in the Marines as a computer network specialist, earned a bachelors in mechanical engineering and obtained an MBA. When my dad was alive, all he could say was, he was sad I didn’t go to HVAC school and start my own company. He could never say he was proud of me because I didn’t live out his dream of being an AC specialist in my crummy little hometown.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 191,
                  "content": "I hear this so hard.  I only got a Bachelor’s, but I was the first person in my Dad’s family to go to uni.  He was an absolute dick to me whenever I was home for the holidays, acted like I was an interloper and tried to shout me down whenever I had an opinion on family matters.  He never gave me a single penny towards my education (Mum, bless her, gave me a bit of help from her part-time job), yet he bragged till the day he died about how he “put me through university”.  Guess who couldn’t squeeze out a tear at his funeral?",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "How you handled your situation is exactly how OP’s daughter should handle hers. And since your dad won’t say it, I will:  congratulations, you are awesome!",
                  "id": 146,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Thank you! My dad has always been a self absorbed asshole but I really understood just how bad it was when he would make disparaging comments while I was in grad school and then tried to take credit for my PhD after not even acknowledging that I have one. To this day I've heard nothing about it, just a fb post he intentionally didn't tag me in where people heaped praise on him for MY PhD...",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "What is the psychology behind a parent being jealous of their child?",
                  "id": 148,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Probably somewhere in the same realm of parents who get upset that \"kids have it sooooo easy now\" because since they struggled with something their kids should too. Even though the whole point of a healthy society's growth is to make future generations prosper.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I relate to this so much. Going NC was the best choice, and it certainly involves grieving",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "That he is jealous jumps right off the page.  The only way he can handle it is to demean and insult her and order her to do his menial work so he can feel superior to her.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 853,
          "content": "What I found funny was when OP said \"well if you dont wanna help you can leave\" and she was like \"SEE YA!\"  I imagine OP &his daughter have had problems before and she was just waiting for OP to start with his usual shit and she would leave with little hesitation",
          "id": 152,
          "comments": [
            {
              "score": 198,
              "content": "Yeah that certainly blew up in his face didn't it? lol",
              "id": 153,
              "comments": [
                {
                  "score": 126,
                  "content": "Definitely! OP's daughter was probably thinking the whole time \"I really wish I could get away from this guy somehow\" and OP gave her the reason she needed to get the F out of there.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "And then he paints her as immature for doing exactly what he said 😂",
              "id": 155,
              "comments": [
                {
                  "score": 9,
                  "content": "Honestly OP sounds like a nightmare, imagine you bust your butt at school and finally get a break during the holidays and instead of relaxing you spend your time working. Then OP asks you to stop working so you can do him a favor??? He should be asking his daughter to stop working and relax not complete his \"to do\" list",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "My daughter is 7 and I still don’t boss her around like this because I believe even children deserve respect and don’t need a dictator as a parent. \n\nOP seems to expect his daughter to jump to his every demand.",
          "id": 157,
          "comments": [
            {
              "score": 34,
              "content": "I know, I have two kids and don't treat them like that at all. There are expectations for chores we pay them to do, but we don't bark orders at them. We respect their time and when we ask for help, don't expect them to jump up, but they can finish what they were doing first.",
              "id": 158,
              "comments": [
                {
                  "score": 26,
                  "content": "Yeah, I agree.\n\nIt’s just so crazy to me how people seem to make so many demands and just expect their children to go with it simply because they’re their children.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I know and I really hate that. Maybe that's why I have such a good relationship with my kids (11 and 17), as well as their friends for that matter.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "No kidding! I’ve been confused at people saying “bossing her around like a child” or whatever, because that kinda sucks to do to a kid? My mom might ask me if I would mind running an errand for her while I’m home visiting, but it is an ASK, not a demand.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I am most proud of my child for this very thing. He sets boundaries already. He speaks up when he’s uncomfortable. He speaks up when he can see something is unfair. I never boss him around and even if I had wanted to, he never would’ve given in. He’s more than happy to help when asked in a respectful way. He can explain why he’s uncomfortable doing something. He’s been a hard kid to raise because of all these qualities but I am so proud of him. I just know he’s going to be okay because he can speak up for himself. \n\nI am so proud of us collectively as parents. This generation of kids isn’t going to be a bunch of adults that keep their heads down and take the bullshit. They respect themselves and they set boundaries. They are more inclusive and they value their own well being and mental health. \n\nThis idiot op is too stupid to realize that his daughter is a strong and independent woman that will demand to be treated with respect. He doesn’t realize what an amazing accomplishment of a human his child is. He just wants to feel power over someone because he’s pathetic.",
              "id": 162,
              "comments": [
                {
                  "score": 13,
                  "content": "The worst part of raising a kid who takes no shit is that it includes your shit lol.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "I wonder what his level of education is and what it was like in his time because he seems to have zero knowledge in what it's like studying for something...",
          "id": 164,
          "comments": [
            {
              "score": 31,
              "content": "I know. I saw him comment elsewhere about her sitting on her computer in her pajamas as she worked. Um, who doesn't do that when WFH? I mean I could live in my pajamas if I could get away with it, especially in winter.",
              "id": 165,
              "comments": [
                {
                  "score": 22,
                  "content": "The fact he looked up when her grades was due to prove her wrong said a lot about him.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Right. But also, I wouldn't pull my 14 year old from his or her work to do my errands for me. Those are my responsibilities. I wouldn't belittle what they do because I really have no clue what they do and I can't be bothered to find out. If I need help, I would genuinely ask and if the answer is no, I would let it go because they aren't my slave, they're my child and a person of their own with things to do, people to see, places to go. I would not throw a tantrum if they don't come at my every bidding and treat them with any less respect of an individual regardless of their age. If OP wants respect, he needs to learn to give it first.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3594,
      "content": "YTA, bucko. You raised a woman who takes her work seriously and now you can't handle it. Your shopping issues don't take precedence just because you want them to.",
      "id": 168,
      "comments": [
        {
          "score": 1345,
          "content": "I’m just floored that OP thinks his job is more important than hers, so she should just take off whenever he doesn’t feel like rearranging his own schedule and run HIS errands. \n\nOP, she is not your enslaved personal assistant, she is a professional honoring her commitments. YTA - You blew it.",
          "id": 169,
          "comments": [
            {
              "score": 579,
              "content": "OP assumes his job is more important because  he  has no idea what doing a PhD involves and/or undercurrent of sexism vibe around a man's job being more important than any job a woman could have so of course she should drop whatever nonsense she's doing and be his step 'n fetch it. my step father was exactly like this",
              "id": 170,
              "comments": [
                {
                  "score": 120,
                  "content": "Yes, it really sounds like he feels threatened by his daughter getting this qualification and he is soothing his ego by dismissing it as not really being work at all.",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 88,
                  "content": "This right here. \n\nMy dad behaved exactly the same as OP, right down to seriously this exact same incident except about a decade ago. \n\nHe had no idea what a PhD entails. It's not just taking classes yourself in order to get a degree like it is in undergrad. A PhD by definition requires you to make a new, significant contribution to the research in your field. This is a METRIC FUCK TON of work that in itself is a full time job. Add on teaching (the daughter likely has a teaching assistantship) that's anywhere between 15-25 hours a week and between all those things you're doing you effectively work 50-60 hours a week most week and you're getting paid peanuts for it, assuming you're getting paid at all. Many PhD programs come with funding in the form of assistantships but even unionized universities pay barely enough to live off of and don't always waive tuition, so there's a decent chance that even though the daughter is getting paid to teach she may actually be having to PAY to get her PhD. So in addition to all the work she already has to do, add in living near the poverty line and having to constantly worry about how bills will get paid. \n\nBut because you're \"still in school\" you can't possibly have a real job, right? Teaching isn't a real job. And his errands are clearly far more important than her obligations.\n\nI'm so salty from reading this post and wish there was some way I could give support to his daughter. I'm so glad she can set boundaries and enforce them and that it seems she's got a good support network with her girlfriend and that family, because the family she was born into is really shitty and she deserves better.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "But, he wears uncomfortable clothes to go sit on his ass in a room not his own, so his job must be more important.",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I be OP is going to pretend to be shocked when his daughter doesn’t invite him to her graduation ceremony because all she does is “siting on her ass on her computer all day.” I’m sure he’ll pretend to be offended and claim he’s always supported her.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2392,
      "content": "YTA \n\nYou daughter is an adult woman who is nice enough to come visit you, which she doesn’t have to. It is not an obligation to spend time with you. She has tone of work to do and instead of respecting her work and respecting her boundaries, you demean her, her work and her efforts. \n\nIf you need all those chores be done, why wouldn’t you do it yourself? 54 is more than capable to do simple tasks. Would you ask guests who you invite to your house to do those tasks? I doubt it. But you think it’s ok to ask your adult daughter who is working on vacation because of highly demanding career she has. \n\n“She is sitting on her ass all day in from of computer” that’s what becoming a doctor takes. She is doing work on her vacation. PhD is a very hard work, and you just demeaning all her work. \n\nYou sound like a horrible dad. I wouldn’t be surprised that in few months you post here “my daughter went no contact, but all I have been is a loving father”. \n\nI am really surprised how some parents think they can treat a 28 y/o about to be a doctor like a high school kid who is playing video games all day.",
      "id": 175,
      "comments": [
        {
          "score": 773,
          "content": "Also, he mentioned that he was \"going into the office.\" Where, odds are, his job involves sitting at a computer. I have some sympathy for when parents who are more blue-collar have a hard time understanding what their child who's gone into academia does all day, but this ain't it.",
          "id": 176,
          "comments": [
            {
              "score": 172,
              "content": "Exactly! before I finished reading, I thought “I’ve sort of been there, a bit resentful of white collar/office workers when I was working really physically demanding or strenuous jobs.” Then he mentions an office like excuse you sir, I’m curious what you’re doing in that office if not sitting at a computer lol\n\n(Edit to add: and even when I was a bit salty I’d never be so rude and weird about it! Dude needs therapy)",
              "id": 177,
              "comments": [
                {
                  "score": 9,
                  "content": "As someone who’s worked both physically and mentally demanding jobs, I’d take physically demanding every day. Few people understand what mental exhaustion can do to a person.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2135,
      "content": "You sound horrible. She is not your employee, she is a grown woman who owes you nothing. You CHECKED HER WORK CALENDAR??? How DARE you?  For that gross overstep alone, you would not see me for at least 6 months. Unbelievable lack of respect for her boundaries. YTA",
      "id": 179,
      "comments": [
        {
          "score": 511,
          "content": "THANK YOU! I’m amazed more people aren’t more up-in-arms about the fact that he had the AUDACITY to check her alibi to see if she was “actually” too busy to be his errand girl. Saying “I’m busy” or “no” is enough.",
          "id": 180,
          "comments": [
            {
              "score": 17,
              "content": "EXACTLY! No is a full sentence.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 271,
          "content": "In the time it took him to check her truthfulness about her obligations he could have returned that sweater.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Yeah this post is already a lot, but when I saw he checked when it had to be due I was floored. Like how dare you indeed. You're not her fucking boss, or her professor or mentor or what have you. Maybe she wanted to do things in a certain order or have things done by a certain time and, as other people said it seems like it's a time-consuming thing. Unbelievable, this guy. That kind of controlling attitude is so fucking gross.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I can only imagine what kind of parent this asshole was when his daughter was younger. Good god. I'm surprised she's even in contact with this man. He was probably going through her diary as a child and invading all boundaries cause ya know I'm your \"parent\" so I own you and your time. \n\n&#x200B;\n\nI'm so glad she's finally put her foot down. OP is an asshole.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1420,
      "content": "YTA. She is grading, and those have to be submitted within (usually) 48 hours after the final exam takes place.\n\nShe may be \"sitting on her ass in front of a computer\" but getting your PhD is no joke.  If it were easy, everyone would have one.  It's hard work.\n\nAlso, She is an adult and is more than capable of deciding what to do with her day. She is not your personal assistant simply because she is home from school for the break.",
      "id": 185,
      "comments": [
        {
          "score": 518,
          "content": "[deleted]",
          "id": 186,
          "comments": [
            {
              "score": 157,
              "content": "There might also be moderation- she submits her grades, and then maybe they're reviewed and moderated together or separately by other members of the teaching team.",
              "id": 187,
              "comments": [
                {
                  "score": 34,
                  "content": "Yup - every college course I have taught there is usually review by the teaching team - the Professor leading the course usually needs some time to review everything and figure out the overall grade - her due date to submit them to the Prof is certainly earlier than the official date on the website this dad \"knows all about from google\"",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yep, I was thinking this. She may be teaching her own courses (which may still have some sort of review process) and she may be a TA or teaching a discussion section on some courses where the professor has to approve the grading, or a combination of both. My ex had both in while in grad school, and I remember how long grading took and the deadline pressure she was under. It's very stressful! She definitely brought grading to her parents' for Christmas.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yes exactly! I always have to have my grades in about 2 days before they're released so the unit coordinator can moderate. And OP would probably know that this sort of things happened if he had the slightest interest in anything his daughter does outside of serving him.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Both my parents are/were college professors. End of semester always looked like this for them:\n\n\n* Go to work\n* Come home\n* Immediately start grading\n* Order delivery because they didn't have time to cook\n* Grade some more\n* Go to bed at like 2-3 AM\n* Repeat\n\nGrading college level courses is intense. When I was in high school/college, they'd even pay me like $20 per paper to pass through and find grammatical errors so they could focus on content only (languages and their rules have always come naturally to me), and they'd *still* have to grade from the time they woke up until they went to sleep. \n\nGrading fucking sucks, and adding interruptions to the process makes it even worse. It is *far from* \"sitting on your ass in front of a computer.\" YTA **BIG TIME**",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "My bet is when he checked the website for a deadline, if he found anything remotely relevant at all, that was the deadline for FINAL grades. Course grades. To do the final grades you have to grade the final exams/papers first. If she's still in coursework, she has her own finals to hand in. I'm 4 years into my PhD and it is always completely insane at the end of the semester. He doesn't have the slightest clue and he doesn't acknowledge that enough to let her explain herself. I'd be out of there too if my parents acted like this.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And his edit about how she “lied” about the grading deadline only makes it worse. \n\nDefinitely YTA.\n\nDo you even know how time management and deadlines work, OP? Just because the actual deadline is Monday, it doesn’t mean that the work has to be handed in at that exact last minute. People who manage their time, tend to actually plan their entire workload, meaning that you daughter probably has tons of other tasks. Which is why she had to finish grading on Sunday so that she could move onto other business. \n\nSuch and incredible asshole and another case of missing missing reasons for estrangement in the making.",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1396,
      "content": "\"She said that she needs to have her grades done by today but I looked it up on the website and she has until Monday evening so I called her on her BS, and she said she had \"other work\" due on Monday so she needed to get the grading done today (but wouldn't enlighten me on what this mysterious \"other work\" is).\"\n\nShe won't enlighten you because it's none of your business. Your daughter is busy and doesn't have time to run errands for you. \n\nRead your post again and see if you can figure out who is self-centered and childish.\n\nYTA.",
      "id": 194,
      "comments": [
        {
          "score": 1017,
          "content": "What I got from this:\n\n - dad doesn’t have a PHD\n- dad doesn’t know what a PHD even is\n- dad doesn’t understand any of what his daughter is doing\n- dad checked up on her timetable and STILL doesn’t understand what his daughter does \n- because he doesn’t understand it, it’s not really work \n- his last slave died of frustration",
          "id": 195,
          "comments": [
            {
              "score": 231,
              "content": "His last slave escaped. That’s the response….",
              "id": 196,
              "comments": [
                {
                  "score": 8,
                  "content": "His last slave won't be coming home for Christmas again!",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "+ dad is mad her daughter doesn't explain more in detail what her \"mysterious\" work due Monday is after clearly telling her for who knows how long that her job is not a real job (picachu face!!!)",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "- dad resents his daughter for getting a phd",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Lets not miss that dad buys clothes for his daughters that they already own and dad leaves his christmas shopping to the weej before christmas",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Dad doesn't need a PhD to understand why she's busy, he's just an idiot.\n\nAnybody who has ever had a job knows sometimes you have multiple tasks with multiple deadlines. Your time to do a job is determined by your overall schedule not the amount of time you technically have until deadline.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Oh and another layer to what folks have already said- these grades might be as a GTA, meaning the MAIN professor needs to check/confirm them, so they can't be last minute.  OR The department has different earlier deadline than the overall university- which happens regularly in my past experience!!!",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Right? Maybe she gave herself a deadline to get them done because she had other work to do. It’s called time management, something her father clearly doesn’t know how to do.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Also, he doesn’t have time to run his own errands, but has time to fact check his slave-daughter’s schedule.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1099,
      "content": ">asking my daughter for help\n\nOK\n\n>I called my older daughter from work on Friday and told her she needed to run and exchange it for a different one\n\nYTA already for just blatantly lying to reddit when you've clearly just ordered her.\n\n>She said ok, she'd do it the next day.\n\nThat's nice of her\n\n>I said it needed to be done that day\n\nI see you've joined r/ChoosingBeggars\n\n>I said I was busy to and didn't feel like running out\n\nWhat? She's also busy. You don't know everything that grad school is making her do. So if you're not just having a pissing contest with a grad student's workload, you're just self-importantly asserting that your time is more valuable than hers.\n\n>I said well tough, this needs to be picked up today\n\nTough what? You're the person that merely *wants* someone else to do your bidding for *your* nonessential tasks.\n\n>she can't constantly live like she's the only person on the planet\n\nThis is projection.",
      "id": 205,
      "comments": [
        {
          "score": 207,
          "content": "Also, why didn't the sister return her own sweater, so she could pick a different one that she liked?",
          "id": 206,
          "comments": [
            {
              "score": 46,
              "content": "I assume it’s a Christmas present that he also expected his daughter to take the time to pick out the new one",
              "id": 207,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I suspect she didn't even know about this whole interaction, given that she was upset with OP after learning about his actions.",
              "id": 208,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I bet he bought a sweater for christmas only to see younger daughter show up to breakfast wearing it and he realized he bought her something she already owned and decided to deligate the fixing of his fuckup",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Absolutely LOVED the breakdown of this!",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}