{
  "post content": "Backstory my LS is vegan I’m fine eating vegan food don’t prefer it, but I packed a meal in of hot nuggets for when we did the short 5 minute drive, if my 3 year old didn’t like the vegan food which is fine but not to her my other child ate a little bit but wasn’t a huge fan, so I pull out the meal and my LS freaks out on me she says I shouldn’t be feeding my 3 year old a dead corpse it’s like eating children it isn’t btw she then said we all had to eat her food but my 3yo wouldn’t budge she insisted and called her out saying she ate meat when she was her age and She turns into a dragon going crazy then we go and leave than get a burger at one of my three siblings work it was great my 3yo had a grilled cheese and she ate that but my phone blew up from my whole family except my brother the manager of the burger joint who defended me but I really thought did I go to far calling her mindless?\n\n\nIk my grammar sucks sorry you had to read that jumble of words",
  "id": 1,
  "comments": [
    {
      "score": 20,
      "content": "ESH. Her for behaving like a toddler, and you for making us read that.",
      "id": 2,
      "comments": [
        {
          "score": -7,
          "content": "Lol",
          "id": 3,
          "comments": [
            {
              "score": 6,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 0,
                  "content": "I’m sorry but your name is I fart a lot",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "What do you have against dinosaurs ?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "Im a retarded dinosaur that’s my name I love dinosaurs that’s why it’s my name Ik retarded isn’t the right word but idk",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "NTA, but punctuation is a friend",
      "id": 10,
      "comments": [
        {
          "score": -8,
          "content": "Yeah I was not so fond of English class growing up or anything involving grammar",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "YTA - Not because of your actions but your post. I read it multiple times and couldn't decipher it. It's all one big 193 word sentence.",
      "id": 12,
      "comments": [
        {
          "score": 0,
          "content": "lol I agree I’ve been told I have the worst grammar In the world I almost flunked high school because of a D in English",
          "id": 13,
          "comments": [
            {
              "score": 0,
              "content": "Respect for being aware of it, it doesn't seem sooooo bad, maybe it's just the speed your brain works at, much faster than the rest of us!",
              "id": 14,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah the only reason I passed high school was straight As in everything except English",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA but this was an absolute nightmare of a run-on sentence. Maybe sprinkle in some punctuation next time to make it readable?",
      "id": 16,
      "comments": [
        {
          "score": -3,
          "content": "Ik I have the worst grammar in the world I almost failed High school because I had a D in English",
          "id": 17,
          "comments": [
            {
              "score": 4,
              "content": "which means you know you have to try EXTRA HARD, right ?",
              "id": 18,
              "comments": [
                {
                  "score": -3,
                  "content": "Look it’s 5 am okay I know my grammar is bad I’m not gonna spend 2 hours eating perfecting a post on reddit it’s not a essay I’m asking a question that simple",
                  "id": 19,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Rule 6 of this sub:\n\n>Paragraphs are good; block text walls are bad. Format and punctuate your post reasonably. Be clear and concise.\n\nDon't post if you can't follow the rules\n\n&#x200B;\n\n> it’s not a essay I’m asking a question that simple\n\nForcing people to hurt their brain just to accommodate your laziness is not okay.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA though you could have made that A LOT easier to read. It’s your business how you raise your kids on what you raise them on. End of.",
      "id": 21,
      "comments": [
        {
          "score": -1,
          "content": "Yeah Ik I don’t have very good grammar",
          "id": 22,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA.\n\nShe shouldn't be forcing her lifestyle onto others.",
      "id": 23,
      "comments": [
        {
          "score": 2,
          "content": "This.\n\nAnd she is the specific type of vegan ppl hate.\n\nYour sis maybe needs to work on her argumentation skills like... if she wants to convnce you she should not fronting you with the picture of you and your children feasting on dead animals OR CHILD.\n\nWith her shit ppl started disliking vegans just saying.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA - your child, your sister has no say in how you raise your own child.\nI am a vegetarian, but I wouldn't never force my beliefs on someone else, like your sister seems to be doing. In my opinion, your sister needs a hard reality check.",
      "id": 25,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA \n\nShe isn't even the parent and she thinks she can dictate what your children eat? Ignore her.",
      "id": 26,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA you seem to respect your sister and the life choices she makes, she should do the same for you and your child. Being completely vegan also isn't healthy for babies and small children since it doesn't give them all the nutrients they need to grow (I'm pretty sure being vegan in adults doesn't give all the nutrients either, you'd have to take supplements). Also, who tries to argue with a child?",
      "id": 27,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackstory my LS is vegan I’m fine eating vegan food don’t prefer it but I packed a meal in of hot nuggets for when we did the short 5 minute drive if my 3 year old didn’t like the vegan food which is fine but not to her my other child ate a little bit but wasn’t a huge fan so I pull out the meal and my LS freaks out on me she says I shouldn’t be feeding my 3 year old a dead corpse it’s like eating children it isn’t btw she then said we all had to eat her food but my 3yo wouldn’t budge she insisted and called her out saying she ate meat when she was her age and She turns into a dragon going crazy then we go and leave than get a burger at one of my three siblings work it was great my 3yo had a grilled cheese and she ate that but my phone blew up from my whole family except my brother the manager of the burger joint who defended me but I really thought did I go to far calling her mindless?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 28,
      "comments": [],
      "relation": "No"
    }
  ]
}