{
  "post content": "My sons 10th birthday is next saturday and me and my husband have been planned a party for him. To make sure we gave everyone enough time we got invitations ready 2 weeks in advance and I had my son pass them out Friday. We invited every one in his class (he goes to a small private school so there were only 15 kids to invite). Except for one child well call david. \n\nThe school my son goes to has a program for special needs kids where they are put into a \"normal\" class once a week. David is a high functioning autistic child who was put in my sons class to help him socialize and to help the other kids learn to not discriminate against special needs people. From what I know about him and his mother they are just doing their best, and I have nothing against either of them. However, there have been incidents with david before. Last year through friends I had heard that David had a meltdown at another party he was invited to. I don't know if I believe it but parents who were there say that it was because he wanted to open presents like the birthday boy and when told no freaked out. There are other logistical problems as well (The party will be in a loud arcade) so in the end I decided to not invite david. \n\nWell, after my son passed the invitations word spread around that we had excluded the special needs child in his class. This got back to davids mother who called me last night and confronted me about this. She told me that I am awful for excluding her son and that i'm teaching my son to discriminate. When I brought up the logistics and the past incident she told me that i'm an asshole for assuming what her son can and cant do before hanging up. I woke up this morning to a passive aggressive post by her and many other parents are siding with her. \n\nI just want my son to have a good party and didn't mean anything by this. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 24995,
      "content": "YTA\n\nLook, I understand your concern about the meltdown. But you could have spoken to his parents beforehand about the environment and potential ways to mitigate that; you could have spoken to your son's teacher to see if s/he has advice for how David is in group situations. You don't even know how his behavior may have improved over the past year specifically because of being included socially. This would have been a good chance to teach your son to include people, and instead you taught him it's okay to exclude someone if their disability makes your fun time slightly more difficult.",
      "id": 2,
      "comments": [
        {
          "score": 10335,
          "content": "Not to mention it’s a 10th birthday party at an arcade. OP, don’t you realize how many meltdowns will occur that day even without David?",
          "id": 3,
          "comments": [
            {
              "score": 3230,
              "content": "Great point, I sincerely doubt that none of the other kids in the class have ever melted down at a party. Almost every kid has a meltdown from overstimulation now and again.",
              "id": 4,
              "comments": [
                {
                  "score": 2421,
                  "content": "I’m a college student and I have meltdowns from overstimulation on a weekly basis\n\nEdit: /s I didn’t think I needed to add this",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1321,
                      "content": "I'm 32, it doesnt get better lol",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Still an issue at 40, confirmed.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I’m in my 40’s. I’ve been stressed and struggling with life for years, which makes me more prone to being bothered by loud noises (this is an actual thing https://www.sciencedaily.com/releases/2013/01/130115085533.htm ). I’ve had meltdowns because I couldn’t handle the noise of a loud conversation.  If I find myself getting upset and stressed I try to remove myself (for at least a bit) make others aware what the issue is, and a little empathy goes a long way.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah, and how many party invites do you get?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Well, that's probably the autism.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I'm 30 and I had a minor meltdown during my work break today. Then again, that's kind of a tradition for cafe workers - we use the freezer as a private place to scream.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "... I think you're autistic.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "It was my neurotypical nephew’s 6th birthday party today and he had a meltdown over having to share a ball. His brother with autism was fine the entire party (he did have a meltdown leaving the party, though - but that was expected)",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I don't meltdown per say, but I do get tense and will have to remove myself from the situation. The weird thing is it doesn't take a whole lot of activity to get me worked up, just activity that involves people shouting.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 830,
              "content": "[deleted]",
              "id": 15,
              "comments": [
                {
                  "score": 864,
                  "content": "Your point of view is a very common one, but the very important point here is that this is exactly what discrimination looks like. It's not a matter of hating disabled or black people, it's a matter of pre-judging them for tenuous or no reason. It's easy to say that she simply made the wrong choice based on sound reasoning, but more likely she wanted reasons to keep him out and found them.\n\nI mean, even in her worst case scenario, if the kid would have a fit at the party, his mother would just remove him. Instead OP denied him access based on the prejudice (\"preconceived opinion that is not based on reason or actual experience.\n\") that he is likely to have a fit.\n\nImagine if she'd said she excluded the black inner city kid who was there for similar reasons because she didn't want to risk him stealing something.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 289,
                      "content": "Also its been a year since the last meltdown he had at the party. OP has no idea if David's parents took steps to work on him with this or not. Having a special needs child is overwhelming. You cant work on everything at once.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": ">more likely she wanted reasons to keep him out and found them.\n\nExactly.\n\nI'm wondering if classmate Billy (who didn't have autism) had a meltdown the year before?\n\nI bet she wouldn't have excluded him this year because of it.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "That comparison is completely invalid. It's different. Being black doesn't predispose you to stealing, but having autism predisposes you to *some level* of this kind of attitude. OP definately didn't handle this properly, but it doesn't mean her concerns weren't valid.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "> Imagine if she'd said she excluded the black inner city kid who was there for similar reasons because she didn't want to risk him stealing something.\n\nI mean...IF a kid had stolen a present in the last party, then I'd probably be nervous about inviting him. \n\nEverything else you said is 100% true.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "The OP didn't get it right, but your analogy is way off. Part of the definition of autism is that it causes problems with social interaction. I assume you don't think that stealing is part of the definition of being black. One is a genuine concern based on reality - however unfair it may be - and the other is pure bigotry.\n\nAnd your assumption that they were looking for an excuse is unjustified. There's no basis for that at all.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "“Imagine if she'd said she excluded the black inner city kid who was there for similar reasons because she didn't want to risk him stealing something.” \n\nYou meant to say imagine excluding the black person because she didn’t want to risk stealing when he has a history of stealing?..",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "It's one thing to \"pre-judge\" **all** black people due to the past actions of a few bad-apple black people. THAT'S discrimination.   \n\n\nIt's something else entirely to pre-judge a \"specific\" special-needs child due to **past actions** OF THAT SPECIFIC SPECIAL NEEDS CHILD...   \n\n\n> Last year through friends I had heard that David had a meltdown at another party he was invited to. \n\nThat is \\*not\\* discrimination...  \n\n\nWith that said, I will have to go with YTA, NOT because she didn't invite the special needs child. She has no obligation to invite anyone if she doesn't want to.   \n\n\nThe problem I have is she only \"heard through friends\" that david had a meltdown without confirming if it was actually true or just the rumor mill.   \n\n\nIf she would have confirmed that this actually happened instead of he-said-she-said, and decided against inviting him because of it, then I see nothing wrong with that.  \n\n\nThen if david's mother confronts her, she can say with confidence that because of his meltdown in previous parties, she didn't feel she should invite him to this party.   \n\n\nSpecial needs children need to learn consequences for actions, too.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "In addition to the problems other people brought up with your anology, it would be more anologous  to say that she excluded a child based on a rumor that THAT SPECIFIC CHILD had stolen something at a party a year before.\n\n&#x200B;\n\n>if the kid would have a fit at the party, his mother would just remove him\n\nIf you actually read the comment you replied to you will note that primary concern mentioned in it was whether David's mother intended to be there the whole time (to help manage any such situations).",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">Imagine if she'd said she excluded the black inner city kid who was there for similar reasons because she didn't want to risk him stealing something.\n\nOK, but if that inner city kid had stolen  gifts from a party he was invited to last year you might have some reservations.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "Most definitely. OP could have talked with parent and asked them to come with, if supervision is a concern",
                  "id": 26,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah just a \" hey Bill has his heart sent on inviting the whole class to an arcade this year. I was a bit worried that it may be difficult for David. I was wondering what word be the best way to handle it.\"",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Yeah I mean op could have called her and ask David's parent to be present at the party since she is not qualified enough or even experienced with an autistic child",
                  "id": 28,
                  "comments": [
                    {
                      "score": 88,
                      "content": "I would be willing to bet David’s mom would go even if not asked.  We know how to calm our kids and we know what sets them off.  We tend to err on the side of caution,",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "This is where I'm at",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Or people can trust the parents would know if their son can/can't handle it and most likely knowing special needs parents they would be closeby to help if issues arise.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 286,
              "content": "[deleted]",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 230,
              "content": "A kid's birthday party without at least 3 meltdowns is considered a dull affair lol",
              "id": 33,
              "comments": [
                {
                  "score": 18,
                  "content": "It is known",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I appreciate this reference",
                  "id": 35,
                  "comments": [
                    {
                      "score": 10,
                      "content": "*cries in season eight*",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes, I totally agree! They can be highly entertaining!",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "Hello. I don't have kids, don't interact with children and have not been a child in a long time. How do parents handle organizing a party with the knowledge that their kids might melt down and not actually enjoy themselves?",
              "id": 38,
              "comments": [
                {
                  "score": 69,
                  "content": "Honestly...you wing it and hope for the best. Generally, there's more good than bad, but sometimes it's all too much and they have a meltdown. Oddly enough, when my kids have total meltdowns, they tend to forget them faster than we do. They'll reminisce about the awesome party, but totally leave out the parts where they yelled at their siblings and stormed out of the room.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "You keep a tazer in your purse and give the little bastards a round of God's static electricity if they get out of hand.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Kids will meltdown and be over it and back to running and playing in the blink of an eye. Half the time you ask them about it later and they can't even remember what it was about. Pretty much \"whats wrong?...I'm sorry to hear that, maybe next time you can xxxxxxxxxxxxxx, now lets play chase or hide and seek or *insert random kids game here* \" and they're off and runnimg",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I was JUST AT a 10th birthday party at an arcade that was NOTHING BUT autistic kids; they loved it and were remarkably meltdown free. They sometimes were wandering off from games they hadn't finished playing, but a lot of them were sensory-seeking rather than sensory-avoiding (that means their autism causes them to particularly enjoy loud, overstimulating environments), and the ones who were sensory-avoiding were mostly wearing ear protection. Some of the kids struggled a bit with waiting in lines, but they all had parents with them to coach them. It was lovely and I don't see why an arcade is worse than any other environment!",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'm going to assume the party is probably at Chuck-E-Cheese, and I can assure you that the only thing that will cause a meltdown there that you will notice is if you don't get the unlimited play pass.\n\nit is highly likely that, in dealing with David on a day-to-day basis, the other children will actually know how to handle his presence better than you would. It is very unlikely that you will experience anything significant that day.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2041,
          "content": "also, i’d like to throw in how OP thinks that this child is only in the class so that people learn to not discriminate, lol. the child has high functioning autism, he likely functions like a normal child. my mom helped PLENTY of high functioning autistic children when she was an aid, and they were all extremely bright. they just needed some extra help. \n\nOPs whole attitude towards autistic people seems pretty awful.",
          "id": 44,
          "comments": [
            {
              "score": 645,
              "content": "[deleted]",
              "id": 45,
              "comments": [
                {
                  "score": 317,
                  "content": "my coworker has a son with high functioning autism and he’s extremely well adjusted with his classmates. they all love him, he’s a really bright and well adjusted kid. \n\non top of that, all kids are prone to having meltdowns. not just autistic ones.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 83,
                      "content": "[deleted]",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "True that about the meltdowns. I have ADHD not autism but also have my own sensory issues. As a kid I melted down at chuck e cheese more than once bc it was way too fucking loud.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 103,
                  "content": "My brother as well, this entire post made me so upset I don’t even want to make an actual comment because it would be extremely bitchy. On top of that, you know damn well OP doesn’t understand a single thing about autism based on this post.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 24,
                      "content": "It's not about autism, it is about being so incredibly awful and mean to a child. Not only did she invite every single other child (if she's invited five then she could easily have excluded David along with ten other kids), but she also had her kid hand out invites at school, making sure that David knew exactly who was and wasn't invited. \n\nI'm guessing OP was the bully int their school, and is teaching their kid how to bully too.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "I'm a teacher with autism. This is bullshit and super hurtful. This is one of the reasons my mother never even attempted to get me help, cus diagnosing me would make me difficult, and why make me difficult when she can just threaten me into silence and obedience?\nOp isn't just an asshole, they're a bad person.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Same here!!! I also teach ASD students, and this just makes me so angry and sad.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "As someone on the spectrum, let me tell you just a little piece of information - using the term \"high-functioning autism\" in regards to your child (or any autistic person, for that matter) is always risky. Of course, I don't want to guess about their symptoms, or (god forbid) say they don't function as a human being, but it is very easy for people on the spectrum to turn the term \"high-funtioning autism\" into the thought of \"I am expected to be functioning\" and therefore hate themselves for when they don't function (e.g. due to sensory overloads or the likes.)\n\nThe best of wishes for you and your child!",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Same !!! I am heart broken",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 203,
              "content": "yeah as someone on the higher end of the spectrum people tend to either thing I don't suffer from issues at all or that I'm a particularly dim five year old in a 23 year old woman's body.\n\nVersus, like, me just being an actual person with special needs that vary in certain areas.\n\nI feel so bad for this kid. Especially because it reads like the invitations were passed out during classtime. Which like, if everyone is watching, fucking hurts. I've been there.\n\nAnd yeah they're not gonna stick a super low functioning autistic kid in a normal classroom to teach kids not to discriminate that's not how that works.",
              "id": 55,
              "comments": [
                {
                  "score": 145,
                  "content": "let’s say this kid DID have a meltdown at that other party. \n\nwhat does OP think is easier? a child understanding that he can’t open a present at someone else’s party because it isn’t their special day, or a child being forced to understand that they weren’t invited because they’re different? it sure as hell isnt the latter. \n\nmy heart breaks for this kid. i say we all throw a party for him instead.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Exactly. There are just so many better options here. \n\nI remember how often this happened to me as a kid. It sucked. Same with stuff like how people would decorate your locker/desk on your birthday. Never happened. \n\nHonestly, even if someone did through an alternate party or decorated my stuff or my parents took me out to a movie on that day instead, it never really helped since I knew it was mainly out of pity. But that was just me. I was also bullied a whole lot so me and this kid hopefully differ that way. \n\nBut yeah this shit just breaks me heart.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I mean, isn't that just common though? I've seen kids having meltdown because they can't open birthday presents that aren't theirs plenty of time. And they are not autistic.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "and this is how the rules are made to invite either the whole class or sometimes all of the same gender, or don't pass out any invitations. \n\nYTA op",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Something I once read and struck me and I’ve used it ever since: you don’t have ‘special’ needs. You have additional needs. Because you’re still a human with the same basic needs as everyone else. Additional doesn’t have that stigma attached that ‘special’ does. \n\nEveryone who’s heard me use that term since has said how much more they like that, rather than saying special needs. \n\nTbh, doesn’t everyone differ in their needs anyway? \n\nTotally not coming at you btw. Just want to help lift you up even further.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Adult with high functioning autism here - this post made me so angry. I can and do \"fit in\" with everyone else and I am just as capable as others. But it took a lot of time and learning to get here.\n\nI remember being the \"problem child\" in grade school. I remember being excluded from activities. I remember the other parents not liking me. And for what? Because I struggled to understand social interactions. OP is 100% TA. David doesn't need yet another person pointing out that he is \"different.\" And kudos to his mom for calling OP out.",
              "id": 61,
              "comments": [
                {
                  "score": 13,
                  "content": "And the thing that is so fucking frustrating about it is that neurodivergent people spend most of our lives trying to mash and mold ourselves into something \"normal enough\" so we can fit into this world that exists solely for neurotypical people...but god forbid a neurotypical person has to *slightly* alter their language or behavior to be a little more compassionate or understanding towards us. God forbid OP has to put in a little extra effort for her kid's birthday party so the autistic boy isn't excluded :/",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Yeah, that wording got to me too...like the kid is only there as some sort of teaching tool for the 'normies' :(\n\nI guess it's in line with the rest of OP's post though. She speaks about David like he's just an annoying nuisance that exists, not an actual human being with his own personality, opinions, and feelings.",
              "id": 63,
              "comments": [
                {
                  "score": 17,
                  "content": "autistic children do not exist to teach other children not to be mean. that’s a parents job. cleary OP isn’t doing a good job.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "THIS. I have Asperger's and the idea of being in a normal class just to benefit neurotypical people really pisses me off. It benefits everyone.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Hello as a high functioning autistic teen, I’m able to do pretty damn well in highschool. Well academically(Social life non-existing). Yeah, no. I am NOT here to teach the other kids “Not to discriminate”. I’ve have broke down before at school(Fuck my French class) but for the most part I’m able to maintain my composure. I don’t bother other, and I am not an example. If you want to actually talk and learn about what autism is like go look at r/autism",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My autistic eight year old is known as the class clown in both his CID classroom and the regular classroom he is in part of the day (to help him integrate into regular classes, not to be the token autistic kid to help the “real” kids learn empathy).  There are also quite a few girls in his regular class that have little crushes on him, so OP can kiss my ass.",
              "id": 67,
              "comments": [
                {
                  "score": 12,
                  "content": "whaaaat? you mean that autistic children can have PERSONALITIES and NOT be tokens for schools to utilize?! never! /s",
                  "id": 68,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I know it’s crazy isn’t it?  Right now he’s yelling at me to get out of the tea tub so I can make him tomatoes and sauce.  He’s a sassy one.  He apparently also yells poop a lot in class to make the other kids laugh.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "high functioning aspie here, non-autists make it seem like we have down syndrome. i can eat, type, drink and talk like a normal person. i just do things different and get overwhelmed easily. we aren't some freak abominations.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My son is high functioning autistic. He is in a normal classroom and has some subtle aids to help him get through the day.\n\nHe’s there to learn. He’s not there to be trotted out as a  show pony for other kids to learn to be nice to “different” people.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I agree. I saw red when I saw \"I have nothing against either of them\". \n\nThe whole post reeked of discrimination",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1717,
          "content": "Exactly. A meltdown at one party doesn't automatically mean he will melt down at ALL parties. You didn't even TRY to find a way to include him. \n\nTHis post made me super sad & angry. YTA",
          "id": 73,
          "comments": [
            {
              "score": 450,
              "content": "I agree. \nI’ve seen kids meltdown without being on the spectrum and yet it doesn’t get back to them. This was harsh and exclusive, like every advise before, you should of done your research. I worked with a kid who was high functioning and the amount of growth he shown throughout the months I worked with him was amazing. He socialized more and when he started to have the beginning of a meltdown, we had mantras and techniques. It’s about learning and teaching your child how to accept those of all backgrounds.",
              "id": 74,
              "comments": [
                {
                  "score": 10,
                  "content": "So much this. If everyone avoids and teaches their children to avoid people who are different, like this boy, how will they ever learn to fit in and socialize like everyone else? I am so irrationally angry with this woman. She seems to feel victimized by this boys mom when what she should feel is shame and a burning desire to make her correct shameful actions.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 339,
              "content": "I'm autistic and it made me sad aswell. I have meltdowns sometimes at social situations and if somebody used that as an excuse to not invite me to something I would be so heartbroken. Like the fact that I have some social issues would make me a lost cause who's doomed to never have friends because I'm too \"difficult\"",
              "id": 76,
              "comments": [
                {
                  "score": 40,
                  "content": "Hmmm.  That's interesting.  I'm not sure if I'd always know if someone was autistic.  I generally don't invite people to my parties that make the parties less fun.  Some people are assholes when they drink, and some people refuse to get into the fun, so I'm not sure if I have an obligation to invite them.  I mean, they probably have some trauma, or unfortunate upbringing to be assholes, but I don't really care.  I guess that's sad, and I'm an asshole.  (Btw, this doesn't apply to 10yo kid parties where everyone is invited except one kid because of a known disability, that's just shitty).",
                  "id": 77,
                  "comments": [
                    {
                      "score": 5,
                      "content": "You don't invite people to your party that make the party less fun. That is exactly what OP was doing. David has has incidents including a meltdown at a party OP prevented a meltdown making their party less fun by excluding him.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I just wanted to say I love your username! And happy cake day!",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Frankly if an adult had a meltdown at my party I would never invite them again.  No one has a responsibility to cut you slack or give you extra patience.  Expecting otherwise is rank entitlement.  Find people willing to do so, but don’t think that an unwillingness to do so is wrong.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Even if he does, it’s a public arcade!",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Me too. Rarely do I wish I could actually yell at an OP in person, but this is one of those times.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1124,
          "content": "There's a kid with HFA in my daughter's class. When she had her first \"friends\" birthday party, she invited him. His parents were really emotional when they RSVPd....\"He doesn't really get invited to stuff....ever.\"\n\nHe came with his mom, there were a couple glitches, but everyone had fun. He's been a fixture ever since and now invites both her and her little sister to his birthday parties too. He's a cool kid and we've all been lucky to include him and be included by him.\n\nOP has no idea what she's potentially missing out on.",
          "id": 83,
          "comments": [
            {
              "score": 212,
              "content": "I am a mother of a child with moderate ADHD. He's been suspended multiple times from school and we are seeking many forms of assistance for him. He hasn't been invited to parties in year and other parents avoid me like the plague. They have no idea how much effort we've gone to for our son and to help him with his behaviours. He's so much better these days but .... still segregated. \n\nI would cry if he got invited to a party TBH.",
              "id": 84,
              "comments": [
                {
                  "score": 57,
                  "content": "This breaks my heart, and so does OP's behavior. I wish more people showed compassion and understanding. I wish more people taught their children those values, as well. \nI'm rooting for you, and your precious kiddo! He's going to excel, especially with such a caring momma by his side, and he'll make friends that are worthy of his presence at their birthday parties. \nWhen you get that invite, celebrate and eat some cake for me! It'll happen!",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "Can I just give you, like, a million Karma? Other parents like this that let me be normal friends with their kids would have helped me a lot when I was little",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Same here. This is my son as well. The very rare times he gets invited I cry tears of gratitude. It means the world to my son. I stay with him and make sure everything goes smoothly.\n\nA thousand thank yous for this small gesture of yours which means the world to that child.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My sister is very high functioning, she’s essentially a cookie-cutter normal kid except in rare cases.\n\nI’m sure David has learned from his past too, as these kids are still capable of developing to adults",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 652,
          "content": "Agreed. \n\n>to help the other kids learn to not discriminate against special needs people\n\nNice to know OP is reinforcing the tolerance school is trying to teach. YTA, OP",
          "id": 89,
          "comments": [
            {
              "score": 705,
              "content": "YTA! Ya know, it’s different to invite 6 kids and exclude David. But you literally invited everyone except David. It’s not like he wouldn’t have his own parent in attendance to calm him down if he has an episode.\n\nI hope no one ever ostracizes your kid in such an obvious and cruel way.",
              "id": 90,
              "comments": [
                {
                  "score": 327,
                  "content": "And she had her son HAND OUT THE INVITES AT SCHOOL IN CLASS! Like what?!",
                  "id": 91,
                  "comments": [
                    {
                      "score": 140,
                      "content": "That part was so deliberately cruel",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "In my kids school that’s not even allowed. If you want to exclude kids do it on your own time.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This is the bizarre part of the story. When my kids were in grade school, orientation at the start of each year requested families NOT hand out invites in class unless EVERYONE was invited. If this is a private school I would expect that to be the case as well. \n\nAnd ironically, people with autism are believed to lack empathy but OP seems devoid of it.  My 21 yo son has HFA and comments like OPs still hurt as deep as when he was 10 years old.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes, imagine for a moment everyone in your son's class gets invited to a cool magic show... except for your son. And the invitations we're handed out in public.\n\nHow does it feel now...\n\nA small private class that is inclusive of kids who are different... but not too much\n When it suits them.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Thank you for pointing this out. This is one of the most hurtful things a person can do to a kid. It's the kind of hurt that sticks with them through adulthood.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I really don't understand why it's considered traditional for kids to invite their entire class to birthday parties, why people feel obligated to subsidize an afternoon of entertainment for people they barely know. No kid is friends with everyone in the entire class, and there's usually at least one person they actively dislike. And having a huge group limits the activities you can choose from due to cost / logistics. Ten is old enough to understand that not everyone is friends with everyone and Mom said you could only invite four people. Let them invite the kids they actually want to hang out with that day. It's a lot more relaxing for everyone.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "Yeah I saw that and immediately sighed \n\nWhat the hell OP",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 273,
          "content": "Agreed completely. David should not be excluded just because he has a harder time socializing than other children, and OP was wrong to assume. Even if he does have a meltdown, which you don’t know that he will, at least he was invited. If you’re worried about not knowing the best ways to help an autistic child (which is understandable if you don’t have much experience with them, depending on the severity of the condition) you could request his mom stay nearby just in case. But YTA for not even giving that option. I don’t even have special needs, but I remember when I was your son’s age and everyone in our grade was invited to a birthday party except a friend and I (we were not popular and I did not like my peers so I was fine with not going tbh). But it still sucked to hear everyone else talking about it and knowing I was not even invited to come. Next time, try and be more empathetic towards David. He is a child. Not the “autistic boy”.\n\nEdit: Thank you for the Gold and Silver! This is cool I’ve never gotten awards before.",
          "id": 99,
          "comments": [
            {
              "score": 21,
              "content": "Thank you for saying this. IMHO, this is the meanest thing a person can do to a kid. I myself was left out as a kid because I was an introverted \"bookworm\" and socially awkward.\n\nI was the only kid in class not invited to a girl's party (I thought she was my friend), and watching those invitations get handed out to everyone except me...and then listening to the other kids excitedly making plans and discussing it all week long...then having to hear about all the fun they had afterward....\n\n...it was like the hits just kept on coming and wouldn't stop.\n\nI'm 45 now, but that feeling has stuck with me over the years. It's the kind of hurt that you just don't \"get over\".",
              "id": 100,
              "comments": [
                {
                  "score": 10,
                  "content": "Yes, she's branded him for life because he's different and therefore doesn't matter as much as her son does. I pray she reads these, takes them to heart and makes amends as best she can.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Even worse, she did it so her angel could have a \"perfect\" party!\n\nSBJ.\n\nI really hope she takes it to heart, too, but the fact that she has not responded to a single comment kind of leaves me a feeling a little bleak.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This completely. While it's nice that OP wants to give their son the \"perfect\" 10th b-day party, what would it really hurt if you had invited David and he did have a meltdown? Would it ruin everybody's lives? Is it worth hurting David's feeling and causing long term emotional damange to avoid what might happen? Plus it shows that OP doesn't trust David's parents to make good choices. If OP had invited him, then the choice to let him attend would be in the hands of parents hands to decide if David can handle an arcade party.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 244,
          "content": "Well said.  I don't blame her for the concern, but in a classroom that small something this egregious is likely to be noticed.  She could've handled this better all around.  Also, the way she describes her \"second hand\" knowledge about the boy's past behavior smacks of cliche gossip and complete discrimination.  Proves my theory that most people never really leave high school.",
          "id": 104,
          "comments": [
            {
              "score": 10,
              "content": "Exactly! I am so SO glad my (highly functioning autistic) son is no longer in a small private class like this. I thought it would be best for him.\n\nBut whoah. The rumour mill, talking behind other parents backs, hearsay... It was highschool all over again! I could not believe some people stayed that PETTY after teen years!\n\nMy son was the 'inclusive' student. Okish, Pat ourselves on the back, 'look how awesome we are' when convenient. But MAN what they would say about my son behind our backs. You would have thought he was the devil. No birthday invitations (sound familiar!?), no playdates, no inclusive anything that was even remotely inconvenient.\n\nI am so SO glad I left that cesspool of pretentious hypocrites and transferred my son into a PUBLIC school. Much more accepting, warm and honest. Lots of invitations, new friends etc.\n\nWhat a sad world we live in.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 225,
          "content": "Agree 1000 percent. No money for gold but here's an upvote and the next best thing. 🥇🥇\n\nSorry, OP, but I have to agree YTA.\n\nEdit: Thanks for the platinum! Wow, I think it's a first for me.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "can we appreciate u have 500000 karma from comments bravo man bravo",
          "id": 107,
          "comments": [
            {
              "score": 143,
              "content": "The perks of a boring office job I guess.",
              "id": 108,
              "comments": [
                {
                  "score": 53,
                  "content": "And 500k in 2 years! At what point does Reddit become your job and the office thing a distracting side gig?",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Is that something people check?",
              "id": 110,
              "comments": [
                {
                  "score": 32,
                  "content": "I accidentally pressed his username and saw 1, 500000 it threw me off",
                  "id": 111,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "Also just to tag on that the kid handed out these invitations at school to literally everyone but David\n\nman that's a really awful feeling to be the only kid not invited. \n\nYTA. apologize and do you best to right the situation.",
          "id": 112,
          "comments": [
            {
              "score": 5,
              "content": "I'd just assumed they were handed out on a day he wasn't in class. Feel naive now.",
              "id": 113,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9952,
      "content": "YTA. This happened to my son A LOT when he was younger. It's hurtful to deliberately exclude with no warning. For anything my son was invited to I would either go and stay with him, leaving early if needs be, or if I checked out the venue in advance and thought it  wouldn't be practical I would decline the invite but say thank you. Excluding on the basis of a disability isn't something to teach your child. You could have discussed it with his teachers first if nothing else.\n\nEdit: Thank you kind redditors for both the gold & silver and your kind words.",
      "id": 114,
      "comments": [
        {
          "score": 2405,
          "content": "Yeah IDK how OP can even thing she wasn't discriminating in this situation.\n\nSomeone was intentionally excluded from an event because of something they can't control. Literal discrimination right there. Especially since she admits in the post that she wasn't at the previous birthday party so she doesn't even know if that story about David is true.\n\nYTA OP. At the very LEAST if you didn't want to hurt this little boy's feelings, you could have MAILED the freaking invites instead of having your son pass them out at school where there's only 14 other kids in his class, so it'd be way obvious to everyone there that David was intentionally being left out. AND you had your son take them in the ONE DAY OF THE WEEK David is actually in that class. That's just pure malicious stupidity there, which is what solidifies you being the asshole. And you should genuinely be ashamed of yourself.",
          "id": 115,
          "comments": [
            {
              "score": 730,
              "content": "Yeah I’m autistic and didn’t get invited to any parties between 6-12th grade definitely doesn’t feel great",
              "id": 116,
              "comments": [
                {
                  "score": 207,
                  "content": "So sorry that you had this experience. I hope this has changed for you.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "Yep. I have major trust and self esteem issues, amongst other things, and this kind of stuff is one reason why. Growing up knowing that this was common also didn't help.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Same. I have ADHD and most kids were fine with me being a hyper little shit, but their parents weren't. It fucking *sucked* going to school on Monday and finding out that everyone had gone somewhere together over the weekend, and kept it a secret from you :(",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Hey - question- my son (11) is on the spectrum and being isolated from stuff like this.. is there anything your parents could have done to help you out w the trust and self esteem issues? \n\nI just wanna help him out as much as I can \n\nAnd I'm sorry this has been your experience  xx",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "If it makes you feel any better, I'm not autistic and don't get invited to parties",
                  "id": 121,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Same",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": "Yeah, like, I'm discriminating against this kid but not in, you know, like, a discriminatory way or whatever?",
              "id": 123,
              "comments": [
                {
                  "score": 90,
                  "content": "\"I was doing it for his sake! To protect him from things I'm not sure would even happen!\"",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 522,
          "content": "Seconded YTA. Ok so my kid had a meltdown, maybe we have to leave early, maybe I say thanks for the invite but we'll have to decline, but for fucks sake don't treat him like the plague.",
          "id": 125,
          "comments": [
            {
              "score": 214,
              "content": "But the other party meltdown was last year. Kids change, grow, and learn so much in a year. OP was looking for reasons to exclude this kid. Reminds me of that horrible mother of the bride who wanted to exclude her daughter's best friend from the wedding because she has a limp.",
              "id": 126,
              "comments": [
                {
                  "score": 67,
                  "content": "this.. one year isn't much to adults but for a 10 y/o it's a very long time",
                  "id": 127,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yea it's literally double the percentage of their lifetime (10% to them vs 5% to us), and probably feels like quadruple the time in terms of emotions.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I'm agreeing",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Not only that she DIDN\"T EVEN WITNESS the meltdown. It's just what people said happened. For all we know the kid pouted for like a minute and that was it.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yup. And if there was a rumor that a neurotypical 9-year-old had a meltdown, it would be chalked up to kids being kids and people wouldn't exclude her for years just based on that.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "What even is the problem with a meltdown? An event can be fun without being perfect. If you think you can’t handle it just ask the parent to stay , but I really don’t understand how an emotional breakdown in a kid ruins a party.",
              "id": 132,
              "comments": [
                {
                  "score": 3,
                  "content": "I don't understand it either. I take my son to lots of parties and events and sometimes he has meltdowns and sometimes he doesn't, much like other kids and when it's not fun for us we go home. Like how a normal person do. Like, I'm not excited about torturing my son and the attendants of a party with a bunch of screaming and flailing for hours, it's like a few minutes and we go chill out or go home it's not what I'd call a big deal. \n\nHonestly I've never been to a kids party where tears weren't present at some point. Kids cry, it's just how they are.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Good points, but i can kind of understand OP's point about being wary of inviting especially when said kid was trying to open the birthday presents.  Not sure how their parent handled their kid when that started but it didn't sound good.  You sound like you're very considerate but plenty who have special needs kids aren't and like it or not there is some what a stigma with some people.\n\nI probably would've called the parent individually and spoken to them and said you're invited but if your kid has an episode I need to know you're going to handle it because I heard XYZ happened at so and so's party last time and I can't have that for my child.\n\nProbably gonna catch heat, but fuck it.",
          "id": 134,
          "comments": [
            {
              "score": 261,
              "content": "I’ve seen “normal” kids try to open the birthday gifts at parties. Shit happens. They’re kids. \n\nKids social events are when kids learn manners and etiquette. \n\nThe last kids party I went to, the 12 year old cousin stole and hid one of the 6 year olds birthday gifts because he was jealous. If he couldn’t have it, no one will! That wound up being a learning experience with plenty of embarrassment, tears and apologies. No one can predict their kids behavior at a party.\n\nHell, I’m gonna bet we’ve all seen adults have meltdowns at parties, too. I sure have! Everyone has issues sometimes, even when it’s completely inappropriate.",
              "id": 135,
              "comments": [
                {
                  "score": 108,
                  "content": "Reading your post helped me understand this rampant \"my wedding my rules\" and \"everyone has to be predictably perfect of they're not invited to my wedding\" trend that I see here a lot. It all starts with their birthday party when they were a kid.\n\nIts like instead of having a real celebration with real people they want to retreat into an imaginary celebration world where no one ever does anything they don't like.\n\nI can see now this is how it starts!",
                  "id": 136,
                  "comments": [
                    {
                      "score": 39,
                      "content": "I think it all starts with spending 50k on an event so if someone ruins an hour of it that's 10k you just wasted. Now, I think all but $500 of the 50k on a wedding is a waste, but that's an aside. The money is a bigger part of why people get controlling given the stakes.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Heads up, because your intent is amazing and I'd hate to see you get knocked by someone who ignores all that to focus on your syntax, the word you're looking for to replace \"normal\" is \"neurotypical!\"",
                  "id": 138,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I’m aware and appreciate your comment. I used “normal” (and in quotes) as an unnecessary and slightly sarcastic nudge to OP. I feel like she’s saying David has problems, but every other kid in the class is great and/or normal, so they’re invited. The fact is every kid has their own strengths and weaknesses and could all be said to have their own set of special instructions. \n\nBut, you’re correct and if I wasn’t being TA, neurotypical is appropriate.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "All of the birthday party meltdowns I’ve seen have been the birthday kid, or sometimes their sibling. My ex-boyfriend’s daughter had a huge meltdown at her 7th birthday. My daughter’s classmate had a meltdown at his party. It’s just overwhelming for any kid.\n\nMy friend’s 10-year-old autistic son shit himself in the moonbounce at one of my daughter’s parties. No big deal, we cleaned it up, life went on. I guarantee no one remembers who wasn’t helping. Would never even occur to me to not invite him to the next party.\n\nThey’re kids. Shit both figuratively and literally happens. This post made me sad.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 158,
              "content": "No, I think you make a good point actually.\n\nOP’s problem isn’t necessarily not inviting David. It’s how they handled it. They just singled the kid out instead of discussing the issue with his parents first.",
              "id": 141,
              "comments": [
                {
                  "score": 10,
                  "content": "there was a similar post not long ago where the consensus was that OP was fine; the big difference was that in that case OP actually tried to incorporate the autistic kid\n\nhttps://old.reddit.com/r/AmItheAsshole/comments/dpiq81/aita_for_letting_my_daughter_exclude_a_classmate/",
                  "id": 142,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I think the main difference between those was that the boy was constantly touching OP’s daughter when she (ans their teacher) repeatedly asked him to leave her alone. She had come home crying because of this boy and yet her mother was still trying to force her to be around him at her birthday party.",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "Dude kids try to open other kid's presents all the time though. My 7 year old niece freaks the fuck out at any party where she doesn't also get a present, and she is not autistic. And excluding someone from something a child did a year ago is ridicules. If you are inviting everyone in class but one student, unless they are a bully, you are going to be the asshole. OP is going to be the PTA's pariah for what she did.\n\nYTA",
              "id": 144,
              "comments": [
                {
                  "score": 18,
                  "content": "Exactly. During my 9th birthday party, we played pass the parcel and one kid threw a tantrum because he didn't win the prize at the end or get a chocolate  (there was a small chocolate hidden in each second layer of paper). He smashed a plate and screamed at everyone accusing us of cheating and ruining the game.\n\nHe didn't have autism. He was just pissed to be the only kid who missed out. My mom took him outside to calm down, someone else gave him one of their extra chocolates, and the party continued normally for the rest of the afternoon. Even at the time I wasn't mad that he held up my party. Mom explained that he needed some time outside to regroup, and we just kinda accepted that.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah, I have an autistic niece and a neurotypical nephew - siblings, niece is about 5 years older than nephew. Guess which one tends to start screeching because he opened all his Christmas presents super fast and is out of boxes to open before his big sister has even opened half of hers... Not the autistic one!",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 94,
              "content": "I have a 10 year old daughter. The school has a pretty cut and dry policy that if invitations are handed out at school, they better be all inclusive. \n\nOP was TA here because if she felt that she couldn't deal with the special needs child, why the fuck did she hand the invites out at school? That's hurtful af to a kid. The kid doesn't understand what happened. He's special needs. \n\nOP was hosting a party and had every right to include or leave out anyone she wanted to for the party. It was the way she went about it. An adult's decisions to make her life easier (excluding the special needs kid and handing the invites out at school) led to a child being hurt.",
              "id": 147,
              "comments": [
                {
                  "score": 12,
                  "content": "Yo, I'm autistic too. David likely absolutely understood what happened. That probably wasn't the first (or last) time that happened either. This shit hurts...",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah I’m autistic, when you’re autistic you know when you’re being excluded and just expect to be excluded all the time.",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "In a lot of schools, the policy is that you can either invite less than half the class (individually outside of class) or you can invite everyone. I don’t think she would have been obligated to invite this kid if it had been a smaller party. \n\nAlso, who the fuck cares if a kid has a meltdown at the bouncy house? That’s part of the experience.",
              "id": 150,
              "comments": [
                {
                  "score": 6,
                  "content": "[deleted]",
                  "id": 151,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This is for elementary school, so it wouldn’t be broken into classes for individual subjects as it would be for middle and high school. \n\nBut as far as what right they have, mostly all they can do is ask. The parent who violates it isn’t remotely going to have their kid expelled.",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "I don’t know how many kids parties you’ve been too, but I have an 8y/o and have been to an avg. of 10-15 a year for the past 5-6 years...I’ve never once seen the kid whose birthday it is open the presents in front of the other kids or at the party at all.  So if that’s really the thing OP is worried about it’s a pretty simple fix vs. excluding and discriminating against a kid with autism.",
              "id": 153,
              "comments": [
                {
                  "score": 15,
                  "content": "[deleted]",
                  "id": 154,
                  "comments": [
                    {
                      "score": 5,
                      "content": "If it’s a venue party, there’s a time limit and a parent may not want to pay extra. Also when they’re younger, as soon as they get the toy they want to open it and play with it immediately. If you make them wait, it’s just fussiness and grumpiness as they angrily say bye to their guests - then you have to pack all the opened gifts away. Also for younger kids, ALL the kids will want to play with the toys right then and there and birthday kids are usually entitled and don’t want to share their special toy with anyone. My nephew’s been opening his gifts at home for a couple years.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "It is just plain CRUEL to invite everybody in the class -EVERYBODY, EVERY SINGLE KID, but ONE- to a party!!! What the heck is wrong with you??!!",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "We had autistic kids at my son’s birthday party. One was very very focused in on the presents and continuously asked when we were opening them. I nicely told him that we were going to open gifts once every one left. And then asked if he would like to open his gift bag. Easy peasy. Used my words like an adult and let the mom take over from there. \n\nAnd calling a parent ahead of time to make sure their child doesn’t cause a scene seems very... aggressive? I don’t know what word I’m looking for. But if I were the mother receiving the call I would feel far from welcome at that party.  AND all of it based on a rumor. \n\nAnd even if the kid does have a meltdown,  so what? My oldest is six and seems to have more emotional maturity than the OP. One of his classmates is on the spectrum and Aiden tells me that he has good days and bad. And tells me that certain things are “rough” for him. This post just makes me glad my kids are open and receptive to kids and their good and bad days.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "They heard a rumor that it was the reason the kid had a tantrum, which they don't even believe in themselves. It would have been understandable for OP to call the other child's parents and talk about it, see if it was anything they should be concerned about. That's perfectly reasonable, in fact it's the logical thing to do.\n\nHaving your kid hand out an invitation to every child *except* one, without any warning to the other parents? No. That's not understandable in any way. Like you said, you'd have handled it differently, you'd have handled it like an adult. OP didn't.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "You actually think that birthday presents are more important than being decent to disabled people?",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "YTA OP, just the amount of crass and heartlessness OP to feel as this justifies excluding one child due to disabilities is amazing. It’s not like the kid can’t hear, see or comprehend that they were excluding.\n\nSo in one go OP is going to teach one kid it’s okay if excluded and teach the other kids they will be excluded.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "YTA 100%. The fact that you deliberately invited every other child in a small school and not the one child is just straight up cruel. You’re a parent, you should know better. This was a great opportunity to teach your son how to be inclusive and that being different isn’t bad. But what you taught your son is that being different makes you less important and not worthy. \n\nShame on you. \n\nI hope after this you realize that you were completely in the wrong and apologize to that mom and boy. I hope you’re future behavior changes.",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 64,
          "content": "Seconded, YTA OP.",
          "id": 162,
          "comments": [
            {
              "score": 34,
              "content": "I third YTA OP",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "If any parent out there invited every kid in the class except my son- there’d be a huge problem. The mom was right when she said you are awful. Let the parents decide if an arcade is too much for their child.\n\nYTA",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6401,
      "content": "> David is a high functioning autistic child who was put in my sons class to help him socialize and to help the other kids learn to not discriminate against special needs people. \n\n.... YTA, and you are showing your son exactly how to discriminate against a special needs person.\n\nThere are other avenues you could have taken.  You could have talked to David's mother directly and come up with a game plan on if David had an incident at the party.  You could even have asked her if it was a good idea to have David there, and if it wasn't, given David the invite anyway and have the mother come up with a reason that David couldn't attend, thus limiting a possible reaction to David's own home.\n\nIt's sad that the school is trying to teach your son and his classmates lessons on acceptance and you are throwing that all to the wind.",
      "id": 165,
      "comments": [
        {
          "score": 1416,
          "content": "That part stuck out to me as well. He was put in the class so the kids can learn not to discriminate and he can socialize and you are actively working against that by doing this. YTA.",
          "id": 166,
          "comments": [
            {
              "score": 436,
              "content": "> He was put in the class so the kids can learn not to discriminate\n\nhonestly im suspicious of this; OP specifically mentions high functioning; plenty of HFA kids in standard education and not special needs",
              "id": 167,
              "comments": [
                {
                  "score": 471,
                  "content": "I practically guarantee that is complete bullshit. No child should ever be a learning tool for other children in an educational setting. He's not a fucking hamster or hermit crab.\n\nHim being in the class one day a week is (almost certainly) solely in service of his own educational and social goals.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 265,
                      "content": "Yeah this. Fifty years ago OP would have been saying \"oh they put this little black boy in the classroom, he's there so that all the white children can learn about diversity.\" No, he's there to fucking learn, because he has the same right to attend a public school as every other child in the classroom.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "This was what confirmed op is an entitled Karen and got under my skin lol that kid is there to learn for his benefit not for the benefit of your kid lady, he’s not some token child or a learning lesson for everyone else. The other kids will benefit from being around him and learn that everyone is different, yes, but his entire purpose is not that...sounds like op has a lot to learn herself as a parent and in general",
                      "id": 170,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "[removed]",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My daughter is in the same classes. Yes, neurotypical kids are absolutely used as a therapy intervention— and guess what?! She’s actually improving.",
                      "id": 172,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Around 20 years ago, the elementary school I went to worked together with a school next door for handicapped children.\n\nWe had plenty of classes (and recess) with some mentally handicapped people and it didn't teach us to stare or point, but rather to accept these guys and girls as normal people. There was no special \"you need to treat them like this\" class or anything; we just treated them like any other classmate.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 115,
                  "content": "Considering how many conclusions OP jumped to in their story, I’m guessing this is an assumption as well. \n\nOP seems to be prejudiced towards autistic/special needs kids, whether they realize it or not. Probably doesn’t think people with autism can be in a regular classroom because they can be in a regular class, not to teach the “regular” kids a lesson.",
                  "id": 174,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "My child has HFA. She’s in a mainstream class\nBecause....she doesn’t require special education. Just like a lot of kids just like her.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That’s one thing that really upsets me, so many autistic children are labelled as having learning disabilities, or they’re said to be ‘savants’. My younger two are in mainstream, my youngest is incredibly intelligent. So much so he runs circles around me lol. \nNone of my children are unable to learn, nor are they in need of ‘special’ education. They have additional needs beyond those of a neurotypical child, but they are far from stupid or incapable of learning.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Honestly this was the cringiest part of the whole post for me and clearly displays how ableist OP is being. People with disabilities are not tools for others to learn from or to make them feel good about themselves. If the other kids get something out of it that’s great, but that’s not why he was placed in the class. He’s there for his own learning and growth, just like every other kid",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "The child was **not** put in a general education classroom to help the other kids learn how not to discriminate.  That OP even thinks in these terms (David is there to help them become better people) is pretty egocentric. No, David is in the class because that is the best environment for him to grow academically and socially, just as it is the best place for OP's son to do the same.",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 387,
          "content": "[deleted]",
          "id": 179,
          "comments": [
            {
              "score": 9,
              "content": "It’s a small private school.   All these kids are going to be elitist dicks that are going to discriminate against people like David.   \n\nOP is totally TA.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 182,
          "content": ">It's sad that the school is trying to teach your son and his classmates lessons on acceptance and you are throwing that all to the wind.\n\nAgreed! Especially considering the invitations were passed out at school, the one place that is trying to teach acceptance. It's bad enough to exclude only one kid because of a disability, but to do so publicly I think makes it even worse. Most schools have a rule that party invites can only be distributed at school if everyone is invited. It's sad that this parent couldn't recognize the hurt this caused.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3414,
      "content": "i don't know if you're the asshole or not.. but i have a feeling you're going to get destroyed on here for this",
      "id": 182,
      "comments": [
        {
          "score": 1160,
          "content": "Really weird happenstance too! Not too long ago there was a post about someones daughter having her 8th Birthday and she planned on inviting the whole class except the special needs child... \n\nExcept in that situation, the special needs child had kind of picked on this persons daughter directly, touching her when she asks not to be touched, taking school equipment from her while she's still using it... and the crux of the post is really the Mom saying \"I do NOT want to teach my daughter that she HAS to give in to someone just to make them feel good\" and honestly I don't exactly see why that doesn't apply here, why should this kid HAVE to invite someone they don't like to THEIR party... Now definitely, the Kid should've made his invites by phone call rather than in front of everyone but the point still stands.\n\nEdit: Ehh I re-read the post, there is absolutely 0 mention of the actual child's feelings towards David, just Mom expressing fear of a meltdown as being the main driver for not inviting David, I definitely understand any YTA verdicts. These are not the same situations",
          "id": 183,
          "comments": [
            {
              "score": 620,
              "content": "[deleted]",
              "id": 184,
              "comments": [
                {
                  "score": 337,
                  "content": "Actually, you're absolutely right. Re-reading the post, there is 0 mention of the birthday boys actual feeling's towards David, the only reason David wasn't invited (according to the post) is Mom's worry of David causing complications.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I agrem. I think it all comes down to if the lid wants them or not. The kid doesn't like David. Nothing you can do. You don't have to invite everyone, and sometimes people don't invite you. If only not inviting him due to possiblity of ruining her precious angels birthday is bullshit",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 142,
                  "content": "Also the fact they invited everyone else in the class.  If it had been a small group of six boys, then its legit you're just inviting closer friends. But this was not the case here.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 10,
                      "content": "This part exactly. Inviting a whole class to a birthday party is going to bring in all the classroom dynamics with it, too. It's unlikely that OP's son was on perfect terms with every kid in that class, even besides David, and there might even be kids that would make an even bigger problem than David simply because of this. And without the supervision of the teacher, kids who would normally refrain from bad behavior might be more willing to exercise it here, or find it easier to pick on classmates they can't reach during school hours. \n\nThat's not the purpose of this thread, but OP is extremely shortsighted for only anticipating problems with an autistic kid.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 84,
              "content": "Wasn't that because the kid was a stalker who kept on calling her his gf?",
              "id": 189,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "That's a very different situation where the autistic child was being let down by their guardians. Being autistic does not mean you get to be inappropriate. In fact, there are stricter rules for them when it comes to stuff like that for the very reason that they do not have enough control nor understanding of their social communication. It's the same as if you were dealing with a four-year-old. If you do not teach them and control them they will severely misbehave. When they do, we blame the shitty parents, not the child.\n\nThere's nothing in this post that points to OP having any kind of reasoning like that. Hers is the policeman's defense. She didn't feel comfortable so she decided to act before he did something she didn't like.",
              "id": 190,
              "comments": [
                {
                  "score": 6,
                  "content": "Hi! I'm autistic. We're not like four year olds, even when we're teens. It's just that sexism exists, and men who are autistic are given passes because of the 'x year old in a x year old body' mindset, like aw isn't he cute/helpless. Being creepy is not a symptom of autism.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 339,
          "content": "r.i.p. op",
          "id": 192,
          "comments": [
            {
              "score": 85,
              "content": "yup",
              "id": 193,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "You should be allowed to invite whoever you want to your party. But going into school and handing invitations out in public is a dick move.",
          "id": 194,
          "comments": [
            {
              "score": 12,
              "content": "It's not his/her party. It's his/her kid's party. The post has no mention of what the kid wants.",
              "id": 195,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "\"What could go wrong if I diss high functioning autistics on a site of high functioning autistics?\"",
          "id": 196,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Seriously. The yta group goes: \"You need to invest even more time and effort than normal for a large group of 10 year olds, because including the person with autism is your responsibility.\"\n\nI mean, I feel for the kid, and his parents, but, \"if you're not willing to accommodate everybody you shouldn't even have a party,\" doesn't jive with me. Guess that makes me an asshole. [Although, for reference, I was 'the unpopular' who didn't get invited to parties, and was okay with it.]",
          "id": 197,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "[removed]",
          "id": 198,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I think op is allowed to be an asshole. \n\nI've had parties as a kid where I couldn't invite certain kids because they were dicks to other kids at social events or our parents didn't get along. Or vice versa where I wasn't a \"fun kid\" or my parents where ~~feeding~~ fueding my friend's parent at the time (Parent PTA politics iirc). \n\nBut parent of the mentally disabled kid should have been prepared for meltdowns. She can't just say \"can and can't do\". The parent is responsible for her kid and showed she can't handle these situations gracefully. He needs a handler and the mom isn't a good one. \n\nAll the commenters saying op isn't allowed to make this choice are wrong in their prescription to this issue. Mother can't pass on the responsibility of the kid to the other parent. \n\nGood luck OP. Hopefully you can gracefully reason your way through this. Lots of people are going to be like the top answered in this. They'll side with the mother\n\nSorry for responding to your comment rottenkart, but seems the safest place to have a dissenting opinion.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3244,
      "content": "[deleted]",
      "id": 200,
      "comments": [
        {
          "score": 653,
          "content": "OP, I hope you’ve read this response and take it to heart. Owning up to a mistake and apologizing can send a powerful message to a 10 year old. It’s not too late to teach your son a powerful lesson in humility, accountability and compassion. And make no mistake, you do owe David and his mother an apology.",
          "id": 201,
          "comments": [
            {
              "score": 17,
              "content": "This ^^ And OP, there are ways to help make him feel included, like if david brings a gift,  get your son to help him open it, let him play with the tissue paper, or have his parent bring something to distract him, a favorite toy, game.. etc. I had an autistic friend who had a meltdown when she couldn't play with my toys. I was a kid, next year I let her help me open the gift she bought me amd i let her play with it so i could open my other gifts with out causing a melt down :)",
              "id": 202,
              "comments": [
                {
                  "score": 15,
                  "content": "While letting David help open gifts would be a lovely gesture I think it would be less disruptive if his mother removed him from the party when it's time to open gifts. That's assuming that in a year he hasn't learned how to behave properly in that situation.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "yep, the parents will know if it's too much for their child and decline. but a priori not even asking them is really shit.",
          "id": 204,
          "comments": [
            {
              "score": 14,
              "content": "That part pissed me off the most. She acts like she's doing whats best for him (i.e. \"an arcade would be too much for David\"). Like you're not David's mother and that's not your call! But sure... take an oppurtunity to teach your child about inclusivity and throw it away to teach discrimination instead. At the end of the day, its just a birthday party FFS.. \n\nI'd suspect OP might be \"that kind of mom\". Cliquey, gossipy, thinks their private school educated kid is God and that that kid's party is \"the event of fhe season\". You know the type. Regardless if is she's \"that mom\" or just that dumb, OP - YTA big time. I don't even know how you could write all of this out, proofread and post it and still *genuinely* wonder if you're  the asshole.",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I think she is a terrible person. Doubling down on the phone call was what put me over the edge on that part.",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Plus even if op wasn’t the asshole for all these reasons they still would be for having their child hand out invitations in class. Imagine being in a classroom and every single kid gets an invitation to a birthday party but you. That shit is one of the worst feeling a kid can get. \n\nAgree though YTA but op isn’t an evil person just a bit ignorant",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Exactly this.  Not to mention if other parents are siding with the child they excluded, OP has subjected their child to the very real chance of having no one (or few people) turn up for his party due to no fault of his own.   Who knows, some parents may decide their kids shouldn’t associate with OP or their child going forward since OP thinks discrimination is ok.   Nice job OP!",
          "id": 208,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "It's pretty hard to teach a child these values when the parent still lacks them.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "As a father to a son with autism thank you for this post.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1956,
      "content": "YTA for three reasons:\n\n1. Believing and acting on a rumor about a 10 year old's behavior a year ago\n2. Inviting *every child but one,* a behavior practically calculated to cause hurt feelings, for anything but very serious reasons. \n3. Making it clear that your exclusion is based not just on his behavior but on his autism, by titling this post \"because of his autism\" and spending half the post focused on his special ed history rather than on his actual character or behavior. That brings this out of the realm of mere petty gossiping and into the realm of actual bigotry\n\nYou're the asshole, and you should sit down with your kid and explain that you made a big mistake in not inviting this kid, that you're not perfect, and that you'll strive to do better in the futur (as should he). \n\nAlso, if you throw a birthday party for 10 year olds and one of them has a meltdown, that is not the end of the world.",
      "id": 211,
      "comments": [
        {
          "score": 510,
          "content": "100% this. \n\nEasy to call mom and say “My son is having a birthday and your kid is invited! Is there anything I can do that might help the day go well? Would you like to come as well?”\n\nAnd all the people arguing that OP isn’t obligated to do this... why the hell wouldn’t you want to? It takes almost no effort and goes so, so far. \n\nAre you gonna not invite the kid with a severe allergy because of the cake? Of course not. You’re gonna reach out to the allergic kid’s parent and say “hey where can we pick up a cake that your kid can safely eat?” or the other parent is gonna be prepared with their own snacks.\n\nOr, you know, if you can’t be troubled to at least extend an invitation, let alone reach out to the kid’s mom, you could just not pass the invitations out at school. \n\nIf you can’t understand the impact of being the only child not invited in the entire class, then YTA. YT giant A.",
          "id": 212,
          "comments": [
            {
              "score": 46,
              "content": "OP is obligated to, if only for her son’s sake. It’s a class of 15. All the parents will think OP is an asshole, but the other kids will probably assume OPs son is the asshole. It’s going to be a long year if she doesn’t fix this.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "YTA - this person has summed my thoughts up more nicely than I could.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1476,
      "content": "YTA. Because only kids on the spectrum have meltdowns?  Never happens otherwise?  Kids. Party. Meltdowns. Very rare...right... Good you kept that awful weird potentially unseemly kid that has feelings out. We wouldn't want him to taint your home with his cooties.  /s/",
      "id": 215,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1074,
      "content": "YTA. You’ve just taught your child to make assumptions about people with disabilities. Great job.",
      "id": 216,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 837,
      "content": "YTA. How cruel. Yeah, it's your party. You can invite who you want. But how fucking cruel. If you don't want the autistic kid to come, then only invite a few kids from the class. But to invite everyone except him? That's monstrous.",
      "id": 217,
      "comments": [
        {
          "score": 554,
          "content": "I once saw a story where the mother of an autistic child received an invitation to a party. Inside it said something along the lines  “I know he may get overwhelmed, but maybe if you came a little early before everyone arrived they could have some fun playtime that would be less stimulating. I want to make this work for you guys.” And that mother said she was in tears, and that her son never got invited to parties and that this was such a kind act. Not inviting him is bad enough, but to pass out invitations in front of him while he knows he is being purposefully excluded breaks my heart for that kid.",
          "id": 218,
          "comments": [
            {
              "score": 186,
              "content": "Yep. As a mother of an autistic child, this is one of my fears as he gets older.",
              "id": 219,
              "comments": [
                {
                  "score": 88,
                  "content": "My son is being assessed right now and I hear back from his school district tomorrow. I didn't know this was a fear to have, but now I have it. Awesome.",
                  "id": 220,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Sadly this doesn't get better in special needs classrooms. My fiance's daughter is in middle school, she has an intellectual disability, she is far more delayed than the other kids in her class, she's socially pretty normal for her developmental age, but the other kids aren't interested in spending time with her. It sucks to see them progressing when she isn't, mostly because it sucks watching her get left behind by her friends",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I have an autistic daughter, but i want to tell you a positive story so you know that not all kids and parents are like this. My daughter was chosen in her special ed class to get an award and so my family and I went to go see her receive it in the cafeteria. When her teacher went up to give the awards she reminded the students and parents to please be quiet as some of these students do not like loud noises and to not applaud. So when the students started getting their names called, unprompted the audience begins doing the silent clap which is used for people with hearing problems. The auditorium was full of first grade students and it was so quiet you could hear a pin drop, but they were all showing immense respect by silently clapping. I almost cried at that moment and I still tear up when I think about it. So, I give the kids at my daughter’s school a lot of credit, they have been nothing but inclusive with my daughter.",
                      "id": 222,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "There are so many things you just can't prepare for when you have a child on the spectrum.  My son was diagnosed at 2 1/2. He is still pretty non verbal and has issues communicating. He has very little interest in other children. So we don't know if he understands he's not invited to parties. If you need to talk post assessment I'm here internet stranger.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "autistic adult here: yeah, the popular kids might continue to be dicks to your kid, but...they kinda suck anyway? instead focus on finding social activities/friend groups for him that he likes and inclusion will follow. a lot of us find friends based on interests.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "That is such a good way of wording any behavioural concern, too. Thanks for posting it as a positive  example!",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "This should be the top comment.\n\nWay too many people are letting the OP off easy as if this was a minor mistake. Her behaviour is disgusting and she doesn't deserve any sympathy from anyone.\n\nIncluding every single kid except the autistic one? That's not just an asshole, that's the shit itself.",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "[deleted]",
          "id": 227,
          "comments": [
            {
              "score": 8,
              "content": "I know. And I feel awful for the other kid's mom. It would be heartbreaking knowing that was going on.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Excluding anyone based on assumption of their capabilities (let alone a CHILD) automatically makes you and arsehole. This isn’t even something you can debate.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 761,
      "content": "100% YTA. If you really cared about David's wellbeing at the party you could have contacted his mother to understand how to help him. His mom's right in saying you can't just assume what's best for David as you've only heard rumors. You're discriminating against this kid and using fake empathy as an excuse for it.",
      "id": 230,
      "comments": [
        {
          "score": 185,
          "content": "OP could've just asked David's mom to tag along in the first place. Nothing bad with one extra chaperone at a kids party.",
          "id": 231,
          "comments": [
            {
              "score": 29,
              "content": "Most parents of autistic kids are more than used to staying at parties. I'm pretty surprised the comment section here is just assuming the mother is going to drop her kid off and leave, like, y'all clearly do not understand autistic people AT ALL.",
              "id": 232,
              "comments": [
                {
                  "score": 4,
                  "content": "I want to add that this isn't even the case or necessary for most autistic children. The scope of the diagnosis has widened a lot in recent years and now encompasses a lot of people who are just a bit awkward.",
                  "id": 233,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Thats the point, OP doesn't care about David's wellbeing in the slightest, she cares about there son having a party with no possible issues. I get it but the way she did it was completely wrong. YTA all the way.",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}