{
  "post content": "\nMe f31 and my MIL don't have a close relstionship. She's civil towards me but can be a bit passive aggressive at times and we tend to disagree often times.\n\n\nWe live in a different state. FIL passed away suddenly and MIL told me and my husband to come attend the funeral. She booked our tickets to fly to her state. But the issue started when my husband told me that we couldn't sit together in the plane because his mom had booked him a first class ticket while I got ecconomy. I was flabbergasted by this. I tried asking him why but he urged me to \"suck it up, and we'll talk about it later\". In that moment, that particular moment I felt so much humiliation and contempt. I felt like she was treating me as less then even in her hard times. I decided to not go and just go back home. My husband was shocked by my decision to go home and tried to convince me to just go but I declined.\n\n\nHe went alone and I ended up missing the funeral. He was livid just calling m3 and texting nasty things calling me petty and spoiled. He said that I should be grateful his mom paid for my ticket to begin with then said that she doesn't OWE me a Goddamn thing. I argued about how she could've just booked us both in economy if money was an issue but he called me pathetic for thinking about it when his dad just died. He said it was cruel what I did and that his mom and family will never forget that I missed the funeral over ridiculous reasons.\n\n\nAITA for going home over this? \n\nETA. One of the reasons I didn't settle for the ecconomy ticket was because I wanted to sit next to my husband and support him. He sobbed the whole ride to the airport and I didn't want to leave his side. I was shocked when he told me we couldn't sit together, and how he said it like he had no issue with it.",
  "id": 1,
  "comments": [
    {
      "score": 38984,
      "content": "ESH. The seat issue was more important than supporting your husband after the death of his father?",
      "id": 2,
      "comments": [
        {
          "score": 22315,
          "content": "This is exactly the point. Obviously MIL is a asshole and her actions were uncalled for and petty. But, you made your husband go to his father’s funeral without the support of his spouse and you did this over a first class seat. You played right into your MIL’s hands and may have caused irreparable damage to your marriage.",
          "id": 3,
          "comments": [
            {
              "score": 5276,
              "content": "I agree esh, BUT I'm including SO in this.  There's no reason he couldn't go, support his mum, AND support his wife by just... Sitting in economy with OP!",
              "id": 4,
              "comments": [
                {
                  "score": 7549,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4806,
                      "content": "Exactly.  Nobody gets a Nobel Prize here, but the husband's grief is more important than the OP's pissing contest.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I love that her edit is like “oh I wanted to be there and support him he cried the whole way to the airport.” \n\nOk but you didn’t, OP. You abandoned him when he needed you. *wanting* to support him and *actually* supporting him are two different things. \n\nOP made this about herself and that’s just gross. Not that the MIL wasn’t a petty AH too, but that could have been addressed later. I don’t put much blame on her husband. He was grief stricken and didn’t want to argue/cause drama at that time. A little rude to his wife, but again he’s probably not in a state to be in the middle of their petty bs.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1092,
                  "content": "The husband’s father died. He is grieving, he gets a pass for AH determinations for most people.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Honestly… and even if he sat in first class. HIS OWN FATHER IS DEAD. OP can’t always be the main character in her husbands life at all times. \nShe (MIL) booked her a ticket. She really didn’t have to do it at all. Matter fact, the wife should’ve bought the ticket for her husband and her herself. \nYou really must be so damn entitled to make it about you when the person you’re supposed to LOVE -selflessly- , just lost .. let me repeat it one more time… HIS OWN FATHER.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "The guy was probably an emotional zombie. He asked if they could talk about it later and that was enough to send OP running from the airport over not getting a FREE first class seat.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": ">support his wife\n\nThe poor guy has just lost his dad and he's supposed to support his wife? No way.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "It wasn’t his job to support his wife. HE is the one in need of support. It was her job to step up, be the strong one, and take all the punches to make sure her husband was ok. She failed.",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "It sounds like the ticket was already bought. Idk how easy it is to just switch a seat between first class and economy while you are at the airport waiting for your flight.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "You don’t necessarily know that there were economy seats available when he found out the difference.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I don’t think it’s fair to assume her husband was in the state of mind to think through all these options. It sounds like this was totally unexpected which means he likely wasn’t thinking clearly. I think that OP needed to be the level headed one in this situation and she failed miserably.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "No way, my in-laws hate me. Like HATE me. But if my FIL died & my MIL chose that moment to be a petty asshole, she gets to be alone in her pettiness because at that point, my one and only job would be to support my husband in his grief. His job? To grieve. Not to support me in his mother’s weird pettiness. Not to support his mom. Just to grieve. Her husband is grieving his father with no support from his wife or, apparently, even his mother understanding that it’s not the time. \n\nESH to OP and the MIL, not the husband who probably feels utterly alone.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3121,
              "content": "Has no one heard the phrase “hill to die on”? Yes, absolutely a shitty move by MIL. But for the love of God, this could have been dealt with any other time.\n\nEdit: And to everyone saying “Why didn’t OP’s husband go sit back with her?” I’m assuming he probably wasn’t thinking straight because his father just died.",
              "id": 17,
              "comments": [
                {
                  "score": 962,
                  "content": "That’s the thing exactly! If she chooses to not make an issue out of it right this second, it doesn’t mean that she has forever waived her ability to talk about it. Just now is not the time.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 968,
                      "content": "MIL chose to be messy at this exact time to hope OP plays the retaliation card and chooses not to go or implicates herself. 100% a play to create a rift and distance son from his spouse and OP fell for it. Agree with you it wasn’t the time to make an issue, as it was what MIL wanted and husband needed support.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 506,
                      "content": "Absolutely. Give him some time to grieve, then sit down at a later date and say “Hey. I noticed at your father’s funeral that MIL separated us on the plane. Could we talk about that? It made me feel terrible and I wanted to be able to support you the entire time.” \n\nBoom. Done.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 162,
                      "content": "Days, weeks, months, or years later: \"You want to talk about how YOU were treated by my family and how YOU felt when MY father died and MY family was grieving?! Why do you want to bring it up now?! How dare you!\"",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "Yeah but he was thinking clearly enough to constantly text and guilt her with nasty messages the whole time instead of being with his family.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 52,
                  "content": "I do wonder though why the husband didn’t tell OP earlier. I suspect he knew she would make a fuss—probably like his own mother did—and sprung it on her at the airport, considering OP said she went “back home” once she found out. That was more likely an intentional omission instead of a distracted oopsie.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "You also can't always just decide to move. It is usually easy to swap a 1st class seat, but if she was sitting next to a couple they may not have wanted to sit apart.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Also, seats on a plane are assigned…you can’t just seat hop. Though to be fair, if someone from first class asked me in economy to switch I would most definitely switch! But that isn’t always an option.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It’s especially jarring when you see in OP’s edit that she wanted to sit next to her husband to comfort him during the flight… but apparently sucking it up for a flight, then consoling him after landing, **at the funeral**, after the funeral was not on the agenda?",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2612,
          "content": "I hate the edit. If she really didn’t want to abandon him, she wouldn’t have made him go alone to the funeral. A liar and an asshole.",
          "id": 27,
          "comments": [
            {
              "score": 855,
              "content": "Right?! The edit does not make her look better the way she thinks it does. It makes it MUCH worse.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 727,
              "content": "Exactly! *I was so worried about his state of mind, I didn’t want him to sit alone. So I sent him on the entire trip by himself. Poor me.* ESH, IMO, but OP sucks the most for handling it by taking the nuclear option. MIL wanted to drive a wedge and it worked.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 151,
              "content": "But, it was an economy seat! Do you know what happens back there! If you want me to attend your dad's funeral I want first class at least, better a private jet.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Omg it’s the worstttt! Ma’am way to make it even worse and show your true colors. No wonder her MIL keeps her distance, she knows what kind of person she is.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Ya the edit made it worse, and ALL about her!",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Yeah, just digging an even bigger hole for herself. Awful.",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1385,
          "content": "For real. If this were for a holiday or a graduation, I would think it was fine for OP to stay home, but her partner just lost his father. Is now really the time to take a stand? Her MIL is an asshole, but abandoning her husband in his darkest hour was not the answer.",
          "id": 34,
          "comments": [
            {
              "score": 633,
              "content": "And OP’s ETA makes things worse. Im kinda upset about it. She stated she her husband was sobbing the way to the airport and she wants to sit beside him on the plane and support him ….\n\nBUT then she also just leaves him alone completely. Wtf. OP is a big hypocrite. She wants to “support her husband” but also LEAVES HIM???? She didn’t want to support him in the first place if she just LEFT HIM because of this.",
              "id": 35,
              "comments": [
                {
                  "score": 206,
                  "content": "Yeah, that excuse is bullshit, and I don’t understand why she would think that makes it any better.\n\n“I wanted to support him so much that I decided not to be there for him at all, rather than not be there for a couple hours. I’m such a loving, compassionate wife!”",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1304,
          "content": "Especially with her edit!!!\n\n>One of the reasons I didn't settle for the ecconomy ticket was because I wanted to sit next to my husband and support him. He sobbed the whole ride to the airport and I didn't want to leave his side.\n\nShe wanted to support her husband, but since she didn't get the first class ticket she went home?? That's not how support works. If you wanted to be supportive you still go on the flight and support your husband, you don't leave and go home because you missed out on first class. \n\nThe husband potentially cried at the airport alone, cried on the flight, cried on the way to the house/place they were staying. He was also extremely sad the WHOLE TIME that he was there and dealing with the funeral, the stuff leading up to it, and the stuff afterwards. Then he was probably sad on the way to the airport back, the flight, and the trip back home.\n\nThis wasn't about support, this was about the 1st class ticket.",
          "id": 37,
          "comments": [
            {
              "score": 113,
              "content": "Exactly what I was thinking. That excuse was totally made up afterward to make it seem less petty",
              "id": 38,
              "comments": [
                {
                  "score": 107,
                  "content": "And makes her come across even MORE petty. Like she admits she wanted to comfort him, but only if she gets first class as well.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "More importantly if you're trying to support someone, you ask them what they ducking need from you and do that. When husband said don't stir shit she should have listened not made everything about her. OP just removed all doubt that she YTA.",
              "id": 40,
              "comments": [
                {
                  "score": 47,
                  "content": "Right? People are arguing what the husband should have done differently in his moment of grief, but they aren't addressing what this petty fighting between OP and MIL are doing to husband in this moment. \n\n\"I know I'm really struggling with the loss of my dad, but do you know what would make it better?? If you decided to make this about you before weve left the airport, and to focus about this being a fight between my mom and you. That's really going to make this whole 'dead father thing' better.\"",
                  "id": 41,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Husband flew thinking he doesn't have his dad to ask him for advice in his upcoming divorce.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Which is absolutely disgusting to me. Being there for your spouse in their times of need/grief is literally how you show your love and commitment to someone.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "And maybe MIL got the upgrade for some other reason like there weren't two economy seats or even -gasp- she was trying to do anything possible to make going to his father's unexpected funeral slightly more comfortable.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "this right here. OP IS shallow. and did not give her husband the support he needed.",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "She is silly AF.  Now if OP had the sense the good Lord gave a lemon- she would have paid for an upgrade AND sit next to her husband in First Class.  Her husband is right ...her MIL does not owe her a GD thing and she should not need or want a  GD thing from her MIL.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 632,
          "content": "For someone willing to go nuclear like this do we even have the confirmation that the first class ticket was not purchased out of necessity?\n\nI've had business class tickets bought for me even though our policy is economy because they were out of economy seats. I didn't know until after I was getting the boarding pass which class I was in. \n\nWhat if Mom had just enough points for one upgrade and knew she'd be keeping husband busy so wanted him better rested? Could she have put it money for two, probably but it doesn't sound like the declaration of war she is making it out to be if Mom did that. Maybe she was doing it for multiple children and could only afford making one person first class and thought her children would be able to figure out with their partner who gets the seat\n\nI say the people grieving should get more a benefit of the doubt. Would be really weird if a newly widowed woman is more concerned with stupid political games than her dead husband.",
          "id": 47,
          "comments": [
            {
              "score": 372,
              "content": "> Would be really weird if a newly widowed woman is more concerned with stupid political games than her dead husband.\n\nBy the takes of some of these posters, you'd think the MIL killed her own husband to set these events in motion. God forbid you give a MIL the benefit of the doubt on reddit ever, especially one who is grieving her suddenly dead husband.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "I was thinking it’s absolutely possible that there weren’t two seats together and this was the only option.  I flew last week and both my flights were sold out.  MIL just lost her husband and is just trying to get her family there.  I’m willing to bet she didn’t stop to think of a way to screw her DIL over and just grabbed what was available. Op’s TA. She knew her husband was an emotional wreck and blew shit up instead of supporting her husband.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "This is actually a really good point, especially these days airlines are really packing flights full/running with reduced number of flights, economy might have only had one ticket left for a sudden next-day booking.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 613,
          "content": "Lol she edits to add that the problem was because she wanted to sit next to him to support him. So because she couldn't sit next to him on the plane she abandoned him all together... YTA for that.",
          "id": 51,
          "comments": [
            {
              "score": 35,
              "content": "\"Oh, you're sad that your dad died? Let me make you even sadder by abandoning you right now\", OP probably.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 246,
          "content": "I have had to arrange 4 funerals in the past year. Booking tickets at the last minute is a hellish experience. Planes are so oversold, and I could rarely get anyone near anyone else. I had to slot people in wherever I could find seats, and was just grateful to be able to get families on the same plane most of the time. I was overwhelmed and grieving and just trying to get my family home ASAP. \n\nMIL lost her husband of decades. I can't imagine her grief and how crazy and surreal life is right now. I don't know if her booking the tickets this way was intentional or if it was the only seats she could get. And OP doesn't know either. Because she bailed as soon as she found out she wasn't sitting with her husband.\n\nI think OP should have gone and supported her husband. She could have found out later what happened to the seats, but leaving her husband sobbing at the airport after the death of her dad seems pretty nuclear.",
          "id": 53,
          "comments": [
            {
              "score": 58,
              "content": "This is such a good perspective. Those tickets maybe have been the only available seats; MIL might not have been purposely petty. She fucked up her marriage, I couldn't forgive my partner if he wasn't there for me for my father's funeral. And that shit was tough as fuck, even with him there.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Exactly. Everyone’s quick to jump down MILs throat, but we don’t even know the truth about why the tickets were booked this way.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "Seeing so many people defend this got me thinking about how the worst OP could say about her MIL is that she's *a little* petty. She said they're mostly civil. If MIL was as awful as everyone in here is assuming OP would have 100% said so because she would need to be a real fucking monster to justify abandoning your husband. People are so focused on the ticket that they're not reading between the lines.",
          "id": 56,
          "comments": [
            {
              "score": 40,
              "content": "Yea, I have yet to see OP provide an example of MIL’s pettiness outside of the free tickets to bury her husband/OPs FIL— which could have many other explanations",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "The edit tho. She wanted to support her bereaved husband by sitting with him so when she couldn't sit with him she... Left entirely .\n\nI mean maybe MIL was being an AH or maybe it was a last minute booking (as funerals usually are) and those were the last 2 seats available. But even if MIL was being an AH about the seats, OP left her husband who just lost a parent alone which makes her an even bigger AH\n\nYTA, op.",
          "id": 58,
          "comments": [
            {
              "score": 15,
              "content": "Right?  She couldnt sit with him for a couple hours so she nukes the whole thing over it?  Woof",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Yup. If ever there was a moment to turn the other cheek, it was this moment right here.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22999,
      "content": "YTA. Yes, it was VERY shitty from your MIL to book you in economy class, while your husband was in first class.\n\n**But you let a petty quarrel with your MIL prevent your from supporting your husband when he needed you the most.**\n\nYou husband have every right to be pissed. You basically told him that your grudge against your MIL is more important than supporting him.\n\nEdit : no, I won't say E SH. The husband doesn't suck. And the MIL just lost her lifelong partner, have to pay for plane tickets for 2 persons, and she wanted to pay a little treat to her son... I am giving her the benefit of the doubt that she did this to spoil her son, not to piss off her DIL.",
      "id": 61,
      "comments": [
        {
          "score": 8709,
          "content": "Point one to MIL.  She now will forever be able to say \"she didn't even come to the funeral!\"   \"Look how she didn't support my son in his time of need\"\n\nAnd don't get me wrong, MIL is a complete AH for this, but no one in the family will ever care about the plane seats, they'll just remember OP wasn't there.",
          "id": 62,
          "comments": [
            {
              "score": 3648,
              "content": "OP should have taken it on the chin, gone to the funeral, been supportive, and let everyone find out about the seats. Give MIL enough rope to hang herself. But no. She played right into MIL’s hands. Bet MIL is laughing herself sick over this. She got even more than she wanted.",
              "id": 63,
              "comments": [
                {
                  "score": 833,
                  "content": "Considering husband didn't even care, I highly doubt anyone else would about the seating arrangement. ESH.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 1460,
                      "content": "Considering how he's been berating OP for not going he obviously DID care, his reaction in the airport was likely more due to him being focused on getting to the funeral more than chasing his wife around who was throwing a tantrum over his mother's bullshit. When you're dealing with grief, you can only pick certain things to invest in, at that time the only thing he could invest in was keeping his shit together on the plane.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "In H's defense the loss of a parent is a horrible time. The sudden loss of a parent puts the strongest amongst us on our emotional knees. Him being out of sorts is understandable.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "You have no idea if he cared or not.  He was already emotionally spent from his father having just passed away.  This was just not something he wanted to deal with at the time, which is why he asked her to just suck it up and said they’ll deal with it later.\n\nHell, for all anyone knew at the time, there were literally only two seats on the soonest flight out, one in first class and one in economy.  OP just threw in her beef with her MIL and assumed she did it on purpose.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "No, complaining about the economy seat while their relative is DEAD would make OP look petty. Thisi s the sort of thing where you just acknowledge MIL sucks and then move on.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "You’re exactly right. And now she’ll probably be worse to OP because she didn’t go to the funeral. It’ll give her a “reason.”",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "My father flew to Europe on a day's notice to be at his brother's funeral. Yet what people remember most is how his own sister, who Iives in the same city, was a no show.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Imagine OP defending herself—\n\n“I wasn’t there at the funeral because my MIL bought my ticket but put me in *economy*” \n\nNgl if this happened to my sister and her husband didn’t go with her to a family funeral, because of a *plane seat*, I’d personally go nuclear on his ass. Not only does this show me that my sisters husband would be petty as hell, it also shows me that he considers my sister not a *priority* in his life. He would be banned from all other family functions I’m sure. This is exactly where OP is sitting too.\n\nSorry if that was confusing, I was just thinking about the same situation, just with my family. \n\nThis affects more than just you and your (EX) MIL’s relationship OP. It affects *everyone* who loved your FIL *and* your husband—to name a few. Disrespectful to the FIL and your husband’s family. And Petty as hell. Good luck with the fallout.\n\nYTA OP and everyone in your husbands family now knows it.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "If my SO's parent died, and the other parent pulled this crap on us, I would sit in the cargo section of the plane just so I could be on the same flight as her. I would complain about their parent doing such a shitty thing, but I would suck it up because **IT'S NOT ABOUT ME!!!**\n\nIf I had to drive for 2 days straight because my MIL was being petty, then I would drive for 2 days straight to be there for my SO.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I posted this elsewhere, but question- are we absolutely 10000% sure MIL intended this as a slight against OP? OP says she’s usually civil albeit slightly passive aggressive. Did MIL maybe not have enough money to pay for two first class tickets and decide to give her son, who recently lost a father, a little upgrade? Was she just not thinking in her grief? Did OP’s husband get a random upgrade? \n\nIf it was her being petty then I’m the first one to say MIL sucks too but I feel like it’s a bit of a leap to go from mostly civil to “I’m going to slight you even though I’m going through tremendous amounts of grief because that’s how much I dislike you.”",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> Point one to MIL. She now will forever be able to say \"she didn't even come to the funeral!\" \n\n\"Even after I paid for her ticket!\"",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It’s a free flight. She should have just accepted it and continued not liking MIL.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 374,
          "content": "OP, I think you played into your MIL’s plans. You need to support your husband.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "If my fiancee's father died and her mom bought her a plane ticket and I had to drive 30 hours to California, I would start right away.\n  \nI'm having a hard time figuring out why she's married to someone she obviously detests.",
          "id": 77,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 48,
          "content": "This is INSANE. Talk about being selfish and self-centered. His dad died and she didn't come over (checks notes) an economy seat???!!! I've been through the death of a parent and it is so hard. If I were him I'd be reconsidering if this is someone I want to spend my life with",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "I’m not sure the MIL is being shitty here. OP sounds like a self centred jerk. So the MIL wanted to make a terrible trip a little more comfortable for her son who just lost his father. Why should she also have to do the same for a woman who admittedly doesn’t like her? She needs to be the bigger person when she just lost her husband? Absolutely not. I imagine the thought of her son sitting in economy with all those people while emotional was something his mother wanted to avoid. OP was apparently so upset she couldn’t support her husband through the flight she chose to not support him through the funeral. Makes total sense…not.",
          "id": 79,
          "comments": [
            {
              "score": 19,
              "content": "This. The only evidence we have that MIL is a manipulative monster is this one sided situation. There’s plenty of reasons this could have happened, and OP won’t provide any examples of MIL being mean apart from this.",
              "id": 80,
              "comments": [
                {
                  "score": 11,
                  "content": "Thank you! I'm flabbergasted by the amount of people making such wild assumptions. If MIL was so damn awful then why was the first thing she said was that they were civil and the worst she could say is that sometimes she's a little passive aggressive. If my MIL was so awful that I'd ditch my spouse during their father's funeral I'd damn sure have a good fucking reason and I'd be damn sure I told people every little detail. So many people here can only read what's written and completely miss what isn't. There's very little that would keep me from being with my spouse and I'm honestly being very generous because I don't know that there is anything that would.\n\nWhat her husband needed in that moment was to just get on the fucking plane. We don't know that his mom did it on purpose. Maybe it was too expensive to do two first class seats and she wanted to make sure her son was as comfortable as possible on the flight down. OP doesn't even know why she's just assuming. OP didn't want to let MIL \"win\" and she did so at the expense of her marriage. They could find a resolution to MIL issues. There's no resolving this. He will never forgive her.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This.\n\n>One of the reasons I didn't settle for the ecconomy ticket was because I wanted to sit next to my husband and support him. He sobbed the whole ride to the airport and I didn't want to leave his side.\n\nSo your solution to this issue was to just abandon him at the airport? How is that a solution to anything?\n\nI'm not commenting on mil's action because I don't know why she did what she did. But OP really treated her own husband really badly.\n\nYTA",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "She basically told him that it was more important than his father's death.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yeh, read the room OP. what matters more, your seat of your husband's grief..",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "These could have been the only seats left on the flight. Did OP even ask?",
          "id": 85,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Exactly. Be mad at the Mil, not your husband. All you had to do was suck it up for a couple of hours. Instead you chose to not be there to support your husband because you got a bit less leg room on your flight.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9945,
      "content": "ESH. \n\nYou MIL won. It was most likely her intention to cause a fight and she won because you didn't go. Now she gets to bash you to everyone for not attending. \n\nYou didn't support your hubs when he needed it. So now all the nasty things she whispers in his ear while he's there, he's going to agree to re: you. \n\nYou were put into a losing situation either way. The whole thing sucks.\n\nSorry this happened to you.",
      "id": 87,
      "comments": [
        {
          "score": 6925,
          "content": "I agreed with you until this part\n\n>You were put into a losing situation either way. The whole thing sucks.\n\nShe could have asked if upgrading was a possibility if they could afford it, or she could have sucked it up so she could be there for her husband at his father's funeral. This was not the time to stand her ground, she could have waited to have a discussion about his mother's behavior after or another time.",
          "id": 88,
          "comments": [
            {
              "score": 2826,
              "content": "You are right. My petty ass would have tried to upgrade w her cc. But my husband would have taken the downgrade to sit by me (my hubs is fully aware of his moms shenanigans).",
              "id": 89,
              "comments": [
                {
                  "score": 2463,
                  "content": "This is what I don't understand, if he wanted her support so bad why didn't he just downgrade/upgrade to be with her? This whole conundrum could've been solved so easily if both parties weren't blinded with their own agendas.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 973,
                      "content": "If I didn't pay for the class seat, and my mom decided to be an ass and pay for 1 first class and 1 economy. I would have gotten on the flight, walked back to whatever peep is sitting next to my wife and asked if they wanted to be in first class instead. He didn't even pay for it, he should have sat next to his wife.\n\nAlso note, not saying OP is correct for just straight up bailing, but husband still an asshole since he was gonna just sit first class anyway. Also, note I actually did go through the loss of my father 5 years ago. While it is shitty, it still wouldn't have been something I would have just looked over. (Father was absolutely fine the week before or so it seemed, and dead the next due to his intestines dying so also an abrupt loss of father).\n\nEdit\": typos, autocorrect\n\nEdit 2: My first award! ❤❤❤❤ Thank you! It shall be cherished until I die.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 358,
                      "content": "[removed]",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 41,
                      "content": "Because people don't think straight when they are bereaved. They need their support system to be the ones who take on the thinking because it's really hard to think straight in the middle of grief. To blame someone for not making their wife happy when she is the one who is supposed to be supporting him is nuts. \n\nMil threw the first punch, but op burned down the house in retaliation.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "That's whats bugging me a bit, I know that my husband wouldn't even think and would have downgraded just to be with me, even in the event of something like a death in the family. Heck, he would probably do it just for himself, so he isn't alone in such a state. \nThe way OP's husband reacted and treated her, idk, it just doesn't sit right with me.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "I think the husband should have let OP sit in first class and then run that in mom’s face when they arrived. But that’s my petty ass too. That would have been the best way to teach MIL a lesson.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "not saying she is at all right, but just as you said my fiance would've found a way to sit by me, wether it was getting our own tickets or downgrading. I think she was more hurt that he didn't seem to care at all about her being there with him. I don't think this would've ended the same if he showed that he was equally upset about the situation instead of letting it go in light of the situation (which he should have a choice not to care about that one thing in the middle of this situation fairly enough)",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Grief can be exhausting. It's possible he just couldn't deal with the drama, sorting it out and all that, and just wanted the path of least resistance.  I mean, I think changing seating last minute can be difficult can it not?  I don't fly often so I don't really know.  Anyways, I think he shouldn't be blamed for just wanting a drama free flight.  \n\nPlus, like, she said he'd been crying the whole way there.  A lot of people are embarrassed about crying or looking like they've been crying in public.  He probably just wanted to get through this horrible flight as quickly as possible.\n\nEven if he knew his mom was being an ah maybe he didn't feel like dealing with all that.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "The husband could have also downgraded.",
              "id": 98,
              "comments": [
                {
                  "score": 17,
                  "content": "Or OFFERED to downgrade. Honestly, the offer would have been enough for me.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Yep, perfect solution here is for Husband to downgrade or OP to upgrade.  \n\nBest way to really annoy MIL and have a winning outcome.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Or he could have swapped to economy for probably no fee at all",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Well, she learned about this right at the airport, of course she made a rash and emotional decision, thats fairly normal when being ambushed like that.\n\nIm sure if she would have known more in advance, she would have had time to think about other solutions.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "EXACTLY I'm not sure why everyone thinks she is right for abandoning her husband over a plane ticket. Her feelings are very valid and should have been addressed after the funeral. It should not have taken priority to her husband's grief.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This. You never, never, never let people like this MIL win. You behave beyond reproach with a smile on your face. It drives them crazy (and it makes others doubt the bad things they've said about you behind your back.)",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "OP just lives a life free of manipulative and abusive assholes so she doesn't know how to handle it.\n\nHere is my guide to handle assholes.\n\nUpon finding out the tickets were different: \"Oh that's fine honey. It sucks I willnt be able to sit next to you but maybe you can take the time to reflect on things. I am sure your mother had her reasons.\"\n\nUpon seeing the mother: \"Thank you for flying us out I really appreciate the chance to be here for Husband. The flight was great.\"\n\n\nMany weeks later once husband has recovered: “what your mom did was bullshit and if she continues this behaviour we aren't visiting for Holiday anymore\"",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The MIL set up a lose/lose situation. There was no way to win here.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8392,
      "content": "YTA\n\nI get where you're coming from, mom probably thought she could do something to divide you from her son in his time of grief. But, y'know you fell for it hook line and sinker right? She drove a wedge between you and your husband and, ensured the family will remember you as the wife who didn't go to her husband's dad's funeral, and it doesn't sound like your husband was lost on the issue: he just asked you to hang in there for one plane ride in economy. He knew she was doing something shitty, but also knew it's not like he can refuse to GO TO HIS OWN DADS FUNERAL.\n\nYou played right into her hand better than she could have ever hoped for, and then made sure she got to spin whatever narrative she wants while your husband is left holding the bag. Do you think he's gonna say \"she didn't come because her paid for ticket wasn't first class like mine.\"? What is he even going to be able to do?\n\nIts just about supporting your husband when everyone around him is in a time of grief and you did more damage than a petty MIL to your relationship with him and his family. It was the exact reaction she was hoping for from you.",
      "id": 107,
      "comments": [
        {
          "score": 1090,
          "content": "I couldn't upvote this enough times, this should be top comment. MIL obviously meant it as a sleight and OP jumped at the provocation instead of putting her husband's needs in a time of grief first",
          "id": 108,
          "comments": [
            {
              "score": 537,
              "content": "It's also possible there was only 1 first class ticket left so one of them had to sit economy.",
              "id": 109,
              "comments": [
                {
                  "score": 934,
                  "content": "[deleted]",
                  "id": 110,
                  "comments": [
                    {
                      "score": 488,
                      "content": "Yeah I don't understand why the answer to the problem of being separated for the duration of a flight was \"ok, enjoy the whole funeral without me, bud\". \n\nAt the very least, OP is lying to us/ herself. She doesn't really care about supporting her husband. Or at least, she doesn't care when she isn't being catered to. Absolutely should have sucked it up and saved the complaining for another time when her spouse isn't in the midst of intense grief.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 54,
                      "content": "Not to mention, he'd have a little more privacy/space (somewhat dependent on the airline/plane) up in FC rather than Coach, so if he was as upset as she said he was, I'd want my husband to have that little privacy",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "Honestly, husband was grieving and crying. People are mad he didn’t try to work things out but that’s not his priority. He doesn’t have the capacity to deal with drama while he’s crying. \n\nGeez. I feel sorry for him.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Agree!! This baffles me and all the E S H … OP’s YTA big time!!\n\nMaybe he wanted to stay in first class also bc it’s quieter and more private. Maybe he balled in the car bc it was a private safe space and knew he was about to be stuck on a flight so wanted to get it out/it was sinking in being on the way to the airport. OP hopefully knows her husband well enough vs these hypotheticals, but she sounds pretty self absorbed and he clearly was fine with it. \n\nAnd sure he could’ve suggested solutions/thought to tell her ahead of time bc of their issues, but as others said grieving and everyone process differently! I’m a go to/stay at work type of person but would never judge someone who can’t function after months. OP’s maybe grieving and not thinking clearly for solutions if she was close to FIL, but I can’t imagine abandoning your partner over this! Would hope my love for my partner would override anything else when they really need me and are literally pleading with me! \n\nPlus a paid for flight is still a kind gesture/above expectation. And as others pointed out, it might not have even been a slight! What was the plan if she only bought him a ticket, bc still not a slight lol (no one’s obligated to spend money on you/equal amount, shitty if intention by MIL but something to let go even with a strained or worse relationship - the thing not to let go would be if she prevented/tried to disway you from attending)\n\nThere’s no way for her to ever salvage this, even if she can prove it was a slight! I would honestly think twice about my relationship over this. You outdid MIL in being TA and only hurt your husband! \n\nEdited to typo edit",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Literally!!! How entitled do you have to be to refuse to get on a plane because your seat is in economy? I’d be like wow that was nice of her to get him a first class seat so he isn’t cramped and bawling the whole way. Yeah ir sucks to be separated but I’m guessing there wasn’t tons and tons of seats available. It’s not like this was planned in advance.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Plus even if they had traded she would’ve been left alone, bc then he’d be in economy and her in first class.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Right! Instead the top comment is a petty one saying she did good to be petty. Amazing. Poor guy. His father just died and he doesn't even have his wife by his side.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "She forever put a dent in her relationship with her husband and MIL. \n\nI'm in no way defending her MIL but a last minute trip can create differences in seats, including class. Planes are fuller now because they have less flights. I don't think she'll have much of a marriage when he comes back.",
              "id": 118,
              "comments": [
                {
                  "score": 12,
                  "content": "My friend and I booked plane tickets for October in June and we sat in different rows. This is four months before and in no way comparable to a last minute trip. Even if there were enough tickets for both of them in first class the seats would most likely not have been next to each other. OP made such an incredibly petty decision which probably just hurt her husband and marriage. I hope this was worth it for you OP.",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 365,
          "content": "Exactly.  And honestly I wouldn't be surprised if this marks the beginning of the end of their relationship.  How can her husband ever trust her to be there for him in his time of need again if something as minor as different seating class on a plane was enough to get her to turn around and leave him alone?",
          "id": 120,
          "comments": [
            {
              "score": 344,
              "content": "100% agree.\n\nYTA OP.\n\nThere are times in life where it is ***not about you***. You made the conscious decision to be petty and skip out on your FIL's funeral because you were angry your MIL did not purchase you a first class ticket though she bought her son a first class ticket. Was that wrong of her? Yes. But, that doesn't even hold a candle to leaving your husband at the airport to fly out for his father's funeral because you didn't get the seat you wanted on the plane.\n\nHonestly? This is the end of your relationship. It might not be today. It might not be this year. But this will be something your husband ALWAYS remembers. He will remember that his wife was too selfish to suck up a couple of hours in economy class and go to his father's funeral with him. It doesn't matter what you say or how you twist it. He will remember that you didn't go with him because you didn't like your airplane seat. Because, at the end of the day, you took a minor issue that could have been handled later and you made it your hill to die on when your husband was grieving the loss of his Dad.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "As another commenter mentioned, there is a slim possibility that the MIL booked the last tickets available on said flight. If there was 1 first class seat and 1 economy available - it only makes sense to give the first class seat to the grieving husband. \n\nEither way, I think this is one of those scenarios where you suck it up to support your spouse, and deal with the apparent slight after.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "I'm not sure the MIL is the villain everyone's making her out to be, the woman had just lost her husband and it could have been an honest mistake. Or she might just have been trying to do something nice for her son? Like she knew he would be miserable and upgraded him to first class so he could be comfortable on the way to the funeral. First class tickets are hella pricey, she might not have been able to afford two. In that moment she was a grieving widow thinking about her poor son somewhere far away.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "RIGHT! She played directly into MILs hand. Now, instead of being able to say “MIL excluded me after her husbands death” she’ll always have go admit she wasn’t there for her husband in time of need because of some petty game.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I agree with everything except for the assumption that MIL even did this intentionally. How do we know there weren't any other seats available on the flight? \n\nI mean best OP can muster is that MIL is a *little* passive aggressive. I seriously doubt MIL was even thinking about this move right after her husband died... And even on the off chance she was? Give her the benefit of the doubt... Her husband just died...",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "100% on OP taking the bait. If I was her husband, I honestly don’t know if I would ever be able to forgive my wife for missing my dad’s funeral because she needed to “win” a battle of who can be more petty.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "She can also play dumb and say, \"What are you talking about, of course I paid for two first class tickets. What didn't you both get first class?? Oh my, she should have said something, that was a complete mistake by the airlines. I wish she would have said something.\"",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5405,
      "content": "Absolute masterstroke by MIL. Whatever department of the CIA that is responsible for overthrowing foreign governments that want to bring in universal health care, she should be the head of it.",
      "id": 128,
      "comments": [
        {
          "score": 1845,
          "content": "Yes.  She is so much smarter than OP.  To think of such a devious solution, planning the demise of her beloved son’s marriage in the moment of her grief?   MIL knows who the OP is, and she played right into those weaknesses.  Brilliantly done.  \n\nESH.  But I’m leaning a bit towards Y-T-A, OP, only because your husband’s dad just died, for goodness sake.  Did this really need to be the battle you go all in for?  And by the way, your MIL won this battle.  Good luck with salvage efforts.",
          "id": 129,
          "comments": [
            {
              "score": 850,
              "content": "Like really. He sobbed all the way to the airport then you left him there. YTA FOR SUUURE",
              "id": 130,
              "comments": [
                {
                  "score": 473,
                  "content": "You just don't get it. She wanted to sit next to her husband to support him. Those few hours in the air are crucial time to support her husband. Like who needs support during the funeral? Definitely not her husband.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 163,
                      "content": "Might want to slap an /s on that, chief, before people think you’re serious. Lol",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Unmn not so fast here re MIL plotting because it could have just as easily been a fulll flight with no other options",
              "id": 133,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 215,
          "content": "LOL so true.  MIL may have won this battle and the war.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I dunno. I can imagine MIL sitting behind a computer and being like \"I love my son, he's going through a lot, let me get him a first class ticket.\" and then thinking \"I don't really care for his wife, but I guess I'll pay for her too, but not first class\" and maybe that's how it ended. \n\nBasically, OP was offered a free plane trip and refused because her husband got a better version and she wanted to sit together. Husband had it very right to say \"just suck it up and get over it\". Keep in mind husband is deeply in grief, so hearing someone complain about not sitting together is like \"yeah it sucks but my dad just died\". \n\nI don't think MIL is necessarily a mastermind, OP is just extremely self-centered.",
          "id": 135,
          "comments": [
            {
              "score": 21,
              "content": "Right? Like my sons suffering, I know he will be a wreck, let me do this for him. My daughter in law doesn't need a first class ticket. (Did OP ever even mention how she feels about this man?) Because MIL is still paying for a funeral? And like yeah petty, maybe she could have bumped her up some but this just seems the weirdest thing to focus on. My mil didn't let us sit together for 4 hours on a plane, she's a monster schemer destroying my marriage? Ooh burn \n\nThis isn't a honeymoon, its not a vacation. There's someone who should take precedence here, and it's not economy lady. Wild. The husband sucks? For marrying her maybe. I don't know how this man didn't just go off on this woman in the airport. I think he was very mild in what he said.\n\n OP is running economy on empathy, she should try splurging on thinking about people other than herself.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3109,
      "content": "This is a tough one, I’m going with ESH. \nYour mother in law was petty and juvenile, but your husbands father just died. This was about him, not you. The fact that neither yourself or MIL could put your shit aside for a situation like that is the most disappointing part of all.",
      "id": 137,
      "comments": [
        {
          "score": 567,
          "content": "This is what i'm trying to tell all those numb-minded people who are sayin NTA.... it was his gooddamn father's funeral, give the man a break....",
          "id": 138,
          "comments": [
            {
              "score": 74,
              "content": "Agreed! OP chose the wrong time to make it all about herself. I also think it’s weird how OP and all the N-T-A’s here are saying that what the MIL did was petty. Sure, it very well could be, but given that it was an emergency and the tickets were booked presumably last minute there’s a decent chance that maybe there were only two seats left and she just happened to give the 1st class one to her own child. Why assume the worst and make yourself unnecessarily angry during an already difficult time?",
              "id": 139,
              "comments": [
                {
                  "score": 48,
                  "content": "Right. And that “only two seats left on the plane” story is the one you can bet MIL is telling the rest of the family now, whether it’s the truth or not.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 75,
                      "content": "The story she is telling is, “I PAID FOR HER PLANE TICKET and she still couldn’t be bothered to show up to the funeral. She complained that it wasn’t first class so she couldn’t be bothered.”",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Yes, if he sobbed all the way to the airport while she was with him, how did he manage a whole flight alone, not just grieving his father but also abandoned by his wife? \n\nMaybe ask the staff at the airport if there was a way of upgrading/ downgrading one of the tickets so you could sit together.  From a petty perspective, the best win would have been to sail into that funeral and thank MIL for buying the plane tickets because it meant so much to be able to sit with him and comfort him.",
              "id": 142,
              "comments": [
                {
                  "score": 21,
                  "content": "And how did he deal with the funeral, the day(s) before and after before going home, with the knowledge that his wife prefered to stay home over the price of a flight seat. I know that if I was in the husband’s shoes, I’d take notice of what my partner’s priorities are, and realise that I am not the priority to them in one of the most difficult time of my life",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "OP is YTA. She states in her post:\n\n“I wanted to sit next to my husband and support him. He sobbed the whole ride to the airport and I didn’t want to leave his side.”\n\nSo OP-who sooo wanted to support her husband, decided to just leave him to grieve alone for the day/days of the funeral. Yeah, right. \n\nOP was more concerned about her ticket than her husband’s grief. It was a shitty situation and she could have risen above if she truly meant it, but she abandoned her husband in his time of grief/need/support. HIS FATHER JUST DIED and she left and stayed home. \n\nOOP, you really were not concerned about your sobbing husband and you CHOSE “to leave his side.”",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I agree, ESH, but the pettiness of the MIL to think of this plan and put it in effect while she just lost her husband? I am really hoping that she isn't that petty and that the only two seats left on the plane were one economy one first class. Either way, OP needed to be there for her husband, no matter how she got there.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "So we don’t know that MIL did this as a jab. Could have been the last two seats on the plan. Could have been an automatic upgrade for points. Could have been an oversight in the midst of planning her husbands funeral AND playing travel agent for her children/family. OP didn’t stick around to find out. She let her husband bury his father, and her MIL her husband alone.\n\nOPs unwillingness to answer questions or give examples of MILs pettiness makes me skeptical that we can take her opinion at face value. YTA.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Imagine your dad just died and your SO and mom are busy fighting like little kids.  \nI'm baffled even though her husband just died, MIL was petty enough to book different tickets to cause a fight. Crazy.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3005,
      "content": "ESH except your Husband. \n\nI cannot believe people are saying OP's husband is an asshole for not freaking out at his (albeit toxic) mom when his fucking *DAD* is **DEAD**. He's probably pretty fucking upset. It's a seat. MIL sounds like an insufferable shit, but for gods sake man it's a seat. Everyone's really telling him to make a level 12 nuclear \"defend my wife\" argument when he just wants to go to his **RECENTLY DEAD DAD'S FUNERAL**.\n\nOver 1 economy seat on 1 flight. On a fucking interstate flight. Pretty much the shortest, easiest flights you can possibly take. Some people are really checked out (yes op's MIL included but still, you pick your battles)\n\nEdit: MIL is toxic according to OP yet has no proof asides from \"we disagree sometimes and is civil to me\" as well as the fact she bought them 2 last minute plane tickets while planning her husbands funeral. OP is such an ass hole I can smell it from here",
      "id": 148,
      "comments": [
        {
          "score": 880,
          "content": "Seriously. This would be unforgivable for me. She chose not to go. She made that choice. Was MIL being nasty? Yes. Would I have been upset too? Yes. I would never ever abandon my spouse. They can deal with MIL later. There's still the ability to deal with MIL. There are NO second chances here. OP can never undo this.",
          "id": 149,
          "comments": [
            {
              "score": 323,
              "content": "And the part that really gets me is that the OP's husband even said we'll deal with MIL later, because he clearly knows that there's something up there. But the most important thing on his mind at that time was the fact that his father just died.",
              "id": 150,
              "comments": [
                {
                  "score": 235,
                  "content": "The more I've read of people's responses the more I've realized that the worst OP could bring herself to say was that MIL is sometimes a little passive aggressive. Is being a little passive aggressive all it takes for you to abandon your spouse? Personally I'm thinking they just don't get along and OP had an immature meltdown. If she was so awful then why is the worst thing she's told us MIL has done is buy her a coach ticket instead of first class?\n\nI saw someone reply with OPs edit and she's even more a fucking monster than I already thought. Your husband was sobbing the whole ride there and when he didn't want to deal with the hassle of fixing the seating issue you just left him? Hard YTA.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Oh shit. It got that much worse? Jesus Christ OP is hard YTA.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": "> MIL sounds like an insufferable shit\n\nBecause she bought 2 plane tickets and only upgraded her grieving son's ticket? Could such a inexcusable faux pas maybe have been caused by her being preoccupied planning a funeral, settling affairs, and grieving her fucking **SUDDENLY DEAD HUSBAND?**",
          "id": 153,
          "comments": [
            {
              "score": 50,
              "content": "Right. The woman just lost her husband and she’s probably been with him longer than the husband has been alive. The loss is terrible. Maybe she wasn’t thinking clearly. Maybe there was only 1 first class seat, maybe she didn’t realize she didn’t upgrade both. \n\nAnd honestly I’m not sure I’m on the “MIL sucks” bandwagon based on the OP who called her passive aggressive but the OP also looked for a reason to go nuclear while her own husband was grieving the loss of his father. It gives me “always looking for drama” vibes.",
              "id": 154,
              "comments": [
                {
                  "score": 33,
                  "content": "Weird how the OP has no actual examples of the MIL being terrible or previously scheming to ruin her relationship.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Some people just need an enemy to feel persecuted by.",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Lmao MIL would kinda have to be with the husbands father longer than he's been alive.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah true. I just finished a 12 hour shift of chaos my brains not working that great",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I know, I'm trying to soothe the rapid reddit hordes LOL. If we take op at face value, the mil does sound like an insufferable shit most of the time. But I completely agree with you that here OP just sounds beyond entitled. Dead husband and dad trumps temper tantrum over **free** plane ticket",
              "id": 159,
              "comments": [
                {
                  "score": 15,
                  "content": "So the correct answer is YTA since we don’t know that MIL is in fact an intentional AH.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Yeah, if this is a recurring situation, then the husband is failing OP *every other time he isn’t standing up for her* but this time she needed to put it aside and recognize that her embarrassment and irritation was nothing compared to what he was going through, and she needed to prioritize.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "This is really a YTA response. Sure the MIL sucks, but nowhere near as much as OP, and she also has a dead husband, which is more or less a free pass for something so f*cking inconsequential. Besides, maybe OPs husband is 6’4” and all his mom was thinking was she didn’t want him to be cramped on a plane. Maybe it wasn’t nearly as nefarious as OP is making it sound, bc from her details alone it’s really not that serious, but she went to divorce territory with it. I would honestly never trust her again bc she proved at one of the worst times in her spouse’s life that she will absolutely never put him first or do anything for him, or really ever be concerned about his well-being unless it happens to intersect with hers.",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Welcome to the subreddit, you seem unfamiliar with the culture. Let me help you out.\n\n1. If a man tells his mother anything about the relationship that's a red flag.\n1. If a man doesn't suppress all emotion to defend is wife from his mother that's a red flag.\n1. If a man has a relationship with any women that's a red flag.\n1. If a man has a relationship with any men he's closeted which is, of course, a red flag.\n1. If a man ever has to ask for any help from anyone in any way, that's a red flag.\n1. If you mention the rampant misandry in the subreddit welp, that's a red flag.",
          "id": 163,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "I mean, do we know that MIL really did this out of spite? Could there be another explanation? We only have OPs snap judgement to go on here",
          "id": 164,
          "comments": [
            {
              "score": 35,
              "content": "There's *many* explanations that are before \"she wanted to power play me\". Fuck op's clearly never booked a last minute plane ticket, let alone 2.",
              "id": 165,
              "comments": [
                {
                  "score": 15,
                  "content": "Right? Let alone booked multiple flights while planning your husbands funeral. That’s why I lean YTA.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I booked two tickets in June for October so four months in advance and my friend and I had seats in different rows. If I‘d have to book two plane tickets last minute for something as important as a funeral of a parent, I‘d take any two tickets I‘d get. Worst case they‘d be not even the same plane but two planes that start and arrive at similar times.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "ESH. All of this. No one is saying to that the issue with the seat couldn’t have been brought up later. But it was a huge tactical mistake to make this the hill to die on when it came to his mother. He lost his father, she lost her husband. Does that give her justification to behave cruelly, no. But it does make you an asshole if you choose this moment to make an issue out of it. Take your seat down in economy, be there for your husband at the funeral, and then talk about this later once everyone has calmed down. \n\nEven if husband at some point comes around to her point of view, she will only have won this battle. But she officially lost the war.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Absolutely. OP is TA. OP bailed on her husband and didn't support him over something like a Airline seat.  I seriously don't get why some people get so caught up in the status of First Class verses economy.  Plus everyone is assuming MIL was being nasty.  Maybe she was but it is a last minute booking so it could be something as simple as there was limited availability on the flight.  I've only booked first class tickets once and that was because the economy tickets were sold out.  It was totally not worth it.  On short interstate flights the difference between economy and first class are trivial.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2336,
      "content": "This post isn’t about seats on a plane.",
      "id": 170,
      "comments": [
        {
          "score": 835,
          "content": "Yeah, there’s a huge difference in the verdict (imo) if this is the culmination of a long pattern of MIL being passive aggressive and/or the husband not sticking up for his wife vs. her randomly choosing this hill to die on.",
          "id": 171,
          "comments": [
            {
              "score": 1228,
              "content": "I personally don't think it matters that much in this instance.  I feel like I'm taking crazy pills reading the responses here.  How on earth could it ever be okay to miss your HUSBAND'S DAD'S FUNERAL because you are pissed that your MIL booked one first class ticket and one economy ticket? Her justification in the edit makes it even worse.  Her stated reason that she was so upset was because she wanted to \"sit next to her husband and comfort him\" basically, but when she realized she couldnt because the MlL is a dickbag she decides to just not support him AT ALL?!?!? She goes back home and misses her FIL's funeral and ABANDONS her husband completely right after the death of his father ?? Over a seat being economy?   That's so next level petty and disrespectful to her husband.  At the airport on the way to a parents funeral is not the time to throw a fit and make a stand.  My husband's dad died after a long battle with Progressive Supra Nuclear Palsy (rare brain disease) 5 months ago.  I would have taken that economy seat, and my MIL is manipulative and petty also.  In fact, I probably wouldnt even have gave a shit under the circumstances.  Losing a parent is devastating and not at all the time to battle it out with mother in law over who can be more petty.  In short, even if this was a long history of antagonizing behavior, this was NOT the way to handle it, or an appropriate time to do so.",
              "id": 172,
              "comments": [
                {
                  "score": 95,
                  "content": "I’m with you. If there is a time to put aside petty differences with MIL and be there for her husband, this is it. Saying goodbye to his father who unexpectedly passed away. \n\nOP, YTA a million times over. You let your MIL win and weren’t there to support your husband who you claim to want to support during this difficult time. There is no getting past this. Good luck.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 235,
          "content": "This isn't about the Iranian yogurt.",
          "id": 174,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 195,
          "content": "I've had it with these seats on this motherfucking plane!",
          "id": 175,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "The amount of assumptions are huge!",
          "id": 176,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 923,
      "content": "ESH. Well played MIL, unfortunately the one who looks bad to everyone is you.",
      "id": 177,
      "comments": [
        {
          "score": 101,
          "content": "This is accurate.\n\nETA OP has probably indefinitely lost the moral high ground. As much as I would be pissed at MIL for taking this opportunity to slight me, I do not think I would have let her win.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "The mother in law who bought her grown adult daughter in law a plane ticket looks bad? Why is purchasing a plane ticket for an adult an expected action of a grieving widow, and why on earth would MIL look bad for not buying her DIL a *first class* seat? Do you know how incredibly entitled that sounds?",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 831,
      "content": "I'm going to go with ESH.\n\nYour MIL booking your husband a first class ticket and putting you in economy is low.\n\nBut you should've gone. It was your husbands father who died. At the least, you should've been there to support him.",
      "id": 180,
      "comments": [],
      "relation": "No"
    }
  ]
}