{
  "post content": " I (24f) have been friends with \"Tiffany\" (25f) for about ten years now.\n\nThe two of us randomly met online on a website and started chatting. \n\nWe share everything with each other and I would like to think that our friendship is healthy. We don't judge each other, we always come to each other first when something bad or good happened in our lives, we have amazing communication and share a lot of interests and hobbies. \n\nI'd like to think everything is good between us, but here's why I think I might be an a\\*hole: During our usual chatting time (4 to 10 PM her time, because she lives in America, and 10 PM to 4 AM my time because I live in Europe) I kept falling asleep on her. I would randomly fall asleep while waiting for her to reply because I'm genuinely exhausted, only to wake up later to see she had replied a while ago. \n\nWith my classes starting again I also had to get a new sleeping pattern which looks as follows; I wake up around 8 or 9 AM and go to my class. I stay awake most of the day and take a nap if I'm too exhausted. If I'm really busy though I don't have the time to do so, which leads to me getting tired around the time I start chatting with her. We chat until our time is up and then I go to bed and repeat the cycle again.\n\nI try my best to stay awake during our chats, but on some days I just start drifting off.\n\nUsually Tiffany is extremely understanding about this happening. She always assures me not to worry, that she knows I'm exhausted from the chores I have to do around the house and the classes I take at college.\n\nA couple days ago it happened again.\n\nI fell asleep on her for an hour and started apologizing for dropping without warning. This time she wasn't understanding. She didn't sound upset or mad, but she didn't sound like her usual self either.\n\nShe simply told me \"I'm used to you falling asleep on me by now, so I figured that happened again.\"\n\nSomething about this statement just felt off to me. As if she was hurt by my actions (which she would have every right to), but she kept assuring me that I didn't do anything wrong.\n\nTiffany never called me an a\\*hole for any of this. My friends and family also tell me that being exhausted with my (admittedly) horrible sleeping schedule is perfectly normal and that I might be overthinking this.\n\nStill, something about how Tiffany wrote that sentence just gives me an uneasy feeling. \n\nI'm scared of losing my friend due to this behavior of mine. I already tried fixing it, but I still want to make sure that I didn't turn into a toxic friend, who is taking her friend for granted. If I did, I want to at least catch myself and change while I still have the chance. I don't want to lose her, so I'm asking you guys for an objective judgement.\n\nAITA for falling asleep on my friend?",
  "id": 1,
  "comments": [
    {
      "score": 4,
      "content": "NAH.  She already said she wasn't upset with you.  Take the things your loved ones say at face value & trust that if there's an issue they'll let you know.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH , she really just expected youd fallen asleep. It’s ok to do that! I used to have a friend in a different time zone, and I didn’t expect an immediate reply. So no need to apologize when the expected happens. No harm no foul",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA\n\nShe shouldn't expect you to chat during the time you would normally be asleep.  That's unrealistic.  Best to pick a particular time that both of you can manage and also a time limit.  That way you get to visit AND you get sleep.  A true friend will be reasonable about this.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I fell asleep while chatting with my friend on multiple occasions despite having promised to her it won't happen again.\n(2) I hurt her feelings, made her feel disregarded and ignored. I also broke my promise to her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    }
  ]
}