{
  "post content": "Some background - I have a small 12 lb dog that barks a lot at other  living creatures. He's super friendly and not at all aggressive, but he  likes to say hello with a passion, which can sometimes startle people  and his barking gets very annoying when he’s out in the yard chasing  birds and squirrels.\n\nThe other night I was coming back from his nighttime walk at about  10:30pm. Neighbor a few houses away who I’ve never met is out with his  dog, who is much bigger than mine maybe \\~40 lbs. The dogs will bark at  each other, my neighbor isn’t friendly, and so when we encounter each  other we typically just walk past each other as quickly as possible  pulling our respective dogs along as they both bark away. On this night  its dark and his dog is peeing on a tree, and they don't see us. I pull  my dog in close to me and work on keeping him calm, but as we get closer  he starts barking like a mad dog. My neighbor's dog gets startled, and  immediately charges at us. Neighbor has a retractable leash, and the dog  reaches the end of it and snaps around 180 degrees. He doubles back  towards us and this time the neighbor loses the leash. The dog attacks  mine and throws him up in the air. I shove the neighbor's dog aside and  pick mine up. Neighbor grabs his dog and everyone calms down. He  apologizes and swears his dog has never done anything like this. My dog  seems shaken but ok, so we go our separate ways with him saying to let  him know if we need anything.\n\nOnce I get in my house I see my dog is bleeding, shaking like crazy,  and wont' put any weight on one hind leg. So I decide better take him  into the doggy ER (at near midnight on a work night). Luckily there was  nobody else there and other than some cuts and bruising, my dog is ok.  They provide some pain meds and send us on our way with a bill of $280.\n\nThe next day I walk over to my neighbors with the bill and other ER  paperwork. He is surprised as he thought my dog was ok, and offers to  split it with me. I suggest as he is the one that lost control of his  dog, that he should pay the entire bill. I also mention that the ER  suggested I file a police report to get an official record of the  incident in case it ever happens again, which I did not do. The neighbor  flips out at me, saying my dog instigated the attack, and he lost the  leash because he’s recovering from back surgery. He says he is trying to  be nice by offering to split the bill with me, and that my response to  his neighborliness was to threaten to call the police. He further adds  that he is our rep for the HOA and that my dog is a nuisance with all of  his barking, and he could file a quality of life complaint (we don’t  let my dog out at all at night/early morning, so he’s never making noise  when noise ordinance is in effect). In the end after some back and  forth, he begrudgingly paid for the ER bill.\n\nSo reddit, AITA for asking my neighbor to pay the pet ER bill after my annoying dog instigated his to attack?\n\n\\*EDIT: I have no idea how to interpret the results here.  The majority of comments saying I'm NTA, but these comments are all being downvoted while the minority saying either ESH or YTA are being upvoted, and my total Karma from the post is -92.  I see the post has been tagged as Everyone Sucks so I think that means I should probably just leave things alone with the neighbor and hope that this is the end of it.",
  "id": 1,
  "comments": [
    {
      "score": 111,
      "content": "YTA morally because your dog is rude and territorial over territory that isn't his.  Regardless of laws, this is DOG LAW that ankle biter owners just can't seem to comprehend.  \n\n\nI have 5 big dogs, one small one.  The small one is the worst.  We pick her little AH self up for everyone's safety on a walk to pass a larger dog because she, as a small dog, IS THE AH with her big mouth and nothing to back it up.  Your dog too, is the moral AH and by extension, you.",
      "id": 2,
      "comments": [
        {
          "score": -18,
          "content": "Try putting this in another context.   Woman who dress provocatively deserve to be harassed, insulted, or attacked?  If they speak louder than you prefer they deserve to be shut up? \n Just because a little dog barks doesn't mean it deserves to be attacked.  My 95 lb pit bull barks to say hi to everyone, she shows zero signs of aggression because she believes everything is her friend.  Under no circumstances do I think my dog deserves to be attacked for barking, especially since she is always on a fixed lead or leash 100% under control of an adult.  I hate little dogs but seriously can't comprehend how you think OP is at fault when they maintained full control over there animal while the other owner did not",
          "id": 3,
          "comments": [
            {
              "score": 25,
              "content": "This was a pretty gross comparison… women are not like dogs. Dogs are pets that need to be trained. No one is saying the dog DESERVED to be attacked. They’re saying that it’s not a surprise and it’s the consequence of poor training (and if training doesn’t work, then OP, as a responsible dog owner, needs to take partial responsibility/accountability for the dogs behaviour). Just like the neighbour must also take responsibility/accountability for its dog attacking another dog.",
              "id": 4,
              "comments": [
                {
                  "score": 3,
                  "content": "Also, OP wasn't in full control of their dog. It was barking despite OP trying to keep it calm.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -58,
          "content": "Oh trust me, I comprehend that my dog is rude.  I've spent a lot of money on training in an attempt to get him to shut up, but we can't get him over his leash reactiveness.  I think from that perspective both dogs need more/better training.  While I would agree with the verdict that my dog is an asshole for starting the whole thing, I'm not sure this makes me the asshole for asking my neighbor to pay the vet bill.  After all, as an owner of 5 big dogs I'm sure you understand that you have to have control of your dogs no matter what stimulus is around, no?",
          "id": 6,
          "comments": [
            {
              "score": 47,
              "content": "Because you have any control over *your* dog?",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": ">you have to have control of your dogs no matter what stimulus is around \n\nYeah okay pot, seen the kettle lately?",
              "id": 8,
              "comments": [
                {
                  "score": -32,
                  "content": "i don't understand these comments - my dog was under control on his leash right next to me.  I'm not sure him barking indicates I don't have control of him?",
                  "id": 9,
                  "comments": [
                    {
                      "score": 22,
                      "content": "barking at another dog absolutely indicates you didn't have control of him. Because if you did he would have just ignored the other dog",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It's because somebody has big dogs doesn't mean that you don't have a responsibility to have your little dog under control.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 74,
      "content": "I hate barking dogs. It sounds like you've done nothing to curb this behvaior.\n\nESH\n\nThey have an aggressive dog that should be muzzled if it pulls stunts like that. Your dog instigated the fight. \n\nIf I was your neighbor and your dog was constantly barking I would have already called animal control and complained.",
      "id": 12,
      "comments": [
        {
          "score": -46,
          "content": "In my defense we have spent a lot of money on training trying to curb this behavior with minimal success.  From everything I've read and been told I have no doubt we are doing something wrong, and need to continue with training until we have it figured out.",
          "id": 13,
          "comments": [
            {
              "score": 43,
              "content": "In my city. A barking dog that is annoying neighbors is always considered noise pollution no matter what time of day. \n\nThe fact you think it's okay because of the time of day is very telling to me. \n\nAs if people don't work on 2nd or 3rd shift.",
              "id": 14,
              "comments": [
                {
                  "score": 8,
                  "content": "THANK YOU",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I mean get ready for a lot of complaints about your dog.",
              "id": 16,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 51,
      "content": "Equally share responsibilities.  Yes, his dog attacked.  Your dog was showing aggression with the barking.  You can take him to small claims court and win, though.  But at what cost.  He will then start making noise complaints, and he will win.",
      "id": 17,
      "comments": [
        {
          "score": 25,
          "content": "I agree that OP is responsible for his dog and the neighbor is responsible for their dog, but their dogs' behavior is not equal. A dog barking and a dog attacking another animal are both behaviors that their owner should address, but the second is significantly worse than the first.",
          "id": 18,
          "comments": [
            {
              "score": 5,
              "content": "I don't disagree that both need to be responsible for their animals, but neither did that.  This game will escalate to tit for tat, since neither feel any responsibility.  That's all I am saying.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 49,
      "content": "ESH, it sounds like neither of you truly had control of your dogs. You let your dog be aggressive towards his dog (yes, even little dog barks are a sign of aggression). It also seems like you kind of surprised your neighbor at night that's why he dropped the leash. Your dog is a known aggressor. Make yourself noticeable or wait away from other dogs. You should have not given him the bill. That should have been a conversation with a suggestion you'd like him to pay at the end of the discussion. You'll need a plan for how these dogs can interact in the future.",
      "id": 20,
      "comments": [
        {
          "score": 27,
          "content": "This - both of you made mistakes, but you pressed for him to take all of the financial responsibility, and threatened him with a police report in order to try and get your way, so that's how you moved from E S H to YTA.  Your neighbor was right to suggest splitting it.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -9,
          "content": "This is the most helpful response so far.  In hindsight I could have done a better job of making him aware I was approaching.  I kind of felt guilty for giving him the bill after he reacted so negatively, but I couldn't really figure out why because I know legally he is responsible as he is the one who lost his leash and didn't expect such a negative reaction to the request.  So I posted here hoping someone would explain to me why despite being in the \"right\" I still felt like an asshole.  You've helped me recognize, I could have prevented the entire situation by just being more aware of my surroundings and either turning around or giving him a heads up I was near.  Still don't think that excuses him losing control of his dog, if he has a bad back he probably shouldn't be using a retractable leash, but I failed to recognize my surroundings and the approaching situation despite knowing my dog's tendencies.  Thank you",
          "id": 22,
          "comments": [
            {
              "score": 20,
              "content": "So the right thing to do would be to reimburse your neighbor for half the bill.\n\nAlso, why don't you cross the street when coming up on dogs you know don't get along together?",
              "id": 23,
              "comments": [
                {
                  "score": 2,
                  "content": "i was across the street, his dog broke free from the leash and ran across the street to attack",
                  "id": 24,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You haven't answered the other question, why not go over to the neighbor, apologize and give him half the money back. Say \"we're both obviously dog people and shit happens, I'm sorry and I hope we're cool. I'll do my best to keep my dog away from yours and am still working on controlling the barking\"\n\nTHE END",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 38,
      "content": "Info: wouldn't you freak out if it were dark, you were in a vulnerable position, and someone came up behind you and began an activity you found threatening?",
      "id": 26,
      "comments": [
        {
          "score": -5,
          "content": "Yes of course, I completely understand why the dog reacted the way he did.  But that's why we have leashes.  I'm not asking which of the dogs are the asshole (they both are), I'm asking which of the people are the asshole.",
          "id": 27,
          "comments": [
            {
              "score": 26,
              "content": "Both you both are Equally responsible. You know how your dog is jut like he knows how his dog is. Split the bill stay away from each other and put more effort into finding the right training.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "You are. Both dogs were the problem. Yours because you let it continue a behavior you're aware other dogs interpret as aggression, and his because it was violent towards another dog. Your neighbor is offering to pay half the bill because he was half the problem. You need to accept you were the other half and that part of the financial responsibility is yours.",
              "id": 29,
              "comments": [
                {
                  "score": -2,
                  "content": "while i accept some responsibility for my dogs behavior, I'm not sure its fair to say my dog barking was half the problem.  If he kept his dog in control on his leash and both dogs just barked at each other than we'd be equally responsible for our dogs being the assholes.  But he lost control of his dog which attacked and bit my dog, sending us to the ER.  I'd accept like 30/70 responsibility, but i don't think my dog barking and his dog attacked are equally bad behaviors.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I've found where you're going wrong! \nYou excuse your dogs behaviour. Your dog barks uncontrolled at this dog all the time. This dog has finally had the opportunity to tell your dog to stfu. \nYou need to correct and redirect EVERY SINGLE TIME and stop making excuses for your uncontrolled mutt! \nIf you were able to control YOUR dog, he never would have been attacked. Your dog was the aggressor and came out second best. \nPay back half the bill and be grateful it wasn't worse. \nOh, YTA.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "YTA. Splitting it in half was fair.",
      "id": 32,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "YTA. Your dog needs to learn some manners and socialization. You need to get your dogs reactiveness in check. It seems you didnt put enough effort into his education. Do you go to a dog school every week? And if not, why not. You clearly need the instructions and your dog the socialization.. \nYes it was a bad accident and splitting sounds fair. But dont surprise people and dogs at night with a barking terror dog",
      "id": 33,
      "comments": [
        {
          "score": 2,
          "content": "I have spent thousands of dollars getting my dog trained to no avail.  Need to keep working on it clearly.",
          "id": 34,
          "comments": [
            {
              "score": 7,
              "content": "Maybe going to a weekly dog school would be a good idea",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "Yta  and I am calling BS on his barking is not aggressive and it is your fault for not training your dog to be better behaved in public.",
      "id": 36,
      "comments": [
        {
          "score": 1,
          "content": "I have spent a lot of money on training with no real results.  Knowing this, I keep my dog under control on a short leash so if he does react he can't actually get away from me.\n\nMy neighbor whose dog is also clearly reactive, uses a 25 ft retractable leash.  So we both have dogs that need better training, but i have control of mine and he lost control of his.",
          "id": 37,
          "comments": [
            {
              "score": 4,
              "content": "Your dog, barking / reacting to a dog is not having your dog under control. I will agree with you that having a 40+ pound dog on a retractable leash is always a recipe for disaster, but you need to take responsibility for your dog. And stop making excuses, yes it sucks to have spent time / training / money into a dog and not see the results you want. If something is not working then you need to keep trying until you find something that does. May I ask what type of training you’ve done? Has it been positive only? Weekly classes? Or in home training?",
              "id": 38,
              "comments": [
                {
                  "score": 1,
                  "content": "We tried positive training with out much luck.  On the advice of our trainer, who were were seeing weekly we tried using a choke collar, but that didn't help much and caused my dog to throw up.  Vet said to never use a choke collar on such a small dog.  So we stopped going to that trainer.  Tried a shock collar, that helps when he's around the house, but he ignores it completely when we're out on walks and he sees another dog, even at a high setting.  We've had some luck using a spray bottle coupled with treats (negative feedback for negative behavior, positive for positive). I think I am going to try one of the group classes at the local Petco next. The crazy thing is when we bring him to the dog park and take him off the leash, he shuts right up, ignores the other dogs, and just walks around sniffing their pee.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 2,
                      "content": "If he’s fine off leash, then it could be a form of leash aggression, or boundary aggression. Group classes could help desensitize things, but you might want to try and find a in home behaviorist. Because while training does help, somethings you need to get to the root of the problem which could be behavioral. I wish you luck! And you should be proud of yourself you are trying to do right by your dog, some people would have given their dog up for even less.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "ESH  OP has a loud, obnoxious dog. Obviously whatever training OP says they’ve tried isn’t working.  Neighbor on the other hand lost control of his dog. While ‘legally’ OP might have won 100% of the ER bill in court, OP should have settled for a 50-50 responsibility for Vet bills.  All I can add is get ready for the noise complaints.",
      "id": 41,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "YTA",
      "id": 42,
      "comments": [],
      "relation": "Attack"
    }
  ]
}