{
  "post content": "So Redit I've been asking myself over the weekend if IATA for not wanting to go to my Uncles funeral?\n\nFirst I have not seen him for over 7 years (last time i saw him was my step dad's funeral. I also did not even talk to him then)\n\nThe reason for not wanting to go is one I was not that close to him at all. Also that when my grandmother (his mother) was near the end of her life He took her down to get his name on her house (To be able to pay bills as he said to her) and told her what she was signing was to get his name on the house with hers. But was infact it was taking her name off and just adding his own. So when she passed away two months later. The will was read when it came to the house that was supposed to be split with all 4 kids. It was no longer in her name so there was no inheritance. Also when her (grandmothers) belongings were being split up no one was allowed to take anything as it was all \"in his house\" I was very close to my grandmother and was infact on the phone with her when she had her last and fatal heart attack. So here i am wondering that should I be there for my mom even tho I actually yipped for joy when I got the text that he had passed? I could fake it for my mom if she decided to want me there but so far I am leaning to not going at all I wouldn't want to upset other family members with my fake sympathy\n\nI think that i will the the A**hole if i go and offer fake sympathy. So as the old adage says if I cant say anything nice I wont say anything at all",
  "id": 1,
  "comments": [
    {
      "score": 2,
      "content": "Yeah, this is a tricky one. The mildest YTA I can possibly muster, but only because you're being a little selfish.\n\nFunerals are not for the dead, but for the living who are left behind. Your mother just lost her brother, so regardless of your opinions of him I think you need to keep in mind she could probably do with your support right now.\n\nI assume your mother is aware of your animosity toward your uncle? Has she indicated any sort of preference to you? I think your decision as to whether to go or not is going to very much depend on your mother's wishes and the dynamic within your family - for example, I wonder if you showing up would cause *more* issues than not?\n\nI don't envy your position. Best of luck to you.\n\nEdit; forgot there was the option of \"no assholes here\" - I think I'll stick with my original decision but it's honestly one that could go either way.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo Redit I've been asking myself over the weekend if IATA for not wanting to go to my Uncles funeral?\n\nFirst I have not seen him for over 7 years (last time i saw him was my step dad's funeral. I also did not even talk to him then)\n\nThe reason for not wanting to go is one I was not that close to him at all. Also that when my grandmother (his mother) was near the end of her life He took her down to get his name on her house (To be able to pay bills as he said to her) and told her what she was signing was to get his name on the house with hers. But was infact it was taking her name off and just adding his own. So when she passed away two months later. The will was read when it came to the house that was supposed to be split with all 4 kids. It was no longer in her name so there was no inheritance. Also when her (grandmothers) belongings were being split up no one was allowed to take anything as it was all \"in his house\" I was very close to my grandmother and was infact on the phone with her when she had her last and fatal heart attack. So here i am wondering that should I be there for my mom even tho I actually yipped for joy when I got the text that he had passed? I could fake it for my mom if she decided to want me there but so far I am leaning to not going at all I wouldn't want to upset other family members with my fake sympathy\n\nI think that i will the the A**hole if i go and offer fake sympathy. So as the old adage says if I cant say anything nice I wont say anything at all\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA\n\nI'm sure you wouldn't be the only one that doesn't want to go to the funeral (especially with what you explained), but you have to make the decision to swallow your anger just this once or be blunt with your family.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA - If you were not close to him then you have no obligation to go. The only reason I would say go is if your Mother could do with the emotional support from you.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH, you weren’t close to him so you already had no obligation to go, even if you were close to him then you didn’t have to. Adding on the fact with what he tried to do with your grandmother’s house just gives you more reason not to have to go because why act like you will miss a person when you wont because you didn’t know them?",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA - I might have even said you were TA if you went and you were secretly happy he was dead. Funerals are a way to celebrate people  who have passed lives, and if you don't want to partake in that, it's completely okay.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 0,
      "content": "Nta in my opinion",
      "id": 9,
      "comments": [],
      "relation": "No"
    }
  ]
}