{
  "post content": "My husband hid $1500 (some insurance payout) from me and he played the whole “I don’t have money for gas” victim part. This money is not part of our savings or anything. Anyway, he had been hiding the money for 2 weeks. During those two weeks I bought groceries for us, I paid for our take out food, I offered to pay for his broken windshield, and overall I was concerned about whether or not he had enough money for himself. He saw me struggle putting to put gas in my truck. He let me pay for his car insurance. He heard my concerns and my offers to help him and he did not once tell me not to worry.\n\nYesterday I asked him to lend me $20 because a friend invited me somewhere last minute and I didn’t have cash. He got really nervous when I asked him if I could borrow his debit card. He started to act strange. I asked him if he was hiding something from me and he called me crazy and accused me of not believing him. I asked him if he was hiding money from me? And he denied it and said I was paranoid and crazy.\n\nHe checked his bank account in front of me and acted surprised. He literally shouted, “wow wow wow I have extra money!!!! Oh my god this is so awesome!!” And he played the whole I didn’t know part.\n\nHe continued to argue and I told him that I don’t care about the money I care about honesty. Why did he lie? and if he can lie so blatantly about this then he can lie (or has lied) about many things.\n\nIt took a whole day for him to finally confess that he was hiding the money from me because supposedly I was going to ask for some money if I knew. He said he felt guilty for not telling about it when he saw me struggle with money.\n\nToday I asked him to leave the house. I called him cruel and deceitful. I told him that I don’t want to be with someone that can lie so blatantly.\n\nBy the way I’m 6 months pregnant with a very wanted and planned baby. We’ve know each other for 3 years.\n\nAm I the as*hole for leaving him over this? \nI’m just so hurt by how easily he lied and called me crazy and paranoid. And now I’m questioning everything in our relationship. Maybe his gym sessions are time that he spends with women. I don’t know anything anymore.\n\n***UPDATE****\nI followed the advice I received here (thank you). He’s back home but staying in the guest room. He came back with a brand new baby car seat (guilt?) and he’s apologizing profusely. We’ll be taking marriage counseling.",
  "id": 1,
  "comments": [
    {
      "score": 15750,
      "content": "NTA. For someone to watch you struggle, ‘feel bad’ but continue with the lie, says a lot about your husband. He is deceitful. He is going to do this again. Probably with money, and who knows what else. I hope you have a strong support system!",
      "id": 2,
      "comments": [
        {
          "score": 4377,
          "content": "Yeah, he didn't \"feel bad\", he just didn't care at all. He would rather keep money for himself and see his wife and the mother of his child struggle. This likely isn't the first time he's done it, and he will absolutely do this again. Or at the very least continue to choose himself before his child and wife.\n\nNTA OP, you deserve so SO much better, please for you and your child's sake, run.",
          "id": 3,
          "comments": [
            {
              "score": 1775,
              "content": "Yes, and next thing you know he will be on some sub complaining about how all women are gold diggers and refuse to pay child support. And then she will be a b\\*tch who won't let him see the kid. Run as fast as you can OP.",
              "id": 4,
              "comments": [
                {
                  "score": 855,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 485,
                      "content": "Men with these ideas aren't as unique as they think they are.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 190,
                      "content": "Hey, mine too! Does he also complain on Facebook about how you won't let him see the kids, when he makes no effort to do so?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 170,
                      "content": "And my ~~axe~~ ex",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 127,
                      "content": "[deleted]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Oh you’ve been talking to my ex husband I see.🙄",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "You mean, r/MGTOW ??",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I see those all the time or the ones who say why should I get married? If she leaves me she can take half \"MY\" stuff bc courts are unfair to men. No it doesn't work that way. You each get 1/2 of the marital property because you accrued it together. Premarital property usually isn't considered .  Supposedly you're working together and sharing resources. Like Op. She shared her income but he hid his. Legally half was hers anyway. Just like half her assets accrued during the marriage are his. These guys listen to too many selfish , bitter old men who couldn't make a relationship work in the first place. The \" my stuff\" statement is very telling.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 414,
              "content": "NTA. \n\nHe felt bad because he got caught. Not because hiding it was the obviously wrong thing to do.",
              "id": 13,
              "comments": [
                {
                  "score": 10,
                  "content": "EXACTLY!!",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "And ypu can tell this because he IMMEDIATLY turned it around to being her fault as to why he didnt say anything. I would be livid if someones excuse was because they \"thought i was going to ask for money if i knew\" as they have been sitting there asking for money from me over and over again.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "100% this! He \"felt bad\" that he was caught. Classic gaslight/ redirect and explode tactics used by someone who won't change their selfish behavior. She's gonna go so much further without that dead weight.",
              "id": 16,
              "comments": [
                {
                  "score": 6,
                  "content": "Amen! Classic gaslight and sign that he’s a malignant narcissist and/sociopath. I would have reacted the same NOW but years ago I was an unfortunate victim of a narcissist and didn’t know better. It’s some cold behavior on his part.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This. Gaslighting is emotional abuse and is fucked up.\n\nNTA. Let his sorry ass rot.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He didn't feel bad until he was caught which shows he only cared about getting found out",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yes, run - your husband doesn't see your marriage as a partnership.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He only 'feels bad' because he got caught",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 538,
          "content": "[deleted]",
          "id": 22,
          "comments": [
            {
              "score": 436,
              "content": "This is my question too, what was he hiding the money for? Does he really not trust her to responsibly spend if she was aware of the cushion, or was he planning on using it for something? \n\nLike, unless he was planning on suprising her by getting baby/pregnancy stuff, something large amd needed for their household, paying off a few months of rent/mortgage, then there was zero reason not to tell her unless he was being deceitful and wanting to keep the money for something selfish, or he doesn't trust her with the money (which could either be paranoia, a control issue, or misplaced feelings due to past experiences, OR he could have a reason to be legitmately concerned about her spending habits for some reason we haven't been told.) \n\nStill agree that OP is NTA, his reaction to her finding out about the money was shady af, and if he had plans to use it on their family or upcoming expenses I'm sure he would have revealed that before he was kicked out. \n\nI just really want to know what his plans were for the money, how long did he expect her to not find out? If it was merely a savings for future potential expenses then there was no need to be so sneaky about \"finding\" it",
              "id": 23,
              "comments": [
                {
                  "score": 323,
                  "content": "He had no good intentions for this money.  His reaction to it,  and doubling down by trying to act surprised and treating OP like she's a moron is extremely telling.  No apologies,  just trying to pull off an extremely transparent and lame excuse.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Exactly. \n\nWhen me and my BF (now DH) got together his gun case had a padlocked almost false bottom thing to it. \n\nI asked about it when I was dusting it one week. He flat out told me \"all my paperwork, important papers and a large stash of cash is in there\". I said okay and moved on. \n\nNow the gun case is empty and in FL, but he was up front and honest with me being nosey about a padlocked drawer, and I was just like \"what tf is so important that its behind a padlock\"?",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This. He did not behave in a manner consistent with someone who *doesn't* have somewhere to go. He didn't strike me as apologetic. I'd wonder if he *was* saving up money to bail.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "At least it's 3 years into the marriage and not 20 . That attitude must have been seeping through the cracks long before",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 244,
                  "content": "Right? He could have even said, 'by the way, I got this money. I really want to keep it for savings. I think we will need it with the baby coming. Let's put it away and not use it.'  But nope. Had to be a dick",
                  "id": 28,
                  "comments": [
                    {
                      "score": 86,
                      "content": "If something like this happened to my husband, he would tell me immediately and we would sock away $1200 and have fun with the rest. Maybe go to a nicer restaurant than usual as a treat and get something small off our wishlists for fun.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yea, or even if he wanted to use some of it for fun money then he could have talked to OP.  My husband got a nice bonus in a few months ago.  He paid our six month ins premium, and then kept the rest in his bank account.  It doesn't have to be difficult, sheesh.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "OP says he's terrible with money and \"doesn't believe in\" any of the budgeting tools she's using.  He works full time and is constantly broke.\n\nHe wasn't protecting it from being spent.  He was avoiding repairing his car and avoiding using it for savings.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I am sorry. But the fact that he called her crazy indicates that there is NO good reason for any of this.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I don’t think it matters why he’s hiding the money. I think the focus needs to be on that he is just doing it. There’s no excuse for this, and if someone goes into the Y they put themselves at risk of being manipulated. Get all of your financial records to make copies put them in a safe place because he will need them. If he’s already doing this now, I can guarantee that will be happy once you have your child. It’s obvious he feels entitled to his own money, and he doesn’t feel that his family nor child money",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Perhaps he needed it to cheat. My ex was drowning in debt so I took the debt on me for some months to lift the weight off his shoulders. (It seemed as if life got sucked out of him every time the deadline was near) \n\nAnd I guess I did help because apparently now he had enough money to cheat on me with another woman and take her and her child to places and shit.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">  planning on using it for something\n\nYes, his weird fake reaction seals it. He had nefarious plans and panicked when caught, then spat out the first shitty \"excuse\" that his undersized brain offered.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My ex husband, over ten year's time, racked up and hid 21k debt. When he got money that was unexpected, he hid it to put towards that. He skimmed money from his paychecks and put it into a different account to help pay on it. But he always added more than he paid. Meanwhile, I was going to food banks because his checks weren't what they should've been. He was just trained by his mother to be a pathological liar. That's the short answer. He hid everything, snuck around and lived in his own made up reality that was very different from the truth. So it's possible this guy just has his own highly different narrative for whatever reason.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Sometimes there is no real reason. Some people are just secretive. I had an ex like that. It's a very bad character trait that isn't likely to change.",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Compulsive liars often don’t have a point. It starts out small but then they get so wrapped up in their lie they have to lie harder to cover the original lie.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My first thought was he's hiding it to buy dope. It's always either dope, other women, alcohol, or saving up to run off. The guys not only a loser, but a stupid one at that. He could have pulled that money out as cash and kept it hidden.",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 537,
          "content": "Girl get out of there while you can. If he sees you struggling to afford things like gas and food while you’re PREGNANT then he may not have a conscience.",
          "id": 40,
          "comments": [
            {
              "score": 237,
              "content": "Some men really seem to flip a switch when their partner is pregnant. I believe this is why pregnant women are so much more likely to be harmed by a partner.",
              "id": 41,
              "comments": [
                {
                  "score": 141,
                  "content": "There’s all kinds of research showing that abuse tends to begin or escalate when women get pregnant :c I gotta believe that at least on some level these guys are aware that it will be *way* harder for their partner to leave once she gets knocked up and feel like it’s safe to show their true colors.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Things got their absolute worst with my ex-fiance during both my pregnancies. Not calling him abusive at all or that he ever did abuse me, he was just really lazy and mean sometimes. But I swear out of our whole relationship, the most hurtful and painful and cruel things he said were during the two times I was pregnant. I am still pregnant with our second, and we are no longer together now, which is really hard. But it's weird to think about how awful things were both times I was pregnant. I am sure it could be blamed in part on my hormones and both our stress.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Separation violence is huge too and it’s documented. Usually when women leave his relationships actually have had kids the incidence of violence  higher. So plan for that too with an escape plan. It may not happen ,  any as a resource is always good to be prepared",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "[deleted]",
                  "id": 45,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Can confirm as well. Abuse escalated once I got pregnant and grew along with my belly.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "holy shit i totally missed the part where she said she's pregnant. wtf is wrong with him? it was already bad but that makes him an even bigger asshole",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Unless he was saving this money as a surprise for OP, he’s proven he’s untrustworthy.",
          "id": 48,
          "comments": [
            {
              "score": 303,
              "content": "The fact he was telling her she's crazy, etc., shows me he was being deceitful.",
              "id": 49,
              "comments": [
                {
                  "score": 192,
                  "content": "That's the literal definition of gaslighting",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Pretty text-book, transparent emotional abuse. NTA. Run away from this man.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 201,
              "content": "If that was the case he would have said that instead of acting surprised the bank balance was higher than expected.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "It wouldn't kill someone who was planning to surprise you with $1500 but who knew you were struggling in the meantime to help you out and then surprise you with $1400.\n\nSo OP NTA.",
              "id": 53,
              "comments": [
                {
                  "score": 14,
                  "content": "That’s the part that got me. He couldn’t “splurge” on groceries for the house? Or fuel up his own darn car?",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "What was he even planning on doing with that $1300? Being pregnant and having bills...  1200 dollars goes a long way",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "this is exactly why surprises between partners, when you’re riding the poverty line together, are fucking stupid. it seems so much healthier to share information/money with one another than to rat-hole money for a dumb birthday surprise. at best, it’s a white lie you’re telling your closest confidant - feels like the opposite of romance/respect to me",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He definitely would have said something otherwise what is the purpose of getting kicked out of the house and still not say something? To make her feel super guilty about it later?",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "NTA. The only thing he felt bad about is getting caught.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Agree not ok. In my marriage I squirrel money as my hubby says. When there is money left over after all the bills and when we get paid again I take it. Husband knows this. I don't spend it, it goes into a separate account that he doesn't see. I mean he could if he logged into my account but we set up this way because he's horrible at saving. I squirrel the money away. He forgets about and then BOOM all of a sudden he's like how are we going away for a week on vacation without even saving money. And I'm just like I gotcha boo. But not having that prior agreement is total asshole behavior.",
          "id": 59,
          "comments": [
            {
              "score": 3,
              "content": "And you're only squirreling \"extra\" money.  You aren't hiding so much that he has to skip lunch to be able to put gas in both of your cars.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The MOST unforgivable part for me would be him calling me crazy and paranoid. That’s it. The lying is bad enough, but at that point it’s absolutely over for me.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Definitely NTA i put up with a miserable husband for nearly 20 years he was money daft, when we would go out for dinner he would say he wasn’t hungry but when the food came he would eat of me and my daughters plate, he would go to the toilet when it was his round at the bar in company, I should have left him a lot earlier than I did,  don’t put up with his  lies let him know you ain’t going to stand for that nonsense x",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah, bad men don’t usually become better people after a baby is born - they become worse. If he’s already doing this kind of shit, he isn’t magically going to becomes less selfish when there is a baby in the mix - he’s going to become more so.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree. Also, want to point out that one red flag was that how he dismissed her claims entirely by calling her \"crazy\". It is such a low blow. He didn't provide any justification in the beginning, just said that she was crazy.\n\nI hate how people dismiss others by calling them \"crazy\" and \"paranoid\", like it's so obviously gaslighting",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7025,
      "content": "NTA, Jesus he got this money and still went for you for gas money.  And you’re pregnant?!?! That’s a significant breach of trust.  I can’t even wrap my head around it. Kicking him out of the house is the first step.",
      "id": 65,
      "comments": [
        {
          "score": 2055,
          "content": "I'm so lost here. Why are they still separate on everything? Why does she say \"*I* paid for this and *I* paid for that? It seems like keeping things separate like that can only lead to resentment and dishonesty. What do they both have to hide from each other that they won't have a joint bank account?\n\nAnd sure, maybe people just prefer that, but why? Are they expecting the marriage to fail?",
          "id": 66,
          "comments": [
            {
              "score": 1860,
              "content": "I understand separate finances to an extent, but if you're having a fucking baby, can barely afford gas, and things like groceries aren't coming from mutual accounts you're just asking for undue stress IMO. Do you really want to keep track of splitting every expense for a damn baby or have to \"lend\" money to your spouse for diapers?",
              "id": 67,
              "comments": [
                {
                  "score": 793,
                  "content": "If they can barely afford gas... should they really be having a baby?\n\nOP might want to consider kicking the fetus out of the house too.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 1427,
                      "content": ">If they can barely afford gas... should they really be having a baby?\n\nNo, but we aren't supposed to say things like that.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 468,
                      "content": "At 6 months pregnant it's a little late to play the blame game.",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 53,
                      "content": "Hardly the baby's fault the father is a selfish liar now it it. FFS",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "So much this. I can't stand the idea of people having kids when they can barely pay for themselves. You're just planning to be on government assistance at that point. So much bad in this post I swear.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I'd just like to point out that it seems that OP could've easily afforded gas had she not had to foot the bill for her husband's expenses.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "There seems to be a lot more going on in this relationship than just the issue presented.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 299,
                  "content": "I know this couple who have been together for 7+ years, and they split everything, down to the penny. Like, if he buys her a coffee, she'll refund him the exact amount. It's f@cking bizarre.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 253,
                      "content": "[deleted]",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 89,
                      "content": "As bizarre as that is, if it works for them then great. But ya it just seems like unnecessary added stress, for me anyway.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I’ve been with my partner for 5 years and we put every expense on Splitwise. We tend to take turns paying for stuff and while it might feel even (e.g. he gets coffee, I get dinner, he gets groceries) it’s surprisingly easy for those little imbalances to rack up to hundreds of pounds. This way we can relax about it being fair. And I like that it makes it extra special for one of us to gift the other a drink or a meal, because it’s not the default.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 66,
                  "content": "Seriously I can't wrap my mind around this. How exhausting! Just thinking about telling my wife she \"owes me $100 for the groceries\" she bought, or like, keeping separate shelves in the pantry \"this is *my food* and that is *your food*\" cracks me up.\n\nI kept re reading to make sure it wasn't an ex-husband who was still living together or something. I guess maybe a soon to be ex-husband? Anyway, they should just get counseling and try to not be so separate in their lives. Integrate, open themselves, commit and start trusting each other again. That baby deserves they start growing the fuck up and acting like adults.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Makes me just feel tirred thinking about having to do that for everything.\n\nAll money into joint account, we have debit and credit cards on auto pay to that account.  I make 3 times as much as my wife. So what.  We are grown ass adults and I know I  wouldnt  be where I am today, making the money I am if it wasnt for her holding it all down and sticking by me when I was all fucked up.\n\nSo if I want something small, I buy it. Same for her.  We hardly talk about money.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My parents have been doing that for 50 years.  Her money and his money and they argue about who's buying the Tim Horton's or paying for the smokes.   Taking them to Costco is a nightmare.  One puts something in the cart, the other says, \"I'm not paying for that, I hope you're paying for that, because I'm not\"  etc.   \n\nThey're a nightmare, and part of the reason I am 4000 miles away.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I’m not married, but I’ve always thought I’d want it where we’d each have a personal account (for our personal shopping sprees/purchases, gas, frivolously eating out), **and** then a shared account we would both put a certain (fair) amount of money into it to pay mutual bills, vacations, groceries, things for kids, ect. Feel like its a good compromise.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 353,
              "content": "My husband and I had pre-marital counseling and the man told us that most couples who have separate bank accounts end up divorced. Money and sex are the biggest reasons.\n\nEDIT: I should’ve clarified. The counselor wasn’t making a blanket statement, he was just saying that there a plenty of unhealthy reasons to keep separate accounts (hiding your spending, withholding funds from your spouse in case they get too “independent”, etc) so if you do decide to go that route evaluate your reasons and make sure they’re the right ones.",
              "id": 83,
              "comments": [
                {
                  "score": 397,
                  "content": "My wife and I have our own bank accounts that we keep fun money in, but we do have a joint account for the Lion's Share of our finances. We deposit 75% into our joint account, and 25% into our fun accounts and buy each other stuff out of that one. Rent, and major bills like the power, internet, gas and cellphones are from the joint account. Flowers, dinner out, video games and whatnot are from our own accounts. It can be done, it just requires transparency and trust.\n\n\nEDIT - Replied to the wrong comment haha",
                  "id": 84,
                  "comments": [
                    {
                      "score": 112,
                      "content": "Ya that's of course a much better situation then the one OP described.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 71,
                      "content": "This is fine and what many financial counselors advise to do. \n\nFor my marriage, having ONLY a joint account without these separate individual accounts is what caused the stress and ultimately the divorce. \n\nWon't make that mistake again.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "Wife and I have separate fun money accounts. I throw 20-30 bucks every pay check into my checking account for fun money but I still consult her before any big purchases, even if it comes out of that account. All bills, groceries, gas, day to day spending, etc comes out of a joint account. Even with our fun money accounts we don't have mine or her money. It's all our money.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "That’s what my wife and I do as well. Everything is automatically deposited into our joint account to be gin with, and then every week we each get an “allowance” that goes to our separate bank accounts (a set dollar amount as an automatic recurring transfer). We use our allowance for personal non-necessities like video games, more expensive than normal makeup, nights out with friends, etc. Everything “for the house” and that we would enjoy together, as well as personal necessities, comes out of the house budget.\n\nIt’s a really great system. I don’t think we’ve fought about money once in the 8 years we have been married, despite having some very stressful financial time, because no one is spending house money frivolously.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My husband and I have separate accounts and a shared account with a mutual savings. I manage and pay our mortgage, utilities, etc from my account. He transfers a proportionate amount to me toward those expenses since I make substantially more. Our accounts are set up so we can see each others balances at any time. This is about transparency and basing expenses on wages and if there is an extra boost of income modifying based on that. OP's spouse definitely failed all the way around on that. What I'm curious about is why he was concerned she would ask for some of it. Why wouldn't they discuss how the money should be spent? Not doing that while taking money from her was a major fail. Red flags all around.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 114,
                  "content": "I’m giving serious side eye to the source. Maybe because I was raised as a strict Southern Baptist and the men (pastors/deacons/congregants) in the church had a vested interest in preventing women from having financial independence. As a former divorce attorney, I absolutely agree that money and sex are important in a union, but “separate bank account = divorce” is BS.\n\nIn OP’s case, there is something more significant than gas money going on.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I get what you’re saying. I think he meant to examine the reasons behind having a separate account. Is it to hide your spending? To keep your spouse from being too “independent?” I don’t believe he was trying to make a blanket statement. I should’ve clarified, I’m sorry.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": ">“separate bank account = divorce” is BS.\n\nOne the other hand, how much harder is it to divorce a shitbag when they have control of all the money and finances?",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "i think its more normal to have a joint bank account where u keep most of the money thats for rent and bills and stuff, but then separate accounts where you keep lower money for your own spending  \n\n\nI base this only on my parents marriage though. It is a very successful one at least.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "Maybe the reason for the separate accounts is the issue; not the separate accounts themselves.\n\nMy first marriage we had only joint accounts and he sucked us dry. We fought about money a LOT. (But not as much as sex, lol)\n\nMy second (and current) marriage we have separate accounts and there is no fighting about money *ever* because we know we can spend our own money as long as we're holding up our contribution to the household bills.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 8,
                      "content": ">My first marriage we had only joint accounts and he sucked us dry. We fought about money a LOT. (But not as much as sex, lol)\n\nSame here. My wife lied about our finances and got a secret credit card and ran up $13k in debt. I didn't find out about that last bit until the divorce. (We didn't really argue about money much, but I trusted her to run the family finances and she kept me in the dark and got defensive when I would ask about expenses. I earned 70% of our joint income.)\n\n>My second (and current) marriage we have separate accounts and there is no fighting about money ever because we know we can spend our own money as long as we're holding up our contribution to the household bills.\n\nThat's how I'm gonna run the next one, if there ends up being a next one.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Thank you. I'm so glad I'm not the only one. My husband and I have separate bank accounts and we have a daughter. We split the bills pretty evenly as well as groceries and things we get for the kiddo. If there is something extra one of us wants we pay for it. We never get on the other's case as far as what we spend extra money on. We each have a savings account too that we contribute to. If there is something really big that we want we will pull together. When it comes to going out to eat we take turns and usually if there is a \"fight\" it's because we both want to pay not that neither of us wants to and it's kept very lighthearted. We've been married less than a year but we have been together for almost 5 and it honestly works so well for us. We are very transparent about who has how much and open to helping one another with any deficiencies but this is what feels right for us and I don't think it's unhealthy at all. We never argue about money.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Were we married to the same asshole? XD. My ex husband took my pay out of our joint account and put it in his own \"savings\" account for bills because i \"spent all our money\" I had to ask permission for money, we would never have food because he hated grocery shopping. (I dont drive so it was difficult for me to buy a full load. He had the car) when i finally left him for my current husband, I found out he hadn't paid the phone bill in like 4 months and it was basically $1500 dollars. I was stuck with it because it was in my name and i had attached him to my phone plan when we first got together. \n\nNever having a joint account ever again. Thankfully my husband understands and respects my reasons.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "And OPs seems like it was doomed from the start.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 49,
                  "content": "[deleted]",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "ah I dunno, me and my husband keep separate accounts. But we don't have kids together and we both work decent jobs. My husband is better with money so I give him a portion of the mortgage and utilities and he pays the bills. Some day we might combine accounts but I kind of want to keep a fun money account for myself.",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "There is absolutely nothing wrong with having financial independence. My husband and I have our own bank accounts and we're 17 years strong with a solid relationship. I'd be more resentful if I had to clear it with him whenever I wanted to make a big purchase from a joint account.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My aunt married her first husband, joined their bank accounts, and when she divorced him for being an alcoholic gambler, realized he gambled and drank all her money, too, not just his. \n\nIn her 2nd marriage she told my uncle straight up she would never join their accounts, ever. My uncle was perfectly fine with this, he’s a great guy.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My husband and I have separate accounts (just because it’s easier to keep track of the money that way) and have been together 23 yrs lol. But we each have access to the others account and it’s still “our” money. You can do it anyway you please.....but I agree with the counselor that it’s important to have the concept of money being “ours” not “mine” in a marriage.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I would urge OP to examine why they have separate accounts. Is it because he can't be trusted not to spend all of their money if it is together? For some reason, I suspect it is. If it is, then that's a big enough reason to split. If he is hiding money, that's just the icing on the cake.",
                  "id": 104,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "Me and my husband have separate finances as he was in significant debt when we first met and although I have helped him with that I didn’t want to be fully responsible for helping pay off money he owed before we got together. Since then we don’t do the “I\nPaid you paid” thing we just pay for stuff but we haven’t put our accounts together because I prefer my financial independence. We have an account we both pay into for bills and the children but we will always have separate accounts we get paid into. I don’t think that’s that unusual",
              "id": 105,
              "comments": [
                {
                  "score": 47,
                  "content": "And that makes plenty of sense. It doesn't sound like OP and her husband have that joint account for expenses though. But I could be wrong.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": ">Me and my husband have separate finances as he was in significant debt when we first met\n\nMy husband and I do the same but it was because of my student loans and an additional loan. I don't want him to feel responsible for my past financial mistakes. We have joint finances and have talked about what we each pay.  I don't think it is the separate finances but communication about finances.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "As a former married person (23 years), keeping separate finances is actually a smart thing to do.\n\nFinancial problems are one of the top reasons for divorce in the US, and divorce is one of the top reasons people file bankruptcy.\n\nIt actually makes good sense to keep finances separate, even in a marriage, because it eliminates the arguing over money.\n\nI've advised both of my sons, when they marry, to keep their finances separate from their spouses, with a joint acct for both to deposit monthly money into, for the sole purpose of paying the household bills (based on percentages, as in, he earns 55% of the money in the household, thus pays 55% of the household bills. She earns 45%, thus pays 45% of the household bills)\n\nDoing it this way means the wife doesn't hav eto explain every single personal purchase she makes, same deal with the husband. There's a level of autonomy that comes with separate finances.\n\nOf course, should the wife stop working to stay home with the kids, then this needs to be revisted, but so long as they are both earners, it works really well and a lot of marriage counselors will recommend this for couples who fight a lot about money.\n\nAlso, one thing a lot of women don't consider is... You're likely to outlive your man. If you don't have established finances separate from him, you'll find you're starting over, credit-wise.  And with more people opting to stay single longer/later in life, it makes good sense.\n\n[https://www.theatlantic.com/family/archive/2018/04/young-couples-separate-bank-accounts/558473/](https://www.theatlantic.com/family/archive/2018/04/young-couples-separate-bank-accounts/558473/)\n\n[http://www.slate.com/articles/life/home\\_economics/2011/02/yours\\_mine.html](http://www.slate.com/articles/life/home_economics/2011/02/yours_mine.html)",
              "id": 108,
              "comments": [
                {
                  "score": 7,
                  "content": "I have shared finances now, but we were 6 years into our relationship before we merged, maybe 5 years, and it was driven by an outside circumstance rather than a relationship milestone.  But when my finances have been separate, we've always done it the way you describe here (on a percentage of take-home basis).  It's important to also have proportional retirement savings so it doesn't favor one partner over the other, and that should net out before you look at take-home pay.\n\nBut I'm with the majority of posters that say NTA.  I don't lie to my partner, ever.  That's part of how the relationship works.  He has all the passwords to any account or login he should want to look at (we use a password manager with individual and shared vaults) and I hide nothing from him.  I don't think he's ever logged into any of my accounts to check up on me, but the fact that he has those credentials, in part means, he doesn't have to.  And vice versa.  I have his phone unlock codes, but I don't ever use them, I've never felt the need.\n\nOur rule is, < $X00 is a purchase that, not only do you not have to explain, but that the other person doesn't get to ask about.  More than that, and you need to have a conversation.\n\nAdditionally, for any windfall that we should be fortunate enough to receive, we mark 10% for frivolous fun things and save the rest.\n\nIt works.  But the foundation is trust and honesty.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You guys really have a it going on, in a really good way.\n\nKudos to you two for figuring this one out!",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "A lot of couples have a joint account for household expenses, and separate accounts so they can spend money on hobbies etc without needing to remove money from the joint account.",
              "id": 111,
              "comments": [
                {
                  "score": 17,
                  "content": "That makes sense. Doesn't sound like it was the case in OPs situation.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I'm wondering the same thing. I know some couples keep split finances but this lack of transparency will tear a marriage apart.",
              "id": 113,
              "comments": [
                {
                  "score": 3,
                  "content": "Yup - no one should be in a marriage, about to have a kid, sweating gas money, and not know what money - if any - the other partner has.   My roommate and I are more transparent than this.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Keeping separate bank accounts isn't a hint that the marriage will fail. It's not particularly dishonest or ground for any resentment.\n\n> What do they both have to hide from each other that they won't have a joint bank account? \n\nSame can be used for internet surveillance, mass cameras in the street or any other breach into your liberty. In this case, still having your bank account makes you still independent. You still exist by yourself and not only \"Couple XX\", \"Wife of MrYY\" or \"Husband of Ms ZZ\", so it's not really about trust and hiding stuff.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I’m assuming she says she paid for them because this is exactly the problem she’s talking about - she paid for everything herself and her husband did not contribute.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I used to have a joint bank account with my ex and we each had our own accounts. Our reasoning was that the \"extra\" after bills was basically spending vs joint finances. So our joint account would have included what we estimated for groceries and gas as a household, but something like a windshield would either be out own spending money or something we would have discussed had it ever been an issue. For example, I had an ultrasound and didnt know it would cost $1k so he offered to pay for half. But for day-to-day things we just didnt want to judge each others frivolous spending. He wants to build a new computer? That expensive purchase is still \"his money\" not \"ours.\" \n\nMy current bf asked if he should buy a car he doesnt need to have something to tinker on when he is bored. If we had joint finances and somewhat equal pay, my response would be negative to spending a few thousand dollars on himself because then do *I* get to do the same for me? Instead i'm like, yeah it's your money. If it will make you happy and doesnt impact your financial state, have fun. No impact on me because I know what I can spend of my own money for things I want.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I get what you're saying, but it's different for every couple. My husband and I have had our finances together since we moved in together because we're lazy and it was just easier. Also we both made around the same salary and still do. But we have friends with better marriages then ours who like having separate accounts for one reason or another. I don't think keeping money in different accounts is expecting the marriage to fail.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3789,
      "content": "NTA\n\nYou two need couple's counseling ASAP.",
      "id": 119,
      "comments": [
        {
          "score": 2530,
          "content": "That probably requires money...",
          "id": 120,
          "comments": [
            {
              "score": 1840,
              "content": "So does having children, but they thought that was a good idea. Remember, she said that the baby was “very planned”.",
              "id": 121,
              "comments": [
                {
                  "score": 725,
                  "content": "I'm hoping against hope that she can't put gas in her truck because they have some cash stored away for the child that they won't touch ...",
                  "id": 122,
                  "comments": [
                    {
                      "score": 406,
                      "content": "Does not sound likely at all",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 212,
                      "content": "She also paid for everything herself those two weeks, including a windshield (like $800 typically right?) when it sounds like he would have contributed to those bills normally... they might have enough with his income added but it doesn’t sound like he made anything during that time.  We don’t have enough details about their financial situation to speculate that they have been irresponsible about their timing on having a baby- and for that matter, there is never a good time, because there’s always a moving financial target for when you’re “ready” to have a baby.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah 1,500",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Regardless what the money situation is, I hope they nurture and touch the child. Appropriately, of course. The child will need lots of love and skin to skin contact",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 295,
                  "content": "The baby is \"very planned\" but they can barely afford to put gas in the tank. Great planning, guys.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 179,
                      "content": "They *can* afford take-out, though",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 77,
                      "content": "This makes me think it's fake. They can't afford gas money for a truck, but they can afford a child.\n\nEdit: To go further, the money in question is from an insurance payout. This means that he works a job, but can't because whatever reason. The way this post has been written is to imply that he is a deadbeat with no job. We know nothing about both their employment status or how the household is doing. Just that she works and pays for everything.\n\nShe is unable to afford gas money for a truck and needs his atm to withdraw $20 to go see a friend. Yet, despite this she is able to pay groceries (groceries ain't cheap, but you have to pay for them), pay for take out food (which isn't a necessity), offered to pay to fix a windshield (which she doesn't have to and also isn't cheap), and payed for his car insurance (which again she doesn't have).\n\nAlao what does \"gym sessions\" have to do with any of this? It's randomly put into the last sentence, yet nothing about it is mentioned before. Is he sneaking off to the gym to avoid her knowing that he can't work? Is he using the insurance money to pay for a gym membership? It's so random.\n\nThere appears to be more to this story then she is letting on which makes this whole thing suspicious.",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Good point.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Well good thing there's an extra 1500 in the bank!\n\nSeriously, though, counseling may be covered by insurance.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don't know where they work, but many employers offer up to 6 sessions of counselling a year for free, whether for mental health or relationships. It's usually called an EAP, Employee Assistance Plan.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 351,
          "content": "Unfortunately I think this is beyond the scope of counseling. For OP's husband to watch her struggle to afford gas for her car, and to side-eye her for asking for $20 to go out with a friend after OP paid for everything including groceries and his broken windshield, there is something fundamentally wrong with him that OP may not want to put in effort to try and fix. That's on him.\n\nNTA OP. If you want to try and salvage the relationship, do so. But I don't think anyone would fault you for wanting to take care of yourself and your baby's needs first by leaving your husband out of the picture. Make sure you're looking out for yourself because it's obvious your husband isn't going to.",
          "id": 133,
          "comments": [
            {
              "score": 106,
              "content": "But talk to an attorney before you tell him.",
              "id": 134,
              "comments": [
                {
                  "score": 56,
                  "content": "They have no money, so I presume there are no assets to split. I would recommend she explore legal aid/family law clinics in her area. A private attorney will be expensive (there was a personal finance post just yesterday from a single mom who didn't have enough food to eat because she was still paying off her divorce attorney).\n\nEdit: it's been pointed out below that your husband could be hiding other assets because he's a tool. Please bring this up with whatever attorney you engage (I still recommend trying family law clinics first to see if you qualify).\n\nSecond edit: It sounds like OP has assets and would have plenty of money if she wasn't dealing with an irresponsible husband. OP, please find an attorney right away. \n\nFor other people reading this who do *not* have money and who need an attorney, please check out legal aid clinics to see if you qualify!",
                  "id": 135,
                  "comments": [
                    {
                      "score": 24,
                      "content": "No assets that she's aware of at least.",
                      "id": 136,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "She mentioned elsewhere the asking for money was to get it out of savings. So there’s something somewhere.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Omg have you read her post and replies?  They DO have money, he’s just horrible with finances so she was literally paying for everything for both of them.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "I agree. He was actively and deliberately gaslighting her (oh wow wow wow I have money I didn’t know about!). That’s abuse. Couples’ counseling isn’t recommended when there is abuse.\n\nI’d be willing to bet that there is emotional abuse and other kinds of coercive control she isn’t telling us about. This kind of behavior is almost never a one time mistake.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It's clearly not a healthy relationship. The fact that they aren't open and sharing with finances in the first place, in my opinion, is a red flag. It just says to me that they didn't expect the marriage to last.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "[deleted]",
          "id": 141,
          "comments": [
            {
              "score": 68,
              "content": "> The best decision I ever made was to show my now wife my financial underwear and work together as a team to make it work.\n\nI truly hope my future husband, whoever he is, shows me his financial underwear. I feel like I need that in my life.",
              "id": 142,
              "comments": [
                {
                  "score": 3,
                  "content": "This is one of my biggest issues with relationships. Trust is trust. If I can't trust you about money, I can't trust you about anything else. Like some people think it's ok to lie about financials then they should be trusted about fidelity. I could never marry someone who wanted to lie about their finances in the first place.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 3,
                      "content": "People say couples argue about money.  I think what they mean is people argue about dishonesty and money but blame it on “money” in general.\n\nWife and I know exactly how much we make/save/spend but also don’t tell each other every little purchase we make because we don’t need to, we’re not irresponsible enough to make large purchases that would affect each other, or our money situation, with discussing it first.\n\nIt doesn’t take a super mature person to manage their finances,  in fact having someone around for discipline can be super helpful,  because the rest of my life is a fucking mess.",
                      "id": 144,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah, this sounds like they are very young.",
              "id": 145,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "While not my favorite /r/onesideofthestory to date, this definitely has some serious vibes of that going on.",
              "id": 146,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Yeah I don't understand how married couples can act like that financially. My wife and I share everything without a second thought.",
              "id": 147,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "And Financial Advisement.",
          "id": 148,
          "comments": [
            {
              "score": 51,
              "content": "[deleted]",
              "id": 149,
              "comments": [
                {
                  "score": 19,
                  "content": "Or for a divorce.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Hmm...Money is one of the things that makes divorce harder. When you're not upper class rich, what you have coming in and what you make is kinda what you're gonna take out.  \n\nMaybe someone has to pay child support though.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I would also suggest posting this on r/personalfinance. Likely they will have numerous ways that you can manage your money better as a couple so that you both have some spending money and get your bills paid.\n\nHaving a baby by yourself and having it grow up with divorced parents is not something to take lightly. I would recommend you discuss the problems and try to make a plan you can both live with. Maybe it works and maybe it doesn’t but at least you have tried.",
          "id": 152,
          "comments": [
            {
              "score": 8,
              "content": "I agree about posting in personal finance because they may be able to help with advice. I don't agree about giving him another chance to lie to her. The fact that he doubled down on the lie when discovered is a huge red flag",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "That would be a waste of money.  If the guy has no problem seeing his working pregnant spouse struggle to survive while asking for help himself and hides money from her, he is a piece of trash.  No amount of counseling will ever fix this lack of trust because there was no reason for him to do this in the first place.  He had no conscience for his partner or baby.",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1373,
      "content": "NTA I would leave his ass and start the child custody proceedings now. If he is willing to hide money from his pregnant wife what will happen when your child actually needs something like a surgery or some other medical need.",
      "id": 155,
      "comments": [
        {
          "score": 741,
          "content": "Even when someone is six months pregnant, reddit will always advise breaking off the relationship.",
          "id": 156,
          "comments": [
            {
              "score": 530,
              "content": "That’s about par to the course.  \n\n“My husband of 22 years mentioned that he has a new coworker.  She’s female.  What do I do?”\n\n“Dump him, get a lawyer, take all the money out of the shared account.”",
              "id": 157,
              "comments": [
                {
                  "score": 242,
                  "content": "Taking out all the money out of a shared account will get you in trouble. Lawyer would advise not to do it. It’s almost like reddit isn’t the place for advice.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 26,
                      "content": "A lot of reddit is bitter single people who advise breaking up at the drop of a hat.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Shhhhh, stop spoiling my fun",
                      "id": 160,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Well at least /r/AmItheAsshole isn't the best place to ask.  If you ask in /r/legaladvice you'll get better answers.\n\nMind you, said answers usually amount to \"Talk to a Lawyer\", or \"You have no case\".  (The latter of which is the polite version of YTA.)",
                      "id": 161,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 178,
                  "content": "You're really equating that to this situation, where they have separate finances but he's hiding money and manipulating her into paying for things? He played victim and lied when they're already struggling. That's scummy af",
                  "id": 162,
                  "comments": [
                    {
                      "score": 71,
                      "content": "If the answer is ever close to “run away” you’ll have a group of dedicated mouth breathers saying that’s all reddit ever does and completely ignoring the situation and nuance",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "You used the word female instead of woman, that's a huge red flag. You're dumped and I'm taking our three children with me. \n\nIt's actually funnier on this sub because it is specifically not an advise sub, but people still can't help themselves always recommending break ups.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You really dodged a bullet there",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 152,
              "content": "Reddit IS very quick to recommend break ups, but sometimes it's better to cut your losses. In this case we have a husband who handles money so badly he has to constantly mooch off of his wife, then when he comes into some bonus money he lies so he can keep mooching off of her and then gaslights her about the lying.  \n\nThat kind of scummy doesn't magically get *better* once there's a baby to take care of. I would bet dollars to donuts he'll wind up being the kind of neglectful spouse I see mothers complain about *all* the time. He won't get up in the middle of the night to feed baby a bottle because he's \"tired,\" he'll complain that you asked him to change a diaper because he \"changed a diaper yesterday.\" It might be tempting for OP to stick around despite the red flags because the idea of taking care of a newborn by herself is daunting, but she might find that being a single mom to a newborn is easier than being a mom to a newborn and an adult baby who doesn't help at all.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Six months pregnant with a husband who somehow has $1500 his wife doesn't know about, who manipulates her into paying for all of his shit even when she's struggling with money, and then who attempts to gaslight her when she discovers he's full of shit. \n\nBut yeah, even on Reddit someone will mock the advice to leave even when it's clearly one of the better options on the table.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "He lied, hid money, and used her. Why would you ever tell anyone to keep a relationship that involved that ? That won't be healthy for the baby to grow up with either. Single parent is better than two that never get along.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Sadly it’s usually the voice of experience. Once you’ve seen massive red flags. They will appear again.\n\n“Even if she is 6 months pregnant”\n\nHonestly, maybe it’s time to move back with her parents and start sorting things out, than to wait and find herself a struggling new mom, with no support system and a lying husband. \n\nHiding money it’s definitely not the end of the world. But seeing your wife struggling, and then playing the “Oh look what I found” and then even say that he didn’t want his pregnant wife to ask for some of it (while he was taking her money without issue) \n\nThe action was shitty enough, but I think a very fixable issue. The aftermath and his reaction was a shitshow and very telling of his character. She needs to keep her eyes open and avoid putting herself in a bad position, until he shows he is trustworthy.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah that comment wreaks of ignorance, they don't realize how expensive and taxing the first few months will be. Why split that massive medical bill between both of them when she can saddle it herself, despite barely being able to cover tank of gas!",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "[removed]",
          "id": 171,
          "comments": [
            {
              "score": 34,
              "content": ">its not that cut and dry-- they have years of history and a child on the way.  Its real easy to talk big and say you would 'leave his ass' but its just not that simple in real life.\n\nI agree it's not cut and dry but as a person whose had a similar situation in past relationships blunt honesty of others was the only thing that got through my emotions and made me realize the key questions. If they did this now what are they capable of doing later?, Do I want to be in a relationship where I don't trust my partner?, Am I happy?\n\nIt sucks and yes every person needs to decide for themselves but having point blank thoughts can help the process. If OP decides she shouldn't have kicked him out and wants to make it work that's awesome and shows she is a big person but I will always be an advocate of happiness and not trusting a partner due to lies with a child on the way is for most people not the way to be happy.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "The fact that she kicked him out of their shared home tells us she already has one foot out the door. Couples counseling probably should have come before that if she had any interest in continuing the relationship.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The responses in this thread are literally horrifying to read. People effortlessly telling this woman to immediately break up a marriage and have her child come into the world with a fragmented family situation. People should stop coming to reddit about breakups; online strangers have no skin in the game when it comes to you or your child's well-being. This is fucked up. They need counseling and they need to work it out before breaking it off.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "You can’t start custody anything until the child is born.",
          "id": 175,
          "comments": [
            {
              "score": 13,
              "content": "Custody proceedings can start by having paperwork ready with a future date in mind as well legal establishment of paternal legal rights being recognized beforehand ie mother father guardian etc.\n\nEdit to clarify: I have done this for my sister when she was pregnant and the father of their child decided to hit her",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Jesus are you nuts? Shes 6 months pregnant - they should work to resolve this not just immediately cut it off. Life gets a lot harder than $1500 bucks. \n\nI actually cannot believe anyone would upvote you, holy shit reddit you're scary",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "She barely has enough money for gas and you're asking for her to be single while delivering the baby? Are you fucking idiotic? That's the worst thing she could do right now. He needs to make this right for his fuck up but the whole \"hIt ThE lAwYeR, dElEtE tHe GyM, fAcEbOoK uP\" meme is the worst decision here.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1350,
      "content": "NTA - But if you guys are going to be married, you need to act like it.  I know, to each their own, etc. etc. But this is exactly why I'm a strong advocate of households having household finances, and not continuing to live like roommates that have sex. You're perfectly within your rights to be pissed off about someone who's supposed to be your teammate deceiving you like this, no question.  But it was gonna happen eventually, given the circumstances.",
      "id": 179,
      "comments": [
        {
          "score": 513,
          "content": "[deleted]",
          "id": 180,
          "comments": [
            {
              "score": 457,
              "content": "Your method sounds like a marriage with separate finances....OPs scenario really just sounds like roommates who made a baby.",
              "id": 181,
              "comments": [
                {
                  "score": 12,
                  "content": "Especially since she said they've \"known each other\" for three years, not \"dated each other\". I'd be willing to bet they were FWB and eother A) she got knocked up, and/or B) they got married mainly for the social and financial benefits, not out of actual love and a desire to share the rest of their lives.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 7,
                      "content": "You’re really pulling here. Sometimes really getting to know someone for a while without dating is something amazing. You get to actually fall in love with a personality without the obligations that come with dating. And then being together can just make sense. So you’re just making multiple assumptions.",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "OP doesn't have a \"household\" account because they don't have any money to put in any accounts.  They have to borrow $20 from each other.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I don't get the planned for baby with this level of financial uncertainty. How will they pay for daycare? Diapers? Etc.",
                      "id": 185,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "This family doesn’t have enough for gas, car insurance, etc. I don’t see how they will have enough for three accounts",
              "id": 186,
              "comments": [
                {
                  "score": 90,
                  "content": "If you have 3 dollars, you have enough for 3 accounts. Bank accounts are just a way to partition funds. Sure, some savings accounts have a minimum balance, but plenty of checking accounts don’t.",
                  "id": 187,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "This is exactly what my husband and I do as well. We put more than our bills into our joint account each month to build a buffer in there, we normally try and keep the balance at around 2 months bills minimum. We have savings in a seperate account, then our own individual accounts which just has whatever is leftover as disposable. It works really well for us because neither of us feels the need to justify any adhoc spends or little impulse buys, if we want it and can afford it we buy it. If we have a date night we either use our joint account or pay between our own accounts one of us would pay for dinner, the other pays for the cinema. That being said, although we do have the separate accounts we see our finances as a collective and would never let the other feel like they're going without. What's mine is yours and all that!",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "This. I do not understand split finances when married. Both my spouse and I have our full paychecks sent to one joint account where all bills are paid and I make transfers to savings. We both have Amex prepaid cards where each of us have our blow/fun money transferred each week just to keep us from overspending. There is no yours or mine, everything is ours.",
          "id": 189,
          "comments": [
            {
              "score": 83,
              "content": "I get that it works for SOME people, and I'm not going to tell them they're wrong, but clearly it doesn't work for THESE people.",
              "id": 190,
              "comments": [
                {
                  "score": 7,
                  "content": "Well yeah, but THESE people don't even sound like they should be married.",
                  "id": 191,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "We have a joint account and joint credit cards.  We keep from overspending by talking to each other about anything we want to buy that's over a certain dollar amount.",
              "id": 192,
              "comments": [
                {
                  "score": 8,
                  "content": "[deleted]",
                  "id": 193,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It's this new thing we've been trying for the past 15 years or so.  Seems to be working ok so far.  Will report back in another 15.",
                      "id": 194,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm getting married soon and we haven't got around to setting up a joint bank account yet. But the idea of my money or her money is so bizarre you know it's out money we are in this together.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This. If either of us want to make a big purchase we talk about whether it’s a good idea and how important it is to us.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I was waiting for someone to post a response like yours.  All of our accounts are joined too.  Works well for us.  If one of us wants to purchase something big we talk it over first.  Been married 28 years.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Same. Doesn't matter who earns more or less, it all goes in a pot, the bills come out, we split the remainder. Even now my wife is the sole earner while I go back to school, she insisted we do it this way. I'm trying to take a little less because I feel guilty but she sees it as our money, just as I shared mine with her when I earned a little more.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "I will never understand married couples with separate finances.",
          "id": 199,
          "comments": [
            {
              "score": 86,
              "content": "It's not hard to have 2 separate accounts and a joint account where you put something like 80% of your paycheck. You don't cease to exist as an individual because you're married.",
              "id": 200,
              "comments": [
                {
                  "score": 22,
                  "content": ">You don't cease to exist as an individual because you're married.\n\nYou don’t cease as an individual because you have a joint bank account either.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "But having a shared finances doesn't mean you can't spend money as you see fit. Generally you marry someone with the same financial sense as yourself so that there isn't some outlandish spending going on beyond whats reasonable. \n\nIf my wife wants something she goes and buys it. If I want something I do the same. If what we're getting is a few thousand dollars then there will be some discussion on the matter.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Exactly. It’s so wild to me that people think combining finances erases your individuality.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Having separate personal accounts for fun money is one thing. But living in a situation where loaning your spouse money to get their windshield fixed is a thing is crazy",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "It all depends on the couple. They have to do what works well for them. I have many married friends who are always at each others throats over money. One even went as far as to split their finances, but the husband doesn't contribute to household expenses in the slightest. Nor expenses for their children (school supply shopping was a big fight between the 2). Seeing all the fighting that my friends have in their lives, there's no way I wouldn't have separate finances if I ever get married.",
              "id": 205,
              "comments": [
                {
                  "score": 36,
                  "content": "I’ve noticed that finances tend to be an arguing point if  anyone involved has any sort of resentment, possessiveness, or trust issues re: money.  \nLike if one is a higher earner, or one “spends more” even if it’s bc they’re the one who handles household spending.  My uncle didn’t want to combine accts when he married my aunt, because she was a housewife at the time and “why, it’s not like you make money anyway it’s all my earnings”.  (Jokes on him, he lost his job and is freelancing for the last 10 yrs.  She got a job & eventually promoted to dept director - refused to combine accts when he was suddenly interested in doing so.)\n\nDisclaimer:  I am not in any way referring to people who mutually, and happily agree on split finances.  It’s all about whether the couple sees eye to eye on money issues; if one person feels bad about it, it’s not going to work.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 7,
                      "content": "For the particular couple I'm talking about, they only recently split their finances. They also have a credit card for any and all stores that offer their own cards. So they are spending way beyond their means. He has a state job, and she is in billing and coding. Neither one should be hurting for money. But yet wife is always texting me about how broke she is, and she's afraid to ask husband for help. He's very mentally and verbally a usive towards her, I've witnessed it first hand. He threatens to leave and take the kids away from her all the time. (I know, that's a story for a different sub) It's getting to be a broken record with them... Oh, but yet they can afford for her to go out and get a massive tattoo on her thigh that I'm sure wasn't her idea. But whatever... Not my relationship lol",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "That’s insane she should have billed him for housekeeping and babysitting lol",
                      "id": 208,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "For me it took stress away and opens up dialog about finances. Which when things are tight can be tough, but for us it was better than one person struggling. We are a team after all.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I've tried different variations of both, and I found that with all the money shared or with all the money separate it causes a lot of fights about money, but with part shared and part separated there is never really   \na reason to fight about money anymore. There is no on-size-fits all solution, so when people ask me for advice I suggest they try out a couple different set ups for awhile and see what works best for them.",
              "id": 210,
              "comments": [
                {
                  "score": 3,
                  "content": "Fully shared finances work if you set a budget for each person's fun money",
                  "id": 211,
                  "comments": [
                    {
                      "score": 4,
                      "content": "If each person has \"fun money\" then that wouldn't be fully shared.",
                      "id": 212,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "As with most other things, YMMV.\n\nWorks for my husband and I. We have a joint savings we each dump into as needed (\"hey can you pay daycare at pickup this evening, I forgot my debit card, just dropped $600 in the savings for you\", etc., plus we keep a minimum amount in there for emergencies), but we split our bills out in an agreed way (not 50-50, I do well for myself, but he makes nearly double my salary because he's 11 years my senior and much further in his career, so he picks up more, especially since I have significant student loan debt and he has zero) and pay from our own. \n\nZero drama, zero contention about money, etc. But, we are also very transparent and open with each other, and that's they key, IMO. Doesn't work for everyone, and it's often used to cloak dishonesty with money, but it works for us.",
              "id": 213,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I agree with you.. I see everyone responding that it works for them and they're all really good about transferring money and keeping things fair. I'm glad that works for them, but I love my joint account. I don't have to transfer money anywhere to get the bills paid or to have fun money cause it's already all in the joint account. I've had 0 issues doing this during my marriage.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My bf and I have been together over 10 years and combined our income 4 years ago. It definitely taught me money management and majority of our fights went away. I assumed when people actually get married that they trust each other enough to combine everything. I don't see any reason to have separate accounts unless one person is extremely careless.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My understanding is that simply getting married will not impact your credit score, but getting a joint account will. My husband has a bad credit score from some medical issues when he was 18/19 and uninsured, but I have pretty good credit. So we’re avoiding a joint account until at least after we buy a house.",
              "id": 216,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Could someone like OP’s husband really be trusted with a shared account though?",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1178,
      "content": "ESH - your husband has to lend you money? Lend? You both have some growing up to do before this baby comes.",
      "id": 218,
      "comments": [
        {
          "score": 607,
          "content": "It's so weird when couples are like this. I know a couple who borrow and lend from each other, and keep a record of it. They're married, and they do this. I'm not married but I would never do this to my partner, if they need a tenner for something then have it, you're my partner, if I need them to pick something up from the shop on the way home then they do, it's so gross to borrow and lend from your spouse.",
          "id": 219,
          "comments": [
            {
              "score": 231,
              "content": "That's what I don't get. Why even get married? Unless you're religious, the intention of marriage is shared finances in the eyes of the law (and all the benefits that come with it), so it seems ridiculous otherwise to just completely separate your lives that way despite performing a whole (expensive) ceremony to declare a lifelong 'bond'? People are weird.",
              "id": 220,
              "comments": [
                {
                  "score": 95,
                  "content": "My significant other and myself keep most finances seperate. We do have a shared account, but there's a set amount that we both put in each month and it's for shared expenses like rent, groceries, utilities etc. \n\nWe keep all savings and personal checking separately because it's easier for us to manage spending, more specifically my spending. I make more, but also tend to spend more and struggle with consistently saving/budgeting where he is very frugal with spending. We both know I suck at not overspending; it's something that I'm working on so keeping finances separate works to keep one from developing hostility over spending on \"unnecessary\" things. \n\nWe plan to keep most of our finances separate for the foreseeable future just because that's the best option for us. As our relationship progresses, more expenses become shared and budgeting has to be done together more, but keeping things separate can help keep both parties in check a conscientious of where money is going. \n\nI don't understand why people think separate finances for married couples is so strange; not everything has to be shared 100%\n\nEdit: a word",
                  "id": 221,
                  "comments": [
                    {
                      "score": 49,
                      "content": "My comment was more about why get married if you’re not religious, have no kids, and don’t want to share finances? You said your ‘significant other’ and not your spouse. Sounds like that totally works for your partnership, but for my wife and I who have a mortgage, joint credit cards, and 8 year old kid, it would get messy pretty quickly to try and keep finances separate. Could we? Sure. But from where I sit at least, if you don’t have the same circumstances I do AND you also don’t want to share money...why get married? Your comment seems to exemplify exactly what I’m saying.",
                      "id": 222,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "We have an easy solution to this. Both our wages go into a shared account to pay for the house, bills, shopping, etc. Then my wife and I get a set, agreed on amount each week, effectively like spending money. We can do what the hell we want with that money without having to feel guilty or worry about whether the family has enough.\n\nI earn more than she does, but that wouldn't be possible if she didn't do more with the kids. I would feel awful in a relationship where I had more than my partner. A relationship should be even.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Y'all have a shared account for the things that matter. No one is arguing ALL FINANCES should be together. You and your partner clearly are in this together based on your description, but you keep separate finances too, which is totally fine and healthy.\n\nBut if you read the OP, the description of their finances reads *completely differently* from yours. They sound like nothing is shared, and they don't consider each other partners at all. Seriously, they're struggling to pay for gas and shit, worried about $20 for a night out, and still no sense of sharing or reciprocity at all.",
                      "id": 224,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "My husband and I still have separate checking accounts, so we do ask each other for a little stretch money from time to time. Thing is, we don't ask for it to be repaid, because that's nuts.",
              "id": 225,
              "comments": [
                {
                  "score": 11,
                  "content": "I have a separate account, but it's just a small one for \"I don't have to justify spending this\" money.\n\nMy spouse would have one too, except that it's too much of a headache to have another account. Instead, they know they have a similar amount of \"I don't have to justify spending this\" money in the joint account and we just ~gasp~ trust each other.\n\nWhen we have to get gas for \"own\" vehicle, or buy groceries, or pick up take out, it comes out of the joint account.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 227,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Exactly. We honestly just haven't gotten around to it, that's really it. We have personal and mutual debt we both pay toward. because regardless of where our income and debts live, it's all still OURS to handle because we're in this together for the long haul, whoever willing, haha.\n\nOnly bummer thus far regarding marital finances is I've had to cut back on frivolous spending, which honestly is a good thing and if respecting a more secure future for my husband and I isn't a good enough reason to, I don't know what is.",
                      "id": 228,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "We do too but that's because the idea of redoing all our auto-pay accounts sounds awful. We share everything though without really a second thought.",
                  "id": 229,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yup. I pay him less rent than he pays, and in trade I pay all our utilities on auto-pay because I was the one who set all that up. Easy peasy.",
                      "id": 230,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Exactly. We keep our finances separate (as in we don't have a joint bank account or anything like that), but if my husband is going to the store and I ask him to pick up xyz, he does it without question. We don't keep track of it because it all evens out in the end. Next time I go to the store he'll ask me for something. It's NBD. We're married and are a team. He's not my roommate- he's my husband.",
              "id": 231,
              "comments": [
                {
                  "score": 9,
                  "content": "Us too. I'm confused by all the \"separate finances mean a doomed marriage\" here. We don't keep a tally because we trust each other enough to know it's equitable. Might be marginally more convenient to have a joint account for bills, but we've never gotten around to it.",
                  "id": 232,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Thank you. Exact same here. We've been married for 3.5 years. We don't own a home or anything and I went back to school immediately after we got married. I'm super busy with school and work so we just never got around to making a joint bank account (although we talked about it). It wasn't like a \"we're going to keep our finances separate thing\" it was a \"we're lazy, don't have time and don't have an immediate need for a joint bank account so we'll put it off\" kind of thing. We still lend each other money/buy each other stuff all the time and never keep track because it always evens itself out.",
                      "id": 233,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I don't mind covering my significant others needs, but we still keep independent finances. I'll cover one fancy dinner, he'll get the next dinner, we'll both go half in for a hotel or a gift to a friend. I hope that doesn't enter the \"gross\" territory. We both make about the same and just don't care to keep track of who gets what (we also don't hold it over each other's heads).",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 82,
          "content": "I was looking for this comment. They want marriage but to live single. I do not understand relationships like this.",
          "id": 235,
          "comments": [
            {
              "score": 11,
              "content": "I was also looking for this comment, and I also don't understand such relationships. I'm the sole financial provider for our family. It's not easy, and one day my wife will work and add to our income, but I would never consider the fact that I'm currently making the money as some sort of debt for her to pay off. OP and her husband are simply selfish people. I mean come on, you have to borrow $20 from your spouse? Jesus. This is the couple that will probably force their kid to work as soon as they are legally able to and pay rent.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 635,
      "content": "NTA holy shit this guy is your husband and would have a problem with you asking for any of that money so he had to “hide” it?? That’s a huge red flag in my book, not to mention the whole day he tried to play it off it all adds up to ‘concerning’.",
      "id": 237,
      "comments": [
        {
          "score": 145,
          "content": "he has a problem with her asking him for money but no problem asking her for money. Fuck that. \n\nNTA",
          "id": 238,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 568,
      "content": "ESH. You can’t afford gasoline for your cars, but you’re going to have a baby?  You actually planned this?  You barely have money for food and rent without this $1500 insurance payout and you think having children is a good idea?\n\nAnd on top of that, you’re now kicking out the father?  So you’re now planning on being a single mom who can’t pay her bills?  I hope you’re not here looking for sympathy.",
      "id": 239,
      "comments": [
        {
          "score": 387,
          "content": "I can afford all my expenses and save money. The issues is that I was constantly helping him out even though he works full-time as a phlebotomist. He’s not very good at managing his finances so he comes to me when he runs out of cash. I can easily Raise my child without his support.",
          "id": 240,
          "comments": [
            {
              "score": 238,
              "content": "While I do think you need to run, OP, please ask for child support regardless of finances.\n\nThat money is for your child, not you. If you can afford to pay for all their expenses on your own, use the CS money to start a college fund or a nest egg for a home downpayment for when your child is grown. But you husband is clearly irresponsible with money per your comments, and you need to protect your child first - one part of which involves suing for child support once you (hopefully) leave his ass.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "> I can easily Raise my child without his support.\n\nSounds like you should just do that then. Cut him out completely before he ruins you.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This is making me think about my abusive ex.   I was educated, with a good job, good relationship with family and a lot of friends.   When we were together I let my car get repo’d so I could pay his child support to his first ex, and other things like that.   Everything was about money and only what it could do for him.   He wants a new gaming console? Tells his daughter she is getting it for Christmas, and guilt trips me enough that I cave in and do one through rent-a-center.   I *knew* better, but he had me questioning my sanity.   Good luck OP.  If I could go back in time I’d tell myself to RUN from what I now know are red flags.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If a guy with a good job can't even pay for the daily essentials, then why would anyone have a child with him? Sounds like OP picked a loser and she is regretting it.",
              "id": 244,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "can you easily raise your child without his support though? you’re at the point where i assume you have zero savings, can barely afford gas and other basic necessities without your husband’s meager $1500 insurance payout. although your husband’s the one who sucks at managing finances, you are also enabling him by giving him money whenever he sticks his hands out, to the point where you can barely afford life but you claim that you can afford all your expenses plus save extra without him. \n\nto be financially prepared for a child you should have at least 6 months worth of living expenses saved up for emergencies, in the cases where your car breaks down or your child gets sick and needs to go to the hospital. it seems to me you are nowhere near financially prepared for this child. you are part of the problem if you’re financially enabling your husband to the point that you are flat out broke yourself.",
              "id": 245,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I’m not sure what you do for work, but if he’s a phlebotomist he shouldn’t need to be asking you for gas money. Him hiding this money makes me think he has some other problem.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He's a phlebotomist and coming to you for money? Wow how much is he fuckin spending?",
              "id": 247,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 100,
          "content": "[deleted]",
          "id": 248,
          "comments": [
            {
              "score": 44,
              "content": "Right!? Am shocked by the lack of ESHs we usually have when someone kicks the other out",
              "id": 249,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Not to mention that it is illegal.\n\nAt least in my state, even if you are not on the lease/not listed as an owner of the home, but all your shit is there, you sleep there and get mail there, that is your place of residence and it is illegal for another resident to kick you out or lock you out. The other resident has to go through the proper eviction procedure (30 days notice) to legally kick you out.",
              "id": 250,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">I can't stand the mentality of \"I am so mad at you that I can't stand to be near you, so you have to leave the place where we both live.\"\n\nYeah I didnt think people actually did this, I thought it was some dumb overused trope from movies/tv shows. Like the whole \"sleep in the doghouse!\" thing, so no counseling or sitting down to talk about it? Nope, leave the house so now I have to pay for literally everything even though your shady dealings were discovered by me asking for $20 because I'm really low on money! Outstanding move",
              "id": 251,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Not being able to afford gas and the fact that your husband is lying like that over $1500 are not signs of being financially stable enough to raise a child.",
          "id": 252,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I’m here for this...definitely ESH.  Sounds like there’s deeper concerns here for all parties involved than a few bucks.  The complete equation seems out of whack.  I’m guessing there’s more to this story than OP is letting on, allowing perception to be skewed, my radar is up on this one.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 290,
      "content": "NTA. You were paying for a lot of stuff that really isn't that cheap. Not to mention he not only got angry but reverted to name calling when you asked him. He also didn't come clean when he got caught initially. I hope the rest of your pregnancy goes well.",
      "id": 254,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 277,
      "content": "You are having a baby and you don’t have $20 for gas? And it’s a planned pregnancy? Guess I know who’s going to pay for that kid... me",
      "id": 255,
      "comments": [
        {
          "score": 111,
          "content": "THANK YOU. Irresponsible af",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 84,
          "content": "She didn’t say the 20$ was for gas, she asked for some cash since she “didn’t have cash” - which is different than having no money (which is not what you said). \n\nAnd don’t worry, your pittance in taxes mostly goes to the military (I’m assuming you’re American because I’ve never heard people from other places bitch about MUH TAX DOLLARZ - shows a real lack of understanding about things lol)",
          "id": 257,
          "comments": [
            {
              "score": 32,
              "content": "Well, technically she asked for his debit card, which would mean her debit account had no funds.",
              "id": 258,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Uh dude. She wouldn’t have made such a big thing of it if she actually had the money. She could have just used her own debit card or stopped by the bank on the way to her friends. You’re taking a leap there",
              "id": 259,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "She doesn’t have the money in her account. Also 1k balance is a lot of money for them. There are serious issues. \n\nA baby is much more expensive then a couple tanks of gas.",
              "id": 260,
              "comments": [
                {
                  "score": 4,
                  "content": "Understatement of the fucking year. If you can raise a kid for a *single week* without incurring expenses that cost more than a tank of gas, either you aren't feeding him or you aren't giving him a place to stay.",
                  "id": 261,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Hear that? That's the sound of more dependents siphoning our taxes away! \"Planned\" my ass, this whole issue came to light over OP struggling to pay for gas and having to borrow a whopping $20, that's shit I had to do in college working part-time. To be doing that while planning to have a BABY? That won't even cover a month of diapers",
          "id": 262,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}