{
  "post content": "I (F32) have been trying to get pregnant for seven years now and have been unsuccessful. Diagnosed with PCOS later in life, I’ve had five miscarriages that have taken a massive toll on my physical and mental health. It has left me feeling like a massive failure as my partner (M36) desperately wants children and I’m unable to give him this. He never makes me feel badly about it, but I know he’s upset. His parents are in ill health and they want grandchildren more than anything.\n \nRecently, I had a massive argument with my sister (F34) after my last miscarriage. I was upset and asking her why this kept happening to me. She shrugged and said it was probably to do with the abortion I had when I was 19. Honestly, I was gobsmacked at how nonchalant she sounded. She knew there had been health reasons behind it and had been supportive at the time. I’d been so poorly that I’d needed an operation and had spent months recovering. Also, she knows how guilty I felt that I was unable to carry to full term.\n \nI asked her what she had meant and she said that our decisions always come back to haunt us and that I needed to understand that I’d brought it on myself. That some people just weren’t meant to have children and it was god’s way of telling us to stop. She wasn’t being mean, just blunt but my hormones were all over the place and I ended up kicking her out of my house and telling her not to contact me again. Soon after, I got loads of phone calls from my other sister, mum and dad and even my sister’s husband basically saying I had overreacted and was being an a**hole. That I had to make things right and apologise. I refused and haven’t spoken to any of them since.\n \nMy partner doesn’t want her back in our house anytime soon after what she said. AITA for agreeing with him over my family?",
  "id": 1,
  "comments": [
    {
      "score": 16512,
      "content": "NTA - you don't EVER say something like that to someone.  If she wasn't on the lease, or paying rent at all, you have every right to kick her out. \n\nShe's an adult, she can figure out her own living situation without having to room with people she thinks so lowly of. \n\nBTW, I am SO SO sorry you are having difficulties.   I wish you all the best in the future for a large, happy family.",
      "id": 2,
      "comments": [
        {
          "score": 5428,
          "content": "> If she wasn't on the lease, or paying rent at all, you have every right to kick her out. \n\nThat's the thing, I don't think the sister was even living with OP at all. The vibe I got from this is that she was merely visiting, especially because sister's husband was also mentioned. \n\nAll this hullabaloo from the family over making her leave a house she was visiting.",
          "id": 3,
          "comments": [
            {
              "score": 1417,
              "content": "I couldn't tell if it meant as a roommate or guest situation and didn't want to assume, but her not being on a lease covers both bases.  Person on the lease can kick out whoever they want, if she's just a guest.  \n\nEither way, she is a massive and manipulative AH who probably told a WAY different story to the family to act like she didn't say something completely atrocious to warrant getting the boot in the first place.",
              "id": 4,
              "comments": [
                {
                  "score": 962,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1318,
                      "content": "This part stuck out to me: “ She wasn’t being mean, just blunt.”\n\nOP, she very much WAS being mean. These are incredibly cruel things to say.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 112,
                      "content": "Honestly OP my heart goes out to you in a huge way and I am so sorry you are having to go through this. I kind of know what it’s like to have a chronic condition in my abdomen and pelvis. I desperately want children but have suffered a miscarriage and family keep telling me I am too sick to try and that I would be a burden on my partner and child.\n\nI am sorry your family is being so toxic but don’t let their negativity take you down. Maybe your calling is adoption or not but you are not less of a women for making the decisions you did and also going through so much. You were allowed to prioritise yourself with your abortion. Your sister is a major A H. You are strong, beautiful and an incredible person OP and I send positive wishes for your future however that may be. Keep your head up and block out the bullshit from your family.\n\nNTA.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "> I couldn't tell if it meant as a roommate or guest situation and didn't want to assume, but her not being on a lease covers both bases. Person on the lease can kick out whoever they want, if she's just a guest.\n\nNot actually true in most places, don't spread misinformation. \n\nIf she has established residence, then in the vast majority of the US she would need to be given notice before evicting, lease or not. On average it's like 30 days. \n\nIt sounds like she was just a guest, but again, don't spread misinformation like this. Residency is not as black-and-white as \"are you on the lease,\" or \"do you pay rent?\"",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I live in PA. After 3 days \"visiting\" someone's home (including a rental) you have established residency. You now have rights and have to be evicted through the courts if you refuse to leave. It's crazy.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "I honestly wonder what story OPs family was fed... if the sister was that nonchalant about it, she probably doesn’t think she even did anything wrong and completely made herself out to be the victim someway...",
              "id": 10,
              "comments": [
                {
                  "score": 127,
                  "content": "Sounds like they may have been raised in a religion that believes the most important thing is to \"let god decide if the pregnancy is successful\" even if god implanted an embryo outside your fallopian tube ultimately leading to ruptures and septic shock or leads the mother to have a stroke. \n\nThey really don't mean to be mean, they think they're doing you a favor by helping you get into God's good graces. They don't realize they are massively emotionally abusive.\n\nNTA",
                  "id": 11,
                  "comments": [
                    {
                      "score": 121,
                      "content": ">They really don't mean to be mean, they think they're doing you a favor by helping you get into God's good graces. They don't realize they are massively emotionally abusive.\n\nPeople like that know what they're doing. They know they're being insensitive and cruel. They just think because they're religious it absolves them of any responsibility while at the same time making them so much better than you. Don't let them slide with they don't know what they're doing.\n\nOP is definitely NTA.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "They’re certainly not raised in an Eastern religion because **that’s not how karma works.**",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "My SO’s grandma straight up told me with my ectopic (when I was miscarrying bc of the methotrexate shot, had just gotten it 12 hrs before) that I was a horrible mother and that’s why god gave me it bc he thought my time on earth was over and I was evil for aborting the baby he gave me. I have a daughter (4, special needs) that she also told me I was being punished having to raise her, and now I’m in my third trimester with my pregnancy and she keeps telling me he’s gonna die before or during birth bc god hates me. Some people do have religious reasons and don’t realize how mean it sounds bc they’re trying to keep you in gods good side but most of them really do know what they’re doing and saying to you. Some people are just hateful hateful people.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "It doesn't MATTER if they don't mean to be mean. Even if a person doesn't notice they're driving over someone's foot it still gets crushed. OP does not have to rationalize some reason not to avoid being subjected to cruelty. NTA.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Pretty sure being mean and nasty to your suffering sibling is not the way into God's good graces.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": ">Sounds like they may have been raised in a religion that believes the most important thing is to \"let god decide if the pregnancy is successful\" even if god implanted an embryo outside your fallopian tube ultimately leading to ruptures and septic shock or leads the mother to have a stroke.\n\nIt doesn't even need to be an established religion. I knew a few people who really got into the law of attraction and started saying that anyone who has bad things happen to them caused it to happen. I think you have to be a heartless kind of person to be attracted to this sort of idea. But some beliefs do seem to encourage black and white thinking when it comes to why bad things happen to some people.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Either that or they agree and just haven't said anything...",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 326,
          "content": "Hijacking the top comment. NTA. I went through a very similar situation, just my daughter was non viable. My sister reacted similarly as well. I also can not have anymore children and have had several losses as well. I would advise, for the sake of your mental health, to go no contact. I had to do it, it was hard, but years later it was the best decision. I'm glad your husband is supporting you. Your reaction is 100% justified. I am so sorry you are going through this, if you need someone to chat with, my DMs are open. I'm sending you lots of love.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 196,
          "content": "It sounds like OP's sister/her husband live elsewhere. OP just kicked her sister out of the house during a visit. \n\nHow anyone expects to say such a cruel thing to someone and expect to remain on good terms, I have no idea.",
          "id": 20,
          "comments": [
            {
              "score": 110,
              "content": "Sister probably calculated that comment to hurt her sister on purpose.\n\nAnd i\\`ll bet you that she twisted what happened to the FaMiLy so she appears an innocent angel - and Satanic Spawn OP just kicked her out for no reason.",
              "id": 21,
              "comments": [
                {
                  "score": 21,
                  "content": "Same thoughts. She sounds jealous too. Do you have a better life than her overall?  The fact she calls it karma makes me feel like she feels like you don’t deserve to be as happy (or successful) as you are so she is dragging you down to her own level. It sounds to me that she blames herself for not achieving and is bitter that you do, and this is the good opportunity fot your sister to rub in your face aka “Ha! And now you cannot achieve what you want too!”.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "that’s EXACTLY what I was thinking.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well, yeah, but you\\`re on Reddit too - so only logical :)",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Not quite. Verbal leases are accepted by the court. They take more into account than just \"did you sign a paper and/or pay them money\" when deciding if someone is a tenant. It often comes down to if they had permission to be there, and if a \"reasonable\" person would say the possible tenant lived there.\n\nNot saying the sister is a tenant, or that OP would be morally wrong to kick her sister out, just that there's more to it than the lease and the money.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Hey, she just needs to take some of her own medicine.  She made the decision to say an awful hurtful thing, so she needs to live with the consequences of that decision.  It's god's plan, right?",
          "id": 26,
          "comments": [
            {
              "score": 87,
              "content": "Hijacking to say, OP, THIS. If karma \"works one way for you,\" how isn't this a perfect example of it working for her? I can relate to you, OP.\n\nMy sister told me that I was the reason my stepkid had mental illness. I can't have kids, and she told me the world was better off not having, \"more psychos like me.\" Man, coming from someone who was going off, screaming at the top of her lungs, it was pretty rich and hypocritical. I'm NC with her now. She sends me junk \"presents\" that are pretty much just things she doesn't want or can't use. She cries to her friends like the things she said never happened, and wonders why, \"we can't just be friends like we used to.\" She has made it a point to make my life hell ever since I left for college over a decade ago, destroyed every friendship I had by lying her ass off (guess who everyone believed instead of asking me.) When she said that about my stepkids/fertility, though, that crossed a line. She can sob herself to sleep knowing she brought this on herself, no matter how she tries to twist the story to make herself the victim.\n\nActions have fucking consequences. Saying something that cruel to someone is an action, not just an afterthought. Tell your parents/family, \"Sure! I'll definitely apologize for her saying I deserved my miscarriages. Here, let me apologize to you too! I am *sooooo sorry* that I thought maybe my miscarriages were from health reasons, instead of divine punishment for not wanting to die at 19! Please, how should I atone?? You guys clearly have more wisdom than me, to know how horribly evil I am to 'deserve' this without even hearing my side of the story.\"\n\nGranted perhaps a bit dramatic. When my family told me my sister was upset, I told them point blank she can go fuck herself, and anyone who supports her blaming me for a kid's mental illness (THAT IS GENETIC, so MAN I am fucking MAGICAL to somehow have given him autism and O.D.D. WITHOUT CONTRIBUTING GENES) can go fuck themselves too. \n\nIf your family is anything like mine though, I am sure you just, \"brought this on yourself with your mindset, and shouldn't be so negative.\" (That's what my brother said when I told him I had an allergic reaction to anesthesia during surgery. Technically, \"It's scientifically proven people give themselves allergic reactions, so you shouldn't have gone into surgery thinking like that.\" People gaslighting others' medical issues is so fucked.)\n\nLong story short, you're both better off without her in your life. You're NTA, OP, but you will be, if you don't do the most basic thing to keep such horrible people out of your life. Trust me when I say, that even though I am a total stranger, you will breathe SO MUCH EASIER once you're not constantly having to deal with their shit. If your family hears your side of the story and still play favorites, fuck them too. You don't need their cockamaney bullshit. The weight off your mind and shoulders will be one of the most liberating feelings you will ever have in your life. \n\nYou deserve happiness, OP. Don't let anyone, family by blood or choice, random strangers, *no one,* mess with your mental/emotional wellbeing. No one is so entitled that they are allowed to destroy it with such ill-intent. Anyone who *does* allow it, is not family. I wish you all the best OP, in luck, life, and everything that exists within it.",
              "id": 27,
              "comments": [
                {
                  "score": 13,
                  "content": "Sorry you have to be related to twits. Apparently you got the logic and common sense between you kids (unless you have more siblings). I think your response as OP to her family is spot on, but then again I’m a sarcastic person by nature.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Hahaha, on the bright side, they taught me (in a weird, roundabout way) to stand up for myself. They're both fairly intelligent (sister in medical field, brother examines nuclear reactor tanks or something) but when it came to common sense, I guess their heads being up their asses squeezed out what little oxygen their brains had left. As a middle kid, I have always been odd-man-out. It's been quite a learning/growing experience. Thank the gods they're the only siblings I have, though, I couldn't deal with more. I often feel like Michael from Arrested Development, except less successful than my siblings. Just a housewife, essentially, but it's what makes me happy.\n\nAt the very least, if people can use my experiences to bolster their confidence, and stand up for themselves, it's fucking worth every second of suffering. At the very least, thank the gods if it can help more people than just myself. \n\nThere is something I heard years ago from Saul Williams, about how, \"everyone constantly says, 'it'll be better tomorrow,' or to just wait for the next day, instead of thinking, 'I am exactly where I need to be to learn something from this situation.' \" Something along those lines, not an exact quote. We can spend hours, days, years dwelling on what we want to change, but unless we learn WHY things need to change, we can't grow. In my case, I think my hardships were so I could help others with theirs. Well, hopefully. I guess I could be wrong, who knows? But that's what I am going to aim for.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Ok hold up. I'm sorry you and OP have dealt with some shit, but what the fuck kind of bullshit is your brother reading? Unless its a ridiculously oversimplified to the point of being wrong statement, I have never heard it be said that  its been scientifically proven that people give themselves allergic reactions. I have heard them making it worse by exposure, or preventing them by building up exposure as infants. But I have never heard that they give it to themselves. I feel like I need to hit your brother now.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah, I know man. I really used to look up to him a lot before that, he was always the golden child of the family. Then I learned what gaslighting was, and thanks to Reddit, learned what narcissistic and toxic behaviors looked like. Quite an enlightening experience, 10/10, would recommend, haha. The SO helped too, though, to be fair. He never stood for that shit, still doesn't.\n\nWhen the pandemic hit, the man and I came to the decision that sacrificing my cell service was the right call. We still have a house phone (man, it feels nostalgic as hell to have a cordless phone around again), so if anything goes bad, we have it covered. Plus, the cell can still call 911 in a worst-case scenario, and we would have more money for other bills/food/emergencies. Seemed like an easy sacrifice, but I had no idea what it would bring.... And not in a bad way. Not having my phone meant I suddenly wasn't having to turn down all the job listings my sister kept sending. I didn't have to deal with the 'friendly conversations' turned guilt-trips because she didn't like hearing I was staying home with the kid for homeschool, or why I was worried to catch COVID (I have fairly severe endo all over my inner torso, lining included. Pretty sure it's near my lungs, but finding someone who will just operate, instead of putting me on hormones my body rejects, is fucking impossible.) I wasn't getting weekly messages reminding me of how much more successful my siblings were, all the milestones they were hitting, exotic places they were visiting because they're child-free. I wasn't left constantly feeling like a failure by comparison, which is honestly something they both have done since I was really, really young. I was just too blindly obligated to family to see it. Was always taught to be the better person, but never realized I could do that by walking away. \n\nThe only people I really talk to are my dad (who apologized for his past actions, and has become a much better person and parent in general), my SO, and our DnD buddies. Fuck if it isn't the most free I have ever felt in my life. It's like I finally gave myself permission to enjoy my life for what it is---something to cherish, even if it wasn't what I planned---instead of feeling guilty, like I was constantly trying to defend myself for being less-than. I can breathe for the first time in my life. I can appreciate what I do have, instead of dwelling on what I don't. It was the best gift I have ever received, and thank goodness SO helped me see it, and shut it down. It's hard to wrap my mind around how I let it go on for so long.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "\"Blood is thicker than water!\"\n\n\"So is sewage.  What's your point.\"\n\nI love my family and we are best friends with each other, because my parents broke the cycle of abuse in their family of origins and worked hard to teach us to be kind to each other, and they taught by example.  They also went low/no contact with the abusive elements who raised them.  My Dad said that he learned how to parent from watching his parents, and saying, \"That's a thing I won't do.  And there's another thing I won't do.\" They taught him what NOT to do.  He still had to learn what to do, but I'd say he did a pretty good job.\n\nMy mother often says that she and Dad were always amazed at how well we kids turned out, and they take no credit for it.\n\nAll this is to say:  You do NOT have to keep swimming in sewage, just because someone gave birth to you.  Get out.  Take a shower, and then find your own properly clean and maintained swimming pool, filled with nice people who will welcome you and play Marco Polo, instead of cannonballing on top of your head and laugh as you drown.\n\n&#x200B;\n\nBesides, the phrase \"Blood is thicker than water,\" actually comes from \"The blood of the covenant is thicker than the water of the womb,\" and it is talking about Family Of Choice.  It's great when your family of choice is also your family of origin, but it happens frequently enough that they are two different things, and for good reason!\n\nIf you don't want to die a miserable death after suffering long torment from cholera, get out of the sewage!",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "> If she wasn't on the lease, or paying rent at all, you have every right to kick her out. \n\nExhibit 1 billion why you should never take legal advice from AITA",
          "id": 33,
          "comments": [
            {
              "score": 28,
              "content": "In this specific instance that the commenter was responding to, that's real. It was a temporary visitor who lives elsewhere. It wasn't meant as legal advice.",
              "id": 34,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "To add to this you didn't need to read anything past the title to know you are NTA but your sister sure is. How absolutely disgusting",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Also, OP’s sister is not being blunt, she’s being mean and OP had every right to react that way.\n\nNTA",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "on the lease?  where did you get that?",
          "id": 37,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "just wanna drop into the top comment in hopes OP sees this but abortion does not interfere with your ability to get pregnant and carry to term",
          "id": 38,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4316,
      "content": "Nta x1000. She is evil and completely lacking emphaty towards you.\n\nDon't apologise, don't take anything back and keep her out and anyone who takes her side.",
      "id": 39,
      "comments": [
        {
          "score": 5020,
          "content": ">\\[...\\] our decisions always come back to haunt us and that I needed to understand that I’d brought it on myself.  That some people just weren’t meant to have children. \n\nI think OP needs to tell her family that our decisions alway come back to haunt us and that sister needs to understand that she's brought this on herself.  Some people just weren't meant to be allowed in OP's house.",
          "id": 40,
          "comments": [
            {
              "score": 1044,
              "content": "[deleted]",
              "id": 41,
              "comments": [
                {
                  "score": 146,
                  "content": "The amusing part is the Christian god doesn't use karma in that sense, so it is really out in left field.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 61,
                      "content": "The Christian god also doesn't forbid abortion, so this checks out.  There's one mention of it in total in the Bible, and it's an explanation of a ritual for inducing one",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Indeed. Cruel, heartless AND clueless. She’s scored an asshole hat-trick. Plus, more proof that this sister is not the Christian she appears to be trying to make herself out to be. Just....ugh, this rubbed me up allllll the wrong way. I admit my own posts in this sub are not the perfect example of Christianity at times (!) but good grief, it’s pure frustration. I’m frustrated because this type of self-proclaimed Christian who then goes on to act like anything but  just makes the rest of us look terrible.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yep, there is abso NO concept of karma in Judaism Christianity or Islam.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I don't want her in hell, I already have my spot picked out and my friends will be there. She can go to limbo and suffer for eternity knowing that no one wants her.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Those 'christians' that are just so self-righteous they see no wrong in themselves but declare all this evil and sin around them are disgusting. Those are the people that give religion a bad name and act completely opposite of what their religion preaches.\n\nIf heaven and hell is real, those are the people I wish I could see react to going to hell when they die.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Exactly. I have no problem calling myself out when I behave badly or say things that are unChristian. And that’s why. Yes, I’m Christian. But I’m also human with feelings and emotions and trigger points and flaws and failings and all that wonderful(!) stuff.  It doesn’t excuse anything but it does mean that human Christians are not angels or saints. I feel like if more people just admitted that instead of this ‘oh im so very pious, look at me being devout aren’t I wonderful’ nonsense Christianity would not have the reputation that it does.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 472,
              "content": "This is the only reply needed.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 209,
              "content": "Your sister's decision to be an AH just came back to haunt her, with a swift kick in the a$$",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "just this.\n\nNTA",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This should be top comment.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This is the way.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Any ones house really",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "yup, this.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "👏🏻",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Agreed. A perfect answer!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "I almost cried when I read this item. You need space. Do not respond to the others. Give yourself time to heal. I’m so sorry",
          "id": 58,
          "comments": [
            {
              "score": 94,
              "content": "Some space is very needed. I'd also recommend counseling to address OP's obvious deep grief and guilt for her husband. In any continued or future interactions with other family, a stock answer to the flying monkeys may help,\n\n\"I'm not discussing this with you. If you'd like to talk about something else, sure. But this is not open for discussion.\"\n\nAnd follow up by hanging up or ending conversation, leaving whatever.\n\nOh, and cut that sister off, or very LC, only in family situations/holidays and hi/bye, no one on one conversations with her, like ever. Til she kisses your feet and begs for forgiveness for her judgemental ass (which is a greater sin FYI...)",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "NTA. OP I am so sorry you have to go through this, only to have your family be AH's about it. Please take care of yourself and take the time and space you need. Your sister owes you a MAJOR apology.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2301,
      "content": "NTA a miscarriage is not something you should try and guilt a woman about. That's messed up.  She was out of line.",
      "id": 61,
      "comments": [
        {
          "score": 518,
          "content": "Her being kicked out was KARMA. Say evil things, suffer the consequences.",
          "id": 62,
          "comments": [
            {
              "score": 384,
              "content": "Karma doesn’t even work that way. Your actions in *this* life affect you **in your next life**. I hope that the sister’s next life reflects how she treated OP.\n\nI have PCOS, fought infertility and had multiple losses. I empathize with you /u/kaila04 . What your sister said was cruel, irrational, and flat out incorrect but if you are anything like me, a wiggling doubt may have slipped into your head. Let me help rid you of it.\n\n**A double abortion saved my son’s life.**\n\nI was pregnant with triplets and two of them had serious problems. They weren’t going to make it to term. They weren’t going to make it to viability. To save the healthy baby I had a multifetal pregnancy reduction. The healthy baby is now an angsty tween. Go ask your sister to explain that.\n\n**Abortions don’t cause miscarriages.** No matter how hard anti-choice advocates desperately wish it was true, **abortions don’t cause miscarriages**\n\n**Do NOT let your sister’s cruel, insidious words sneak into your head.** **You didn’t do this.** Your sister was being needlessly cruel.",
              "id": 63,
              "comments": [
                {
                  "score": 64,
                  "content": "great use of bolding. this is powerful.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 97,
                      "content": "I just remember what it was like when I couldn’t get pregnant, and then when I did get pregnant, losing the baby - I lost my first pregnancy too, and I had to wait months for the autopsy and genetic testing to come back with a cause of death. It was months and months of worrying about the sip of champagne at New Year’s or that half of a spicy tuna roll, irrationally blaming myself even though I knew rationally (and was told by my OB) that *those little things I couldn’t let go of* don’t end pregnancies. I watched helplessly when my sisters did the same thing. And then, when you finally do get pregnant, you get nine months of anxiety and irrational hypervigilance.\n\nThis shit is hard. And it’s often isolating and lonely. Almost 1 of 120 pregnancies ends in stillbirth and 1 of every 4 pregnancies ends in loss. **So pregnancy has a failure rate of 25% and instead acknowledging that and providing a safety net of support and care we just tell women not to announce their pregnancies until we’re reasonably sure the baby won’t die because we as a society don’t want to have to talk about it.** So when you miscarry there are precious few people to support you. You’re grieving and yet there are no greeting cards, no one is sending flowers or bringing you casseroles so you don’t have to cook while you’re painfully bleeding out the pregnancy you lost. You might not even get time off work and you might have to fight your insurance company to get coverage if you need medical treatment for loss. Nope. Just don’t tell anybody you’re pregnant or that you’re miscarrying.\n\n**Just think about how lonely that feels. And your sister turns on you.**",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I understand you a former coworker was pregnant with twins and she had a serious appendix problem and she had to take care of that if not it would burst and worst problems would come in. She had to get an abortion for the twins in order not to die.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I am surprised to hear that an appendectomy required an abortion but I’ve met many women who had to have terminations to save their own lives. Cancer is the one I hear about most often but I know that there is a type of morning sickness that is so severe it can kill a pregnant mother.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": ">Karma doesn’t even work that way. Your actions in this life affect you in your next life.\n\nOh shit, what did I do in my past life?  \nCuz I've been dealt an iffy set of cards for this life.  I'd like to know what I did😂",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "That's just direct consequences, not karma at all",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "Agreed. Even if she didn’t have the abortion for health reasons and simply because she was 19 and wasn’t ready, she still doesn’t deserve infertility now.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I cant understand how you could say something like this unless you’re just a legitimately evil person.",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "An abortion is also something you shouldn’t guilt someone about. It doesn’t matter if it was medically necessary or if it was for some other reason. Abortions don’t make you some evil sinister being. It was obviously something that OP needed to do and it happened. I really hope OP doesn’t feel guilt over ending a pregnancy that sounds like it could’ve resulted in major health issues. And I sincerely hope OP can have a child now that she is ready to.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Nor is an **abortion**, which is what her sister was actually trying to guilt her about. I'm not sure if you missed the mark there, or...",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1442,
      "content": "NTA \"Our decisions come back to haunt us\" Your sister probably going to regret what she said to you and its quite ironic she said those words when now her words are probably going to haunt her now too. Also one thing that I've almost always noticed in a situation when someone has to kick someone else out because of how they acted, the family members who end up siding with the person who was kicked out seem to have excuses as to why they can't take in the person who was kicked out. It just seems odd to me that they suddenly have all the excuses not to take in someone they've defended so much (or may take them in begrudgingly after no one else wants to help). Also once again NTA what they said was really messed up, she should've continued to support you instead of say such rude things.",
      "id": 74,
      "comments": [
        {
          "score": 120,
          "content": "Of course! It is way easier to try to manipulate and gaslight the wronged party into thinking they are over reacting than have to put up with sister’s judgmental ass living with them full-time.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Its probably because the one who got kicked out immediately calls others and shares their side or story and the person who was wronged and kicked out the harasser does not want to talk to others or share their side as quickly as the harasser does.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I feel like there a chance her sister is scared that she’ll have fertility issue if OP is having them. So she’s latched on to something to blame (god and abortions) as justification for why she’ll be fine and OP is struggling.\n\nNot that it really matters, because if I was OP I wouldn’t talk to her ever again either. But I grew up around women who sound like OPs sister and family. If they blame God’s wrath for being bad on everything, then clearly they’ll never have anything bad happen…because they’re good and holy.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1262,
      "content": "NTA \"not being mean\" seriously? What could be more mean than what she said? Yikes!",
      "id": 78,
      "comments": [
        {
          "score": 465,
          "content": "This is one of the most vile things I've ever heard and the fact that she said it nonchalant makes it even worse in my eyes.",
          "id": 79,
          "comments": [
            {
              "score": 91,
              "content": "The sister is lucky she didn't get fought, what a cartoonishly vile thing to say to another person.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 194,
          "content": "I was shocked when I heard that, too! There’s no way there wasn’t any malicious intent behind her sister’s words. I have family and friends that say they’re “not mean, just brutally honest” and it’s just an excuse to be a gigantic dick without anyone being able to call them out on it because “i’M jUsT bEiNg HoNeSt” yeah right, asshole. You don’t say shit like that without knowing what you’re doing.",
          "id": 81,
          "comments": [
            {
              "score": 86,
              "content": "\"Brutally honest\" people are often AHs - because the \"brutal\" part is where they really go to work.",
              "id": 82,
              "comments": [
                {
                  "score": 48,
                  "content": "Yup 9/10 times if someone describes themselves as \"blunt\" or \"brutally honest\" they just mean \"being a massive asshole is my entire personality but because I acknowledge it you can't get mad about it\"\n\nKinda like saying no offense before being blatantly offensive",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I hate the ‘I’m just being honest’ excuse for being an asshole. It’s no excuse to hurt people on purpose and is evidence that the person does not know how to conduct themselves in an adult conversation.",
              "id": 84,
              "comments": [
                {
                  "score": 3,
                  "content": "They have seem to have forgotten the old saying, \"If you can't say something nice, then don't say anything at all\".  Most of the time, those type of people don't really care about telling the truth as much they want to feel superior over the other person.  Also, if they are on the receiving end of their kind of honesty, they will complain and whine that they are being bullied.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Especially because they're not even \"being honest\" for something objective, they confuse **honesty** for **transparency**. The sister is, indeed, being 100% transparent and speaking her mind, but that doesn't mean she's honest - she's simply telling her own mean and cruel thinking process. \n\nShe knows she's mean, she just thinks she's above judgment. She should be lucky sho *only* got thrown out, I don't know what I would have done if confronted with so much gratitious cruelty.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I think they confuse being openly shitty for honesty, just because you think it doesn’t mean it’s right or true or needs saying",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Oh 100%. You never hear the \"brutally honest\" people saying GOOD things. They never use that \"honesty\" to notice how kind or competent or clever someone is. They never use it to build people up - just to tear people down while claiming to be virtuous.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I hate people masquerading as \"brutally honest\", when they are just assholes. My husband's mother likes the line \"not to be nasty, but....\".",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "I agree. She absolutely was being mean. Do not apologize. That was so cold.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "The sister displayed what I believe to be the most evil: bureaucratic evil. Uncaring, dehumanizing, cold, blank evil is sickening, and honestly it is what the worst, most brutal regimes in history have relied on. Read *Eichmann in Jerusalem: Report on the Banality of Evil,* by Hannah Arendt. \n    \nHumans who shrug at another's pain increase the amount of cruelty in the world yet pretend they have done nothing wrong.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "What a nasty person the sister is, good riddance. I hope that when OP has a weak moment and let’s the sister back in, her partner keep refusing—she shouldn’t be in anyone’s home, she’s trash.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Oh of course she wasn’t being mean, she was just blunt! Bluntly saying abjectly false and horrifically cruel things for the sole purpose of hurting her sister. See, just bluntness!",
          "id": 93,
          "comments": [
            {
              "score": 2,
              "content": "\"I dOn'T sUgAr CoAt ThInGs\"",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 656,
      "content": "NTA\n\nI've heard some sadistic crap before, but this is way over the top.  Does your sister pull the wings off houseflies, too?\n\nFor that matter, why in the hell would ANYONE defend such cruel remarks, or even worse, minimize them saying that OP \"overreacted.\"  Nice family there, OP.  That they defend hateful sludge like this says a lot about them, and none of it good.\n\nIt ain't Karma.  It's your medical issues which likely have zero to do with a procedure you had in the past.  One for what I'd assume was a reason you discussed with a medical professional.  Her \"woo-woo\" claims are hers and hers alone, and if your warped family thinks her comments were appropriate, maybe they all need to to do without your presence.\n\nWe've been through this ourselves in our house.  Miscarriage is not a joke, and it absolutely should never be used against another like this.  I'm sorry you're enduring this.  I can only offer hope for better days ahead.",
      "id": 95,
      "comments": [
        {
          "score": 423,
          "content": "The whole \"abortion causes future infertility\" is an old debunked pro-lifer line. Given the sisters God comments it sounds like she's thinking along those lines. (Disgusting and wrong though they are.)",
          "id": 96,
          "comments": [
            {
              "score": 212,
              "content": "Yes yes yes, I had a very Christian friend who had an abortion in college and then later suffered a miscarriage who I had to talk down off a ledge for this exact thought process. Has since had two beautiful monsters, but man those pro-lifers can be awful.\n\nOP, what your sister said was mean, no matter her tone of voice during the delivery. You are grieving a loss and you reached out for comfort. She returned nothing but cruelty for cruelty's sake. The fact that she delivered her opinion like gospel truth is just gross and wrong. I'm so sorry for your loss. Asking her to leave after she spewed such hatred at you is completely justified. Either your family is equally cruel or sister spun a tale that doesn't include her nasty comments. Regardless, keep her away while you work through this painful time, lean on true friends, your spouse, internet strangers, whatever you need to do. Remove yourself from this drama while you heal. Partner sounds like he's in your corner, set him loose on whoever wants to bother you. \n\nDon't beat yourself up because of these losses. They're not \"failures\" on your part. There is no cosmic reason why you've had these losses, and anyone who suggests otherwise gets the boot. Take care. I'm very sorry for your loss. \n\nNTA",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "They're not pro-lifers in that case, they're pro-liars",
              "id": 98,
              "comments": [
                {
                  "score": 23,
                  "content": "Same thing.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It gets so much grosser when you consider that medically needed abortions (like OP's was) are typically considered reasonable by pro-lifers, this is particularly true if the mother never wanted the abortion in the first place. Only the insane hardliners who believe mother's should carry to term even if the baby is already dead or it will kill the mother think this way. 🤢",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Always found it funny that there can be an infinite list of issues women can have from taking birth control, but abortions seem to not have any long term effects.  Glad to be a dude to say the least.",
              "id": 101,
              "comments": [
                {
                  "score": 1,
                  "content": "Right? If you just shout loud enough, the lies you tell yourself can become facts.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "NTA but I would double check with the family about her side of events. She could have said \"OP was being all mean and hormonal while I was just trying to be supportive\", when that is the exact opposite of how it went down",
          "id": 103,
          "comments": [
            {
              "score": 65,
              "content": "I Agree. Op you should tell your mom or whoever word for word what she said and ask how that is ok",
              "id": 104,
              "comments": [
                {
                  "score": 43,
                  "content": "At the same time, Mom should have checked with OP before immediately taking her sister's side.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 18,
                      "content": "You're totally right but unfortunately it seems that doesn't happen all the time =/",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Her family could also be equally religious pro-life nuts jobs, and agree with the sister.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": ">I've heard some sadistic crap before, but this is way over the top. Does your sister pull the wings off houseflies, too?\n\nThe sister is a piece of work, isn't she? Has no empathy, at all. The other family members aren't much better for defending her.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "It sounds like the family is super religious, so even though OP’s abortion was due to medical reasons (not that it matters), they all still feel like she sinned. I’m guessing this is how they all feel.",
          "id": 109,
          "comments": [
            {
              "score": 28,
              "content": "Okay. But what I don’t get is the thought process of how it’s god punishing her?\n\nSo “they” say she ended a life. So god’s punishment would be to create and end a whole new life? Instead of just denial of creation of more life in the first place? Weird take.",
              "id": 110,
              "comments": [
                {
                  "score": 21,
                  "content": "Don’t expect any of it to make sense. It doesn’t. Never will. But, unfortunately, this is what a shocking number of people believe.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Some people do see God as very punitive. “Vengeance is mine sayeth the lord” and all that crap.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Have you read the Old Testament? That’s pretty spot on for God.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 222,
      "content": "NTA\n\nI don't blame you one bit, it was a vile thing to say...I'm childfree and even I can't imagine anyone being so nasty about this subject.\n\nIt should be the other way around, your sister should be crawling to you with abject and sincere apologies.",
      "id": 114,
      "comments": [
        {
          "score": 50,
          "content": "I agree with this 1000%. Your sister leapt upon her high horse to be needlessly cruel to her sister who recently suffered another traumatic miscarriage. I can’t imagine saying such a horrible thing to someone I hated, much less my sister. Such awful behaviour warrants being kicked out.\n\nNTA even remotely!!!",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I am CF and its highly likely even if I wanted kids it wouldn't happen. If anyone had ever said anything like that to me I'd go scorched earth on them. What a nasty and vile thing to say.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 177,
      "content": "NTA. Who needs enemies when you have a sister like that?! Your sister was out of line and incredibly insensitive to your feelings and she is the only one that should be apologising. Stand your ground and if your family don’t like it, that’s on them not you. Also, I am sorry for your losses.",
      "id": 117,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 137,
      "content": "NTA. People who attribute infertility to some kind of divine retribution are not nice people, especially if they mean it in malice.\n\nShe now knows firsthand about things coming back to haunt her, after that remark.",
      "id": 118,
      "comments": [
        {
          "score": 9,
          "content": "Exactly, \nI mean imagine that scenario for a second with the assumption therefore being that all parents are saints!\n\nWhy do people say such idiotic and hurtful things",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "jesus fuck NTA.\nYou should maybe try adopting tho?",
      "id": 120,
      "comments": [
        {
          "score": 161,
          "content": "I wish adopting was an easy alternative. I’d love to see more people adopt. But the reality is, even with fertility struggles, it’s often much easier to make a baby than it is to adopt one. You have to meet a ridiculous list of qualifications, and spend a large amount of money if you go the private route. \n\nOr you could try to foster to adopt. Still a bunch of requirements but less money, but your lives could end up in upheaval for months or even years. Outside of drastic cases, the intent of the foster system is to reunite families once it’s a safe living environment for the children. Anecdotally, I have a friend that went this route, foster to adopt. She took in the sweetest little 8 month old, and was told he’d be eligible for adoption. She started the process. Spent months raising this child. Only to get told when he was 15 months that he was being placed back with his biological mother. She was heartbroken, but that’s how the system is. \n\nI myself am adopted, and I wanted to adopt instead of going through pregnancy. We couldn’t afford private adoption and I wouldn’t be able to mentally take raising a child and then have to give them back. I attempted to foster a dog once. He became mine after about 30 minutes of knowing him lol. I’m not a good fit emotionally for the foster system. \n\nSo long story short, I went through pregnancy. And it sucked as much as I assumed it would. I don’t regret it one bit, but I wish the above options were viable for more people.",
          "id": 121,
          "comments": [
            {
              "score": 81,
              "content": "Louder for the people in the back.\n\nIt was cheaper and faster for us to do IVF than it was to adopt an infant.\n\nAnd we were 100% not in the mental place to foster/foster to afopt while in the throws of infertility.",
              "id": 122,
              "comments": [
                {
                  "score": 2,
                  "content": "And a lot of people can’t do IVF either. That’s also insanely expensive in most places. \n\nEven though I did not have a difficult journey to having a baby, I fully understand how hard it would be to jump through those hoops while also dealing with the mental struggles of loss. I couldn’t imagine raising a child for months, just to be told, whoops, you gotta give it back, the mother turned herself around. I’d wonder the rest of my life if my foster child had a good life. I’d agonize over thinking the worst. You can’t just raise a baby or toddler for months and just move on no problem. Well, maybe some people can and I applaud them, but I sure couldn’t.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah. It's incredibly expensive and completely out of pocket for most people. Most insurance doesn't cover it. But 20K for IVF was cheaper than the 30K we were seeing for adoption (plus no invasive home screenings or judgment over being two-income atheists who didn't own a home at the time.) We were lucky that my parents were able to help us fund it. And then we were lucky that our first try took. \n\n  \nWe had no success using our leftover embryos for a sibling though, so another 20K+ (because I'm old now) for a CHANCE wasn't even an option when we already had a kid. \n\nAll that you said is exactly why we couldn't do fostering at that point, too. We wouldn't have been able to bear it. Fostering takes really special people who can accept that risk.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Yeah, wanting an infant over all else definitely throws a wrench in there",
                  "id": 125,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I think the thing is, most people want to have an infant, have the experience of raising a baby. Especially if somebody is having trouble having children, they just want to feel normal and have a baby. There's nothing wrong with that. \n\nI mean, we're at a point now where we've been tossing around fostering/foster-to-adopt now that our daughter is 10, and there's no way we'd want to go back to the infant stage. But a lot of people, especially first time parents, want that experience. And the foster system has its own emotional turmoil.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I tried to foster after years of IF.  Denied because..  <checks notes> water stains on my private toilet, some crud around the kitchen sink, and a few popcorn kernels on the floor.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I know the quals, my family adopted. It’s rough, but no rougher than 5 miscarriages, honestly.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "i was adopted through the catholic church.  (I also condemn the church)\n\nmy parents made it sound easier than going through agencies or foster care.",
              "id": 129,
              "comments": [
                {
                  "score": 2,
                  "content": "I was adopted by my paternal grandparents. They had very few hoops to go through. I’d lived with them since birth. Basically my bio parents had 45 days after they signed surrender papers to change their minds. My mom said she didn’t sleep that whole 45 days. They had to swear to the judge that they’d treat me the same as all their other children, blah blah, and it was done.",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Is it like this for all kids or just infants?",
              "id": 131,
              "comments": [
                {
                  "score": 3,
                  "content": "Babies are significantly harder to adopt than older kids, but foster as a whole, they want to return kids to “family” unless the family is abusive monsters. I’ll admit I’m not super well versed in it, but anyone that’s trying for a baby and gets told to “just adopt”, they’re usually going to look for a baby.",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "It’s definitely harder in generally to adopt infants because everyone wants a perfect lil baby. That’s why it’s easy to charge an arm & a leg, honestly.",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I understand that you are trying to be helpful, but this is not the way to do it.\n\nIt is extremely painful as an infertile individual to have \"just adopt\" thrown in our faces, even when it is meant to be supportive. This poor woman has already said she feels like she is failing her husband and now you are telling her to just give up.\n\nPlease think about your words next time.",
          "id": 134,
          "comments": [
            {
              "score": 81,
              "content": "excuse me, but adoption is *not* \"giving up.\"\n\nthats extremely diminishing & belittling to us adopted people as well as people facing infertility who *do* decide to adopt.",
              "id": 135,
              "comments": [
                {
                  "score": 14,
                  "content": "You are correct, adoption is a wonderful choice for those that would like to pursue and for the children that are adopted. It is not, however, appropriate to go to every infertile individual and tell them that they should adopt. When that is the response to them continuing to try to get pregnant, you are telling them to give up on getting pregnant.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 33,
                      "content": "no, i'm not. \n\nadopted people view life differently. \n\nthose who desire to be parents only \"give up\" by not adopting. parents who adopt are the ones who will go to *every* end to have a child of their own, & never quit.\n\npreferring to birth a baby over adopt one at this point is inhumane to OP & suffering children already living on this earth.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "You can adopt and also try to get pregnant. Adopting isn't a last resort you try after your fertility fails. I know plenty of people with an adopted child in between biological children, they didn't \"stop trying\" to get pregnant just because they adopted.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "A lot of people disagree with you. And I did not say “just adopt”, you put that in there.",
              "id": 139,
              "comments": [
                {
                  "score": 8,
                  "content": "\"A lot of people\" also think that it is acceptable to tell a woman that is suffering after a miscarriage that it was karma and God's way of saying she shouldn't have children. Those people are wrong. \n\nIn this situation, you are also wrong. This woman is clearly struggling and your only advice is \"maybe try adopting tho.\" That is not advice. It is a slap in the face. It is you telling her that she is not worthy of having a biological child. It is you shaming her for having the audacity to want to experience pregnancy and childbirth. It is rude and disrespectful and it has no place in this conversation.\n\nIt is NOT the job of the infertile to take up for the fertile and adopt their unwanted children. If you would like to adopt, and have the means to do so, please do, but you do not get to tell a woman that is struggling with infertility that she has to make the same choices you do.\n\nInfertility is a medical issue, not societal. It needs to be treated medically. The only response society should have is one of compassion. Nothing about your comments is compassionate.\n\nEdit: a word",
                  "id": 140,
                  "comments": [
                    {
                      "score": 26,
                      "content": "[deleted]",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "So, let me get this straight. Exploring other options, while not actually telling the person to give up on having bio children, is now a slap in the face?",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Lmao at “worthy of having a biological child”, honestly",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I agree that the suggestion \"maybe try adopting\" isn't helpful, though looking through your comments on this subject I would suggest that your responses are just as unhelpful, and harmful.\n\nThe general impression I get from your comments is that anything other than having a biological child is unacceptable to those suffering from fertility issues. The suggestion that adoption is 'giving up' just furthers the harmful idea that a woman is not a true woman/mother if she cannot give birth to her own child, and can compound an already stressful and upsetting situation.\n\nI am assuming from your comments that you have experienced fertility issues, and been on the receiving end of such adoption comments, and I am sorry for your experiences, but it seems to me you are projecting your own feelings onto OPs situation. I'm sure it was not your intent, but I find your comments just as lacking compassion as those you are replying to. Your original first sentence was in my opinion all that needed to be said, the only thing that could have been added is; \n\n\"It is not mine, yours or anyone else here's place to opine on how OP should continue to pursue parenthood, nor were we asked for . There are many options out there and I am certain that OP and her partner will be aware of them all and capable of deciding which is suitable for their own, unique circumstances.\"",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I’m sorry you’re slapping yourself in the face",
                      "id": 145,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "If adoption wasn't so difficult, then it would actually be a really good suggestion. Sometimes \"keep trying\" isn't the solution, because repeated miscarriages are taking a toll on the body and mind that can be permanent. Or IVF treatments are costing them thousands of dollars.",
              "id": 146,
              "comments": [
                {
                  "score": 3,
                  "content": "I was afraid to say this too but I agree keep trying isn't always the healthiest option either.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was afraid to say this too but I agree keep trying isn't always the healthiest option either.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I promise OP has thought about adopting. I guarantee you this has occurred to OP and her partner as a possibility. I don't think this is at all a helpful comment.",
          "id": 149,
          "comments": [
            {
              "score": 12,
              "content": "Not everyone does. So many people think they could only love a baby with their DNA. I’m glad you’re so optimistic about people though!",
              "id": 150,
              "comments": [
                {
                  "score": 0,
                  "content": "There's a difference between not wanting to adopt and not even thinking it's possible...",
                  "id": 151,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yes there is. And since we can’t know what category OP fits into, it’s a valid option to think about. Have a nice day!",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I can't imagine for a second that OP has never heard about adoption, nearly everyone has and especially if you've actively been wanting a child for many years. \n\nYou gotta think then that this is a redundant comment and as many others have pointed out, potentially quite harmful. It's not that simple!",
          "id": 153,
          "comments": [
            {
              "score": 8,
              "content": "A couple others. Way more people agree with me. It is what it is 🤷🏼‍♀️",
              "id": 154,
              "comments": [
                {
                  "score": 0,
                  "content": "Not sure how you figure that from looking at the likes but you do you.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Have a great day 🥰",
                      "id": 156,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "This is almost as much an asshole response as as what OP’s sister said.",
          "id": 157,
          "comments": [
            {
              "score": 3,
              "content": "Lmaooo",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "“You should maybe try adopting tho?” \n\nOMG! You solved it! Yay! \n\n/s\n\nGuaran-fucking-tee this has already crossed her mind. She may or may not be pursuing already. \n\nHowever, not a helpful piece of “advice” to give someone in the midst of fertility problems. Just stop.",
          "id": 159,
          "comments": [
            {
              "score": 7,
              "content": "If someone wants to cry on the internet about how their body doesn't want to reproduce, I can cry on the internet about how people ignore the environmental impacts of having children, and the social impacts of leaving orphans unadopted.",
              "id": 160,
              "comments": [
                {
                  "score": 5,
                  "content": "Unless you have personal experience with infertility, the most polite move is to say, “I’m so sorry,” and leave it at that.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You're probably right.\n\nI just wish people didn't assume everyone was on the same page about infertility being a problem. It can be difficult to be both sad that your friend is sad along with frustrated about what your friend is sad about.\n\nWhen it's a stranger on the internet, the balance tips much farther over to the frustration.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "So I just wanted to comment on your blithe throwaway comment about adoption. This gets tossed at infertile couples all the time and its just a really shitty thing to say to someone who's struggling with infertility. Adoption is a great thing but it shouldn't be seen as a consolation prize for couples who can't conceive children on their own. If a couple wants their own children, it's shitty to say they should just give up on that dream of conceiving and carrying their own baby. And adoption, at least in the USA, is actually REALLY hard if you'd like to adopt a baby instead of a teenager. Fostering to adopt is its own difficult road, you have to meet lots of qualifications and actually hope that at the end of the day a child is taken from its parents forever and given to you. There's always the possibility the baby you've raised will be taken from you in the foster system and given back to incompetent birth parents. It's not a sure thing. And private adoptions not through the foster system cost about $40,000. That's about the same cost as 2 rounds of IUI and 2 rounds of IVF combined. Financially, adopting is MORE expensive than trying reproductive endocrinology. It's just not the easy answer people make it out to be with the throwaway comment \"just adopt!\"",
          "id": 163,
          "comments": [
            {
              "score": 6,
              "content": "Hun, I know. I didn’t say “just adopt”.",
              "id": 164,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "As I’m sure you meant well with the just adopt line, in reality, that statement is a slap in the face to anyone struggling and to those adopted or waiting to be adopted. Anyone dealing with infertility is aware of their options. And no one should be adopting just because something else doesn’t work. Adoption isn’t a fix for infertility. Nor should it be suggested as one. And unless you look at every young couple and ask if they are adopting too, then your adding to the misconceptions and it makes the adopted feel like second class citizens. No adopted kid wants to be the second choice because getting pregnant didn’t work, and no infertile couple wants to be told to adopt to fix their issue. Not saying you suggested it or intended it at all, but it’s a common misconception that needs to be put to bed and I’ll say it every time someone brings it up, because it’s the go to phrase next to “maybe it’s just not meant to be”. And many people throw it out as a fix for loss or the inability to get or stay pregnant. Or it’s used as a pivot by someone already uncomfortable with the topic of discussion. \n\nI couldn’t move forward with the idea of adoption until I had made peace with my medical condition and the fall out of that medical condition. I didn’t want to adopt a child just because I couldn’t have a biological child. I wanted to adopt a child because I want to share my life and love with a child who needs a home and loving family. But first, I needed to heal and accept my diagnosis, grieve the fact that I won’t carry my husbands biological child before I could let myself even entertain the idea of adoption. I had a lot of trauma from my infertility that won’t disappear just cause there is a child in my life. Having a child is the outcome of a pregnancy or adoption. Adopting or giving birth to a child doesn’t cure infertility or the struggles you went through but they get lumped together. \n\nAnd we haven’t even looked at other factors when it comes to adoption, like the fees associated with it and knowing that your ability to raise a child is in the hands of someone who comes to your house and judges you after an incredibly invasive process. To some, that’s too much, it’s too intrusive on top of the trauma left behind from miscarriages or just the inability to get pregnant. \n\nSo as easy as it is to say “why don’t you adopt tho?”, it’s the very tip of the iceberg and will hurt more than it helps.",
          "id": 165,
          "comments": [
            {
              "score": 5,
              "content": "If I had said “just adopt”, maybe.\n\nEdit: Also yeah, I encourage everyone who “wants a family” to look at all of their options. I hope you do as well.",
              "id": 166,
              "comments": [
                {
                  "score": 3,
                  "content": "You said, “you should maybe try adopting tho?” So, yeah, it’s the same. If it wasn’t meant to be the same thing, maybe consider changing the wording.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It’s not the same, and it is not the same wording you used in your book",
                      "id": 168,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "That’s a great suggestion!",
          "id": 169,
          "comments": [
            {
              "score": 6,
              "content": "Thanks! It’s always an option to be looked into for those who really really want a kid, and so many people don’t think about it or think that adopted children would be “less than”, which is such a gross mindset.\nI don’t think OP has those feelings (but obviously don’t know). It’s just something to think about.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -36,
          "content": "Please, please don't suggest that an infertile person \"just adopt\". Infertility is a medical condition, yet our society treats it as a social issue (if even that). \"Just adopt\" is telling someone that they don't deserve to seek out medical treatment to fix a medical issue. \n\nThe best equivalent... Imagine someone has cancer in their leg. It's curable with a surgery and chemo. Instead, the doctor decides that it would be easier to just cut the leg off and replace it with a prosthetic. By saying \"just adopt\", you are telling that person they shouldn't try and keep the leg, but instead just cut it off.",
          "id": 171,
          "comments": [
            {
              "score": 33,
              "content": "Okay, but if prosthetics could be attached and function almost exactly like a regular leg, and there were millions of detached legs running around without people, \n\nAlso? Infertility isn't always curable. Sometimes it just doesn't work. But people sure can burn through their life savings and bankrupt themselves trying. \n\nAnother reason your metaphor is nonsense: a person keeping their leg doesn't add strain and harm to the Earth. Having children does. I'm not an anti-natalist or anything, but refusing to amputate a leg is absolutely not comparable to bringing a child into the world.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I didn’t say “just adopt”. You read that in.",
              "id": 173,
              "comments": [
                {
                  "score": 3,
                  "content": "You said \"try adopting\" which is essentially the same thing. A lot of people are giving you valid explanations on why that wasn't the best thing to say. You should just try to listen rather then try to defend yourself.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 5,
                      "content": "They also said *maybe*",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yay for you reading things in that aren’t there! Good job!",
                      "id": 176,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}