{
  "post content": "There’s a massive amount of backstory to this situation so I’ll try and keep it clear and to the point. \n\nI was raised a Jehovah’s Witness. My whole family are witnesses. At 25 I decided that it was not the religion for me. Unfortunately, if you are baptized in the faith there is a strict shunning policy that is enforced if you decide to leave. It sucks. \n\nWhen I left, my father decided that, even though it means he can’t hold any positions of privilege in the congregation, he was not going to shun his  oldest child. My mother followed his lead. My siblings (I’m the oldest of 5) are a mixed bag. \n\nAt the point when I left I was still on my family’s phone and gym plan (charged automatically to my dads account). My dad also supplied me with a car that is in his name and he pays the insurance. In order to pay my father, I would stop by the house once a month and drop off cash. It was a nice “official” way for me to visit briefly with the family that everyone was okay with. My family does not reach out to me otherwise. The 2-4xs a year I talk to my family is by me reaching out to them over texts. \n\nThen my grandma moved in with my parents. My grandma follows the shunning policy very strictly and will not say a word to me/is uncomfortable by my presence. Out of respect for my grandma (I’m really trying to take the high road) I stopped my visits to the house. For months I’ve been reaching out to my dad asking him how we can get together so I can pay him. But I want to pay him in person because this is the only communication we have. He dodges and doesn’t answer. \n\nSo I decided I’m not tracking him down anymore. If he wants me to pay then he can reach out to me. This week I ran into him at the gym because I randomly didn’t go at my normal time. He mentioned the bills he’s paying (in a sarcastic but serious kind of way). I told him we should get a drink sometime and talk about it. He mentioned it again in the conversation and I told him that I miss him and want to catch him up on my life. He switched tones and acted like it would be something he’s interested in. \n\nMy plan is to ride this out and let him reach out to me first to make plans. The thing is my dad is 70 now and still working full time. My family lives a comfortable life but is by no means rich. Also this means I’m manipulating him the same way my family is trying to manipulate me (by with-holding communication so I turn back to the faith vs. me with holding money so that he reaches out to me). I want to know \n\nAm I the Asshole?",
  "id": 1,
  "comments": [
    {
      "score": 84,
      "content": "ESH.\n\nObviously, what they're doing is unfair and ridiculous. This is not the 1800s, but apparently shunning is still alive and well.\n\nBut also, you're 28 years old. You should be financially independent. And it's not fair to have your 70-year-old dad struggling to pay bills because you want to manipulate him into seeing you. That's not how relationships work.",
      "id": 2,
      "comments": [
        {
          "score": 13,
          "content": "ESH   second this\n\nYou had the opportunity to reach out earlier. \n\nMake a time to regularly meet with him.  At the gym, go for coffee,  etc.  And APOLOGISE for not trying earlier and pay including back pay.",
          "id": 3,
          "comments": [
            {
              "score": -2,
              "content": "This is partially a defense and partially me wanting clear advice ... \n\nI have been reaching out for four years now and they only communication I get is about bills, and I did try and pay him since my grandma moved in (6 months ago) and he says “umm let me think on it” and then never follows up... how much am I supposed to chase around my father to pay him? It makes me think that him paying my bills helps him deal with his guilt somehow.",
              "id": 4,
              "comments": [
                {
                  "score": 26,
                  "content": "Send him a check in the mail. You're too old for your parents to pay your bills.",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "That doesn't change the fact that you're 28 years old and should be paying your own bills. I have a feeling you only let him pay the bills so you can try and get him to see you. I'm so sorry you're in that position.",
                  "id": 6,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "It may help your father's guilt.  But I'd still pay your own way.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19,
      "content": "NAH I'm so sorry you were born to a religion that would do that to you.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "Actually, JW's are a full-blown CULT.  \n\nSource:  I grew up in that shit, and there's a whole sub on here for EX-JW's!  Really says something when you have to have a support group cause people are so traumatized from it.",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "Whats the sub?  Im interested on reading your stories :)",
              "id": 10,
              "comments": [
                {
                  "score": 2,
                  "content": "https://old.reddit.com/r/exjw/",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Thanks, me too",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "YTA- He stuck his neck out for you.. send the guy a check and continue to reach out to him.",
      "id": 13,
      "comments": [
        {
          "score": 8,
          "content": "You’re right he did. And he was my savior, but after 5 years of reaching out and only receiving communication about bills I’ve grown jaded",
          "id": 14,
          "comments": [
            {
              "score": 8,
              "content": "If nothing has changed with your family after 5 years, then it might be time for you to change what YOU'RE doing instead.\n\nCut the financial ties between you. Resolve things in such a way that there are no bills between you. No more financial obligations on either side.\n\nThen let him (and any other family members) know that the ball is now in their court.\n\nThat you'd like to have a relationship with him/them, but for the last several years it's felt pretty one-sided.\n\nThat if they decide they'd like a relationship with you, then you'd love to hear from them.\n\nIf not, then you wish them all the best in life.\n\nAt the moment the financial ties are confusing the issue and causing resentment on both sides. So get rid of them and take a long hard look at what's left.\n\nIf they DO reach out? Great. Take things slowly and see how you go.\n\nBut assume that they won't. Assume that you're all alone in the world now.\n\nWhat will you do? \n\nAre you in the kind of job/career that you want? \n\nDo you have a romantic partner? (If you want one)\n\nDo you have the pets/hobbies/home/friends/children etc that you'd like to have?\n\nIf not, take things one step at a time until you're living the life that you want to be living.",
              "id": 15,
              "comments": [
                {
                  "score": 4,
                  "content": "Thanks! Yeah I’ve done a lot of work I  the past five years. Me and my boyfriend have been partners for the past 8 years. I’m completing my masters in social work this year. I’m hoping to pursue a career in non profits. Always moving onward and forward.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That's fantastic! I'm so glad to hear things are going well for you.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I understand where you are coming from and it is a difficult situation. If I were you, I would attempt to show the same independent fortitude that enabled you to break from that religion and break from financial dependency on him. Keep reaching out.. tell the old man you need someone you can trust to spot you at the gym",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "How are you jaded when he’s paying your bills? The shunning is ludicrous, yes, but don’t accept his money.",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "I am so sorry you were born into that religion. It’s the worst",
      "id": 20,
      "comments": [
        {
          "score": 8,
          "content": "Thanks, it makes things so difficult. . . Like this should be so cut and dry. . . I’m an adult therefore I should pay for my own bills. But this is literally the only lifeline I have to my dad. I’m afraid if I let it go, then he will never talk to me.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "ESH\n\nI think you should be paying regardless, because it seems like the money does make a difference if he's still working at 70. However I also think he (and the rest of your family) should be reaching out more and making an effort to catch up.\n\nAlso, everyone shunning you sucks. That's such manipulative rubbish.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "gentle YTA for using money that’s rightfully his to manipulate him. You’re holding his money hostage in exchange for attention that he may not be comfortable giving under these circumstances.\n\nStill it’s a ridiculous culture",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "Honestly I think he likes it. He gets to deflect what he’s doing to me by holding money over my head. Like look, I’m still doing something for you.",
          "id": 24,
          "comments": [
            {
              "score": 2,
              "content": "YTA for sure with that weird assumption and entitled attitude wtf",
              "id": 25,
              "comments": [
                {
                  "score": 2,
                  "content": "maybe I’m the asshole but honesty not a weird assumption with witnesses. The emotional manipulation do run that deep lol.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH.......but I also can empathize with the crazy BS of Jdubs. But I accepted letting my parents go after expressing my appreciation. Sucks because as adults things were finally good....but for now *they* chose to obey the cult. Wish you well on the outside. 😊👍",
      "id": 27,
      "comments": [
        {
          "score": 2,
          "content": "Thanks! I appreciate all the good vibes I can get!",
          "id": 28,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA - pay your bills.  Is it possible you two could meet at the gym to chat without the whole family being involved?",
      "id": 29,
      "comments": [
        {
          "score": 6,
          "content": "Yeah, it’s possible. Maybe this is what I should do? Just gym stalk him?",
          "id": 30,
          "comments": [
            {
              "score": 3,
              "content": "Maybe not stalk, but send the money and then run into him at least once to see if you two can talk for a minute.  Just ask him if he would like to work out together once in a while.  FYI - sorry you can’t have time with your family.  That’s messed up.",
              "id": 31,
              "comments": [
                {
                  "score": 1,
                  "content": "Thanks. I think I might try this.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA, what the heck is wrong with some of y’all ?\n\nYou clearly just want a relationship with your family and aren’t  sure how best to do so. Previously it was via dropping off the money monthly. Then suddenly they change up the rules on you and don’t allow that? For everyone saying she should pay, she should, but she’s clearly been trying to for months now (and has shown the desire/willingness to do so). \n\nI’m so sorry you’ve been cut out even more so than what you’ve been dealing with over the past few years. No one else is making any efforts to maintain the relationship and figure out ways to keep it happening. You’re clearly trying your best, and it really sucks, but it shows just how much you care for your family. It sounds like the gym was a good first step, just keep at it, using payment as an excuse to see your dad again.",
      "id": 33,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA your family is terrible brain washed nutters",
      "id": 34,
      "comments": [
        {
          "score": 1,
          "content": "Has nothing to do with being a responsible adult.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}