{
  "post content": "My BIL (married to my sister) is a general contractor. About 10 years ago, my dad and brother was building a deck at my parent’s home. They asked my BIL if they could borrow his skid loader but he said no. They prepared the ground as best they could without the skid loader but got to the point they couldn’t go on without it. They went to my sis’s house to ask again but found out BIL went out of town. They talked my sis into letting them borrow it so she took them down to his construction lot and they hooked it up to dad’s truck. \n\nThis next part I’m not sure of since I don’t know much about towing but from what I was told, dad’s truck wasn’t big enough or powerful enough to tow the skid loader on the dump trailer so he lost control and wrecked. The truck, trailer, and skid loader was totaled. The insurance was barely enough to cover the medical costs and the truck. There was none left over to cover BIL’s stuff. When he got back to town, he exploded. He threaten to sue and things just went downhill from there. My parents are not rich and he wouldn’t have gotten anything so in the end, sis talked him into letting it go. \n\nHowever, from that day on he wouldn’t have anything to do with our family. He doesn’t come for birthdays, holidays, nothing at all. Next month is our parent’s 50th anniversary and we’re planning a big family gathering to celebrate. We’re also chipping in to send our parents on a cruise to Mexico because they’ve never been out of the country. I spoke to sis about it the other day and she said she’s coming with the kids but BIL is not coming. I was fine with that but when we were discussing their portion of the cruise money, I heard him yelling in the background to deduct their portion from the cost of the skid loader and dump trailer. That pissed me if so after my call with sis, I called BIL and told him to get over himself. I told Dad and bro made a mistake but that was 10 years ago and he needs to let it go. He said he’ll let out go when they give him the money he lost. I told him he’s an ass for holding on to a grudge and putting money in the way of a family relationship. \n\nSis called me a few minutes ago and said they’re not coming and that I was out of line. We argued for a bit and that’s where it stands. \n\nI don’t think I’m wrong for telling him to let go of the past but they’re not coming to the anniversary party so now I’m not sure.\n\nAnswers to your questions:\n\nLet’s get something straight. My dad and brother are not bad people. They are good people who made a mistake. They couldn’t pay back BIL because he wanted almost $70,000 and again, we’re not rich. Dad had to buy another truck because he needed it to go to work.\n\nOn the other hand, BIL had 3 other sets of skid loaders and dump trailers on his lot that day so he could take the financial hit while my parents would be homeless. BIL and sis are way better off then the rest of us so while I understand your reasoning of paying BIL back, he doesn’t need it.\n\nThe cruise to Mexico isn’t some millionaire trip. The total cost is about $3,000 and it’ll take over 20 people to pay for that. Again, we’re not rich. We can barely cover $3,000 spread out over 20 people so there’s no way we can pay $70,000.",
  "id": 1,
  "comments": [
    {
      "score": 54893,
      "content": "YTA. Your family stole $50k+ in work equipment from your BIL. They didn’t pay him back, by the sounds of it, showed zero remorse, and he should just “get over it”? You and your family sound massively entitled, your BIL is smart to cut the lot of you clean off.",
      "id": 2,
      "comments": [
        {
          "score": 13629,
          "content": "Not just that, I'm actually surprised insurance paid out anything. In the UK this would be an at fault claim, and more likely than not outside the scope of insurance because they were towing beyond their vehicle limit.\n\nParents should be grateful all he's done is ignore them - I would've sued. Courts (again in the UK) set up payment plans, so their relative lack of wealth wouldn't be a major issue. Beyond that, I would've also reported it stolen.\n\nTo be fair about this though, the sister shouldn't have let them have it against his wishes - it wasn't her stuff to share. He should be pissed off at her as well. Can't have a successful relationship if you're not on the same page",
          "id": 3,
          "comments": [
            {
              "score": 5435,
              "content": "In the UK BiL could have claimed off his own insurance by reporting the theft, as long as his wife has no authorisation within the company to loan out equipment. Of course, this could have lead to the prosecution of his wife and her family for the theft and result in a criminal record, prison sentence etc.",
              "id": 4,
              "comments": [
                {
                  "score": 3673,
                  "content": ">Of course, this could have lead to the prosecution of his wife and her family for the theft and result in a criminal record, prison sentence etc.\n\nWhich they would have deserved. He should have reported it to the police. \n\nI am suprised he didn't divorce OP's sister, especially because only he went no contact with FIL and BIL, his wife didn't and she even expected him to let it go and not try to get compensation for his destroyed stuff. Sister knew he previously said no and that those are his work equipments so she has absolutely no right to go anywhere near them, let anyone near them. \n\nAnd now they were talking about OP's sister's family giving money to the parents after how much they already cost to her husband, his family and company. OP's family has no right to ask sister and her husband for cash at all. YTA OP's family is full of entitled assholes: OP, OP's father, OP's brother, OP's sister",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3997,
                      "content": "First, I highly doubt that they didn’t know BIL was out of town when they just happened to decide to go to his house and ask him again. \n\nSecond, OP says they “talked my sister into” letting them borrow it. I have a feeling that there was a lot of guilt tripping, a lot of “faaaaaamily” kind of talk (especially given OP’s use of “I can’t believe you’d let a 10 year old grudge get between *faaaamily*), and a lot of “just trust us, it’ll be quick and hubs will never even need to know.”\n\nI also have a feeling that BIL forgave his wife because this incident finally opened her eyes to her families manipulation tactics.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 588,
                      "content": "Judging by op. I would say that the sister is easily bullied by this family. When I was first married my wife was a push over with her family. It was a weakness. After 10years of encouragement from me. She stands up for herself a lot better. \n\nThe fact the sister is not cing and told the brother off is a good sign thos is similar.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 165,
                      "content": "BIL may not have divorced op's sister, but I imagine he didn't let her forget about her part in that fiasco.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I don't get why the father and brother didn't just go to an equipment rental place.  Why try to steal it from the BIL?\nEntitled I guess.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 357,
                  "content": "They absolutely have to file a police report for the insurance. All things considered I would have happily reported it to the police. That's my property, I said no, and they took it anyways after bugging spouse who had no authority to lend it out.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Perhaps he didn’t want to get his wife charged as an accomplice? \n\nShe has the most legal exposure as the others got her permission and she gave them access",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Oh, that was my point and I completely forgot to put it in my post that he would need a crime number to claim on insurance in the case of theft. It was only “could” because not all cases are prosecuted by the CPS.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 193,
                  "content": "[removed]",
                  "id": 13,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Given this makes no sense as a reply I'm going to call u/Grand_Slip_8221 a comment stealing bot",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 834,
              "content": "I’m leaving open the possibility that they lied to the sister since it would be consistent with the morality level exercised.",
              "id": 15,
              "comments": [
                {
                  "score": 164,
                  "content": "Possibly - but I find it difficult to believe he wouldn't have told her \"your parents asked to borrow it, had to say no because xyz\"",
                  "id": 16,
                  "comments": [
                    {
                      "score": 261,
                      "content": "Likely she showed some remorse and apologized for her mistake. It doesn't feel like the parents and the brother did it. And it wasn't her who wrecked his stuff and likely she assumed her father and brother know what they were doing and everything would stay in working order. So considering all that her husband likely had more reasons to forgive her than them.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "At the same time, who would think someone would  still take what they already said “no” to?",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "He was out of town, she might not have even checked their story with him.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Not if he had assumed them to be trustworthy.  It could be possible that they asked, he said no, and thought that was the end of it.  He didn't think they'd try to steal it...  He learned a valuable lesson. \"Trust, but verify,\".",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "It's quite likely that, being a reasonable person, he thought the matter was settled, and didn't make a big point of it. They then come at her with lies when he's away...people can be very trusting with family.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Just based on OP's general attitude, they probably just showed up, steamrolled over all her objections and took the trailer.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Or even if there wasn’t an outright lie, maybe she didn’t understand why BIL said no. Like, maybe *BIL knew* they didn’t know how to use it, couldn’t safely tow it, and that it was extremely expensive… but maybe she didn’t know that much about it, if it’s not her job. \n\nSo then her dad shows up and either omits or glosses over the previous rejection, and assures her that he knows what he’s doing and will bring it back “good as new,” she might not think to question it. And BIL realized that’s what happened and was able to forgive her, because while she definitely screwed up, she probably didn’t know how badly she screwed up.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "I can't believe they took the money for the their truck rather than go without a replacement and attempt to make BIL whole.    \n     \nThis family is ass.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "It’s super interesting that insurance paid for the Dad’s truck but there “wasn’t enough left for the skid loader.”\n\nDad didn’t even try to make it right.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "*The insurance was barely enough to cover the medical costs and the truck. There was none left over to cover BIL’s stuff.* \n\n&#x200B;\n\nThis is the part I really love - they got an insurance payout, but they covered their own losses first.   The equipment they borrowed without permission (stole)  should have been replaced first.    No remorse, no accountability - just screw you, get over it.   Then they have the nerve to flaunt their spending on a cruise.  I don't blame BIL for that, I'd be pissed too.    \n\n\nI feel so sorry for BIL, married into a family of users and takers.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And it's not just the loss of the equipment. The BIL is a contractor. He likely had jobs lined up for which he needed that equipment. He probably either lost work, or lost serious money because he had to now rent equipment that he previously owned. Owning that equipment would have been factored into his bids for any work, not renting it from a 3rd party.\n\nIf I was the BIL, I'd still be pissed 10 years later *even if they'd made it right, financially.* The fact that they got insurance money for the truck, but kept that money and told the BIL to pound sand and \"get over it\"? Yeah, I wouldn't have anything to do with them either.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "[deleted]",
              "id": 28,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "And they kept  the insurance money rather than giving it to cover the cost of the equipment. This whole family- YTA",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I highly suspect the father and brother bullied her (and probably intentionally waited until the BIL was out of town).  AGREED BIL could have sued and made the rest of their lives miserable.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I don't understand why they haven't tried to repay him - you break it, you pay. IF they want to rebuild the relationship, you show contrition, and you can do that by *paying them back.* It might take a decade but they need to try it!",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2771,
          "content": "The biggest surprise here is that he stayed married to OP's sister.  YTA",
          "id": 32,
          "comments": [
            {
              "score": 906,
              "content": "Yes, very curious about that dynamic since she wound up allowing it behind his back! That whole family is YTA",
              "id": 33,
              "comments": [
                {
                  "score": 1472,
                  "content": "I suspect the husband realises the extended family is manipulative AF and knew his wife was stuck between a rock and a hard place so forgave her.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 1201,
                      "content": "Given how readily she told them she wasn’t coming, it sounds like she learned a lot from the experience too.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 370,
                      "content": "I had that same thought - there's a big difference between \"she said sure thing right away\" and \"they talked her into it.\" Talking someone into something could mean anything from a puppy-eyed guilt trip to a blackmail threat to a two-hour lecture. If the sister was the one that convinced him not to sue, chances are she's used to playing peacemaker.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 853,
                  "content": "I think the sis somewhat learned her lesson since she decided to side with her husband this time instead of her family.\n\nOP, YTA. And your father and your brother. \n\nYou don't mess with someone else's stuff that costs thousands of dollars AND his livelihood that brings food, shelter, and necessities to YOUR SISTER AND HER FAMILY. And then have the audacity to ASK FOR MORE MONEY for a non-necessity? Just imagine it happened to you instead of your BIL, I wonder how you would feel.\n\nETA\n\nAfter reading OP's update on BIL being well off... OMG.\n\nOP YTA YTA YTA YTA YTA YTA YTA MASSIVELY YTA\n\nYou yourself said YOUR DAD AND BROTHER MADE A MISTAKE. What in the heck did they do to try and make it right to your BIL? Your dad needs a truck to go to work? He should have bought a cheaper car or taken public transport while trying to pay off your BIL. Obviously, BIL seems reasonable, he didn't push through with his lawsuit, so he won't allow your family to be homeless. But he is allowed to be compensated for something your FAMILY STOLE AND DESTROYED. And this happened 10 YEARS AGO? And not a single cent? \n\n\"He doesn't need it\" is exactly how thieves think. Let that sink in. Whether he needs it or not, your family is obligated to MAKE THINGS RIGHT. FFS. You know what's sad? I think if BIL saw your family showed remorse and did everything they could to make it right, your BIL may have forgiven this by now.\n\nYou'd be lucky if your sister and her family still want a relationship with you lot. In fact, I hope she goes NC because your family sounds tremendously awful. I wouldn't be surprised if your family didn't even apologize.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 32,
                      "content": "TENS of thousands!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I cannot believe how OP's family had no consideration for their own daughter. Depending on the size of the BIL's business this could have put his business  under or having to file for bankruptcy. \n\nOP, YTA off the charts. Your dad and brother have zero respect for your sister. Disgusting is the word that summarizes your Parents, brother, and you in this whole story.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "bUt fAmILY!",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Exactly! OP goes on about BIL being well off...gimme a break, he worked for it! That equipment helped him get to that point! He'll he might have still been making payments on it (or his company) you know how dis heartening it is to have to make payments on something you no longer have, especially through no fault of your own? BIL had every right to be pissed!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Honestly she might not have known.  They asked BIL who said no, then when he was out of town turned up and asked sister to help.  There wasn't really a compelling reason for him to go oh your dad asked for x to say no, so if they came to her and acted like they had permission \"We need to use this and talked to BIL last week, but then when we called him back to pick it up we realised he was out of town.....\"",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "To be fair:\n\n>I told him he’s an ass for holding on to a grudge and putting money in the way of a family relationship.  \n>  \n>Sis called me a few minutes ago and said they’re not coming and that I was out of line.\n\nSeems OP's sister had her husband's back, which is really great. I think that the sister allowing the dad to take the tractor in the first place probably just boils down to a manipulative dad and a daughter who is probably not great at saying no. I would give her the benefit of the doubt here.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I'd go with them browbeating the sister until she gave up.  From the way that the OP writes, I'd say that they feel that's how to argue with someone.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2138,
          "content": "Not just that, but they nicely washed their hands off their own misdeed and haven't bothered paying a single cent back in 10 years. I understand they are poor, but that doesn't diminish a sense of responsibility. Instead of pitching in for a bloody cruise, they should all be pitching in to pay the BIL back and try to fix the relationship that they broke\n\nEdit to add judgement YTA, and so are OP's father and brother and anyone else who enables their attitude.",
          "id": 45,
          "comments": [
            {
              "score": 946,
              "content": "And what got me is: they used the assurance to pay for medical expanses (legit) and the truck?! Why the heck wouldn't they pay him back first??",
              "id": 46,
              "comments": [
                {
                  "score": 1020,
                  "content": "The medical expenses I can understand, but using that money to buy another truck instead of paying for the property that they damaged? Bunch of AH",
                  "id": 47,
                  "comments": [
                    {
                      "score": 503,
                      "content": "BuT tHe TrUcK iS mY fAtHeRs LiVliHoOd 🙄\n\nETA these edits are priceless and didn’t exist when I made my original comment 👀",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 333,
                      "content": "These are people for whom \"Family first!\" is a one way transaction. If I'd fucked over a family member through my own actions like this, you can bet I'd be eating bologne sandwiches and store brand cereal until I could make it right.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "> dad’s truck wasn’t big enough or powerful enough to tow the skid loader on the dump trailer so he lost control and wrecked\n\nYou slightly wonder if the only lesson they took from the crash is that the dad needs a *bigger* truck for towing stuff",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I found that absolutely wild too.  \n\nHe’s so casually breezes by the fact that obviously they replaced their own very expensive item that they ruined, so they couldn’t afford to replace the very expensive item they stole and broke.  \n\nWhat? The? Fuck? \n\nAnd now they’re going on an expensive vacation with still no talk of replaying him? \n\nOP seems to be under the very strange impression that if you owe someone $50k, and you can’t pay them back right away (partially because you’ve decided to buy yourself a new truck!) you just get to decide you don’t owe them 50 K anymore.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Because then they would have to admit that they were at fault.  Chances are, they blamed the BIL for having equipment that was too heavy for them to tow.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Because then they wouldn’t have a truck? Duh.\n\nYTA and why the hell are you all chipping in for a cruise? Chip in to pay back your BIL.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": ">I understand they are poor\n\nSo poor they could afford to build a new deck and go on a cruise.  I wish I were that poor.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right, they haven't bothered paying a single cent back, and as far as I could understand from the post, they haven't even apologised. It was his wife who talked him out of suing...",
              "id": 55,
              "comments": [
                {
                  "score": 9,
                  "content": ">they haven't even apologised\n\nAn apology would be an acnowledgment that they were in the wrong and have a moral responsibility to pay him back. I would guess they have been blaming him for not letting them use it in the first place, so it's his fault because it only got broken because he wasn't there to transport it safely, so they were forced into going behind his back.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 957,
          "content": "In my experience, when people tell you to “get over it” that’s a pretty good indicator that they were in the wrong, but don’t think there should be any consequences and are angry that you actually want to hold them accountable. OP and the rest of her family are definitely AHs.",
          "id": 57,
          "comments": [
            {
              "score": 38,
              "content": "Yea! How would OP feel if BIL came by, stole her car, and then wrecked it? Would saying \"Just get over it\" suffice in that instance?",
              "id": 58,
              "comments": [
                {
                  "score": 12,
                  "content": "No, BIL would have to pay OP because family comes first.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "And the total lack of apologies/contrition just completes that pic. The asshole's version of \"I'm sorry\" is \"Get over it already\".",
              "id": 60,
              "comments": [
                {
                  "score": 14,
                  "content": "Not even of \"I'm sorry\", that's too generous. It's more like \"I know I was in the wrong, but no way I'll ever admit it\". I wonder what the marriage of sister and BIL was like when it just happened, he must have blamed her as well (and rightly so). OP should have stayed out of it. I hold lifelong grudges for less than loss of my livelihood. Imagine telling your children \"you can't go to college because I had to use the savings for your funds to buy a new machine that grandpa destroyed because he was too stubborn to ask me to do it\". Even renting proper equipment to drive the machine around was too much to ask.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "This. OP, your family stole a value piece of equipment, wrecked it, and in the decade since have done nothing to make good on that unacceptable behavior. I wouldn’t associate with you either, and I wonder how the family has constructed a worldview in which the person who was robbed and had his livelihood messed with is somehow in the wrong. YTA (and so are your parents and brother).",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": ">In my experience, when people tell you to “get over it” that’s a pretty good indicator that they were in the wrong, but don’t think there should be any consequences\n\nThat's a really good point. I'm a fan of reconciliation in general, but in situations like this, holding a grudge is justified. Actually, it's not even a 'grudge'. It's a legitimate reason to cut someone out of your life. BIL used that equipment for his job, and they haven't done anything to pay him back for that? And I'm willing to bet he said no in the first place because they wouldn't use it properly.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 928,
          "content": "OP only cares now because they’re trying to get money out of BIL. OP you your family are AH. YTA",
          "id": 64,
          "comments": [
            {
              "score": 105,
              "content": "How shameless to ask even for money from a person who literally never showed his butt in last 10 years to OP and their family!",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Exactly.  OP literally couldn't care less than BIL wasn't joining them on the vacation.  The concern only kicked in once OP found out that he wasn't giving them money.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 894,
          "content": ">YTA. Your family stole $50k+ in work equipment from your BIL. They didn’t pay him back, by the sounds of it, showed zero remorse, \n\n100 This, but it seem worse.\n\n>They talked my sis into letting them borrow it so she took them down to **his construction lot** and they hooked it up to dad’s truck\n\nSounds like he ran a construction company, so they may have also coated he more in missed/delayed jobs till be could get replacements.",
          "id": 67,
          "comments": [
            {
              "score": 515,
              "content": "Exactly this, they stole his very expensive work equipment (not a mistake, btw. You're really downplaying what they did.), wrecked it, never paid for it and cost him work and more money probably, and now want him to pay for a cruise?",
              "id": 68,
              "comments": [
                {
                  "score": 91,
                  "content": "Given the cost of construction equipment, and then fact that they went on to the lot to take it, they are looking not just at grand theft, but burglary charges (trespassing with intent to commit a felony).",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "They kept money for their truck. They should have gave him all the money. Not sure how I feel about the medical bills. I would think they could make payments. They absolutely should have paid him!!!! The BIL is NOT TA.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 228,
              "content": "Grew up in farming country.  So, lots of massively expensive tractors and the like.\n\nKnew a person who threw a party, and some guys decided to take the new tractor for a spin.  like, a 100k tractor.\n\nI forget how, but they fucked it up.  Yeah, parents sued their asses off.\n\nAlso had a case near here where people at a party were fucking with a skid-loader, and ran over another guy.  Charges were laid.",
              "id": 71,
              "comments": [
                {
                  "score": 14,
                  "content": "Is there even such a thing as a tractor that isn't massively expensive?",
                  "id": 72,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Nope.\n\nBut I've found that a lot of people, who didn't grow up in rural areas, have no idea just how much a tractor or combine costs.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 173,
              "content": "The homedepot charges 250 a day to rent a cat. They will also drop off and pick up for 50 to 100.",
              "id": 74,
              "comments": [
                {
                  "score": 32,
                  "content": "Honestly; a lot cheaper than I thought",
                  "id": 75,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Ya its not bad at all. Thats just home depot im sure you could find a better deal with a smaller local rental place.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "That's what I did when I put in the deck at my house. Rented. If you can't afford to rent you really can't afford to put in the deck either. Cheap ass people.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Yeah I noticed that too. The only thing I can imagine is that OP's BIL has a very successful construction company and might have had more equipment to cover whatever his immediate needs were. It might also be why he didn't bother suing because his wife's involvement made things messy and he had other means of getting jobs done. He also might be much wealthier than the rest of the family and they think $60,000 is just play money to him. I still can't understand why OP and their family aren't absolutely broken with shame and guilt for what they did. I'm frankly stunned at the audacity of OP shaking down their BIL for for money for a fucking cruise. No doubt the amount requested was way more then the actual pricetag because they feel entitled to his money as well.\n\nIt takes a special kind of conceit to request treats, cakes and coins as a prize for commiting multiple felonies.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 804,
          "content": "I can’t get over how OP and the rest of the family, over 10 years, never once considered they should try to pay the BIL back. That’s an insanely expensive ‘mistake’ and I’d do everything to correct it, not ever say “it’s been X amount of time just get over it.” Such a sad situation for that BIL.",
          "id": 80,
          "comments": [
            {
              "score": 327,
              "content": "Seriously. I owed a friend $1500 for about a year longer than I originally intended and it ate me up every day until I was finally able to get him the money (plus some for being so patient). I can’t imagine the empty shell of a human you would have to be to basically steal 50k from fucking family and expect them to just “get over it”",
              "id": 81,
              "comments": [
                {
                  "score": 34,
                  "content": "Reminds me of a Kitchen Nightmares episode where the dad had stolen his son's inheritance for his restaurant, and he seemed nonplussed that Gordon Ramsay kept bringing it up.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "For real. I'm currently unemployed and actively throwing resumes at jobs like a monkey flinging poo at the zoo. A friend GAVE me $100 bc she got a really great bonus from a recent job she did. Bet your ass when I'm working again she's getting that back times 2 for helping me so graciously when I needed it. And that's a gift not a loan or a bill for a fuckup I made. I couldn't imagine putting somebody out $70k and not at least TRYING to pay it back!",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Not only that but actually asked BIL to give THEM money for the cruise..",
              "id": 84,
              "comments": [
                {
                  "score": 20,
                  "content": "Yes that’s the cherry on top of it all. \n\nThey destroyed his expensive equipment. \nThey never pay him back. \nHe essentially goes NC with them. \nAND they are asking him and his wife for holiday money. \n\nThe audacity. \n\nJust get over it, yeah right.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "At $500 a month, he would almost be paid off now.\n\nWhat a shitty family. YTA and so are your parents.\n\nHow about they give him mortgage on the house for the $50,000. And how about shitty OP starts contributing to paying him back.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "And the fact that they’re all pooling together money now to give to the parents, and they actually expect one single cent to come from the brother-in-law’s combined household income is so twisted. These people are straight up delusional. That is a level of entitlement that is literally a delusion",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I understand being poor, but these people haven't even tried to pay back even part of the loss that they caused.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 387,
          "content": "Yep exactly. Replacing the equipment comes first. *Then* forgiveness. Op, I guess you’re an AH for not getting that, but the major AH:s are your dad and brother for apparently not spending some time these ten years paying back the man for what they broke.",
          "id": 89,
          "comments": [
            {
              "score": 34,
              "content": "AND for not accepting his answer of No can’t use it!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Right?? You would think they would have paid him back over a decade but nope. It sounds like they havent even tried. Probably ten years of them convincing themselves they didnt do something shitty and dont need to make amends.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "That's what makes it super shitty, in my eyes. I get it, money is tight and it is what it is. But damn get on a payment plan with this man, you've had 10 years!! I wouldn't be able to live with myself if I trashed someone else's property. They'd be getting $x/mo, whatever I could possibly spare, to get them paid back. At least make an effort, ffs!",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 317,
          "content": "Seriously I can't believe they decided to go on a cruise without paying BIL some money back. I would feel extremely guilty for such a huge fuckup. I would make sure to pay back at least half of the expenses before I start spending money on fun time.\n\nYTA OP",
          "id": 93,
          "comments": [
            {
              "score": 15,
              "content": "Right?  I have done some stupid stuff in my day, probably will again, as I am human.  I once destroyed a bathroom sink at a house party (drunk and clumsy, while getting sick from too many drinks).\n\nI have always felt terrible after, and made sure to find a way to pay for what I broke.  And above all, I am apologizing up and down the entire time.  I would be incredibly embarrassed... Instead, OP, his father, and his brother are just embarrassments.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 251,
          "content": "50k??? omg i thought BIL was being petty but jesus that is a lot of money",
          "id": 95,
          "comments": [
            {
              "score": 630,
              "content": "I own a construction company, a new skid steer is $45-75k or more depending on the size. I don't know if they also stole the dump trailer, or how big that was, but a new dump trailer runs me anywhere from $10-20k. On top of that if the BIL was short a needed piece of equipment, he'd likely have to rent one, for potentially thousands more dollars depending on how long it took him to get a new one. $50k is likely on the low end of what they actually cost BIL.",
              "id": 96,
              "comments": [
                {
                  "score": 165,
                  "content": "I have friends with heavy equipment that would let me borrow pretty much anything I can haul myself.  However I don't ask - because if I screw up and break something I'll be on the hook to repair or replace it, and that's not a position I want to put myself or them and their business in.  Instead, I just rent the equipment and pay the damage insurance.  Sure it may cost me a few hundred for a day or two, but the chance of it costing me tens of thousands and a lost friendship is zero.  \n\n\nETA: One of those friends purchased a new Deere 330 two months ago.  I think he said he was $85k into it by the time he put on a bucket and set of pallet forks.",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "That last bit, about screwing him over for contracted jobs in the short term is a GREAT point.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Exactly. That’s the kind of hit that could put you out of business quickly .",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "This exactly! My BF works for a company that sells and rents construction equipment like this and Ma’am you are 100% correct.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 14,
                      "content": "\\*Ma'am, but thanks. ;)",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My brother has a 100000+ dollar cat skid loader. What asshats. Yta dude",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19230,
      "content": "YTA.\n\nSo are your parents.\n\nThey shouldn't have stolen his property (and yes, it was theft).\n\nThey should have made him whole before replacing their own property. \n\nThey should have apologised.\n\nThey should have given him the money back at some point over the last 10 years.\n\n(Would have considered e s h if your parents had made any effort to take responsibility.)",
      "id": 103,
      "comments": [
        {
          "score": 3922,
          "content": "It's pretty straightforward, I already knew in kindergarten not to break someone else's stuff, and a skidloader is probably a very integral part of his bil's job 1nd costs like 100k. Most businesses go down if they lose 100k all at once...",
          "id": 104,
          "comments": [
            {
              "score": 1594,
              "content": "My motto: you break it, you pay it.\nFunny, no one wants to borrow from me, after I said that.",
              "id": 105,
              "comments": [
                {
                  "score": 292,
                  "content": "Right! It’s pretty interesting how people respect property more when they have to pay for it.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I am learning to say yeah the deposit is (replacement value).  If it's not returned in good working order by (date) at your cost. The deposit will be used to replace it.\n\nThey usually say\n\n' ohh but I can rent it for so much.':  yes I know, but I am not charging you to rent, if you don't return it, or if it's broken I will use the deposit to replace it. Other than that I am not charging you anything.\n\n'but nothing will happen to it': then you get your deposit back.\n\n'I don't have the cash': I can't fix/replace this with trust.\n\n'What about the interest': that's my reward and it's tiny for being put off.\n\n'you are not a true friend': I am generous with this offer, if you are upset with me for letting you know the terms you are right we shouldn't be friends, friends don't use friends they respect them.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "this is a pretty common policy.... you return stuff you borrowed in the same condition, or you replace it. that is just common curtesy",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I always assumed that was the universal rule. I would replace/fix anything I broke.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "My dad once taught me a great lesson. He borrowed a friend's roto-tiller and it broke. It wasn't dad's fault, he didn't abuse it but he told me that he needed to go get his friend a new tiller. His friend insisted that it was old and dad didn't need to replace it. But dad insisted; he broke it and was responsible for it. It was the sort of thing that made me REALLY respect my dad.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Omg I had this conversation on a book sub where this girl destroyed her friends book by dropping it in the tub and didn’t replace it. The amount of people in the comments saying you should only ask if you should replace it. Like what? No, you immediately go and replace it. Even if the friend is like no it’s okay don’t worry about it.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 668,
              "content": "BIL should have reported it to the police as theft (which is what it was) so his business insurance would cover the cost of replacement. In my mind he's a damn saint for not doing so.",
              "id": 112,
              "comments": [
                {
                  "score": 274,
                  "content": "Only issue is he would have to prosecute his wife as well, or risk insurance company coming after him for insurance fraud. And we don't know what went on behind closed doors at their house, but he may not have been willing to have his wife charged.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Oh for sure. I can imagine the guilt the wife must have felt must've been soul destroying after BiL has presumably worked very hard to get to where he is and own the equipment he has. \n\nA momentary lapse from undoubted guilt tripping from ops parents could've ruined absolutely everything for them. \n\nGlad they survived through it all. And op, you and your family bar the sister are the arsehole of arseholes.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Damn, I would NOT want to be in a situation where the decision whether to charge my wife with a crime is a *financial calculus.*\n\nI mean, surely that’s what it came down to—100K vs [the price of a lawyer plus possible fines plus any effect on *her* earning potential a conviction would have]. What a horrible marital conversation to have. I’d cut ties with in-laws just for making me go through THAT experience, never mind the extra terribleness of the lack of remorse, refusal to compensate, talk of raising money to send them abroad, etc.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yup, this is exactly why you shouldn't really mix business with family imo",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 885,
          "content": "Absolutely! The first repayment should have been to the BIL for his damaged property which they were told they could not borrow! \n\nYTA YTA YTA\n\nI absolutely would not get over this either until I had been repaid.",
          "id": 117,
          "comments": [
            {
              "score": 36,
              "content": "Any amount, no matter how small, would have probably gone a long way in trying to atone for this. But if even if they were truly unable to pay him back a penny, I’d be willing to bet that a sincere apology acknowledging that they were wrong and regretted what they did, might have meant even more.",
              "id": 118,
              "comments": [
                {
                  "score": 14,
                  "content": "I’ve held grudges longer than a decade for $50, there’s no way I’m letting go of a 50k+ grudge. OP sounds like an entitled little worm.",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 550,
          "content": "Yup; ten years is plenty of time to try to make it right. Now they expect him to just forget about it and help pay for *their* vacation? \n\nAwful folks.",
          "id": 120,
          "comments": [
            {
              "score": 33,
              "content": "Those ppl sounds so financially and emotionay abusive, it's crazy. I hope BIL gets all the money back or a miracle happens for him.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This is what's getting me, maybe instead of all chipping in for a holiday they should be chipping in to pay BIL back...",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 528,
          "content": "Right. Replacing BIL equipment should have come BEFORE replacing dads truck. Might not have covered all his damages but at least make an effort.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 386,
          "content": "Right, the fact that they replaced their own truck before giving the SIL any money back speaks volumes.",
          "id": 124,
          "comments": [
            {
              "score": 27,
              "content": "I had something similar happen on a smaller scale once. A friend kept borrowing my bike to get to work. Bike got stolen because he wasn’t locking it up. Since he didn’t have. A bike to borrow anymore, he went and bought himself a new bike. (This was back when I was poor so a bike was a big deal back then).",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 255,
          "content": ">They shouldn't have stolen his property (and yes, it was theft).  \n>  \n>They should have made him whole before replacing their own property.\n\nThis. BIL was already very, very generous in not reporting them to the police for theft, and now he's supposed to not only get over the massive loss they caused him, but also to chip in for a cruise? OP is insane.",
          "id": 126,
          "comments": [
            {
              "score": 12,
              "content": "[deleted]",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "With a trailer and bobcat it’s easily *felony* theft. Then there’s all the laws they probably broke while driving it.",
          "id": 128,
          "comments": [
            {
              "score": 35,
              "content": "Oh, most definitely. Here in NY, it's $1000 to hit felony level. The trailer alone was worth more than that if it was up for hauling a skid loader. I have no idea what the loader would be worth, but that whole family should be praising the ground that BIL walks on for not pressing charges.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "BIL was magnanimous for not charging them with theft.",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "With a proper payment plan split between dad and brother they could have paid him back by now and that should have been the first thing they did instead of telling him he was SOL.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "And best part is the parents are going on a cruise, instead of paying back $30k worth of damages. Not rich but rich enough to go on a vacation and not pay back BIL.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13829,
      "content": "So your parents stole a very expensive piece of equipment, broke it, didn’t pay him back, and now you’re asking him for money to send these people on a cruise? Did I get that right?",
      "id": 133,
      "comments": [
        {
          "score": 4196,
          "content": "And you forgot the OP told him to get over himself!\n\nSuch entitlement",
          "id": 134,
          "comments": [
            {
              "score": 663,
              "content": "Yes! And considering that equipment may have been used for the BIL to make a living too makes OP a gigantic AH.",
              "id": 135,
              "comments": [
                {
                  "score": 39,
                  "content": "What does the OP care?!",
                  "id": 136,
                  "comments": [
                    {
                      "score": 61,
                      "content": "He clearly does not. That kind of stuff can destroy a marriage. Who TF cares if your thieving lying father has never been out of the US? That is a you problem, not a we problem. People that have never had a large monetary loss fail to understand the impact they have on the one on the losing end.\n\nThey deserve to go on vacation to the nearest tourist town in driving distance.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I hadn’t even thought of that. It’s $70k plus the thousands of dollars the machine would have potentially made him as well, so overall they cost his business well over $100k",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "OP and his family are among the worst kind of people in this world",
              "id": 139,
              "comments": [
                {
                  "score": 23,
                  "content": "You can see it runs in the family\n\nI don’t blame the BIL for having nothing to do with them, actually surprised he hasn’t divorced the sister as she was an accomplice to this shitshow",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "And also don't forget that nowhere in the post was there any mention of apologies or feeling bad for their actions.",
              "id": 141,
              "comments": [
                {
                  "score": 13,
                  "content": "Why would they feel bad?\n\nAgain - the entitlement \n\nZero f*cks given",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "OP couldn’t even say how they could have been TA when responding to the bot, they just summed up the post.",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "BuT hE’s RiCh hE DoEsn’T nEeD tHem! The money or the equipment!",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "[deleted]",
              "id": 145,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1128,
          "content": "Yep. That about sums it up. I am seething after reading this post. I can smell OP’s entitlement through my screen. \n\nMy dad owned a successful heavy machinery business for 35+ years. Back when I was in elementary school, he also did heavy machinery rentals. There’s a reason he only did rentals for two years. Even when my dad did everything right in terms of screening renters, having air-tight liability waivers, etc, it was a stressful, logistical nightmare. Even as a kid, I was aware of how stressed out and worried my dad was all the time when his machines were out there and how relieved he was every time he got them back. \n\nTaking the cost of the actual machine out of the equation, operating skid loaders or other heavy machinery can be extremely dangerous. \n\nOP, your BIL didn’t say no back then just to be petty. It was a massive liability for him and his business and he didn’t want to risk it. Your father and brother are actually terrible people for going behind his back to steal it. And guess what? The second worst case scenario happened as a result. \n\nYour father and brother had zero regard for your BIL and his family’s livelihood. So by proxy, they did a terrible thing to your sister, too. The money to replace that skid loader is the least your father owes him at this point. YTA and you should be grateful your BIL never sued your father.\n\nEdit: typo\n\nEdit 2: Wow, OP. Rather than accept what you and your family did was wrong and that it still negatively impacts your family to this day, you decide to double down and try to justify the behavior. Frankly, this makes you look even worse. You clearly have a chip on your shoulder BIL has a successful business IN SPITE of what your family did. Yes, it financially hurt him. Stop lying to yourself. What your father and brother did was wrong. If they did this to anyone else, that person would have filed a police report and sued your family for damages. Do yourself a favor and try some self-reflection. You clearly need it.",
          "id": 146,
          "comments": [
            {
              "score": 439,
              "content": ">I can smell OP’s entitlement through my screen.\n\nI bet OP and their family justify not paying BIL back by saying it was his fault for not agreeing to lend them the machinery in the first place, because once he denied them, they obviously had no choice but to go behind his back",
              "id": 147,
              "comments": [
                {
                  "score": 191,
                  "content": "Ugh, that's such a disgusting way of thinking and it's probably exactly how they justify it to themselves. \"Well if BIL just brought it over with his truck, this wouldn't have ever happened.\"",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Probably think that if he had just volunteered his time to come and do the job for them (for free, at that) then none of this would be a problem.\n\nOP, YTA YTA YTA",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "seems like OP thinks since they can't afford to pay back ALL of it at once, they don't need to pay anything? which is asinine",
                  "id": 150,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "This was a potentially career-ending loss that they inflicted on him. I wouldn’t be surprised if it took him the whole ten years just to recover financially. Cannot believe the audacity of OP",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 495,
          "content": "Yes and put his livelihood at risk!\n\nThat is some serious audacity to ask him to \"chip in\" anything at all.  It would be a cold day in Hell before those idiots got a dime from me.",
          "id": 152,
          "comments": [
            {
              "score": 34,
              "content": "I'd send them an invoice for the full cost of replacing the equipment, plus interest. Then add a little deduction at the bottom as a contribution to the cruise.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 359,
          "content": "Two pieces. They fucked his bobcat and his trailer.",
          "id": 154,
          "comments": [
            {
              "score": 216,
              "content": "I work for a company that owns and has capital leases on several of these (I monitor the fixed asset accounting).  The very thought of the cost makes me queasy.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Oh, wow, I missed that one!",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "10 years of not paying him back 😱",
          "id": 157,
          "comments": [
            {
              "score": 12,
              "content": "but they can't afford 70k *right now*, there'd be nooooo point at alllll to give him just *some* of the money (/s)",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11729,
      "content": "> I told him he’s an ass for holding on to a grudge and putting money in the way of a family relationship.\n\nIsn't that what your dad and brother and you did?\n\n&#x200B;\n\nYTA. And your dad. And your brother. So y'all have the funds to pay for an expensive cruise, but a decade later can't pay him back\n\n Your family fucked with his livelihood and clearly don't give a flying fuck how it has impacted him, so why should he want to be around you?",
      "id": 159,
      "comments": [
        {
          "score": 2654,
          "content": "Yup. Your whole family’s the AH. Chip in to reimburse this man then you can talk about forgiving a 10 year old debt of this magnitude. Edited to add YTA",
          "id": 160,
          "comments": [
            {
              "score": 1777,
              "content": "Imagine having the AUDACITY to even think of asking him to “chip in”. I swear to God I am in constant awe of how some adults have less common sense than a newborn.",
              "id": 161,
              "comments": [
                {
                  "score": 306,
                  "content": "This! Talk about adding insult to injury! Also, why didn't they just rent the equipment at the time, instead of stealing it from the son-in-law's  business?",
                  "id": 162,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Well thats not free",
                      "id": 163,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Not only that, but they are going to have the AUDACITY to condemn him for not chipping in for this cruise.  Like holy shit.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I could not believe it. I gasped out loud when I got the part where they *replaced their own truck* before giving this man one cent to replace the *stolen property* of his they **destroyed**, and then I literally said “what the **fuck**?!” out loud when I got to the part where OP said they have the motherfucking GALL to ask this man to give **THEM** money to send the criminal thieves on a cruise?????????\n\nThis has gotta be one of the most entitled things I’ve ever seen in my life. In. My. Life. The fact that a brother-in-law hasn’t divorced his wife at this point shocks me.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Amen!  What forgiveness? Pay ppl back for theft and destruction of property and then they can hope they're forgiven. They feel so entitled to even forgiveness without paying back, don't they? I feel so bad for BIL. I hope he gets what's he's owed or the universe creates a miracle for this man.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 413,
          "content": "> why should he want to be around you?\n\nNot just be around. OP wants him to help pay for their vacation.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 288,
          "content": "They also sound like crap contractors. What idiot starts a job they don't have the equipment to complete??",
          "id": 168,
          "comments": [
            {
              "score": 309,
              "content": "The same kind of idiot that hooks up a trailer without knowing how to tow. The same kind of idiot that doesn't just fucking rent one. The same kind of idiot that thinks any truck can tow anything. I'm sending a trend here. OP and his family are fucking idiots. And assholes to boot.",
              "id": 169,
              "comments": [
                {
                  "score": 32,
                  "content": "Also,  the kind of idiots that think they can just hop on a machine like that and use it with no training or supervision.",
                  "id": 170,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "And I guarantee this wasn’t their first careless fuck up, which is why the BIL wouldn’t lend it to them in the first place. People like this do selfish, disrespectful, and destructive stuff all time (although usually on a smaller  scale). I’m sure they’re like this about lots of stuff.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "They aren’t contractors that’s the BIL they where building they’re own deck for their own house but I’m sure that they could have asked nicely that if BIL had a free moment would he take the loader down himself and drive it then they probably could have worked something more reasonable out rather then steal it crash it and never pay it back \n\nYTA don’t fuck with someone’s lively hood and then call them an ass when they get justifiably upset",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "They weren't contractors. Only BIL was a contractor. Dad and brother were just doing a home project and likely assumed BIL would just do what they demanded.",
              "id": 173,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Came looking for this.\n\nTHEY chose not to take No for an answer.\n\nTHEY were too cheap to rent the equipment they needed.\n\nTHEY chose to pay themselves back with the insurance money instead of him.\n\nTHEY screwed with his livelihood. \n\nTHEY sounds like a horrible, toxic family who could have made BIL whole but decided not to. \n\nBIL saw them for the selfish takers they are and made a solid choice to stay away.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": ">Isn't that what your dad and brother and your did?\n\nWell, yes! But that was *their* money, so that's different! /s",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "BIL is actually a good guy for not going after them fir the theft of his equipment!",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Let's not forget it's not just BIL livelihood they messed with...I'm sure it impacted your sister and the kids they share. Ya know...since it was his business. Where he makes money. For his family.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6291,
      "content": "What’s missing from your story is where your father & brother took accountability for their truly asshole behavior that caused very real damages for another person & worked sincerely to make up for it. \n\nIf the insurance didn’t cover everyone’s damages then after necessary medical costs the skid loader should have been fixed because your BIL was the innocent party. Instead your dad put that money towards his own truck. Your BIL was extremely kind not to sue. \n\nIt’s been 10 years, so how much of the damages have your father & brother paid back? If the answer isn’t all of it then not only are they complete & utter grade A assholes but so are you. \n\nYTA in this latest chapter of the story for blaming the victim for not just rolling over & accepting his awful in-laws actual criminal behavior. \n\nGood for your sister for standing by the right person in this chapter.",
      "id": 178,
      "comments": [
        {
          "score": 2967,
          "content": "Yeah the part where there was ‘only enough money for medical expenses and the truck’ got me. NO, there was only enough money for medical expenses and the skid loader, and not enough for the truck. They essentially stole from him a second time there. And don’t seem the slightest bit remorseful. I’m guessing if they’re the kind of people who do this sort of thing, that this is probably not the only incident. (YTA)",
          "id": 179,
          "comments": [
            {
              "score": 861,
              "content": "Yeah, I have no doubt this wasn’t the only time they’ve behaved Iike this\n\nOP had the gall to accuse the BIL of putting money before family when it was the father & brother who did that. They would rather fuck over a family member in order to avoid paying for what they destroyed & thought they could get away with it by weaponizing the family relationships. And OP seems to think familial obligations are a one-way street where only the BIL needs to sacrifice. Screw. That.",
              "id": 180,
              "comments": [
                {
                  "score": 59,
                  "content": "All woven from very weak moral fiber. This is really sad but honestly makes me so angry.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "They chose money instead of family twice. Stealing the skid loader instead of paying someone to do it AND making BIL eat the cost of the ruined skid loader. Nice family y'all got their.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 459,
              "content": "There’s was probably a really good reason the BIL refused to lend it to them in the first place!",
              "id": 183,
              "comments": [
                {
                  "score": 370,
                  "content": "Well yeah for starters who the hell needs a skid loader to build a deck? \n\nThey just wanted an excuse to play with the cool toy.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 108,
                      "content": "I built a deck with a friend once and we only used the skid loader to move the rubble from the old porch never needed it for levelling they definitely just wanted to play with the cool toy",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "That was my thought.\n\nThere are very very few situations where a skid loader would be necessary for building a deck, and in those cases, DIY is probably a really bad idea.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "And building a deck is a completely unimportant home repair. If you don’t have the money don’t do it.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "A deck isn't a necessity.  A deck is a luxury.  It's nice to have but you don't really need it.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Handyman here who’s built dozens of decks. Not once have I needed a skid loader and I was very confused the whole time I was reading this due to that",
                      "id": 189,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 135,
                  "content": "BIL has about 50,000 reasons not to lend it out.",
                  "id": 190,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "But they *needed* this skid loader!",
              "id": 191,
              "comments": [
                {
                  "score": 10,
                  "content": "FAmIlY /s",
                  "id": 192,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 178,
          "content": "BIL could have sent them to jail.",
          "id": 193,
          "comments": [
            {
              "score": 59,
              "content": "This.  Their behavior wasn't just asshole, it was criminal.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "[deleted]",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Gonna add, after their edit, they described BIL owning more than one skip loader, and that's why it's no big deal. Well OP who's never gonna read this comment, ever think that there might be a job that needs more than one or several jobs that need one each? \n\nGeneral contractors, especially big ones typically have more than one job going at a time. I say big coz it sounds like the company has massive equipment in duplicates or more. BIL would be out of a specific job because he's down one equipment. Most likely he lost more money than just losing an equipment, he could've lost jobs and scheduling was screwed up and the employees were affected.\n\nThat whole family owed more than just 1 totaled equipment. Did the dad have to get a truck? No other cheaper or more practical vehicles possible? They all suck with finances apparently.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4662,
      "content": "“The insurance was barely enough to cover the medical costs and the truck”\n\n\nUmmm why was the truck the first priority and not the thing they STOLE??? YTA",
      "id": 197,
      "comments": [
        {
          "score": 1250,
          "content": "Good point and additionally I think they essentially committed insurance fraud since the truck wouldn’t have been covered if it was damaged in the commission of a crime so they concealed that. They would have been screwed if he had gone to the police and the family still fail to see that his generosity in not pursuing action against them is what he considers to be his only gift to them for the foreseeable future and actually asked for more!",
          "id": 198,
          "comments": [
            {
              "score": 691,
              "content": "Not just insurance fraud. Felony theft and destruction of property. God what a shit family but let's reward them with a cruise.",
              "id": 199,
              "comments": [
                {
                  "score": 66,
                  "content": "Seriously.  Brother did them a favor by not pressing charges.  I sure as heck would have.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 22,
                      "content": "He should have, because then he could probably have involved his own insurance and gotten reimbursed.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 132,
              "content": "Whether it was a crime or not depends on if OPs sister has authority in the company or whether the skid loader was company owned or personally owned (which in turn would depend on what property rights between married people are like where they are from).\n\nIf wife has authority in the company, no theft occurred because they had her permission. She however could be liable for negligence depending on her contract with the company.\n\nIf it was privately owned by BIL or co-owned by his wife and they live somewhere that that counts as marital property, again no theft has occurred.\n\nWhat they did was wrong. 0 doubt about that. But whether it was actually a crime (and therefor insurance fraud) is extremely situational.",
              "id": 202,
              "comments": [
                {
                  "score": 12,
                  "content": "Lots of insurance companies also won't pay out for exceeding the vehicle's towing capacity.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Whether it was a crime might depend on whether the sister is technically an owner or employee of the business.",
              "id": 204,
              "comments": [
                {
                  "score": 10,
                  "content": "> whether the sister is technically an owner or employee of the business.\n\nAnd even if she's neither, if they badgered BIL into not reporting it, or he didn't report it because he didn't want his wife roped into a criminal charge for being badgered into it by her dad and brother, there's effectively no crime.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Seriously are these people fucking on one? This is unbelievable. They STOLE from this guy, destroyed his property, could have destroyed his whole business, never repaid him, and they're telling him to get over it? This is unbelievable. OP you and your parents are horrendous HORRENDOUS people. I cannot believe you. You're such unbelievable assholes I can't believe you dared to write this out and ask someone of you're an AH. Aren't you embarrassed? You should be so deeply ashamed of yourself. Your parents too. Wow. Just wow. Pay this man back and get tf over yourself. You literally committed a crime against him. And probably a crime related to this insurance claim.",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3122,
      "content": "YTA. Guy was stolen from and had his lively hood put at risk by his family after telling them no.",
      "id": 207,
      "comments": [
        {
          "score": 450,
          "content": "I wonder how he really recovered from such a big financial loss. Losing such a pricy piece of equipment. Yikes.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2746,
      "content": "YTA, your dad and brother stole a skid loader ( I will be honest here, I had to look up the price, the cheapest I found was 30k, no small funds )  and hurt him financially.  You have absolutely no right to tell someone how to forgive this.  He can hold a grudge if he wants to.",
      "id": 209,
      "comments": [
        {
          "score": 843,
          "content": "It sounds like the dump trailer was also BILs. They dont seem to be cheap either.",
          "id": 210,
          "comments": [
            {
              "score": 585,
              "content": "I missed that, also as pointed out below I also missed the fact that they used the insurance payout to replace their own truck but didn't give him a dime.",
              "id": 211,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 394,
              "content": "I didn’t know what a skid loader and dump trailer was either so I also had to look it up. \n\nI can confirm the price of the skid loaders start around $30,000 and go up to about $60,000. It looks like a dump trailer that’s big enough to hold a skid loader is around $15,000. \n\nI could be wrong because I’m basing all of those numbers on google searches and zero experience.",
              "id": 212,
              "comments": [
                {
                  "score": 230,
                  "content": "Nope, you aren't wrong. We do dirt work with our bobcat and dump truck, even if the equipment is old, it certainly holds its value! \n\nThat is because they make money every time that key is turned on. Not only did they steal expensive equipment, they stole the money from him to buy new equipment, the down time when he can't complete jobs, and possible reputation if he was in the middle of doing a job that couldn't be completed due to lack of equipment. \n\nHonestly, why he is still married into this family is way beyond me",
                  "id": 213,
                  "comments": [
                    {
                      "score": 19,
                      "content": "> possible reputation if he was in the middle of doing a job that couldn't be completed due to lack of equipment.\n\nand rental equipment (if available) to complete any outstanding jobs while new/replacement equipment is being sourced.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Thats exactly what I did!\n\nBut I have seen something similar near where I live recently. They are big.",
                  "id": 215,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Maybe cheaper when used, but still a lot overall and the parents and brother should have at least agreed to low monthly payments for example $100 from the parents and $100 from the brother every month. That would make in 10 years $24000 already and the BIL would likely not be so pissed off. I think he is not only so angry because of the stealing and the big money loss, but also because they show zero effort to recompense him in any way. I am not even sure if they properly said sorry for what they have done.",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "YTA, yea and the fact the dad replaced his truck with the money but didn’t give it to the BIL. Like wow what a person the dad is.",
          "id": 217,
          "comments": [
            {
              "score": 15,
              "content": "Honestly they should have given him all the money and ate the medical bills too. Why should BIL go in debt so they can walk away debt free with a new truck. God this post makes me soo mad. This is the kind of shit my sister would do.",
              "id": 218,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "I would also presume that BIL insurance would have gone up as well?",
          "id": 219,
          "comments": [
            {
              "score": 117,
              "content": "If he was even able to claim it, typically when you involve insurance they ask questions, and would force BIL's hand for suit or criminal charges if they apply.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1951,
      "content": "YTA Why would he need to \"get over it\" when your dad and brother haven't paid him back? You are now asking him for further money? Ridiculous.",
      "id": 221,
      "comments": [
        {
          "score": 200,
          "content": "Exactly! They have 10 years to make this right, and at least pay the BIL back in installments. \n\nOP's dad and brother stole this man's property. They used the insurance money to replace **their truck**, but have never bothered to even attempt to repay the BIL for the equipment that they stole and then destroyed. It isn't a mistake if you never tried to fix the damage done. If OP's brother/father had any integrity, they would work towards repaying their debt and rebuilding trust.... and certainly not ask him for more money for a cruise.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "OP: “Hey, you know the people who stole and broke tens of thousands of dollars worth of equipment from you and never paid you back? Anyway, we’re sending them on a cruise, and you pay your portion of that to me. Also, just let it all go without even an apology. I don’t even care if you come to the party, just send me the money asap.”",
          "id": 223,
          "comments": [
            {
              "score": 16,
              "content": "OP's mistake was that he asked for the money, he should just have taken it, I'm sure BIL would have gotten over it /s.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "You didn't even mention the god tier favor he did to the thieves by keeping them out of jail for theft and insurance fraud.",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1530,
      "content": "YTA. They stole and destroyed his stuff and refused to pay. Not even offering instalments over time. It’s easy to say get over it to the one who was wronged. You’re saying it was 10 years ago so he should be over it by now but from his perspective that’s 10 years they’ve had to make it right and not tried. You’re calling him an ass for putting money in the way of a family relationship but isn’t that exactly what your dad and brother were doing when they took his stuff knowing he said no rather than spend money to lease it from somewhere and then never even paid him back after wrecking it? And you expect him to spend more sending your parents on a cruise? You are being unreasonable and unrealistic and didn’t even have to insert your opinion in the first place, it’s only made things worse.",
      "id": 226,
      "comments": [
        {
          "score": 372,
          "content": "Self employed contractor with a sudden equiptment loss of $40-50,000 dollars. No recompense either. Insurance money used to pay medical bills and for the thiefs truck. That is not something you \"just get over\". BIL and wife have in most probability had to pay that stuff off and taken a massive hit. Now your asking for money to send them on holiday. Its unbeliebaly entitled. If I was BIL it would be yet another chapter in the \"why my wife family are dead to me\" book.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "YTA, OP.\n\n>You’re saying it was 10 years ago so he should be over it by now but from his perspective that’s 10 years they’ve had to make it right and not tried.\n\nPoor dude has probably been slowly paying for the damages the last decade.  I wouldn't forget a grudge either if I had to pay monthly for being stolen from.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "In that 10 years they could've collectively paid back £5000 a year and be square with him at least financially, if not morally.\n\nWe've got multiple adults here - Dad and Brother.  £2500 per person per year.  That's like £200 per month each.  Is that a big outlay to pay every month for a decade?  Sure.  But it's doable.  \n\nIf, as a family, you can all give enough of a damn about someone to chip in on a holiday, then you should also as a family be able to give enough of a damn to all contribute to repaying BIL.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}