{
  "post content": "**throwaway account**\n\nOkay so I first met my friend *Jane (F29) studying abroad. We were really good friends during our travels and after college we actively stayed in touch visiting each other in our respective different cities.\n\nI met her bf *Bob (now husband) when they first started dating and have met her college friends and parents.\n\nBob and Jane decided to move to my city right before Covid so during lockdown we were in each others bubbles - we’ve celebrated each others birthdays, we’ve had Friendsgiving, Christmas parties together etc.\n\n2021 Bob and Jane got engaged in August and when they came back I threw them a engagement party. I bought her this wine glass that said “wedding planning wine glass” and every time she used it she would text me a photo of her with it.\n\nIn 2022 I threw Bob a 30th birthday party - but then this was also the first year I wasn’t invited to her birthday.\n\nI had texted Bob asking what the plan was and he told me they were going out of the state for her birthday - however on instagram I seen them posting pictures of them renting a cabin with some friends…so I felt awkward.\n\nThen I wasn’t invited to the Bachlorette party - I didn’t find this too big of a deal because Jane has some really close childhood friends and sorority friends but then nothing about the wedding.\n\nThe wedding happened this May and it was a big wedding - like 200 people probably and I wasn’t invited. I was really hurt to say the least but I didn’t say anything. I just tried to move on - I haven’t talked to them really since before the wedding - they didn’t wish me a happy birthday and they couldn’t attend my birthday shindig cause they were out of town.\n\nI’m noticing that if I don’t reach out to either of them, they don’t reach out to me at all.\n\nNow Bob has reached out and asked me to plan Jane’s birthday party cause he says “I’m the best at planning these things” and I told him I was hurt about not being invited and he said “well we had limit space don’t make it a big deal we want you to be at her birthday” \n\nI really don’t want to do it and I don’t really feel any desire to be friends with them - am I being a petty a*hole?\n\nEDIT: to clarify about the Bob’s birthday party - Jane asked me to help plan it - that was the last time I’ve seen them in person (march 2022).",
  "id": 1,
  "comments": [
    {
      "score": 19932,
      "content": "NTA - space at the wedding wasn't a problem if they had 200 guests. They don't want you to be at her birthday, they want your skills in planning out her birthday. Bob said as much.",
      "id": 2,
      "comments": [
        {
          "score": 6750,
          "content": "Yeah, boo. They aren’t your friends. NTA",
          "id": 3,
          "comments": [
            {
              "score": 3233,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 1979,
                  "content": "In this case, OP, you could plan the party, and you do so by charging the average rate of a party planner in your area.\n\nIf Bob asks why, you tell him that their lying about the last birthday and not inviting you to recent events tells you that they now see you as a resource instead of a friend.   And resources get paid.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3869,
                      "content": "Why even bother? They clearly don't care about OP or see them as a friend. It'd be a lot better for OP's mental health to just cut them off and move on. There's no need to play games or try to pull a stunt on them when the relationship is already over.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 53,
                      "content": "No, not the average rate of a party planner in the area, above average. OP needs to add a shitty-friends-make-bad-customers premium.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Or she could say okay, party is at this park/restaurant/venue, basically any place that a group can meet up at without reservations, and tell him meet at X at this time and then be done with it.  I mean a party just needs two people so if more than that show up cool; if some one show up with drinks/food even better.  I’d then block them on everything.\n\nNTA",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I don't think it's worth it to do this, sounds like OP doesn't really want to be there anyway, and they are clearly not friends.   \n\nThe smart thing to do here, is just be too busy to help out, for whatever reason.  \"Sorry sounds like that would be a lot of fun, but I'm busy with ____________________\".",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "THIS 👆👆👆👆",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "That’s so extra and dumb. Just cut your losses and move on",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Or simply plan the party, throw the party, brag about the party, but don't invite them. If they ask why you threw a party on the same date just tell them it was her birthday party but the space was limited, don't make a big deal about it.\n\nOp is NTA",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 238,
                  "content": "Pals enough, my petty ass would take on the role and set up a party at Chuck e cheese. They'll be mad at first, but the tokens for the games will make up for it.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 132,
                      "content": "OP is in australia so chuck's out I'm afraid. \n\nThey could do Red Rooster, which is a much worse aussie version of KFC.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "My pettyass would say sure, not plan anything, and then lie and have them invite people and show up to nothing.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 167,
              "content": "On the upside, I think you may have a future side hustle in Party Planning",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "[removed]",
              "id": 18,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 958,
          "content": "Yep, NTA. My pettiness wants OP to respond to Bob with her hourly fee for event planning.",
          "id": 19,
          "comments": [
            {
              "score": 371,
              "content": "And get up front payment or OP will never see the money.",
              "id": 20,
              "comments": [
                {
                  "score": 42,
                  "content": "50% up front?",
                  "id": 21,
                  "comments": [
                    {
                      "score": 85,
                      "content": "I'd say at least 75%.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 287,
              "content": "Or promise a fabulous party at a great venue only for them to show up and see it’s closed",
              "id": 23,
              "comments": [
                {
                  "score": 61,
                  "content": "I like this pettyness",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Oh, yes! I wish I would have the balls to do this if I was in this situation.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yeah, just plan it all, but accidentally forget to invite anyone.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "No, have them show up and then tell the bouncer not to let them in because it's someone else's party and they're not invited.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Four Seasons landscaping",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "what's odd is they didnt use her to plan their wedding for free?  based on the above these people seem like users surprised she wasn't asked to at least plan before the brush off .",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "And make the theme Barney the Dinosaur or something.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 907,
          "content": "Exactly. Respond and say that you are glad they want you at the birthday, you'll be happy to attend. But you don't feel comfortable planning it so you'll attend just as a guest. \n\nWatch how quickly you get uninvited.",
          "id": 31,
          "comments": [
            {
              "score": 115,
              "content": "\"I'm going to be out of town and can't plan but I should be back in time to attend whatever you come up with\"",
              "id": 32,
              "comments": [
                {
                  "score": 5,
                  "content": "...and don't actually show up but instead post about whatever other amazing thing OP is doing that night.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 87,
              "content": "Yep this nails it.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I applaud this trick.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "But that only leads to OP being hurt again, because Bob and Jane don’t give a fuck about her.",
              "id": 36,
              "comments": [
                {
                  "score": 3,
                  "content": "She already knows that.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 666,
          "content": "I think the honest response back is, \"It was a big deal to me.\"\n\nNTA\n\nHowever they justified not inviting OP, it sent the message that they don't consider her a friend.",
          "id": 38,
          "comments": [
            {
              "score": 386,
              "content": "This is it. It's an honest response and not arseholish to send it at all imo.\n\nIt might have been slightly different if Bob hadn't asked her to plan the birthday. Friends drift apart, and sometimes people aren't able/mature enough to do anything but ghost (I say this as someone who's been ghosted out of a friendship group in the past, and yeah it hurt like hell at the time but I'm mostly over it).\n\nOP, you've been incredibly mature and considerate throughout this whole thing— it was the right decision (imo) to not say anything about not being invited to the wedding, and just to allow your ex-friends (because that's what they are now) to ghost you. Asking you to plan their birthday, after all that, is absolutely wild.\n\nI've been not/uninvited to a wedding because of legitimate space concerns. What did that look like? It looked like my friend calling me, apologising, explaining his reasoning (namely prioritising family while also knowing that I'd enjoy the reception more than the ceremony), and both inviting me to the reception and also letting me know the post-ceremony park everyone would be gathering at, if I wanted to join for champagne. It was honest and lovely, and I imagine if the reception was also space-limited we would have had a similar conversation.\n\nYour \"friends\" are ex-friends, due to their own actions, and asking you to organise birthdays is so insensitive and egregious as to be ridiculous.",
              "id": 39,
              "comments": [
                {
                  "score": 25,
                  "content": "Perfectly stated!",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Very well said. If they truly wanted OP at the birthday party, they could have just… invited her! Only contacting someone when you want them to do something for you is about as clear a signal as it gets. Unbelievable nerve. If I was feeling slightly petty, I might say “sorry, I’m too busy to plan something” to put them on the spot - would OP’s presence suddenly be unnecessary? But the kind of treatment they gave OP can be very painful, so I’d probably just block them & move on quietly.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This. Would award if I could. The personal experience here is what should have happened.\n\nAgree with others saying they now see you as a resource for the party organising.\n\nBut also, as a side note, business idea? Seems like it's your speciality 😅💞",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> it sent the message that they don't consider her a friend.\n\nImagine not even being in the top 200. If it was a small wedding like 10-15 ppl then it would be believable. But in that case, friends would be aware. \n\nDuring covid it wasn't unusual, my boss did that. Just close family, not even sure if they had friends (maybe 1 or 2).",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "This. Sometimes, brutal honesty is what's needed for you,the hurt person. If they invalidate you,then you have your answer. Every once in a while,you get surprised, and relationships can heal. In this case, I think they'll get defensive and shitty because they're shitty people. \n\nIt was a big deal to me. I'm hurt you have not invited me to the wedding and lied about the birthday party. I feel like you are using me to plan a party. That doesn't make me feel good, so I am declining. I wish you the best. \n\nThen move on.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "She shouldn't even be messaging bob.  The friend needs to hear it.  They never told the friend how they felt and Bob probably won't explain anything to his wife after this conversation.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Use this. Tell him they set the norms for the relationship with their wedding, and you are comfortable with the new status quo, and do not want to make Jane feel pressured to step up and actually be a friend instead of a customer.\n\nOr, you could say, “You invited 200+ people to your “limited space” wedding. Surely, you can come up with one name from that guest list that you and Jane haven’t screwed over yet ….have them plan it.”",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 310,
          "content": "NTA- f that noise! I’d be gutted. Absolutely not. They are users. I’m so so sorry.",
          "id": 47,
          "comments": [
            {
              "score": 166,
              "content": "I have a... well I'd like to say a \"good friend\", who is like this.  I suppose he was a good friend once.  But over the years something changed.  He was only interested in me when it suited his needs.  Wanted me at his wedding because he needed extra groomsmen, but he had no interest in coming to my wedding even though he and his wife had no other plans (and they live TWO MILES from us).  Used me to teach him a few crafts I'm good at.  Excluded me from various parties and events because he invited friends \"outside my interest\".\n\nAnother friend of mine, who knows him well, pointed out that he compartmentalizes his friends.  They're exclusive to specific events and there's no room for crossover.\n\nHe called me recently, talked about how we never hang out anymore (I've heard he's lost a lot of his hoity-toity friends).  He said we should do something to get together soon.  I said, \"sure\", but after I hung up I said to myself, \"yeah, right...\"\n\nI have absolutely no intention of calling him to hang out.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "If he wants to pay for you for your skills, that’s a different story. Otherwise, they’re walking all over you :/",
          "id": 49,
          "comments": [
            {
              "score": 104,
              "content": "Nah. Not even that. Cut them off. They don’t deserve you or your services.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I wouldn't do it. They'd condescend to her, and constantly make changes. It would just be more traumatic and hurtful. The money wouldn't be worth it, if they even paid up.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "> They don't want you to be at her birthday, they want your skills in planning out her birthday. \n\nListen to this, OP. If you want definite proof, text Bob and say you're too busy to help plan it, but would love to attend the party. That might be the last time you hear from them.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "And F Bob, I think he wants your help to look good himself at throwing her a good bday party.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "This is an entitled couple who will probably use every one of those 200 people just like they did you.  Though my guess is they will divorce at some point.  Their house won’t be big enough for two giant egos.\nPlease ghost them after you contact him and tell him no.  Don’t waste your breath trying to explain.  They won’t get it because they have no empathy.  “Bob, I am not doing the birthday party”. Click.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "“When people show you who they are, believe them the first time.” - Maya Angelou\n\nNTA don’t do it simply coz you don’t want to. But also, these people are using you coz you “..are best at planning these things”. I think that even if their wedding had been 20 people, they didn’t invite you is enough reason to not want to do anything for them. But it was 200, they can easily ask any of those 200 people to plan her birthday coz they clearly are higher up in the hierarchy of friends and family. Don’t fret about this, just say no, and move on.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11839,
      "content": "Tell Bob that there are obviously around 200 people that they’re closer to than they are to you, so he should ask one of those people to plan the birthday party. \n\nNTA",
      "id": 56,
      "comments": [
        {
          "score": 2666,
          "content": "200 hundred people closer!!!! Op wasn’t even like I didn’t get invited or a plus one. Didn’t complain about being in the wedding party. She genuinely wanted to just support her friend. If I can’t go to the preplanned party, I’m not planning a party.",
          "id": 57,
          "comments": [
            {
              "score": 318,
              "content": "200 people! I barely know 20 – and that's only if I include work colleagues, the people over the road I wave & say hello to and the nice woman at the post office who holds my mail.",
              "id": 58,
              "comments": [
                {
                  "score": 183,
                  "content": "People with big families can easily hit 200. My aunts, uncles, cousins, and cousin's kids hit about 60 people. If my SO had the same number that's 120. I invite 20 friends and give them a plus one, my SO does the same, that's 200 people.\n\nThat said, if they are close enough to op that op is planning parties, I would definitely find space for them at my wedding.\n\nNTA.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Exactly this. I have about 80 family members I have to invite between my dad's big family, my mom's big family, and my stepdad's big family. I have a group of about 15 grade school friends I'd have to invite, plus about 5-10 college friends I'd want there. To me the statements \"I didn't have space for you at my wedding\" and \"you are not one of my five closest friends I've met since 2015\" could be essentially the same.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My cousin’s wedding in 2016 was massive, both sides have huge families plus a lot of their friends.",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I had to limit myself to aunts, uncles, and cousins no more than 2 years younger than me, because inviting aunts uncles and all cousins was going to total 120 just on my side, without even including any friends!",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "No one talks to each other in my Italian family so we are down to about ... 14",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 81,
              "content": "Happy Cake Day 🎈",
              "id": 64,
              "comments": [
                {
                  "score": 32,
                  "content": "Thank you!!! ❤️",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This guy over here is putting in more effort for a random stranger than Bob and Jane will for OP.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "I actually don't think she should talk to Bob. She should talk directly to her friend Jane, it sounds like the gap between them started when Bob showed up. I'm not saying he is purposefully separating them but her friends priorities do seem to have changed. \n\nOP talk to Jane directly, tell her how you feel and explain why you won't be organising her party. Give her a chance to prioritize you again, maybe go for some 121 drinks/dinners. However, if she doesn't make you feel valued, then yeah, sadly it's time to create some distance between you.",
          "id": 67,
          "comments": [
            {
              "score": 446,
              "content": "She should ghost them. They aren't going to validate her feelings.",
              "id": 68,
              "comments": [
                {
                  "score": 210,
                  "content": "Ya really. It's not like she's gonna go \"Shit, I didn't even realize you might feel left out by not being invited to my wedding! My bad!\"",
                  "id": 69,
                  "comments": [
                    {
                      "score": 39,
                      "content": "True but she may acknowledge that perhaps Bob had more to do with the lapse in friendship than she would have wanted.\n\nI'm not saying he did mind you, but there are lots of comments pointing out that the friendship seemed to be doing well until Bob came into the picture; specifically when they got *engaged*. This is the standard \"look out for this behavior\" reddit comment but abusers usually do very well to hide their true faces until they feel they've got their partner locked down (be it through marriage, a baby, a home bought together, sunk cost fallacy etc). When they think there's no way their partner would rather leave than make peace with them and put up with it. And the first step to that is typically isolation. OP was able to maintain this friendship for a long time despite living in different cities, the friend -after the engagement party- apparently texted OP every time she used the glass OP gave her but then the relationship fell off.. this doesn't read like a normal drifting relationship between people. Typically if you're going to grow apart it's because of distance or a change in priorities/lifestyle (like if OP had children and they didn't. It's not a bad thing to have kids but it's notoriously harder to maintain a social life once you have them so it makes sense that in the interim you may lose a few friends simply from lack of time spent maintaining the relationship). This reads as though everything was fine until they went radio silent on her. I'd be curious to know what was going on behind the scenes.\n\nIt's possible Jane really is just not that interested in a friendship anymore. But it would be a strange 180 from where OP thinks they were (another possibility being of course that OP may have read the relationship to be stronger than what it actually was. There have been plenty of times I thought I had super close friends only to realize they didn't consider me the same way). If OP described their friendship accurately to what it was, it's strange that it would fall off so quickly without outside influence (like Bob deterring Jane from keeping in constant contact). \n\nThis is all to say it's worth reaching out to Jane alone and asking what was up and why that happened? Maybe Jane will just spit out the same thing Bob said and get upset that OP would even ask in which case it would be better for OP to just accept the distance as she has and move along. But on the off chance it's what reddit fears and it's more Bob's influence on the situation I'd be on the look out for further isolation and just let Jane know I'm here for her whenever she wants to talk. Even if communication lapses my phone line would be open to her if she ever needs me. Sometimes people don't see the abuse written on the wall when they're inside the house. But if she is being isolated and it escalates it'll be so vital to know she has a friend in OP no matter the time spent apart. \n\nTo be clear it is not OPs job to save her if this is the case. If OP decides she does not want to spend the energy on this I can't blame her. She's only human after all. But if she still cares and worries for her friend it would be good to just reach out and establish that connection in case Jane ever truly needs it.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This. Time to block those people and move on. They aren't OP friends, they only value her planning skills.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "I’ve seen a couple people mention that Bob sounds like the problem, but I don’t see how the story makes it seem that way. Things didn’t get bad when he showed up. It seems like OP has known Jane and Bob, both, for at least 5 years. Based on OP’s timeline, they only pulled away in the last year. I feel like if he was trying to drive them apart, he wouldn’t have asked OP to plan the party and attend it.",
              "id": 72,
              "comments": [
                {
                  "score": 105,
                  "content": ">In 2022 I threw Bob a 30th birthday party - but then this was also the first year I wasn’t invited to her birthday.\n\nJane is jealous of OP's role in Bob's birthday and created distance. I think the estrangement is from Jane, not Bob.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Yes, this is the trigger point. Jane is a big girl and has her own phone. She doesn’t need to go through Bob or anyone to at least send a Happy Birthday text. Op is purposefully being iced out and only contacted by Bob because he is lazy and doesn’t want to plan a birthday party for his wife.\n\nTime to walk away and find new friends. These ones aren’t worth any effort.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This stood out to me too.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I thought maybe Bob has the hots for OP and Jane knows it, hence why Bob is the one reaching out and the Jane birthday ditch.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I know a woman who got divorced a few years before I did.  We kind of bonded over that but there was never anything romantic or sexual.  I’d fly down to visit my widowed dad 2-3 times a year, and we’d always get dinner and catch up, since she lived an hour or so from my dad.  Then she met this guy and after a couple of years they got engaged.  My now wife and I were not invited, but she did tell me it was to be a very small wedding, so I tried to not let it bother me, even though we invited her to our wedding (this was before she met her now husband).  My wife and I have met him a couple of times and he seemed kind of distant.  Since they got married, she has totally ghosted me, not replying to emails at all.  I wondered if he’s the jealous type who doesn’t want his wife to have male friends?  Who knows?  Clearly our friendship has run its course…",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "If OP is honest with themselves, then I would bet their dynamic has always been one sided. OP makes Jane the center of attention, and Jane just barely includes her in events. \n\nOP seems to have excluded a lot of details about Jane stepping up for them. That's either because OP is hurt right now and focusing on the bad, or because Jane is just using OP",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "“I’ve had a think about what you said. I do want to be at her birthday- I’m glad you’re inviting me. \n\nI have limited space in my calendar for planning and hosting events, so I’m taking your lead, I will be able to attend and I’ll make sure that space limitations aren’t a big deal for any of us.”",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Very best answer! \nNTA btw",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "THIS IS EXACTLY HOW OP SHOULD REPLY, YES",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Ooh burn 🔥 love it!",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Being below 200th place means OP is not even in their \"Monkeysphere\"\n\nhttps://en.wikipedia.org/wiki/Dunbar%27s_number",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4285,
      "content": "NTA. how are they not gunna invite you to their wedding then expect you to not only come to their bday party but help plan it???? They obviously don’t view you as a friend but as an event planner. Dump them",
      "id": 84,
      "comments": [
        {
          "score": 761,
          "content": "OP should agree and charge for her services, since they obviously only see her as someone to plan events. She can offer them an old acquaintance discount of five percent.",
          "id": 85,
          "comments": [
            {
              "score": 451,
              "content": "I’d actually charge a 5% upcharge for ‘faking friendship in order to secure services’ fee.",
              "id": 86,
              "comments": [
                {
                  "score": 105,
                  "content": "That’s why you quote rates 5x what you’d normally charge. “5% discount” is off of the inflated rates!",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I'd be hella petty and say \"sure I'll plan it, just make sure you invite all the people and tell them this address at this date and time, the rest is a surprise\" and then do absolutely nothing.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yes I love this idea!",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Exactly ..they're actually rotten people that I wouldn't want in my life, they've already went thru birthdays and HAVEN'T invited her ....no bachelorette party AND no wedding, after no contact for ages, they contact to get her to plan a party, they pick OP up and drop her as they please, that's no friendship they're users that take her kindness as weakness .. fukkkk thatttt and them NTA",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Yeah, especially since it was a big wedding. If it had been a small wedding with just the closest family, and there hadn't been these other instances of OP being left out, then it would be different.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Not even just that, she said she didn't get invited to her party before the wedding stuff happened. She only went to Bob's because he threw it. She's an unpaid party planner and nothing more.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Not even help plan the birthday party, just flat out do all the planning.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2320,
      "content": "NTA\n\nThey froze you out, and then made absolutely no effort to reach out until now, when they want something from you?\n\nTime is valuable - spend yours with the people who's actions show they WANT to spend it with you. It appears to be clear that they do not.",
      "id": 94,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1335,
      "content": "NTA.\n\n200 people is not a small affair, you were either not considered or specifically excluded. You're the only one contacting them until they need a party planned, you need to stop putting in effort.\n\n\n>We were really good friends during our travels and after college we actively stayed in touch visiting each other in our respective different cities.\n\n\nBased on this sentence, the last thing I would try before completely giving up is to speak to Jane separately from Bob, I get the sense he's filtering communication from you.  I sense a controlling relationship, or at least a fear of your relationship with her.  If you can't suss that out, it could be that I'm wrong or that she's brainwashed.\n\nEdit: a couple people pointed out that the normalcy appears to stop right after bobs party planned by OP and that maybe something there impacted it.. I had missed the correlation.",
      "id": 95,
      "comments": [
        {
          "score": 569,
          "content": "Even if he IS filtering communication from you, Jane could have very easily acknowledged OPs birthday.",
          "id": 96,
          "comments": [
            {
              "score": 176,
              "content": "It's pretty obvious what's going on here: OP is free event planning.",
              "id": 97,
              "comments": [
                {
                  "score": 5,
                  "content": "Plot twist: this is actually a Cable Guy situation and in reality OP is an overly attached event planner.",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Yeah, I got serious vibes that Bob doesn't like OP for some reason, but Jane is pushing to have her at her birthday.",
          "id": 99,
          "comments": [
            {
              "score": 460,
              "content": "I bet Jane doesn’t even know she’s been asked to plan the party she probably thinks her husband is doing it. Jane is the one that cut her out",
              "id": 100,
              "comments": [
                {
                  "score": 229,
                  "content": "I agree that Jane is the one that cut her out.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 129,
                  "content": "O agree with you. Jane is the one excluded OP because she feels insecure with Bob and OP!",
                  "id": 102,
                  "comments": [
                    {
                      "score": 206,
                      "content": "This is were my speculations went also.   \nUp until OP planned Bob's birthday all was fine... afterwards it wasn't. So either something happened at the birthday that OP is leaving out or Jane feels insecure / treathened that OP planned her husband a birthday party.   \n\n\nIt sounds like Jane hasn't communicated this to Bob and found excuses to keep OP at a distance. Bob unaware of what's going on and asks for the services of OP again.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "100% this.\n\nJane (and her family) probably planned the wedding but now for her bday he’s on the hook.  He remembered that Jane really liked the engagement party OP threw for her so he’s gassing OP up in hopes that she’ll do his job for him.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "100% it’s Jane.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Could be the other way round: perhaps Jane is the jealous, possesive type and resents the OPs apparent friendship with her hubby Bob, misreading it as op wanting to have an affair with him or \"steal\" him away from her. Hence the sudden cutting off of communication and lying.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also: Bod gaslit OP “don’t make a big deal of it (not being invited to the wedding)”\nBob isn’t a good peep for sure.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I would bet money that OP is a giver and Jane is a taker in their friendship. OP gives and gives, but Jane just takes and takes. If OP looked at their friendship I am sure OP would see all the signs of an unbalanced friendship. Signs like:\n\n* Jane needing help with planning events, but OP ends up doing most of the work, and then Jane gets the credit for \"Her\" party\n\n* concerts/events/trips where Jane goes with friends, but doesn't invite OP for convenient reasons (old high school/college friends, last minute, not enough room, etc). \n\n* being the last to know about stuff going on in Jane's life, amd usually finding out through social media instead of from Jane\n\n* always playing the support role when they hang out (sober driver, babysitter when friends get too drunk, running the parties instead of participating in them, etc)\n\nPeople don't just change into this role through jealousy or whatever. They are always like this, but just hide it well when it's convenient, and the fact that they keep asking OP to throw an awesome party while excluding her from their lives is telling of who they are.\n\nI'm also lacking anything from OP where she mentions stuff they've done for her.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree with this overall and it's probably most likely what is going on. I will throw out there that OP may think they are better friends than they really are. It does sound like their friend liked hanging with them when they first met but over the years just took advantage of their party planning skills. I saw this in real life once. It was a friend I ended up distancing myself from because they became a really odd, stage 5 clinger and I don't know if that is even the proper way to describe them. They never really had consistent friends growing up since they moved every 2 years. They had some serious abandonment issues. So every person they met became their friend versus new acquaintance. They would do anything for the person. I mean anything. Plan trips, birthdays, help people move etc. But the person wouldn't do the same back because they considered them more of an acquaintance versus close friend. Someone they went out with every weekend and they thought was a good friend, didn't invite them to their destination wedding. My friend didn't understand why they weren't invited. I tried explaining to them that that particular friend group was more of a partying friend group versus the kind of friends you have at your wedding. My friend just didn't understand. they were also a late addition to the group. Everyone else had known each other for many years and hung out more than just going out. So they all went to the wedding. Kept saying, \"but they would tell me really personal stuff when we would talk at the end of the night\". I had to remind them that at the end of the night that person was drunk and drunk people will spill their guts to anyone. Basically, my friend would do anything for anyone and consider them a close friend when the reality was much different. They just couldn't see it.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "i honestly read it the other way:\n\n\"In 2022 I threw Bob a 30th birthday party - but then this was also the first year I wasn’t invited to her birthday.\"\n\nFrom that point onwards it sounds like she upset Jane, and was then excluded.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1077,
      "content": "[deleted]",
      "id": 111,
      "comments": [
        {
          "score": 326,
          "content": "Personally, the 'people I knew' status",
          "id": 112,
          "comments": [
            {
              "score": 172,
              "content": "Somebody that I used to know status",
              "id": 113,
              "comments": [
                {
                  "score": 89,
                  "content": "\"new phone who dis\" status",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "[deleted]",
                  "id": 115,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Make out like it never happened",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Have their friends collect their records and then change your number",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 83,
              "content": "\"Gotye and Kimbra\" people",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "More of ‘people I thought I knew’ status, yuck they are disgusting.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Don’t make a big deal out of it is always a red flag. You didn’t make a big deal out of it, you had already stopped trying and then when Bob needed to use you, you had to explain why you didn’t want to do it. Now he’s saying not to make a big deal out of it and just do what he wants. You didn’t make a big deal, and you ain’t gonna do what he needs to use you for",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "\"Sorry, I have other plans with people who want to spend time with me.  Don't make it a big deal.\"",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 587,
      "content": "NTA. You are not being petty.  I know there can be space issues for weddings. However, I find it hard to believe that was the case with 200 in attendance. It seems like once the pandemic waned, their interest in friendship waned too. Dont do the party. You are not their personal party planner.",
      "id": 122,
      "comments": [
        {
          "score": 143,
          "content": "[deleted]",
          "id": 123,
          "comments": [
            {
              "score": 43,
              "content": "There is no universe where a person with a relationship as described by OP isn't in your top 200 most important people.",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "I like the idea of a separate party with friends. I wish one former friend had done this instead of uninviting us because the groom had a big family. Haven’t talked to her since.",
              "id": 125,
              "comments": [
                {
                  "score": 6,
                  "content": "I understand what you mean, but from their perspective isn't that another wedding event they have to plan and pay for?",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I got invited to a Bachelorette party for a friend I haven't seen for like five years and they couldn't invite OP to the actual wedding? Nah, they're fully in the wrong.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Not to mention you can still invite them to the bachelorette party!",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 477,
      "content": "NTA\n\nI guessing she didn’t like you planning Bob’s birthday and decided to be petty and not talk to you. Now, Bob is lazy and doesn’t want to plan her birthday so he’s asking you. Don’t plan it. Don’t talk to them anymore. Don’t waste time being sad over them. They aren’t good friends to you. Find someone who values you and knows how to have a conversation like an adult.",
      "id": 129,
      "comments": [
        {
          "score": 763,
          "content": "To clarify about planning his birthday - she asked me for help for his party and I ended up planning the whole thing since she didn’t really want to.  But yeah that’s how I’m feeling - that they’re not good friends.",
          "id": 130,
          "comments": [
            {
              "score": 278,
              "content": "She probably lied about who planned the party and didn’t want people to find out. Aside from her being a bad friend. Please tell Bob no. Not being invited to a close friends 200 person wedding is absolutely a big deal. It’s their prerogative, but you’re allowed your feelings and he has no right to down play them while asking a favor. If they can’t be honest and communicate what issues they have with you, they don’t deserve your friendship.",
              "id": 131,
              "comments": [
                {
                  "score": 115,
                  "content": "Lol imagine asking a favor from someone after telling them in so many words. “Yeah, sorry, you’re not one of my top 200 closest friends.”",
                  "id": 132,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Right! I’m 1000% sure one of those 200 people offered an opinion on her wedding planning, decoration, or reception. If her wedding was so great and wonderful, she can ask that person for help. Why waste op’s time when 200 super close friends are floating around to plan it?",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "It's like the MySpace top 8, but with 200 people you throw a giant party for",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "NTA But it's not only that they are not good friends, they are not friends at all. They are using you. They'll pick you up when they need something and then drop you right after they get it until they need you again. Time to cut the cord unless you can see something in that worth sticking around for.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Even if they had 150 family members at their wedding that means they have 50 friends they consider closer than you.\n\nYou must throw some kick ass parties for them to go through so much to string you along. You should find some super flimsy excuse to throw an amazing party the night of her birthday party. Don't forget to post all the pictures on your social media 😉\n\nNTA",
              "id": 136,
              "comments": [
                {
                  "score": 19,
                  "content": "I would totally attend THAT party, OP sounds more fun than Bob and Jane",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "They're not your friends period.  Maybe something happened between you, or your \"friend\" just needed someone local for a bit to help her and husband settle in the area and you weren't as close as you thought.  \n\n30 is a small wedding, not 200, and not inviting you to a birthday or acknowledging yours tells you everything you need to know.  \n\nNTA, but don't become one to yourself by helping these people.  Move on and find some friends that value and love you.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "info: did something happen at his bday?",
              "id": 139,
              "comments": [
                {
                  "score": 90,
                  "content": "Not that I know of? There were 6 couples there and I spent the whole time talking to the women of the couples - talked to him briefly when we all showed up to wish him happy birthday and then to take a group photo but that’s pretty much the only interaction I had with him the whole night until we said goodbye.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 101,
                      "content": "Just say you'll be out of state and then post some pictures of you at a cabin",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "Honestly, I'd just leave that shit on read.  If you aren't close enough to go to a wedding -- let alone a big one -- you aren't close enough to plan a birthday.  esp when it sounds like she's never put in effort for yours.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "They are not your friends. Nta",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Girl just say no and block them. Like you obviously  NTA the reason they use you so much because you allow it. Stop answering them and don’t meet up to talk to them.\n\nIf you do so then that your fault! I’m tired of y’all pushover letting people make you think your in the wrong.",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "They are not good people. Don’t even slightly feel bad for declining their outrageous request. Damn I am pissed for you 😅",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Honestly I would just block their numbers and remove them from your social media. It's clear at some point they stopped treating you like a friend and only kept you around so you could plan and host their parties.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "You have done nothing wrong. In fact you have gone above and beyond your way to be a good, supportive and loyal friend. Many people can only wish to have good friends like you. These people only see you good enough to plan their parties, not worthy enough to be at their wedding. This is a one-sided friendship and you’ve been pulling most of the weight and put in most effort, time and energy into this friendship. \n\nThe fact Bob tried to gaslight your feelings instead of acknowledging they’ve been shitty friends and apologize immediately is a huge 🚩🚩 block them both from social media and their numbers. Asking Jane for an explanation is beneath your dignity and self-respect considering how much you’ve done for them both. They both suck.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "This is a one-way friendship and you’re being used. End this charade before you feel even worse. There’s no friendship here.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That answered the question I had then. Thought at first you planned his on your own accord and perhaps she thought maybe you were trying to make a move on him and she didn't like that. But from your explanation, doesn't seem like that's the case \n\nYou're NTA. If I were in your shoes, if you wanted to maturely reject them, I would say \"Thank you for thinking of me as a great planner but I am not interested unfortunately to take this on. I hope Jane has a great birthday in whichever way she ends up celebrating it.\"\n\nOtherwise tell them that he can go ask one of the 200 people from their wedding to plan her next birthday and that you have better things to do.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 212,
      "content": "NTA. Why did you even respond? Just block and ghost.",
      "id": 150,
      "comments": [
        {
          "score": 36,
          "content": "This is the way.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This is the right answer. Absolutely no point in engaging with these people.\n\nThey're not your friends, so why give them your time?",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I would have just said “sure!” and then never respond, leaving the husband to stress out hahah.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 161,
      "content": "NTA.  They're not being friends, they are simply using you as a free event planner.",
      "id": 154,
      "comments": [],
      "relation": "Support"
    }
  ]
}