{
  "post content": "\nContext: Me f26 and my husband m32 welcomed our daughter several months ago. So far we've agreed on every decision made regarding our daughter but the topic of peircing her ears came up and he said he didn't like the idea despite me explaining that 1. It's normal thing for babies and 2. It looks pretty 3. no it's not cultural we're both white but it's a great new experience imo. He said he needed time to think about it but weeks went by and he hasn't said okay yet. Mom suggested we do it behind his back and he'll then come around and see for himself that it's a good thing since he was having doubts and being indecisive. I was hasitant but I agreed and chose a day where he was out all day.\n\nThankfully it went smoothly but when my husband got home and found out he lost his temper and went on about what a major breach of trust I just committed and how I should have never decided to do this without him fully agreeing since he's the parent too and got extra mad that I went behind his back and was being sneaky and untruthful about it. I tried to explain that first it was my mom's idea and I didn't think he'd overreact like that but he insisted that I did was not okay and that I overruled him as a parent and damaged the trust we have and also put our daughter through pain and discomfort. I had an argument with him and told him he was acting like this is just his daughter, I'm the mother and my opinion does have heavier weight than his to some degree. He got offended by that and went to stay with his mom who called and berated me for going behind her son's back and treating him as a less than when it comes to our daughter but I never understood why he thought that.\n\nHe is not talking to me now. I think he's being selfish by saying he needed time to think about it and trying to stall without considering my point of view. Mom is on my side here but he and my inlaws said I screwed up for making such decision without his \"okay\" and going behind his back to get it done.\n\nAITA?\n\nEdit/ putting this out there/ My husband was aware that I had plans to get our daughter's ears peirced and we've had many many discussions about it so it wasn't like it was out of the blue and I didn't bring it up with him. I did but he kept giving me the same \"I need time to think about it\" the entire time. How long was I supposed to wait? Why he kept stalling instrad of just saying \"just no\"? He just kept stalling and putting off any further discussions/compromises that we could've had as a way maybe to get me to just abandon the whole idea.",
  "id": 1,
  "comments": [
    {
      "score": 39338,
      "content": "YTA. I don't blame him for being angry. You were definitely \"sneaky and untruthful\" and then tried to blame your mom for it???\n\nALSO,\n\n *I'm the mother and my opinion does have heavier weight than his at some point.*\n\nWhat on earth makes you think this??????\n\nI don't think that his mother should have gotten involved but you are still TA.",
      "id": 2,
      "comments": [
        {
          "score": 12738,
          "content": "Yeah she lost me at the “I’m the mother” part. Seriously fucked up.",
          "id": 3,
          "comments": [
            {
              "score": 5735,
              "content": "Seriously, somehow its wrong for OPs husband to act like she's \"only his daughter\" but not a problem that her decisions overrule his? Like damn I don't envy this kid, this is setting up for a lifetime of shitty infighting if they stay together.",
              "id": 4,
              "comments": [
                {
                  "score": 7010,
                  "content": "Unless it's mom-specific things like breastfeeding, she doesn't have the right to overrule her husband. She's a hypocrite.\n\nOP, YTA in so many ways:\n\n* His opinion regarding your daughter matters as much as yours. If you can't respect that, do you even view him as an equal parent? (Spoiler alert: you don't.)\n* You violated his trust, not just as her dad, but also as your spouse. It's his child, too - you don't get to make decisions unilaterally. Going behind his back because Mommy told you to? Yeah, I wonder why he's pissed.\n* Piercings are not OK for babies. Your daughter has to go through a lot of pain and discomfort - if she wants it, she should be able to choose (when she's older of course). Getting HER piercings because YOU think it's pretty? And without consulting her other parent? YTA. \n\nETA: Piercings are normal in certain cultures, but they still cause pain and discomfort. My wording was wrong. The previous edit was made due to a wording error and lack of thought on my part.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4858,
                      "content": "Also, I wanna add that there’s a good chance OP probably went to an unsanitary mall kiosk to get her daughter’s ears pierced which cause a lot of problems later in life. My mom did that to me and my ears still leak pus to this day from the piercing holes. Only an assumption since OP didn’t write exactly where she went to get it done, but I’d bet on it tbh.\n\nEdit: forgot the judgement lol. YTA, OP\n\nEdit 2: A lot are asking if I’m allergic to certain metals. No, I am not. I can wear any metal as I please—I consistently wear necklaces, bracelets, and rings with absolutely no issue. I have also not worn earrings for 17 years. The piercing holes never closed, have to be popped like pimples to get the pus out, and my earlobes hurt 75% of the time when I touch them. My ears are like this because my mom was stupid and thought getting my 2-year-old ears pierced in the middle of a mall with a piercing gun would be okay. DO NOT USE PIERCING GUNS FOR THE LOVE OF GOD NO MATTER THE AGE.\n\nEdit 3: Holy shit my most upvoted comment!! \n\nLots of lovelies are telling me to go see a dermatologist—don’t worry, I am, haha! It’s for a possibly cancerous mole, but I’ve set myself a reminder to mention my ears!! Hopefully they can do something about it over than telling me to “just clean it” <3 also edited a typo lol",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 407,
                      "content": "No piercings are not normal for babies. They do cause trauma. Just because people have been doing it for years doesn't make it right. I don't know why you were so easily swayed.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 245,
                      "content": "It's painful for babies and not normal, (especially here in america)Americans take their babies to Claire's  or similar stores with a 15 year old with 2 weeks of training because no credible tattoo shop will modify a baby. It's not right to take away their autonomy for aesthetic reasons.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 211,
                      "content": "Me and many others in the body modification community find it totally unethical to pierce child before they can ask for it. Just because it is normalized doesn't make it right. \nFor example spousal abuse used to be normalized, and incest.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 100,
                      "content": "Exactly. And the only reason the mother had a day over breastfeeding is because it's her body that is doing the breastfeeding. She has final say over the use of her body.\n\nBut the baby should also have final say over her body. Surprisingly, I've encountered, and even birthed and raised, several-month-old babies and last I checked, they can't tell their parents whether or not they want a hole put in their ears. I understand it's traditional in some cultures, but just cos lots of people have done it for years, doesn't mean it's necessarily a great idea.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I agree with all of this! And poor kid, poking holes in you is painful... And you shouldn't let non-consenting people have piercings at all. And especially when they can't even tell if something is wrong with their ears. And people will grow a lot, which can have an effect on the placement (mine got more asymmetrical). If it's normal in your culture doesn't mean it is a good idea 😅. And especially behind your husband's back",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This! Piercings are NOT normal for infants. I always hated the “it’s pretty” argument. When my daughter was born, my mom and my husband both wanted to pierce her ears and made this argument…I told them that if my baby was so ugly she needed earrings to make her pretty, she was doomed.  We did not pierce her ears, and they still aren’t pierced (she’s 9).",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "As soon as someone starts bringing aesthetics into a procedure it’s not worth it. \n\nYta.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Thank you! How would this in any way be a “new adventure” for a months old infant?  An adventure into pain and trauma is all I can see here.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Right: your baby has no say in the matter at this point in time... hence your husband's reluctance, probably. So you just forced that change on her body. YTA.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "People don't understand the 2 Yes v 1 No concept. When you want to make a change, typically you need both parties (in this case parents) to agree. When one person says yes and the other says no, the yes side then tries to play the \"well why do you get to decide for both of us?\" card. My in laws do this to each other frequently.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 469,
              "content": "She lost me at \"It's a great new experience\"\n\n..... for who???!??\n\nThe baby? Yes, I'm just having the flesh of her ear lobs pierced and a metal stud put in is a great experience for the baby. Nevermind the pain, she's a few months old, she doesn't give a hoot what she looks like.\n\nThis is all for you and I'm worry, but you can wait a few year for that \"great new experience\"",
              "id": 17,
              "comments": [
                {
                  "score": 176,
                  "content": "> \"It's a great new experience\"\n> \n> \n> \n> ..... for who???!??\n\nThe 17 year-old part-timer at the mall who did the piercing on her first day at work?",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "This is what caught me too. Why the fuck would you want to put your kid in pain for your own image? Piercings and whatever else are *not* for the parents to decide for them. It’s their body ffs and she’s only a baby. \n\nHonestly OP, YTA 100% on what you did to your husband as well as what you did to your baby.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Right? This woman is so cluelessly selfish it's painful.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 345,
              "content": "And saying ‘he’s being selfish for needing time to decide’, what the fuck. His decision was essentially no, he just didn’t want to argue and hoped she’d take the goddamn hint.\n\nYTA, OP",
              "id": 21,
              "comments": [
                {
                  "score": 223,
                  "content": "Right? \"How long was I supposed to wait?\"\n\nYou were supposed to wait until the kid was old enough to decide for herself, OP. He gave you a soft no to a question that required a firm yes from both parents.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 29,
                      "content": "This. You should wait until she decides she wants her ears pierced, and can take care of the piercings. That's how it was done for me, as I was around 9 or so when I got my ears pierced, and I asked to get that done. I also have a nickel allergy, so it's a good thing I didn't get my ears pierced as an infant. OP, YTA.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Exactly this on the soft no! I feel like that isn't being stressed enough. \"Why didn't he say no?\" He pretty much did, she just wasn't listening. Maybe he was anxious about being more forceful because he didn't want to upset her, but the \"I do not want this\" factor was definitely communicated. It may not have been a verbatim no, but she understood it enough as a no that she felt the need to be sneaky. She knew damn well that was a soft no and doesn't want to admit to herself that she knew better but did what she wanted anyway.\n\nYTA, OP.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 168,
              "content": "I didn't even read much after 'suggested we do it behind his back' - automatic AH right there.  Partner said they wanted time to think, they didn't say NO - but OP went ahead anyway. Personally don't agree with poking holes in kids' body parts without their consent anyway  - and I have 2 daughters with pierced ears - but they CHOSE that when they were old enough to understand.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Lol she lost me at the title! I kept reading in case something redeeming was said, but no,  or only got worse. OP, YTA.",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "She lost me at the \"did it behind his back\". They're partners in parenting. Don't do things behind the partners back, and don't do body modifications without being on the same page. \n\nOP, YTA.",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "She lost me at the part where she tried to shift the blame to her own mother. \n\nSo let’s see - she attempts to blame it on her own mother (who’s also a giant AH here and should butt the hell out) but simultaneously attempts to posture herself as her opinion being more important then the father?!? \n\nWhat the ever living hell is this?!?\n\nYTA.\n\nHuge AH. Your mom is an AH. \n\nYou effed up but refuse to own it and your attempts to justify your BS unilateral decision about your daughter, you just keep making it worse.\n\nYou were sneaky, selfish, and thoughtless. \n\nAnd you are amazed he’s pissed. Unbelievable.",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Heard that so many times from my ex. *She was the mother and therefore owned our child. I had no right to him in any way*. \n\nAnyways, I now have full custody, and I have to show my son videos of his mother because he forgets what she looks like after years of no contact. \n\nYTA OP. And when I read the line about how your opinion as a mother holds more weight, not only did that stir up some hatred, but I decided I woupd divorce you over that comment. \n\nHope husband stands up for himself and gets the fuck out of that broken ass relationship. SMH no respect for her husband.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "That was perhaps the most jarring part, but it went sour way before that.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "She lost me at we decided to do it behind his back. As if that’s ever a good decision.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1270,
          "content": "And this part:\n\n“He got offended by that and went to stay with his mom who called and berated me for going behind her son's back and treating him as a less than when it comes to our daughter but **I never understood why he thought that.**”\n\nGirl what?! She literally said as the mother her opinion matters more (which is not true at all). Her opinion matters more when she’s arguing with her husband but she deflects when she gets called out on it. OP is an AH for real.",
          "id": 32,
          "comments": [
            {
              "score": 124,
              "content": "[removed]",
              "id": 33,
              "comments": [
                {
                  "score": 14,
                  "content": "that line blew my mind! like????",
                  "id": 34,
                  "comments": [
                    {
                      "score": 20,
                      "content": "To me it’s just one more red flag that OP will literally grasp at any straw she thinks she can use to sell her justification of doing this because SHE WANTED IT, so she was gonna make it happen no matter what. \n\nI mean, her husband was clearly uncomfortable with the idea but hadn’t pulled his thinking/words together yet, so instead of being a mutually respectful partner and giving him time or asking if they can schedule a conversation, she rushed to get it done before he could articulate a firm no.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Right?  He thought that because you explicitly told him that, OP!  \n\nYTA big time.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 580,
          "content": "The mother line coupled with “and treating him as a less than when it comes to our daughter but I never understood why he thought that”\n\nBecause OP literally told him she thinks her opinion matters more. \n\nPoor husband.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 449,
          "content": "She was brought up by a toxic AH.\n\nThat's where that attitude comes from.",
          "id": 38,
          "comments": [
            {
              "score": 277,
              "content": "OP YTA and your mom is justnomil. Your poor daughter and husband.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "That doesn’t excuse her behavior though, because she has become the toxic AH and is well on her way to becoming a justno herself. Fourteen years from now we’ll see the daughter on here explaining why she wants to live with her dad instead of her narcissist mom.",
              "id": 40,
              "comments": [
                {
                  "score": 6,
                  "content": "doesnt excuse it, no.  \n\n\ncertainly explains it, tho",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 444,
          "content": "This! Exactly my thoughts and what I wanted to say.\n\nOP, how would you feel when your husband took your child out to do something you haven't agreed upon and didn't really want, but said you would consider? \n\nLet's say you were to have a son and he wanted the kid circumcised, not for religion, but because he felt that'd be a good idea. It looks prettier or something.\nAnd you're not sure if you want that for your son. You say you will think about it and he doesn't bring it up for months, so you just do your own thing and kinda forget about it.\nThen one day, you come home and find out that he has gone behind your back and took your son to get circumcised.\nYou didn't agree upon that, he didn't ask you again. He didn't listen to your concerns or took into consideration how you felt, and then he also dares to say: \"yeah, but I'm the dad, and as a man I have a bigger say in whether or not my son gets circumcised.\"\n\nNow, I don't know your opinion about circumcision, but I figured this may be an example that'd do the job.\n\nYTA, OP. Major ass.\nYou did it because you think it's pretty.\nDid you think about looking up the risk?\nDid you think of just bringing it up again and see if he changed his opinion?\nDid you think of maybe waiting a bit longer before piercing her ears?\nThose ears aren't going anywhere, so what was your rush?!\n\nI agree with your husband that you did something to betray his trust. You went behind his back to do something you know he disagreed with before.\nYou're not the only parent in the relationship and your thinking that you have more of a say as a mother is quite toxic thinking. You should be a unity. There will be plenty of moments where you need to be one front and you are ruining that.\nBy not being an united front, you will end up confusing your child and giving them \"favourites\" in parents. Because: \"Dad said no to this, so let's try and ask mom, because she will likely not check if we asked dad already...\" or, \"...she doesn't care if dad said no already and will just say yes.\"\nYou may be creating an unequal and unfair environment if you keep this course.\nI'd advise you to talk to your husband and come to some sort of manner to actually do this together, as two parents forming one unity.\n\nIt can happen that you don't agree about something, but then you talk and listen to one another. You make it a point of discussion, or even a debate with relevant arguments if need be. And then you either decide, compromise, or find the middle ground.\nThis, what you did, is not the way to go.\n\n(All this comes from someone who has experienced parents who were constantly divided. Eventually one became more dominant than the other. They divorced and I never felt safe with one and always felt like I had to support the other. My situation might've been different than yours and it may have been more extreme, but what you state is basically how it started: one making decisions and not listening to the other. So believe me, it is confusing for a kid)\n\nP.s. sorry for the long rant/post",
          "id": 42,
          "comments": [
            {
              "score": 57,
              "content": "The constant strings of \"go ask your mother\" then \"go ask your father\" led to me learning to always ask when they were both present for big stuff.",
              "id": 43,
              "comments": [
                {
                  "score": 11,
                  "content": "I learned to first ask the one most likely to say No, since it saved me from running between them and wouldn’t get my hopes up. They were always clear that only two yeses would count.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Once my mother made the mistake of saying 'go ask your father' thinking he'd say no. I was asking for a Wii right after it came out and didn't have the funds to pay for it myself, so needed him for half of it. I of course said I would pay it back when I got paid next (And I did!) and he said yes, okay. She was a bit flummoxed by it as normally my Dad was very tight with the purse strings and wouldn't agree to large purchases like that.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I cannot stand parents who are willing to permanently alter their daughter's bodies painfully and without their consent \"because it looks pretty\". Way to value surface beauty over the autonomy of your human child. Also I'm willing to bet thay if OP had a son she wouldn't be sneaking off to assault him behind her husband's back \"because it looks pretty.\"",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yes, OP, please answer the above post re if your husband did a circumcision on your son without discussing it and agreeing on it together.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "And did she even think maybe her daughter wouldn't want pierced ears in the first place? Better to do it before she can decide for herself so mom gets her way! Hey, maybe dad should take her out and get her a tattoo!",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 294,
          "content": "Sometimes these are so easy. “AITA for going behind my husband’s back and making a parenting decision?” \n\nMe: “Probably yes.”\n\n*(reads it)*\n\n“Ok, definitely yes.”\n\nHow do people not write the headline and look at it like “Ohhhh…ok, yeah, I was an asshole”?",
          "id": 49,
          "comments": [
            {
              "score": 20,
              "content": "A lot of posts here have incredibly click-baity titles. \"Am I the asshole for taking a homeless man's only jacket in the middle of winter?\" Read the post and it turns out that the homeless man had just mugged the OP and stole a 6k leather coat that was their late father's or something. I was actually a little shocked that there wasn't some other factor here and OP really did just decide to overrule her SO.",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "\"and \"mutilating\" my baby daughter's body parts\", no less. It's not like a hair dye.",
              "id": 51,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 247,
          "content": "Have you seen the edit?  It's bonkers.\n\n> Edit/ putting this out there/ My husband was aware that I had plans to get our daughter's ears peirced and we've had many many discussions about it so it wasn't like it was out of the blue and I didn't bring it up with him. I did but he kept giving me the same \"I need time to think about it\" the entire time. How long was I supposed to wait? Why he kept stalling instrad of just saying \"just no\"? He just kept stalling and putting off any further discussions/compromises that we could've had as a way maybe to get me to just abandon the whole idea.\n\nShe seriously said \"how long was I supposed to wait\" over piercing the ears of a person who has only existed for a handful of months.",
          "id": 52,
          "comments": [
            {
              "score": 110,
              "content": "Also the answer to the question of \"how long should I wait\" is literally until the child can make their own decision. \"Her body, her choice\" except when it suits me I guess? I hope the OPs husband sends her packing and keeps the kid with him. YTA massively OP, like, really really REALLY vile.",
              "id": 53,
              "comments": [
                {
                  "score": 105,
                  "content": "I wonder if OP realises that by taking this \"great experience\" for herself (because her infant likely will have no memory of the event) she's actually ensured a different potential \"great experience\" will never happen.\n\nThe experience of her taking her daughter, old enough to ask for piercings herself, for her first ones.  \n\n* Talking together with her to make sure she understands what she's asking for\n* taking her to a reputable piercing/tattoo shop where she can have the thrill and excitement of going to such a strange environment (I went to one when I was about 13 when a relative was getting a tattoo and it was so exciting to be around these people who looked like rockstars, with walls covered in art, and the genuine and kind enthusiasm they showed when I showed them my own childish drawings)\n* Picking her first set of earrings with you\n* Holding your hand and bravely nodding to say she was ready to do it\n* That look of pride and excitement the first time she sees her new earrings on herself in the mirror after\n* Thank you so much mummy!  I love them!\n\nAll of that is gone.  Along with her daughter's opportunity to choose it, or not, as she grows into the person she's going to become.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I agree 100%. My mum did this with me as a child (I was 9) and I recently did the same with my similar aged daughter. We made a day of it and did all of the things above then when out for lunch together. It was a lovely bonding experience for us and her ears healed beautifully because not only was it done by a reputable piercer, but she's also old enough to care for them.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My mom's rule for piercing ears was that we had to be old enough to 1. ask for them ourselves, and 2. be responsible for all the aftercare ourselves.\n\nI got mine when I was 8 or 9, and it was a super exciting day for me when I did. Way more exciting than basically having always had them.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 229,
          "content": "Yea why the hell would you think a mother has a heavier weight? You're both raising a child. Both opinions count just as much. And doing something behind the other parents back is a huge breach of trust. \n\nBesides that I think piercing a babies ears is pretty stupid. My colleague got her ears pierced as a baby for culture reasons and she never wears earrings. Since her ears had a lot more growing to do, the earrings ended up at different places on the earlobe (like one grew more to the upper part of the lobe and the other on the lower part). It was not fixable later and so she ended up never wearing them ever again.\n\nAnd a baby can not properly take care of the new earrings with cleaning and twisting. I got my first earrings when I was about 14 and went with my mom. That was a very fun outing (besides the short pain lol). But it was my choice to get earrings instead of getting them forced on me. That's just selfish. YTA OP",
          "id": 57,
          "comments": [
            {
              "score": 25,
              "content": "Let's kids go through the multiple piercings phase as an angsty teen like the rest of us,  op. And let out be the kid's choice.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Agree with everything you said but just wanted to point out they recommend not twisting piercings as they heal now. My daughter just had hers done by a legitimate piercer and she said it can cause more issues to twist them while healing.",
              "id": 59,
              "comments": [
                {
                  "score": 7,
                  "content": "Ah I had a 2nd pair done 2 years ago and I still got that advice. But it was at a jeweler and I've learned since that it's better to go to a real piercer. Mine healed fine luckely, both times.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Unrelated, but for the record, Claire's is bullshitting when they say you need to twist, you shouldn't do that. If anything that just creates more scar tissue. Dunno why they still tell people to do that, probably because it's like getting your ears pierced behind a dumpster.",
              "id": 61,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 182,
          "content": "Agreed - YTA OP. Are you married to your mom or your husband, if you are sneaking around behind his back at her suggestion it seems like you may be confused about what a marriage is. So for the way you are treating your husband Y T A.\n\nAdditionally, coming from a woman who has never had her ears pierced because my parents let me make that decision for myself - Y T A. You might think it is pretty and normal, but what does your daughter think? Nothing about this yet because she's not old enough to understand. Starting her off with one less choice about her body is crap parenting and I think you've just proven yourself wrong, your opinion matters less than your husbands.",
          "id": 62,
          "comments": [
            {
              "score": 6,
              "content": "Yep me and my sister never wear earrings. Hers still get infected sometimes. Mine are luckily alright but my friends are uneven. You never know hoe they will grow as the kids age.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": "What really gets me is that she says directly that her opinion matters more than his and then goes on to wonder what could have POSSIBLY made him feel less than.",
          "id": 64,
          "comments": [
            {
              "score": 13,
              "content": "Right?  Full on shocked Pikachu.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13895,
      "content": "YTA. \n\n>1. It's normal thing for babies and 2. It looks pretty\n\nTerrible reasons to get out done. Also you went behind your husband back listening to your mother  Because you wanted to do what you wanted to do anyways. You know You'll be pissed he went behind your back listening to his father.",
      "id": 66,
      "comments": [
        {
          "score": 5537,
          "content": "Point number 3 was the one that got me riled up. “It’s a great new experience “ like what?! Changing your daughter’s natural body and putting her in unnecessary pain is a great new experience?",
          "id": 67,
          "comments": [
            {
              "score": 2889,
              "content": "Also, a “great new experience” for who?! It’s not like the baby is going to remember this and tell tales of the day she had that awesome experience with her mom.",
              "id": 68,
              "comments": [
                {
                  "score": 1932,
                  "content": "Going to get my ears pierced with my mom and grandma in 2nd grade is one my favorite memories!! I would have been so sad to have that decision made without me wanting it and not getting that experience when I could remember it like all my friends did. \n\nPlus, babies with earrings always look creepy to me personally.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 857,
                      "content": "My mom had her ears pierced as a baby and specifically didn't do that with me or my sister. She made us wait until we were 10 to make sure it was something we actually wanted (continued pestering about it since I was 8 lol) and so that we would be old enough to take care of them ourselves. I couldn't imagine having to worry about my baby ripping out her own earrings on top of all the other things you have to worry about as a parent.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I got mine done in third or fourth grade. It wasn’t super fun, but I asked for it, consented, and I’m happy enough with my choice.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Right? I remember both of my parents getting me ready to go, my dad put numbing cream on my ears for me before we left. I felt nervous sitting in the back of the car and they were both talking to me and reassuring me. It was a whole experience that we did together because it was something I wanted and asked for. I had no idea at the time, but my dad was into body modification and had TONS of non-visible piercings, he actually could have done mine himself (he did a lot of his own). They took me somewhere decent and held my hand and it's a good memory. I felt cared for, respected, and seen. Why take that away from your child? And what if they decide they don't even want pierced ears??",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Not to mention watching your kid go through the pain. I hate when my kids get shots as infants because they don’t understand and all I can do is try and comfort them through it, and that’s something that 1) is medically important and 2) hurts for way less time.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Don't have kids, got my ears pierced as a kid, they got infected...so extra care needed. Anyway, I always saw getting a baby's ears pierced as one more thing a parent has to take care of and clean.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "also the holes are in a stupid spot as you grow.  like obvious ethical issues aside.\n\nsource:  pierced at 3 months old and would never wear earrings in those holes.",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "You know she's only thinking about herself for the experience, no regard for the daughter. At least now the experience is soured by her terrible judgement and the events following.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 395,
              "content": "What if she grows up and actually didn't want pierced ears?",
              "id": 77,
              "comments": [
                {
                  "score": 260,
                  "content": "Lmao that happened to me. I had mine pierced when I was around 4 or 5 (and I actually still remember how badly it hurt - it was NOT a great experience).  I'm 34 now and I really wish that I had never gotten my ears pierced.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 110,
                      "content": "When I was six I got piercings done by a shitty mall gun, and some weeks later somehow the back of the earring actually went into my earlobe and I had to get to removed at the hospital. My ears have permanent ugly scars from the piercing gun too.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I was thinking it must have hurt the infant.. poor kid",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 248,
              "content": "But isn't putting a baby through pain, possibly having to deal with infections and making her suffer even more, hoping the metal doesn't get embedded in her flesh, hoping she doesn't injure herself with them and hoping she isn't accidentally allergic to certain metals just the most *wonderful* experience? I mean, OP's mother agrees with her, so it must be great fun, right? Right?\n\nEdit: OP, your edit just makes it worse. Learn to communicate with your partner like an adult and reach a definite yes/no together instead of this vague “he wouldn’t say yes so I did it anyway” crap.",
              "id": 81,
              "comments": [
                {
                  "score": 7,
                  "content": "Right… poor little baby must have been in pain! Such a wonderful new experience… pain at the hands of mother and grandmother😕",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "the great new experience thing bothered me too. i’m a guy but all my sisters had their ears pierced young (as babies or toddlers), and they all wish they hadn’t. some like their earrings and some don’t, but all wish our family had waited until they were old enough to consent.\n\ni have one sister who is VERY gender nonconforming & hates that even with the earrings out she has holes in her ears showing they were there. she considers it being feminized against her consent. i know this is an extreme case but it DOES bother her that she was never asked for her opinion on earrings.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 954,
          "content": ">1. It's normal thing for babies\n\nYou know what's also an unfortunate thing? Babies get their ears pierced by those shitty piercing guns.\n\nThey cause blunt forced trauma and they can't ever be properly sanitized because of their design. If you were to take your baby to a professional piercer they'd refuse you because babies ears aren't done growing and piercing their ears now will cause them issues; like they'll end up in different places and crooked when they're older.\n\nMost parents won't take no for an answer and get it done with those guns. Plus a baby can't consent to that, wait until their old enough to decide for themselves.\n\nOh and YTA OP.",
          "id": 84,
          "comments": [
            {
              "score": 244,
              "content": "This 100%. I’m waiting for my daughter to be a little older but we’re going to a professional piercer when she wants hers done. Those piercing guns are never cleaned properly before or afterwards.",
              "id": 85,
              "comments": [
                {
                  "score": 136,
                  "content": "First off thank you for wanting to take her to a professional. \n\nNeedles may be more scary, but they're safer and just all around the better option.... And in my opinion should be the only option. I've had my septum done by a professional with a needle and it's healed great, hasn't caused any issues and isn't wonky looking.\n\nOh yeah with lobe piercings, your supposed to use a long flat back labret jewelery to give the ear room for healing. Those butterfly backs crush the ear and they only have one size earring; it's not a one size fits all type of thing. So while the ear swells up, the earring is squeezing it and it'll make it harder to heal.\n\nI'm hoping to get a third lobe piercing to see what it actually looks/feels like to have my lobe pierced by a professional and not some inexperienced teenager at Claire's.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I also have a strong metal allergy. I can’t wear earrings. So I want to take every precaution necessary to avoid infection when she wants to do it.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Re: the needle being scary, I'm not sure if all piercers do it this way but the one I went to recently never even showed me the needle. I'm sure if I'd asked to see it I could have, but I'm also sure it was very obvious I was nervous and that showing me would make things worse. He let me know what he was doing at each step in the process, but since the piercings were in my ears it was all outside of my field of vision.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I had both sets of lobe piercings done with a gun (my parents didn't know any better when I got my first set (I got them for my 5th birthday after begging for three years)) and I was dying to get my double at 16. I got daith piercings three years ago at a piercing studio, and I decided that I would take my daughter there if she wanted to get her ears pierced. I was very impressed with the piercer. He changed his gloves five times during the process to make sure he kept everything clean. He ran one of the rings through the autoclave because they didn't have any sterile ones. \n\nShould be noted that OP is a colossal AH. I would NEVER do anything like that without my husband's consent, and I want my daughter to make that decision for herself!",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I had to have my ears surgically repaired twice as a kid after getting earring gunned as a baby so this post pissed me all the way off.",
              "id": 90,
              "comments": [
                {
                  "score": 11,
                  "content": "That's another thing that can happen too, those guns can really wreck your ears.\n\nI read somewhere that people tend to go to Claire's because it looks nice, clean and friendly in there whereas people think a piercing shop is scary and dirty.... And of course to some people it's \"satanic\".\n\nIt's actually the opposite, the piecing shop I go to has some very friendly staff and they make sure to keep everything clean. However some people would rather fuck up their ears at Claire's because they like the look of the store better.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Right? My daughter had a great experience she REMEMBERS when she CHOSE to get her ears done at age 7. Which was the youngest our piercer will do even with parental consent, because they apparently respect a child's body better than half the crappy parents going to Claire's in the mall.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 270,
          "content": "You're right and to add to that: those aren't reasons. There is really only one reason to get piercings and that's if the person wants them. Anything else are just excuses for selfish actions.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "It most definitely isn't a normal thing for babies either, even when it's culturally the norm it seems akin to getting cosmetic procedures done on animals. OP is most definitely YTA",
          "id": 94,
          "comments": [
            {
              "score": 13,
              "content": "I'd put it up there with non medical circumcisions. It's \"normal\" for us in the US to cut off part of a babies penis but that doesn't mean it is right. \n\nIt's all body mutilation to me, or maybe just unconsenting body modification. Let the kid decide for themselves when they're older if they want pierced ears.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "It's normal in mexican culture, but even then OP clarified it's something new to the family so they decided to burden the daughter with it😐 definitely the AH",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I have many friends/relatives with daughters and none have their ears pierced that I know of. We didn't even consider it for our daughter. So it's not that normal these days",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I have vague memories of baby ear piercing being more common about 30-ish years ago.  But it's definitely something that would be judged negatively now, at least where I live.  Many piercing places locally now refuse to pierce baby ears.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 133,
          "content": "I did not even read past those two. #1 is beyond untrue. It is not \"a normal thing for babies\" at all. YTA OP.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 121,
          "content": "Gotta love violating your baby’s autonomy so they’ll look pretty. Americans and anyone who dies that to their baby boys or girls are the worst",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah, it’s her daughter not a baby doll. This isn’t “normal” for her cultural and she’s just doing it to accessorize her literal child. Major YTA OP.",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Lol, even though it's irrelevant, I'm from a culture where all the girls get their ears pierced as a kid, but even we wait till ages 5 or 6\n\nYTA, first off you went behind your husband's back. So what if you both had agreed to getting it done, but not on the timing. You should see eye to eye on all the decisions you make, ESPECIALLY for your daughter. What even was the hurry to get the baby's ears pierced, I can't seem to understand that.",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "EXACTLY!!! I have a 9 month old, and I can't wrap my head around this. I would never violate my husband's trust, or my daughter's opportunity to CONSENT to having her body permanently altered. I'm blown away. OP, YTA.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11713,
      "content": "YTA.\n\nIt's a child, not a christmas tree for you to decorate. And you explicitly went behind your husband's back for it, too.",
      "id": 104,
      "comments": [
        {
          "score": 3298,
          "content": "[deleted]",
          "id": 105,
          "comments": [
            {
              "score": 330,
              "content": "i agree. i always wanted my ears pierced but my mom made me wait until i was 8. i was always annoyed but now i’m thankful that she waited for me to make a decision. so YTA op big time.",
              "id": 106,
              "comments": [
                {
                  "score": 29,
                  "content": "My mom had me wait till I was 16.  She wanted to make sure I was mature enough to keep it clean.  Although she said if I had asked for it when I was younger, she probably would have let me.  I agree with YTA.  I don’t like how she talks about her baby like she’s an accessory.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 5,
                      "content": "that’s a smart idea! i was really stubborn and i think the real reason my mom let me was cause my friend got hers pierced the same time. and a baby is not an accessory. she’s a living human and it’s going to be a pain for her to take care of the piercing she didn’t even want. parents are crazy. hope if the kid doesn’t want it that it will close up eventually.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My mum had my ears pierced as a baby, and pressured me to do the same to my daughter. I refused and I’m so glad I did, my girl decided when she was 6 she wanted them done (she asked about every day for a year before her aunt got them pierced for her 7th birthday) and now 3 years later rarely wears earrings. I’m so glad I gave her the autonomy to make her own decision about modifying her own body that I never got!",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 275,
          "content": "And I bet op took her to some fucking mall kiosk where they use a piercing gun which is HORRIBLE FOR THE CARTILAGE and put her baby through unnecessary pain just so she could decorate her like a fucking doll. \n\nOP you are gross and YTA.",
          "id": 110,
          "comments": [
            {
              "score": 139,
              "content": "I do fully agree that it needs to be done by an actual piercer with a needle and when the person is old enough to consent to a permanent body modification.\n\nThat said, NOWHERE will pierce a baby’s cartilage. Literally nowhere. It would have been the lobe.",
              "id": 111,
              "comments": [
                {
                  "score": 19,
                  "content": "I mistakenly believed the love was also cartilage. A piercing gun is still not good for lobes.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Exactly! It’s a baby, a living person. Not an accessory.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "And then tried to say, \"but it was my mom's idea!!\"\n\nLike a damn child. Op, YTA.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6981,
      "content": "YTA \n\nAnd he’s right, you’ve damaged the trust and asserted that you have more of a say in your daughter than he does, which is a fucked up and rude as hell thing to say.\n\nI also think that piercing babies is dumb, they don’t need accessories and permanent changes shouldn’t be made to their bodies until they’re old enough to ask.",
      "id": 115,
      "comments": [
        {
          "score": 1501,
          "content": "She blamed her decision to go behind his back on her mum. Asserting that the grandmother has more say in his daughter than he does",
          "id": 116,
          "comments": [
            {
              "score": 717,
              "content": ">She blamed her decision to go behind his back on his mum. Asserting that the grandmother has more say in his daughter than he does\n\nAlso Show's OP's immaturity. Rather than own up to doing something shitty, she tried hiding behind her mother.",
              "id": 117,
              "comments": [
                {
                  "score": 6,
                  "content": "I meant to put her mum, oops",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 310,
              "content": "She actually blamed her decision on her OWN mom.  \n\n\n> Mom suggested we do it behind his back and he'll then come around and see for himself that it's a good thing since he was having doubts and being indecisive. I was hasitant but I agreed and chose a day where he was out all day.\n\nWhy are there more than two people in this marriage? Her mom, his mom, etc....",
              "id": 119,
              "comments": [
                {
                  "score": 6,
                  "content": ">Why are there more than two people in this marriage? \n\nBecause she's entirely incapable of making an appropriate adult decision. She needs a minder unfortunately her mother is just as bad.",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "How do you even trust someone with your kid after they argue, “It wasn’t even my idea, it was my mom’s idea & I just went along with it!”",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 141,
          "content": "Especially because piercings can get infected so easily and metal allergies are so common. Why do that to someone who is still developing an immune system? \n\n\nAnd you KNOW she didn’t go to an ENT and probably had someone use a piercing gun (which is SO damaging to the earlobe). She’ll be lucky if the piercings are straight and stay centered as they baby grows.\n\n\nBut apparently it’s the mother’s prerogative to potentially fuck up her baby’s ears before the baby can decide for herself?",
          "id": 122,
          "comments": [
            {
              "score": 18,
              "content": "But but but iT lOoKs pReTtY!!!‼️‼️💝💖💕💞🎀👑💘",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Apparently he was acting like she's only his daughter. Meanwhile she actually acts that way. YTA",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I think if they're not old enough to be unsupervised with choking hazards, they're not old enough to have choking hazards physically attached to their bodies.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6803,
      "content": "Oh wow…YTA, and in a HUGE way!  Let me count the ways:\n1. Putting your ideas of what is “pretty” for a newborn ahead of your husband’s opinion and concerns.\n2. Putting your mothers opinion in front of your husbands.\n3. Sneaking around behind his back to do this because YOU KNEW he would be mad.  Who does that?\n4. Acting completely shocked when he actually did get mad!  (I’m literally rolling my eyes)\n5. To add insult to injury, you then told him “I’m the mother and my opinion does have heavier weight than his”.  Are you kidding me?!?!  \n6. You are now sooooo confused as to why he isn’t talking to you and why his parents are mad, and you and your mother are calling him selfish, but you just can’t understand why he left.\n\nI hope you enjoy being single.  And possibly a single mom for that matter too.  He may not come back after all that you did.",
      "id": 126,
      "comments": [
        {
          "score": 3092,
          "content": "7. Piercing a baby isn't fine. The piercings won't be symmetrical, and unless op got their baby to a piercer, using a piecing gun is a big NO (they can traumatise the tissue, they can't be cleaned properly, piercings made with guns get infected easily). Jesus Christ I hope people stop using piercing guns.",
          "id": 127,
          "comments": [
            {
              "score": 570,
              "content": "Great point!  I wish I had never gotten my piercings done with a gun, and instead went to a reputable place that did it gently with a needle, but alas…I’m a bit older than this generation that now knows better.",
              "id": 128,
              "comments": [
                {
                  "score": 168,
                  "content": "Piercing guns are a nightmare, I also didn’t know better for my first two “extra” ear piercings (I did get my ears pierced by a nurse when I was a newborn at the hospital but she used a needle and “it was normal” not that I condone what OP did) and it’s been 10 years and they still get tender when I change the jewellery.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I didn't know better until just now....",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "If they’re still tender that long after you might want to try titanium jewelry as it is non reactive. My ear piercings (by gun) were the same and after switching to titanium they no longer hurt at all. If I wear regular earrings they start hurting again.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It's never too late to get them re-pierced with a needle! My ear holes from a piercing gun at Claire's gave me major trouble until I was in my early 20s. One of my lobes had a pretty thick scar, it hurt to wear earrings, and the holes closed up if I left the earrings out for more than a couple weeks. No fun! Finally in my early 20s I decided I was going to get them re-pierced. I went to one of the best piercers in my city who came recommended by my friends. He took extreme care to get the placement and angle exactly right so the earrings would sit just right. Then he pierced right through my ugly scar tissue. They healed perfectly. It's been YEARS since I've had an earring in, but the holes have never closed up, it's just that the skin at the backs of them will heal over if I wait too long. (My mom is 71 and got hers pierced with a sterilized sewing needle at a sleepover, and even hers healed better than mine from a piercing gun. They've never closed even though she doesn't wear earrings anymore.)",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 531,
              "content": "Also you're just straight up mutilating a baby for aesthetics like it's a fucking doll",
              "id": 133,
              "comments": [
                {
                  "score": 86,
                  "content": "I see it in public all the time and I get so pissed at the parents. No, John and Denise, your little angel does NOT look good with hoop earrings.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "More even so than only aesthetics. It is to show the world that baby is a girl. Nobody pierces baby boys, right?",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "My rule is that it can't be until they're old enough to take care of the piercing themselves. It might be five years old, it might be when they're 17, depends on the kid and how responsible they can be (Kind of like deciding which/when a child can have a pet). \n\nThat, and, you know, they can consent. A baby can't. And a baby *definitely* can't handle taking care of piercings. Nor should they be enduring that type of physical trauma. Ffs we are just now getting over compulsive circumsisions, this is mind boggling",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 360,
              "content": "[deleted]",
              "id": 137,
              "comments": [
                {
                  "score": 76,
                  "content": "Either that, or OP and her mom thought heating up a needle with a lighter and poking it through the baby's ears by themselves would be a great family bonding activity.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Wow Parent Trap vibes LOL",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "op definitely went to claire's",
                  "id": 140,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Or walmart",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 99,
              "content": "I didn't even read the post and just came here to say this. Christ on sale, why? YTA",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Can you say it again because I refuse, my sister was like Clair’s and I went fuck no. No guns, if I do it I’m doing it right… I have had well over 40 piercings, after that much time money and care, she deserves it all and then some. No guns",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "> And possibly a single mom for that matter too\n\nI hope not- mom is too immature, so dad should fight for custody.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">treating him as a less than when it comes to our daughter but I never understood why he thought that.\n\nNot to mention the above quote.  Maybe he thought that he was being treated this way because YOU LITERALLY TOLD HIM AS THE MOTHER YOUR OPINION MATTERS MORE THAN HIS.   YTA",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4456,
      "content": "[deleted]",
      "id": 146,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2676,
      "content": "YTA.\n\nFor me it's not normal to get babies pierced. Where I live it's more common to do it when they actually want it themselves. \n\nShould a baby need piercing to be seen as pretty? That sentence made me feel sorry for your child. Apparently her look is more important for you than her heath and husbands consent.",
      "id": 147,
      "comments": [
        {
          "score": 207,
          "content": "[deleted]",
          "id": 148,
          "comments": [
            {
              "score": 54,
              "content": "I agree. I am white, from a predominantly white country and it is the norm in here to get your ears pierced when little. It’s a cultural thing. I don’t really understand what OP implied with that sentence",
              "id": 149,
              "comments": [
                {
                  "score": 101,
                  "content": "She meant that she isn't Indian, Mexican, Nigerian, or from another country where it is unremarkable to pierce a baby's ears. ([https://en.wikipedia.org/wiki/Infant\\_ear\\_piercing](https://en.wikipedia.org/wiki/Infant_ear_piercing))\n\nWhere I grew up (West Coast US), it would be notable to pierce your infant's ears. It was pretty much the big rite of passage to get it done in middle school.\n\nInteresting thing about the wiki article is the very second paragraph on the page says: \n\n>Due to the pain and health risks associated with baby ear piercing, critics characterize it as a form of child abuse and have called for bans of the procedure",
                  "id": 150,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "It stems from the mentality that whites are the \"default\" race or culture. Everyone else is \"ethnic\" and whatever they do can be attributed to their \"culture\" - no nuance, environmental context, or individuality. It's a racist way of \"othering\".",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I thought that OP was saying the opposite - it’s not a cultural reason that her husband DOESN’T want the ears pierced.",
              "id": 152,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2423,
      "content": "\\[...\\] treating him as a less than when it comes to our daughter but I never understood why he thought that.\n\n\"my opinion does have heavier weight than his to some degree.\" \\[...\\]  << You answered yourself...\n\n&#x200B;\n\nYTA no doubt bout that. Good luck to him.",
      "id": 153,
      "comments": [
        {
          "score": 424,
          "content": "Yeah as a father going through divorce YTA. \n\nEVERY FATHER HAS THE SAME RIGHT AS THE MOTHER. \n\nLET ME SAY IT AGAIN SINCE YOU SEEM TO BE DENSE.\n\nEVERY FATHER HAS THE SAME RIGHT AS THE MOTHER!\n\nYou don't get to make decisions because you think you have more rights. It's both your kids equally. It doesn't matter you carried your child to term. Your husband was there through it all and I'm sure is the one who provides for you. \n\nYou need to seek a counselor and work on your ideology of what being a parent is.",
          "id": 154,
          "comments": [
            {
              "score": 83,
              "content": "I agreed with all your points until the end. Don’t assume that the dad is the provider. It could be divided, pulled from mother’s savings, etc.",
              "id": 155,
              "comments": [
                {
                  "score": 67,
                  "content": "I think that assumption was made because anyone who pierces a newborns ears without the agreeing of the other partner is probably a lousy parent.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 13,
                      "content": "very fair",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1720,
      "content": "YTA - \n\nPutting aside the lack of respect for your husband for just a moment \n\nDid you know babies can't be pierced with a needle and have to be done with a gun.  This is bad for so many reasons and can cause massive issues as the child grows older. \n\nDid you go to a reputable piercer or did you go to Claire accessories or somewhere similar to that where they put someone untrained on a piercing gun? \n\nHave you wondered why a reputable piercer wouldnt pierce a child? \n\nGoing back to the betrayal, you KNEW it was wrong so you did it anyway.  Something like mutilating your child's ears for no purpose except \"it looks pretty\" without the permission of the other parent is wrong.   Then you say \"it was my mother's idea\". If your mother told you to jump off a cliff would you do it? \n\nYou basically then told your partner that his opinion on how your daughter is raised and looked after doesn't matter unless he agrees with you.  That is his child as much as it is yours.  \n\nAs you said, this wasn't a cultural thing. It was a vanity thing. Babies aren't fashion accessories.  If both parents agree to have it done then that's on you both but anyone who has done research into piercings with piercing guns know its a bad idea.",
      "id": 158,
      "comments": [
        {
          "score": 548,
          "content": "This, exactly. This was about mom’s ego and vanity, nothing to do with the welfare of the HUMAN CHILD. So gross. And I say this as someone who worked at a Claire’s for 5 years. I refused to ever do this to a baby, ended up quitting over it because a mother threw such a fit when I politely told her I wouldn’t pierce anyone not able to verbally consent themselves. Parents like this, no, mothers like this (cause I never saw a dad do it) make me so angry.",
          "id": 159,
          "comments": [
            {
              "score": 117,
              "content": "Good for you for putting your ethics over a job.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Thank you for caring about young children's inability to give consent!",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Respect. This is such a creepy tradition... putting a child through pain and permanently altering their body when they are unable to decide for themselves and consent, just because the parent thinks \"it's pretty\", ugh.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "This really needs to be higher. It's straight up irresponsible to piece a baby's ears. The earliest id allow it would be 4/5 /maybe/ assuming the kids really pushing for it and will understand the process of actually getting good safe piercings will be, and it would have to be done by a professional with punches like they properly need to he and not with a gun.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Honestly I think even if it was cultural it would be no excuse. It is cultural where I come from and many people are already starting to question it. I had my ears pierced as a baby too, and now the holes are crooked. And also I have bad nickel allergies and as a child my mom would force me to keep my earrings on even after I told her they hurt, so that's pretty bad too.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The cultural thing got me too and that she had to mention that they are white. Is she so frekin sheltered that she doesn’t understand that white people can have cultural things too, and that our way of living isn’t “the norm”. Like wtf. \n\nBut yeah, I’m not surprised that OP blurted out some casual racism when she was already on a roll. She seems awful. Poor kiddo. \n\nYTA",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 848,
      "content": "I didn't even have to read the post to think YTA, and then I read the post and I'm kind of disgusted. Not only is piercing a baby's ears extremely dangerous (because I know damn well you didn't actually go to a piercing shop, my guess is Walmart or Claire's) but to blatantly disrespect your husband, the father of your child and his *extremely* valid concerns and then call his anger an overreaction is actual bullshit.\n\nMy ears were pierced as a baby, at a Walmart, and as soon as I could take them out I did because they were extremely uncomfortable due to me being a BABY and not being able to leave the piercings alone.\n\nYTA on literally every level imaginable in this situation and I'm looking forward to the consequences of your actions within your marriage, and I really hope your child doesn't experience too much pain due to your selfish mistake.",
      "id": 166,
      "comments": [
        {
          "score": 200,
          "content": "This. There’s no way she isn’t an AH. She didn’t get the consent of her daughter to pierce her ears and disrespected the father who had valid concerns because she’s the mother.",
          "id": 167,
          "comments": [
            {
              "score": 168,
              "content": "\"I'm the mother and my opinion does have heavier weight at some point\"\n\nSo fucking gross and selfish in so many ways, ugh.",
              "id": 168,
              "comments": [
                {
                  "score": 35,
                  "content": "She really doesn’t understand co parenting at all, no parent has a rule over the other when your co parenting a child. Both opinions should be taken into account",
                  "id": 169,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I wonder if he's going to reconsider having any more (possibly planned) kids with her, if he's going to be relegated as just \"the sperm donor.\"",
                  "id": 170,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Honestly I really hope this was eye-opening for this guy and he's already prepping divorce papers. This incident is so telling of how OP will behave moving forward in their marriage and as a parent.",
                      "id": 171,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "She couldn't have gone to a reputable shop, since a reputable artist won't do body mods on someone who can't consent. Infants can't consent.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}