{
  "post content": "My (f26) husband (m26) works long days. Pretty much 7AM-6PM, sometimes even later. (He is a utility locator, if that's helpful. And spring-summer is the busiest time.)\n\nHe sets his alarm for 5:30 AM. Every morning. Even on weekends because he is fearful of it not working when it needs to. No matter how many times I try to explain that you can set a schedule for it.\n\nWe don't actually get up right when the alarm goes off, we generally push snooze until it's 6 or 6:30. His workday starts whenever he gets in his company vehicle and drives to a ticket.\n\n\nWhy he sets it for 5:30 is a mystery. I am not a morning person, and he is the one who presses snooze.\n\nI repeat, I am not a morning person. And lately, I have been having trouble sleeping. Yet my husband insists that I get up with him so I can make his work lunch. \nWell, today, I had a particularly hard time getting up. And while getting up, I was in a fog. So I moved slower than normal. I had decided to give him leftover pasta salad and make him a sandwich to go with it.\nWhilst I was in the kitchen, he recieved 3 emergency calls. Which meant he had to leave before I could finish packing his lunch. I hadn't even pulled out the salad yet due to having trouble finding any deli meat for his sandwich. \nHe began rushing me and telling me \"This is why I pester you to get up. Did you even start on my lunch?\"\nI said \"I was trying find-\" but he cut me off. \n\"I guess no lunch for me then.\" He snapped while pouring himself coffee in a travel mug.\nI shushed him, which I guess was the wrong thing to do.\nHe started ranting at me about how it's always so difficult to get me up. \nI snapped and said \"Well maybe you should be a man and pack your own lunch from now on! That's what *family member who has the same job* does!\"\nHusband snaps back \"Well, I'm not him and you're not *his wife*!\"\n\nI said \"Glad that's clear, either way, expect me not get up at all next week and pack your own lunch from now on.\"\n\nIn the midst of all this, I had packed him a container of the salad and a fork. At least it was something. \nHe stormed out as soon as I had zipped his lunchbox for him. \n\nI know a lot of this was said in frustration, but I admit I do envy the family members who are in the same positions as us. The wife and I are both stay at home moms with toddlers, yet she's not expected to always pack her husband's lunch. He just grabs whatever's in the fridge or preps it at night so he can grab and go the next morning. I tried doing that for my husband and he complained about it not being fresh. \nI should point out the family member is in his late 30s, so I guess it's a matter of maturity. \n\nBut I feel the need of outsider's opinions. \nAm I the a-hole here?\n\nUpdate: I posted an update in the comments, but I am sure it has been buried by now.\nWe talked it out. We agreed it would be a good idea that IF I was to keep packing his lunches, I will do it at night from now on. \nI actually like packing his lunches, it's the getting up that early in the morning that is my main issue. \nHe DOES appreciate me, and said so. I know everyone here has a perfect man who has never made mistakes nor snapped at you when feeling rushed. But I am happy my man isn't perfect because he would be boring. I'm not perfect either and can list many mistakes I have made. I know I have posted things here before about my husband. And the responses to those posts have helped us discuss the problems. You are only seeing small blurbs of out life. Not all of it. Remember that when people post about an issue in their relationships. \nThank you for the comments, either way.",
  "id": 1,
  "comments": [
    {
      "score": 9843,
      "content": "NTA\n\nYour husband is a grown man;  he can pack his own damn lunch.  The fact that he thinks that it's your job because you're his wife just *reeks* of misogyny.  And the fact that he insists on setting the alarm that early and hitting snooze a bunch (including days when he doesn't work), even when it negatively impacts your own sleep, paints him as a very selfish person.",
      "id": 2,
      "comments": [
        {
          "score": 1816,
          "content": "Good point. I wonder if OP could leverage any sense of self-worth this man has: “I won’t put you in a position to look so selfish and helpless in front of your coworkers by robbing you of the chance to make your lunch! You’d better do it, because otherwise on paper you’re painted as a selfish child who treats his wife like she’s his nanny. Nobody wants that for you, dear.” 😂",
          "id": 3,
          "comments": [
            {
              "score": 26,
              "content": "I love this. It’s passive aggressive as he** but it’s awesome!",
              "id": 4,
              "comments": [
                {
                  "score": 3,
                  "content": "I mean what’s more passive aggressive, really, though: “for your own good,” or silently assuming the power of millennia of misogyny 🤷‍♀️😂",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Good point. :)",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 617,
          "content": "I'm just baffled that an adult requires his partner  to pack his lunch when he has perfectly functioning hands and a brain.",
          "id": 7,
          "comments": [
            {
              "score": 407,
              "content": ">and a brain\n\nBold of you to assume his works.",
              "id": 8,
              "comments": [
                {
                  "score": 126,
                  "content": "His three brain cells are all fighting for second place apparently..",
                  "id": 9,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Three is an overstatement.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Lmao I'm stealing this",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I'm definitely using this from now on. Thank you!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "If he's got 3, they're fighting for 4th place.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Gotta give them the benefit of the doubt.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Especially since the “packing” seems to be: putting a container and a fork in a lunchbox? Like why is this something he even needs someone else to do.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I'm equally baffled that people stay in relationships with men like this.",
              "id": 16,
              "comments": [
                {
                  "score": 3,
                  "content": "No one wants to admit that they made the wrong choice. \n\nAlso, he might be a good husband in other aspects, though I would hiss at anyone who wakes me up and demands I make them lunch.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I have one worse for you - my mother makes my brother get up in the morning so that he can wake her up and pack her lunch for her in the morning.  I don’t know how she functions honestly, she stays up all night “watching” TV when really, she passes out around midnight and sleeps on the couch until 3-5 AM.  Then drags herself to bed and disrupts my dad’s sleep by turning on or leaving on lights, loudly opening doors, making tons of noise, arguing with the dog to get off the bed, and then playing on her phone until she falls asleep again.  She’s timed it so that her alarm goes off with the exact amount of time she needs to get ready for work and drive there, barring any emergencies, snooze buttons, or bad traffic and still doesn’t get up with it.  She just lets it blare the radio loudly for the whole house to hear.  And then she stays at work until sometimes 10 PM because she “has no reason to come home.”  Then rinse and repeat.  \n\nAnd yes, my mother is a narcissist.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This goes back to the olden days when women did ALL the housework and the men paid ALL the bills.  I had aunts and uncles like that, and my in-laws were like that.  It made it a challenge when I married my husband, and had a job outside the home.  He was used to being waited on, but that's not me.  \n\nAlthough I admit to doing 100% of the cooking, and I did pack up the leftovers for lunches the next day.  My husband ended up doing ALL the dishes and vacuuming as a trade-off.  To be honest, I wouldn't trust his cooking.",
              "id": 19,
              "comments": [
                {
                  "score": 3,
                  "content": "Honestly, I just feel sorry for those women in the olden days. I don't know if they took that role because they wanted to or because they had no choice. \n\nI'm glad your husband learnt to lighten the load. I hate cleaning, but I gotta do it when it's just me.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thanks.\n\nIt depends on the woman.  My mother-in-law and aunts were very proud of \"not having to work\" and viewed working outside the home as something demeaning. My MIL in particular used the fact that her husband \"wouldn't help\" as justification for not getting a job.   My mother preferred working because she liked earning money (she was a teacher.)  My dad and the three daughters were expected to pitch in.  My dad didn't get married until he was 34 (he was in WWII, went to college, then met my mother.)  He was used to taking care of himself.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -50,
              "content": "giving the hours he works, I  do not see why she can't pack his lunches for him. If my husband worked those hours I would not be complaining about packing a lunch for him.",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 475,
          "content": "Also can we address how pasta salad which is pre-made in one container going into a separate container is somehow \"more fresh\" when scooped in the morning vs the night before? And how the hell is deli meat \"fresh\"? Ok the bread or cheese might get soggy? Or something? Then pack the bread or cheese in separate baggies but make sure to add a packet of stone ground Mustard or it will end up like that lady whose MIL made her sandwich look like \"shit\"",
          "id": 23,
          "comments": [
            {
              "score": 44,
              "content": "A dab of Dijon between cheese and meat sounds like it would work... I don't pack sandwiches because the condiments ooze into the bread too much\n\nThis sandwich system sounds like it would work for me",
              "id": 24,
              "comments": [
                {
                  "score": 3,
                  "content": "I'm glad! Lol",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "ALWAYS sandwich the squishy stuff between the not squishy stuff. When I make PBJ for my daughter's lunch I put PB on both pieces of bread so the jelly doesn't make it soggy. If I make her a hoagie, the condiments are between the cheese and the veggies. Just say no to condiment ooze and soggy bread.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My trick for not soggy packed PB&J is to put peanut butter on both the inside bread faces. It keeps the jelly from soaking into the bread in the lunch box. Is also my go to for just making one now because hubby loves peanut butter. lol",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "The fact that he thinks it's her job is already a problem - but he's entirely *ungrateful* for it. Like it's her duty and not a kindness she's doing for him.",
          "id": 28,
          "comments": [
            {
              "score": 62,
              "content": "The second my husband complains about something I do for him out of love, is the exact moment I stop doing it for him ever again.",
              "id": 29,
              "comments": [
                {
                  "score": 12,
                  "content": "I had an ex who complained about the hand-crafted gifts I used to make him \"just because\". Guess who never got another one, and letter complained that I \"never do anything nice for him any more\"? Yeah, there's a reason he's an ex.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My mom regularly gets upset with my for not making my husband sandwiches when we are at her house. My husband does not want me to make sandwiches for him because he is a grown ass man who can take care of himself.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Me too",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "[removed]",
          "id": 33,
          "comments": [
            {
              "score": 411,
              "content": "I hate these people who are too precious to have things packed the night before.",
              "id": 34,
              "comments": [
                {
                  "score": 148,
                  "content": "Oh my god right?! That’s what I would do when I was in school! What’s the difference if it sits in a lunch bag in the fridge or it’s original container?",
                  "id": 35,
                  "comments": [
                    {
                      "score": 199,
                      "content": "I always packed my lunches for work in advance I feel like this type of man just wants an excuse to bother their partner",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I’d much rather just have a lunch to grab than have to risk not getting up in time to make it anyways",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "I'd rather have the 5-10 minutes extra sleeping time.",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "I would starve and die if I didn't pack my lunch the night before. There is nothing good about morning and I want as little interaction with it as possible.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I do not get it. I pack my lunch the night before (or prepare it & grab the containers in the morning fro. The fridge). There's no need to get up early to get together your lunch.",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 151,
              "content": "This!!!! In our house my husband packs the lunches because I’m not a morning person. I *make* them in advance for freezing, so it’s teamwork. OP your husband needs to check himself. You do not have to make his lunch just because you’re married to him. NTA, but he sure is!!!!",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "My kids pack their own lunches (10 and 14). Their school has microwaves for the students so I always make extra food at night and they portion it out for themselves. I do toss it in their lunchbags in the morning, but that is because I want them to have breakfast calmly.",
              "id": 42,
              "comments": [
                {
                  "score": 6,
                  "content": "I’m jealous, my school didn’t trust us with microwaves. The German teacher kept burning popcorn.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh we aren't in the US. School here is usually 4 hs a day. My kids go to a bilingual school so they are there for 8 hs, and schools like that usually have the option for a hot lunch or to get your packed lunch heated",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Haha my 9 year old was like you're doing it....um no sir your lunch, your taste buds, your responsibility.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "[removed]",
              "id": 46,
              "comments": [
                {
                  "score": 3,
                  "content": "If OP had a kid, she'd be taking care of two children",
                  "id": 47,
                  "comments": [
                    {
                      "score": 5,
                      "content": "She does!",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "u/GOdROvex is a comment stealing bot\n\nhttps://reddit.com/r/AmItheAsshole/comments/ttohgf/_/i2z3rgz/?context=1",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "[removed]",
              "id": 50,
              "comments": [
                {
                  "score": 5,
                  "content": "u/mBITySEu is a comment stealing bot\n\nhttps://reddit.com/r/AmItheAsshole/comments/ttohgf/_/i2z3dvt/?context=1",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "u/KristinLuna is a comment stealing bot\n\nhttps://reddit.com/r/AmItheAsshole/comments/ttohgf/_/i2yz2mw/?context=1",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "literally my partner leaves the house before 6:30am and he makes his own lunch the night before so he can grab and go. it works so well for us that i don't even wake on his alarm any more",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "[deleted]",
          "id": 54,
          "comments": [
            {
              "score": 14,
              "content": "I have a feeling this has a lot to do with her being a SAHM!  Like she has nothing better to do than serve her man and children.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "NTA and naahhh, you gotta shut these things down early. The more you let it continue the more it’ll set in as part of your marriage",
          "id": 56,
          "comments": [
            {
              "score": 4,
              "content": "That is why women need to train their sons so a wife doesn't have to do it when they get older. Notice I didn't write, 'when they grow up' because any male that thinks he deserves a mommy for life is a perpetual infant.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This.  NTA",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "100% - Also, even if OP *wanted* to pack his lunch, why can’t she do it the night before like a normal person?  I often pack my husband a lunch and/or set up the cold brew coffee the night before to be nice… but I’d stop in a second if he expected/demanded it. \n\nThere’s no reason she needs to get up at 5.30 just because he does!",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "NTA. Classic case of weaponized incompetence. OP’s husband is a literal baby, how hard is it to pack a lunch?",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3288,
      "content": "Maybe I'm a shit wife, but never in a million years would I even consider waking up with another grown ass adult to pack his food for him.\n\nAnd you have a toddler to take care of.\n\nNTA.",
      "id": 61,
      "comments": [
        {
          "score": 988,
          "content": "Bahaha same. My husband works shift work, he is gone either 5 pm-7 am, or 5 am-7 pm. He is super grateful if I have made food for him specifically to take, but never has he expected me to do so. And never would he ever expect me to wake up when he does (4:30 am) to make him a bloody sandwich. \n\nMake sure to cut his crusts off so he doesn’t choke. \n\nNTA",
          "id": 62,
          "comments": [
            {
              "score": 253,
              "content": "Lmao “make sure to cut his crusts off so he doesn’t choke” hahahaha yes",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "Cut his grapes In half too and give him a juice box. Lol",
              "id": 64,
              "comments": [
                {
                  "score": 45,
                  "content": "Pack Jim some lunchables and a juice box",
                  "id": 65,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Peanut butter and jelly sandwich and an apple. Every..single..day.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "But not capri sun because that’s a win for him.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "NTA. \n\nOP should buy a bunch of lunchables. Lunches are packed and he can eat like the child he is.\n\nETA judgement.",
              "id": 68,
              "comments": [
                {
                  "score": 2,
                  "content": "There are grown up lunchables. I buy them for my kid for days when we're running behind. Add a heaping serving of fruit and/or veggies and a chocolate muffin made of zucchini and carrots (frozen, store bought) and you've got a decently balanced meal.\n\nThat said, he should steer clear of the pizza lunchables. He'd have to tear open his own sauce pouch. Perish the thought.\n\nEdit: missing letter",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 436,
          "content": "LOLLLL same.  When we first moved in together, my husband said (joking, or maybe not?) \"my mom always irons everything, down to my underwear\" to which I said \"that's nice, if that's what you want, you can go back home to your mom\".",
          "id": 70,
          "comments": [
            {
              "score": 47,
              "content": "Kudos for shutting that nonsense down on day one!",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "I always find it funny how men want to assert their manhood by acting like little children. “I’m a big strong man and I will be respected as such! Also, can you make me a sandwich and wash my clothes because I can’t take care of myself.”\n\nIf he wants to treat to like a mother, he shouldn’t be surprised when you start treating him like a child.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "👌",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "My mom always packed my dad's lunches (they both recently retired - both of them worked full time), as well as mine and my brother's growing up, but it was not an *obligation*; it was because this is one of the ways my mom shows her love. She's the one who insisted on doing it, and if there was ever a day she didn't want to or couldn't, my dad and me and my sibling did it ourselves without complaint. It should never, ever be an obligation.",
          "id": 74,
          "comments": [
            {
              "score": 87,
              "content": "Right there.  I pack my family's lunches because I love them and want to make sure that they are having sufficient and decent food throughout the day.  All of them are old enough to manage it themselves.\n\nHowever, I don't cook dinner.  Maybe I'll do it once or twice a month, but it's usually the husband's job.  I *am* a morning person, and if I were expected to be up at 5am packing a lunch, I would not be happy.",
              "id": 75,
              "comments": [
                {
                  "score": 2,
                  "content": "no no no you don’t have to be making lunch at 5am, at 5am you get to be trying to sleep while the alarm repeatedly is snoozed, it’s only at 6am you have to make lunch",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I hate to cook. I'm very good at it, but i hate doing it. For my daughter, I happily cook a hot breakfast and pack a balanced lunch that still makes her happy every day. Dinner is on her. She knows what she has available, there are a lot of choices, and she handles her own dinner around 4x a week. She is 10. If my 10 yo can make herself a well balanced dinner 4x a week then he can, at the very least, get himself some pre-prepared leftovers and put them in a damn bowl.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "You’re not. I never would make my husbands lunch because he prefers to do it himself and I would never do it the same morning. My husband is a morning person, I am not. He would never even want me up at the same time so he can just chill and do his thing. I have adhd and need time to get charged up to normal people level lol.",
          "id": 78,
          "comments": [
            {
              "score": 30,
              "content": "“I have adhd and I need time to get charged up to normal people level”\n\nLmao same. I didn’t know other people were like this as well.",
              "id": 79,
              "comments": [
                {
                  "score": 2,
                  "content": "So many of us. We are legion.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This. My fiance wakes up at 6am. I AM NOT a morning person. I need caffiene to even pretend to be a normal functioning human being. \n\nHe's told me 'dont get up, this is my me time.' He makes his own lunch, gets himself together.\n\nI stay up for a but after everyone else goes to bed for my me time and he gets it. There have been days, like his birthday, that ill pack him a special lunch, but its never expected.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "My husband wakes up at 5 to get ready and pack his lunch. He takes care of our toddler whenever she wakes up (normally around 5:30). I take over at 6 so he can leave. This husband needs to get it together and make his own darn lunch.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "LMAO no, you're not a shit partner. If my fiancé woke me up at 5AM to \"pack his lunch\", I'd wreck him.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Too right.  \n\n\nMy wife likes to be up and about when I leave so she can have a coffee with me and wave from the window as I go. Sometimes she opts to prep my lunch for me, sometimes I do it myself.  \nBut we always get everything ready the night before.  \nHeck, we even load up the coffee machine the night before.  \n\n\nMornings suck, the less either of us has to think about what we're doing, the better.  \n\n\nWhat I would never do is deliberately wake her up. She doesn't *need* to be awake when I'm leaving for work. If she's not waking up and getting up while I do, I assume she's tired and needs the rest.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Right??? If I’m standing there making myself a work lunch anyway, sure, I’ll make a sandwich for him too. But I’m not getting up 5:30am to put lunch in a bag for a grown adult.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "The fact that she's a sahm with a toddler absolutely put me over the edge for this",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah it seems crazy to me. It would be a nice gesture from OP if she packed the lunch the night before so her husband could take it to work but that's not something that should be an expectation ever. NTA, I straight up wonder sometimes why women are into men lol",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1539,
      "content": ">I repeat, I am not a morning person. And lately, I have been having   \ntrouble sleeping. Yet my husband insists that I get up with him so I can  \n make his work lunch.\n\n&#x200B;\n\nEven WITHOUT that highlighted stupidity on his part, pray tell, why is this grown ass man not making his own lunch?",
      "id": 88,
      "comments": [
        {
          "score": 572,
          "content": "His explanation is that he has a lot that he has to do in the morning to prepare for work so he wants 1 less thing to worry about. \n\nNow that I finally have coffee in me, I wrote the post about 2 minutes after he left, I am thinking of just packing him sandwiches the night before, so he can grab and go.",
          "id": 89,
          "comments": [
            {
              "score": 1567,
              "content": "No, **HE** can pack his own sandwiches the night before. You are not obligated to. Your job is taking care of your actual toddler 24/7 (because it is obvious that your spouse doesn't really help here either) and not your grown-up toddler that is indeed capable of preparing his own food.\n\nEdited typo",
              "id": 90,
              "comments": [
                {
                  "score": 153,
                  "content": "He is a grown man who can problem solve, yeah\n\nDoes he want to make the sandwiches the night before, keep grab and go stuff in the house, etc etc it is HIS problem to solve you are not his mommy",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "The only way I would be packing his lunch ever would be as part of storing leftovers if I happened to be performing that task. Otherwise, it is fine to expect a grown man to not need to be mothered at some stupid hour of the morning.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Yes. Like storing the leftovers in a container and then mentioning \"hey, you can take this for lunch tomorrow\". That's about it. He knows how to use a knife and how to place a slice of cheese and deli on top of a slice of bread, that's not rocket science.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Exactly this. HE can make his own lunch.\n\nStop doing it for him. Forever.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Toddlers are little adorable energy stealing vampires. He's being a big fat baby. I'd just make him a pallet on the couch and say, \" leave me the fuck alone. I'm tired and if you wake me up in the morning the couch will permanently be your home for the foreseeable future.\" Toddlers get up SO early! Those few extra hours would probably be so satisfying and worth it for your mental health.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 238,
              "content": "If you want to, you can pack him lunch the night before. Or he can do it himself.",
              "id": 96,
              "comments": [
                {
                  "score": 132,
                  "content": "I actually like making his lunches. It's the waking up early that's my problem",
                  "id": 97,
                  "comments": [
                    {
                      "score": 730,
                      "content": "\"If you want me to make your lunch, then I am happy to do so in the evenings, so it is ready in the morning.  If you insist on your lunch being made in the morning then you can do it yourself because you are a grown man.\"",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "Look if you LIKE making him lunches because it’s part of your love language or whatever that’s fine. But you still need to communicate how unreasonable his behaviour is - the expectation of you packing it and then throwing a wobbly when you didn’t is beyond. When we do things for our partner to try and make their life easier it’s an act of service, and should be appreciated as such - not turned into a resentful act that’s not met with gratitude. Defeats the whole purpose of the act.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "Doesn’t matter if you like making his lunches, he’s disrespectful of your time and energy. If you don’t do something about it now, it’ll only get worse as time goes on.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Well then do it the night before so when he gets up it's all there waiting for him; all he has to do is remember to take his lunch with him.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You also live with someone who snoozes his alarm for AN HOUR every single morning. I would cheerfully murder my husband if he did that. I mean, damn.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Hetero nightmare",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "pack his lunches the night before and leave little notes in them about how he’s mamas precious boy and someday the sandwich will make him grow big and strong",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Try the premade sandwich or wrap idea and ask him not to wake you in the morning.  If he still has a problem and insists that you wake up regardless than I feel like a discussion about whether he views your job as actual work would be needed.  I could be totally wrong but him needing it 'fresh' and forcing you to wake up to make it early sounds like he wants to in some way make sure you start  job at the same time he does.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Replace his lunchbox with a child's lunchbox with cartoon characters on it. Make sure to cut off his crusts, slice his grapes, and send a wet wipe for sticky hands. If he's gonna act like a toddler, I'd be hard-pressed not to treat him like one too. That is utterly ridiculous. He thinks leftovers are fresher if you scoop them in the morning?? This sounds like some deep weaponized incompetence, and it's negatively affecting both you and your shared child, and he's still digging his heels in. Is this the only thing that he tries to dictate for you? I'm mildly concerned at the dark orange flag here.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I suggest you go on lunch-making strike for at least a week tbh,  and make sure you stick to it.\n\nBecause the sheer entitlement he's displaying, along with the lack of understanding towards your **need** for sleep is startling and concerning.\n\nMy ex tried whining that i didn't get up when he did -  at the time i was working a different shift and not getting as much sleep as he was,  and even if i wasn't -  i get up when i want or need to,  Making someone miss sleep is literal abuse.  Lack of sleep is massively bad for your health and can even be deadly.  \n\nI stopped sleeping at my ex's during the week until he apologised and promised to be respectful of my different sleep pattern.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "If he got up when he set the alarm he'd have no problem. NTA",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "So why doesn’t he get up on the first alarm and do all of it? It doesn’t sound like he’s really busy- he comes across as ill-prepared, procrastinatory, and selfish.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Dude, NTA, i had the exact same job and NO ONE made my lunches for me. I am a grown ass adult who can make her own food. Your husband is a douche. He can make his own lunch the night before, why are you doing this for him? Why is he EXPECTING this of you? Its one thing to be nice wife, its another to be taken advantage of by a \"man\" who can't take care of himself.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If he has so much to do in the morning why hit snooze for an hour?",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "He can pack his own lunch. Is he a baby?",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "NO, WHAT IS WRONG WITH YOU??\n\nIf it takes 2 minutes, then HE can do it.\n\nFor the love of god respect yourself and stop being his bangmaid/mom",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "No, HE should pack his OWN food *at night* like literally every single other grown ass adult. His palate is so delicate he can’t handle food that’s been in his lunch box an extra 8 hours? What a princess!",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "He can pack his own sandwiches.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 494,
      "content": "NTA. What!?! My husband does his own lunch, even does our daughters. This is a 🚩",
      "id": 116,
      "comments": [
        {
          "score": 108,
          "content": "His attitude is not one a grown man has. It shows some real immaturity on his part.",
          "id": 117,
          "comments": [
            {
              "score": 57,
              "content": "Extremely immature. And controlling.",
              "id": 118,
              "comments": [
                {
                  "score": 48,
                  "content": "He’s just throwing a tantrum. I think he’s also salty about having to be up early so he’s come up with this stupid reason that she has to be miserable and get up early too. I can’t even IMAGINE my husband acting this way. Honestly just really unattractive. OP expects her husband to be a man, not a toddler. Unfortunately she got the toddler.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I agree. This isn’t about the lunches. This is “I have to be up/awake, so EVERYONE has to be up and suffering along with me.”\n\nNTA by the way.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "It's entitlement not age. We see plenty of older men acting this way.",
              "id": 121,
              "comments": [
                {
                  "score": 4,
                  "content": "I agree it’s entitlement as well but I wasn’t attributing it to his age. Immaturity does not discriminate against age lol",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "At times like this, I realize I grew up in a strange household. My dad worked shift work in medicine and my mom was a SAHM. On paper, there was a wage disparity of quite a bit to $0 because raising 3 kids doesn’t come with a paycheck. Mom cooked more meals as a whole , but dad was probably cooking on the nights he was actually home. Dishes, laundry, any household chore was their job together or our job as a family, never mom’s job because she stayed at home.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 420,
      "content": "hold it - so he refuses to take a prepacked lunchbox from the fridge? And if I am right you gave him leftovers anyways? So he should be able to do that on his own... But be prepared for this escalating if you really refuse to get up with him. NTA to be clear before people tear me apart again. I just wonder why he thinks you are responsible for a fresh lunch for him?",
      "id": 124,
      "comments": [
        {
          "score": 159,
          "content": "Because he is immature and probably salty that he has to get up early so he is passive aggressively making his wife get up at the same time for a stupid reason.",
          "id": 125,
          "comments": [
            {
              "score": 45,
              "content": "well then he is free to look for another job, no? I mean yelling at each other is NEVER cool, especially when she stays at home with a toddler and has the household to take care of. Men like this make me very happy to be single, childfree and financially independent",
              "id": 126,
              "comments": [
                {
                  "score": 21,
                  "content": "Dude is some kind of electrical lineman so he probably makes good money. He is also controlling and feels he is entitled to his demands",
                  "id": 127,
                  "comments": [
                    {
                      "score": 36,
                      "content": "if he makes such good money he can buy his lunch then...",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Men like that are the reason I married one much older than me. Maturity level actually matches mine lol. He can take care of himself and isn’t looking for a mommy/housekeeper.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No, this is not “salty that he has to get up” behavior. \n\nThis guy wants *attention*, he wants his wife to serve him so he feels special. The job and waking up have nothing to do with it, trust me.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": ">Because he is immature and ~~probably salty that he has to get up early so he is passive aggressively making his wife get up at the same time for a stupid reason~~ sexist. \n\nFtfy",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 287,
      "content": "My suggestion was going to be to make it the night before, but he complains about it not being fresh?? Oh no. I always pack lunches the night before as I’m cleaning the kitchen after dinner. There is too much stress, chaos and unexpected things- like his emergency call- to mess with that in the mornings. \nPack his lunch at night or get him to help in the evening with it.",
      "id": 132,
      "comments": [
        {
          "score": 83,
          "content": "This sounds like a good way to help with the problem. Especially since it looks like warm weather is about to stay. I couldn't pack the night before when it was the dead of winter and freezing. I had to heat up a thermos in the morning heat up leftovers to be piping hot so they would stay hot for him. Since he is a utility locator the warmest place he could ear was a car unless he wanted to go to a fast food place and buy a lunch.",
          "id": 133,
          "comments": [
            {
              "score": 275,
              "content": "> I couldn't pack the night before when it was the dead of winter and freezing. I had to heat up a thermos in the morning heat up leftovers to be piping hot so they would stay hot for him.\n\nOr he could wear an extra sweater & eat a damn sandwich, preferably one that he made himself.  Or he could stop hitting the snooze button, get up earlier, and warm up his own leftovers.",
              "id": 134,
              "comments": [
                {
                  "score": -105,
                  "content": "So he works extremely long hours and in the cold to provide for his family and your response is for him to eat cold food or get up earlier. I would never want to be married to someone who suggest that",
                  "id": 135,
                  "comments": [
                    {
                      "score": 84,
                      "content": "Working a job does not entitle you to a 24/7 unpaid servant you can yell at and harass. She works too, taking care of the kid and the home and everything that isn’t his direct work shift, without breaks, 52 weeks a year. She isn’t his slave, and making his lunch is an extra he should be grateful for and able to do himself if need be, not acting like this. \n\nHaving a job doesn’t entitle you to be treated like a spoiled prince every second you’re not at the office, and these kinds of men are the only people who think it does.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I understand that if you work longer hours than your spouse it makes sense to want a packed lunch from them. I’ve done this for my boyfriend when he worked longer hours. He’s done it for me in the reverse. A partnership is lovely when you both work to make each other’s lives easier.\n\nBut how is it an imposition to microwave your own pre-made food and put boiling water in a thermos?? Why should your spouse wake up super early and do that minor work for you? This adds maybe a minute or two onto a morning routine but is a real inconvenience to your partner if they have to wake up earlier to do it.\n\nAlso, it’s nice but it’s not literally a need. He wouldn’t freeze to death in a warm car because he got a sandwich for lunch.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Pack your own lunch then 🤷🏼‍♀️",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "She's raising a child.  That's a 24/7 job.  He spends 30 minutes every morning hitting the snooze button.  He can use that time to pack his lunch.  What would he do if he didn't have a wife - starve to death, or make a sandwich?",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I’m gathering that your judgement of eating sandwiches and setting the alarm for the time one actually wants to get up (as opposed to setting the alarm to go off prior to when a person plans to get up, and hitting snooze) isn’t good enough for you, but is your opinion also that it’s somehow insulting to suggest another person might try these two strategies?\n\nEdit: grammar",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -29,
                      "content": "Yup same! People in this sub despise men in every possible way and basically they just want them to suffer. (Everything’s a red flag, needs to dump him, and blah blah blah)\n\nMy husband and I have been together for 10 years we have had a lot of obstacles and shit to overcome but we’re still here because we make shit work, we communicate, we sit down and have mature adult conversations, we walk away if we’re upset and come back, we compromise and most importantly we respect each other.\n\nMy husband works his fucking ass off every single day works 14 to 16 hours a day and I always make sure he has lunch ready and work clothes cleaned. But I do that because I love the shit out of him.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "Lol.  My husband would just take a can of whatever—usually beans—and let it heat on the engine block (after parking) for a few minutes and then eat his hot meal.   Sandwiches wrapped in foil work well too.   Just don’t forget and leave it there and drive off—makes a mess. \n\nYou have been very patient with your husband.  Time to switch things up and let him sort his own lunch for a bit—preferably a long bit.  \n\nOr put peanut butter on both slices of bread when making a peanut butter and jelly sandwich.  When he complains about the jelly squirting out all over him, just point out that you were trying to be a good wife and make sure that his sandwich did not get soggy!   (I am not saying that ever happened in real life, but if it did, that really is why I did it!).",
              "id": 142,
              "comments": [
                {
                  "score": 4,
                  "content": "I think I love you, based on your parenthetical at the end there. Got a chuckle out of me",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Oh lord. Ok, my husband is 42, my kid is 13. I have never made lunch for my husband. He’s a grown man. He wakes up early and does it himself. Kiddo makes his lunch while I make us some fruit smoothies. I cook 1 meal a day from scratch for the family and that’s it. \n\nYour husband needs a reality check here. I understand that you love him & like making his lunch. I’m not suggesting you divorce his arse or anything but seriously - he is not appreciating the work you do on this. So go on strike. He makes his own lunch until he gets the point. Until you feel appreciated.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "NTA looks like he should invest in some new lunchboxes.  \n\n\nfor summer: [https://www.amazon.com/Insulated-Reusable-Containers-Detachable-Shoulder/dp/B0851GK8R7](https://www.amazon.com/Insulated-Reusable-Containers-Detachable-Shoulder/dp/B0851GK8R7)   \nfor winter time: [https://www.amazon.com/Electric-Lunch-Box-Food-Warmer/dp/B094MJPHPQ](https://www.amazon.com/Electric-Lunch-Box-Food-Warmer/dp/B094MJPHPQ)",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "His lunch, his responsibility. \n\nEnd of conversation.",
              "id": 146,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "He could buy a sterno camp stove and heat it up by the side of the road.  \n\nOP, please stop being a doormat, you're worth more than this.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You can get lunchbox type things that plug into a car and stay warm.\n\nOr he could use a microwave himself like an adult human being.",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "His expectations are too high for a workday lunch!",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If it's something as simple as heating up leftovers, why can't he do it himself?",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "My husband works construction and for almost the whole of winter, he's been on a site with a microwave. I don't think I've ever seen him happier than when he can take leftovers to warm up. Last winter, he was working in a place where the wind just pounded him all day. I bet he wished I loved him enough to wake up and make a hot lunch before he left lol.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 180,
      "content": "[deleted]",
      "id": 152,
      "comments": [
        {
          "score": 2,
          "content": "This is very sensible. 👍\n\nNTA. He shouldn’t have gotten nasty.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 144,
      "content": "NTA. just because you are a stay at home mom does not mean you are his slave. My father was the same way growing up and I absolutely despise him for it now. Just because he pays the bills does not mean that he is no longer your partner. And aren’t you just packing him leftovers sometimes anyways? He says it won’t be fresh? I say he just won’t get the satisfaction of watching you do the same damn thing for him day in and day out. No reason why he can’t do it himself or you just pack ut the night before. Your husband is an asshole.",
      "id": 154,
      "comments": [
        {
          "score": 41,
          "content": "This. He treats you like an employee. There is more going on here. Do you have access to all your marital money?",
          "id": 155,
          "comments": [
            {
              "score": 27,
              "content": "Wouldn’t be shocked if OP didn’t… it took me and my siblings moving out and years of therapy for us to get through to our mom that husbands should not treat their wives like that. Loving husbands don’t",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 99,
      "content": "Not being fresh? So packing a lunch from food in the fridge the night before isn't good enough? You have to pack that SAME food in the morning before he leaves? WOW!! Your guy is extremely unreasonable and also very selfish considering that snooze button is the devil! I also cannot get back to sleep when snooze is hit and I warned my hubby if he tried to use the snooze button, I'd toss the alarm out the window. Your hubby needs to stop being so selfish about this and have some compromise. The food being packed the night before and sitting in the fridge is absolutely NO different to packing it that morning. You aren't cooking him a hot meal and putting it in a container, it's all cold! You poor thing.. NTA",
      "id": 157,
      "comments": [
        {
          "score": 125,
          "content": "I should have specified. The one occasion I did the night before thing, i made him a sandwich and put it in the fridge. I was sick and took Nyquil, so I KNEW it would be impossible to wake up and to be alert enough to make his lunch. He whined that the sandwich would be soggy. I got right in his face I said \"Do you want me to be well?\" and \"do you want to eat?\"\nHe shrank down and nodded. \nI felt so powerful in that moment.",
          "id": 158,
          "comments": [
            {
              "score": 101,
              "content": "Stop. Making. His. Lunches. He doesn’t appreciate what you do.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Wait wait wait, hold up. He couldn’t even pack his own damn food WHEN YOU WERE SICK?!?\n\nJESUS FUCKING CHRIST WHY ARE YOU WITH HIM???",
              "id": 160,
              "comments": [
                {
                  "score": 21,
                  "content": "She's a martyr.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "If that bugs him,wrap bread in foil, lunchmeat in a plastic container. Unless self assembly at lunch is also too much work. BUt honestly, don't make this dude lunch until he acknowledges the selfishness of his past actions. As a fellow SAHM, it is easy to agree to too many household obligations because of the feeling that we  have to make up for not making money. That is the glory of capitalism. I need to tell you that you deserve to not have to wake up obscenely early if your schedule doesn't require it. I would hold off making lunch until this fact (at minimum) is acknowledged by your spoiled husband.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Unless the sandwich had tomato or tuna or something else where the bread would absorb moisture, he's being ridiculous. Make the sandwich dry and get those restaurant packs of mayo and mustard.",
              "id": 163,
              "comments": [
                {
                  "score": 3,
                  "content": "If you use cheese next to both slices of bread and put everything else in between the cheese nothing gets soggy.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "NTA   \n...soggy from what? I've made several days worth of sandwiches before for my SO at the time's grandmother who forgot how to cook, with crusts cut off as otherwise she would tear off most of the sandwich, of varying fillings, and they were never soggy. Something else seems like it's going on.  \n\n\nI don't know, if I am giving benefit of the doubt, maybe this is his way of feeling loved by you and being given special attention? Especially if you have children, maybe the having lunch freshly made for him in the morning, is the only time he feels like your attention is solely on him? Before the kids are up, he gets to have some alone time with his wife who is going out of her way to make him something fresh so that when he's at work feeling overwhelmed, he opens up his box and smiles?  \n\n\nIn my case, not a SAHM, but I know my partner loves when I prep the coffeemaker the night before and set the Zojirushi to cook his oatmeal to be ready when he wakes up. He said it starts off his day feeling loved.   \n\n\nI think maybe just ask him why it's so important? Seems like it's more than taste. PS for thermoses, I love Zojirushi ones for keeping things hot during winter. I've legit left a piping hot thermos of coffee overnight and it was still warm the next morning. They're insanely effective.",
              "id": 165,
              "comments": [
                {
                  "score": 4,
                  "content": "If it's his way of feeling loved, then he should act accordingly: appreciate it as a favor and an act of care, thank her for the gesture every day and be fine doing it himself once in a while, not take it for granted and whine like a sulky teenager when it's not possible. It doesn't sound like he does that, and that's on him. He's old enough to understand grace and gratitude.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 3,
                      "content": "He should make her feel loved by letting her sleep in for one or two mornings a week, and he can't even do that. The fact that he sets the alarm to go off every single morning, even on his day off, so she can't get a good nights sleep is a huge red flag.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Your husband is spoiled rotten by you and I can't believe he has the audacity to complain about how good he has it instead of trying to spoil you back like a good partner should. \nIf he complains again you should tell him to put on his big boy pants and do it himself like every other adult, you're not his mommy.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Ok, start doing that every single evening. EVERY! SINGLE! EVENING!",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You were sick and still making him lunches??? Interesting.",
              "id": 170,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "God, the disrespect he shows you.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "NTA. Are his arms broken? Make his lunch the night before, **if you want to**. There’s no reason why you should have to wake up at the ass-crack of dawn to make a damn sandwich. If “freshness” is that big of a concern then he can get out of bed at 5:30 himself and quit hitting the snooze button.",
      "id": 172,
      "comments": [
        {
          "score": 33,
          "content": "I get up for work at 4 am 5 days a week.  Never have I ever woken up my wife to make my lunch for me like a child.  I make it myself the night before.  I don't understand people who can't figure this out. And love the above comment btw.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}