{
  "post content": "Family member told me to post here. \n\nMy (F52) husband (M56) and I have 2 daughters.  They are both great kids that are successful, accomplished and I couldn't be more proud, but lead very different lives.  We all still live in the same area, the area I raised them at.  One (F25) travels extensively for work and has an on again off again boyfriend and the other (F28) is married and has a 3 month old son.  \n\nMy daughter with the 3 month old works full time and is going back to work as her maternity leave is ending.  I work part time but offered to watch my grandson at my house while they are at work.  I'd quit my job, which I'm okay doing. We recently had a sit down about watching him and my daughter and husband gave me a list of rules, one they stressed was no animals around the baby.  That one was a bit of a surprise and conflicts with the needs of my other daughter. I asked why, they cited safety.  I accepted them, because I want to watch my grandson and be involved in his life. \n\nMy other daughter that travels for work has a pair of dogs. When she is out of town, she drops the dogs off with me.  The dogs can be a bit rambunctious but otherwise behaved.  She is usually gone 3 days at a time, usually midweek.  So the time that I watch the dogs would conflict with my grandson.  I've been watching her dogs for 3 years.  I've informed her that I want to watch my Grandson and because of that I can't watch the dogs as much anymore.  Well she did not take that news well and flipped out.  Says it isn't fair that she now has to find other means to take care of the dogs and it is financially affecting her. I told her I can stop by and check on them in the evenings, but I won't have the time to properly take care of her dogs if they were left at her place. She hasn't spoken to me or her sister in the past week.    So was i the asshole here?",
  "id": 1,
  "comments": [
    {
      "score": 13355,
      "content": "Yes, YTA for accepting an unreasonable condition to help one of your children at the expense of the other.   Would you daughter really have found other accommodations to watch the baby if you stood fast on the \"no-pets\" rule?  Doubtful.   Most animals get along well with children.  If nothing else, you can find a way to keep them apart if need be.\n\nYou chose the needs of one daughter over the other, and seem surprised that she's upset about it.   I have a feeling the daughter with child KNEW that you watched these dogs, which is precisely why she made up this rule.  You can and should, tell this child that you have reconsidered, and can't abide by the no-pets rule, so she'll have to find other accommodations when you are going to watch the dogs, or live with it.  Don't be bullied by your daughter, just because you want to see the grandchild.",
      "id": 2,
      "comments": [
        {
          "score": 6384,
          "content": "Agree with this 100%.  Baby daughter is manipulating you intentionally at the expense of dog daughter.  You shouldn't allow this.  They are NOT going to pay for expensive infant daycare when you are offering to watch their infant for free (and even quit you job to do so).  This will cause a permanent rift in your family if you don't fix it now.",
          "id": 3,
          "comments": [
            {
              "score": 11138,
              "content": "Or you know they could just not want animals around a three month old baby. Especially when they aren't around to watch. Doesn't have to be manipulation.\n\nWe have no way of knowing if they would find alternative options because that wasn't in the OP and I haven't found it in any comments yet.\n\nYou're assuming a lot based on nothing.\n\nEdit: please don't spend money on awards.",
              "id": 4,
              "comments": [
                {
                  "score": 9418,
                  "content": "Yea I don't understand why everyone is looking at the mom as a villain. 2 rambunctious dogs around a 3 month old with one adult in the room is not a great combo.\n\nETA: Anyone who's had a baby and excitable dogs or whose parents did that with no issue - that's awesome! I'm genuinely happy that it all worked out for you! But there are plenty of people with the opposite experience too. It's not a situation everyone is skilled or confident enough to take on and acknowledging that doesn't take away from your positive experience.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 8351,
                      "content": "Child > dog. Reddit is populated with 12 year olds.\n\nEdit:  the crazies are sending me suicide hotline information. You know who thinks shit like that is funny?  Yep- 12 year olds. Lol",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1544,
                      "content": "Also, it sounds like watching the dog is something OP is doing to help out her daughter. Watching the grandson is something OP *wants* to do, so she can develop a bond with her grandchild.\n\nIt looks to me like more of a two-way benefit situation, as OP wants to be involved in her grandson’s life.\n\nAs someone who was watched by a grandmother as a toddler, I can confirm my bond with my grandma that watched me is indescribably stronger than the bond with the grandma I saw on sundays/special occasions. \n\nAnd yes, two rambunctious dogs around a newborn and just one adult does not sound like the best of ideas.\n\nI’m going with **NTA** because OP should be able to do whatever they want, and not be treated like someone that lives to *serve everyone equally.*",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 470,
                      "content": "As a mom of 3 kids and 3 wonderful goldens I would not trust my fool dogs around a baby. They’d bump into the baby, step on baby or maybe accidentally do something to harm the baby. I would not risk it and I don’t risk it even when my friends with babies say its ok.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 432,
                      "content": "As someone with 1 dog and a baby under 12 months, it is exhausting to do both! I can't even imagine 2 dogs, which she says are rambunctious. Also, OP says she wants to be in the baby's life she is not obligated to take care of 2 dogs. Child > dogs any day.\n\nOP you are NTA, not even a little bit. You are giving your other daughter some solutions and you were helpful for 3 years which is more than enough. Enjoy your grandchild!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 328,
                      "content": "Especially when that adult is not the owner of said dogs and may have less control.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 293,
                      "content": "Seriously. I love dogs but they can be unpredictable especially around new babies and it can only takes a second for something tragic to happen even accidentally",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 209,
                      "content": "NTA\\~ What the heck is wrong with Reddit?  Grandbaby takes precedent over pets every single time. I can see why they might not want their newborn around animals. As parents they are allowed to make that choice just like the OP can make the choice to sit or not sit the grandbaby. No manipulation, just people having choices.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 185,
                      "content": "It seems like people hate the idea of human children being more important to their grandparents than animals.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "I’m also confused, because OP is in no way obligated to help anyone. If she had decided one day that she was tired of watching the dogs, even though daughter was relying on her, that would be perfectly okay. Daughter is an adult and can figure out her dog care. Likewise OP cannot watch baby, then it is daughter’s responsibility to find childcare.\nPersonally I think daughter #1 has been lucky to have the sitting services of her mother for 3 years. I think in the spirit of fairness it’s daughter #2’s turn to get moms help.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I have two \"rambunctious but well behave dogs\" too and I could not think on caring of a three months old baby at the same time. Accidents happen and I don't say they will maul a kid, but just pushing them by accident, licking him or his stuff (I'm not fan of doggie kisses lol) or just messing with the sleep schedule is enough.\n\nMaybe keeping the dogs in the back yard (if there is space) can be an option.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 287,
                  "content": "I agree with this. I’m surprised at the top comment. \n\nPart of responsible dog ownership is being able to pay for their accommodations if you have to leave them, and younger daughter should be budgeting appropriately for that when traveling is consistent and expected for her job. If it was a surprise emergency trip, that’s one thing. Or a long planned vacation they agreed upon that she now has to scramble for. But it’s not.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 226,
                      "content": "Well the top comment demonizes OP for not loving her kids DOGS more than her kid’s kid and the 13 year olds on here spouting their opinions as facts are determined to guilt her. OP do not listen to them and please listen to the scores of people who think people matter more than dogs.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Like perhaps maybe if you have to travel for work often enough that boarding your dog is cost prohibitive, you might not be in a position to have dogs.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 223,
                  "content": "Thank you. I love how reddit fills in the blanks with nothing to support the fictitious additions to the story. OP says the dogs are rambunctious. Of course sister doesn’t want her kid being cared for around two rough dogs!!",
                  "id": 19,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I feel like I read the son in laws version of the exact same story a week or two ago.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 66,
                  "content": "I love my cat more than any other pet on the planet. I love my niece and nephew more.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 56,
                  "content": "Especially since it’s noted these dogs are rambunctious! No chance I’d want them around my baby with that alone",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Also, dog sister has already used mom's service for three years. Maybe it's time to offer the same thing to child sister, watch the kid for three years, and then re-evaluate. That way, both sisters have had the ability to benefit from their parents' free time and I'm sure free services. I didn't know the dog sister had her parents' free time for perpetuity.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Absolutely NOT a manipulation and an incredibly smart and responsible rule to have. We have a gem of a dog who would never hurt a fly, but I would never let my child be alone with the dog. Nor would I ever let my kid be taken care of by another person with dogs in their home that weren't entirely separated from my kid if I wasn't there. It's a huge safety concern and a giant liability. If anything were to happen to the daughter's kid because one of the dogs snapped; that dog will likely be put down, and the other sister better have an umbrella policy in case she gets sued.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Was not expecting that take at all. OP is NTA. She owes neither of them anything and has every right to decide she'd rather watch her grandson than her daughter's dogs. **She's picking her grandson, over dogs.** She's not picking one daughter over the other. Favors aren't required to be doled out in equal portions you entitled weirdos.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Right? My mom saw her twins face get ripped off as a kid by the 'nice' family lab. Maybe that's not a risk they are willing to take",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Plus op helped dog daughter for 3 year already?? Cant op extend the same courtesy to baby daughter?? What if baby daughter had adopted a dog instead, the two dogs didnt get along and baby daughter asked op for the exact same dog sitting favour?",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 565,
              "content": "Since when did Reddit think that people are obliged to care for other people's dogs? The dogs are the OP's daughter's responsibilty. After dogsitting for three years, she wants to do something else and is perfectly entitled to do that.\n\nThe dogs are exuberant and boisterous. I would not want them around a three-month-old baby either.",
              "id": 28,
              "comments": [
                {
                  "score": 258,
                  "content": "And zero ire towards the person who got 2 dogs while traveling frequently for work.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Omg yes exactly this. Even if she had the animals first, if your ability to accept a job where you have to travel “extensively” is to rely on someone else’s free labor, you made the wrong decision. OP’s daughter with the two dogs should be on r/ChoosingBeggars",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 124,
                  "content": "Right? I am so baffled by this. I have a calm dog. I’m still cautious with her around children.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 14,
                      "content": "My dog was outrageously licky, and since she spent time licking herself, including her bottom, I was never very keen on her being with children as she could not resist licking their faces. It was really very concerning how many people wanted to introduce their little kids to her. I would explain what would happen if they let their kids near her, they would insist, then their kid would end up covered in doggy slobber.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Or saying that it's not fair to change suddenly? Like, I'm sorry as far as I can tell the daughter got free care for her dogs for three years. I don't see how it's a slight or wrong for the mom to watch the baby now.\n\nI mean, if we are talking about being fair surely it's the other daughter's turn to get free care for three years.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "One day this sub is yelling about how no one is entitled to child care and the next they're preaching about how if you don't dogsit you're child's dog you're playing favorites",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 430,
              "content": "What a load of codswollop. Doggy daughter has had 3 years of free dog sitting which would have cost her money to do doggy daycare or kennels or whatever.\n\nNow baby daughter could do with some help, and OP decides they want to give that help to baby daughter, to be more involved in grandson's life. The choices baby daughter makes for her baby are hers alone to make and the OP has respected that choice.\n\nDoggy daughter needs to suck it up and accept that the dogs which are HER responsibility need alternate arrangements to the ones she's been getting so far. Circumstances change, and when it comes down to it, a baby is much more important than a dog (or in this case dogs)\n\nNTA",
              "id": 35,
              "comments": [
                {
                  "score": 32,
                  "content": "Absolutely correct above OP is NTA",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Agree NTA",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 349,
              "content": "Idk, the assumption I'd make is that baby daughter made this rule because she doesn't trust these dogs around her baby.\n\nIf it comes to her child's safety she probably would find a daycare. People really like their kids being safe. \n\nIf I was the grandma I'd make the same choice (though you would not be an AH to make the other choice). \n\nAt the end of the day, NTA because you're generally a good mom and grandma for devoting your time to your kids and their needs, dog daughter will come around over time.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 326,
              "content": ">Baby daughter is manipulating you intentionally at the expense of dog daughter\n\nHow are you making this assumption? That was a huge reach",
              "id": 39,
              "comments": [
                {
                  "score": 161,
                  "content": "[removed]",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 67,
                  "content": "Manipulation and narcissism are just buzz words on this sub for “someone did something i didn’t like”",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Because kids bad!!!! /s",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 286,
              "content": "I would never want my 3 month old to be around 2 rambunctious dogs when I’m not present. Even worse when the baby is crawling and then a toddler. \n\nI would pay for childcare before having that happen. I know babies who have had devastating dog bites, my toddler was bit by a dog but fortunately it was okay. Dogs are a risk that some parents are okay with but some, like me, are not.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 210,
              "content": "Manipulating? Because she doesn't want her very small baby around rambunctious dogs? \n\nSo reasonable. Dogs aren't more important than the actual grandchild.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "I mean... I would *absolutely* pay the money and put my baby in daycare rather than allow them to be watched by someone with dogs that jump up on them and aren't safe around my baby.\n\nIf my options were between having my children be safe and having to quit my job or having them at risk and being able to keep my job, I would give notice on the spot.",
              "id": 45,
              "comments": [
                {
                  "score": 109,
                  "content": "That’s also the difference. They were ready to pay for daycare and assume full responsibility of their child but OP offered and wants to watch over their grandchild. Dog daughter is mad she has to finally take responsibility for the dogs she chose to have.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "She literally said she WANTS to bond with her grandchild. Not only that but she's been watching these dogs for 3 years. You guys are being ridiculous. NTA",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Manipulation? Unreasonable conditions? This comment and the original are both stupid",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2463,
          "content": "It’s not at all unreasonable. You forgot the part where OP has literally been watching the dogs for 3 years. Actually, it’s the daughter with the baby who’s ‘disadvantaged’ at this point. Also, I can’t believe I have to say this, but your actual grandchild isn’t the same as your daughter’s pets. OP’s NTA",
          "id": 49,
          "comments": [
            {
              "score": 1397,
              "content": "These responses are peak Reddit. She watched the dogs for three frickin years, and now she wants to prioritize her actual human baby grandchild.\n\nOP, please find some actual adults to ask for advice on this. Reddit will always side with childfree people and their pets, no matter how ridiculous.",
              "id": 50,
              "comments": [
                {
                  "score": 699,
                  "content": "Reddit is the only “place” where a Y T A would even be in consideration for this situation. In real life, anyone who prioritizes their “grandpets” over their actual grandson would be considered crazy",
                  "id": 51,
                  "comments": [
                    {
                      "score": 389,
                      "content": "Yeah these comments are an excellent example of why you shouldn’t put too much stock into the general consensus on Reddit.  I was reading this thinking NTA the entire time, then I saw the top comment and was left scratching my head.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "[deleted]",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 242,
                  "content": "Yep, all the dog baby mommas stopped posting pics of their furbabies for 2 seconds to comment.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 149,
                      "content": "As a child free dog/cat baby momma, I agree. These people are off their rocker. I'd do just about anything for my pets, but my niece and nephew will always come first. The mom is not obligated to watch those dogs, and I wouldn't want 2 rambunctious dogs around the baby either, especially if they weren't my own dogs.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I am a dog mama and had two very large dogs when my human babies were infants. These comments are insane. I was ok with my two dogs around my babies because I was extremely vigilant to oversee their interactions. I absolutely would not be ok with other people’s dogs around my infants right around the time they start to scoot around without me or my husband there to supervise. The fact that people think this is unreasonable is incredible.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 206,
                  "content": "I chose a childfree lifestyle, have pets, and think OP is NTA. It's OP's choice. Dog daughter was fortunate to have convenient loving dogcare for 3 years. I don't assume Baby daughter is manipulative. OP herself said the dogs can be ranbunctious. Again, this comes down to OP's choice. Children are a ton more work than dogs. It's going to be more exhausting for her but it's HER CHOICE. \n\nI do wonder how the Baby daughter would've reacted if she had said, no thanks, I prefer the dogs.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I mean since she didn’t ask her mom to watch her son, probably would have gone with her original plan",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I don’t like children or pets and i also knew right away NTA.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 115,
                  "content": "I 100% agree. These are probably the same lunatics that bring their dogs to restaurants and sit them at the table.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": ">These responses are peak Reddit. She watched the dogs for three frickin years, and now she wants to prioritize her actual human baby grandchild.\n\nI often think the \"persona\" of Reddit (especially the AITA subreddit) is an angry teenager.  \n\nOP:  NTA.  Not only is there nothing wrong in prioritizing a human grandchild over a dog, IMO it would be weird to do otherwise unless there was something else going on with the children.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I guarantee if OP asked anyone else in the family or any of her actual friends, they would say that her dog owning daughter is being an entitled brat",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Exactly. NTA. This sub has lost the plot, or are all children.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Right?\nWhat struck me is that a woman with 3 dogs is travelling all the time, to the point where her mother has to watch her dogs a number of times a month, and no one is calling her out on this.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 564,
              "content": "And dogs can absolutely be dangerous to babies. It would be difficult to watch 2 rambunctious dogs and an infant at the same time. OP has done dog daughter a favor for a long time, and WANTS to watch the baby. Dog daughter is inconvenienced because her free care is ending but ultimately it’s OP’s decision to make and OP would rather watch the baby than the dogs. NTA",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 467,
              "content": "You know what, a grandmother has a RIGHT to say I’d rather spend time with my grandson over some damned dogs. It’s NOT unreasonable.",
              "id": 66,
              "comments": [
                {
                  "score": 166,
                  "content": "That’s what I’m saying too. Some of these comments feel like a fever dream.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 114,
                      "content": "I couldn’t believe the top comment was Y T A. I had to go back and read the post again to see if I missed something.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 272,
              "content": "I’m shocked that people genuinely think these are equivalent in any way.\n\nOP, NTA, your daughter with the baby is not being unreasonable at all, and neither are you. Your daughter who travels needs to make her own arrangements for her pets because they are not the same as a human child (her own nephew!!!).\n\nIt’s a reasonable request that a newborn be kept away from animals while the parents aren’t there to supervise. Dogs can be well trained but they’re ultimately unpredictable and you honestly can’t predict how kids and animals will interact.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Exactly. When it comes to the safety of kids, why take unnecessary risks? Especially if the baby doesn't know the dogs and the dogs don't know the baby.\n\nPlus the general noise and high energy of dogs can be overstimulating",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Also, why tf did she get 2 dogs she can't take proper care of? If she teavel all the time for work she should have never gotten the dogs",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I swear every day I get on Reddit and see these people choosing some dog(s) over an actual baby. \n\nOP NTA don’t listen to these childfree weirdos.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly!! Why are we comparing a grandchild to dogs? We are in the military and would kill for grandpa and grandma to be here. Time is so fleeting. I love my pets but let’s be honest.. you aren’t missing milestones and bonding with a dog. \n\nThe other daughter is an adult. She can figure it out. You aren’t responsible for peoples feelings. Life isn’t always fair. The etiquette would be to allow her time to find a suitable dog sitter replacement before watching the grandchild and your other daughter would have be ok with that. \n\nNTA",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "OP has been helping her daughter by watching the dogs for a long time.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah but remember, this is reddit. Animals before children.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1590,
          "content": "I don't really want to watch the dogs and grandson at the same time. Thats why I was fine with the rule.   My husband works so its primarily me at home all day.",
          "id": 76,
          "comments": [
            {
              "score": 936,
              "content": "NTA. It's fine to change your mind and priorities; looking after two rambunctious dogs and an infant is way too much. You were doing your traveling daughter a favor by looking after her dogs. You are now going to do your parent daughter a favor by looking after her child. It's PERFECTLY OK to prefer doing one over the other, and the traveling daughter is acting entitled to your free labor. You can 100% choose how to spend your free time.\n\nI wouldn't want my infant around rowdy animals either. As kiddo gets older, it's possible you may feel up to revisiting the dog sitting question, but everyone needs to be an adult now and prioritize the human child. There are dog walkers, house sitters, etc that are cheaper than boarding/kenneling. And it's not like you completely withdrew pup support--you offered to do checks on them on your days off after minding a baby all day. That sounds exhausting! You're clearly trying your best.\n\nAsk if the traveling daughter would be up for hanging out with her nibling and her two dogs for an entire day to see what kind of workload she realistically thinks her mom can handle. Yeesh.",
              "id": 77,
              "comments": [
                {
                  "score": 363,
                  "content": "NTA. Why does the daughter who travels so often even own pets if she can’t care for them properly? She can’t seriously expect her mom to watch them forever? If she can’t afford to board them or pay a dog sitter when she’s gone then she simply can’t afford to have pets. People need to stop acting like pets are equal to or more important than kids. Of course a reasonable grandmother would prefer to spend time with their grand child over a dog!",
                  "id": 78,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Was my thought exactly. Can't believe people stand up with the dog lady, even though I'm an animal lover myself.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "I have grandchildren, I also watch my granddogs. It's understandable you want to watch your grandchild. Your daughter is wrong to assume you would pet sit indefinitely. I obviously don't know the dogs behavior. My grandchildren have been raised with my boxer, and my daughter's boxer/greyhound and boxer/beagle. Ask your daughter with dogs if she thinks it fair to only help her,and not her sister",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 240,
              "content": "OP, you're NTA for not wanting to look after someone else's dogs. You were willing to jump in and help when she got the job. That's really gracious. \n\nExcept for the simple fact that you don't Want to and have no responsibility to take care of the dogs. It's been years and dog mom hasn't cared to make any plans to take her responsibility of you. You even offered to go check on them in the evening. That's the same amount of attention they would be getting if she was working locally. On top of this you gave her weeks notice and that's more than fair. \n\nI rehabilitate dogs with behavioral issues and would never suggest having dogs that haven't been trained and adjusted to babies around them. I've had dozens of dogs getting dropped with us because people \"never thought they would hurt a child\". It takes one scratch or nip and a kid looses an eye, or worse. This especially for one's described as rambunctious. \n\nYou're grandparents and want to play with your grandchild, rather than feeling obligated to be responsible for others pets. That definitely doesn't make you TA. It makes you loving grandparents.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "Your daughter is unreasonable. You have a right to watch your grandson over her dogs. It’s not the same.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "This is just not a good situation, NTA is my vote. I'm really sorry for you. I love my two dogs and I know they wouldn't intentionally hurt a young one but if my mom were in this situation, she would've chosen my nephew over my dogs. I couldn't blame either even tho my sis and I don't get along. I gotta say, the human kid comes before my four-legged dependants that I chose to get. Dogs can be a handful.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "You are NTA for sure. This top comment it top level garbage.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I feel like this is the most important part of the equation. You did free care for three years for one daughter, and she’s upset she’s losing that, but honestly your time and comfort level are the thing that matters most. Even if your other daughter hadn’t said no dogs YOU don’t want to do it.\n\nNTA",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "NTA, if those dogs are that rambunctious that require 100% supervision, they do not need to be around a baby.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "At the end of day it’s all up to you what you want to do. You have helped one daughter for 3 years now.  Now you can help the other .",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Don’t listen to that lunatic with the YTA. I’ve got a four month old that my mom helps watch and we’d be livid if she let rambunctious dogs near him, and I’m sure the pediatrician would agree with you.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 586,
          "content": "How is this the top vote?\n\nThis woman is nta. She's been watching her other daughters dogs for 3 fucking years, presumably for free.\n\nNow she an actual grandchild she wants to spend time with, and she's an asshole?\n\nI'd be pretty grateful if my family babysat my dogs for 3 years for free.\n\nIt's not unreasonable not to want rambunctious dogs around a 3 month old.",
          "id": 89,
          "comments": [
            {
              "score": 159,
              "content": "because everyone who upvoted that insane comment is probably 12 or hasn’t left the house in a few weeks",
              "id": 90,
              "comments": [
                {
                  "score": 51,
                  "content": "Childfree dog owners are rampant on this subreddit",
                  "id": 91,
                  "comments": [
                    {
                      "score": 22,
                      "content": "And this is why I love the r/dogfree community lmao",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Or both",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": ">how is this the top vote\n\nIt’s reddit.",
              "id": 94,
              "comments": [
                {
                  "score": 28,
                  "content": "Lot of babyhaters on reddit",
                  "id": 95,
                  "comments": [
                    {
                      "score": 27,
                      "content": "This site skews toward childfree, and pet ownership. Which I’m not saying is inherently wrong, but it’s ludicrous to think that a woman would rather keep watching a couple of dogs vs start bonding with her baby grandson.\n\nAlso, funny to me that the dog daughter has received three years of free petsitting and now is throwing a fit because she is likely going to have to start paying for it. Oh, but the other daughter is entitled because she doesn’t want pets around her infant when she’s not there and OP is fine with that rule😂",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 402,
          "content": "Bad take here. Animals should not be around children, especially infants. Prioritizing a baby over some dogs that can spend the day home alone is the only choice here. Anyone who says otherwise is a fool.",
          "id": 97,
          "comments": [
            {
              "score": 30,
              "content": "Exactly. There have been stories of dog attacks of small children. Op is protecting their grandchildren by not allowing their grandchild around dogs until they’re old enough",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 379,
          "content": "this is an absurd take! 1) OP is not obligated to watch her daughter’s dogs for free??? if actually paying for a pet sitter is such an inconvenience to the dayghter maybe she shouldn’t have dogs 2) she has been watching these dogs for three years and now would like to change things to accommodate new circumstances 3) watching a human grandchild is going to overrule watching dogs most of the time 4) new parents being extra worried/cautious is classic and normal 5) animals can actually be dangerous to babies sometimes. it doesn’t mean the animal is bad or anything it’s just something to be aware of…",
          "id": 99,
          "comments": [
            {
              "score": 15,
              "content": "Yeah wtf these entitled children, like appreciate your parents, they are not sitters. I don’t have any of my parents living near me but if they had the chance they would prefer being with their grandchildren over petsitting. Children grow up so fast just let her choose what she wants to do.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 320,
          "content": "She’s been watching dog daughters dogs for THREE YEARS… those pets are 1000% HER responsibility. Not her moms. Her mom isn’t obligated to do this for years and years on end. If she’s traveling too much for work she shouldn’t have ever gotten dogs… plural and should re home them with a family that can actually care for them 🤦🏻‍♂️ she expects someone else to watch them for free constantly… That’s ridiculously entitled. OP is allowed to want to be involved in her grandsons life. Her other daughter isn’t bullying anyone. Plenty of people don’t want dogs around babies.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 310,
          "content": "The needs? These children are both adults who are completely responsible for finding their own daycare and pet care. They are not owed one second of OP’s time. She chose to be nice and help out one child for 3 years and now she is choosing to be nice and help out the other child. Good grief: the entitlement of thinking OP needs to watch her daughter’s dogs for free.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 297,
          "content": "This is such a wild take. If you agree to do a favor for someone you are obligated to continue doing so forever?",
          "id": 103,
          "comments": [
            {
              "score": 44,
              "content": "Ridiculously bad take so of course it’s currently the top comment because this place is overrun by children with no life experience. OP must never ever alter her plans or try to have a life outside of her daughter’s dogs. She exists solely as a doggy daycare so one of her kids can travel freely without having to worry about her own pets. If she dares to offer her time to her other child, she is horrible and must be punished. What she wants to do with her own time is completely irrelevant. The dogs come first!!",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 208,
          "content": "Disagree 100%. You are NTA. If dog owner daughter is throwing that much of a fit that you would rather watch your grandchild over her dogs (which you’ve already done her a huge favor for 3 years) then she should be the one reaching out to the other daughter with the dog rule and they should be the ones hashing this battle out. OP shouldn’t be the one doing the leg work here when she is the one being generous and offering favors to her daughters. \n\nIt’s really dog owners problem that she has to find accommodations for the dogs not OPs. She took a traveling job while having two dogs and she is an adult who can find new arrangements as OPs life circumstances have changed. If dog owner doesn’t want to hash it out with her sister that’s on her and not OP.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6165,
      "content": "I feel like I read this, only from the child’s parent’s’ perspective a couple of weeks ago…. Anyways, NTA. First, if she is traveling that much with work, why does she have dogs? Second, and most importantly, you get to decide who, if any, you are going to look after. Your daughter (dog mom) had the luxury of you helping for 3 years, now she can find someone else to help out or pay for a sitter.",
      "id": 106,
      "comments": [
        {
          "score": 1266,
          "content": "Yep exactly this. I feel like the people who are saying n-t-a are more concerned about dogs than OP’s free will.",
          "id": 107,
          "comments": [
            {
              "score": 12,
              "content": "Well no, she is considered an AH by her daughter for  NOT wanting to watch her dog. People are saying n-t-a because she wants to watch her grandson instead of the dogs, or at least that what most of the n-t-a comments I’ve read say.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 802,
          "content": "https://www.reddit.com/r/AmItheAsshole/comments/107t3sc/aita_for_requesting_no_dogs_around_my_son/",
          "id": 109,
          "comments": [
            {
              "score": 556,
              "content": "Thanks for sharing. Either one changed their sex for anonymity or this is a cheap copy cat. \n\n\nIn the original, it was the husband's mom watching. \n\n\nLink to original post (as deleted):\nhttps://www.reddit.com/r/AmItheAsshole/comments/107t3sc/aita_for_requesting_no_dogs_around_my_son/j3o9tgl",
              "id": 110,
              "comments": [
                {
                  "score": 796,
                  "content": "the title on this post doesn't match the body either. It says \"Sons Dogs\" and then goes on to talk about having two daughters.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 512,
                      "content": "That bugged me too. Pretty sure this is made up.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "That’s the post I was remembering! And after re-reading that and comparing it to this one, both kids seem a bit AHish! But I still stand by OP is NTA here! She gets to choose, and it sounds like she chooses baby over dogs - this time!",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Thanks for linking the actual body of the post, I don’t know how to do that.",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "To be fair, it's also not an uncommon request from parents of young kids, either. When my in laws would (on occasion) watch my young kids, we always requested the dogs be separated from the kids while we were gone (this was never more than 2 hours, so not an unreasonable request). We found out that they put their dogs' feelings above ours when we got a call that our two year old had been bitten in the eye.",
                  "id": 115,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "It's weird that the body of this post talks about having two daughters, but the title says \"Sons Dogs.\"\n\nIn the post linked here, it's written by someone married to a woman. \n\nMaybe this is the same story from the opposite POV",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "Agreed. In what universe is a grandmother expected to prioritize dogs over her actual human grandchild?? NTA, the other daughter needs to make arrangements for a dog sitter.",
          "id": 117,
          "comments": [
            {
              "score": 15,
              "content": "Lol, scroll up. There are plenty of unreasonable AHs that expect that.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Tom Segura stand up bit really hammers the point:\n\n[https://www.youtube.com/watch?v=Ce-unP-e\\_GQ](https://www.youtube.com/watch?v=Ce-unP-e_GQ)\n\n>!I’ve had pets my entire life. It’s the best. I’ve rescued animals. I encourage you to do it. I have a dog that I adore. But here is the difference between my love for that dog and my kids. If that dog were to hurt one of my kids, immediately and without question… I would drown that dog, right? And I mean, through yelps like… \\[yelping\\] I’d go… \\[grunts\\] Like that. And then I would give it to my son. I’d be like, “Remember when that hurt you? I killed it.” He’d be like, “What the fuck… am I supposed to do with this dead dog?” And I’d go, “I don’t know. Maybe learn to stand up for yourself so I don’t have to do shit like that, all right?”!<",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "I’m 99% sure one of the daughters posted. It was the exact scenario.",
          "id": 120,
          "comments": [
            {
              "score": 34,
              "content": "I felt like I read it too! Lol",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "I wish I could find it but yes if im not mistaken ,son in law made the post. Said him and wife knew of her always watching the dogs but think that the baby is a more priority and she should stop. I think it caused the sister to argue ...",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "To be fair, dogs live a long time. She could have had them for years before her work travel situation arose. And, since it’s only a few days at a time, it’s unreasonable to expect her to rehome them over that.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5477,
      "content": "Light NTA BUT - both your daughters have relied on you heavily for their needs. Your daughter with the dogs shouldn't be expecting you to watch her dogs constantly when she is out of town. I don't even understand the point of even having dogs (which need so much time and energy) if she's going to be out of town every week or so for 3 days on end. On the flip side, your other daughter shouldn't be relying on you as well when her and her husband work to take care of the child. What happens in the event your out of town, your sick, etc? Does she have a back up?\n\nWIth that being said, I do understand the need to prioritize your grandson over your daughter's dogs, BUT, why can't the dogs simply be kept in the basement or another room for the hours you have the child? You clearly don't have him 24h a day. I also think the no animals anywhere near the child is extremely excessive and prevents you from ever getting your own pet, in the event you would want let's say a cat.\n\nThere needs to be some form of compromise with both daughters and that needs to start from you. Set ground rules and boundaries within your own home. But ultimately it is your choice and your grandson comes before dogs (childless pet owner here).",
      "id": 124,
      "comments": [
        {
          "score": 1780,
          "content": "Op reply in a comment that it would be too hard to watch the dogs and grandchild. Her husband works during the day. I feel like regardless or not op probably wouldn’t have kept watching the dogs regardless of the rule.",
          "id": 125,
          "comments": [
            {
              "score": 655,
              "content": "I get the feeling that maybe op worked part time just so she wasn't the dog sitter all week.",
              "id": 126,
              "comments": [
                {
                  "score": 133,
                  "content": "Yeah it's pretty clear that OP takes the dogs when her daughter is out of town, not watching them all day, every day.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 305,
              "content": "That's exactly what it sounds like. Unfortunately she didn't express this to her daughter and instead said \"your sister made a rule so I can't.\"",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Then the dogs are too energetic to be around the baby. Dogs shouldn't require constant surveillance. I think theres a reason babymama doesn't want them around her kid.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "These dogs sound like nightmares. If I dropped my dog off at someone’s house for the day, he’d snooze on the tile and the most inconvenient part of his existence would be how close he scootches hoping for pets. I could so easily watch a baby with him around, it wouldn’t even be a factor. \n\nI think the older daughter’s dogs must be complete wrecks if the younger daughter is scared of having them around her baby.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 635,
          "content": "I agree.  If you travel all the time for work, why have the dogs?  It's not fair for the dogs and it isn't fair that she expected her mom to take care of the dogs and the baby.  I also agree that precautions can be taken, but again are the dogs gonna be stuck in a confined area all day while the baby is there?  I don't think that is fair either though.  Her daughter with the dogs is probably one of those that believes it's her kid.",
          "id": 131,
          "comments": [
            {
              "score": 109,
              "content": "Maybe the dogs were with her before she got the job, and her circumstances meant she wasn’t in a position not to take the job. Sometimes you can’t be fussy",
              "id": 132,
              "comments": [
                {
                  "score": 58,
                  "content": "I worked a job that had long hours when I got my first dog. Sometimes my mom watched him. But mostly, I found a great doggie daycare. Dog daycare is much more affordable than human daycare.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "thank you. \nthis last year I got a job for 86 an hour that requires me to be out of town 5 days a week but I have three dogs that I’ve had for years. Was I supposed to just get rid of them when I got a new job? My dogs are a lifetime commitment I will take care of them until the day they are gone, anyone that feels otherwise is the one that shouldn’t own pets.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 12,
                      "content": "**Edit: I agree with you, but** was taking your new job reliant on someone else’s free labor and kindness to watch your animals for you? **Because it sounds like OP’s daughter took this traveling job without considering a backup plan if her mom were to stop watching her animals. That’s being a poor pet parent.**",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Some people are going in on the OP and saying \"YTA\" but I think NTA here. According to OP the daughters are financially successful, so why is the first daughter always gone and not watching her own dogs every week? Get a dog sitter.\n\nAlso, grandma has already watched those dogs for 3 years, presumably for free! Now I say it's the grandson's turn for some attention. I don't understand what the first daughter is complaining about.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Because dog nutters are entitled.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 527,
          "content": "There is a difference between the sisters. The one with the baby didn’t ask OP to do anything. OP offered to watch the baby because *she* wants to bond. She offered to completely change her own life (quit her job) to achieve this goal. It sounds like the baby’s parents were not expecting babysitting from grandma and put in clear boundaries to agree to OP’s request which is at least partially to meet OP’s wants (having the baby around a lot). \n\nThe daughter with the dog is the one who asked for free dog care and apparently assumed this would go on for the life of the dogs. \n\nWhat this gets down to is OP seems to no longer want to watch the dogs after providing three years of free care. She likely should not have agreed to be an unlimited dog care service. Once she decided it was too much or she just didn’t like it, she should have let her daughter know immediately so she would have time to find alternatives. Dog daughter should have been prepared to find an alternative because it really isn’t reasonable to expect an unlimited, free service from anyone who does not have an actual responsibility regardless of if that is babysitting a child or dog or any other sort of care. \n\nDaughter with the baby has a right AND responsibility to make sure her baby is safe. That includes not being around possibly unsafe dogs. I absolutely love dogs. I’ve only ever lived away from them for a few months of my life and I hated it. My dad did keep an unsafe dog he loved when I was little and that created a life long fear of certain kinds of dogs in me. I’ve somewhat worked through that but I still have panic reactions. Another relative kept an unsafe dog around her son until the 3rd time he ended up in the ER (surgeon had to be called) and they threatened CPS action if the dog was not rehomed. Having dogs around young children can work depending on the dog AND the ability of the caregivers to manage the interactions. Daughter with the baby would be negligent if she put her child in a situation with dogs she has reason to believe can’t be trusted around a tiny infant. \n\nOP needs better communication skills. She overcommitted to dog daughter and didn’t want to own up to that so she’s allowed the daughter with the baby to be blamed for OP getting out of that commitment. Daughter with the baby is the only one who isn’t an AH here.",
          "id": 138,
          "comments": [
            {
              "score": 63,
              "content": "Right? I can’t understand why the snowflakes are getting mad OP wants to watch their GRANDCHILD over dogs that she is watching for free. Blows my mind.",
              "id": 139,
              "comments": [
                {
                  "score": 6,
                  "content": "Why doesn't the daughter with the dogs have her boyfriend watch them? Seems like there is definitely alternative choices.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "From what I understand she also offered to watch the dogs when her daughter got her job that required travelling. I think she simply wants to make everyone happy in this situation and has offered herself out so much that now it no longer works out. I still think first daughter shouldn't rely on anyone to watch her dogs, they are her responsability and even though OP said she'd quit her job etc for her grandchild, to me she sounds like a people pleaser and it's also not for grandma to be a permanent babysitter, like I said, in the even she get's sick, goes away on vacation etc. what do that parents do then? Neither daughter is thinking long term and both are going to be/have been relying on grandma who keeps offering them the world. And I think even when offered they are both over stepping a bit. I personally don't believe grandma should live her life for her grandkids (quitting job etc.), she already raised kids, it'S time for her to live a bit, that's a personal opinion though so take it with a grain of salt.\n\nYes I do think children come before pets in this situation but I also don't believe in overusing someone's good graces and their good faith. There needs to be a happy medium between all parties and obviously one where grandma is happy in wtv she decides because it is her life and ultimately her choices that matter.",
              "id": 141,
              "comments": [
                {
                  "score": 48,
                  "content": "I disagree with you in grandchild watching. It is extremely healthy for grandparents to be caregivers for grandchildren if \nA. They are healthy and active\nB. The grandparents and parents agree on key issues\nC. They want to. (This could be what grandma sees as living her life. Some people actually like kids and are sad when theirs leave) \nIt is just certain cultures that think it is weird or wrong. My children are looked after by my mom. She loves it (and is paid). I was looked after a lot by my grandma (unpaid) and I loved her very dearly and miss her everyday as she was a softer more patient mom.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My parents each (divorced) have my son a day a week - at their instance. They gush about how happy it makes them. If they’re sick or on vacation then we see if their nursery can take them an extra day, and if not, one of us takes leave from our work. It’s really not that complicated.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "This is the most wonderful reply.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "[deleted]",
          "id": 145,
          "comments": [
            {
              "score": 41,
              "content": "Nobody is forcing anyone op chose to agree to the rules",
              "id": 146,
              "comments": [
                {
                  "score": 50,
                  "content": "these comments make me so sad. no one has community any more. OP is happy to watch the kid!! no one is taking advantage of her! did none of y’all have your grandma babysitting you over summers or breaks??",
                  "id": 147,
                  "comments": [
                    {
                      "score": 9,
                      "content": "This is how I feel too. All these people saying OP’s daughter with the baby is taking advantage of her are kind of blowing my mind. Maybe it’s a cultural difference, but it’s so normal for grandparents to be involved in raising their grandkids in my community. It’s not considered taking advantage, literally both the grandparents and parents WANT this to happen, just because it’s reasonable and normal to expect help from your family and loved ones.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Did we read the same post? OP offered to babysit her grandchild",
              "id": 149,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Perfect response.  That is exactly why I did not let my mother-in-law watch my kid all day every day.  I didn't want to trap her and knew she would be traveling more when her daughter had a child.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I say NTA because she gave her daughter plenty of notice to find other arrangements for the dogs. OP said she’s not going to be watching the baby until February.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It’s pretty common to use family as a childcare option. Usually in the event that family is sick or out of town, etc. we just call in. I have a daycare and if that were my sole resource I would also have to call in a ton because they close for all sorts of reasons (3 weeks in the summertime, president’s day, minimum day for Valentine’s Day) or my daughter gets sick and has to stay home. My mom is actually my backup so we don’t have to call in as frequently, but honestly I think we would have more consistent care if she was providing childcare than our daycare. All that to say, the daughter with the baby and her husband are the ultimate backup plan if OP can’t care for baby.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "The mother-daughter did not RELY on OP. She OFFERED to watch her grandson, which I think is every grandma's dream job.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Well only one daughter had relied heavily on the mother. The other daughter has a 3 month old and is about to go back to work. The other daughter should respect the mothers choice, but sees her as a free service to watch her dogs that she doesn’t have time for.  She cares more about the financial burden it causes her rather than her own mothers feelings in the matter. If she cannot afford to upkeep her dogs than she should rethink her whole situation. The dog daughter is being selfish.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2404,
      "content": "NTA. First of all, any decision that you make is fine, even if you decided to not watch either of them. They’re not entitled to you watching their kid/pets. \n\nBesides that, I’d choose a human over a pet as well (coming from a childless dog owner). \n\nYou did a perfectly fine thing imo.",
      "id": 155,
      "comments": [
        {
          "score": 295,
          "content": "I think so, too on all counts. OP sounds like a good guy who's genuinely trying to accomodate everyone. Also, I totally get why OP's daughter would be a bit anxious about someonme -- even a family member -- babysitting her new born to begin (my SO's dad had no idea how to even hold our son...), and, I also get why she would be especially anxious with \"rambunctious\" dogs thrown into the mix. As a parent, I'd say no to that too, as a matter of fact. But, I also get why his other daughter is upset if this becomes a financial stress.",
          "id": 156,
          "comments": [
            {
              "score": 156,
              "content": "I get that it’s a bit inconvenient having to search for another reliable dog sitter, I’ll admit that, but when you choose to have a pet, I think you should keep in mind that they cost money as well - besides food and other daily needs.\n\nI personally have 3 dogs and I like having multiple people as an option to watch them. People can always get sick, have emergencies or have a change in their lives that makes them unable to petsit. I always have at least 1 backup",
              "id": 157,
              "comments": [
                {
                  "score": 58,
                  "content": "Having a backup is important. However, finding a reliable dog sitter is not even in the same league is finding a reliable babysitter. Neither are the costs.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I get the financial burden, but dog daughter had 3 years of mom's help. Now mom wants to give some help to her other daughter. Seems fair and understandable. Plus 3 years of free doggy daycare has saved her a lot over the years.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "As a person who prefers dogs over children, I agree.  It's easier and cheaper to find dog care than child care.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Also, care for a dog (doggy daycare, pet sitter etc) is DRASTICALLY cheaper than for a child. Seems pretty silly to compare her help with the dogs to the massive help she’ll be with the grandson",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1732,
      "content": "You helped her out for three years but circumstances have changed and you no longer can...even though you want to. You offered to stop by in the evenings to check on her dogs. \n\nNTA.",
      "id": 162,
      "comments": [
        {
          "score": 557,
          "content": "This. Everyone is missing this point. OP offered an alternative solution and dog daughter refused.",
          "id": 163,
          "comments": [
            {
              "score": 105,
              "content": "[deleted]",
              "id": 164,
              "comments": [
                {
                  "score": 465,
                  "content": "So a dog walker in the afternoon and mom in the evening. That’s plenty and also that’s what happens when you own animals and travel every week. She’s an irresponsible pet owner.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Exactly. I have wanted a pet for years. But I know my current lifestyle would mean a lot of time away from home, not to mention an unpredictable daily schedule. So guess what? No pets for me! \n\nAnd the daughter has THREE dogs? Of course they’re rambunctious - I wonder how much she bothered to train them. Which I feel kind of bad saying, but like…👀",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 232,
                  "content": "Exactly can you imagine taking care of high energy dogs with a three month old at the same time. I feel wiped thinking about it and im young.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 136,
                      "content": "I have a baby and 2 big dogs, one of which is high energy. You know where the dogs are during the day? In my spouses office, “at work.” It is not easy to balance dogs and babies, even with a great system of gates and toys. Idk why so many people think this would be easy for a grandparent to figure out! And that 3 month old is going to be on the move in less than 6 months.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 82,
                  "content": "That sounds like the fucking daughter's problem!",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "And babies aren’t dogs. They require much more care.",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Huh…weird then, for someone who travels multiple days at a time, to own them.  OP is NTA.  Kids over pets very single time.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "So why doesn’t the dog daughter just rehome them if she can’t even take care of them? They’re her dogs.",
                  "id": 172,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "Exactly.  The thing is that her daughter got the dogs 2 months before she got the job.  She should have rehomed them, because it's not fair for the dogs.  Dogs can be an over a decade commitment.  What would she have done if OP said a year ago she couldn't do it anymore?  OP could never be a permanent solution for the next 8 years.  She was going to have to find other care eventually.\n\n\nI think the daughter sees her dogs as actual kids, I think she expects her mom to take this on for a decade for free.  \n\nThe daughter has the money but doesn't want to spend it",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right? One daughter got three years of help. Now OP is playing fair by offering help to the other one. It’s ok to be a little sad at having to find new accommodations but this feels like looking a gift horse in the mouth.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1362,
      "content": "NTA,\n\nBut you'll get the dog lovers calling you one though.",
      "id": 175,
      "comments": [
        {
          "score": 497,
          "content": "That’s exactly what all of these y-t-a comments are lol",
          "id": 176,
          "comments": [
            {
              "score": 135,
              "content": "It’s a shame the top comment is one of those, and because it’s the top comment, the entire thread will get flaired with that judgment.",
              "id": 177,
              "comments": [
                {
                  "score": 9,
                  "content": "Thats something I really hate about this sub sometimes. People will make judgements based on what everyone else says.",
                  "id": 178,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 76,
              "content": "Literally lol",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "And people without children, probably never around children, or are just children themselves….  But they love dogs so they just know they will put their dogs before their babies once they have one.  /s",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 267,
          "content": "It makes sense that we would see this attitude on this subreddit. People are young and tend to like animals. They have no concept that 99% of people in this situation are going to pick a human child (their grandchild!) over dogs no matter the hurt feelings. \n\nThis may sound cold, but it may also help them think about it: these dogs are a few years old and have maybe 10 years max they will be in this woman’s life. And they’re not her dogs. Her grandchild will be one of her closest, most beloved family members for the rest of her life (assuming a typical grandma/grandchild relationship, especially when fostered by helping to raise the kid).\n\nIf it matters: I am coming from the perspective of a childless (for now) dog owner who plans to raise kids with animals in the house.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Not all dog owners. I have dogs and I say she's NTA.",
          "id": 182,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "I love dogs but was thinking \"aita for thinking someone who travels that much should reconsider having 2 dogs\". Plus, it'd hard for me to accept \"dog moms\" as the same as human moms. I have a dog and a human, lol it's not the same love. It just isnt.",
          "id": 183,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "It’s because they can’t handle or have children so they use animals as a cop out. It’s the same idiocy pushing “emotional support” animals being treated like service animals.\n\nThere’s a staggering amount of people who are happy to let their animal shit and piss in their house on “puppy pads” and it’s disgusting.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 882,
      "content": "NTA. Oof, the entitlement. Also, if she is working a job that she has to travel that much and they aren't paying her enough that she can't afford a doggy daycare, she needs to find a new job.",
      "id": 185,
      "comments": [
        {
          "score": 152,
          "content": "And she already did three years of dog daycare.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 861,
      "content": "It’s amazing the amount of people that I know who’s major plan with their pets is having their parents look after them lol.",
      "id": 187,
      "comments": [
        {
          "score": 212,
          "content": "Yeah, if she travels so much for work then why have dogs? If it’s not often enough that getting dogs is reasonable, then she should be able to put away enough money for a dog sitter (otherwise she needs to find a new job).",
          "id": 188,
          "comments": [
            {
              "score": 15,
              "content": "She should have taken a pair of cats. Getting dogs when you know you won't be there to take care of them is cruel. NTA",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "I agree with you but I don’t understand how that’s not also the case with the baby \n\nIf you need free childcare from your parents are you ready to have a baby?",
          "id": 190,
          "comments": [
            {
              "score": 16,
              "content": "Well, the grandma (op) offered in this case, so I’m not sure about need. Again though, having grandparents watch their grandchildren is a practice as old as making babies. If you strictly depend on that, then no you’re probably not ready but idk. I always feel like these posts leave the “this dude hates pets” idea implanted in people’s minds. I don’t, I love animals, have two cats. But like, human children are more important than pets. Straight up, I don’t think you can make the opposite argument in good faith.",
              "id": 191,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "It's amazing the amount of people that I know who's major plan with their kids is having their parents look after them lol.",
          "id": 192,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "My brother lives in a tiny city apartment with a dog. My parents drive downtown to pick the dog up and let her play outside in their yard, because otherwise she spends all day locked inside in a crate. No idea why he thought getting a dog was a good idea....",
          "id": 193,
          "comments": [
            {
              "score": 3,
              "content": "My boomer parents are really only seriously confused by 2 aspects of millennial culture, the popularization of lavish weddings and the amount of dogs owned",
              "id": 194,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 502,
      "content": "NTA - the dogs are not your responsibility and you have the right to stop watching them at any time for any reason. \n\nThe sister probably believes that the dogs are too rambunctious to be around the child which is understandable. Many people view their dogs as well behaved but at the same time the people around them see them as a risk.",
      "id": 195,
      "comments": [
        {
          "score": 16,
          "content": "I've met dogs whose owners said they weren't vicious but then someone got attacked or bit by them. I love my dog but I don't trust him around a baby.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 426,
      "content": "Nta. Minimum she got 3 years free dog watching.",
      "id": 197,
      "comments": [],
      "relation": "Support"
    }
  ]
}