{
  "post content": "I will try to make this short so here goes...\n\nI am a 30 year old married man.  We recently had a party at our place for some close friends after CoVid. 7 of us total.  By different circumstances, we don’t have much family and we decided that we would be our “bubble” of people that we would see during CoVid times.  Four woman and three guys.\n\nLong story short, we drank quite a bit and everyone was planning at crashing at our place.  No big deal, nothing unusual.  The one girl there that recently became single drank a lot (likely due to the breakup) and passed out on the floor.  I moved her onto the couch near us so we could continue talking while monitoring her (didn’t want her to choke on puke or something).   Well, eventually she stirs, rolls over and reveals that she has pooped herself down her skirt and down her legs (also on my couch but it was a shitty couch; now it was a really shitty couch).\n\nEveryone laughs at first then starts gagging.  The couples basically say that’s a sign the night is over and they start going to their rooms.  Well, I’m the lone holdout that we can’t just leave her covered in poop. My wife was too drunk to help and went to bed.\n\nI was conflicted because this was a close friend so I did what I thought was best.  I grabbed baby wipes and cleaned her up. To be clear, I did not touch her vagina at all.  I did clean the poop off her butt and just quickly ran a wipe through her butt crack. (I’m a nurse so I have a super strong gag reflex.)\n\nI slept on the couch next to her just in case I heard her choking.\n\nNext morning everyone wakes up and comes to see their friend covered in poop.  Well she’s not anymore and that’s when it starts.  \n\n“I can’t believe you did that”\n“That’s assault.”\n“You basically groped her.”\n\nMy wife was no help, which hurt badly, and implied that I should have gotten her to do it.  Despite the fact that she was way too drunk to help.\n\nI feel like my friends aren’t messaging me as much anymore and I’m being excluded.  Today was the final straw when I looked at my wife’s phone and saw a group chat of the girls and one of my best friends suggested the passed out girl file a police report.\n\nI don’t know what to do.  I’m so frustrated because I tried to do the right thing.  I’m a god damned nurse, cleaning poop off someone is so clinical and practiced it’s almost routine at this point.\n\nAITA?\n\nTL;dr - cleaned poop off a drunk female friend now other friends are ostracizing me and basically labeling me a predator.\n\nEdit: everyone is asking.\n\nNot same couch.  Same room, different couch.  Sorry. That was vague. \n\nThe girl who had the accident was horribly embarrassed the next day and left shortly after.  I didn’t harp on it because I was trying to not embarrass her even as everyone was calling me out.  I apologized day of, which in hindsight, kinda makes me look guilty of something.\n\nEdit #2:  I didn’t expect this to become so big.  I had to sleep so that’s why the lack of replies.  Basically, I’ll try to answer the questions I saw over and over. \n\nI am in Canada.  So when I said “post-CoVid” what I meant is my province is introducing social bubbles of people that interact with only those specific people.   I recognize that CoVid is a still very much a pandemic.\n\nI’ve also seen a lot of people mentioning that I should stop associating with those people.  This makes sense except for the fact (I’m not sure I mentioned) we all became close because we don’t have other family.  They are really all I have.  My wife was one of those close friends before we got married which is why she still has those private chats I guess.  We also have a young child together which is why I even had baby wipes in the first place.  So leaving my wife really isn’t an option I’m even entertaining despite the literal hole I feel in my chest over this.\n\nAnd no, this may be a horrible thing, but I didn’t have permission to read my wife’s phone.  She got a message on her phone, I picked it up and it unlocked for my face.  (Her face unlocks my phone as well, we don’t really have secrets that way.). The messages were right there, roughly 10 back and forth, and I couldn’t help but read them.  I know that’s a violation of her privacy and I wouldn’t normally do that. \n\nI appreciate a lot of people saying that I was okay in my actions but this will be the last response I make on this.  The negative comments and messages I have been receiving privately are too much to take.  The positivity sent by some people is outstanding and I’m so thankful.  I can’t keep reading messages that I’m a rapist or that I sexually assaulted my friend.  After the pandemic, working insane hours, taking care of a\nBaby and now this... I’m emotionally drained to a point I’ve never been to.\n\nMods can lock this if they want.   Thank you for the support.",
  "id": 1,
  "comments": [
    {
      "score": 8648,
      "content": "NTA you’re a literal nurse and cleaned someone up in as much of a professional way as possible. I can understand them feeling embarrassed, but I don’t see that as assault. You cleaned up your friends shit—You’re the MVP of friends.",
      "id": 2,
      "comments": [
        {
          "score": 4671,
          "content": "Not to mention, your nursehood allowed you to recognise that if someone is drunk enough to poop themselves, they are drunk enough to choke on their own vomit and die. Forget the potential UTI she could have developed if you had left her lying in her poop, you were the only one of her \"friends\" who cared enough to make sure she didn't die.\n\nI'm so sorry your friends and wife suck. NTA.",
          "id": 3,
          "comments": [
            {
              "score": 1718,
              "content": "Not only a UTI, poop really irritates skin. Can't be good having it on there for multiple hours if babies get hurt if you change them a couple minutes too late.",
              "id": 4,
              "comments": [
                {
                  "score": 894,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 326,
                      "content": " Completely agree. I work as a healthcare assistant (in the US I think the equivalent would be a CNA?) and we have many incontinent patients, and we are stressed that tissue viability and skin integrity is incredibly important. Moisture lesions can occur surprisingly quickly but can take a long time to heal, aside from being terribly painful. If my friend had been in this situation I’d have done exactly the same thing. NTA.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 353,
                  "content": "I've seen a baby with literal bleeding wounds on the butt because the parents only found out hours later. Definatly painful and not the place you want open wounds. And it was not easy to get off.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 412,
                      "content": "My son has intensely sensitive skin and if he isn't changed IMMEDIATELY he gets red. He can only wear a few diaper brands, can only use one or two diaper creams. You gotta constantly check or it's hell.\n\nThis man is a frickin nurse. \"File a police report\", just because the chick is so embarrassed that she pooped herself? And the rest of them for scurrying out to laugh at her in the morning. Wow.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "How do you do the spoiler thing with blocking out text? I wanna say something but it's a bit graphic and I'd like to make seeing it optional",
                  "id": 9,
                  "comments": [
                    {
                      "score": 69,
                      "content": "Type > !text here! < \n\nWith no spaces between the symbols. So you get something >!like this.!<",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "This was my top thought too! I babysit a toddler and he will get a rash the second he poops if I don't change him. Plus, the rash will last a week. She really would have rather been left in her own feces?? I don't think so. I think OP was damned if he did, damned if he didn't. If he'd left her there, everyone would have asked why a medical professional wouldn't have stepped in to help.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 664,
              "content": "This was my first thought.  If someone is so drunk that they have passed out and lost control of their bowels/bladder, that is someone who is exhibiting signs of alcohol poisoning, and it's a serious situation that can absolutely lead to death. I mean, we've all gotten drunk and had that moment of, \"Oh shit, I did WHAT?\" the next day. But someone who has consumed enough alcohol to the point that they are unconscious and shitting themselves is someone who actually might need medical intervention.  The fact that everyone else passed the buck and are now mad about OP's attempts at care shows that they are terrible friends.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 533,
              "content": "NTA OP. And not to mention, when the \"friends\" woke up in the morning, they went to see the show, to laugh at the friend they left covered in poop for the whole night. With friends like these, one doesn't need any enemies.",
              "id": 13,
              "comments": [
                {
                  "score": 105,
                  "content": "They were just mad she wasn't covered in crap.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 184,
                      "content": "I agree. Nobody else has mentioned this so I will. They friends are saying it's inappropriate of op, but how many of us actually know someone who is turned on by a poop covered person? I don't know anyone who would find that attractive. If I had to clean crap off of someone, sex would be the furthest thing from my mind. Imo op's \"friends\" know they done f**ked up and are trying to make op look like the bad friend instead of themselves.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "I can guarantee that if a guy had shit himself and a female nurse had cleaned him up, nobody would have had a problem.\n\nDouble the sexism in a single incident. Wooo.",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 112,
              "content": "That’s what’s getting me here. The friends are up in arms about him cleaning her like they would’ve preferred she be left for hours covered in her own shit. What kind of friend thinks that’s okay?",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "People act like it is normal because it is alcohol but from a clinical perpective this is just like an overdose on a drug, because that is what alcohol is. At that point it becomes a low-key life-death situation, a medical one. \n\nShe *shat his couch.*  (Momentary) Agency of a toddler, treatment like a toddler.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "yup. in no way is cleaning poop off someone “inappropriate”. i understand it required some touching that she may have felt uncomfortable with but she was covered. in. shit. like, come on. if he left her to fester in literal poop he would probably be the asshole.",
              "id": 19,
              "comments": [
                {
                  "score": 47,
                  "content": "> if he left her to fester in literal poop he would probably be the asshole\n\nRight! I thought this too... i think either way they'd be calling him the asshole. They all would have woken up and seen her (and laughed) and she would be pissed that NO ONE helped her... then they all would have pointed the finger at him because he's the nurse. Drop these friends, OP.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Also the 'friends' wanted to witness the poop in the morning and were disappointed at not being able to have renewed laughter at the situation. Poor woman left because she was embarrassed enough without having the friends make more fun. OP acted professionally and is NTA",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Also, how many sexual assault cases begin with the victim sh*tting herself?",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Could u imagine dying like that people finding your dead body covered in shit and vomit!",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1102,
          "content": "I mean. What's the alternative? He lets the poop fucking soak into his couch?",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 418,
          "content": "I assisted in a case where a guy had his arm amputated because he passed out drunk on it, and his wife left him there.  Drunks really don't get how dangerous it can be to drink that much.  Cleaning off someone's poop is basic care.",
          "id": 25,
          "comments": [
            {
              "score": 134,
              "content": "Can you elaborate on that? How long was he passed out? Did they have to amputate because of nerve damage, did he somehow manage to pinch off an artery, or what? That’s honestly terrifying and I need to know more. Forget drunks, I don’t think most *people* know that you can pass out in such a way that it results in loss of limb, short of ambling onto some train tracks and blacking out before you get all the way across (and then a train comes). If you don’t mind, could you share more?",
              "id": 26,
              "comments": [
                {
                  "score": 180,
                  "content": "Saturday night palsy. You get so drunk that your body doesn't respond to the pain signals to move your limb from a bad position. Depending on how severely its squished, it may never recover. Also, if you are passed out long enough with limited circulation your muscles can die and then poison your body when you straighten out.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 151,
                  "content": "He was a large person, and was insensible. The pressure of his body cut off circulation to the arm, apparently beneath his body, so the tissue died. Similarly, people who are trapped under collapsed buildings can lose limbs if the pressure and duration are enough. The specifics are unusual, but the mechanism is not.  \n\nAs for time, pressure sores can develop in 2 hours. He was certainly passed out longer than that.  \n\nIf Aron Ralston, the guy with his arm trapped under a rock, had been rescued, they likely would have had to amputate later. Crush injuries are the worst.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 11,
                      "content": "What's worse then the crush injury is what happens when you get the crushed limb out.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "\"pressure sores can develop in two hours\"\n\nOh, damn! I had a suspicion  and you just confirmed it; I have gotten pressure sores on my boobs from breastfeeding, when they got engorged.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I have been in cases of this where people lost limbs because they were laying on them (high, drunk, etc) for 6-8 hours. It doesn't sound like a lot of time, like a normal nights sleep, but these people are laying on limbs UNMOVING, which means when you or I would roll over when we got uncomfortable, these people were unable to, and so cut off their circulation for 6-8 hours. That's more than a enough time to kill a limb.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I knew of a case where they had to amputate both of woman's legs below the knee, because she fell asleep sitting on them, like they were folded underneath her and she cut off her blood supply.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "A distant uncle got drunk and broke his arm after a night out while on home leave from the army. Woke up the next day (still drunk) and it hurt so he drank some more until it didn't hurt. And the next day after that and so on. By the time he sobered up enough to realise that he'd actually done something serious to his arm things weren't too great. He kep his arm but it cost him his army career.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 377,
          "content": "Hijacking this comment to say, it's also sexist for his wife to say she should have done it as if a woman couldn't assault another. Consent is consent no matter the gender. \n\nAssuming he didn't leave out any of the other friends replies, they seem to be onboard with the idea of the wife offering to do it instead which would make them massive hypocrites. \n\nI get as a woman you probably want a fellow woman to help with dirty business but they were discussing sexual assault not just regular you-shit-yourself embarrassment.",
          "id": 34,
          "comments": [
            {
              "score": 107,
              "content": "Also, fuck those friends cause none of them stepped up to clean the literal shit off their friend, not even the women. So how dare they shout abuse at OP when they offered no help at all.",
              "id": 35,
              "comments": [
                {
                  "score": 2,
                  "content": "And the fact it was also his couch, so would they rather her just get shit all over his couch?  Also the fact they wanted to make fun of her but couldn't because he cleaned her.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "So true!!\n\nId be happy if a nurse did it as they are used to it!",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "Seriously. I would never get drunk enough for that to happen to me (that freaks me out), but if it did I’d be glad someone helped instead of letting me just lie there. Holy shit. Your friends are fucked in the head. I would honestly never talk to the people who suggested she file a police report ever again. I know that’s drastic but that’s what I would do.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "SO is a nurse and said “I wouldn’t have even blinked at doing that” then proceeded to say how bad SO felt for OP. \n\nNTA.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Nta. I'm a female psw, I been sexually assaulted, I been raped, all that jazz. You did nothing wrong. You did something clinical. They are over reacting\n\nI understand your other system, my family lives 2hours away, I too live in Canada, I just have my husband, and 18month old, but no one to bubble with.\n\nJust big hug, relax",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Lots of AH friends here but NTA",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Crappy friends leaving a friend to fester in their own feces and potentially choke on their own vomit and die sitting up\n\nYou’d think this would be outgrown... or at least people would trust each other more and trust each other to be trustworthy in their supposedly close group?",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "If my friend shat herself, I would be helping this guy. Friends don’t let friends sleep in their own filth!",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3237,
      "content": "NTA (to me), but It really only matters how the pooper feels about it, which is left out of this story. Did she ever say anything to you?\n\nYour wife is an A though. She is in a group chat with her friends bashing you? I mean can't your wife assume you had good intentions being that you are 1. a nurse and 2. her husband? Why wouldn't she trust your intentions?",
      "id": 44,
      "comments": [
        {
          "score": 2348,
          "content": "She was super embarrassed the next day and didn’t say much.  But with the private messages she seems to becoming swayed towards being upset.  \n\nThis has caused a big rift between my wife and I.   I’m so upset.",
          "id": 45,
          "comments": [
            {
              "score": 1328,
              "content": "i feel like your wife of all people should be on your side. maybe she feels guilty that she got too drunk and went to bed instead of helping you? i don't understand what kind of person would say it's better to let your friend sleep in her own shit (on your couch...), especially since you needed to stay out there to make sure she didn't choke. were you just supposed to put up with the smell? NTA at all, it's an uncomfortable situation but that's what (nurse!) friends do",
              "id": 46,
              "comments": [
                {
                  "score": 441,
                  "content": "He handled it better than militarily minded would have. This would have involved the shitty offender wakening up in a bath tub after a full showering.\n\n\n\nNTA",
                  "id": 47,
                  "comments": [
                    {
                      "score": 222,
                      "content": "Omg my husband, while we were dating, military minded showered me covered in vomit when I was BLACK OUT DRUNK. I came to the next day in fresh clothes and hung over ass all heck. I remember brief bits of him being mad and showering me and me puking all down my front and in his closet. I never accused him of assault.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 190,
                  "content": "Honestly maybe it was just worded badly, but it sounds like the friends wanted to come down and make fun of her for shitting herself.\n\nThey probably all feel bad for not helping her so they're lashing out at him instead. Would they have been this upset if OP was a woman? Doubt it.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yeah really seems like they're all trying to deflect blame from themselves.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It's probably just regular old social pressure. If everyone around you is saying the same thing, even if it's incorrect, it can wear you down and become persuasive.\n\nOP should link her to this thread.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1069,
              "content": "I'm really sorry you're having to deal with this--I'm honestly curious, what does she feel you _should_ have done? If she would have preferred that you left her there in her own shit overnight and returned to laugh at her about it the next morning, I would just let her know that you'll make sure to do that next time. I can understand her being upset and maybe even feeling violated--it was, and is, a shitty (ha) situation for everyone, and while what you did was the right thing imo, that doesn't mean it _feels_ like the right decision to those involved, especially when they didn't get to have a say. I don't think you're asking for advice, and I trust that you can handle the situation yourself, but coming at this from a stance of \"Maybe people don't agree that what I did was the right thing, but I hope everyone understands that doing nothing would have been the shitty (_ha_) thing to do\".\n\nAs for your wife, you definitely need to address the way she doesn't have your back. We're here to tell you that what you did was the good and right thing to do: if she doesn't feel that way, or if she does feel that way and doesn't want to take sides by defending you, that is a _very_ big problem.\n\n(And for what it's worth from an internet stranger, I _promise_ you did nothing wrong, and I hope you don't doubt yourself for long, because you are a good friend and deserve better than the treatment you're getting right now.)",
              "id": 52,
              "comments": [
                {
                  "score": 406,
                  "content": "Honestly yeah, have ANY of these people said what you should have done? Not just “you shouldn’t have touched her”, an actual explicit guide to what would have been the right response. \n\nIf they can come up with one that wouldn’t have risked your friend’s health, wouldn’t have needed anyone else to step up, and wouldn’t have involved you getting your friend undressed _at all_, I’d love to hear it. I’m going to be they haven’t and can’t, though—it’s so much easier to be angry than to be helpful.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 295,
                      "content": "I can see how easy it would be to dismiss everything that could have happened if OP hadn't done what they did, because it didn't happen. No UTIs, no rashes, no waking up hungover and more humiliated than you've ever been in your life. None of it happened, she's fine--but can you imagine how they all would have treated OP once they were sober and able to think clearly about what should have been done? Once they realized that as a nurse, OP _should have_ tried their best to clean her up? If this isn't the timeline where OP doesn't lose their friends over how they reacted in this situation, I'm upset imagining what would have happened if they didn't, both physically and socially.\n\nMaybe they're a friend group with better humour about these things than me, and not that I think what happened to her was even remotely shameful, but I don't know that I'd be able to look my friends in the eye for a very long time if I woke up on a friend's couch having spent a night in my own shit. If I found out I was associating with people who treated one of their own like this, I'd be dropping them.\n\nAlso, I just realized--without question it would have been irresponsible and dangerous to leave her alone considering how drunk she was. So if nothing else, OP was in the clear to clean her up so they didn't have to spend the night next to someone's literal shit. But if nothing else has convinced everyone that what they did was right, that probably won't sway anyone.\n\nAll of this makes me incredibly angry",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Clearly, he was supposed to use a Swiffer or roll her into the yard and hose her off.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "Not just what should *he* have done- what should *they*  have done. They were apprised of the situation, they knew she had pooped herself, laughed, and went to bed. They are not blameless here. If they are going to criticize how OP handled the situation then they have to face the fact that they handled it much worse.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 94,
                      "content": "That also bugged me, that even his wife said he should've just gotten her to do it--if that's how they felt, _why didn't she?_ It sounds like she was very obviously super drunk too, so what was the plan? For her to clean up her drunk friend while she herself was wasted? And how is everyone else not an _immensely bigger asshole_ in this situation for making the conscious decision to let their friend sleep in her own literal shit, probably ruin the couch, _by herself,_ and then come back in the morning to spectate her waking up like that? I know I'm not a part of the situation, but part of me is less sad at this point at how they're treating OP and more disgusted at how they showed themselves to be huge assholes before OP even touched her. Ugh.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "These “friends” who are complaining are horrid people in any event, whose judgment is worthless. They left her like that, didn’t try to help, and were coming out to laugh at her in the morning? Why would you want people like that around?",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I can get where the friend is coming from. She was passed out and touched without her consent, so I would probably at the very least feel a little embarrassed (mainly that I put my friend in that position, but of course we don't really know how she's feeling now without an update) if I were in her shoes. \nThat being said, OP was the only one there that was willing or able to take care of her in a situation where she could have potentially gotten ill and had alcohol poisoning. Knowing the backstory, I definitely don't think OP assaulted the friend, but it's easy to see why she would feel that way, especially since it seems like all of the other friends are pushing the assault narrative. \nLike you said, I don't think OP is asking for advice, but if I were in their position, I would have a discussion with the friend with an impartial third party in the room. That way they can discuss the situation without the influence of the other friends, there's a third person there so the friend doesn't have to worry about being alone with OP, and the third party can verify the conversation was had and anything said if the friend does end up filing a report.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "You are NTA man.\n\nSexual assault requires either intent or action. It's not assault to assist someone who is not capable of consent when you are simply providing care and not fulfilling a sexual desire. \n\nIn hindsight you probably should have told people ahead of time what you were going to do and asked one of them to chaperone, but you didn't. \n\nI really don't know what to say man, if I were you I'd start by asking my wife why this situation is different than any other time you've wiped the ass of an incapacitated patient. \n\nYou can't stop other people from saying what they wish but you can try to counter it with open dialog with your wife. I honestly think it's fair to ask her what she would think if she were in your friends shoes. Would your wife think you violated her by providing her care when she was incapacitated?",
              "id": 60,
              "comments": [
                {
                  "score": 113,
                  "content": "Do OP’s friends think that it’s assault when a nursing home worker wipes the ass of an elderly dementia patient without asking consent? Or when someone who isn’t a parent (like a babysitter) changes a baby’s diaper? Unless OP has a secret scat fetish, I don’t see why they would think he was getting a sexual kick out of wiping rancid fecal matter off of someone else. \n\nIf OP had done nothing (like the friends apparently wanted him to) and the drunk friend got a nasty rash or infection from being encrusted in poop all night, they’d probably be (rightfully) pissed at him for doing nothing to help.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "He can't win, if he asked someone to chaperone, the chaperone would be in trouble, too and OP would be the pimp who showed off the naked butt of somebody who doesn't consent to other people.\n\nI think it might help to talk to the pooper who might have felt more embarrassed than violated right away; but by now thanks to everyone's input, that probably changed. It's worth reassuring her that there were no predatory intentions or actions at all and that cleaning her up was just a measure of care. OP as an alleged assailant can't defend himself well here; but she can!",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "If she is upset then send her a bill for a new couch.",
              "id": 63,
              "comments": [
                {
                  "score": 31,
                  "content": "And assuming they are in America, a bill for providing this medical assistance. Since acting as a friend was so wrong, charge for the night nurse they were forced to be.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "1000%",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 85,
              "content": "Your wife is more concerned about what her friends think than what YOU think. Sucks buddy. :(",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "[deleted]",
              "id": 67,
              "comments": [
                {
                  "score": 3,
                  "content": "It does make sense there are tons of assholes in the world and he aligned himself with a bunch of predatory assholes. They were wolves in sheep’s clothing (including his wife) and the opportunity presented itself for them to unzip the mask and the rest is history.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "I'm so upset for you. It's completely sexist. If you were a woman and did this, as a nurse they would all be bragging about your kindness. I'm a nurse and a woman and over the last 30 years I've wiped everyone's butt at least once it seems.  (Family, I mean ) Plenty of those times someone else volunteered me to help them BECAUSE OF THE NURSE THING. But since you are a man it is sexualized. It's total bs. You should try to get the whole group together and explain this to them and if they don't see the error of their ways, they are not your friends. Your wife owes you a tremendous apology. They are such assholes. You rendered care because that is who you ARE. You are obviously the kind of nurse who it is not a job for. You are a nurse who renders care because you care for people. Your friends suck. You are a credit to your sex and your profession.",
              "id": 69,
              "comments": [
                {
                  "score": 3,
                  "content": "They might use what he says against him. At this point he should just avoid contact with everyone including his wife and contact a criminal attorney and be ahead,of the game. If he can move out in the time being thats also a good idea.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "IMO, the only way you've fucked up here is by not reaching out TO HER that morning to talk about it. I've been in several similarly sketchy looking situations in my early 20's as I was naturally a really good sitter for psychedelics even when I was tripping as well, and it's incredibly difficult to know what the right right thing is when taking care of an obliterated friend. If she'd have been a dude, they'd likely be making fun of you for cleaning up his shit, honestly. \n\nI've changed/half-assed wiped down vomit-covered and passed out/too sideways to speak much less function in any way friends/acquaintances of both sexes, partly because I didn't want them stewing in their own vomit, but mostly because I wanted as little vomit on my stuff as possible. Only one was ever anything but grateful, and she was more mad that I didn't wash her soiled expensive club wear than she was that I'd put her in basketball shorts and a Tshirt. Of course I never touched anyone inappropriately and took no pleasure in what I was doing. \n\nThe one that still gives me anxiety when I think about it was when a relatively new coworker went from almost zero to sloppy in an hour, leading us to believe that she'd been drugged, since she typically held her liquor pretty well. I lost the rock, paper, scissors tournament, so she was my responsibility. It didn't dawn on me at the time that I should bring someone with me to protect us both. \n\nAfter she'd sent us to the wrong apartment 3 times, I was fed up. So I took her to mine, and had to help her the whole way to the couch, where she passed out halfway through a glass of water. I stayed in the living room watching TV/playing video games for a couple hours to make sure she was okay, then went to bed.\n\nAt some point in the night, she came into my room, stripped naked, and tried to sloppily seduce me, calling me Steven the whole time. That's not even close to my name, which she knew damn well and was even farther from the nickname she had for me. Obviously I noped out and tried hard to get her dressed, but she slapped me and called me names when I tried to put a shirt on her, so I let her have the bed and left her tucked in and crying to sleep on the couch with 2 bottles of water and a couple advil on the nightstand, and a vomit bin on the floor.\n\nShe woke up naked in a queen sized bed in strange apartment, only remembered crying naked in an empty bed that wasn't hers, and understandably freaked out. I tried to calm her down and explain what happened and why she woke up where/the way she did, but as far as she was concerned, I'd raped her. Thankfully, I'd spent the night blowing up our group text with updates about all the bullshit, complete with pics of her passed out fully clothed on the couch, and subsequently tucked in and covered but obviously topless in my bed. I showed her the text chain, and it still took the group en masse telling her I'm not that guy for her to accept that I'd actually kept her safe and that she shouldn't go to the police. \n\nRest assured I never took care of a sloppy female acquaintance again.",
              "id": 71,
              "comments": [
                {
                  "score": 3,
                  "content": "That’s really heartbreaking actually, I’m sorry you had to got through that. You sound like a really caring and kind person. I completely understand why you never want to be in that position again, but I hope you don’t feel you have to cut that part of yourself away completely. \n\nAnd fwiw, if I ever get that sloppy drunk with anyone I pray they’re half as considerate as you were, even if it means I wake up confused, scared, and naked in a strange bed. I’ll take those feelings over waking up soaked in my own vomit—or not waking up at all.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "This probably is the last thing you want to hear, but your wife has problems. And if she's not even willing to listen to you, than you might consider separation and marriage counselling to see if you should stay married or get divorced.\n\n&#x200B;\n\nIf this had happened to me, and my partner did this to me...there would be PROBLEMS.\n\n&#x200B;\n\nI'm sorry this is happening to you.\n\nFurthermore, I'd advise you to talk to a criminal attorney to get your bases covered. Because if your wife and her friends manage to talk your friend into being upset, the cops won't listen to you. They will listen to the women; they won't care if you're a nurse or not (unfortunately).\n\n&#x200B;\n\nOh and obviously, you are not the asshole here. You are the hero tbh.\n\n\\--\n\nEdit: specifying which type of attorney",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I can't believe I'm about to be this person but why are you still with your wife? If she's trying to get the friend you helped to file sexual assault charges against you?? I would never stay with someone like that.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2775,
      "content": "NTA. \n\nThat said, I’m disappointed in the behavior of your friends and wife. They suck. You didn’t mean to offend anyone or hurt anyone. You did what you thought was best and given your background and the situation. \n\nThat also said, have a lawyer’s number just in case they pursue this further. It sucks that I even have to say that.",
      "id": 75,
      "comments": [
        {
          "score": 1951,
          "content": "This comment broke me.  I can’t believe I have to consider having a lawyer right now.",
          "id": 76,
          "comments": [
            {
              "score": 939,
              "content": "The crazy cynical thing you have going for you is that courts rarely prosecute even full blown rapes and sexual assaults, so it’s unlikely cleaning up some poop is gonna cancel ya.",
              "id": 77,
              "comments": [
                {
                  "score": 407,
                  "content": "This is true. I really doubt this will have any legal consequences, although with OP's social group the damage may be done.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 278,
                      "content": "Good.\n\nThis is a toxic group of friends OP does not need in his life.\n\nI'm more concerned about his wife.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Sounds like they're bad people anyway. OP would be better without any of them.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Often with rape and sexual assault the issue is lack of evidence but there is multible witnesses (to tell she didn’t consent and op admitted it) and op admitted this to the girl and also apologized like he knew he was doing wrong. That is often used as evidence for fault (usually for issues like car crashes). However luckily op is Canadian and to my understanding merely apologizing is not considered as evidence in the legal system (there is jokes often made it’s because Canadians apologize so often automatically). But this could be an issue for him. His job probably does help however.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 294,
                  "content": "Well he probably won't face legal consequences but the social ones can much more damning. If she files a police report and it gets any kind of traction he will be publicly crucified for touching a girl while she was blacked out. \n\nIt's a sad reality rapists don't face justice and innocent people have their reputation crucified because if it.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 168,
                      "content": "Won't she have to report exactly what he did though?  Like, in whatever report is potentially filled it'll have to be noted that he wiped shit off her while she was passed out drunk?  Won't the police or whoever take one look at that and just be like \"wtf?\"",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "I’m so sorry :( weirdly enough, this exact same situation has happened to me. My friend passed out drunk at a party and pooped herself. No one wanted to deal with it so I cleaned her up, threw her shorts away and put new ones on. In the morning she was super embarrassed, but the group consensus was that it had to be done and no one did anything wrong. Some people even called me a saint for dealing with that - no one wants to clean poop in any situation, it’s so obviously not sexual and exclusively health related! You couldn’t just leave your friend covered in shit all night, that’s disgusting. I can’t believe your friends are acting like this.",
              "id": 84,
              "comments": [
                {
                  "score": 60,
                  "content": "I have to ask, what is your gender though? Sadly people probably won’t think it was creepy if it was a girl helping a girl.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 24,
                      "content": "That is a good point. I’m also a female, but I’m a lesbian so if my friends were as weird as OPs about this they could have made an argument that it was inappropriate for me to help my straight female friend as well. But it does seem that gender is specifically playing a role in this for OP",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My roommate and I had to do this but with vomit, only we elected to put her in the shower fully dressed (insert “I’m washing me and my clothes” clip here). She was conscious though, so that made things a little easier. It was pretty funny actually, very similar to washing a dog. Then the wet clothes prompted her to strip NAKED after which we scrambled to kick the boys out into the hall, wrap her in a blanket, and cajole her into putting a nightgown on.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 188,
              "content": "[deleted]",
              "id": 88,
              "comments": [
                {
                  "score": 106,
                  "content": "I’m with you. I’m giving the wife a big ol’ side eye.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 72,
                  "content": "Seriously, if your spouse thinks you're capable of sexual assault:\n\n1. Why are they still with you?\n2. Why are you still with them?",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 131,
              "content": "[deleted]",
              "id": 91,
              "comments": [
                {
                  "score": 24,
                  "content": "Thanks for what you do!",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 102,
              "content": "Just in case no one else has said it, if this ends up becoming a Thing, DO NOT talk to the police if they contact you. Even if it’s just a “friendly chat to get your side of the story”.  DO NOT talk to them. Tell them you will not speak to them without your attorney. I can not stress how important this is.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Have you tried reaching out to her by yourself? If I were you, I'd shoot her a text and ask what she would have preferred you do (not in a defensive way, but as an educational thing).\n\nAs a woman, I would have been mega embarrassed, but also extremely thankful to have a friend like you looking after me. You used your knowledge and training as a nurse to help her.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "You should delete this post and repost at r/LegalAdvice",
              "id": 95,
              "comments": [
                {
                  "score": 121,
                  "content": "I agree with deleting this post but I disagree with that subreddit. It gives suuuuuch bad legal advice. Best thing OP can do is delete this, get any information he can saved and backed up, and maybe have a lawyer on retainer just in case",
                  "id": 96,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Isn't their legal advice usually \"talk to a real lawyer\"? How is that bad?",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Why bother deleting post when auto mod saves a copy?",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "I think the first thing you need to do is have an open and honest communication with your wife and also with the woman who pooped, explaining what exactly happened and why you did what you did. In general, honest communication is the key to any marriage.",
              "id": 99,
              "comments": [
                {
                  "score": 11,
                  "content": "Sitting down together with the wife and the friend together. If that happened to me, I would be mortified but I would understand. Talk to them directly and clinically about the actions that were taken. How you slept on the couch nearby to make sure she didn't choke and that you were really just following your Hippocratic oath as a nurse.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yeah, it’s awful but he’s right.  Please get an attorney immediately. I have an SCI and the stuff I have seen and heard about nursing staff getting harassed and having legal action taken against them for providing medically necessary consensual care is appalling.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "You need to to protect your license - if she accuses you of something you can get it taken away in a heartbeat, it’s pretty important you resolve this with them before she takes a legal avenue if your AH friends and wife have anything to do with it.  My BIL was accused of sexual assault over a stupid drunken incident and he lost his nursing license forever (in PA, not sure what state your in but the BON does not generally screw around with assault charges)\n\nYou are NTA for being her caretaker, I can’t even count how many time as a nurse I’ve cleaned poop up off of somebody.  The line is with her being 1) not your patient and 2) not able to consent being touched.  Ethically as a good human you did the right thing helping a friend, but if she doesn’t see it that way then you absolutely need to protect your future career.\n\nWe nurses just can’t help ourselves when we see someone in need - you’re a good human, don’t forget that.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2052,
      "content": "NTA, but everyone else in this situation is.\n\nYou are a trained medical professional. You tried to help, and probably prevented a terrible rash/infection.\n\nEveryone else is the AH:\n\n* **The “friends”:** they laugh at the expense of the girl who shit her pants and not one person offered to help. In the morning they literally get up ready to make fun of the girl! They go to view her like she’s an exhibit in a museum of mortification. That’s just cruel. Some friends you got there.\n\n* **Your wife:** she’s probably the biggest AH here IMO. She should be communicating with YOU. If she is hurt, or feels uncomfortable she should be opening a dialogue with you so you can confront the issue and move on. **Your wife is actively participating in the narrative that you sexually assaulted a girl covered in shit. She is making a choice to communicate with the people who are against you, the people who are discussing filing a police report for sexual assault** instead of communicating with you, her husband. Your friends are isolating you, and your wife is choosing to participate in that. She’s putting everyone before you. **That’s the shittiest thing In this entire post.** She doesn’t have your back, she isn’t supporting you, and she isn’t trying to diffuse the situation.  I’m sorry this is happening.\n\n* **The girl who shit her pants** first of all who the fuck gets that drunk at 30 that they shit their pants at a friends house? That’s inappropriate, and embarrassing behavior. If she doesn’t view it as a sexual assault she should stand up to the friend group and say that. She’s an AH for letting them sway her into something that could potentially ruin your life.\n\nBottom line: you’re a trained medical professional. You didn’t enjoy wiping her shit up. You weren’t sexually aroused by wiping the shit that was running down her fucking legs. You were just trying to help. Your friends are sexualizing this, and are trying to convince this girl she’s a victim. Your wife isn’t trying to defend you in any way from these allegations, and she hasn’t show you support.. Your wife is making some interesting choices here and I think you need to have a calm, sit down talk with her.  See what she needs, how she feels, and what you both need to do to overcome this.\n\nEdit: I’d also like to add that I would recommend reaching out to Ms. Poopy Pants and talking this through with her. I would apologize (it will not make you look guilty). Tell her your intentions, emphasize that you’re a medical professional and were just trying to help. Be sincere. I’d try to nip this in the bud as quick as possible. \n\nGood luck to you man, you seem like you’re a good man who has good intentions. I’m sorry you’re going through this, I can’t imagine how stressful or scary it is. If you want to talk please DM anytime.",
      "id": 103,
      "comments": [
        {
          "score": 658,
          "content": "Especially since OP said the girl is being “swayed” it kinda seems like she’s using the outrage of the other woman against him to take the focus off the fact that she’s 30 years old and shit her pants on a friend’s couch at a party. The more everyone talks about OP, the less she has to be confronted with her own humiliating actions.",
          "id": 104,
          "comments": [
            {
              "score": 204,
              "content": "She should be extremely embarrassed and apologizing to OP.  You are completely right that she is probably happy the spotlight is not on her.\n\nPersonally, I would never let her back in my house.",
              "id": 105,
              "comments": [
                {
                  "score": 14,
                  "content": "I’d never let any of those friends back in the house. Including Susie-shit-my-pants.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Honestly it makes me fucking laugh everytime we mention a 30yo got so fucked she shit herself lol. We all have a 'code brown' incident in our lives, but damn. Homegirl got fuuuucked lmao",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It's also possible she has no recollection of what happened and is just going off what people are telling her. Totally agree NTA though",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "This. You simply wore your nurse hat for a few minutes when nobody else was prepared to.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Take my poor person's award 💰🥇🏅\n\n\nAll of this OP! Plus as someone else pointed out, if an ambulance had been called (which tbh probably should have been if they are shitting their pants) a different medical professional would have charged her hundreds of not thousands of dollars to do the same thing you did.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "u/caughtshithanded this is what you need to read!!!\n\nYou are NTA, your friends are. They are all old enough to know better",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "This comment deserves an award, I'm sorry I can't bestow it. Instead I can offer you this bunny 🐇\n\nAnd OP, your 'friends' are terrible people and frankly, so is your wife. I'm sorry you're going through this.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Can you imagine this in a courtroom?\n\n\n\n“Yes your honour what happened was I got so drunk at a friends house I passed out on their sofa and proceeded to shit myself getting it all over both myself and his couch. He then proceeded to wipe the shit off me which he is trained to do but I deem this as sexual assault” \n\n\n\nNo judge in the world is ever going to rule in her favour. If I was op I’d take her to the small claims court for the cost of the couch.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Copy these words and send them to the group. For real. Your friends and wife suck. NTA.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This right here. This is the post. NTA, absolutely.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Omg yes, this. NTA",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This needs to be top comment. OP, you really should reach out to Ms. Poopy Pants. Ask about her feelings, explain yourself and apologize for having to do this. Talk it through and hopefully you can all move in then.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1309,
      "content": "NTA - I would be pissed if I was that girl and somebody told me the next day that they considered cleaning me off, but then decided against it.  It would cause rashes and possible infections if I had any cuts on my legs covered in crap.\n\nAnd the fact that your a nurse, your take care of people.  If somebody had found her like that on the street, and brought her to an ER, a nurse would certainly have done what you just did.  The only difference is that she did it in a house.\n\nYou are NTA and I hope if I ever need it one day, that I have a friend as good as you!",
      "id": 118,
      "comments": [
        {
          "score": 643,
          "content": "If I was the girl I'd be pissed at everyone but OP. Why did the other couples go to bed instead of trying to help? It's really fucked up that they came downstairs ready to have another laugh at their friend for having an accident. NTA and I pray that you don't get charged for anything. You also might want to take a look at your marriage.",
          "id": 119,
          "comments": [
            {
              "score": 205,
              "content": "Yeah, if even one other person (preferably one of the women) would have stayed in the room there would be no allegations of assault. The 'shadiness' of the situation is that there were no witnesses ... but that's because all of her other 'friends' just went to bed without caring if she was blackout drunk, covered in shit, and at risk for choking on her own vomit. The whole lot of them (except the one who shit herself) are terrible including OP's wife, they left that woman in a vulnerable and dangerous situation and got upset at OP for caring for her.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Let’s not forget that she first passed out on the floor and OP was the one to pick her up and put her on the couch so they could make sure she was safe. The friends didn’t do anything. They didn’t have a problem letting OP take responsibility for her earlier, but suddenly he’s a monster because the whole night they didn’t give a fuck about her? If OP hadn’t been there, she’d still be on the floor and covered in shit, and maybe worse. But apparently helping people is a crime. ¯\\_(ツ)_/¯",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 687,
      "content": "NTA, leaving her covered in poop for a whole night could have given her a rash—or a UTI if it slid up to her urethra. As a nurse, you’re aware of all these things and trained to prevent them. You did all you could to make sure the worst thing she’d suffer in the morning was a hangover, including sleeping near her so you could be certain she didn’t choke during the night. \n\nI do understand why they think it was inappropriate for you to get so close to her genitals while she was asleep, but it truly sounds like that was your best option. You couldn’t wake her up, you couldn’t leave her like that, and no one else was going to step up to do it. \n\nFrankly I’m disgusted with your friends who were just going to leave her like that—I don’t care if they were pretty drunk as well, unless they were too wrecked to see straight they should have tried to help her. It may be gross, but friends don’t let friends stay covered in shit. \n\nI wish I had some advice for making up with your friend group, but if your wife isn’t going to defend you I think you need to accept that these people aren’t your friends anymore. Hopefully your passed-out friend will accept an explanation and apology so that you don’t have to worry about police as well as losing your group. \n\nThough, I am curious why your wife isn’t backing you. Was she so drunk at the end of the night that she can’t remember you saying your friend needed to be cleaned up, and your wife heading to bed instead of helping?",
      "id": 122,
      "comments": [
        {
          "score": 140,
          "content": "Honestly, this shows that maybe he needs better friends. I know that's way easier said than done, but honestly, I can't ever see my friends talking about filing a police report on me like I'm some sort of rapist. Do they really think that lowly of him, that they think he would purposefully take advantage of her? And how can they be so sure it was sexual for him, are they convinced he has some sort of shit fetish? They're really showing their true colours here. I'm the most surprised about the wife, that's a huge breach of trust and respect on her part.",
          "id": 123,
          "comments": [
            {
              "score": 75,
              "content": "I rarely say this...but OP may need a better wife, too.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "> Frankly I’m disgusted with your friends who were just going to leave her like that—I don’t care if they were pretty drunk as well, unless they were too wrecked to see straight they should have tried to help her. It may be gross, but friends don’t let friends stay covered in shit.\n\nAgreed! I've gotten to the point of not being able to see straight, but the moment someone is injured or needs help, I come to my senses and do my best to help. It doesn't even have to be a friend. Super wasted stranger at a rave needs help? Slightly less wasted me goes in to help.\n\nLeave no friend behind was our party motto. You party together. You take care of each other together. You recover together.\n\nOP, NTA. I'm so upset for you. You did a good thing and I'm sorry to hear people can't get their heads out of their asses to recognize that.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 624,
      "content": "> Next morning everyone wakes up and comes to see their friend covered in poop. \n\nWTF is the matter with your friends?\n\nI'm going with NTA -- I get the consent argument, but these seem like really weird circumstances. You did what you thought was right. What did your drunk female friend say about the situation though?",
      "id": 126,
      "comments": [
        {
          "score": 265,
          "content": ">I get the consent argument.\n\nI get the consent argument as well, but it doesn't really stand up to scrutiny in my view, especially considering OP is a medical professional. What if OP had instead said \"she probably has alcohol poisoning\" and called an ambulance? It is almost certain the responders, or medical staff of the hospital would have still cleaned her up unconscious or not. In those circumstances, I doubt the friends would have said the responders committed assault. \n\nOP is absolutely NTA, however the friends especially female friends, who at the very least could have observed to ensure that all of OP's contact was strictly necessary to clean up, are all assholes for not helping out and being willing to leave their friend covered in shit.",
          "id": 127,
          "comments": [
            {
              "score": 87,
              "content": "That's a very good point, re: the medical responders. I think sometimes you do have to look at the intentions, and the situation...she wasn't being cleaned up because the OP wanted to get his jollies. The OP saw someone in a humiliating situation and helped. To lump that in with assault seems absolutely wrong.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "To elaborate on the consent piece, one type of consent that medical professionals (especially EMTs) deal with is implied consent. This type of consent states that in a normal circumstance where the individual is conscious, they would agree to whatever procedure is being performed.\n\nOP made two judgment calls - 1: believing that his friend would want to be helped (implied consent) and 2: that as a medical professional, he was able to properly apply his skills.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "So as a medical professional rendering first aid I believe there is also a matter of implied consent.\n\nEDIT: Please read that not as me being a medical professional, but that I believe that medical professionals are legally given the benefit of the doubt when rendering aid to unconscious individuals",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 322,
      "content": "NTA,. I think.  You sound like you were the most qualified, and it probably would have been unhealthy to let her stew in it.  What did the friend say about it?  Did she thank you?  Did she apologize?",
      "id": 131,
      "comments": [
        {
          "score": 287,
          "content": "She was super embarrassed and really didn’t say much.  It seems like she’s getting worse about it the more time that goes on.",
          "id": 132,
          "comments": [
            {
              "score": 333,
              "content": "She shit herself like a baby and you cleaned her up like one.  She should be embarrassed, but she owes you thanks and an apology for making a huge stinky mess on your furniture!  Unless you are actually turned on by shit, I'm sure it wasn't sexual or predatory.  It sounds like your wife is jealous for some reason, and maybe you need to have a serious conversation about that with her.  Ask her if she has a problem with other patients.  Or maybe she feels guilty about abandoning the friend and leaving it to you, but she's taking it out on you.  I can't imagine waking up to the stink of that if you hadn't cleaned it up.",
              "id": 133,
              "comments": [
                {
                  "score": 19,
                  "content": "I wonder if she's jealous because it happened with the newly single friend. I can't believe she's on on the chat and am surprised they added her.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "With time and encouragement she might find anger aimed at you to be easier than embarrassment aimed at herself.\n\nHate to say it buddy but you may want to get in touch with a lawyer to at least hear their opinion and advice.  \nThis sucks and NTA",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "How is she not apologetic? She got LITERAL SHIT on your couch. I cannot imagine doing that and then getting mad. You should be the mad one if anything",
              "id": 136,
              "comments": [
                {
                  "score": 16,
                  "content": "If this happened to me. OP is not getting a simple apology, they're getting a brand new couch and some extra cash for the trouble.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Probably because everyone is talking about it and pressuring her",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She sounds like a weak person. Believe me, she WILL report you. Get a lawyer asap",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Of course she is. Everyone is telling her to be.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I'd even go as far as to say an opposite gender nurse is the better choice compared to a same gender novice.\n\nHave you ever tried wiping the ass of an unconscious body? It's not as easy as wiping your own. They could have dropped her with horrible consequences.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 219,
      "content": "I’m gonna go with ESH. While i understand your good intentions of wanting to take care of your friend, touching someone in a private area whilst they are passed out without their consent is NOT okay. She was obviously vulnerable in that situation and whether or not you are a nurse she did not consent to being cleaned up in that way. \n\nSaying that, your friends and wife also suck for leaving her like that, you all should’ve attempted to wake her up and taken her to the bathroom to assist her in clean herself. \n\nA police report might be a step too far but you cannot blame your friends for being suspicious of your actions as nobody was there to witness what happened. You may only say you cleaned her up but nobody can vouch that it was all you did. \n\nThe woman may feel violated as you did touch her privately without her being aware of it. I would also feel embarrassed and upset. \n\nI’m also a carer and I know the feeling of wanting to help. You just overstepped a huge boundary in this situation. As a nurse you should know ‘confidentiality’ and ‘patient dignity’.",
      "id": 142,
      "comments": [
        {
          "score": 113,
          "content": "Yes, this thought of \"i dont know for sure what happened to my genitals\" would freak me out. I was assaulted when I was asleep by a bf and woke up to it. I still question whether it happened other nights or not. How far could he have gotten other nights? \n\nThen you hear about how in hospitals women are sometimes used as \"pelvic exam practice\" while under anesthesia. \n\nAnd with all the examples of actually passed out/ black out drunk women who are assaulted and sometimes videotaped ect ect... You honestly just never know for sure. \n\nOP was trying to be kind, and I get that, But I also fully understand where the others are coming from. Assaults are so so so common, and this was not a medical setting.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The thing is, if she was that drunk then waking her up wouldn't have helped with the consent issue OR the her remembering what happened the next day issue. If a group of the friends had woken her up and taken her to the bathroom to \"help\" her, at least one person would still have ended up basically doing it for her and she still would have felt violated the next day since drunken consent is not valid and she still would only have her friend's word for what actually happened. Plus I would think the \"too drunk to help\" friends would not be as good at cleaning her up in a respectful, professional way and not touching her genitals in the process.",
          "id": 144,
          "comments": [
            {
              "score": 13,
              "content": "If you think about her waking up cleaned and having her friends tell her “you shit yourself so we took you to the shower and assisted you to clean yourself’ is better than ‘we all went to sleep and OP took it upon himself to remove your underwear while you were unconscious to wipe your asshole himself’. \none sounds better than the other and having all the friends there as witnesses removes the issue of others thinking he sexually assaulted her.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 218,
      "content": "ESH\n\nHonestly I’m torn. On one hand you didn’t mean and harm and was trying to help.\n\nHowever if a friend did that to me, I’d feel so embarrassed and grateful to them that they didn’t let me stay in poop all night. \n\nBut I’d also feel violated a little and creeped out and as well because being that drunk you don’t know what happened. I’m not saying you did anything else, but it’s that worry for me personally\n\nHowever I feel that they are being quite awful by not talking to you about it, and if the couple could get to their room then maybe they should have helped as well. \n\nIt’s a difficult situation",
      "id": 146,
      "comments": [
        {
          "score": 191,
          "content": "[deleted]",
          "id": 147,
          "comments": [
            {
              "score": 198,
              "content": "I'm a little surprised that out of 6 people OP couldn't find one that was sober enough to even stand there and make sure no one was in too vulnerable of a position.  \n\n\nPersonally if I were in the shitter's shoes I'd rather have been hosed off full clothed in the bathtub than have a friend take it upon themselves to wipe my butt, nurse or otherwise. But that's me.",
              "id": 148,
              "comments": [
                {
                  "score": 96,
                  "content": "If I'm faced with a medical situation with a group of close personal friends that includes my wife, the very last thing I'm thinking is that I'm going to get accused of sexual assault. I'm too busy thinking about how to resolve the situation.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Even when you're touching your unconscious female friend's asshole with only a baby wipe between it and your fingers?\n\nI do get what you're saying but I do feel like OP went beyond merely sorting the situation. I believe it was for the right reasons and it was innocent but I also understand why the others are freaked out by it.\n\nI trust my husband 100% but if he did this to my friend with no one else around I would definitely think it was weird and excessive contact.\n\nI've also never been around someone who shit themselves in their sleep though...",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "He said the other people were conscious enough to walk out gagging, saying the night is over, time to go to their rooms!",
                  "id": 151,
                  "comments": [
                    {
                      "score": 77,
                      "content": "Sure but did he actually tell them that he was going to proceed to clean her off before they left? Or did OP decide to do that after no one was around?  \nEither way I don't see why he couldn't have just gotten his wife to be in the same room while it happened.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Same.   I wouldn’t feel good or comfortable knowing a male friend wiped my ass.  I understand it’s my fault and it also should be my choice to have to face the consequences-UTI or rash. Which isn’t life threatening.   I get he was trying to help and watching her and laying her on her side could’ve saved her life (that part).  \n\nIt would’ve been better to place her in a bathtub and soak her to clean.  Less violating feeling.  Then placed on a towel.\n\nHer friends suck though.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 25,
                      "content": "The friends totally suck for not making sure she was okay.  \nMan if she was drunk enough to shit herself though I might have just called an ambulance, that sounds like alcohol poisoning level drunk. OP had also been drinking himself so who said he even would have woken up if she threw up and started asphyxiating in her sleep?",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I commented above that I’ve done exactly that: wash drunky fully dressed. The water wakes them up a little, the clothes get clean enough to go through the laundry, and you don’t have to strip them.",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My husband is a nurse in the ER and he said the same thing, even though he totally gets OP, this is nothing to a nurse, he would have never done it alone, and even then he would have just hosed her off in the bathtub, fully clothed, what he could off, and then wrapped her in a blanket. Since it was in a private setting, he definitely wouldn't have done it without a witness preferably his wife. It's not just for the woman and his wife's peace of mind, it is also to protect OP legally.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": ">I don't understand why he didn't ask anyone, not to help necessarily, but to chaperone. \n\nI can't believe no one else *offered* to help. OP's friends sound terrible.",
              "id": 157,
              "comments": [
                {
                  "score": 20,
                  "content": "> OP's friends sound terrible.\n\nSeeing the text chat I think I am fine in saying they are terrible",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "The other people were conscious enough to walk out of the room gagging, someone definitely could have watched. I personally would NOT be ok with this. Please just let me get a diaper rash and wake up embarrassed that I shit, not embarrassed and horrified that someone was wiping my cheeks in my sleep. The diaper rash and UTI are things that will go away, but knowing one of your friends undressed you while you were passed out will always stay.",
              "id": 159,
              "comments": [
                {
                  "score": 14,
                  "content": "Exactly this. While I see he had good intentions, I wouldn't want anyone to help me. I'd rather just get up and go home and stew in my embarrassment. It would have been different if it was just the skin showing, like the edge of her skirt or shorts or pants, but otherwise, I'd rather people stay away. Male or female, I'd have felt violated. I don't know if I'd have thrown the whole friend away, thankfully I've never been drunk nor do I ever have plans to get just basic drunk let alone blackout. But i think from now on, things need to be talked about, about whether or not he should be doing these things with his friend's permission or if they'd rather he just left them there as it wasn't a medical emergency like people seem to think it was in this thread. A couple hours of her sleeping in it wouldn't have done anything to her except maybe aggravate her skin a bit. A definite hardcore serious conversation from now on is in his best interest.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 132,
          "content": "Yeah this one makes my head hurt. Not that I know anything about this girl's life, but as a rape survivor something like this would set me back by miles. Just the hypothetical thought of one of my male friends stripping me down and wiping my ass while I'm unconscious makes me feel a little sick. The fact that no one else was there makes room for fear of the unknown. He had literally uninhibited access to her body with no witnesses.\n\nNot saying I think OP did anything else besides clean her up, but that is 100% where my brain would go. It would have been so easy to have someone, anyone, stand across the room just to be present.\n\nOh, and I'm also a nurse. If I had a dime for every ass I've wiped in my career I could have retired by 25. I am an ass-wiping pro. It still wouldn't occur to me to strip down a platonic friend and literally wipe them, without anyone else present, at night, while said friend is completely incoherent. And I'm a woman.",
          "id": 161,
          "comments": [
            {
              "score": 36,
              "content": "Yeah I'm finding the \"I'm a nurse\" \"it was autopilot\" comments, as well as his wife's reaction, all a little odd. \n\nI, like many others, have a profession I practise. I don't think I'd ever go into work autopilot when I was smashed, or use that as an excuse for my actions. Most nurses don't practise completely drunk. The ones that do tend to face a Fitness to Practise case! Something about all of this is very odd, like there's missing information or something.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yes. This. Perfect comment thank you for sharing your perspective x I hope you're doing OK right now and taking care of yourself.\n\nI want to add that I once had a rash on my stomach once (just atypical hives in the end) and the doctor had to get a nurse into the room to chaperone while he investigated. That was just my stomach. The doctor only had me remove my t-shirt (I was wearing a bra).\n\nOP is a nurse, so OP knows there are consent and protection rules, for both the professional and the patient. If anything OP should have been more aware of this than the average person. \n\nEven in comments it's like people are saying nurses are immune to criminal intent or actions.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Same.  Also a survivor.   You don’t know peoples’ histories.   While I would likely trust my friend in the realm that this obviously wasn’t sexual, I would still feel as though some form of boundary or consent was violated.  Privacy, my body,  was not respected and even more scary to know I wasn’t awake for it or aware.  It wouldn’t be a good feeling.  The remarks he made about making sure not to actually touch her vagina (meaning fully in view or access, made my eye twitch). \n\nThe poopy situation was not life threatening.  Rather them hose me off or call an ambulance for potential alcohol poisoning at this point since I can’t even be woken up to help clean myself (not that I’ve had this happen but saying in her shoes).  I’ve had friends pass out but can usually wake them by splashing water or get them to stumble to the bathroom.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "I would be grateful that they tried to help, but knowing someone genuinely stuck their hand on my ass and even in my ass crack without even trying to wake me up first.... I don’t know that I’d feel comfortable continuing that friendship.\n\nI’ve been raped before, which is something many of my close friends don’t actually know, and that would have brought back some very serious PTSD for me.\n\nUnless you absolutely know 100% that they are okay with you touching them like that; just don’t do it.\n\nAnd before people bring up him being a nurse: The friendship comes before his employment. He was not checking on a patient, he was helping a friend. While admirable, patients and friends definitely need to be treated differently (unless the friend is asking to be treated as a patient, in which case you then refer them to someone who isn’t their friend; which is what health care experts are instructed to do in many places anyways).",
          "id": 165,
          "comments": [
            {
              "score": 72,
              "content": "I posted a very similar comment. I'm a woman, rape survivor, and RN. I feel it's *because* of my nursing experience that I wouldn't have done this. It sounds like OP had the best intentions, but I would just feel so violated if this happened to me. And I recognize that and therefore wouldn't put someone else in this situation.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I agree, friends and patients are different.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Yea, ESH is my judgement too.\n\nI don't think this was sexual assault at all. I still wouldn't want a friend wiping my butt crack. Ever. I'd much rather deal with the UTI later.. and hell, I would deserve it for getting that drunk.",
          "id": 168,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Ya I think although he did the right thing, I personally wouldn't be able to look him in the eye again - I'd be so embarassed and also creeped out. \n\nIf she was sad about her recent breakup and embarassed about pooping herself, it might be easier to turn to anger, especially if everyone is egging her on.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This. For the record, i think OP's NTA. But as a guy working in childcare, i make sure to have a partner if Im cleaning a childs bottom half, I dont pass it off to a coworker, as I want to prove myself just as capable as my femalw coworkers, but you do have to protect yourself from being misconstrued. It sucks that theres that bias, and i personally think OP was an absolute mensch in what he did.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}