{
  "post content": "I feel like this is entirely ridiculous. I live with my roommate \"Matt\". We used to be pretty close friends, but over the last 2 years of living with him, we've drifted apart, and I'm just waiting for our lease to move out on my own.\n\nMatt's girlfriend \"Sarah\" pretty much lives with us, despite not paying rent. I won't lie, she annoys me to no end. She's an entitled airhead who thinks the world revolves around her. Anyway, Satah has a \"condition\" where she gets nauseous at the slightest smell and sight of certain foods. She's an incredibly picky eater and anything outside of corndogs or chicken tenders make's her nauseous according to her. Well unfortunately for her, I like to cook. I love heavily spiced foods and love to cook Asian-style dishes. So, living with a toddler who can't stand the smell really sucks. \n\nSarah has always complained about me cooking \"smelly\" foods and has asked me to stop or do it when she's \"not home.\" Well, considering she doesn't pay rent and spends 18 hours a day at my home I have not accommodated her at all. Last night, Sarah and Matt sat me down and told me I need to stop cooking because Sarah cannot stand it anymore. Apparently, she had a mental breakdown last week when I was cooking curry. She claims I am making our apartment a \"hostile environment\" by ignoring her concerns. I told both of them to piss off until Sarah starts paying her share of the rent. Matt said that because he lives here his opinion matters as well and he wants me to stop. I told him no to that as well because he's only doing this because Sarah is being a baby.\n\nWe ended up having a massive argument, and neither of them is talking to me both are staying at Sarah's mom's house right now. I say good riddance, at least I did until I told the story to my co-workers and they are all shocked. They say I am being a complete a-hole. This has given me second thoughts on if I was the asshole in the fight we had.",
  "id": 1,
  "comments": [
    {
      "score": 28973,
      "content": "NTA. NTA, NTA, NTA.\n\n>I told both of them to piss off until Sarah starts paying her share of the rent.\n\nThis is the appropriate response. They can find things to do outside of the house as she does not live there. Have you talked to your landlord about the extra \"tenant\"?",
      "id": 2,
      "comments": [
        {
          "score": 5866,
          "content": "did you get a choice when she \"moved in\" or was it like I guess she's just staying here from now on without a word? \n\nEither way I would tell them I'm going to continue to cook my own food and if you have a problem with that I'll bring it up the landlord that you (roomie) brought you're girlfriend in to live with us and doesn't pay rent and seriously if the cooking bothers her she can leave go to another room light a candle, burn some incense. \n\n I'm a picky eater and I love the smell of different types of cooking styles for example I love the smell of mushrooms garlic and onion being sauteed but could never eat it because ew mushrooms.\n\nIt sounds like he moved her in and they are trying to force you out before your agreement is done so they can have the place to themselves\n\nNTA\n\nEdit: I had another thought, her condition? Is she one of those rare people who have a higher sensitivity to scent? And need a basically sterilized room otherwise shes sick all the time? Or is she pregnant and they aren't telling you? Because I was turned off by scents and seeing certain foods when I was pregnant.",
          "id": 3,
          "comments": [
            {
              "score": 2774,
              "content": "The good thing is this disagreement (which OP is 100% NTA) has led to them running out of the apartment for the time being. Which makes it a perfect opportunity to tell the landlord that OP’s roommate is (most likely) violating his lease by having a guest stay for as long as Sarah has.",
              "id": 4,
              "comments": [
                {
                  "score": 1051,
                  "content": "NTA.  I hope OP cooks lots of amazing food (in his own kitchen that he pays for!) and posts it on Facebook and Instagram. His roommates' girlfriend's lack of her own place and his roommate's refusal to take her to a hotel is not his issue.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 347,
                      "content": "Also, how aren't corndogs more sickly than alots of other foods. I've had them one or twice before. Its ok, but yeah, sort of sickly",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 382,
                  "content": "~~I’d be careful with this though, from experience. In a situation like this (at least in my own personal past experience) the landlord can void the *entire* lease for there being an unauthorized guest, whether or not she’s the OP’s guest.~~\n\n~~(Or at least, this is what I was threatened with. It didn’t go anywhere and tbh I don’t know if it was legal or not to threaten that, but just in case it’s good to check the terms of your lease and make sure that you wouldn’t *both* be kicked out if you report your roommate’s behavior.)~~\n\nEdit: it’s super late here and I missed that OP wants to leave anyway. So never mind, and thanks to those who pointed that out!\n\nNTA ofc, and OP I hope this gets resolved soon! Cook all you want in your own home!",
                  "id": 7,
                  "comments": [
                    {
                      "score": 384,
                      "content": "> In a situation like this (at least in my own personal past experience) the landlord can void the entire lease for there being an unauthorized guest, whether or not she’s the OP’s guest.\n\nSeeing as how OP is currently waiting for the lease to run out so that he can leave, this sounds like more of a bonus than a risk.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 246,
                      "content": "OP wants to move out anyways, and if the landlord voids the lease, they can't charge OP for breaking the lease early.\n\nNotifying the landlord is a win/win.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Great. Op want lease to end and move out",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I don’t know where OP is, but I know in Missouri the landlord can double your rent payment for having an unauthorized person (except for children born during the lease) move in, so that’s another potential consequence of the roommate’s actions.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Do be careful.  If you are thrown out for cause, in most states, the landlord is still entitled to the full amount of the lease or until he re-rents the place.  You don't want to be on the hook for that amount.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 114,
                  "content": "[removed]",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I would not take that advice. Depending on where you are and how leases with flatmates work, you might well be kicked out yourself if one of your flatmates violates the lease.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 499,
              "content": "I’d Tell her to go to her own house if she doesn’t like the smell. I’d also tell her to contact the landlord because she’s not a legal tenant and has no rights and in fact if she tries to get added to the lease I’d accept that as my opportunity to be removed from the lease because they can’t just add a new person to a contract without all party’s approval and I’d also contact the landlord and tell them if she wants on, I want off immediately.",
              "id": 15,
              "comments": [
                {
                  "score": 283,
                  "content": "And here I just wanted op to microwave fish at every opportunity",
                  "id": 16,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Ah, the pettiness is STRONG with this O N E!!!! I love it!!!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Oooh microwave some eggs! Start making kimchi!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "mmmm, microwaveable fishsticks.... which I am banned from buying....",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 450,
              "content": "NTA\n\nAnd I would add to Sarah \" and if you can't pay the rent, well how about when I am cooking, those 2 hours ATLEAST you don't stay at the house\"\n\nThis is a hill to die on. You didn't agree to her moving, she isn't paying rent and for your roommate- the party with change in life circumstances needs to find the new house",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 347,
              "content": "I have a **very** sensitive sense of smell/taste. I cannot stand to smell mushrooms, broccoli, etc etc as it's cooking. Sometimes it gets bad enough to make me nauseous. I handle that by leaving the fucking house! \n\nI can't imagine having the kind of audacity required to telling someone they aren't allowed to cook in their own home, even if I were paying to live there! \n\nWhat a ridiculous notion! NTA",
              "id": 21,
              "comments": [
                {
                  "score": 137,
                  "content": "Her “condition” is entitlement. NTA",
                  "id": 22,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It’s likely ARFID. And entitlement.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I was actually thinking autism.. but 🤷‍♀️\n\nAlso I am very sensitive to smells, to the point I use unscented soap, with no masking scents, because that smell is just as bad as the perfume. I would also not tell someone what they could and not cook in a home I wasn't paying for.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "The smell of bacon being cooked makes me violently nauseous. I don't know why, it's just an instant gag.\n\nMy roommate loves bacon.\n\nI just don't leave my room for a few hours when she's cooking it, or I hurry up and leave.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It's fair enough to ask if your room mates cook one food you particularly hate, but it's unfair to demand it. there are plenty of foods I like but would be perfectly happy to not eat if a room mate had a major issue with it. If they happen to love that food and don't want to give it up then it's not remotely rude of them to say sorry but no. \n\nWhen you demand anything you're already wrong, room mate or not, but a non room mate demanding they change their entire diet to suit their own tastes... that's legit crazy.\n\nYOu have a massive issue with cooking smells get your own place and set the rules there.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I'm so sad for you because..... bacon",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I seriously thought I was the only one. People look at me sideways when I tell them this. But yeah... violently ill when I smell bacon cooking. I feel you.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 189,
              "content": "I have a really, really poor sense of smell- like had surgery to try to fix it and my nose type of bad.  I can usually smell things that are really close to my nose, and a bit further away since the surgery.  On the rare days I have, what I assume is, a normal or full sense of smell, absolutely everything makes me nauseous. I can't be around people, foods, flowers, etc. Walking down the shampoo isle is going to make me heave. So  when those times hit, I wear a mask/seclude myself away from triggers. I don't make me problem everyone else's.",
              "id": 29,
              "comments": [
                {
                  "score": 106,
                  "content": "I’m very much like this, but with sound. I’m so used to having about 10% of “normal” hearing that when my ears occasionally clear up (it’s autoimmune) it’s painful and nauseating and anxiety-inducing to be constantly battered with noise. But I don’t expect people to stop talking in public spaces, or my mom to not have the TV on. I wear earplugs or headphones and deal like an adult, or go somewhere quiet for a while if necessary. \n\n(I do really hate all those supposedly heartwarming videos about “toddler gets first cochlear implant” though. Most of the time, what others interpret as a look of wonder and awe on their faces, I interpret as terror and pain.)",
                  "id": 30,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I don’t think I have a super sensitive nose but I just cannot handle some smells. I avoid a certain local favorite swim spot because of the smell. My adult kid asked me not too long ago if he could cook shrimp in my house and my answer was absolutely not. But the difference between that and the OP’s roommate’s GF is that this is my house that I pay the taxes and insurance (mortgage paid off) and I get to make the rules. My kid moved back in due to financial difficulties and I do understand the economy sucks, so I’ve got no problem with him moving back in, but there will be no fish smells in my kitchen. If I’m at somebody else’s house I don’t get to make the rules and either tolerate the smell or leave.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I’ve seen those videos, I know just what you mean and I sympathise with those toddlers and children. When I first got hearing aids (totally deaf from an acoustic neuroma in one ear and fluctuating loss in other from Ménière’s) I had to slowly acclimatise, everything was way too loud for weeks getting used to hearing well again, so many sounds that my brain put as unnecessary information like a clock ticking or how loud paper is to touch were so uncomfortable to listen to, it’s such a strange experience to explain to people that sounds can hurt.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Do you mind sharing what autoimmune condition affects your hearing? I have autoimmune issues and weird one-sided ear problems as well",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm so sorry you are going through that! And I don't blame you! I get overwhelmed going down the aisles with cleaner and laundry detergent because the smell is so over powering. And there's a scent that some people have that still makes me gag like they were steeped in rotten black pepper...",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 173,
              "content": "I told my daughter about this post, and her first question was, \"Is she pregnant?\"\n\nRegardless of the reasoning, you're the AH if you ask someone not to cook food in their own home where you don't live.",
              "id": 35,
              "comments": [
                {
                  "score": 5,
                  "content": "That was my thought too! I developed a bionic nose when pregnant with my first…and it didn’t go away. The big difference is that when I was pregnant, certain smells made me nauseated (to the point that I would actually get sick if I didn’t leave the area)…now I just smell things no one else in the house seems to be able to smell. I do hate the smell of hard boiled eggs, though…but my solution is just to leave the room, not to tell my husband he can’t make them. \n\nOP is NTA here. Even if gf did pay rent, what they’re asking is unreasonable by any semi-normal standard.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My first thought as well.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 131,
              "content": "I’m sensitive to smells, I can smell ramen water from my room with the door closed. Strong smell gives me migraines. Strong food smells I can tolerate while I’m eating it but it bothers me when it’s just sitting there. I remove myself from the area or burn candles. Smells are gonna be everywhere and to ask someone to stop cooking in their own kitchen in an apartment they pay for while I’m squatting is just another level of entitlement. This app surprises me with these stories everyday. OP is definitely NTA.",
              "id": 38,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah I definitely understand the smell thing, scents can be OVERWHELMING to me but you know what, you remove yourself from the area. Especially if it's not your own home! Just go somewhere else!",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "[deleted]",
              "id": 40,
              "comments": [
                {
                  "score": 3,
                  "content": "Even if it *was* her home and she was on the lease and paying rent then I don't think this is something that can be reasonably accommodated. This is an issue that she just needs to deal with if she has roommates. It'd be different if she had an allergy to shellfish or peanuts and he refused to stop cooking something that could cause airborne anaphylaxis, but she just doesn't like the smell of food cooking? Like. Too bad. That's what a kitchen is *for.*",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 97,
              "content": "It sounds like the “condition” might be good old-fashioned racism but I suppose you could give her the benefit of the doubt that maybe it’s an actual, bonafide health condition. \n\nEither way, NTA.",
              "id": 42,
              "comments": [
                {
                  "score": 43,
                  "content": "That's a bit of a stretch dude. I wouldn't call it a \"condition\", but random smells trigger nausea for me on a daily basis. Imo it's related to female hormones. If a get a whif of a strong candle, heavy perfume or basically anything made on the stove the nausea is almost instant",
                  "id": 43,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Regardless - she needs to deal or go. I’m super sensitive to smalls. My partner uses me as a detector because i can always smell when gas is left on or if builders left toxic cleaners and stuff around. Smell is strongest sense for me, hands down. My partner LOVES 3D printing as a hobby. They compromised with me - plant based pla that doesn’t smell quote as bad and it goes right outside to finish the curing and whatnot. They try to time their prints so that I’m out working for the most part and I deal with it otherwise. Comprise is important. \n\nOur roommate and I are not super fond of each other but even he texted and said “hey i know you’re super allergic to bleach. What’s a day next week that you’ll be gone all day so i can clean with it?” Basic. Courtesy!",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I used to work with someone with a condition like that. She tried to have me thrown out of a meeting with a client because my shampoo smelled too strong. She was eventually fired for trying to force a company of 40 people to only use fragrance free personal products. I felt bad for her that she had that condition, but that's no grounds for freaking out because you can smell someone's deodorant (yes this happened).",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "This is a bit different, but a certain sound triggers nausea. You know that growly screaming in death metal or screamo “music”? It can even trigger nausea before I actually hear it. The problem is I like pop punk music, and some of the bands I like may scream a bit, even just a word, so I can’t listen to those songs. It’s like the sound shoots up my nerves or something. I don’t know, but my kids laugh at me about it. Maybe a form of misophonia.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "not really. she says she has a problem with all foods that aren't corn dogs and chicken tenders bc asian and spiced food is 'smelly'? yet formed/fried chicken products are incredibly smelly to me. a combination of grease, carcass, animal fat that pervades a room well after the actual food is gone.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Also. I have a wax warmer. My apartment is small enough that my wax warmer makes the whole place smell wonderful when my trash can makes it smell like rotting skunk ass in here. \n\nShit is a wonder.",
              "id": 48,
              "comments": [
                {
                  "score": 52,
                  "content": "Why wouldn't you just take your trash outside to the can? Covering up the smell means you're still breathing rotting skunk ass bacteria, you just can't smell it.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Not the original commenter, but personally, my garbage starts to smell after a day and it’s only like an eighth full. Im not going to take out the trash every other day, especially since my town makes everyone pay for town trash bags.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Maybe they were being hyperbolic?",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Rotting smells generally come from gases the bacteria produce, it's unlikely that bacteria themselves are in the air unless some weird aerosolization event happened in the trashcan.\n\nIt's a good idea to take out your trash regularly but if you have a sharp sense of smell you might start noticing before your trash is anywhere near full.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 735,
          "content": "*Sarah has always complained about me cooking \"smelly\" foods and has asked me to stop or do it when she's \"not home.\"*\n\nI think another appropriate response would have been “Sarah…you’re not home. You’re actually in *my* home. You can go your home and be free of my aromatic meals whenever you wish.”",
          "id": 53,
          "comments": [
            {
              "score": 112,
              "content": "This is the other appropriate response. The best one imo",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "R/ technically the truth. You are cooking when she's not home! You have never once cooked in HER home ever.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "\"Good news! You don't live here!\"",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 690,
          "content": "I'd double down on the petty and just cook the trigger foods every damn day until she pays rent or leaves for good. What an insufferable couple to have to live with. NTA.",
          "id": 57,
          "comments": [
            {
              "score": 493,
              "content": "I mean the kitchen is a common area, even if she pays rent, why stop? OP is entitled to use the common area as much as anyone else. Whether she gets nauseous or not as long as OP isn’t roasting chilies 24/7 they can cook whatever they want.",
              "id": 58,
              "comments": [
                {
                  "score": 257,
                  "content": "Thank you!!!! I had to come way too far for this. This is NOT a \"reasonable accommodation\" even if she has a legitimate disability. A paying roommate does not deserve this accommodation.\n\nI've had nasty morning sickness where smells *will* make me vomit and I avoided the kitchen when it was an issue and at one point was wearing a face mask.\n\nBecause I'm not going to ask my kids to accomodate my stomach's insane whims - they gotta eat. \n\nOp gotta eat.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Same here.   When I was pregnant, I couldn't stand the smell or taste of pork in any form.  I had to stop cooking it for the family, but I just went to another room when they were eating/cooking it.   My then hubby was ready to ban pork from the house, but it was my problem, not theirs.  OP is NTA.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "My dad can't handle the smell of cheese, it makes him vomit - so we have cheese when he's not home, only eat/cook with it in the kitchen when he's not using it and open the windows afterwards or eat it in our rooms. \nIf we want cheese at mealtime and he's home, we'll reserve that for days we can eat outside and sit him so the wind goes away from him or keep the windows open and have him sit at the other end of the table with a mask (but we rarely do the latter because it feels mean). \n\nThat's reasonable accommodations for our family: we can eat the food he cannot smell, but take measures to make sure it doesn't make meals unbearable for him because family meals are no fun when one person has to throw up. \nIn turn, he'll offer to eat or cook later when we want cheese sometimes, we offer to eat cheese later when he's in the kitchen, he does a majority of the cooking and is a great cook so it's not much of a loss. \n\nWe were never banned from eating or making any foods in the kitchen, but do give a heads up so he knows when to avoid the kitchen. Something like that could work for OP too: have cooking time for both, some time between/gf goes first so they have time to air out the smell, and make sure to keep doors closed.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "Yeah, if it were one thing she couldn't stand the smell of (like say fish) then it would be kind to not make the thing when she was around and it wouldn't be an onerous ask. Telling him to not make anything but chicken nuggets is outside of reasonable and is absolutely a her problem, not an op problem.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Don't forget the corndogs",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "Yeah I keep saying this - \n\nIt doesn't matter whether Sarah pays rent or not.\n\nIt doesn't matter if she has a condition/disability or not.\n\nAll of that is totally irrelevant.\n\nWhat matters is that it's OP's home, HE pays his share of rent which entitles him to use his kitchen to cook whatever he wants, whenever he wants.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yep, unless he and the other roommates came to a specific agreement beforehand about what can/can’t be cooked there. Sometimes people sign up to vegan houseshares etc.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Absolutely! My flatmate has OCD and one of her obsessions is about nuts so she can’t eat or even be around nut products. The only thing she asks is that if I’m using peanut butter / pesto that I don’t leave my dirty dishes lying around cos it means she can’t use the kitchen - and that’s like, reasonable flatmate behaviour anyway to not leave out dirty dishes so I don’t mind at all. She would NEVER EVER tell me I couldn’t eat or cook certain things in my own home!",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yes exactly! To me it's a moot point whether or not she pays rent; what matters is if they asked OP if she could move into his apartment considering she would need him to basically stop cooking anything. Of course they didn't, because they knew he would never agree to it. So they just tried to force it on him which they have no right to do.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "\"Apparently, she had a mental breakdown last week when I was cooking curry.\"  Really, you can't make up this s**t!  NTA by a long-shot.",
              "id": 68,
              "comments": [
                {
                  "score": 70,
                  "content": "Make more curry dishes",
                  "id": 69,
                  "comments": [
                    {
                      "score": 41,
                      "content": "YES!  If OP makes curry dishes every night, those two will move out and, problem solved.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Mmm maybe a nice fish and kidney curry.  OK I just grossed myself out.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "I have a coworker who doesn't like the smell of curry (which, like, how is that possible?) but I still reheated my chicken korma in the shared microwave and she just dealt with it. I didn't complain (well...much) when she reheated broccoli and everyone knows reheated broccoli smells like hot garbage.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I hate the smell of curry too so I get it. As for everything else though she’s being redic. I wouldn’t even ask my own roommate to stop cooking curry as it’s their house too and that shit is temporary.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Mmm chicken korma. But I'm glad your coworker was mature.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "That's maturity.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I did not know this about broccoli, but I have a very poor sense of smell.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 149,
              "content": "> ntil she pays rent or leaves for good\n\nOP mentioned Sarah's there 18 hours a day. That means she has no job. I can't see her paying or moving out (unless she moves back in with mommy). OP should ignore them. Maybe Matt will move out (taking GF with him) and OP can get a decent roommate.",
              "id": 77,
              "comments": [
                {
                  "score": 53,
                  "content": "And apparently no apartment as they are staying at her mom’s",
                  "id": 78,
                  "comments": [
                    {
                      "score": 85,
                      "content": "Not OP's problem! Sarah's mommy can cook her chicken tendies.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Eh, I’m at my house roughly 22 hours a day, but most days I spend eight of those working from home.",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I'd microwave fish every time she walked in the door.",
              "id": 81,
              "comments": [
                {
                  "score": 24,
                  "content": "Ha! The office kitchen cardinal sin.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 12,
                      "content": "That and burned popcorn",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I’m thinking broccoli or brussels sprouts.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Double whammy, you can then fart in their general direction. Get them twice!",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Not the little green balls of death!",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Hello Geneva Convention?  We have a situation.",
                  "id": 87,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I respect your evil!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "You monster!",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "# you monster!\n\ncorrect answer    \nbut monster",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "Why does everyone want these infuriating, dictatorial moochers to pay rent?\n\nNO! Just GTFO! They're at Sarah's mother's. Ooh, boo-hoo! OP's supposed to feel bad? Why?",
              "id": 91,
              "comments": [
                {
                  "score": 20,
                  "content": "I'm not really advocating that she stay, but she certainly doesn't get a say in anything if she's not paying rent. Shouldn't even matter if she's not on the lease.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 44,
                      "content": "It just boggles my mind that everyone always says \"pay rent\". That's suddenly gonna make insufferable behaviour more acceptable? It doesn't. \n\nMy daughter was trying to gently break it to her roomie she wasn't gonna renew the lease after 3 years. She was building a house, ffs. Roomie turned her dogs loose on me in the back yard. One of them bit me. \n\nI was back the next month helping daughter move. DD was no longer concerned about her friend's feelings, or making nice.",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "\"This person fucking sucks, let's have them over more and give them legal protections.\"",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Only exception to this would be an extreme allergy. I had a college roommate with a severe peanut allergy and did not bring anything with peanuts into our room. No one asked me if that was going to be a problem for me before making the room assignments, but it was obviously the right thing to do.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "I wouldn’t even stop if she *was* paying rent. People should be allowed to cook whatever they want in their own house.",
          "id": 96,
          "comments": [
            {
              "score": 5,
              "content": "Exactly. This isn't even a reasonable accomodation for a bona fide lease holding paying roommate",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "I would also have added in a little “I do cook these food when your not home, since you don’t pay rent this isn’t your home there for……your not home 😁”",
          "id": 98,
          "comments": [
            {
              "score": 23,
              "content": "Lol, \"sure thing, go home and I won't be cooking there\" 😁",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "\"Cook when she's not home\" \nYou're here, so that means you're not home. Time to cook.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "NTA.\n\nLots of apartment leases have maximum guest stay clauses.  Might be worth looking into.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I was about to ask about what defined \"smelly\" food. Curry!? Really? It's not as if you put her life in danger with some sort of allergy. That said, it might be a good idea to know how long she's been complaining. If it was very recent, she may be pregnant or something. But if it was for those two years, no dice for them.\n\nNTA.\n\nAs above, might want to talk to your landlord about the extra tenant. Just before your lease expires.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "NTA.  It’s really almost laughable that they expect you - a grown ass human being  - to live on corndogs & chicken tenders.  \n\nI don’t even think your legitimate roommate has thought this thru.  Does he never walk thru a mall food court with her?  Does he never go out go eat with family or friends with her?  Does he want to be barred from doing these things for life just to be by her side?  Does he want to eat only corndogs & chicken tenders for the rest of his life?  Does he want to eventually procreate with this women & have his children be able to only eat corndogs & chicken tenders?  \n\nThis woman needs to grow the F up.  It’s your residence - not hers.  She’s merely a squatter who is tolerated.  And she wouldn’t even be that if you reported her undocumented tenancy to the landlord.  They need to leave you the F alone to eat like a normal person.",
          "id": 103,
          "comments": [
            {
              "score": 3,
              "content": "Plus roomie will be responsible for all her medical bills associates with such an awful diet. And feeding kids only that could be considered abuse. Not that she will likely want to have kids. If she melts down that much over curry, imagine her reaction at a diaper blowout.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">NTA. NTA, NTA, NTA.\n\nNTA. NTA, NTA, NTA.\n\nBatman",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6957,
      "content": "NTA, not even a little bit. What the hell? You're absolutely right, good riddance. You live there, you pay rent, you can cook whatever you want. She can find another place to live.",
      "id": 106,
      "comments": [
        {
          "score": 1316,
          "content": "Right? I once dated a guy and kind of spent a lot of time with him at his place. Basically moved in but wasn’t paying rent either… I was so embarrassed about that that I could never even fathom overstepping my boundaries like this lady did. I genuinely don’t understand the mindset here.",
          "id": 107,
          "comments": [
            {
              "score": 340,
              "content": "Oh it's amazing. She gets to make rules for the apt and saves money of not paying rent",
              "id": 108,
              "comments": [
                {
                  "score": 152,
                  "content": "She's also home 18 hours a day to try and \"enforce\" those rules; she sounds like an absolute joy to live with.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 24,
                      "content": "[deleted]",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I know.  I’d tell her, “well, when are you ever at home?  You are always here, and you don’t pay rent and aren’t on the lease and therefore do not live here, so this isn’t your home.  Feel free to go home!”",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 175,
              "content": "This couple sounds truly entitled. When my then-fiancé was in college he lived in sort of a boarding house, a family of 4 rented out their 5 extra bedrooms to the university students. I spent most weekends there but I put myself on the chore list without being asked, cooked and baked for everyone, and bought groceries to replace what I ate from the community food (milk, bread, butter, etc). Because I was grateful and not a mooch!",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "My best friend, rented a room in his house out to his brother. \n\nHis brother decided that his girlfriend could live there as well. Not a problem. Didn't even ask her to pay a portion of the rent. It's a whole house, lots of space. But then they made a request for the master bedroom....since he's single and they are a couple. \n\nNo.",
              "id": 113,
              "comments": [
                {
                  "score": 59,
                  "content": "Where in their minds is that ok??? Like what did the conversation sound like between the couple, “hey, we deserve the biggest bedroom because we fuck, right honey?”\n\n“Yep sounds like solid logic to me!”",
                  "id": 114,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Exactly! \"Playing house\" is not the same thing as actually being married, no less actually owning a house. Just because you bump uglies doesn't mean you get to dictate terms to others in the house.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It’s the same kind of logic my tiny dog uses to claim the entire bed!  Mommy, I chew my chewies here in the soft sheets so you can’t get in the bed with me without my permission!\n\nFortunately he’s less than ten pounds and can’t really enforce that on me!!!!! Plus he’d be even more annoyed if I wasn’t there!  He wants me in the bed but clinging to the edge while he takes up the rest!\n\nCute, though annoying, in dogs.  Infuriating in humans!",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "\"Sure, as soon as you start paying 2/3 of my taxes, utilities and mortgage payment!\" 😆",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I would have cordially invited my brother and his girlfriend to take possession of the master *shed*, if they wanted more space.",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I think most of us has done this at some point. We stay with a SO a lot but don't technically live there so we are still paying for our own place. It happens but at no point is it ever okay to start laying down rules.",
              "id": 119,
              "comments": [
                {
                  "score": 5,
                  "content": "Yep, I once stayed at my girlfriend’s place for like… a month or two. There’s no way in hell I ever considered laying down rules for her or her roommate because it’s not my place.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I did the same for about three months when I was 19. My boyfriend at the time lived with two other people in a three bedroom house and one of those three owned the home. I was only temporarily between housing as it was the summer and I was in between semesters at college. I certainly wouldn’t say I technically “lived” there, but I did visit a LOT and would occasionally still be there some days after my boyfriend left for work. I *literally* only left my boyfriend’s bedroom to use the bathroom, though. I never used their kitchen or any of their other “common” spaces-mainly because the house was filthy and foul and not a single one of them had the decency to clean up after themselves. I never complained about anything they were doing and *certainly* never made any requests; and I would have never been capable of doing such a thing… because I was not contributing financially or otherwise and legitimately had no place to be making requests. I can’t believe that OP has people telling them that they’re an a-hole for this. Definitely NTA.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "[deleted]",
          "id": 122,
          "comments": [
            {
              "score": 6,
              "content": "Yours is an odd take.\n\nI wouldn't appreciate a roommate who cooks savory foods, because I wouldn't eat it. I wouldn't hassle them for doing it either, though.\n\nIt seems like you believe being a picky eater is a choice. It's not necessarily a choice, no more so than it is a choice to have OCD or depression or allergies. My life would be drastically easier if I could just eat whatever - don't think I haven't tried. Different people just taste differently and the texture and expectations play a part, too.\n\nMy parents forced me to try all sorts of shit and it would make me throw up. My body actively fights it. Yorking it back up once doesn't make it easier to try it a second time, y'know? As a adult, eating something and spewing it back out in a restaurant is probably a mood killer.\n\nMy brothers have a much more varied diet than I do and they grew up in the same environment, as much as me or anyone else would like to just blame my parents.\n\nSame thing happens (vomiting) to one of my kids. My other kids have a much more varied diet. It is absolutely not for a lack of effort.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "> you can cook whatever you want\n\nI'm not ready to go that far, but certainly within reason. If you're cracking open a tin of surströmming that's probably over the line.\n\nNot cooking anything isn't reasonable. If there is something particularly offensive, making cooking the offensive thing everyday may be reasonable accommodation. \n\nNo accommodation is really reasonable here, though; if OP knew this was a restriction, they likely wouldn't be living with Matt.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4018,
      "content": ">Sarah has always complained about me cooking \"smelly\" foods and has asked me to stop or do it when she's \"not home.\" Well, considering she doesn't pay rent and spends 18 hours a day at my home I have not accommodated her at all.\n\nBravo!!!  If it gets her out all the better Wow! She's not paying rent but is making demands?? \n\nNTA.\n\nYou get to use the kitchen you are paying for, you aren't doing anything unreasonable here. End of conversation.",
      "id": 125,
      "comments": [
        {
          "score": 681,
          "content": "NTA.\n\nAnd I’d just like to point out that when she is at your apartment, she is abso “not home”.",
          "id": 126,
          "comments": [
            {
              "score": 104,
              "content": "Spot on. \"You're not home right now whilst standing in my kitchen, so there's no issue.\" I'd follow it up with a more serious offer of them buying my dinner each day from restaurants who cook to my standards. If you don't want to smell me making delicious food, door dash me some delicious food until the lease is up.",
              "id": 127,
              "comments": [
                {
                  "score": 5,
                  "content": "That’s a great response!",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 300,
          "content": "OP is already cooking foods when Sarah is not home. Newsflash Sarah: this apartment/house is not your home. Quit trying to control what a leaseholder does in their own home.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "As it’s likely Sarah will show back up, OP could be generous and gift her a jar of a Vick’s Vapor Rub.  She can put a dab under her nose and she’ll no longer smell his cooking.",
          "id": 130,
          "comments": [
            {
              "score": 100,
              "content": "Or, hear me out, he could spend like 5 hours cooking this Polish hunter stew:\n\nhttps://www.youtube.com/watch?v=Oqg_cO4s8ik\n\nIt's made of pork, bacon, sausage, sauerkraut and like an entire head of fresh cabbage.\n\nIt's DELICIOUS.\n\nBut it will make your entire house stink of cabbage.",
              "id": 131,
              "comments": [
                {
                  "score": 6,
                  "content": "Bigos is the holy grail of all soups! This is a great idea.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Only 5 hour bigos? Why is this recipe cutting corners?",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Another Chef John fan...",
                  "id": 134,
                  "comments": [
                    {
                      "score": 3,
                      "content": "So I really hope you give this a try soon!",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "It's not about whether she is paying rent or not. That's irrelevant.\n\nIt also doesn't matter if she has a condition or disability (even if it's 100% genuine).\n\n>You get to use the kitchen you are paying for, you aren't doing anything unreasonable here. End of conversation.\n\nYes. This is the only thing that is relevant.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "NTA.\n\nI also have very sensitive sense of smell and hate the smell of oil and grease from frying stuff. Even the thought of asking roomates to not do that in a place I pay for makes me cringe, let alone in a place I am essentially staying for free. Time for curry every night! Lay it out for your roommate that she is overstepping her bounds and she has no right to be living there let alone making ridiculous demands. Maybe tell her you'll stop for a fee of whatever her share of rent would be.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2235,
      "content": "NTA. How could you possibly be the asshole? Your coworkers are assholes. Your roommate and his gf are definitely assholes. How the fuck is someone going to ask you to not cook in your own home? If someone asked me that I’d tell them to piss off the same way you did - especially considering one of those people isn’t even a paying tenant!!! \n\nIf you wanted to get real petty and live in an apartment you could tell him you’ll report him as having a guest for too long, most leases don’t allow long-term guests so you could potentially threaten that action if they don’t stop being ridiculous assholes. You’re not breaking any rules, chances are he is with his long-staying gf.",
      "id": 138,
      "comments": [
        {
          "score": 671,
          "content": "He should tell his roommate *\"I pay rent too and I don't like vagrants being invited to live here without consulting me!\"* lol",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 189,
          "content": "I am wondering if he is leaving out some huge detail here that he didn’t leave out when talking to his coworkers. His coworkers have no bias to side with someone they presumably never met.",
          "id": 140,
          "comments": [
            {
              "score": 257,
              "content": "I think he just sounded as much of a A.  H. as he initially does here because he’s so (understandably) frustrated. And he probably acted really gleeful over the two leaving because he had no reason to question it.\n\nWe can read the text and realize OP is 100% NTA and those people deserve to be insulted. His coworkers are listening to him say this (likely with less detail) in a gleefully vindictive tone and got the wrong impression. Delivery can be everything.",
              "id": 141,
              "comments": [
                {
                  "score": 30,
                  "content": "[deleted]",
                  "id": 142,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I don’t think he is either! But it’s clearer in writing why he’s using the language he is. In person it may not have been as clear.",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Maybe some kind of cultural difference too where they don't see her as a third party in the home but rather as living there.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Maybe it's a cultural difference wherein the coworkers don't eat foods similar to those that OP cooks so they were automatically judgemental.\n\nAlso,  I know I'm late to the game,  but 100% NTA. Whatever their reasons,  the coworkers are wrong.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Yep. NTA, OP, but be careful bot to share personal information with co workers, they might just use it against you.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It's possible he presented the situation by going a bit hard on Sarah and Matt (refer to his conceptualization of Sarah as an airhead) which distracted his coworkers from the fundamental issue at hand (which he is NTA). Unfortunately, people's stance is more influenced by body language and vocal theater than rational logic (especially if he is talking to Americans which all datapoints indicate to be so).",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1644,
      "content": "NTA. I had a roommate who loved to cook mushrooms. That (and some fish) and the only 2 things I find repulsive. She never knew this because I never told her. I just went to my room.\n\nWho am I to tell a grown person what to make in their own kitchen? Does it suck? Yes! But I can always open a window in my room and burn some incense, geez!",
      "id": 148,
      "comments": [
        {
          "score": 383,
          "content": "Same. The smell of onions in any form make me nauseous and give me headaches. Back when I lived with roommates,  I would go in my room and close the door if they were cooking involving onions. At the MOST, I would ask if they could open the windows and turn on a fan. ASK. And I paid rent.",
          "id": 149,
          "comments": [
            {
              "score": 52,
              "content": "Same. I hate hate HATE onions, the smell makes me litteraly sick and it was the base of my former roomate's alimentation.\nI would just open a window or go to my room. It was his place too he was allowed to cook whatever he wanted.",
              "id": 150,
              "comments": [
                {
                  "score": 5,
                  "content": "TIL the word \"alimentation,\" thank you",
                  "id": 151,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 170,
          "content": "I hate fish so much. My roommate knew it and planned it around when I wasn’t home as a courtesy. But I never said he couldn’t. \n\nBut I also worked a lot of evenings so he could still make it a fair amount when he wanted too. A good balance.",
          "id": 152,
          "comments": [
            {
              "score": 90,
              "content": "It's almost like being reasonable and communicating works",
              "id": 153,
              "comments": [
                {
                  "score": 23,
                  "content": "You could take that exact statement and apply it to so many conflicts.\n\nUnfortunately most people aren't reasonable and don't know how to communicate.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Crazy right!",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Stop making sense this is Reddit!",
                  "id": 156,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "Had a partner that hated the smell of coffee. Had a housemate who ground and brewed fresh coffee every morning.\n\nIf said partner stayed over they sucked it up, or we went out for breakfast to avoid the kitchen.\n\nNever in a million years would I have asked my housemate who was paying rent to stop.",
          "id": 157,
          "comments": [
            {
              "score": 70,
              "content": "I have serious questions regarding your partner’s sanity… Even people I know who HATE coffee love the smell. I’ve literally never met anyone who disliked it!",
              "id": 158,
              "comments": [
                {
                  "score": 68,
                  "content": "I used to love the smell, but then I worked the morning shift at McDonald's for 3 years and now I associate the smell of coffee with the stress of that job and I get nauseous.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I'm allergic to coffee, and unless it's brewed in a ventillated area, it can still (after over 20 years) make me instantly ill. 🙃",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I dislike, even hated it in the past but because of my own experience. When I was a kid my parents and I would drive for long hours in the car. I was, and still am, terrible travel sick (no medication works for me). Mom would pure dad fresh coffee and the entire car would smell after coffee. I was already vomiting and nauseous because of the driving and would connect this with the smell of coffee. So for me it was smelling coffee = nauseous. Also she for perfumed baby wipes. Mom would give me those to whip my face after I vomited, same connection. Still can't stand that smell.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I feel very similar about a particular type of sweet. Ate a lot once as a child right before I was sick with some sort of vomiting bug.\n\nStill associate those sweets will feeling ill and can’t eat them.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I love coffee and make my own lattes every day at home, however I absolutely hate the smell of vending machine coffee that uses Pelican Rouge beans. I also hate the smell of Starbucks coffee and beans, something about them just isn't right. Oh, I also can't stand the smell of Juhla Mokka filter coffee (famous here in Finland), especially if the filter hasn't been rinsed and the paper smell seeps into the coffee. Gotta add instant coffee to the list as well, that shit is rank!",
                  "id": 163,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "For some reason when I smell coffee I smell cigarettes instead. All I do is check that it’s really coffee and remind myself it’s ok as needed.\n\nI used to have the normal “mmm” reaction to smelling coffee (even though I dislike the taste) , and still like the coffee aisle at stores, but I think I’ve had the coffee/cigarette thing for at least 15 years now.",
                  "id": 164,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Grown-up solutiion!\n\nReminds me 'though that I barf nearly every time I smell any kind of incense, so if I were there, I'd encourage you to keep those windows open!",
          "id": 165,
          "comments": [
            {
              "score": 6,
              "content": "Incense triggers my migraines, so I ask people to please not burn it around me. But food is an necessity so it is not okay to tell someone to stop making it, especially when you are in their house. \nIt wouldn't even cross my mind, the only time I did that was at work when I was pregnant and people were making grilled cheese sandwiches in the room I was working in, but I didn't tell them they couldn't make them, I just asked if they could do it in another room bc the smell made me literally sick.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "With you 100% on the mushroom smell, it makes me gag and always has done.\n\nSince my wife loves mushrooms, I'll occasionally sautee them with olive oil and TONS of fresh garlic. She loves garlic, it covers the smell enough to not trigger any response from me, and I'm the hero husband for cooking her a special treat. Win win situation.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Exactly the right response.\n\nOP could shut the kitchen door and open the window turn in the extractor fan when they cook if they're conscious of strong smells. \n\nBut outside of that.... Get fucked.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1020,
      "content": "NTA, up your game and look up how to ferment kimchi.",
      "id": 169,
      "comments": [
        {
          "score": 393,
          "content": "Crack open a durian for dessert",
          "id": 170,
          "comments": [
            {
              "score": 141,
              "content": "Don’t forget the fermented shrimp paste!",
              "id": 171,
              "comments": [
                {
                  "score": 7,
                  "content": "Greetings from Sweden - I raise you a can of fermented herring!  The problem is that you might have to evaluate the whole building for a few days since this should not be eaten indoors 🤢 (if at all!😱)",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "As an Asian living in Asia not one of these smells are extreme to me. Heh.",
                  "id": 173,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "It's not that smelly when it's just sitting in a jar in the fridge. Only smells when you put it in the pan.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 3,
                      "content": "or in the curtain rods",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Boil cabbage and sauerkraut and Brussels sprouts all day, just for fun",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Also start indulging in fresh durians.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "[removed]",
          "id": 178,
          "comments": [
            {
              "score": 16,
              "content": "Absolutely.\n\nI've lived with a particularly quirky relative before: you think people who wrap all their belongings in things are just parody, but this relative is one of those. She lays towels on the stairs, layers rugs all over her carpets to protect them, keeps a large piece of foil by the stove, designated for shielding the rest of her kitchen from oil splatter. Every large room has an enormous framed portrait of her late husband displayed prominently. Did I ever complain? Nope, never. It's her house and her lifestyle, I'm just a guest.\n\nMy one thing was I didn't want to sleep on a couch with her husband looming over me, but she has enough guest rooms that it didn't need to be mentioned. And I still didn't complain about the odd times I did wind up doing it.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "If he wants them to run to the door asap, he should just get one of theese [Surströmming](https://hogtider.files.wordpress.com/2020/06/serving_surstrc3b6mming.jpg)",
          "id": 180,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Nah - sauerkraut - it ferments longer and is stinkier.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 513,
      "content": "NTA sarah can pay rent when you leave. Good luck and sounds like you know good food.",
      "id": 182,
      "comments": [
        {
          "score": 5,
          "content": "If they have a problem with it. Report it to the landlord that they have a guest who is not on the lease staying for an extended period of time.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 459,
      "content": "NTA, You pay rent and that includes use of the kitchen. You didn't agree to live with Sarah.",
      "id": 184,
      "comments": [
        {
          "score": 41,
          "content": "Exactly. Sarah is not a tenant. She is a freeloader. If she doesn't like what one of the actual persons living in the house cooks/eats, then she can/should leave.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This. You signed up for one roommate not two. If they paid 2/3 rent, you could eat out a bit more. Did they think of that?",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 397,
      "content": "NTA Sarah can fuck right off. And this is coming from a ***very***  picky eater who desperately wishes she wasn’t one. I know I’m missing out and I would never act like this.   \nThe nerve of someone who is a guest. I can’t t even imagine",
      "id": 187,
      "comments": [
        {
          "score": 120,
          "content": "if she only eats two certain meals then that's not being a picky eater, that's an eating disorder. but it's still her job to handle her own issues. so if she doesn't like it then maybe her bf should go to her actual home.",
          "id": 188,
          "comments": [
            {
              "score": 64,
              "content": "Yes, it sounds like ARFID. Which would still not give her the right to demand other people heavily restrict their own foods.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 346,
      "content": "NTA Sarah lives elsewhere and if your cooking makes her nauseous, she can go back to her residence. But also, her condition is hers to manage - even if she were paying rent - it’s her responsibility to avoid the kitchen, not yours to stop cooking.",
      "id": 190,
      "comments": [],
      "relation": "Support"
    }
  ]
}