{
  "post content": "My SIL (married to my brother) is a resident physician who works 60-80hr weeks and frequently works 1 or both days of the weekend. Her residency is a 7hr drive from where me, my husband and my baby girl (1.5yr old).\n\nMy brother and I were always very close growing up and even lived in the same apartment and later same city. We were never more than 20-30m away from each other. I got married and had my baby and he moved 7hrs away to be with his fiance, now wife, pretty soon after I had my baby. It was devastating for me as I had always pictured us being close and him really involved as an uncle. SIL works 6am-5:30pm 6-7 days a week but does have some \"golden weekends\" where she has Saturday and Sunday off. She usually has one per month and then she has 3 weeks of vacation (never over Christmas or New Years holidays).\n\nDuring those 1 weekend a month that she has completely off, her and my brother either stay at home because she needs to relax or will drive 2hrs to see her family. During the 3 weeks of vacation, which she is only able to take 1 week at a time, they went on a 1 week long trip to Hawaii, a 1 week long trip to Cancun with her family and then 1 week where they just visited her family 2 hrs away. They haven't made the trip to visit us more than 1-2x a year as they say the drive is too hard with the limited time off she has and she's usually too tired to come anyways. But not too tired for Hawaii or Cancun?\n\nThey always ask my parents and us to visit them during holidays she works so at least we can be together and she will join everyday after 5. But, it's hard for us to travel with a 1.5 year old. My parents have to split time visiting there and visiting us and we need them for childcare. I've been asking my brother and SIL to visit us more even though I know her schedule is busy and my brother got frustrated with me. When I asked him to visit alone, he said she needs him because the heavy workload has been really mentally straining on her and quoted how resident physicians have a really high depression rate and basically called me TA.\n\nI feel its unfair we have to visit all the time considering we have a 1 year old  and also both work FULL TIME and feel they should balance better to visit us rather than just vacation. AITA for insisting?",
  "id": 1,
  "comments": [
    {
      "score": 45121,
      "content": "YTA. You don't have to travel to them if it's too hard for you, but you come across as really judgmental and lacking in compassion for how they choose to spend their limited free time. Asking them to travel 7 hours each way for a visit on the rare Sat+Sun she has off is unreasonable - that would be 14 hours of driving for probably not even 24 hours of time together including sleep hours. You say they do make the trip about twice a year, and that seems reasonable given these circumstances.",
      "id": 2,
      "comments": [
        {
          "score": 16571,
          "content": "Can I just say, that as someone who went through a miserable residency, I was instantly protective of the SIL upon reading this post.  I have been in similar shoes, and they are painful to wear.  To have a family member demand my time like this, when I was drowning in work, would have felt like someone peeling off my already sunburnt skin.  Excruciating.  \n\nI was pleasantly surprised to see how many redditors empathize with the resident’s experience.  I know SIL likely won’t ever see this, but this mildly traumatized former resident (it can be so much better on the other side!) is vicariously grateful for the kindness.",
          "id": 3,
          "comments": [
            {
              "score": 6257,
              "content": "I'm protective of the SIL and I'm NOT a resident, or in any medical field. OP is an AH for trying to dictate how they spend their time. Period.",
              "id": 4,
              "comments": [
                {
                  "score": 3693,
                  "content": "Also upset their parents cant be there to baby sit. Get a damn sitter! Geez. Bet she doesnt even compensate them for their time.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2146,
                      "content": "Yeah, that jumped out at me. Poor OP is missing out on free childcare because SIL won't travel 7 hours on her one 2-day weekend a month.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 979,
                      "content": "Lol when OP said that she thought her brother would be an involved uncle with how close he is ngl I immediately went, “oh so she assumed that he would be free childcare whenever she needed”.\n\nThen when she made that comment about the parents it solidified that thought.\n\nSIL and brother dodged a bullet.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 559,
                      "content": "\"we need them for childcare\"... GTFO with that shit...",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 515,
                      "content": "That and the \"not too tired for cancun or Hawaï?\"\nI mean, who is too tired for Hawaï ?",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 258,
                      "content": "That's my favorite line of the entire whine-fest. OP you are such an AH.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 244,
                      "content": "This!! Imagine begrudging your parents spending time with their son and daughter in law because it means you’re deprived of your free babysitter?!?",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "OP couldn’t care less about SIL visits. I think the main issue here is their free babysitters travel too often and that’s just not fairrrrr",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yeah for real. \nI kind of get the feeling that OP is mostly annoyed about SIL not visiting all the time... because it means that her parents are leaving town to go visit SIL and brother regularly, leaving OP without the childcare that she feels entitled to.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "The grandparents babysitting really nailed it for me",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I too was on SiL’s side and actually rolled my eyes at the “need parents for childcare” comment.\n\nOP - YTA a very entitled A H.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 422,
                  "content": "Same. My medical background is I've watched Scrubs a whole bunch of times and several seasons of Grey's Anatomy, and I am ready to throw down on behalf of SIL.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 253,
                      "content": "I too have a TV degree in criminology as well as crime scene investigation skills. I will help you clean up the evidence and never get caught.\n\nYta op, so. So bad.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 88,
                  "content": "Me too, goodness. And I definitely agree with you, OP is definitely TA for trying to tell them how to spend their time. From what I understand, residency is brutal. Very demanding, and exhausting. I’m sure the SIL cherishes her time off!  And I’m sure driving 7 hours on her limited time off sounds miserable for her",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My family isn't close like this, so maybe I don't get that side of it, but they are adults and owe OP nothing. The SIL is a new doctor for crying out loud! Doctors have crazy hours unless they are in private practice amd even then, they often cover referrals at hospitals; and people like to say some jobs aren't life or death, but hers often is! In a world with Skype, facetime, duo, discord, teams, zoom, and I'm sure a metric crap-ton more apps that allow video chat; you can have dinner together in the comfort of your own homes. It's what my now husband and I did while dating (I was in California and he lived in Ontario).",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I agree. I’m not on the medical field. But I still have a high paced career. The last thing I want to do with what little free time I have, is spend it with entitled family members who think they should dictate how I spend my time.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "OP sounds exhausting, as is anyone who doesn’t realize that “no” is a complete answer. I’m guessing “to be with fiancée” isn’t the only reason the brother moved far away. (Just a guess.)",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "And she’s an AH for thinking a 14 hour round trip drive to be around a toddler and in-laws wouldn’t somehow compare for an overworked resident to a week off in Hawaii. I love my family, and visit them, but that is NOT a vacation. when I need a vacation, I’m not spending it with someone else’s toddler, no matter how much I love them.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I'm protective of SIL and I'm not a resident either OR American (assumption based on the 'golden weekends' thing and driving 7 hours and, again assuming, still being in the same country, but happy to be corrected lol).That poor woman lol. \n\nThe last thing she's going to want to do on her one weekend off a month is drive 14+ hours to be there for less than a day while her husband babysits someone else's kid. Lol.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Same",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I’m not in the medical field and reading this had my shoulders up around my neck.\n\nAs well as being totally selfish and unreasonable about her SIL’s failure to give up her precious time off to pay homage to OP in her home, OP is also seemingly resentful that her brother has a life of his own and didn’t fall in with her plans for him to live close to her and care for her children.\n\nOP you don’t seem to understand that they are ADULTS with LIVES OF THEIR OWN. You have no power here and YOU’RE NOT IN A POSITION TO INSIST ON ANYTH WHERE THEY’RE CONCERNED.\n\nYTA",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 472,
              "content": "congrats on making it to the other side. noone but you who have been through it can really understand. luckily my husband and i's families both live in the same city and both sides of our family schedule holidays around his schedule even now. thanksgiving on friday because husband works thursday? cool we're all in.",
              "id": 26,
              "comments": [
                {
                  "score": 248,
                  "content": "Am a nurse, so definitely not the same experience re: workload and stuff. But, this is how my family tries to do it too. Of course, I don't expect them to accommodate me at all, but it's always nice to be told \"we'll do X holiday on Y day so you can be there.\"",
                  "id": 27,
                  "comments": [
                    {
                      "score": 103,
                      "content": "My husband is in EM so we know he’ll work a lot of holidays and either thanksgiving or Mexican Christmas (Christmas Eve) every year. So it’s just going to be family tradition to move stuff around. Glad your family makes concessions too it can be an isolating life style.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "YTA\n\nI was not a nurse, but a resident aide for people with traumatic brain injuries for 18 years. \n\nAs anyone in health care knows, hospitals, nursing homes, (some) med centers, adult foster care homes, etc, are open 24/7. They don't close for weekends or holidays.  \n\nWhich means if you work in health care you are LUCKY if you work somewhere where you have even every other weekend off. I was lucky enough to have every other weekend off. A lot of health care workers only get a weekend off a month or less sometimes. \n\nMy family was kind enough to plan holiday parties around the holidays I had to work and make sure it was on a weekend I was already off. \n\nOP is being straight up RIDICULOUS and SELFISH in regards to how someone else wants to spend the very small amount of free time they have. \n\nAlso, traveling with a toddler isn't that damn hard. Most babies sleep a lot in the car anyway. She needs to quit BEING a baby, and pack her baby up and drive the 14 hour round trip if she wants to see her brother that bad. \n\nAlso, it probably wouldn't hurt for her brother to have a serious talk with OP about who the main woman in his life is. OP may be surprised to find out that it is not her.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "There were many years growing up as a nurse's brat where we had Christmas either early or a week after.   It's how life just is when you're somehow associated in the health care industry.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "My dad, brother, and two uncles were all doctors. Holidays were always a crapshoot!  If we celebrated on the actual day, great. If not, everybody adjusted. One year when my mom was recovering from surgery and we had people coming from out of state because they wanted to see her before she passed, we actually had thanksgiving dinner two days in a row to accommodate everyone’s schedule. Me, my sister, SIL, and one aunt did all the cooking - two completely separate menus, two different dinners, and everyone came when they could. It was crazy, but everyone got to see my mom, and my 3mo baby.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 446,
              "content": "Complete non-sequitur but \"I have been in similar shoes, and they are painful to wear\" is such an incredible line. More poetic than it has any business being. \n\nAlso I'm glad you survived, I have a friend about to start their residency pretty soon and am resolving to check on them as often as I can, from the looks of things it gets really rough.",
              "id": 32,
              "comments": [
                {
                  "score": 136,
                  "content": "Please check in on your friend often. I’ve worked in health for 13 years. The residents appreciate when you do ask, because no one ever does.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "Please do: that's kind of you to be concerned. \n\nThe hours and stress are unbelievable. Don't forget about your friend after the first month or two. Even a text or a call, or an offer to drop by with some food that isn't hospital food is very welcome. If they fall asleep on you, just take their shoes off, roll them onto their side and let yourself out quietly.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "I did laundry and fixed extra meals for my friends going through residency.   I would not have known how bad it was unless a family friend had gone through and I had seen it first hand.   Even as a teenager I could see the pure exhaustion (mental, emotional and physical).  Nurses too.  Actually everyone in the medical field deals with all kinds of people in their worst moments of their lives.   You should be going out there helping your brother support his wife.  And yes, she probably chooses to see her family over his.  Because, probably gets pampered.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Your friend will love your support...its the little things that get u thru residency",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Also: continue checking in on them \"hey! Just thinking of you and hope this rotation is going well!\" Even if they don't reply.....they're swamped trying to learn all they can and earn respect of senior residents and [often asshole] attendings....they do get time to poop, but are probably doing a search or sending a million texts about patients so they might forget the less urgent messages (note: not less important). If you can, keep telling them you wish well for them.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 438,
              "content": "Agree. It was always frustrating to hear family whine why we never visited them when we were in a 6 year surgery fellowship and basically in survival mode the whole time. I was lucky if I saw my husband awake more than 1 hr a day! It gets better, but I'd never like to relive residency please.",
              "id": 38,
              "comments": [
                {
                  "score": 38,
                  "content": "Can I just say that I think you're both insane and insanely strong to have made it through that? I just matched FM (which I am honestly insanely happy about) and I'm already dreading 3 years of 80 hour weeks on paper (open ICU + unopposed program means its likely I'll get a decent chunk of unscheduled 'off hours' in the hospital). Everything I've ever experienced about surgery makes me think 6 years would literally kill me. We need advanced surgeons, and I'm grateful people like you exist, but I can't really wrap my head around that level of fortitude.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Congratulations on matching!!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "When my husband was a resident, I used to visit him to watch him sleep. Luckily that was years ago. There is no way I would expect anyone to do something like OP. My parents live a plane flight away and I still only see them 2x a year. YTA OP.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "6 years?? Wow, I’m so happy for you that you are the other side of it!",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Amen, sister!  I remember bargaining with God while driving after particularly bad trauma calls and hoping that I didn’t become a trauma patient myself. I would literally fall asleep at red lights. Stupid.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 302,
              "content": "My partner is just finishing his residency and for the first two years I feel like I barely had time with him and we lived together. He worked long hours and just about everyday at one point and I'm aware that his specialty isn't even the roughest one to go through. I felt bad having him take hour trips with me to see our family sometimes because he was truly exhausted and overworked. I would never expect someone in residency to do what OP is asking. People in residency are working very hard, undervalued, underpaid, overworked and belittled for their rank constantly. It is physically, mentally and emotionally taxing. Give them grace.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "Congratulations on surviving!! I'm not in the medical field. Not married to anyone in the medical field. No one in my family is in the medical field. But even I know that a medical residency is years of insane hours, grueling work, and stress that I suspect is unimaginable to anyone who hasn't lived it. The audacity of OP expecting her brother and SIL to drive basically all day Saturday (7 hours) spend the night and then drive all day Sunday is mind-blowing. And she wants them to spend some of their precious, limited vacation time at their house? Undoubtedly, SIL needs to be able to completely decompress, get re-energized, and reconnect with her hubs. That isn't going to happen staying at someone else's home, especially with a 1-1/2 year-old. If OP wants to spend time with her brother and SIL, she needs to talk to them about the possibility of them all going away on vacation together, much like SIL's family does. People travel all the time with toddlers these days. It isn't easy, but if you're motivated to go somewhere, you make it work. \n\nOP, YTA to infinity and beyond.",
              "id": 45,
              "comments": [
                {
                  "score": 17,
                  "content": "The way \"medical field\" appeared 3 times directly below each other in your comment was amazing.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "The family traveling together was my idea too. I hate when people say they can’t travel because they have kids. I have 4 year old twins. They have traveled all over. Their first trip was to Hawaii, when they were a little over a year old. It’s never been a problem. Now they are accustomed to flying and going on road trips.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Even just as someone who’s watched greys anatomy I felt the same. Poor SIL! \n\nMajor kudos for making it through yours ❤️",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Came here to say this as a recently retired family practice doctor who did internship and residency when it was 120 hours a week. \n\nOP, despite the fact that your SIL (thanks to much needed limits placed on residency hours) is not working 3 full time jobs simultaneously, she is still working 2 full time jobs simultaneously. Re-read that and let it sink in.\n\nYTA.",
              "id": 49,
              "comments": [
                {
                  "score": 9,
                  "content": "I had the same experience; surgery internship and radiology residency and fellowship, now retired. Also before the work hour restrictions. OP is self-centered, entitled, and just all around horrible about this. OP YTA",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "As an old ER rn, I remember how few of the resident’s wives had any understanding of what the docs were going through. They’d complain about being ‘single mothers’, but happy enough to throw around status of being married to a doc. Used to piss us off a lot.  I mean, a lot. I only remember one wife being at all cool and she was an ex-rn.  So she understood. \nSo civilians don’t get it. Okay. But how about some simple human empathy?  Residents get hell from all sides.  So they can provide the ultimate service to folks. Sigh. \nOP YTA  unequivocally. Entitled too. Grow up.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My husband is a doctor and residency and fellowship can be absolutely brutal. We tried to go away for a weekend once during a particularly grueling rotation and he literally couldn’t get out of bed, he was so exhausted. They obviously moved for her residency, and OP is acting like her SIL stole her brother away. One day residency will be done but they won’t forget this attitude. Also “we need my parents for childcare” means OP is asking her parents to prioritize one of their children over the other just because OP has kids and her brother doesn’t.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1465,
          "content": "After reading all her self centeredness and excuses, I think she feels she is owed all these visits because she resents her brother leaving and prioritizing his wife. I wouldn’t say she’s punishing him, but she feels entitled. She had her life plans with him, but now there is another woman permanently in his life and he left OP for her, essentially. Very juvenile.",
          "id": 53,
          "comments": [
            {
              "score": 563,
              "content": "This exactly. She’s jealous of another woman in her brothers life and can’t fathom why he would pick his wife, over her and the ideal plan she had in her head. \n\nWhy would he need or want anyone else when he had her? /s",
              "id": 54,
              "comments": [
                {
                  "score": 48,
                  "content": "ABSOLUTELY!!! She is jealous of the other woman in her brother’s life!! The sister sounds like a self centered, entitled, jealous bitch!! Also, just because she has a child doesn’t mean the world and everyone in it revolves around them!! GROW UP!!!!!!!",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "God I dated so many men in my 20s with weird sister shit like this.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 423,
              "content": "Right?  She gets to get married and have a kid, but he is supposed to stay close and be a perpetually available uncle.\n\n\"But I always dreamed we'd be close.\"\n\n\"Sorry, she is in residency and we live too far away.\"\n\n\"BUT I ALWAYS DREAMED WE'D BE CLOSE!!!!\"\n\nYTA in a big, big way.",
              "id": 57,
              "comments": [
                {
                  "score": 61,
                  "content": "If she wanted to be close to her brother, they could phone, text, asynchronous tv watch, game together, FaceTime—-but it comes off that unless he’s in the same room, that’s not enough attention for her.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yep. One of my best friends is also going through residency. He lives about 11 hours away from me. While it is nice when we see each other face to face, right now the best way for me to contact him is through texts and FaceTime. I do plan on visiting him and his family sometime this summer.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yea, like if OP is so concerned about being close with her brother she should make the effort to follow and live closer to him, rather than constantly guilting him and his wife for living their lives",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "She sounds like a r/justnomil lmao",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "I think she feels she's owed these visits because SIL's \"long\" weekends interfere with her free childcare from her in-laws",
              "id": 62,
              "comments": [
                {
                  "score": 9,
                  "content": "Also I think that having a baby means she feels entitled to more attention than she is receiving, and that the baby would be a higher priority on everyone's list than it is.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "I agree. I always thought my brother and I would be close. We've lived close together (4 blocks apart) up until almost 7 years ago when I moved overseas for work. My brother is my best friend. We are super close. In the first few years we were here, he visited 1-2 times a year. I came home with my kids over Christmas. During COVID, there was a 3 year gap because travel restrictions and quarantine. \n\nWe went home over the summer last summer. He's about to meet me in Japan (14+ hour flight) in less than 2 weeks and spend a week in Hong Kong with me. \n\nI'm grateful he's never been like this to me. I am grateful he makes the trips to see us. \n\nOP is the AH. A jealous one at that.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "She’d likely be on here complaining if her husband prioritized one of his siblings the way she expects her brother to prioritize her.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 807,
          "content": "\"But not too tired to travel to Hawaii or Cancun?\" Jesus christ. I can promise her that her house is much less of a break than Hawaii or Cancun, especially if she's gonna nag them all the time. Shocking lack of self awareness.",
          "id": 66,
          "comments": [
            {
              "score": 175,
              "content": "It's hard to imagine a more restful week off than to visit your guilt tripping SIL and her toddler child.  It's a lot like Hawaii or Cancun, but without the sunshine,  warm breezes, fruity drinks, and beautiful sunsets.",
              "id": 67,
              "comments": [
                {
                  "score": 54,
                  "content": "Don’t forget the quiet and lack of mess.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 32,
                      "content": "And the diaper smell. Mmmmmmmm that's vacation right there.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Also, does she think her brother is going on these trips against his will? There’s a lot of vitriol against SIL but brother can do no wrong. I’m sure he’s making these decisions too! YTA, OP.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "The crazy thing is, in another comment she said they’ve only visited the brother and SIL for their wedding and house warming.\n\nThe Hawaiian “vacation” was their freaking honeymoon!\n\nI bet the visit to SIL’s parents was after she finished med school- which was very probably far away from them, so she could spend time with them after missing them for 4 years. \nThe trip to Cancun with her family- probably celebration for finishing med school and starting residency.\n(I’m just guessing but all of those events in the timeline OP gave suggest that to me.)\n\nBut OP’s “dream” is so much more important.",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "I have two (adult) kids. It is so much easier to drive 7 hours with a one-, two-, three- year old and stay somewhere for a week or so than to make that same drive when you have almost no downtime due to work demands. You bet I drove 8-10 hours with my little kid/s to see my best friend, and she did the same 12 years later. OP is entitled and spoiled. I have zero sympathy. I hope brother and wife stay far away.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 62,
              "content": "*Especially* if OP wants her brother to be an \"involved uncle\" too. I can't imagine taking a week of precious fucking vacation and then being handed someone else's child to babysit because mom and dad want a break. What a waste of your limited relaxation time.",
              "id": 73,
              "comments": [
                {
                  "score": 14,
                  "content": "Yeah, I was that \"involved\" uncle. I have four niblings and raised two of them to the point of being called daddy. And I was barely 18 at that point.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "“Hey, get this. I know you’re extremely tired from your 80 hour work weeks. I know I said we were going to chill for a week in an all inclusive place in Cancun and just drink cocktails and eat all day and relax by the pool, but how about we stay in a house with both my parents, my overbearing sibling and a screaming child? They’re both equivalents right?”",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "That was the part when I just thought JFC, visiting family is not a vacation. I’d die working those kind of hours and so little time off.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 517,
          "content": "More importantly, if OP keeps being an AH, SIL won't even consider finding a job somewhere close to them once she completes her residency and fellowship(s). OP needs to think of the long term ramifications of her actions. Sure, it's hard her older bro isn't there for her as much as she wants now but she's gonna end up making sure he's not later. YTA",
          "id": 77,
          "comments": [
            {
              "score": 224,
              "content": "If I was OP’s sister in law there is no way that I would look for a job near her. I would try to stay as far away as possible.",
              "id": 78,
              "comments": [
                {
                  "score": 19,
                  "content": "I’m just imagining SIL casually googling vacancies in New Zealand. Lol",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "There’s a reason why I kept well away from my parents after I finished residency. 1-2x a year was all I could tolerate being around my mother.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 130,
              "content": "She wants SIL and brother to move closer… why doesn’t OP move closer to them in order to fulfill her fantasy? She won’t want to do it, but she’ll expect them to pack up their whole lives to complete her dream world… smh",
              "id": 81,
              "comments": [
                {
                  "score": 30,
                  "content": "But if OP leaves she won't be able to get her parents to babysit for free.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 433,
          "content": "OP, I don’t think you have an comprehension of how hard a residency is. For 4 years a resident is at the total mercy of their hospital. The job is soul crushing but hopefully will lead to becoming an attending or working in a private practice after the residency.  It’s not optional. She can’t just get a job somewhere else. YTA and a bit clueless.",
          "id": 83,
          "comments": [
            {
              "score": 190,
              "content": "She doesn't care, its all about her needs.",
              "id": 84,
              "comments": [
                {
                  "score": 93,
                  "content": "Exactly. People keep thinking they can explain it to OP in a way she understands. She understands, she just values her time more and considers any efforts of hers more of a sacrifice than the efforts of anyone else. There is nothing more to explain.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I wonder who helped her deliver her baby? Maybe someone who went through a residency?  Lucky for her they were able to put in the time and prioritize their rest so they could become successful doctors.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "It's all about her *wants*",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I think OP also doesn't understand how matching for residency works.  All the begrudging of her brother moving 7 hours away *to be with his fiance*.  What did she expect?  The fiance to do all the backflips needed to transfer programs and swallow any potential hits to her career without complaint, assuming there's even a spot in her specialty available within a two hour drive of his home town?  Or for brother to just stick around and spend the first four years of his marriage in a long distance relationship?",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "OP did mention that she and her husband both have full-time jobs… so 40 hrs/week each which is almost the same COMBINED as SIL’s 60-70 hour weeks alone.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I would argue the residency shouldn't even factor in. I am not doing a residency and I wouldn't spend one weekend a month driving SEVEN HOURS each way to visit a sibling. And that's even if I am not working the other three weekends in the month.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "They know, they don't care though... They think their wants are more important. It's almost like she thinks she's his wife. Gross",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 290,
          "content": "God reading their replies the OP just doesn’t get it.",
          "id": 92,
          "comments": [
            {
              "score": 165,
              "content": "Doesn’t want to get it.",
              "id": 93,
              "comments": [
                {
                  "score": 55,
                  "content": "That’s exactly it. It’s as if they know they reasoning, but just don’t want it to “click” because the only thing that matters to them is getting what they want.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 18,
                      "content": "This post is just: Me! Me! Me! Me! Me! Me! Me! Me! Me! Me! Me! Me!",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 248,
          "content": "Bold of you to assume your SIL wants to spend her little free time with a baby and someone as entitled as you are. I wouldn't visit you even if you lived 7 minutes away. YTA.",
          "id": 96,
          "comments": [
            {
              "score": 13,
              "content": "OP is more of a baby than her baby is.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 248,
          "content": "OP is just pissed cos her parents split time and she's loosing her childcare. Entitled much",
          "id": 98,
          "comments": [
            {
              "score": 21,
              "content": "OP just mad that brother isn't there to be her free on-hand babysitter. Maybe she should pay people for there time or watch the kid herself. She's married, the husband can watch the kid.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 156,
          "content": "Can we also call out the judgement towards her parents for going and visiting brother and SIL but OP needs the childcare. She seems incredibly selfish and unforgiving to SIL and frankly jealous.\n\nYTA 100%",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 133,
          "content": "OP YTA. And the cheek of you to go so hard on SIL while you ungrateful being make your parents watch your child and not even allowing them to visit their son.. seriously I was reading this and started praying for your SIL.(AND I AM NOT RELIGIOUS PERSON!)",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21347,
      "content": "Why is your excuse for not visiting (having children) valid but their excuse (stress, work, mental health) is not valid? YTA",
      "id": 102,
      "comments": [
        {
          "score": 9303,
          "content": "But she works FULL TIME. You know, as opposed to the resident who works 60-80 hours a week /s",
          "id": 103,
          "comments": [
            {
              "score": 4578,
              "content": "Yeah, that stuck out to me too. OP works FULL TIME while SIL works MORE THAN FULL TIME.",
              "id": 104,
              "comments": [
                {
                  "score": 1280,
                  "content": "ONE FULL TIME is worth more than two full times, okay guys /s",
                  "id": 105,
                  "comments": [
                    {
                      "score": 384,
                      "content": "She's got more FULL TIME per FULL TIME",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "But...but... she's also A MOM, which means she has a second full time job as a doctor, chef, maid, chauffer, personal assistant, astronaut, archeologist, professional basketball player, and underwater basket weaver!",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "SIL essentially works two full time jobs",
                  "id": 108,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yup. Someone called it Double Full Time and I love that new term.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "But OP works full-time and has a baby. SIL just works all the time so her free time should be spent catering to OP.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1003,
              "content": "Do you mean the resident who works DOUBLE FULL TIME?",
              "id": 111,
              "comments": [
                {
                  "score": 32,
                  "content": "The second full time cancels out the first, apparently. /s",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Double full time AND making less than minimum wage!",
                  "id": 113,
                  "comments": [
                    {
                      "score": 29,
                      "content": "As someone starting residency in june, this makes me sad. Never average out the hourly pay, its depressing..\n\nPlus we're exempt from anti-trust laws, so we can't even do anything about it. Yay government!",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 823,
              "content": "What stuck out to me was the competition for childcare resources..",
              "id": 115,
              "comments": [
                {
                  "score": 602,
                  "content": "Oh ya that got me too-- our parents can't visit you we need them for child care!!! (I have a baby, my needs are more important!)",
                  "id": 116,
                  "comments": [
                    {
                      "score": 355,
                      "content": "This is exactly where the crux of the complaint is. She needs them for childcare, so they shouldn't be visiting HER. She needs to give up one of her trips and her free weekends to visit so the parents can still babysit. If they visit you, we have to handle our own kids FOR THE ENTIRE WEEKEND when we work full time. How DARE she force me to spend time with my kids!!! Weekends are mine! YTA",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "She’s probably one of those women who starts every sentence with “As a mother”.",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Me too.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 357,
              "content": "And she has a bAbY.",
              "id": 120,
              "comments": [
                {
                  "score": 224,
                  "content": "And everyone know Babies are banned on planes and road trips that last longer than a hour...   /s",
                  "id": 121,
                  "comments": [
                    {
                      "score": 118,
                      "content": "Well, the world should have made babies more portable, right?",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 111,
                  "content": "And he was HER brother first. Waaaahhhhhhh",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I love when folks use their kids as an excuse. Most babies sleep so well riding in a car. I remember taking mine out when I couldn't get them to settle and I at my white end.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "That’s what gets me. They BOTH work FULL TIME hours, so how could they schedule around that. \n\nYet SIL works both of those full time hours combined, just BY HERSELF. \n\nSo because the both of you work full time hours, you can’t figure out a way around your schedule to make the trip, but expect her to do it working double time? \n\nMake that make sense.\n\nETA: Thank you so much for the award!!",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "You're not accounting for Mommy Math. Any time an Entitled Mommy complains about their exhaustion it's always instantly more valid because they have an infant to take care of, as if that wasn't (likely) by choice.\n\nI can't stop laughing at this person thinking that a trip to visit her and her baby is going to compete with...Cancun or Hawaii. The mind boggles.\n\nOP, mega YTA.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "It’s honestly gross that residents are stuck working hours like that. I know it’s one of the reasons I chose to not enter the medical field, I value my me-time and residents really get very minimal.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 545,
          "content": "I've had a variation, since I don't have kids, no problem me traveling all over the place. Yet no one bothered to come and visit me....\n\nEver think that there might be a holiday when I don't want to have to travel somewhere?",
          "id": 128,
          "comments": [
            {
              "score": 268,
              "content": "I used to have this too. When I found out they vacationed a couple hours drive from me, but didn’t bother to tell me, I immediately started taking my vacations where and whenever I want. Not sure how they feel, but I’m a lot happier. 🤷🏼‍♀️",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "We live a few hours drive from both our families. Husband has quite a large immediate family who live in the same area. It has always been expected that we be the ones to travel - (sort of) fair enough, we didn’t have kids and we could usually catch everyone together. However we now have a 1 year old, but that expectation is still there and of course very subtly layered with hints about not seeing child enough. I was literally less than a week postpartum on a group zoom when BIL asks when we are coming up!! This guy has 2 of his own so shouldn’t be ignorant to why that was ridiculous.\n\nWe both work, we’re raising an infant without support. I think we do enough on our end. I’ve always been careful to balance trips to my family and trips to his, but we see my parents and sister more because they make an equal effort to come to us.",
              "id": 130,
              "comments": [
                {
                  "score": 13,
                  "content": "Been there. Sorry you’re going through it.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "I have the same. Family/friends have never visited me and always expect me to travel to them. I guess that tells me how much I really matter to them.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "This is so real. My family expects me to travel to them every holiday because I don't have kids. Smh",
              "id": 133,
              "comments": [
                {
                  "score": 11,
                  "content": "Omg!  Mine too!  And then they only want to come visit on my vacation and get mad when we go places on our vacation and don’t go see them!  I could really sympathies with with SIL on her being shamed for wanted to go to Cancun on her vacation.   Time to grow up OP!   Your brother has his own family now and he is choosing to put them first.   If my sister did this I would go NC.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Honestly reading this whole post had me empathizing with SIL so much. The way OP talks about SIL reminds me SO much of my SIL attitude during my psychology residency. I wasn't working 60-80hrs a week but I was working an average of 50 with poor pay poor and a very stressed.mental health state BUT it wasn't understood why I used my one week off to go on a vacation instead of see the family. 🤦‍♀️ So OP is definitely the AH here.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My SO and I joked this last year that maybe we should just go on vacation for the holidays just with us instead of doing the Family World Tour. it started out as a joke but instantly we were like… wow that sounds really great why don’t we do that?? We’re always the ones to travel, even my parents who live like an hour away never come up here. Honestly, the 2020 holidays where there was a travel ban in our area was actually kind of amazing, just to be able to stay at home, cook the food we wanted the way we wanted, stay in PJs… heaven",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Hahaha, yes.  \"You know that I-35 goes south too, right?\"",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 211,
          "content": "Also they do visits 1-2 times per year in OPs post. Sounds like OP only comes during holidays which can’t be that much more often so why are they asking SIL to carry the burden more when OP is the one struggling after making the choice to have a kid.",
          "id": 138,
          "comments": [
            {
              "score": 12,
              "content": ">Also they do visits 1-2 times per year in OPs post. Sounds like OP only comes during holidays which ~~can’t be that much more often so why are they asking SIL to carry the burden more when OP is the one struggling after making the choice to have a kid.~~ she can get \"free\" childcare.",
              "id": 139,
              "comments": [
                {
                  "score": 13,
                  "content": "This is what I see in so many people. Not sure if op is one of them but some people who are parents look down upon those who chose to be childfree or want to do it later but then need their help to look after the children. I won't call op an A because I have seen how hard it is to be a mother after watching my niece and her mother but that is precisely why people should get ready before doing it instead of imagining they can put the burden on someone's else's shoulders.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "For a 7-hour distance 1-2 visits a year seems perfectly normal too. Wouldn't expect anything more than that from family when they have an especially busy schedule.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "And judging them for going on fun vacations? People like this annoy tf out of me. They love to guilt people about not spending time together but want everything to be convenient to their schedule and needs.",
          "id": 142,
          "comments": [
            {
              "score": 29,
              "content": "Seriously unless OP lives in a villa on the Maldives, they must really have their head up the Behind thinking that a highly stressed out couple and overworked couple would have a better time driving 7 hrs to Nobody Cares, Wyoming, sleeping on a pullout or whatever and having to be polite with socially demanding family (in laws), listening to their toddler fuss and hearing town gossip “so you don’t hear it from me but guess who got pregnant - ohh my god you don’t sayyyyyy” than on a restful vacation in a private room with your supportive boo in fricking Hawaii.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I suspect one of the vacations was actually a honeymoon since OP visited them for their wedding…",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "She probably needs to go to the beach and not think about anything job related to a week. Signed, someone who goes on vacation to decompress from a great but stressful job",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Well, if this go on fun vacation, how are they to provide sister with free childcare for a week. I'm sure that's what she's wanting. Andv I'm also pretty sure she thinks that's a reasonable expectation.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 108,
          "content": "But it's all: me, me, me and I. \nShe's the centre of the universe for everyone she knows, they should do as princess wishes.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 72,
          "content": "As a DOCTOR no less…what does OP think her SIL is doing? Paperwork??",
          "id": 148,
          "comments": [
            {
              "score": 8,
              "content": "I mean….that’s a pretty safe bet. As a current third year surgery resident, I’d say that I dedicate at least 2-3 hrs daily towards paperwork. And non-surgical residencies have even more hours of paperwork they have to get done daily. The amount of charting we do is insane.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "I'm willing to bet OP calls herself mama bear.",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "ShE hAs A oNe YeAr Old...\n\nAs a parent I'm sick to death of fellow parents blaming their utterly ridiculous points of view on judy being plain AHs...",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Also no matter how much you like your in laws visiting them is stressful. Making sure you say the right things, come off happy and excited all the time. Visiting your own family, if you have a good relationship, is no work, you can relax around them. Makes sense why SIL would rather visit her own family over the in-laws. Also if you don’t have kids going to visit the in-laws that also have a 1 year old and having to hang around the 1 year old all the time when you are trying to get away sounds like the opposite of a vacation. Sounds awful. Residency doesn’t last forever, so suck it up and wait it out, if you damage your relationship now over it good luck getting them to visit when they actually have time too.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13089,
      "content": "YTA. \n\nGoing to Hawaii and staying at a hotel is a relaxing vacation. Going to stay with family who has a child is not. Medical residency is gruelling. She can’t “balance better”. \n\nYou have the right to wish you spent more time with your brother. You do not have the right to expect it though, nor to tell other people how to spend their vacation time.",
      "id": 153,
      "comments": [
        {
          "score": 2083,
          "content": "Exactly this, I like my in-laws but I (and the majority of people I suspect) would rather spend a third of precious vacation time with my spouse in Hawaii or Mexico or elsewhere than visiting relatives",
          "id": 154,
          "comments": [
            {
              "score": 804,
              "content": "If OP has that much of an issue with it, perhaps she should consider having a family vacation. I know of a few families who live a few hours away from each other, but meet at a place to have a vacay together. They are all responsible for their share of everything. In this way they can make memories together, as well as have just \"couples time\". just a silly thought",
              "id": 155,
              "comments": [
                {
                  "score": 465,
                  "content": "I think this is a good solution, so long as OP does not even DREAM of asking SIL to watch the baby. SIL needs to actually relax and a 1.5 year old is not relaxing.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 350,
                      "content": "OP is already using their parents as (probably uncompensated?) childcare, and is angry whenever said parents take a vacation away, so I really wouldn't put it past the OP to treat SIL similarly.\n\nI notice that Brother apparently doesn't insist on visiting his family more often, and I wonder if there are more reasons for this than the 7 hour drive.",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 98,
                      "content": "This right here.  I have no interest in spending my vacation with my in-laws.  This would be like going to see them.  It is not relaxing nor fun.  But maybe it is just me.  They are very high strung and go go go.  Where we are sit in a chair and read a book for 12 hours kind of people.  Nothing about spending time with either of our families anywhere is relaxing.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Kinda can’t see that happening. OP relies on her own parents for childcare and the way she complained that she was disappointed about her brother moving far away because she had hoped that he’s be a really involved uncle sounds to me like she’ll take any chance to make others babysit for her. Because ‘bonding’.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 130,
                  "content": ">perhaps she should consider having a family vacation. I know of a few families who live a few hours away from each other, but meet at a place to have a vacay together.\n\nThat's probably how SIL's family does it since they actually vacation with them. OP probably wants them to visit to dump the kid on them under the disguise of uncle and nibbling bonding.\n\nOP may also just not want to accept that her brother may just not be that into her kid and not want to be super involved practically second dad uncle.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 31,
                      "content": "She had her baby, and then shortly after he moved 7 hours away. I'm not saying that one caused the other, but brother may not have been on board to be super involved being childcare",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I get that feel too based on her needing her parents for childcare...",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "It's a good solution/compromise in theory. But for most families, even this solution doesn't work out. Too many logistics.\n\nAlso, again does not sound relaxing to me. Sounds like OP is looking to family to be around as free childcare. With children in the mix, it often turns into auntie and uncle being free babysitters so mom and dad can f*** off without being burdened by their kid, so the only one who ends up enjoying the vacation is the parents of the little by dumping off their responsibility.",
                  "id": 163,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "That was what I was thinking. Meet halfway for a night or two in a hotel.  Bring the grandparents too!  This really would be a great solution. Something tells me this would not satisfy OP somehow.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "Oh my god i wouldn't even want to spend it with my own family. My partner only has two weeks vacation time, and last year i had to put my foot down and tell my mother \"no, we came to visit you once this year, i am not asking my partner to use his entire vacation time for the year to visit *my* family\" when she tried to bug us to come visit. And I've already prepped her that we're not coming to visit this year because we have a vacation planned with our friends and a small vacation for just us because we haven't done that in literal years, but if they want to come visit us we are more than happy to have them.",
              "id": 165,
              "comments": [
                {
                  "score": 14,
                  "content": "Ah, but then the parents launch into \"but you and the kids can visit without him!\" No. No we cannot.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah hard no. Even though Florida sounds lovely in New York's mid-February grey, i turn on a happy light and remind myself how much she stresses me out. Man i wish i could just go hang out with my dad.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 572,
          "content": "Not to mention that OP seems very whiny and most people would rather go to Hawaii than visit a whiny relative.",
          "id": 168,
          "comments": [
            {
              "score": 287,
              "content": "Yeah that 'hoping he'd be involved as an uncle' screams I thought 'I'd have free babysitting and help at home'.",
              "id": 169,
              "comments": [
                {
                  "score": 95,
                  "content": "The funny thing about that though is that OP already does, her parents. They live full time with here so her kid doesn't have tk go in to daycare.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 73,
              "content": "one of my siblings used to guilt trip me about spending time with other people instead of her. guess who i don't really hang out with anymore...",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "I was thinking that. OP sounds super overbearing and is clearly lacking in the self-awareness to be accommodating.  \n\nLike why would they want to visit YOU, of all people, during the little time they have together??",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah and she didn’t have to drive to Hawaii and I bet it wasn’t a massive drive to the airport. Just sun, sand, relaxation and sleeping nowhere near a potentially crying baby. BLISS\nI can’t imagine being that exhausted and being expected to drive for 7 hours. That’s just dangerous. And expecting her to do a 14 hour round trip to have a couple of hours with them and then leap back into her fun-packed working week? Spare me!",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Right? They don’t come to visit enough, my parents are willing to go to see them, but that screws up childcare, why would they go to Hawaii instead of seeing me, on and on me,me,me. ‘I envisioned’.  She has a vision of her how her life should be, and everyone won’t dance to her tune, how awful! Ugh.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah, I wonder why her brother \"finds excuses\" to not visit her alone.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 416,
          "content": "Not to mention, I don’t think residents get paid well either. SIL would likely have huge loans and making a pittance until she is done training.",
          "id": 176,
          "comments": [
            {
              "score": 114,
              "content": "You’re exactly right. She may be a doctor but she’ll be paying loans off for quite a while.",
              "id": 177,
              "comments": [
                {
                  "score": 22,
                  "content": "Brother is a full-fledged attending physician and is paying off SIL's loans. OP seems quite ticked about it.",
                  "id": 178,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "I live in a low reimbursement area and the residents make less than minimum wage per hour when it’s all calculated out. It’s a fucking travesty.",
              "id": 179,
              "comments": [
                {
                  "score": 24,
                  "content": "That and the sleep deprivation that residents go through is really fucked up.  I guess in a way it’s like boot camp in that it’s designed to toughen them up but they’re *working*, not just training, and should be paid accordingly.  The insane hours…yeah people are going to be stretched to their limit and then some.  I don’t think it’s even a benefit for them to eat/sleep/breathe medicine to the detriment of literally all three.  It’s been a minute but I’m fairly certain there’s ample research showing that people’s cognitive and physical abilities are impaired after a certain point.  It’s terrible for the residents’ health, must be detrimental to patient care, and if it isn’t an actual benefit to learning why does it continue?  Not to mention placement which sounds like my personal nightmare.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I don’t know if it’s like this in other countries, but the American healthcare system is a travesty. Burn it down and start over.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah it’s not great for patient care. Especially overnight when there’s often one or two residents covering what 5 or 6 cover during the day, and no attendings (full docs that supervise) around to ask questions. During this time they’re firefighters, all other treatments are deferred to the day shift because they literally do not have time to consider each patients entire case. They also have to go assess admissions in the emergency department. If you’re not making a stink about it, and we’re surging, a resident may not even have time to look at you overnight. \n\nI’ve been told that the rationale for the long hours is that you *need* all these hours to hone clinical decision making skills, and it must be packed into 5 years. It forces them to literally eat, sleep, and breathe medicine, which is not great for one’s mental health. Former iterations of resident socialization are also psychologically abusive, and I’m sure there are some vestiges of that still out there. It used to be common practice for attendings to berate and humiliate residents for errors in front of other residents, to deter them from future mistakes. That trickled down to the nurses and it was often common for doctors to yell at nurses, but that had an impact on patient care and is no longer openly accepted (except maybe in surgery, they’re in their own lil world down there).\n\nETA: its all terrible and sad and exploitative, and I have all the love in the world for my residents, even when they make mistakes. As nurses, we’re expected to know enough to be able to correct their mistakes, likely because of the conditions under which our providers work.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "yes, the big pay day is yet to come.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "💯. I am not in healthcare but I work insane hours (I’m a lawyer) and don’t ever have much time off, don’t regularly have entire weekends free, and often go for months working daily if a case requires it - and the LAST thing I’d want to do if I had a precious 48 hours off is drive 7 hours to visit my sister and her family and her little kids (shudder). That is the polar opposite of relaxing or quality time. \n\nOP should talk to her brother about visiting her by himself on weekends that SIL is working. If brother makes excuses not to, well he also doesn’t want to spend his weekends doing an insanely long drive to sit at his sister’s house and listen to the shrieks and baby talk of a 1.5 year old. (I don’t blame him.)",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "This! OP is in some serious denial if she thinks a stay at her home with an infant is comparable to Hawaii or Cancun. SIL is working her ass off in medical school and is entitled to relaxing and child free vacations. OP can be sad about that, but she needs to find a way to understand and get over it. Additionally, relationships change and evolve as you get older; her brother is not going to have the bandwidth for her like he used to and that’s completely normal and healthy.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "If I had her job I’d choose Hawaiian vacation also… she deserves it",
          "id": 186,
          "comments": [
            {
              "score": 7,
              "content": "I don't have her job and I would also choose a Hawaiian vacation.",
              "id": 187,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "I also liked the note that her and her brother always lived within 30 mins of each other, but then he moved somewhere else and she didn't follow so they could still live 30 mins apart.\n\nSounds like she expects a lot of effort from her brother, and by extension now, his wife (and her parents, they LIVE with her to provide childacare?!!).\nWhile giving very little in return. \n\nYta op. I personally would not want to drive 14 hours to visit a whiny sil who would most likely monopolize her brothers time and leave me to deal with her kid (lets be honest 1.5 years is a high energy, high demand age). Especially if I only got a few weekends a year off, my workload was 80 hours a week, and I worked in a freaking hospital.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 43,
          "content": "Also, the OP's hometown might suck shit",
          "id": 189,
          "comments": [
            {
              "score": 30,
              "content": "Well, we know OP’s there…",
              "id": 190,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yup, people in hell have the right to want ice water too.\n\nThe entitlement is strong with this one.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "My friend and I were just talking about the difference between vacation and travel. We have to *travel* to see my husbands family. We do it, but it’s not relaxing and it’s sometimes not fun. At the very least, it’s a 6 hour plane ride, a shit ton of driving, and staying in someone’s spare room for the night when they all decide it’s time to call it a night. And god forbid the couple we stay with has a kid acting out or are in a fight. It’s…not a *vacation* in any sense of the word. But I’m using up my vacation days to go there. So, no, we don’t visit a lot. \n\nAnd shit, I live 90 minutes from my family, and I haven’t been there since Xmas. I’m just driving up there for the first time this year, this weekend. And I can’t even blame kids - I just have my own social life in my town and my own errands to run on the weekend. Or sometimes I just wanna get day drunk and get high all weekend. You will pry those days from my cold dead hands.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6847,
      "content": ">My parents have to split time visiting there and visiting us and we need them for childcare. \n\nYTA\n\nIf you don't want to visit them that's fine. But don't insist they visit you, or begrudge your parents splitting their visits between you and your brother. Your SIL is working 80 hour weeks—that's *double* full time.",
      "id": 193,
      "comments": [
        {
          "score": 2042,
          "content": "Not to mention the insinuation that OP should get more of their parents' attention now that they have a child. Yeesh.",
          "id": 194,
          "comments": [
            {
              "score": 938,
              "content": "That's actually been my experience: people often would rather visit their children and grandchildren than their childless children. And that's fine—*if* it's their choice. But to insist that the grandparents visit more often *because OP needs the childcare* is simply egregious.",
              "id": 195,
              "comments": [
                {
                  "score": 566,
                  "content": "\"We need them for childcare,\" really tells its own story.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 178,
                      "content": "Just say you want someone to watch your spawn and you can't handle it. OP sounds so beyond entitled that it's ridiculous. YTA",
                      "id": 197,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "Not only that, but she seems annoyed that her brother moved and now can't also provide free childcare. It reeks of entitlement.",
                      "id": 198,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "OP replied in a comment that the grandparents lives with them because OP doesn't want to put her child in daycare, so it's even worse",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That’s my experience right now. My mom lives 4 hours away from me and my partner, and 22 hours away from my older married sister with two young kids. \n\nGuess which child she’s never visited?",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 290,
              "content": "OP seems to forget that contrary to Hawaii and Cancun, visiting someone with a toddler is NOT relaxing or \"vacation time\".",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "BUT SHE WORKS FULL TIME WHY CAN'T ANYONE UNDERSTAND?!? It also seems like you just assumed you were going to have your brother as someone to lean on when you gave birth when that was absolutely not the impression that you should have had. You decided to have a kid, that comes with consequences and sacrifices",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "They “need them for childcare?” Bro they didn’t decide to have a baby. You did. OP needs to get a grip.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Op admitted in a comment that her parents actually LIVE WITH HER, so her complaint about her parents “splitting time” between them was total bullshit. They spend all their time providing free full time childcare for op, and she gets upset when they visit their son a few measly days a year.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "WTF does \"insist\" mean in this situation anyway? OP is going to send ninjas in black helicopters to grab brother and SIL and bring them to her whether they like it or not?\n\nOP has no meaningful ability to insist. All she's doing is pissing off her brother and SIL.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I hated that line. Trust me it sucks to be the one that’s 7 hours away and rarely gets to see her mom because she’s “needed for childcare”. Before I had my own daughter my mom visited once in 7 years because she couldn’t get time away from caring for my nephew. This made me feel for SIL even more.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5706,
      "content": "YTA.\n\nFirst off you are not entitled to your adult brothers time and you don't have a say in where they live. If you are so pressed about it you move closer to them...\n\nSecondly, I'm not working 60-80 hours (anymore) in a high stress environment but I can for sure tell you that there is no way on gods green earth that I would be driving 7 hours more than once or twice a year to visit my sibling... I love my brother. But no...\n\nThirdly, You don't NEED THEM FOR CHILDCARE. Your parents are not your built in baby sitters so saying that them going to visit your brother is hard on you... No hun... Your not entitled to your parents either.\n\nFourth, So you don't want to make a 7 hour trip with a 18 month old. Your brother and SIL don't want to make a 7 hour trip because SHE WORKS DOUBLE WHAT A NORMAL PERSON WORKS AND SEES PEOPLE DIE ON A REGULAR BASIS.... So yes if she wants to stay home or go to Hawaii and Cancun that is their right and choice. I have two kids. And I SURE AS HELL WOULD NOT BE PICKING A TRIP TO MY FAMILY TO HEAR SCREAMING CHILDREN OVER A DESTINATION VACATION TO RELAX... How out of touch with reality are you\n\nETA: Thank you for the awards and Upvotes!",
      "id": 207,
      "comments": [
        {
          "score": 1341,
          "content": "Not to mention, residents make very little money and have massive loans to pay back. I would also be saving my money to spend on a nice vacation. Residency is extremely stressful and thankless. You basically live in the hospital and have no sense of time and barely even get to be outside. I’m not a resident but I am a medical provider who frequently never gets to see daylight. It takes a massive toll on your mental health, not to mention physically.",
          "id": 208,
          "comments": [
            {
              "score": 202,
              "content": "So?  Maybe your personality is the reason they don't want to see you.",
              "id": 209,
              "comments": [
                {
                  "score": 145,
                  "content": "Oh I 100% agree.",
                  "id": 210,
                  "comments": [
                    {
                      "score": 225,
                      "content": "Sorry if I replied to you!  I meant to send that to the OP.",
                      "id": 211,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 259,
          "content": "I’ve worked 80 hours too on full travel and the idea I’d drive 14 hours to see my sister for a day, who I absolutely adore, is hilarious and she would never expect or want that because she’d prefer I not drop dead",
          "id": 212,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "That's what I wanted to say: even with a rather unstressful monday-friday 9-5 job, there's no fucking way in hell I would drive 14 hours during a 2 day weekend just to visit someone - important holidays, weddings etc might be another story. But just to say hi and hang out? No fucking way.\n\nAdding to that, if I worked basically two full time jobs every single week, I'd honestly be way too exhausted to fly to Hawaii for a week. As much as OP sucks for being so entitled, the bigger AH in this situation (or even in general) seems to be workers rights in the US. 3 weeks of holidays is a really bad joke. Only being allowed to take a week at a time sounds like a crime. Makes me so grateful to live in a country where it's kind of expected that you take longer breaks, at least one 2 or 3 week holiday per year to decompress and relax and stay as healthy as possible.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This. All of this. OP is acting so entitled to everybody’s time and effort, but is giving nothing in return.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2750,
      "content": "YTA for demanding a concession from somebody else (that they use their precious time off to spend with you) when you won’t do the same for them. As much as you love your brother, you sound a lot like you want to be able to make demands on him and that the dynamic is that you expect him to take care of you and that you should be able to call on him whenever *you* choose regardless of whether he’s got the time or energy to do so. That’s pretty exhausting for him and his wife, and it’s not surprising that they want to use their vacation time to actually relax.\n\nYou also don’t get to complain about your parents choosing to spend a small amount of time with your brother rather than looking after your kid. They are his parents too and it’s not for you to judge how your parents do that - if they are unavailable you will just have to find another solution for your child.",
      "id": 215,
      "comments": [
        {
          "score": 237,
          "content": "Op probably expects him to babysit for free. She did say she expected him to be a more invoked uncle.",
          "id": 216,
          "comments": [
            {
              "score": 114,
              "content": "I get that impression too - but I’m not sure whether babysitting the literal child, or babysitting OP herself.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "No, she wants to see the spoils of his *attending physician* paycheque that he keeps spending on vacations with his wife instead of her and her spawn.",
              "id": 218,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "Awarded you - Proper grown ass advice.",
          "id": 219,
          "comments": [
            {
              "score": 5,
              "content": "Thanks!",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": ">he dynamic is that you expect him to take care of you and that you should be able to call on him whenever you choose\n\nThis is what stuck out to me too. This is exactly the vibe I got. She is the one with kids, she's the important one, people should cater to her and her baby.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Ooo reading this, I know what this is..... She's mad that she doesn't have her brother as free childcare too because they are so far away. Because she never dreamed of having him move away and wanted him to be a very close uncle figure. Plus if the brother and SIL come more often it won't be as noticeable if they stepped out for a quick errand......\n\nI am of course speculating but given her post she sounds self centered and exhausting to be around so I wouldn't put it past her",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Could you imagine if the brother had a baby. Omg. Nuclear war",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "For the parents, despite the 7 hour drive, I bet visiting the son and DiL is still more of a vacation than being on call day care for the daughter",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This dude has serious everyone needs to cater to my needs energy",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1744,
      "content": "I cried every single day the last semester of my doctorate, and I'm an art historian. I write about pictures. She's trying to save lives 80 hours a week.\n\nYTA",
      "id": 226,
      "comments": [
        {
          "score": 570,
          "content": "Hey. Your work is valuable too.",
          "id": 227,
          "comments": [
            {
              "score": 392,
              "content": "Thank you, I appreciate that, but it's definitely not medical residency.",
              "id": 228,
              "comments": [
                {
                  "score": 246,
                  "content": "If we didn’t need art historians we wouldn’t have them.",
                  "id": 229,
                  "comments": [
                    {
                      "score": 218,
                      "content": "We're working real hard on making that happen [insert diatribe on the decline of the liberal arts].\n\nThank you, though, sincerely.",
                      "id": 230,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 96,
                  "content": "Think about how many lives have been saved over time because of art. You have devoted time to understanding the history. That ensures art stays around and is discussed. You aren’t actively saving lives like a doctor but you are making the world a mentally better place. Congrats on the career!",
                  "id": 231,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Thank you! I actually teach writing now, but I'm not sorry I did it. Anyway, hope OP sees the light.",
                      "id": 232,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "See, this is the sweet, wholesome side of Reddit I live for. People aggressively reminding you that WHAT YOU DO IS IMPORTANT, because it’s true!!",
                      "id": 233,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "I had absolutely no idea how difficult Art History was until my daughter chose to study the subject. No thanks Finance was a cake walk by comparison. I am beyond impressed with how much my daughter understands about the world, history, people, chemistry, trade, power, money because of her degree. Well done on your doctorate!",
          "id": 234,
          "comments": [
            {
              "score": 23,
              "content": "I'm so glad to hear how proud you are of your daughter! And yes, I love how art history connects so many subjects!",
              "id": 235,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1377,
      "content": "YTA You did a good job outlining her time obligations. Then a crap job of having any empathy whatsoever. Being a resident is ridiculously stressful because you are responsible for medical care for which you are too tired to rightfully be making decisions. Oh, and then there is seeing all the death and suffering. Any opportunity to get away from stress must be seized. Long drives to stay with toddlers whose parents lack compassion for you does not qualify.",
      "id": 236,
      "comments": [
        {
          "score": 850,
          "content": "But the SIL gets GOLDEN WEEKENDS (known to most people as a regular weekend). /s",
          "id": 237,
          "comments": [
            {
              "score": 457,
              "content": "And she gets an ENTIRE golden weekend a MONTH!",
              "id": 238,
              "comments": [
                {
                  "score": 307,
                  "content": "But she should spend 14 of those 48 hours in a car!",
                  "id": 239,
                  "comments": [
                    {
                      "score": 116,
                      "content": "Which would bring her total working hours to… flips notepad…\n94!",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "To see an entitled AH who has no respect for me, my career or my time.",
                      "id": 241,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I have a golden weekend this weekend. And you know what I'm planning on doing? NOTHING! ABSOLUTELY NOTHING! I may not change out of my jammies & I don't care.",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 172,
              "content": "Who wants to spend a “golden weekend” traveling for 14 hours anyways?? That would literally throw away the entire weekend",
              "id": 243,
              "comments": [
                {
                  "score": 48,
                  "content": "Come now my good person, 14/48 = 29.2% of the weekend, that leaves 70.8% of the weekend.",
                  "id": 244,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Bestie you forgot to factor in a healthy sleep schedule.",
                      "id": 245,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "And the whining about “time for cancun and Hawaii but not us …”.  \n\nWell duhhhh …. Stressful lives mean complete breaks are necessary to maintain your sanity and health …. Newsflash.  Driving to see your entitled ass is a chore they don’t need \n\nYTA",
          "id": 246,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "With all that listing of scheduling I still didn’t understand why a “golden weekend” came into play at all. So she gets the occasional Saturday/Sunday off…what does that have to do with visiting them 7hrs away?? Nobody makes trips like that on a normal 2 day weekend, it’s hard to even understand how that’d be feasible. \n\nAlso why was this a whole tirade against *evil SIL who stole my brother away*? She acts like SIL is some evil queen lockingher brother away in a tower. She didn’t make him move away. She didn’t make him go to Hawaii or Cancun. He’s a grown man who wants to do those things. Stop pretending like this is her fault that the brother won’t visit her.",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "They’re just not that into you, OP. Maybe you and your bro were close before, but you sound unhinged (and I don’t use that lightly) when you carefully explain the situation of your bro/ SIL and then think that they would want to visit you and a child after working 2x the hours you do / with only one day off. Please reread your statement and try to take it in. \n\nI used to work three jobs and occasionally I’d have a day off. Anyone who doesn’t value your time, doesn’t value you. When someone - like OP-  gave me attitude when I explained I wanted to relax or about how I didn’t want to commit/want to do something—  I would simply say “Do you really think you’re worth my 1 day off in 2 weeks?”  \n\nI didn’t say that to be a dick, I said that because all my real friends understood I was exhausted and *never* made me feel shitty about not attending.\n\nOP sounds annoying AF *and* there’s a baby— What a mystery that your SIL doesn’t want to overextend herself .",
          "id": 248,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 901,
      "content": "YTA - visiting family with. young child is wildly different than a vacation just the two of them for the explicit purpose of having fun and unwinding. I'm guessing you and her aren't very close, so to her visiting you would not be considered fun and relaxing, but rather a stressful chore she is forced to endure on one of the VERY RARE days she has off. Your entitled attitude about her and her husbands time is probably not helping things either, being 'devastated' that your brother is not super involved as an uncle is not the healthiest response, he's not a second parent to the kid and having the expectation that he wouldn't have his own wants and desires in life that would contradict your own could definitely be seen as selfish from an outside perspective (i.e. to his wife who is trying to build her own life with him, and doesn't want a demanding in-law butting in every chance they get.) I understand wanting your brother to be involved as an uncle, so if that's the case why not just ask him to visit more frequently alone if his wife can't make the trip? What about planning day trips where you guys meet somewhere in the middle? just because they don't have a kid doesn't mean making the trip is any more viable for them then it is for you, and expecting them to be able to make time for you're family in their busy lives while not trying to reach any sort of compromise with them isn't ever going to work out well.",
      "id": 249,
      "comments": [
        {
          "score": 218,
          "content": "Exactly this. The poor SIL is getting trashed by OP for not being more willing to do an awfully stressful chore - involving a 14 hour round trip drive - more often.",
          "id": 250,
          "comments": [
            {
              "score": 23,
              "content": "Right?! I would’nt want to visit her either. Yeesh",
              "id": 251,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "I get what u are saying but I would be livid if my husband went to visit. Did you miss the part where he was worried about depression and the rates of depression with residents?  No f-ing way my husband is going anywhere when I am in my last semester writing my thesis.  When I’m done?  Sure fine. Whatever works because  I will be relaxing in the mountains with my dog.    I would have no desire to visit his brat of a sister.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 585,
      "content": "YTA- she works 80hr weeks and you think she wants to drive 14 hrs just to visit you for basically a day! wow.  2 hours to seek her family is not that far, 7 hours is alot to drive for most people with a normal job.  FYI, sorry but you are no longer the focus for your brother, he has his own life now. If he wants to come visit you, then he will.",
      "id": 253,
      "comments": [
        {
          "score": 83,
          "content": "Seriously 2 hours is hey husband, can you drive and I'm getting some sleep one way and then I will drive the next day.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Exactly- she points out how often they visit her family. 2 hours is such a far cry from 7. It’s not even close.",
          "id": 255,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}