{
  "post content": "I \\[early 30s\\] invited two friends (who are boyfriend and girlfriend) — Tim \\[early 30s\\] and Sam \\[mid 20s\\], respectively — to see a showing of My Neighbor Totoro in theaters today. We made the plans maybe five days ago. Tim and Sam live an hour south of the theater; I live an hour north of it.\n\nYesterday, I asked if they would like to catch lunch beforehand. They declined, stating they were going to Tim's parents' house today first, which is about two hours north of where they live.\n\nThe movie was at 4 PM and I left my apartment at \\~1 so I could catch lunch near the theater and do some language studying, a hobby of mine. About 2 hours before movie started, I texted my friends to see if they were on the road. They didn't respond. 45 minutes later, I texted again, and they said they were on the road, but would be 10 minutes late. According to Sam, they didn't realize that the town we were meeting up in was over an hour away from Tim's parents', despite being considerably further north.\n\nI arrive at the theater and try to buy my ticket at the kiosk. Apparently, you have to buy online, but there is assigned seating. I purchase 3 tickets for no less than $50.40 so we can all sit next to each other in the same row, texting Tim/Sam to let them know what's up. Sam asks how she and Tim will be able to get into the showing if I have the tickets. I told her I would wait by the kiosk. Then she informs me they'll actually arrive 20 minutes late, blaming traffic.\n\n20. minutes. late.\n\nAt this point, I'm livid. I talked to a third party and explained everything, and I was told my feelings were normal. This third party told me I should have considered the fact Tim/Sam have been late before for other events. (Funny enough, the ulterior motive I had for inviting them to lunch was to make sure we were all in the same place BEFORE the show, due to their chronic tardiness.) Even so, I feel you do your due diligence to arrive on time to events, especially if someone is waiting on you.\n\nSo, I wrote Tim/Sam in our group chat. This is unedited. Slashes for message breaks:\n\nI'm just gonna be real rn / Y'all gotta work on your timing / Like it sucks knowing I didn't even want to come to the dub but I met you halfway on that / Cuz I would have rather done the sub / And then y'all don't look up directions beforehand? / Idk / If it was the first time this had happened I would let it slide / But I'm miffed af rn\n\nNo response.\n\nBy now, it was a full 20 minutes past the start time. I thought to myself that if it got to be 4:25, I would start toward my car. Lo and behold, I'm in my car at 4:28, start the engine, and get a call at 4:29. \"Hey, we're here, where are you?\" asks Sam. \"I just got in my car. I'll forward you the tickets. Enjoy the show.\" And I hang up.\n\nFollowing that, Sam wrote in the group chat, \"So glad we rushed here\". To which I responded, \"Fuck your sarcasm are you kidding me / Rushed to be 30 min late lmao I'm dead\" No response since then.\n\nSo, there you have it. AITA for leaving my friends at the movie theater?",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "ESH.\nThem - obviously for being late ect \n\nYou - for not just “forwarding” them their tickets to begin with. You get to go into the theater on time and watch the start of the movie plus all the previews. They can arrive an hour late and it wouldn’t matter.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "INFO\n\nWhy didn't you forward the tickets to begin with and watch the movie anyway?\n\n>Sam asks how she and Tim will be able to get into the showing if I have the tickets. I told her I would wait by the kiosk.\n\n>I'll forward you the tickets.",
      "id": 3,
      "comments": [
        {
          "score": -10,
          "content": "I wanted to go in at the same time as them and didn't want to deal with the hassle of having to tell the ticket person that I would go in before my party.",
          "id": 4,
          "comments": [
            {
              "score": 8,
              "content": "I've never found either of those to be much hassle, it's pretty typical. You punished yourself for their bad behavior. \n\nBut their chronic lateness is very disrespectful. \n\nNTA",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "Are you the asshole? No, but you were pretty fucking sassy borderline dickish.  Don't get me wrong, I'd probably react in a similar manner, probably have in the past, but let's be real couples are some of the worst friends to have as a single person, just like how parents and sane people.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "INFO: If you could have forwarded them the tickets all along why didn’t you just do that in the first place? Why all the standing by the kiosk and texting drama when you could have just sent them their tickets and gone into the movie?",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "ESH\n\nYour friends for being late, and knowing they made two plans on the same day without double checking the time table. \n\nYou for being incredibly rude to them the entire time, including *after* you yourself have opted out of the event. If you continue to \"fuck their sarcasm\" you're probably not going to have many friends at that rate. \n\nBut if you need to invite people to places with an \"ulterior motive\" then it just isn't worth it. Let em go.",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA. It's s consistent problem. If they value their friendships they will do in something about it or at least feel some remorse when they mess up.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA, I hate it when people are late, but I can't believe you missed out on Totoro just because those people have time management issues.",
      "id": 10,
      "comments": [
        {
          "score": 6,
          "content": "Right, I would have gotten a refund or free passes for theirs and went in and watched by myself. Lol. They can figure it out on their own if they can't pull their shit together.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "I mean sure they were late and that sucks, but it's not like you missed a flight or anything like that. It sounds like you were already very resentful of them to begin with, and were just waiting to blow up on them.\n\nYTA. Yeah your friends need to learn to plan better, but you need to grow up and not act like a child when you're disappointed. This is how I'd expect a teenager to behave in a situation like this, not someone in their early 30's.",
      "id": 12,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH. I am almost always on time for things. I have friends with time management issues. It sucks, but that's a them issue. You punished them and yourself when you could have just forwarded them their tickets or left them at the kiosk with their names so they could pick them up, gone in and all of you could have enjoyed some time together.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA.  They have shown you who they are and how much they value you and your time - their time with the parents was more important to them than yours.  Believe them and decide if they are still worth it.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    }
  ]
}