{
  "post content": "My mom and dad have been separated for 26 years, their separation ended badly and resulted in her getting custody of me and my brother. My dad went down a bad path in life and chose not to see us when we were growing up, so i knew nothing about him. It wasn’t until i was 18 that he had regretted it and wanted a relationship with us, i always wanted to know my dad so i agreed but i had asked my mom if she was fine with it and asked if she would go with me and she told me she was and would go with me.\n\nThe first meeting ended up really well, except my mom kept throwing in his face that he left us. I had asked her to stop because it was making us uncomfortable, that’s when she got upset and started telling my dad horrible stories about me. I really didn’t know how to react, i was dumbfounded. So when we left i asked her why she’d tell him stories about my past and she told me that he needed to know. \n\nMy dad and i made an agreement that we would see each other at least three times out of the year since he lives a bit away from me. My mom insisted that she tag along, it wasn’t an issue but my mom tends to dictate what we’re going to do and how we’re going to do it. She also spends over 5 hours putting on makeup to impress my dad and expects us all to wait for her. Then when we talk about events in our lives she tends to always talk badly about me. She’s even gone as far as to making fun of my anxiety, claiming i don’t have it and i’m just a good actress to my dad. Whenever me and my dad end up in conversation, she acts almost jealous and tries to talk over me the entire time.\n\nAt one point she’s gone as far as to emailing my dad lies about me, saying not to get too close to me because i’m very jealous of his relationships with my family and i was manipulative. I’m really not sure why she does this, especially since all i was trying to do was have a bond with my father.\n\nAfter years of her constantly putting me down to my dad i had enough. I had graduated from college and we were out celebrating me getting my degree, i asked my boyfriend if he could order my food for me because it was too loud and i have a soft spoken voice so the waiter couldn’t hear me. My mom decided to make fun of me in front of my family and boyfriend then proceeded to tell my dad, who attended my graduation, that he cursed her with a daughter like me because i was so weak. At that point i just saw red because my celebration was ruined so i got up from the table and yelled “At least i’m not trying to constantly chase and impress someone that doesn’t want me anymore by bringing my children down!” and walked out of my own party. \n\nMy mom didn’t talk to me for weeks and my family says that i’m an a-hole for hurting her feelings. I felt bad about how things went down but i also don’t feel like i was entirely wrong either. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 9425,
      "content": "NTA. Your mom is some piece of work, I have no idea what she thinks she can gain from bringing her own child down.",
      "id": 2,
      "comments": [
        {
          "score": 3388,
          "content": "and I don't understand why she thinks bringing down her own child would impress the man who is the father of her",
          "id": 3,
          "comments": [
            {
              "score": 1812,
              "content": "Imo it kind of seems like she's trying to insult the dad by insulting his daughter and thereby him, even though she was the one that raised her.",
              "id": 4,
              "comments": [
                {
                  "score": 1596,
                  "content": "I think she’s trying to both insult him and impress him by putting down her own daughter. Maybe she’s jealous and resentful that the father eventually wanted a relationship with his daughter but not her. She shouldn’t even be involved in OP’s outings with her father and needs to stop inserting herself in their relationship. NTA obviously and sounds like OP struck a nerve with her insult so there’s clearly some truth to it. \n\nAlso, I’m pretty shy and quiet too and I still occasionally ask my husband or my sister to order for me in restaurants if it’s hectic or I’m overwhelmed. Social anxiety is a real thing.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 628,
                      "content": "This could be my mother who is a full blown narcissist. My parents are still married and she is extremely jealous of my relationship with my dad. To her, my Dad is supposed to give her his exclusive attention. She had kids so we could revolve around her like the planets around the sun. She has always put me down, lashed out and criticized me. It wasn't until I had therapy that I realized it was due to jealousy - I was the closest out of 4 kids to my dad and she was livid my dad wanted to give me attention. Plus my mother, like OP's is absolutely controlling.\n\nOP should do what I did and cut that toxic mother off.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "Definitely sounds like jealousy. My mom used to say “he left us” in reference to my dad, and I would always make a point to clarify that he left her but not my siblings nor I. He fought tooth and nail for equal custody of us and would drive 8 hours roundtrip to our out of state dance competitions even when it wasn’t his weekend and he didn’t even get to see us face to face, just on stage for a few minutes. My mom could never admit that it was just her he didn’t want in his life, and I honestly think she was jealous that he still wanted to be in ours.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "I’m a loud mouth and I hate ordering at restaurants so don’t ever feel bad for that",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 161,
                  "content": "OP, did your mom act like this at all before your dad came back into the picture?",
                  "id": 9,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Happy cake day",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 264,
              "content": "Because she sees her own daughter as a rival for his affections.",
              "id": 11,
              "comments": [
                {
                  "score": 185,
                  "content": "Yuck. But I agree. My guess is that mommy dearest is jealous that the dad contacted OP and wanted back to her life, but he didn't want back to mom's life. So she's angry that he left her, angry that he doesn't want her and she sees her own daughter as a romantic/sexual competition for OP's own father's affection. Frankly, I think long past the time to cut contact with the mother.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Yup, gross but sounds accurate. Some parents are like this and unfortunately for OP, her mom exhibits the signs.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "Some women turn on their daughters after they hit puberty - they see their daughters as competition when it comes to the men they’re interested in, including their daughters own fathers and regardless of wether or not the daughter is actually interested in these men. It’s sick.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Because she’s the kind of twisted and gross person that sees her as competition. She’s literally treating OP like she’s the dad’s current gf 🤢",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "It's a weird tactic of insecure women. She doesn't see her daughter as her daughter. She sees her as competition. It's gross.",
              "id": 16,
              "comments": [
                {
                  "score": 4,
                  "content": "Gross & insane.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Because she doesn’t want to believe she was the reason he left. It was the kids. That’s why he left. And him wanting a relationship with his kids, let alone with another female is too much. So she constantly has to bring it up and put OP down. It keeps her delusion intact while the exact opposite is taking place right in front of her eyes.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I was wondering if she thinks it makes her look better...like \"look at what I had to put up with all on my own!  See how much they needed you around.\"  Who knows--she's crazy.  OP needs to go see dad without mom.  I would have done that after just the first time.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I don't understand how insulting her child works. I mean, she's half of OP also. Plus, with OP's mum getting custody of OP for her life, wouldn't that just end up with a \"Yeah, but you raised her\" type of thing?",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "And i even more don't understand why she think that tactic works in the first place. Even praising her child and says \"I raised her to be like that\" have much bigger chance to works.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 276,
          "content": "My mom is just like this - put downs, lies, and all. She does it because she is insecure and has a junior high mentality, thinking it makes her seem funny and cool and \"not like the other girls.\"\nI don't talk to her anymore.",
          "id": 22,
          "comments": [
            {
              "score": 100,
              "content": "Same. My mom also clearly competes for my dad’s affection when I’m around- the last noticeable time- he was going to help be draw out a renovation project and my mom declared that she wanted to start demo on her own project right then and there, and forced my dad to get up from the table and go tear out walls, despite having no previous plans to do so.",
              "id": 23,
              "comments": [
                {
                  "score": 46,
                  "content": "Yes girl! When I still came around, she couldn't even stand for me to have a conversation with my dad that she wasn't involved in. I'm sorry you have the same shitty mom as me!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "You have whats called a narcissistic parent",
              "id": 25,
              "comments": [
                {
                  "score": 17,
                  "content": "Oh trust, it goes far beyond that. That is one facet of her myriad issues though.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Yep.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "True. Trigger alert!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Same! My mom is just like this. I stopped talking to her and life has been better without her.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Sounds like mine 🙄",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Reading this post gave me vibes from [this essay](https://sites.google.com/site/harpyschild/) that someone linked in another AITA thread yesterday. Especially the part where OP called out her mom for acting inappropriately during the first meeting, and was then immediately \"punished\" for it when her mother started trying to sabotage the reunion.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "OP mom is lashing out on OP not to take her down for the sake of taking her down. The real reason is because OP took her father back after his long absence with no questions asked. The mom resents OP for that and to mom’s perspective, that IS a sign that OP is a weak person. That’s probably why she accused the dad of cursing her with such a weak daughter. The restaurant scene when OP didn’t speak loud enough was another example of how OP wasn’t strong enough - like she couldn’t even get the attention of a waiter.",
          "id": 32,
          "comments": [
            {
              "score": 12,
              "content": "And that can't possibly be her fault that she's \"weak\" so it's dad's fault",
              "id": 33,
              "comments": [
                {
                  "score": 2,
                  "content": "I don’t think it precludes the mom self hating herself too that she raised a daughter so spineless.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 2,
                      "content": "What's preclude mean",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "NTA is right but it really does sound like you're mum is a bit all over the place mentally. It couldn't have been easy for her partner to up and leave when she had small children to raise alone.\n\nThen for him to just come back out of the blue after 18 years, the amount of anger and resentment she must have is off the scale.\n\nIt also sounds like she never really got over your dad or had closure. I cant tell if she's trying to put your dad off you so that he goes away, or if she's doing the classic thing of putting you down so she seems better.\n\nTheres no doubt your mum is the A, it does sound like she needs help though.",
          "id": 36,
          "comments": [
            {
              "score": 29,
              "content": "Yeah, but OP can't control her mom, but now that she is an adult, she can control whether she allows her mom to treat her poorly or she walks away. OP deserves better.",
              "id": 37,
              "comments": [
                {
                  "score": 21,
                  "content": "To clarify, I'm in no way saying this is OPs responsibility, just noticed how sad this situation is.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I agree, I understand OP’s perspective and the mum’s behaviour is not OK, but I feel like there is a lot of glossing over the dad leaving, the mum getting full custody (that wouldn’t be for no reason) and him not caring to know his kid till she was 18. He is not exactly squeaky clean here.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "What's mind boggling to me is how the rest of her family thinks\\* she was an a-hole for hurting her moms feeling? Like... wtf? OP's the one whose getting insulted constantly and they didn't bother to tell her mom to knock it off but instead get upset at OP?!?!?!\n\nedit: misspelling",
          "id": 40,
          "comments": [
            {
              "score": 10,
              "content": "Exactly this. It's okay for her mom to insult and make fun of her but God forbid OP say the truth back.? So twisted.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "In my experience, this happens when the parent acts like a child and throws tantrums so the family wants the child to act like an adult and be the bigger person so that no one else has to deal with the parent.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That is the job of a flying monkey! Focus the attention on OP outburst and ignore the mom’s poor behavior! This is classic!",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "To add to this. I see why op’s dad left the mom. Op you are NTA but your mom is a huge one. She’s totally jealous that your dad is choosing you. Never being her to see him again. Never tell her when a meeting will take place. You said the truth. If the truth hurts her that’s on her. I’m proud of you for finding your voice.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "She's jealous. She wants him to want her again so **she** can be the one that walks away, and him being close to OP makes her jealous because it isn't letting her get the attention. Now, he's interested in giving his affection to someone and he won't be hurt by it, which she probably believes he deserves.\n\n&#x200B;\n\nEDIT: Should mention the reason why she's putting OP down is because she probably thinks if she makes OP look bad the dad will walk out on her again, so she'll be able to show what a dirtbag he is.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "She's childishly jealous, it sounds like.  \n\nOP, you did nothing wrong.  You finally stood up to someone who is being harmful and cruel to you.  \n\nNTA",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She is jealous and petty of the fact that the father wants a relationship with OP and not her. I’m guessing neither the mother, nor OP had any form of therapy after the father left to help process things.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "On top of that you figure OP has met with dad since she was 18.  OP with a Bachelors so ideally 4 years, maybe 5 years if it was difficult to complete of mom belittling her in front of dad.\n\nEdit:  can’t type today.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2122,
      "content": "NTA, your mom is a giant one though. You really need to get her out of your life. Does your dad believe her about that stuff",
      "id": 49,
      "comments": [
        {
          "score": 340,
          "content": "Exactly NTA its baffling that your mom is jealous that your dad wants to give you any attention and 5 hours doing makeup is absolutely ridiculous. What you said was harsh but after all you put up with it was needed.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "THIS OP, go NC until you’ve worked through the damage she’s caused you. Your mom is a horrible person to treat you like this and I’m so proud of you for standing up for yourself. I don’t think anyone would blame you for never speaking to her again. She’s 100% toxic. NTA",
          "id": 51,
          "comments": [
            {
              "score": 59,
              "content": "Sounds like OP has two awful parents.",
              "id": 52,
              "comments": [
                {
                  "score": 22,
                  "content": "I wonder if dad stayed away because mom was so toxic.  Dad can’t seem to stand up to her at all.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 101,
                      "content": "That is a piss weak excuse to be way from your kid. Don't give him the benefit of the doubt.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "A toxic co-parenting relationship is brutal but it’s not a reason to not be there for your child’s life.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yup.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -17,
          "content": "Leave it to Reddit read a couple paragraphs about someone's life and decide they need to cut off their family forever. Sorry but I have to downvote this unsolicited advice. While I completely agree that OP's mom is TAH in this situation, OP also only has one mom and didn't at all mention considering cutting her out. Really surprised this one of the top comments. \n\nGood luck to OP and hoping you can get some piece of mind knowing that you have been very calm and mature in all of this and your blow up towards your mom was way overdue.",
          "id": 57,
          "comments": [
            {
              "score": 2,
              "content": "ITA this sub always recommends going nuclear. \"What you're husband didn't do the dishes? You need to divorce that man! 👏\" While I agree the mom sucks here, she was the one that raised op and they should try to work through their issues. Maybe go to therapy. Maybe she should go NC but there's no way we can know that from one post.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 939,
      "content": "NTA you were not wrong in the least. I’m surprised that when she spent all that time putting you down in front of him that no one pointed out that she was the one who raised you. \n\nWhy did you allow her to go with you to visit your dad? I think it’s time to cut her out of your life. You’ll be better off without her. She is obviously not over him. I’m pretty sure her behavior is a component of why he left her.",
      "id": 59,
      "comments": [
        {
          "score": 102,
          "content": "Plus when someone puts down someone else, like OP's mother, she is not making OP look bad, she's making herself look like the AH she is. So don't worry about the stuff she says, it just shows who she is. Add the fact that it's about her own daughter and you have a true-blue asshole all the way through. I'm so sorry OP you didn't get the mother you deserve.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Yeah, I don't even understand why OP let her mother accompany her after how she behaved in the very first meeting. Like that should've been the last time OP brought her.\n\nNTA.",
          "id": 61,
          "comments": [
            {
              "score": 7,
              "content": "Her mom would have made life absolute hell if the OP tried to put that boundary in place, likely *any* boundary, but especially this one. I'm not surprised the OP hadn't quite learned to stand up against her mother's abuse up until this point, and I hope she continues down that path.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "I think this is maybe the mum's point. She had to raise her on her own. Maybe she's trying to point out that the dad left and she needed help raising her? I.e. Dad is the fault for all her problems\n\nMum sounds like she's struggling quite poorly with her jealousy and misses the man she was going to spend the rest of her life with. Even if its 20 years, it sounds like she is still hurting. Although, that doesn't excuse her actions.\n\nI think you need to talk to your mum and ask why she's being an AH. And then also just see your dad on your own. I mean he wants a relationship with you, not your mother?  Don't just cut her out your life (like alot of said on here) but set some boundaries and let her know why your angry with her. \n\nI think you were harsh to say that in front of everyone but understand it had reached breaking point. \n\nYou're NTA by the way",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 648,
      "content": "NTA and I don't quite understand these E-S-H votes. Your mother is constantly belittling you and acting like a spoiled child. Standing up for yourself doesn't make you an AH despite what spineless redditors who clutch their pearls about \"ReSpEcTaBiLiTy\" say.",
      "id": 64,
      "comments": [
        {
          "score": 340,
          "content": "Because people from functional families tend to not understand how dysfunctional families work and 'but faaaamily' mindset very often.",
          "id": 65,
          "comments": [
            {
              "score": 100,
              "content": "Or default to claiming everyone should always be polite always no matter what crap they have to deal with.",
              "id": 66,
              "comments": [
                {
                  "score": 24,
                  "content": "Agreed. I'm sick of people demanding that people who are being treated like shit be civil to the people that are treating them like shit.  As far as I'm concerned, anyone demanding civility in these circumstances are also the assholes.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Very true.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I question how functional their family really is then. My mother would never disrespect me like that so seeing someone else’s do it is shocking to me. I know what it’s like to have a healthy relationship with my family so if someone defends this type of toxic behavior I assume they’re from a toxic family.",
              "id": 69,
              "comments": [
                {
                  "score": 36,
                  "content": "I think it's partially people from dysfunctional families that have very toxic relationships with \"the elders are always right and you need to suck it up and respect it\" and partially people that are from functional families but just incredibly stupid when it comes to understanding the perspective of others, can't grasp why family would be toxic to eachother so everybody must be in the wrong.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I would go with E S H only because OP keeps bringing her mother to those meetings. at this point SHE is responsible for all the incidents when her mother ruined everyone's mood. she should've learnt her lesson years ago and never stepped her foot again in one building with her mother and father both present. she's an AH to herself.",
          "id": 71,
          "comments": [
            {
              "score": 20,
              "content": "That's actually a really fair point. For some reason I was thinking OP only brought her mom to the first one and then her mom started being intrusive but I went back and read it. I can't stand people who enable shitty behavior and then want to do a surprised Pikachu face when the shitty behavior continues.",
              "id": 72,
              "comments": [
                {
                  "score": 33,
                  "content": "Eh, I wouldn’t be so hard on OP for enabling her mother.  When you’re raised by someone like this (with a personality disorder), most of their behavior is normalized, and you’re conditioned from an early age to work your entire life around their fragile feelings so they don’t find a reason to berate you or otherwise make you miserable.  I mean, she was raised by that, so it takes a long time to reach a tipping point because of how you were brought up.  I unfortunately know from experience...",
                  "id": 73,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I agree that it's hard! My mom has NPD and refused to seek treatment for it past initial diagnosis and I had an extremely abusive ex who refused to continue with treatment for ASPD so I know what you're saying (as a side note for other redditors, these diagnoses aren't automatically a bad thing so please don't turn this into an anti-personality disorder pileon; they're only a bad thing if you refuse to take steps to treat the harmful aspects that are hurting others). I finally went NC for good with my mom in the past couple years and I'm probably projecting some of my frustration with myself for enabling my mom onto OP.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -7,
                      "content": "> I wouldn’t be so hard on OP for enabling her mother.\n\nHow else are they going to get the thing staring them in the face through their thick head?\n\nThe OP entirely created this situation and acted in a way which gave the abuser public sympathy. If we aren't hard on them in the correct direction then how are they ever going to run into a reasonable opinion ever again, considering the way they react to stress that they themselves are enabling.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I totally agree. She is a grown woman who should have just seen her father on her own. I'm also curious if her father ever stood up for her. She doesn't mention that. If he didn't I'm not sure I would have wanted to keep seeing him either. We are talking about a very dysfunctional family.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "That’s insane. If you’ve never had a narcissist parent, you can’t understand.",
              "id": 77,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "If Mum had OP when she was a teen then she maybe mentally defaulting to that age when around men she wants. The brain subconsciously knows what worked the first time and so tries to steer you to do it that way again.\n\n Regardless, it is unacceptable and a little honest reflection on the Mum's part would give her 'second thoughts' on her actions and the chance to correct them. But she doesn't want to. She would rather lose a daughter at the chance of getting 'her man'.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[deleted]",
          "id": 79,
          "comments": [
            {
              "score": 1,
              "content": "Everyone Sucks Here",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 429,
      "content": "NTA, your mum is clearly jealous that your dad wants a relationship with you and not her, you need to start spending time with him without your mum.",
      "id": 81,
      "comments": [
        {
          "score": 29,
          "content": "this is exactly what I was thinking when I read this, shes mad that you can have something she cant.",
          "id": 82,
          "comments": [
            {
              "score": 5,
              "content": "she got so mad because it’s true",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "This was what I thought when I read it.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 247,
      "content": "NTA - is sounds like your mom is jealous that your father is giving you attention. She's behaving like guys I knew who would insult and embarrass their friends to try to get a girls attention. Your mom is behaving like a child and honestly, this relationship is between you and your father and has nothing to do with her.",
      "id": 85,
      "comments": [
        {
          "score": 37,
          "content": "I agree. It’s almost like she’s acting like they are rivals for his attention.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 242,
      "content": "NTA but stop inviting her to go when you spend time with your dad. They are ex’s and there is really no need for her to go since you are an adult. She’s going out of her way to ruin your time together and is trying to sabotage the relationship you are trying to build with him. Don’t apologize and let her know that if she continues to put you down and talk bad about you then you will continue to stand up for yourself.  I’m honestly curious why you choose to spend time with her if treats you like she does and talks so bad about you. I mean really, what would you be missing?...  at the very least you should put a stop to her including herself on you visits with your dad",
      "id": 87,
      "comments": [
        {
          "score": 82,
          "content": "Absolutely agree with this.  NTA OP, but stop telling your mother anything about your relationship with your father.   \n\nMeet with him when she is not around.  You don’t need her there, as you are an adult.  Your father is probably tolerating her presence for the sake of seeing you.  I doubt he enjoys her being there.\n\nPS Your mother’s insults to you are not acceptable.  She is being verbally and emotionally abusive.  I hope she doesn’t continue to act like this when your father is not there.\n\nEdit:  thanks for the gold!",
          "id": 88,
          "comments": [
            {
              "score": 10,
              "content": "It sucks this comment is so far down. OP has been brainwashed by psychomom about dad all along. OP not only needs to stop talking about anything important around her, but needs to find or craft ways to slowly fade away rather than just cut her out. Mom sounds crazy enough to do some horrible or drastic things if confronted about it. I can’t imagine living with a single parent that belittles me to other family and people *in front of me!* I’d also probably hide my relationship with dad (and anyone else important) and make sure he does the same, or mom will just find a way to fuck with everyone to death. Such a shitty situation.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "If they separated 26 years ago then why is OP letting her mom dictate ANYTHING. I'd suggest therapy, allowing this level of parental control in your mid to late 20s is beyond unhealthy.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "NTA.  Your mother is a narcissist who blames you for the loss of her husband.  She’s toxic to you but you have accommodated her.  Eyes wide open are appropriate now.  She will never have your best interest at heart.",
      "id": 91,
      "comments": [
        {
          "score": 3,
          "content": "THIS\n\npoor kid",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "NTA. Shes being a bad Mom and intentionally hurting you. This isnt someone you want to keep actively having a relationship with. Shes shown you who she is and what she thinks of you",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 89,
      "content": "So do I understand it right?\n\n1. Your dad left your mom and in the process you as well.\n\n2. After quite a few years he wants to get to know you, which you agree.\n\n3. For the first meeting you ask mom to come with you.\n\n4. Ever since that she not only invites herself to your meetings, but tears you down in front of your dad.\n\n5. When you get enough of the abuse and retaliate, your \"family\" is mad at you???\n\nWTF???\n\nNTA, and I would go LC with them if I were you.\n\nQuestion: what did your dad say?",
      "id": 94,
      "comments": [
        {
          "score": 117,
          "content": "My dad feels extremely uncomfortable when she makes comments. But he stopped telling her things because when he tried standing up to her, she started talking bad about him to my brother and i and she nearly ruined his relationship with my brother.",
          "id": 95,
          "comments": [
            {
              "score": 114,
              "content": "Am I wrong in thinking that maybe he left her because of how she is, and decided to try to come back into your life after you were 18 so he wouldn’t have to deal with her?\n\nAnd definitely NTA.",
              "id": 96,
              "comments": [
                {
                  "score": 40,
                  "content": "I was thinking the same thing. That woman sounds like a bloody nightmare",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "With how manipulative the mom is I'm wondering if the reason he wasn't in his kid's lives wasn't his choice.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Definitely this!",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Why do you still involve her in your relationship with your dad. The way you tell about her behavior makes me want to wonder if what she told you about why he left is actually true. Him coming back at 18 sounds more like he tried to get involved at a point where your mother could no longer legally make decisions for you and she is trying everything she can to keep you from doing so. Stop taking her with you and maybe start asking dad how much of what your mom has told you is actually true. You have a perfect example of how she tries to belittle others and talk down about them to tarnish relationships being on the receiving end of it now yourself. NTA but stop involving her.",
              "id": 100,
              "comments": [
                {
                  "score": 6,
                  "content": "That's a good point. Part of the reason she may be demanding she come with is so that OP can't talk to her dad alone. She might be afraid of what her dad will tell her is she's not there to bully them both.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "She's a narcissist. Get her out of your life. Chances are no other family members know what she says about you. I'd tell them what your mum is really like",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "For fucksakes go no contact with your emotionally abusive mom.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "INFO: \n\nOP, why do you insist on bringing your mother along to your meetings with your Dad?\n\nYou don't want your mother there. Your Dad doesn't want your mother there. So why are you bringing your mother along to those meetings, where she is not wanted, and where she proceeds to sabotage and cause chaos?\n\nYou are an adult now; grow a spine and stop letting your mother dictate what happens in your life.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> when he tried standing up to he\n\nWhy are you enabling his continued abuse by passively accepting exposing him to her so that he can have access to you?\n\nWhy are you enabling your continued abuse by passively accepting exposing yourself to her for no benefit whatsoever?",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Honey, she emailed you dad lies about you.\n\nOnly a sick mind can do that.\n\nI'm so sorry.\n\n♥",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}