{
  "post content": "My gf (29) and I (30) have been together for about 5 years now, and finally agreed to move in together since her lease is up next month and I love her. I recently bought my house, and since she's lived in places with no pet rules, she asked if she could finally get one as a move in present, and I readily agreed. I also love pets, and figured this would be a good thing for both of us. \n\nMy only condition was No Cats. \n\nI have nothing against them, in fact I had one for three days myself right out of college, but I had to give her back because I could barely breath and my skin turned a different color because it was decaying (she slept on my leg, and the contact is what caused this). I have what's called a \"prolonged exposure\" allergy, where I'm ok for a couple of hours around the cat, but when the allergy does it, it hits hard and is super bad. I have no clue if it's all cats or just the one cat, and so I've avoided having them ever since. \n\nI explained this to my gf, and she agreed. Two weeks go by, no issues as she unpacks and gets settled. I figured another few weeks, let everything die down some more, and then we'll go get a dog, or a hamster, or maybe a bird. I'm not picky, I love animals. \n\nI leave for work, and when I come home, there's a damn kitten trying to rub against my ankle. \n\nI try to not freak out, thinking it was a stray my gf found and she was just housing it until the shelter opened tomorrow, but no. My gf spent $300 on a kitten because \"she's so cute, and so friendly!\" \n\nI put my foot down. Yes, the kitten is cute, but I refuse to have an animal that could kill me in the house. I told her that she has 3 days to take the animal either to the pound or back to the store when it opened on Monday, or I will. \n\nWelp, Tuesday morning, kitten was still there, adoption paper had been destroyed by her, and so I had had enough. Already had breathing problems, so I did some research, gathered up Mittens, and took her and all of her things to a local cat sanctuary. The guy who took her understood completely, happily accepted the donations (I even threw in some cash, since he's doing good work rehoming these sweeties), and promised that such a sweet friendly kitten would quickly be rehomed. I did think while gf was asleep, to ensure she wouldnt stop me.\n\nMy gf burst into tears and left for a friends house. She demands an apology before she comes home, and while most of our friends agree I was in the right for my safety, I should have at least let her say goodbye. I say that the cat shouldn't have been there in the first place, I gave her the option, and so she's the one who owes me the apology. \n\nAITA, or was she?\n\nUpdate- so, just for timeline clarification. Found out about the kitten Friday the 15th. This happened this Tuesday, the 19th. I had my entire place deep cleaned by my friend, who owns a cleaning company, Thursday. The patch of skin on my stomach is still cracked, discolored, and leaking blood and puss everywhere, despite me keeping it clean and bandaged. I'm seeing my primary care dr Tuesday, and planning on the ER if it gets worse. \n\nStill trying to decide what I'll do about the gf. She still technically has two weeks left at her old apartment, so I'm tempted to just hire some movers to take her furniture back there and call it on this relationship. This isnt the first red flag, though it's for sure the largest. But after talking it over with my friends, and having them help to point out a lot of other shitty things she's done that cant just be chalked up as mistakes, yeah. I'll give yall another update if anything happens in the next day or so, but yeah. Sucks, but at least in this case I'll live.\n\nEdit 2: Went to urgent care this afternoon, and I've got a pretty bad infection, despite my best efforts. On antibiotics now, but not what I needed to be dealing with atm. \n\nSo, I went ahead and told her I'd need my key back, and she'll have to pay to get some movers in to get her stuff out of my place. After reading through a lot of comments and talking to friends, this relationship has to end. I told her this, she freaked out and immediately drove over, trying to apologize and beg for me to let her stay, since she apparently already turned over the keys to her other apartment two weeks early and ended the lease. First thing I did was show her how bad my stomach still was, she threw up, and while she was doing that I took my key off her keyring. I let her in to pack some of her things, and it hurt to watch her cry as she packed over \"a dumb fucking cat\" (her words, not mine), but then still told her to GTFO. \n\nI posted a picture of my stomach in the group chat with all of our mutual friends, and they very quickly turned on her. She's no longer allowed back at the friend's place where she was staying, which means she'll have to find a motel or something until she finds other accommodation. I guess they didnt know my allergy was that bad, and now that they do know, they're pissed. \n\nCherry on top, the guy who runs the cat sanctuary called to let me know Mittens has been adopted to a wonderful family, and he doubled with some laywer friends of his. In my country, if you dont have proof of ownership, then the cat is legally a stray, and no one owns it. Since my gf, who moved here from America, destroyed the papers and had never taken the cat to the vet, Mittens was free to be adopted to anyone who would take her. So hopefully Mittens has a good, long, healthy life.",
  "id": 1,
  "comments": [
    {
      "score": 3953,
      "content": "ESH. The correct action was to dump the GF and let her take the cat with her. Not dump the cat and keep the GF.",
      "id": 2,
      "comments": [
        {
          "score": 1990,
          "content": "I would agree with you, but he literally told her that if she didn’t get rid of the cat by a certain day that he would get rid of it himself. She knew what would happen and did not do anything. If she wanted to keep the cat that badly, she should have moved out.",
          "id": 3,
          "comments": [
            {
              "score": 2082,
              "content": "Him: Get rid of cat by X day or I will. \n\nHer: You're bluffing\n\nHim: Calls bluff\n\nHer: surprised pikachu face",
              "id": 4,
              "comments": [
                {
                  "score": 337,
                  "content": "It starts with:\n\nHim: anything but a cat.\n\nHer: brings a cat.",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 314,
                  "content": "Haha exactly, op is definitely better off without her.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "That doesn't make him not an AH here...\n\nShe is (also) an AH no question. A massive one.",
              "id": 7,
              "comments": [
                {
                  "score": 758,
                  "content": "It actually does indeed make him NTA. This cat legit has the ability to kill him. He said no cats, he then gave her a ton of time to get rid of it and he told her he would if she didn’t. She then didn’t get rid of it, so he took it to a great place to have it relocated and he even donated money. This guy did legit everything right, the only thing I would have done differently was maybe let her say goodbye.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 584,
                      "content": "Not only did she keep the cat KNOWING it would severely impact OP's health but she destroyed the adoption documents so it couldn't be returned. She didn't just passively call his bluff; she actively tried to ensure the death kitten stayed. I agree OP is NTA and he showed he does love all animals by the care he took relocating an animal that could kill him.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 144,
                      "content": "NTA  The biggest problem is that he said no cats, explained that he was allergic and yet she still got a cat.  Clearly, he does not matter.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "He was definitely more patient than I would’ve been in a situation like that. Living 4 days with something that can legitimately kill you? I’d say you have to take it back like, right now. He is in no way the asshole",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "He evidently had to go to the ER for the thing because a cracking rash appeared. He is 100% NTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -71,
                      "content": "The problem is that it’s controlling. It’s controlling on the gfs part too, not respecting his health and bringing a pet in behind his back, but two wrongs don’t make a right.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -100,
                      "content": "It's not his cat to re-home.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 171,
                  "content": "I completely disagree. If this were say a peanut allergy noone would have a problem saying HE is not the asshole. Due to the fact it was a cute kitten -who he carefully placed in a (what I suspect to be) a no kill shelter - mean people view him as an asshole..... he is far from an asshole in this certain situation.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Honestly, the fact that it was a cute kitten that was very likely healthy, it’s probably already been adopted at this point. The kitten would’ve been perfectly safe even if it had been dropped off at a kill shelter. Kill shelters almost never euthanize young healthy cute kittens unless they’re really really really overcapacity and/or the kitten isn’t wean and is way too early to wean. Seriously though, kittens go quick in shelters",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 154,
                  "content": "I'd disagree. He had told her that he's potentially deathly allergic to cats, that he won't have one in his house, and he'd be re-homing the one brought to him in X amount of days. \n\nShe's solely responsible for everything that's happened with that cat.",
                  "id": 17,
                  "comments": [
                    {
                      "score": -101,
                      "content": "It's not his cat to re-home.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": "It absolutely makes him NTA. \n\nDon’t bring home a cat I could die. \n\nBrings home cat. \n\nGet that cat out of here or I will. \n\nWaits until after the deadline, and then has the balls to be surprised. \n\n\nThis is not rocket science. It’s not a morally grey situation either. There’s right and there’s wrong, and OP is not in the wrong. NTA. Whatsoever.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Shhhh this sub loves finding reasons to call the dude the asshole. She did everything wrong and was selfish, he did everything right and correct, but is somehow still just as bad as her.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "I have a prolonged exposure allergy to cats similar to OP. My skin doesn't rot off, but I do become immunocompromised to the point where my body can't fight off normal infections. I've ended up staying overnight in the hospital before because of this. OP is not TA in the slightest. He gave her 3 days to say goodbye. 3 days of literally endangering his life and his health in an effort to let his girlfriend say goodbye. He's not obligated to endanger himself any further.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Holy cannoli. I had no idea this was possible, but I did become immunocompromised the year we got our dog, and was extremely sick throughout her life. We just assumed I picked up some virus or something. We had her 17 years and since she died, I have been somewhat better (not great, but better) but I never put the two things together till now. I know I was allergic to her - when she licked me, my skin peeled off - but I had no idea that the immunosuppression could be an allergic thing.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yes it does. The whole agreement for her to move in was no cats because he has a dangerous allergy. Did you just choose to skim over that? \" I could barely breath and my skin turned a different color because it was decaying\". In the update it's worse. So yes. He is not the asshole. She is the asshole because she would have known about that before getting the cat. The whole, he should have let her say goodbye is bs too because he told her that he will get ride of the cat on a ceartin day. It is not his fault she choose not to believe him. He is NTA and she is the TA. He should dump her ass.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "So he should just live with this cat which he's allergic to? What?",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "How is he an asshole?",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "uhh good one.. I would have done the same thing as the bf. Ouch!",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "She destroyed the adootion papers thinking that it would prevent him from returning the cat. Didnt thinknhenwould fo and donate it I guess.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah was gonna say this but scrolled down and saw you wrote this but yeah this",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "he should have told her if she didn't get rid of the cat by a certain date they were breaking up instead.",
              "id": 29,
              "comments": [
                {
                  "score": 2,
                  "content": "Maybe he thought she would be a decent human being and get rid of the cat that he told her not to get because it literally can kill him. If they were at the point of moving in together, he probably wasn’t at the point to break up with her yet. He gave her enough time to find the cat a home, and say goodbye. If she had no intention of doing so, SHE should have said that she would just move out. Instead, she acted like a child, destroyed the adoption paperwork and cared more about herself than her boyfriend’s life.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "Yeah but their relationship is probably going to be deeply damaged by this. She could contact the sanctuary and decide if she wants to adopt it without the BF, that would be fair.",
              "id": 31,
              "comments": [
                {
                  "score": 27,
                  "content": "[deleted]",
                  "id": 32,
                  "comments": [
                    {
                      "score": -1,
                      "content": ">What’s fair is that she gets on her fucking knees and apologises \n\ni don't think sex will fix this.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -15,
                      "content": "This is inevitably going to lead to a breakup anyway. If OP gives the sanctuary info, she could have more choice in the matter. Chill out my guy",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Their relationship was already deeply damaged by her \\*knowingly\\* bringing an animal that could kill him into the house.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -64,
              "content": "it’s still theft. kick the gf out but do not steal her pet and rehome it. under no circumstances is that ever ok and you are always the asshole for doing it.",
              "id": 36,
              "comments": [
                {
                  "score": 46,
                  "content": "I understand your point of view on this. But I still don’t think op is the AH. In my opinion, it is her actions that led to this result. I’ll kindly agree to disagree on this one, because the line is definitely fuzzy with this one.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "OP is allergic, it was not safe for him to continue to live with the cat. It would be different if he just didn't like them, but it is absolutely okay to remove something from your own home that is risking your health.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Exactly what I wanted to say! It’s really unfair to call OP an AH for removing something that will kill him.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Theft versus attempted murder. Hmmm, I wonder which one's worse. /s",
                  "id": 40,
                  "comments": [
                    {
                      "score": -12,
                      "content": "They are both AH behavior though...",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "[deleted]",
          "id": 42,
          "comments": [
            {
              "score": 74,
              "content": "What is wrong with her? If someone tells you they have a serious allergy to something, you don't ignore it and get what you wanted anyway.",
              "id": 43,
              "comments": [
                {
                  "score": 8,
                  "content": "I don't get it at all, my bf has an allergy to cats, nothing too serious but why would i want to have something that makes him ill? As much as I'd love to have a cat I love him not being ill more.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Yeah but I mean this is not even a boundary. This is a life threatening allergy which she knew about and completely disregarded because she thought the kitten was cute. Not wanting something around that can kill you isn't a boundary, it's life preservation.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 89,
          "content": "Why does OP suck? He gave her time and options. Was he supposed to die in his own home????",
          "id": 46,
          "comments": [
            {
              "score": 81,
              "content": "Yeah, that this is the top comment is baffling. He should have given her 24 hours MAX and then taken it to the sanctuary, not 3 whole days! Telling the GF to leave with the cat would have probably taken longer. \n\n\nI mean really. It’s been like a week now and his skin is still leaking blood and pus to the point that he may need to go to the ER?? People here really want to minimize his allergy because he doesn’t immediately go into anaphylactic shock.",
              "id": 47,
              "comments": [
                {
                  "score": 29,
                  "content": "It's like men choosing not to die makes them assholes to some people.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I read it as more \"you handled this incorrectly, you should dump the GF\" but kind of trying to say it cheekily. Like when some people comment \"YTA for missing all these giant red flags\" when the other party is so clearly the asshole that it makes you question the OP's intelligence. I think this comment just didn't quite pull it off and people think they're actually saying OP is somehow an asshole here.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Welcome to this sub, home of the this sub, can I take your order",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -3,
                      "content": "Literally nobody is saying that, don't be hyperbolic. he could have dropped the cat at parents/friends of hers, and then dumped her for not giving a fuck about his safety.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "No just supposed to kick out the girlfriend with no warning making her homeless",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -5,
              "content": "No, but it's her cat. You don't give away other people's possessions. He should have dumped the cat at her parents/friends and then kicked her out to go be with her cat.",
              "id": 53,
              "comments": [
                {
                  "score": 3,
                  "content": "It became more than a mere possession the moment OP told his GF of his severe and potentially lethal allergy. \n\n\n\nDo you allow things that slowly kill you around and inside your home?",
                  "id": 54,
                  "comments": [
                    {
                      "score": -4,
                      "content": "Are you being intentionally obtuse or do you just lack reading comprehension? Reread my comment and tell me if I said he should allow it inside his home.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "NTA. OP has to remove the cat for his own health IMMEDIATELY. No telling if the GF leaves if he dumps her. This was the best move and GF is the massive asshole here.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "That’s what I’m thinking",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Doesn't she technically count as a tenant and in whatever legal amount of time she has in that house before eviction/end of tenancy could have killed OP?",
          "id": 58,
          "comments": [
            {
              "score": 13,
              "content": "[deleted]",
              "id": 59,
              "comments": [
                {
                  "score": 0,
                  "content": "She isn't a squatter though. She was invited to live there. She is a tenant.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[removed]",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "No she’s not, because she still had a valid lease somewhere else.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "This is a terrible judgement. \n\nShe had 3 days to leave if she wanted and she instead decided she wanted it all at the risk of OPs health\n\nSo no OP is not an AH at all for trying to protect himself considering the 3 day warning he gave her",
          "id": 64,
          "comments": [
            {
              "score": 2,
              "content": "I think OP is sort of saying that he’s an asshole for not dumping the gf in a tongue in cheek way.",
              "id": 65,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "If the cat wasn't causing a skin infection of this degree I'd agree but its caused an area on his stomach to become cracked, discolored, bleeding and leaking puss. Imagine what would of happened if he had to keep fighting her to leave first, it sounds like he was on a fast track to the hospital.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah I don’t agree with this at all.  If I had to give it a scale, it’s 99% NTA 1% ESH.  Which rounds to NTA in my book.  I mean what else was the guy supposed to do.  He made clear how serious the issue was, clearly had symptoms right away because of her idiotic decision.  This wasn’t something he could just take a Claritin for and tough it out for a little while.  He made it clear that if she didn’t remove the cat, he would have to and he did as promised.  Was he supposed to continue suffering because of her idiocy?!",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Not every argument is solved by \"dump them\".",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2502,
      "content": "NTA\n\nI love cats, but your GF had no right to put you, and the cat, in that position.\n\nYou should also rehome your GF.  She doesn't respect you or have any care for your health.  Instead of apologizing, pack up her stuff and ask when she wants to come get it.",
      "id": 69,
      "comments": [
        {
          "score": 305,
          "content": "Yup do this. She's trying a power move with your health of all things.\n\nSo power move her out of the relationship.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Also buying a cat from a pet store promotes poor breeding praCTICES.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1418,
      "content": "NTA. Honestly, she sounds like the kind of person who would try to feed her grandchildren a deadly allergen because “it can’t possibly be that bad.”\n\nThere is something very deeply troubling about her decision making process here.",
      "id": 72,
      "comments": [
        {
          "score": 199,
          "content": "That lady was the worst, goodness. Yeah, NTA",
          "id": 73,
          "comments": [
            {
              "score": 7,
              "content": "Which one? I've lost track of all the dosing stories.",
              "id": 74,
              "comments": [
                {
                  "score": 25,
                  "content": "The one where a mother had twin daughters, one being extremely allergic to coconut oil. Their culture used it for everything so the grandma (mom's mom) thought it wasn't that bad and mom was being overdramatic. So when mom asked her to watch her twins overnight, grandma put coconut oil in their hair, braided it and gave her a Tylenol. The daughter didn't live to see the next morning\nEdit: I think, there are a lot of stories out there.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Oh, yeah. That is one of the most WTF/notorious stories ever.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Was the grandma arrested? Because that is messed up.",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "Yea, this actually reminded me of this story about a woman who's daughter was killed by her mother acting like a severe allergy wasn't real.\n\nA word of warning, it's a rather hard read, basically what happens when someone treats a severe allergy like it itsn't a big deal.\n\nEdit: Phrasing fix.\n\nEdit2: I've been informed that the OP who left the post I linked does not wish it to be linked further to avoid being doxxed, so I removed the link.",
          "id": 78,
          "comments": [
            {
              "score": 41,
              "content": "JFC, you weren't kidding about a hard read. That mum has much stronger composure than me, I wouldn't have taken it so lightly to simply cut the grandma out of my life and still recieve phone calls. I would have easily gone to jail for that.",
              "id": 79,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm telling you rn that if I were on your jury, I'd vote not guilty.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Ughhh I remember reading that post not too long ago... I can't believe people don't take allergies seriously.\n\nOP, you said so yourself, her bringing a kitten home, knowing full well you're very allergic, was a BIG red flag. Had you only been mildly allergic, in a very liveable way, even then, she would have done something bad, especially without your permission. You're allergic? Then you're allergic. That's it.\n\nWhat would she have done had you been sent to the ER with the kitten home? Would she have given it up for adoption? Or would she blame you for not telling her \"just how allergic you truly were\" and then leave with the kitten?\n\nIt was extremely childish and dangerous of her to bring one home, and now she must suffer the consequences of her actions. You are NTA. Yes, cats are cute, but your health is more important than her buying (not even rescuing or adopting) a kitten for her own selfish needs.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That just broke my heart.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm balling. Stupid fucking people",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I have never been able to read this from any link posted. I’ve gotten the gist of it, I’ve googled it, but the link is always broken.",
              "id": 84,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Am I the only one who can’t read this? I get a “server error tap to retry” every time I see this post quoted. I want to read it out of morbid curiosity because part of me still can’t believe it’s real....",
              "id": 85,
              "comments": [
                {
                  "score": 1,
                  "content": "Sorry, but I have no idea how to fix that :/\n\nEdit: I could send the entire thing to you in a DM, though it might be hard to read that way since it's quite long.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -2,
              "content": "[deleted]",
              "id": 87,
              "comments": [
                {
                  "score": 8,
                  "content": "No, it's not fake. The author of the original post contacted the moderators and personally requested that it be removed because it was stolen by third-party \"news\" sites and exploited by content creators who used it without consent and violated her wishes. She was afraid of being recognised and doxxed due to the identifying information referenced in the post and larger reach/audience of those platforms.\n\nBoth that OP and the r/JustNoMIL mods have requested that people stop linking the post (both from other websites and archives) a number of times previously, but it still gets continuously reposted. It got so bad that the sub had to warn any commenters who mentioned it for fearmongering because it is *literally* the worst-case scenario and extremely NSFW and traumatic.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I had no idea about that, and now I feel obliged to remove the link.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1116,
      "content": "NTA\n\nI'll be honest OP, I am a *die-hard* cat lover and came into this fully ready and willing to rip you apart over this, because the thought of someone doing this to me with my cat enrages me truly beyond reason.\n\nBut then you explained your allergy, and as someone who has a life-threatening allergy to peanuts, that fact changed ***everything***. The fact that your GF \\***IGNORED\\*** this allergy (especially after having it's severity explained to her) and adopted a cat behind your back is a **galling** lack of respect for not just you, but for your health and well-being as well.\n\nYou don't owe her a goddamn thing, and the fact that she could so easily put your health at this severe a risk? I would at least start *seriously* questioning the future of your relationship with her, if not break up with her outright.",
      "id": 90,
      "comments": [
        {
          "score": 172,
          "content": "Big time upvote here.  NTA.  I love cats too and it even sounds like OP could be into them if not for that one little problem.  Who’s life is more important, though?  OP gave the GF ample opportunity to right the wrong and when she didn’t, he took action where she did not.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "I'm the same. I read the title and came in expecting OP to totally be TA but the moment I read about his allergy, it was an immediate NTA. \n\nI can't even fault him for not letting her say goodbye. The cat was putting his health at risk and he'd drawn a totally understandable line in the sand. She chose to ignore that. Frankly, he's probably better off without a GF who cares so little about his health.",
          "id": 92,
          "comments": [
            {
              "score": 65,
              "content": "Also I feel like letting her say goodbye to the cat would have cued crocodile tears and further manipulation. It would have been next to impossible to get her to return the cat willingly. She never should have gotten the cat and was even generous in giving her 3 days to return it. If the face that OP had a life threatening allergy wasn’t enough to deter her...",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I think he gave her a chance to say goodbye when he asked her to find return or find a new home for the cat, because of his severe allergy, and gave her four whole days.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Even if he just didnt like cats, she should not have  gotten one and would not be an asshole for this. She moved into his house to live together and acts like he has no saying in what animal they should get? She is the asshole, even without the allergy thing coming into the picture.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, agreed.  I was ready to be really pissed off at the OP because you don't get rid of what doesn't belong to you unless it's either been abandoned by the owner or there's a serious threat to life and limb.... and, well, that second one sure applies here. \n\nIt's amazing how many stories we hear on here of significant others who seem to genuinely not give a single solitary shit about their supposed life partner's health, wellbeing, and physical safety. \n\nOP, ditch the girlfriend. It doesn't sound like she lived with you long enough to have any kind of tenant rights, and she very clearly does not care about your safety in the slightest.  You don't need that kind of BS in your life.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 559,
      "content": "NTA.  I love animals and my cat is like my child.  But you told her beforehand \"no cats\" and had a completely valid reason why.  You also gave her a few days to handle the situation herself and she didn't.  I'm no relationship expert (far from it), but this  seems like a major red flag, even after all this time together.  Why would she do something that would likely cause a major health issue for you?",
      "id": 97,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 250,
      "content": "NTA but the cat wasn't the problem. The complete disregard for your health was. You should rehome home your GF.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 210,
      "content": "NTA.  Luckily, you are a good person and did the responsible thing by taking Mittens to a rescue with a donation.  Since gf walked all over you once and then ignored your request to return Mittens, I doubt GF would ever have gotten rid of her.  I am sure there is a lovely dog loving woman in your future.",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 171,
      "content": "NTA. \n\nShe had her chance to say goodbye, but decided to ignore it and rip up adoption papers instead. \n\nYour gf just showed you that getting her way is more important to her than your literal health and well-being. Let that sink in.",
      "id": 100,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 137,
      "content": "NTA that was so disrespectful for her to get a pet that could kill you, or at least make you miserable. She never should have said hello to kitty, let alone goodbye",
      "id": 101,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 112,
      "content": ">  I should have at least let her say goodbye\n\nYou did. You gave her three days to do so.\n\nSuper NTA",
      "id": 102,
      "comments": [],
      "relation": "Support"
    }
  ]
}