{
  "post content": "So. I have an older brother. He is 25. I am 19. He is gay but he is closeted. He has only told me and his close friends about his gayness. Our parents are conservative. He is not my mother’s child, only my father’s. His real mother is a deadbeat. However if he came out I am certain my father would come around to it, only because over the years he’s gradually distanced himself from our old church because of how hateful the pastors’ associates have become toward gay people. It’s not an endorsement of their lifestyle, but it is a refusal to despise them. However he still thinks he has the right to deny baking a cake for them. \n\nI disagree with my father and my parents’ conservativeness, but have yet to vocalize said disagreements. I merely keep a safe distance since I’m in college. My brother however still tries to please them because I think he is conflicted. He still has Christian ideals and prays but his friends don’t share the same values (a lot of them are off the books weed/coke  dealers). He’s a bit of an alcoholic because of the fights he got into with our controlling parents growing up and I wouldn’t call him a deadbeat because he’s a very skilled manager at a retail store and did graduate college buuut all his free time is spent partying and abusing drugs as he tries to support his friends’ rap career (he’s apart of their group and frankly they suck. I wouldn’t disparage them if they didn’t pretend to be better than they are or ridicule me for being book smart, but the only person in their group that has a shot at making it is their producer because he can make beats in the style of many other producers. Lyrically speaking they need some help.)\n\nMy brother is a pretty macho fella. I am not. I do like sports, i play with my friends, but i don’t have as much muscle mass as him despite being toned/muscular myself. He used to bully me because he was treated as the problem child by my parents growing up but that all changed when i played sports in high school. I wouldn’t call him “nice,” but i would say he became invested in my athletic career and gave me helpful pointers, but it was primarily to preserve his reputation at our high school/college. His athletic career was the only way he could gain favor with my dad who served in the military. \n\nAs i mentioned earlier his friends are into drug abuse. He is heavily invested in a thuggish image that he maintains on his private instagram. He used to constantly pick on me for being a square and doing well in high school and college. I don’t resent him as much because I understand where he’s coming from and I’ve secretly been going to therapy for the last year to feel better about myself. I wouldn’t say I am at 100%, but I am far more confident than I used to be. Occasionally though i will be reminded of something he did and it’ll fuck up my whole day. (nitpicking my athletic performance in front of others, calling me gay as a kid cause I was into opera and Sailor Moon, criticizing me in front of our veteran of a dad when i wore brighter colors, belittling my interest in theater, etc.) One day he called me crying while drunk and apologized for being an asshole, but he hasn’t really changed much. He’ll still occasionally call me pansy or queer, despite my protests. I only know about him being gay because he opened up to me while under the influence, and told me “to never mention it again” when he sobered up. One of his friends mentioned it in front of me and he was pissed. \n\nAnyhoo, I attended a Christmas Eve family event and brought two friends. Word got around that I made the honor roll. He scoffed and rolled his eyes. My mother made a smart ass remark at my brothers’ expense. She said she meant it as a joke but it pissed him off. He glared at her and walked out. He returned a couple of hours later and talked to her privately, but he was drunk as fuck. I could tell by his staggering. She urged him to drink some water and sober up and he initially listened but couldn’t resist the call of my cousins playing basketball in the driveway. \n\nHe began to show off in front of my younger cousins. He was sloppy and unnecessarily aggressive. My cousins are 14, 16, and 17. I was already outside with my friends watching and we decided to go to one of their houses. My brother continuously taunted me as I left and threw the basketball at my head. I gave him the bird as I was slowly losing my cool then he continued to taunt me “cone here pussy, come play with me ya little queer” etc etc and I lost it. “Youre the only real queer around here.” He came at me but I ran away and all my friends and cousins subdued him. He cursed me as I got into my car and my dad and all the dudes came outside to find out what happened. He brushed it off and walked away. I haven’t talked to him since and he didn’t show up for Christmas breakfast. \n\nI really hate that I outted him but there’s a part of me that feels good about it. I finally hurt him. But I outted him in front of my cousins who I’m certain relayed the info to my uncle and father. Dads been pretty stern all morning. \n\nAITA? Could there have been a better way to go around this? He just makes me feel so weak and he’s projected his weakness and “”effiminacy”” on to me for so fucking long and it felt good to hurt him back. I just hate that it was at an inconvenient time for him and could mar his already shit relationship with our parents. Being closeted is more-so about survival than anything else and i feel like shit\n\nTLDR; My closeted bully of an older brother got mad at me at Christmas Eve dinner bc my mom showed off my academic success at his expense. He taunted me while playing basketball calling me pansy and queer and I outted him. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 1116,
      "content": "ESH \nYou should *never* out someone who doesn't want you too, that's a hard rule.  Even though his behavior was absolutely shitty, which is why it's ESH, it doesn't excuse you outing him over a basketball game",
      "id": 2,
      "comments": [
        {
          "score": 220,
          "content": "Yeah, there’re a lot of family issues to unpack there, but I think this is the best summary. ESH for sure.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "Yeah it’s not his fault we’re in a shitty situation. I think i wanted power in our relationship which doesn’t make it right but understandable. We had a long convo via text and i told him id never weaponize his homosexuality against him but if he tries something like that again I’m gonna go no contact. That way I don’t negatively reinforce him, maintain healthy boundaries, and keep the door open in the event he gets help in the future with distancing himself from his friends and stuff. \n\nEdit: people are downvoting this comment and I genuinely want to understand what i said wrong. ",
          "id": 4,
          "comments": [
            {
              "score": 74,
              "content": "just play it off as it is some random banter, and all is cool  \n\n\nif he doesn't want to be called a queer, then he should not call others. If i understand correctly, you have asked him to stop this act before, no?\n\n&#x200B;\n\nFrom now on just pretend as if you did not out anyone... You just called your older brother a faggot, like boys always do and that's it. but tell that faggot to shut it in the future",
              "id": 5,
              "comments": [
                {
                  "score": 45,
                  "content": "Yeah this is definitely not the first time he’s teased me as queer or a pansy but it was the first time he did so maliciously in front of other people. I used to ask him not to but he’d ignore it and it got to the point that i ignored his teasing. This is the first time in a long while that i lost my cool. \n\nMy cousins did interpret it as banter but the reason i felt conflicted was because i felt good for humiliating him but also felt shitty that i lost my cool and totally ignored the greater repercussions that’d come from him being outted as gay to my family. \n\nWe ultimately did make up and I told him i wouldn’t mock him for being gay ever again but if he ever tries to humiliate me like that I’d stop hanging out with him until he stops his abusive behavior ",
                  "id": 6,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Good to hear that y’all made up. Seems like he’s been using you as a screen to project anti-gay attitude (“see? I dont even like queers!”).\n\n\nHe needs to deal with his issues directly, but if you want to help, maybe start standing up for your beliefs to your dad that gay people shouldn’t be discriminated against. Help your dad see that we all are sinners and fall short.  Anyone who has a relationship with God is good because He gives us grace- unconditional love and undeserved forgiveness. Nothing else needs to be said or questioned there. \n\n\nOlder folks have had a harder time coming to terms with that because for so long the church explicitly preached against homosexuality.  We’ve had to sort of try to “re-educate” the older generation in our families with short, informal conversations.  Progress has been made. \n\n\nIf your brother sees you standing up for gay acceptance, hopefully he will see he has an ally and completely stop his bullying. ",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "You...already weaponized his homosexuality against him. That's something you won't do AGAIN. Which is not the same thing as never. ",
              "id": 8,
              "comments": [
                {
                  "score": 23,
                  "content": "I meant that I wouldn’t do it again",
                  "id": 9,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Even though I believe in general someone has the right to come out on their own terms and timeframe, there are occasions when a person’s actions justify being outed. Politicians who are closeted and pursuing sex with men while advocating anti gay laws and policies would be a good example. In fact, these people should be actively outed as payback for their shitty deeds. In your brother’s case, I think I can see why you did it in the heat of the moment. I don’t think you fucked up. You were pushed to the edge and taunted with homophobic slurs until you pushed back. You did nothing wrong. Your brother’s toxic relationship with his own sexuality from your family dynamic has caused him to weaponize masculinity and used being gay as an ultimate put down. If he had been conflicted internally it would have been fine. But he is lashing out with his behaviour and projecting his self loathing onto others, namely you. In that situation, I would not fault you for rejecting his queer insult but putting it back on him. Cut yourself some slack. Your brother did it to himself.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 115,
          "content": ">“Youre the only real queer around here.”\n\nis not a real outing, it's just some medicore banter.",
          "id": 11,
          "comments": [
            {
              "score": 19,
              "content": "This was my first thought. If he's call you a queer your whole life and that hasn't resulted in everyone thinking you're actually homosexual, why would you think that calling him queer one time means that he's suddenly outed? I mean, unless you went around after he left telling people, \"I know, can you believe it? He's called me queer my whole life but actually he's the one who is gay, and I know because he told me so himself and committed me to secrecy on it.\" Now, if you did that THAT, then you are a gigantic asshole. \n\nI know this is hard for people to remember in the heat of the moment, but the way to deal with people treating you poorly is to talk to them about it calmly, in a calm moment (not in the middle of their treating your poorly), and if you can't get them to stop through reason, then you stop presenting them with the opportunity to treat you poorly (that is, you stop seeing them). ",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Disagree. of course you should protect gay people, but if you're such an asshole you lose that right. Especialy because his brother was abusing his power, he thought \"he can't defend himself because he won't out me\". You know what even minorities can be total assholes and you can't always draw the victim card. His brother had to be shown that he's not always a victim and doesn't always deserve victim treatment. ",
          "id": 13,
          "comments": [
            {
              "score": 5,
              "content": "Exactly. I’ve had my fill of people in my life who’ve thought they could get away with anything because I was someone who empathized and would not hurt them. Just because I can feel your emotions and don’t in general like to cause negative ones as they are, obviously, unpleasant, I’m not about to just LET myself become a victim so that someone else can feel powerful at my expense.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "Agreed. ESH.",
          "id": 15,
          "comments": [
            {
              "score": 1,
              "content": "What does ESH mean? ",
              "id": 16,
              "comments": [
                {
                  "score": 5,
                  "content": "everybody’s shitty here ",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Everyone Sucks Here.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Honestly I would agree with this unless the guy repeatedly called me queer and pansy. \n\n\nYou want to call me that shit but I can’t say you are. \n\nGo fuck yourself imo ",
          "id": 19,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "I would agree with that if his brother wasn't such a dick, especially after he came out.  You want people to respect you, and your wishes, you have to respect other people. You don't get a pass to be an asshole just because you're uncomfortable with your sexual identity. The way I see it OP did the right thing. ",
          "id": 20,
          "comments": [
            {
              "score": 15,
              "content": "Just because someone is an asshole is no reason for you to be one as well. Assholery doesn't cancel each other out. ",
              "id": 21,
              "comments": [
                {
                  "score": 3,
                  "content": " if this was just a one instance, but it's not the OP's brother obviously has a history of acting like this. Now it's his brother acting differently and wasn't a dick after coming out to him, that would be a different story. But he didn't he chose to remain a douchebag and well he got what he deserved. The op5 didn't out his brother, but hopefully he made his brother think twice. If his brother wanted respect, he should have shown respect. It's that simple, you reap what you sow.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "I dunno. If you want other people to abide by social ‘rules’ and whatnot you do have to as well. If you don’t have social respect, then don’t expect it.",
          "id": 23,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 363,
      "content": "ESH. His behavior isn’t acceptable but neither is ever outing someone.",
      "id": 24,
      "comments": [
        {
          "score": 5,
          "content": "What does ESH mean",
          "id": 25,
          "comments": [
            {
              "score": 25,
              "content": "everyone sucks here",
              "id": 26,
              "comments": [
                {
                  "score": 4,
                  "content": "Thx",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -26,
          "content": "they just called each other queer faggots, like brothers sometimes do. no one outed anyone, calm down",
          "id": 28,
          "comments": [
            {
              "score": 3,
              "content": "Totally agree. I grew up in the 80/90s and that was a normal thing for us to call each other, and worse. The way I see it is if you can't take, don't dish it. If my sister called me a b, I would call her a c. If op being called gay doesn't make him gay, then him saying the same to his brother shouldn't be considered outing anyone. Nta",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 312,
      "content": "[deleted]",
      "id": 30,
      "comments": [
        {
          "score": 198,
          "content": "I'm also unsure he outed him. Though he did have the intention.",
          "id": 31,
          "comments": [
            {
              "score": 12,
              "content": "did he?",
              "id": 32,
              "comments": [
                {
                  "score": 6,
                  "content": "It turns out he hasn't.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "He also noted that he enjoyed the pain it seemed to cause. \n\nYTA",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "Seems to me he outed himself by overreacting to the remark",
          "id": 35,
          "comments": [
            {
              "score": -4,
              "content": "Yeah but objectively speaking who put him in that situation?",
              "id": 36,
              "comments": [
                {
                  "score": 40,
                  "content": "In a lot of ways the brother put himself in the situation by constantly calling his younger brother 'queer' in the first place",
                  "id": 37,
                  "comments": [
                    {
                      "score": -15,
                      "content": "Was it reasonable for the brother to expect from that comment that he would be outed? The way I see it no. So, the brother didn't put himself in that situation.\nEven if you argue that he did what OP did was wrong.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I agree with your analysis, but disagree that it’s a NTA thing to do",
          "id": 39,
          "comments": [
            {
              "score": 9,
              "content": "how do you stand up to bullying then?",
              "id": 40,
              "comments": [
                {
                  "score": 6,
                  "content": "You tell them to fuck off, ignore it, whatever. You don’t need to sling slurs to counter slurs. ",
                  "id": 41,
                  "comments": [
                    {
                      "score": 13,
                      "content": "what if ignoring and telling them to fuck off only provokes them?",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 186,
      "content": "ESH. You knew that’s what would hurt him the most, even if to everyone else listening it just sounds like trash talk. He was an asshole first, but you were intentionally trying to out him to a conservative family, a potentially dangerous situation. ",
      "id": 43,
      "comments": [
        {
          "score": 41,
          "content": "The danger element is a good point. I don't think he intended to put him in danger. But it's still a possible consequence of his actions.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah i totally forgot how dangerous it was in the conservative context. His friends know, and I didn’t mean anything disparaging with what i said i was merely being matter of factual, but regardless it was mor negative reinforcement for him and the last thing he needs is more shame for being gay. There are other ways to tell him that he fucked up without threatening his livelihood — ignoring him has worked wonders but  i just need to consistently detach myself from the implications of his insults and understand that it’s merely projection. ",
          "id": 45,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 98,
      "content": "NTA you didn’t technically out him ",
      "id": 46,
      "comments": [
        {
          "score": 43,
          "content": "True. By what he said we are unsure of the outcome. He did have a bad intention. So he's TA.",
          "id": 47,
          "comments": [
            {
              "score": 5,
              "content": "True enough ",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 83,
      "content": "NTA.  He targeted you. You stood up for yourself in a sneaky (no one but you understood the underlying intent) way by throwing his taunt back at him. \n\nYOUR BROTHER OUTED HIMSELF FROM REACTING AS HE DID.\n\nHad he played it off AS HE EXPECTED YOU TO DO, then nothing would've happened\n\nYour bro got triggered and lost at his own game.\n\nTL;DR; Bullies aren't your friends. You need to remove that negativity from your family.",
      "id": 49,
      "comments": [
        {
          "score": 13,
          "content": "Agreed.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "EXACTLY. AMEN",
          "id": 51,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 52,
      "content": "YTA\nHe told you a secret. It was supposed to be in confidence. He required it to be that way. And you completely disrespected that to hurt him on purpose. Asshole move.\n\nHowever I get why you did it. You were tired of being abused. Not excusing you. You should have been the bigger man though I get that in practice when your pissed off its hard.\n\nBut I also tell you this: you can turn this situation around. I don't think you have effectively outed him. Just tell everyone it was a joke or that you said that because you were angry.\nBut maybe it won't have to come to this. I don't know how people reacted to your comment. Did they believe it? If they didn't than don't talk about the subject. It doesn't really sounds like you outed him. More info is needed.\n\nI also think you as a family should step up and actually be a family. I'm not just talking about his sexuality. I'm saying that he is associating with bad people, he's drinking, seems to abuse drugs and it sounds like he is just having trouble coping with life.",
      "id": 52,
      "comments": [
        {
          "score": 58,
          "content": "When i said it my friends and cousins went oooooo but i dont think they understood the implications they just interpreted it as a burn.\n\nI texted my brother and told him sorry and that I’ll clear it up with my cousins if they say anything weird. He just said ok. ",
          "id": 53,
          "comments": [
            {
              "score": 21,
              "content": "Good for you for apologizing. Just say you were angry and said it out of anger if your cousins insist. If not let it drop.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "What about your parents?",
              "id": 55,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah someone else said something about how it’s not really my bros fault he’s in the closet and i should take that more into consideration. I know he’s 25 and lives alone and all but he wouldn’t be in the situation he’s in if it weren’t for our shitty home life. Otherwise he’d be thrivin and gay. But I reminded him it’s not really his fault he cussed me out cause my mom shouldn’t have been so showy about my grades. Our parents don’t know anything luckily my dad was just upset he didn’t show up until later. ",
                  "id": 56,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Good. It's good they don't know.\nIt sounds like you are doing the right thing. Let me give you some advice. I get that I said that you are TA for having outed him (though you didn't). I also said that you as a family should help him with his life (substance abuse and associations). What you did was a pretty asshole move. But I do understand why you did it. It was mean and potentially dangerous. However you are effectively being bullied by your brother and it's unfair. So, I guess that it is natural that you want revenge. And you are also a victim of your home life.\nSo, my advice is don't allow him to hurt you any further. Your young and it's not your job to save him but it is your family's job. They should help him. Of course you can try and help. If he continues to be a jerk for your mental wellbeing stop. Only help if you can handle it.\nI do hope that you are able to learn to cope and that things turn out for the best.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "OP didn't go out of his way to be targeted by a bully. OP shut that bully down in a sly way that got him triggered for being a hypocryte. OP is my favourite guy this christmas.",
          "id": 58,
          "comments": [
            {
              "score": 10,
              "content": "OP is definitely in the wrong in my opinion. Actions have consequences. OPs brother is probably having mental issues and there are dangers in exposing someone to a conservative family.\nI get what your saying but I don't agree with it.",
              "id": 59,
              "comments": [
                {
                  "score": 17,
                  "content": "> Actions have consequences.\n\nYup, and older brother found that his shitty actions had consequences.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 14,
                      "content": "100% agree. The way this is told, he didn't run around telling everyone he is gay, he threw a slur right back at him as a burn. It's not great, obviously, but his brother is aggressive and instigated this situation. He played with fire and got seriously burned. ",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "While I disagree with bullying I disagree with outing someone.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Okay.... OP uses \"I'm rubber you are glue\" and skiddadled because 25 y/o got emotional. It may not have been the most eloquent answer. But I think you put a little too much responsibility on OP who is being targeted by this bully/abuse. ",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "every bad guy has mental issues. You think some people are just bullies for no reason? You can't use the cause for a behaviour to justify said behaviour. Bullies need to be shut down. No matter how. ",
                  "id": 64,
                  "comments": [
                    {
                      "score": 1,
                      "content": "So, goodbye moral and ethics? Someone punches you, you stab them? Remember: \"bullies need to be shut down. No matter what.\" Attitudes like this never solve problems in the long run. And get everyone hurt.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 48,
      "content": "ESH from an objective point of view...BUT\n\nNTA@@@@@!!!!\n\nThere’s no fuckinf way the people telling you that you’re an asshole have had to deal with being so close to such an awful fuckin person. For everybody telling OP that he’s an asshole, imagine being constantly heckled by somebody you dread being around but are still forced to be near. And then the bastard tells you a secret and expects you to keep it? You will do your best to be the honorable person here and keep it despite how awful the person is to you, but this “be the better person” approach is something that is only viable in interactions with strangers. When you’re forced to be near a shitty person, it will wear down on you and take it’s emotional toll. I guarantee that of all the good, honest people in the world, it’s a tiny minority of only serious doormats that would continue to keep the secret.\n\nYou are NOT the asshole. People are human and I’m astonished that needs to be said. Do people seriously expect to tell somebody a secret, act like an unrepentant douchebag, and expect the secret to b kept?\n\n",
      "id": 66,
      "comments": [
        {
          "score": 22,
          "content": "Also, it sounds like it's the first time OP won.  His bully will remember that he has a nuclear option.  Maybe that will take some heat off.\n\nBy the way, his dad softening on gay issues probably means he already knows.  ",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yeah, it was strange to me. If you’re closeted, why would you go around insulting (straight) people by calling them queer? I think OP would have been an asshole but from the outside it sounds like he basically said “no u”",
          "id": 68,
          "comments": [
            {
              "score": 15,
              "content": "Internalized homophobia and/or trying to be hypermasculine so that no one questions his sexuality. ",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You make good points here. \n\nBut I think it's a wrong assumption of yours that people replying here haven't been in the same situation as OP. I sure have! I have certain relatives that are unpleasant. I still don't go around trying to hurt them. Or potentially put them in danger. I just don't give them room to annoy me. I would have never acted like OP. Not saying everyone is like me but since you are reasoning like this I am replying to you in the same line of thought.\n\nThat being said if you read my other comments you will see some points I am making that I think are overlooked. Namely that OPs brother probably is battling mental illness and the potential dangers that come from being outed to a conservative family.\n\nAll in all I still think OP acted like an asshole.\n",
          "id": 70,
          "comments": [
            {
              "score": 20,
              "content": ">  I still don't go around trying to hurt them.\n\nSorry, but I don't think that that accusation is justifiable at all. OP didn't set out to hurt his OB, he lashed out when attacked. Whereas OB has very much set about trying to hurt OP over a prolonged period of time.\n\nI think that the relevent aphorism is \"People who live in glass houses should not throw stones.\" Or \"hoist by his own petard.\"",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Soooo... why not consider the YEARS of mental anguish OP suffered from the hands of his brother? I’ve read your other comments but I think that many of the points you make are quite hyprocritical in the sense that you empathize with the brother and not OP in the same situation. OP said one comment that honestly just sounded like an insult much along the lines of “no you are. And you’re talking like the brother is gonna get shot and hanged for this. While the brother may have mental issues, OP probably has some effects from the years of bullying by his older brother. Not even considering the fact that the brother is older and thus should behave more responsibly than OP. Yea sure, brother may suffer some consequences such as potential conflict with his father, but it sounds as if the father has been warming up to the LGBTQ community for a while now and the consequences may not be as severe as you predict. On top of that, the brother is 25 and lives alone, which makes it safer for him if his parents’ community chooses not to accept the fact that he is gay. I still can’t believe you’re essentially saying, “But what about the bully?” and calling yourself empathetic. OP’s brother chose to hurt OP for years, what about him?",
              "id": 72,
              "comments": [
                {
                  "score": 1,
                  "content": "He's a tool for hurting OP for years.\nThe problem with risk is just what your saying. Life is unpredictable. You just don't know what will happen. When your dealing with people who were a part of a religion that demonizes homosexuals you never know what they still believe. Even if they have walked away. And there are many other reasons why gay people are hated. So no matter what there was a risk. And that should have been considered.\n\nRegarding OP's mental wellbeing I 100% agree that what the brother did was wrong. OP said he is going to therapy. I have a feeling that OP has been through a lot in life himself and is working through issues. I know what it feels like to be down. I urge you to go read my replies to OP directly. I gave him some advice in this regard. I certainly empathize with him and have tried to help him out directly. It is more than a lot of people parading through here and saying that I don't care about OP or that I am a hypocrite or something.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I think you are right. OP feels bad about the queer comment, which implies their relationship dynamic is not strictly bully-victim. \n\nI've had disagreements with my brother where we both say shit that we regret later. Especially with drug use involved..\n\nDoesn't mean we don't love each other and neither of us would ever purposely try and hurt the other. ",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "I'd argue that you didn't even out him--easy to brush it off. But NTA either way.",
      "id": 75,
      "comments": [
        {
          "score": 2,
          "content": "It was an asshole move. You should never expose people's private lives to anyone. No matter what the topic of personal life is. You wouldn't like it if someone did it to you. So don't do it.\n\nThe thing is you are right about something: he hasn't outed his brother. He can tell the family that he said it out of anger. I think it's the right thing to do it (though he will be lying). Or maybe it won't have to come to that. The fact is we don't know how people reacted to OP's statement. If they didn't believe it he is better off not saying anything.",
          "id": 76,
          "comments": [
            {
              "score": 24,
              "content": "Your bully of 25 years tells you a secret that no one else knows. You respond with his own taunt back at him. Gets tagged as an asshole for being rubber and not glue.",
              "id": 77,
              "comments": [
                {
                  "score": -4,
                  "content": "Because what OP did is dangerous and not thought out. Check my other comments.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Dangerous. Like abusing the people who know you best.  ",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I disagree with your point of view on this, but can respect it. OP's brother is a complete dick. Being gay doesn't give him some right to respect that supersedes the right other people have--if he wanted respect he should have kept his mouth shut instead of heckling OP for years and years and years.\n\nI personally would not do what OP did, but I do not fault him for it. Bullying in general can be just as dangerous as outing someone, so those things cancel each other out to me. I guess I can understand an ESH verdict, but for you to actually think OP was an asshole but that the brother wasn't seems odd to me.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 27,
      "content": "ESH. Your brother is messed up with the way he acts, but you shouldn't have (tried) outed him",
      "id": 81,
      "comments": [],
      "relation": "No"
    }
  ]
}