{
  "post content": "I (24/F) love baking, and I LOVE sharing my baked goods too. I generally get along with everyone else in the office except for this one guy (36/M) , which I will call Leo (not real name) whom I wasn't on very good terms with because of the events that happened years ago when I first joined the company years ago as a fresh graduate. \n\nLeo complained that I am \"lazy\", hates \"cleaning up after my mistakes\" and I made him \"vomit blood\". I did ask him for mentoring help to generate the reports in the way he expects but he didn't want to. Instead he asked me to look at his report and \"follow his style\". Fortunately I was redeployed to another role by in the same department with a better mentor. We don't talk to each other since.\n\nMy birthday fell on a Sunday. I decided to bake cupcakes for everyone in the office as form of celebration, to be given on Friday of that week. \n\nI considered baking one for him but decided against it because of how tried to share food but was rejected. I believed that even if I made him the cupcake, he would turn it down in way way which will make me \"loss face\" in front of everyone in the office. \n\nFor practical reasons too, I decided to make 24 cupcakes (only have a 12 hole cupcake tray) there would be only 2 rounds of baking. There was 25 people in the office excluding me.\n\nSo on Friday, I came into office with a box of cupcakes, which took me the whole night to bake and I also woke up early to put the frosting in. \n\nRight after lunch, I went from table to table offering my colleagues a cupcake each and everyone was appreciative of it. When I reached Leo's table, I tried offering it to him. As expected, he said no, but in manner I find to be pretty respectful.\n\nAfter distributing the cupcakes, one of my colleague came up to me and asked for the extra cupcake that Leo rejected. I told my colleague I actually baked just enough for the office, excluding Leo, so there was no extra cupcake. My colleague looks shocked so I told her that baking the cupcakes didn't come cheap and since Leo was going to reject it anyway, I didn't bake more. I also told her about the limits of my oven and I just simply didn't have enough time to do three rounds of baking only to be turned down at the end.\n\nWhen I came back on Monday, word has apparently spread to everyone in my department how Leo didn't \"get\" a cupcake and I left him out him intentionally. Leo didn't say anything to me about the cupcake thing but I was told by a colleague that he was really upset and he \"really loved cupcakes\", and would have \"came around if I had just left some in the fridge and leave him alone to get it\". \n\nSo Reddit, am I the asshole for baking 24 cupcakes instead of more? I mean I could do just one more round in the oven with ONE or two more cupcakes but it would be a waste of electricity and my time.",
  "id": 1,
  "comments": [
    {
      "score": 40869,
      "content": "I think you're NTA for not baking the extra cupcake, but should have kept the details to yourself. \"Oh, I actually only baked 24 because I knew from experience that not everyone would take one, and I only had 24 cupcake slots to work with\" would have been sufficient.",
      "id": 2,
      "comments": [
        {
          "score": 35016,
          "content": "Yes except still giving too much explanation. Response should've been \"sorry none left.\"  Why the fuck do we always feel we need to explain ourselves?",
          "id": 3,
          "comments": [
            {
              "score": 9261,
              "content": "Yes OP dug this hole herself. Giving TMI",
              "id": 4,
              "comments": [
                {
                  "score": 8589,
                  "content": "But! OP is a 24 year old woman in an office. I would've totally over explained myself at 24. The life experience it takes to realize you aren't still a kid being yelled at and not everything deserves an explanation comes later. From shit like this.\n\nOh and wth Leo boy you are 36 fucking take a cupcake in front of people instead of slithering to get one in silence later. Hate people who's own pedantic nature requires extra maneuvers on my part to bend to their over complicated thought process. I will do this for children and the elderly not for a 36 year old cry baby dude.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2392,
                      "content": "Yep, I would have said I already ate the extras since its my birthday.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1085,
                      "content": "Oh he probably wouldn't have taken one from the lunch room either. Leo sounds like he was just trying to cause trouble, as was the coworker who asked for the second cupcake. What the hell?\nWhat adult goes crying to everyone over cupcakes. OP was reasonable to assume that at least one person out of 25 wouldn't want a cupcake.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 411,
                      "content": "Totally. The fact that she made cupcakes for everyone for her own birthday, it's not surprising that she felt obligated to explain. Jussayin'. Don't hate the young playa, hate the cupcake game...",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 140,
                      "content": "Well this is just a lesson OP needs to learn. I learned in high school not to overshare information.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 132,
                      "content": ">The life experience it takes to realize you aren't still a kid being yelled at and not everything deserves an explanation comes later\n\nGod this is so true\n\nIm 21 and caught myself trying to validate a purchase i wanted to make to my cousin as if her permission would make it ok to buy it\n\nShe stopped me in the middle of the shop and said \"you don't need to validate your spending to me, if you like it you get it\"",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 118,
                      "content": "I agree - maybe she should have said this or that, but isn’t hindsight a wonderful thing? So Imo OP got it spot on- why waste time and effort pandering to an someone who has been an AH nasty person to her from Day 1 ? I wouldn’t. I applaud you OP 👏👏👏👏😂Well done",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I'll be pedantic.  Leo is not being pedantic in this situation.  A pedantic person is \"someone who annoys others by correcting small errors, caring too much about minor details, or emphasizing their own expertise especially in some narrow or boring subject matter.\"  Leo is not the one correcting perceived small errors by OP, or emphasizing his own expertise with regard to how OP distributed cupcakes.  OP, other than when offering the cupcake and being rejected, isn't interacting directly with Leo.  It is others in the office who are stirring up trouble and being pedantic.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "To me this whole fiaso doesn't soud like this 36 years old guy really wanted that cupcake, but that they **all** like drama too much in this workplace.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "THIS! I’m 26 and still learning that not everything needs an explanation. “No” is a complete sentence. I don’t owe (most) people any explanation for my decisions/actions, and trying to “defend” myself in those situations is a waste of energy. \n\nI digress, but definitely thank you for this perspective. Nail —> head.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "God!  You described that perfectly\n\n*slithering to get one in silence later*\n\nIs exactly how I pictured this fucking weirdo.   Learn how to exist in the world!  I learned how to fucking do it, you can too!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 386,
                  "content": "[removed]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Ooh, I think I finally caught a thesaurus bot (or 3)! Comment heavily paraphrased from u/teresajs \n\nBad bot.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 215,
                  "content": "Anyone else suspect that Leo put this coworker up to asking for the extra cupcake thus why word spread so fast?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 147,
                      "content": "No, tbh.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 117,
                      "content": "Man, I hate when this sub sherlock Holmes and tries to add more facts that weren't given in the original post",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "No lol.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "No, because I have worked with plenty of people who find these opportunities on their own",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "🙋🏻‍♀️ first thought - “why would someone ask for the other cupcake?” 🤔 \n\nOffice politics sucks. Upon reading some comments, the advice give to save details in the future is a good one.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "OP set the sword to fall on. Should just have said: “Sorry they’re all gone”.\n\nIn any case, NTA. Colleagues are welcome to pay for a 25th cupcake.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Maybe she could have tried to say that she made 24 cupcakes 1s a symbolic match to her age?\nWould have needed to come up with that earlier than when confronted by the collegue though 😅",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Seriously TMI. “Sorry, there’s none left!” Or if she wanted to avoid more questions she could have said she didn’t bake one for herself but when Leo said no she ate it herself",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "She did mess up but she’s dealing with a snake in the office, cut her a little slack",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 463,
              "content": ">Why the fuck do we always feel we need to explain ourselves?\n\nThe real questions need to be asked.",
              "id": 28,
              "comments": [
                {
                  "score": 51,
                  "content": "Why do the real questions need to be asked?",
                  "id": 29,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Why do we feel the need to explain ourselves?",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 312,
              "content": "[removed]",
              "id": 31,
              "comments": [
                {
                  "score": 32,
                  "content": "And thesaurus bot #3! Comment heavily paraphrased from u/Pinkxel \n\nBad bot.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 288,
              "content": "Exactly this.  I was on board for NTA until OP had to do the explanation. It felt like getting one dig in at her coworker. That puts it in AH territory to me.",
              "id": 33,
              "comments": [
                {
                  "score": 605,
                  "content": "Meh, it sounds like Leo goes out of his way to insult OP every chance he gets, so that was a totally justified dig. At any rate, she *did* actually offer him a cupcake which he then refused. I'm not sure why people are always so careful to tiptoe around bullies and spare their feelings when they're perfectly happy to make those who they target miserable.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 515,
                      "content": "Exactly! And that whole, oh he actually really loves cupcakes and would have gotten it if you’d left in the refrigerator? He’s not a child, and if he turned OP down that’s on him. She didn’t  have to make the cupcakes or offer him any at all. He‘s burned his bridges with OP. Anyone in her office expecting her to go out of her way for a jerk who was mean when she was young and starting out can do the baking for Leo in the future.   \n\n\nActually, NTA OP, but don’t bake for your coworkers in the future. They’re gossips and entitled. Done waste your money on them.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "Normally I'd agree with not indulging bullies, but in this case I see it as a CYA move which would have made OP not the AH if she just told the other coworker she didn't make any extra cupcakes.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 161,
                  "content": "I almost thought this but since Leo told everyone how much he loved cupcakes, but refused one?  Come on, guys is a d@ck.  This was OP's bday and nobody did anything for her.  She gave away stuff and didn't even get a cupcake herself.  The whole office sucks.  OP was justified in her explanation... but I wouldn't have said the entire truth.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Op doesn't state where she's from, but in my country its normal for the birthday person to bring a treat to mark the occasion and you don't generally get anything in return. So it really doesn't have to say anything about their character.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "OP could’ve just said that all cupcakes got claimed. There was no reason for this long winded explanation.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 151,
              "content": "This, or you could have said, that everyone just got one because otherwise it's unfair or that you ate the last one. I personally would have just said I ate the last one.\n\nAlso, i think it's kind of rude to ask for the last cupcake. She got hers and she should be happy. It would have been different if you would have offered but to ask for a second when knowing there is only one left is kind of Esh.",
              "id": 40,
              "comments": [
                {
                  "score": 10,
                  "content": "Yes, who does that! I would totally assume any extras go to the birthday person.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "I know!  Especially at work where people are DYING to have something else to talk about other than A) work or B) themselves.   Scuttlebutt is just too irresistible!  This is a lesson for OP.  Keep it to bare bone facts.  Especially when it comes to free food.   \n\nSorry!  All the cupcakes are gone.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Right? I would've just said \"sorry I ate it\".",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Even \"I ate it.\" would have been better. She threw herself under the bus.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’ve been genuinely shocked to find just how many people think that the fact someone *asks* a question somehow means we’re obligated to answer their question in full regardless of how intrusive and not-their-business it is.\n\nIf it feels too rude or whatever to not answer an impertinent question, then give the shortest possible honest answer. Like you said, “sorry, none left” would have been more than sufficient, equally true, and would likely *not* have resulted in shade and drama.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 637,
          "content": "This. You should have just said, “ sorry I ended up eating it as I hadn’t made myself one.” That would have been a little more diplomatic.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 262,
          "content": "Honestly I think Leo needed to hear this truth. There’s no winning with this guy. I have come across people like Leo and they will always play victim. I highly doubt he would have taken a cupcake later when OP wasn’t looking. And I think she should point out to people that she DID offer one to Leo and willing to go without if he had said yes. But he’s so predictable and he proved her right. I wouldn’t apologize for saying what she said. You treat people the way you want to be treated. People don’t get to be shocked when they get treated the way they treat those around them with disrespect.       \nEdit- spelling- Point not pony",
          "id": 47,
          "comments": [
            {
              "score": 128,
              "content": "I kind of agree. \n\nFinding out your intended \"snub\" of someone's generosity and goodwill is not only NOT subtle and clever, but completely predictable and so unoriginal it can be planned for and counted on- is delicious. \n\nPun intended.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The idea that he would have taken one of it was left for him in  the fridge is infuriating. Oh I want one but I don't want to interact kindly with you to get it.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "[removed]",
          "id": 50,
          "comments": [
            {
              "score": 203,
              "content": "I tend to agree, but she made 24 cupcakes for an office of 26 people. I'm curious what would have happened if Leo had accepted one and she'd run out before finishing the rounds..?",
              "id": 51,
              "comments": [
                {
                  "score": 185,
                  "content": "This was my question. She was banking on him declining, but what if he accepted?  She now would have been excluding someone else. I find the act of handing them out individually to be a little odd and attention-grabbing...then again, I'm someone to make cupcakes for someone else and avoid announcing my own birthday to everyone.  She should have just made a bunch of cupcakes and left them in the coming area for everyone.  Don't exclude that one person because you don't get along; it's petty, juvenile, and unprofessional.  By excluding him on purpose, she's proving she's who he sees her as...be the bigger person and make enough for everyone, if he still acts like a jerk, that's his problem not hers.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 40,
                      "content": "The 26th person was herself. So she didn't make a cupcake for herself on her own birthday.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Exactly. Why hand them out one and one? In my country/culture, it's normally the birthday person bringing the cake to the office, class, etc. The person with the birthday (or their spouse or parent) has either baked or bought the cake for the other people, not the other way around.\n\nAnd you make enough for everybody, not just for the people you like. You place the cake in the common area and invite everyone to have a piece. Baking for everyone excluding one coworker would be considered an AH move here. I think what OP did was an AH move, though I understand why she doesn't like Leo. But since he did decline the cupcake, she didn't need to tell the other coworkers that she didn't make one for him.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I kept scrolling hoping to find this exact comment. I 100% agree with you. What if he had if accepted and honestly cupcakes do not take that long or cost that much to make.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Yeh it makes me tend towards ESH. If going to bake, make sure there's enough for everyone. The situation was so avoidable and really can't go wrong with an extra cupcake or two.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 17,
                      "content": "This is blowing my mind every one feels this way. OP made 24 cupcakes because that's what she had time for. So somebody doesn't get a cupcake. It's not a big deal at all. Some days you don't get a cupcake. OP did something nice for the office, with this drama I just wouldn't make these people anything again",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "And if there's talk at work like OP mentions, I wouldn't be shocked if HR doesn't call her in for a talk about purposefully creating workplace drama. Which will end up with either stating the obvious rule of bring enough for everyone or possibly outright banning baked goods in the office for sharing. [](/u/848407912181)",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 194,
              "content": "Lol this is what I was thinking! Who hands them out one by one?? Normal people just put them\nOn a table and say hey I put some cupcakes in the kitchen everyone!",
              "id": 59,
              "comments": [
                {
                  "score": 138,
                  "content": "Because they crave the attention of handing out treats one by one.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I think OP is just a little naive if anything.\n\nLike they didn't have to overshare with the coworker who spread the rumor, and they also shouldn't of underbaked for the office or rested on the assumption that Leo would reject a treat.\n\nThey just sound a little green when it comes to office politics.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "It's a little braggy, but I could easily see it being a reaction to people taking more than their share.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, that's exactly was I thinking but that happens ALL of the time. I can't tell you how many times I've baked enough for everyone (including me) to get 2-3 servings and by the time I get to the break room, there's none left.\n\nNTA, OP. Petty? Yes, and I love it.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yes! And I’ve gone into a staff/break room many times to empty dishes and I never assume it’s personal because it’s just communal and if you’re late you’re late.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 176,
              "content": "I think handing them out is smart.  There’s always going to be that person that rushes in and grabs several to take home for the kids.  Happened all the time everywhere I worked.",
              "id": 65,
              "comments": [
                {
                  "score": 96,
                  "content": "my workplace is like this sometimes too, except there's one or two people who rush in and have several for *themselves* \\- no kids involved.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Absolutely this. \n\nSome people go in early and grab one, others might be too busy and intend on picking one up later. Original people go back and get a second \"as nobody else seems to be getting them\". By the time the second group go to get one, there's none left.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "But then nobody knows how many you had so nobody really cares if they miss out it’s the perfect way to come with not enough for everyone 😂",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "At least in that scenario, OP can blame the greedy person (all offices have one) instead of finding themselves in the situation they have now.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That’s true.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 130,
              "content": "are you fucking serious? handing out cupcakes is 'narcissistic'? go touch grass, you're completely out of touch with reality",
              "id": 71,
              "comments": [
                {
                  "score": 14,
                  "content": "I was thinking this as well. Someone has been reading too much Reddit! Only on here could someone handing out cupcakes make them a narcissist.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I agree with you BUT in this case she knew she did not have enough for everyone and still walked to each person publicly and offered. What if he said yes? So the act itself isn’t but in her case it might be",
                  "id": 73,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Leo has refused OP's food every time she offered in the past, why would anyone assume that that would change? As for why she still offered despite not having one for him, it was probably so Leo couldn't claim harassment or whatever to HR. \n\nIts not that complicated, and its certainly not enough to start accusing OP of having mental disorders",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 98,
              "content": "I’m sorry, how is handing out cupcakes one by one considered narcissistic??",
              "id": 75,
              "comments": [
                {
                  "score": 13,
                  "content": "yeah the nonzero number of people agreeing it's narcissistic is giving me one of my periodic 'damn i'm ~~more autistic~~ weirder than i thought because that sounds like an alien thought it and now i am worried about something i never, ever would have imagined in a million years' moments. i feel as though i just saw a bunch of people agreeing with the 'red dress to a wedding means you fucked the husband' thing from that one wedding AITA and calling it reasonable.\n\nI just figured with that tight margin this is the most considerate way possible to make sure that you don't leaving a lot of people missing out bc they didn't stop by the lunch room fast enough and other people, unaware they were doing anything wrong, took seconds. if anything distributing them individually is much more considerate of coworker than plopping them in the lunchroom for whoever runs there the fastest. it's also (well i guess this depends on the work environment, but maybe) nice to say hello to people you may not have seen for a bit (and they can say 'happy birthday' if they want, which is probably faster than signing it the stereotypical office card! surely enjoying hearing happy birthday on your birthday isn't narcissistic!)",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 58,
              "content": "I have gone around handing out baked goods at the office desk to desk before, but that office didn't really have a good central place for leaving baked goods.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Why would you throw the word narcissistic around like that?",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "For real! Anytime I makes baked goods to take into the office, I just shoot off an email saying “hey, there are cupcakes/cookies/brownies in the break room/at receptionist’s desk, feel free to stop by and grab one” and let folks decide for themselves. I’ve got work to do, I don’t have the time or patience to hand-deliver treats to the whole staff, and there are less people in my office than OP’s!",
              "id": 79,
              "comments": [
                {
                  "score": 7,
                  "content": "AND she doesn’t have enough for everyone! This truly boggles my mind. What actually would she have done if he’d taken one?",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 127,
          "content": "Or even \"Oh sorry, I ate the last one since evrybody'd got a turn already\"",
          "id": 81,
          "comments": [
            {
              "score": 3,
              "content": "No need to lie on his behalf. \"They're all gone\" is enough lol",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": ">should have kept the details to yourself. \n\nExactly. OP already knew Leo was going to make something out of it, and sharing her reasoning gave him literally the *perfect* out to play the victim. It honestly makes me wonder if there's more to the story about why Leo dislikes her.",
          "id": 83,
          "comments": [
            {
              "score": 50,
              "content": "Makes sense. And according to OP, Leo hasn’t been rude to her since he no longer has to deal with her. The fact that’s she’s still seeking revenge years later might indeed be a clue why he didn’t like working with OP.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Tbh she sounds immature.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Yeah NTA but OP also sealed her own fate by saying that. Leo was just opportunistic and realized that what she said can be used against her so he feigned like he wanted one. \n\nGenerally just sounds like a toxic place though.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Also, next time (if there is a next time) leave them on a community table where people can get them at their leisure. That way it won't be obvious that you left 'Leo' (or anyone else) out.",
          "id": 87,
          "comments": [
            {
              "score": 52,
              "content": "That can cause issues too if some asshole grabs more than one before anyone else can get a chance at it. I’ve had it happen at jobs where they order one or two pizzas and people grab 3-4 slices before anyone else has a chance at it.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Agreed - I'd have just said ' oh sorry, they are all gone now! '  I doubt he'd have gone and asked all 24 people which of them had an extra one.",
          "id": 89,
          "comments": [
            {
              "score": 5,
              "content": "The thing is, the person already knew Leo had been offered and refused a cupcake, because he SPECIFICALLY REQUESTED THE ONE LEO REFUSED. So this whole thing feels pretty suspect.",
              "id": 90,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah, I'd still give the same reply - sorry they are all gone now. What was going to do, line everyone up and put them through interrogation?",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Also, \"leave them in the fridge so I can get it when I come around\"? Leo, you're not a stray dog OP is trying to befriend... Geez",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11980,
      "content": "YTA. Not for baking 24 cupcakes and leaving one out but for going into detail and making it public that Leo and you have conflict. It was unnecessary to provide a vivid description to your coworker. This could have been avoided.",
      "id": 93,
      "comments": [
        {
          "score": 2525,
          "content": "This. You could have just said there weren't any leftovers or some other excuse, it's not that hard. You're not rly an AH, but your co-workers who might not know your issues with Leo will think you're the AH",
          "id": 94,
          "comments": [
            {
              "score": 1273,
              "content": "Yeah \"NTA but self-sabotaging by engaging in drama needlessly\" is frequently the best judgement here, should probably be an official one.",
              "id": 95,
              "comments": [
                {
                  "score": 373,
                  "content": "NTABSSBEIDN, rolls right off the tongue lol",
                  "id": 96,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[TTTWOOMS](https://youtu.be/FukzyfIqYf8)",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This act will not do any favors for OP. Although, the co-worker clearly started this behavior OP stooping to this level publicly looks bad. At work there are often a lot of different personalities and there is a good chance you will not get along with everyone. As a leader you want people on your team who can work together and at least be cordial. Knowing an employee can act petty becomes a liability and you become less confident in assigning them projects where they have to work with other teams. How an employee handles the tough situations can be the most telling and actually usually a great time for employees to shine.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "No it is YTA, Leo may very well be the clear asshole in others conflicts, but in this conflict OP is clearly the asshole. There was zero reason to let everyone know OP especially did not bake a cupcake for Leo. Now, OP publicly slighted Leo in front of the whole office and let them know they have conflict. OP should have just said the 24 was due to pan size.",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I've been saying for ages that we need some variant of a \"you're not an *asshole*, but what did you *think* was going to happen?\" judgement\n\nLike, I can't necessarily say you're an asshole in the situation, but you didn't fall into this problem, you walked confidently into it with your eyes wide open.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "\"you weren't the asshole until you started being an asshole\"",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "> engaging in drama needlessly\n\nOh, you mean like an AH?",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Or not handed the cupcakes out individually. When I was in the office someone would leave them in the break room and let everyone know and we would be appreciative. The whole pageantry with passing out table to table was ridiculous and caused this whole thing. This was the result they wanted, YTA.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1059,
          "content": "Yup I agree with this. It’s fully reasonable to bake 24 total based off the tray, but completely unnecessary to (A) walk around serving them anyway, and (B) go into detail about your intentions to leave one particular person out.\n\nFor future reference, it’s best practice to set out the boxes in a shared space (office kitchen, break room, front desk, etc) and shoot out an email telling people to get ‘em while they last",
          "id": 104,
          "comments": [
            {
              "score": 335,
              "content": "My thoughts exactly. She made a point of telling her coworker why Leo was left out.",
              "id": 105,
              "comments": [
                {
                  "score": 78,
                  "content": "She lied to her coworker about Leo being left out, since she did offer one to him personally, she did not leave him out, claims she just counted on him rejecting it. \n\nPetty and spineless. She wanted to snub him but didn’t have the balls to, so she told (probably the biggest gossip) about her petty plan. \n\nI’m curious who wasn’t going to get a cupcake if he had accepted it lol. \n\nETA judgement, op is YTA for bringing something for everyone but one person over petty drama from years ago. \n\nEdit to change judgement to ESH cause the gossipy, greedy coworker.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Right?! Why would someone ask for the extra cupcake that Leo didn’t take? Why did that woman even know that Leo hadn’t taken one? Who does that? Who does ANY of this?",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 181,
              "content": "But that way she wouldn’t have gotten all of the birthday attention she was craving.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 82,
              "content": "Yes. OP did this on purpose and planned it but it makes her look petty AF.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "We bring in cakes for birthdays sometimes but just leave them in the kitchen and people help themselves. If there’s none left, too bad.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 411,
          "content": "Agreed, but I’d go with the ESH. Leo for obvious reasons, and the coworker for spreading gossip around",
          "id": 111,
          "comments": [
            {
              "score": 166,
              "content": "And OP for plotting petty revenge years later after no continued criticism. Might explain why Leo had a problem with OP in the first place.",
              "id": 112,
              "comments": [
                {
                  "score": 165,
                  "content": "Idk it didn't feel like \"plotting petty revenge\" to me. It's possible, of course, but the vibe I got was more \"ugh he always rejects anything from me anyway, why should I even bother?\"",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Agree. Op told the coworker because they wanted to be petty and show they had planned to exclude him all along and it backfired. ESH. There is no place for childish pettiness in a professional environment even if Leo deserved it.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Yeah, everyone n this story sounds very childish.",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "This kind of petty infighting is definitely being exacerbated by the OP. It's unclear whether she needed to hear this, if that's why she was asking the question in the first place, or, was simply hoping to be validated for effort like some needy schoolkid. \n\nBut what's infinitely clear to anyone who reads it is that workplace sounds gossipy and awful.",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Yeah, the \"I didn't want to offer him one and have him reject it so I'd lose face\" doesn't make sense when she goes ahead and offers him one anyway.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I would lean to YTA. Leo may be the asshole in a separate/prior conflict, but in this conflict Leo did nothing wrong.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 206,
          "content": "I actually think Leo needed to hear this. I’ve come across people like this and there is no winning with them. But I would have pointed out that I DID offer Leo a cupcake but true to form he rose to the occasion and refused. She knows him that well. That’s on Leo.  Now he’s just trying to make her look bad. Sure maybe it was petty that she said it but Leo is an AH and he just heard the truth about himself. He doesn’t get to be shocked or hurt when people treat him how he treats them.",
          "id": 119,
          "comments": [
            {
              "score": 123,
              "content": "But Leo wasn't saying anything. It's the 'greedy' coworker that is going around stirring the pot. Had she left the cupcake in the fridge that one colleague would have eaten it anyway.",
              "id": 120,
              "comments": [
                {
                  "score": 56,
                  "content": "I agree with that. The coworker who went around spreading those rumors should be confronted. They were ill intentioned by doing so. And it seems most forget she did offer one with the intention of going without had he said yes.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 15,
                      "content": "She was going without regardless. There’s 25 people in the office, *excluding OP*. She made 24, counting on Leo to say no. Had Leo accepted, someone else goes without. Either that or she goes “Sike!”",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "It’s also a really bad look at work. The boss may see her as unprofessional and petty.",
          "id": 123,
          "comments": [
            {
              "score": 60,
              "content": "This! We really don't know the full story anyway, and I think she's leaving some details out. But based on what* she's described, he's a jerk and she's petty. Not a good look.\n\n*Edit",
              "id": 124,
              "comments": [
                {
                  "score": 11,
                  "content": "He does sound like a jerk, and I'm guessing we've all worked with a few - but we also don't have anything from his side about why he criticized her work in the first place.  I've been assigned to work with new people before, and a small handful have really tried my patience - I try not to say things like \"vomit blood\" out loud, but I've definitely had that kind of feeling.  OP was new to the professions and the office, and it sounds like Leo should not be working with new people.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "This. You could have said they are all gone or it looks like someone had it already. Instead you admitted to excluding him which could be construed as bullying by exclusion.",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "I agree. A simple “ sorry I ate it” would be enough.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This, yeah. Personally, I always bring a few extra when taking baked goods into the office, but not doing so wouldn’t make OP an AH. Letting her coworkers know she intentionally excluded Leo, however, did. \n\nAlso, what’s up with the coworker who came begging for leftovers, then tattled to the rest of the office? Uncool.",
          "id": 128,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "\"I think they're all taken at this point but I'm glad you liked them\"",
          "id": 129,
          "comments": [
            {
              "score": 3,
              "content": "Exactly. Less is more in this scenario.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6727,
      "content": "Who bakes 24 cupcakes earmarked for specific people? Bake more than you need and leave them out. No need to police who gets what. NAH, but come on.",
      "id": 131,
      "comments": [
        {
          "score": 2898,
          "content": "Walking around and making sure OP gets cred for every cupcake is also not sitting well. OP admits they do this a lot, too.",
          "id": 132,
          "comments": [
            {
              "score": 687,
              "content": "We are not allowed to put food out for anyone to grab at my work (takes up too much room in fridge or counte, and allergy issues, apparently?), this might be the case for OP as well.",
              "id": 133,
              "comments": [
                {
                  "score": 382,
                  "content": "I also once worked in an office with a terrible layout and no central lunch room of any kind. Walking around to hand out stuff was a necessary evil.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Could you not leave it at your desk and just say “cupcakes at my desk” to everyone in the office.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Then the co-worker wouldn't have said that he'd have one had she left them in the fridge",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 462,
              "content": "I had a colleague who was like this. She would always make a big deal of having baked things for people, continually reminding us that she’d done it, as if our simple ‘thanks’ was never enough. She’d remind us repeatedly through the day, ‘ohhh, didn’t you just LOVE the cupcakes I made you?!’ \n\n.. for the thousandth time, YES. Thanks. \n\nIt got very annoying because nobody ever asked her to do it, she’d do it on her own volition and then it always seemed there were strings attached, like we had to constantly praise and kiss her ass for it. \n\nI learned it was a cultural thing for her. Food being very important in her culture and a way to show love. To me her actions felt suffocating and needy, but I could understand it more after I learned that. \n\nMeh, maybe it’s the same for OP. But I’m definitely in the camp of ‘put all the cakes in the break room, tell people to help themselves if they want to, and leave it at that’",
              "id": 137,
              "comments": [
                {
                  "score": 241,
                  "content": "My mom does this, but with the added benefit of stressing the fuck out while she’s preparing this gift that no one asked for.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Isn't that every mom ever?",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This reminds me of the episode of The Office when Dwight starts giving things away but always makes a point to say, “You owe me.”",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Nah, Leo doesn’t deserve a cupcake. Op just shouldn’t have been so tactless",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "Uhhh if I make shit I’m definitely getting credit for it hahaha that’s time effort and money. They ain’t called brownie points for nothin. 🤣",
              "id": 142,
              "comments": [
                {
                  "score": 9,
                  "content": "I just would send a email or say it to a few coworkers and the news usually goes around.",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Man what? Only this sub would see someone passing out free cupcakes as a smug act.",
              "id": 144,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "This isn’t something I would do. But it wouldn’t bother me. \n\nOP paid for, took the time to make and bring the cupcakes into the office. Her wanting people to know isn’t a huge deal. I’d like the opportunity to thank them if they made the effort, and them handing me the cupcake takes away the “how many people have touched or breathed or coughed on them” thoughts. lol",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": ">*OP admits they do this a lot*\n\nWhere did you see that? I went through the comments on her profile, and didn’t find anything. Has she deleted something?",
              "id": 146,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I like to bake and bring baked goods in sometimes. Where I work, there's about 40 people on my floor who all share a common food area. There are only 10 people on my team, so I walk around to ensure that's where the food actually goes.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I used to bring baked goods and just leave them in the break room until one wretch pissed me off.\n\nI brought in a loaf of apple bread for everyone to share. She took over a third of it and hid it in her office the second no one else was in the break room.\n\nFive days later she's running around the office screaming and making gagging noises saying that I made her violently throw up for 30 minutes because she forgot to eat the bread she hogged and it went bad by the time she took a single bite. \n\nEveryone just told her to shut up and not take food if she's not going to actually eat it.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 684,
          "content": "Or just put them in the break room as first come first served. ‘I brought cupcakes, they’re in the break room, cheers!’\nIn my experience it’s much better not to put people on the spot for whether they want your baked goods or not (people have diets, preferences, aren’t feeling it today, whatever).",
          "id": 149,
          "comments": [
            {
              "score": 369,
              "content": "Yeah, individually handing them out is awkward and puts people on the spot. The person coming up to ask for the spare cupcake is weird too. Reminds me of the guy who ate two extra donuts because his pregnant coworker was late to the office.",
              "id": 150,
              "comments": [
                {
                  "score": 68,
                  "content": "I was waiting for someone to mention that story, not as bad as the 3 foot sandwich one tho",
                  "id": 151,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Wasn’t it a six foot sandwich?",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Got a link for the donuts story?",
                  "id": 153,
                  "comments": [
                    {
                      "score": 12,
                      "content": "https://www.reddit.com/r/AmItheAsshole/comments/wkdndc/aita_for_eating_the_last_donut_before_my_pregnant/?utm_medium=android_app&utm_source=share",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 204,
              "content": "Yeah I’m surprised all 24 people took one.  Easily 30% of my coworkers won’t take sweets because they’re on a diet or don’t like them.",
              "id": 155,
              "comments": [
                {
                  "score": 58,
                  "content": "I picked up cupcakes for my birthday but also got two giant bowls of fresh cut fruit. I think fresh fruit is a treat to many because they don’t normally take the time to make it themselves. That fruit went faster than the cupcakes. Same when we would pick up donuts and grab some bananas. The bananas always went first.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That’s really smart - I should do that next time I bring something sweet in",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Depending on how it is being offered to me, in my younger more self-conscious days, I might take it just to avoid saying no and then quietly dispose of it when no one's looking. It's easier to say yes than defend your reasoning for saying no, and someone who goes around desk-to-desk offering birthday cupcakes is unlikely to accept my \"oh, no, thank you!\" at face value.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah some people are very comfortable saying no thanks or explaining their restrictions (‘does it  have dairy? I can’t eat it…’) and some people aren’t. I don’t take offense when people turn down my food but not everyone knows me well and some people just feel awkward about it",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I would guess that at least a few of them didn't actually want or eat the cupcake, but felt awkward turning down a birthday cupcake being offered directly to them by the birthday girl.  Yet another reason I just put stuff in the lunch room with a note to help themselves.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "But there's often that 1 hog who will take a dozen to bring home and enjoy.",
              "id": 161,
              "comments": [
                {
                  "score": 45,
                  "content": "IDK, usually I haven’t seen anyone taking a million right when they’re put out. In my office it’s usually that they’ll wait until it’s been awhile and there’s still a bunch left\n\nOnce I took the cookie container over to the guy who kept going back for more and was like ‘PLEASE take some home there’s still so many many!’ Hah",
                  "id": 162,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You’re lucky. My office pre Covid had regular pot lucks, and I brought in my tailgate chili, literally one of my co-workers finished eating their bowl and rinsed it out, refilled it (and it was about a quart sized round bowl) snapped the lid on it and carried it away, before half the shift even came up for their break. I was at a table watching, speechless, with two others. Some people just don’t care.",
                      "id": 163,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 349,
          "content": "Right? NAH, but I live in the American south, and this thing that OP does, which is actually generous, would come off cheap, because where I live you would never, ever make barely enough for each person to have just one.  I'm not saying OP was cheap, but it breaks a social rule and it \\*\\*appear\\*\\* cheap. Make plenty. If you don't have time to make plenty, don't do it. Again, it's very generous to bake for people.",
          "id": 164,
          "comments": [
            {
              "score": 145,
              "content": "This.  There is a multiplier that goes into how much food to make when sharing, and it isn't 1 serving per person.   Always have extra just in case.  Make that extra dozen cupcakes, send a quick note to the 25 people at the office, and leave the 36 cupcakes in the break room so people can get one at their leisure.",
              "id": 165,
              "comments": [
                {
                  "score": 28,
                  "content": "Exactly this. Then take any leftovers home or put them in the fridge for tomorrow.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Exactly this. I always do extra. What if there was a new hire or management coming by. I find it weird to make the same amount as employees. I also would never individually hand out. It puts pressure on people to accept. I'm on a pretty strict diet so I can have a healthy BMI and hopefully get rid of sleep apena. I would feel embarrassed and rude declining especially since she takes is so personally. I would then have to move around all my calories for the day. I don't eat back workout calories.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I am not from the south but I’d make at least a half batch to make sure there was enough for at least one per person and a couple extra.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "In this case the multiplier was 0.96 cupcakes per person. OP rounded it up to 1 and in this instance the math didn't work out so well. \n\nI'm confused at the cost thing though. It is mentioned in the post, as well as the commentary, about the cost of making the cupcakes. Cupcakes are not expensive to make at all. A batch of 24 costs around $6-7 (including buttercream frosting, cute cups, and energy use). That 24 can be stretched to 25 and nobody would ever notice or mention how their cupcake felt slightly smaller than cupcakes they've had in the past. It doesn't cost anything more to make that 24 batch into a 25 batch. \n\nMaking 24 was an AH move. Always make enough for everyone, even ones you don't like. We learned that in grade school. When you got caught you took the opportunity and tried to blame Leo. That's not cool OP. He was minding his own business on this one. This office drama was absolutely started by you. You aren't the victim, you stirred the pot and now you have to lick the spoon.",
                  "id": 169,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "Also from the South, and you explained perfectly why the situation struck me as awkward.  Telling people they can only have one feels cheap.  \n\nThis might be why every family gathering I’ve ever attended included everyone being aggressively encouraged to take home leftovers.",
              "id": 170,
              "comments": [
                {
                  "score": 70,
                  "content": "Old school South here, and you **never** go ask for leftovers. Lol, on Southern Living magazine’s email list recently, they had an article about manners and this was one of the things listed. \n\nA surprising one was that if you take a dish to a potluck, you don’t even ask for the “remains” of your own food. Once you take it, the food belongs to the hostess and it’s up to her to offer it back to you. That was news to me!",
                  "id": 171,
                  "comments": [
                    {
                      "score": 19,
                      "content": "When used for good, the potluck dinner can be a subtle tool to help people who are struggling to get food on the table, or to give people a break from cooking right after a wedding/funeral. And for your own peace of mind it’s best to use a dish you don’t expect to get back, though using one you do can be a politely reason to check in on a mourner without making it all about the death that just happened. Politeness gets real convoluted when you have to work around pride and trying not to be too nosey. XD",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Ooh same!! When my ex's family would take their dishes back after a potluck I was confused like what bc I was raised in the South. You put it in a Tupperware or container you don't need in case it doesn't get returned to you and that dish belongs to the hostess. Now, a lot of times hostesses are shoving people out the door with Tupperwares full of food bc good lord if people don't feed each other or offer food the good lord will strike them dead  lol",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "What are you supposed to do about the dish that you brought the food in? Just leave it with the host?\n\nI'm not from the South, but I also was always taught that it was better to have extra than not enough food for everyone.",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "We live in the south and everyone gets seconds? I have never seen that personally. We also offer  to make to go plates lol..",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Thank you for wording it well. It’s the same in the middle east where I am from. There’s always a little extra food prepared just in case and we’d never think about excluding specific people. Worst case scenario there’d be leftover cupcakes and OP could have taken them back home.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "It seemed cheap even to me from cold practical Sweden.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Haha I was raised the same. For her to bring one short no matter if they didn't all get taken would have been mortal sin in our parts!",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Same is true in New York, California, Maine, Idaho, Saskatchewan, Quebec, Lebanon, Japan, Australia, Argentina, and pretty much everywhere else… bring enough for everyone plus some just in case.  Cook 36 cupcakes for the 26 people…",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "Yeah that stood out to me too. When I make food for my job I just leave it I'm the break room with a note \"for anyone who's hungry\" and leave it at that. She's doing too much.",
          "id": 180,
          "comments": [
            {
              "score": 242,
              "content": "Yeah, I am a fan of workplace treats.  But I never like when coworkers go cube-to-cube with their home-made offerings.  Experience has taught me that you can never decline without having to endure a whole production.\n\nMe: \"Ooh, those look delightful but I'm gonna pass. Thanks!\"  \nGenerous Coworker: \"I know you love cookies!  Just take one!  I promise you won't get fat!\"  \nMe: \"Really, I'm good.  Thanks though!\"  \nGenerous Coworker: \"Are you sure?  You can save it for later.\"  \nMe: \"Yes, I'm sure.\"  \nGenerous Coworker: \"You can't be on a diet because I saw you eating cake yesterday.  What's the deal?\"  \nMe: \"THE DEAL IS I DON'T LIKE YOUR DRY-ASS COOKIES, WHICH ARE ALWAYS FULL OF CAT HAIR, JULIE! NOW FUCK OFF.\"\n\nI can never muster up the courage to use that last line.",
              "id": 181,
              "comments": [
                {
                  "score": 51,
                  "content": "We had our deputy director trying to give out milk chocolate to a table composed of a vegan, a lactose-intolerant, and a dark chocolate connoisseur. Awkward. Just save yourself the hassle.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yess. Also I get \"what you're too good for my food?\" And ugh",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Thissssss.  👏👏👏",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Damn, now I'm paranoid if my potluck food has cat hair in it...",
                  "id": 185,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well… as long as it’s delicious and the eater isn’t allergic to cats, it’s probably fine~",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "I find this whole story weird. \nIt was her birthday and she wasted baking cupcakes for other people and spend all day distributing?\nHonestly? OP sounds like someone that push too hard for people to like her.",
          "id": 187,
          "comments": [
            {
              "score": 141,
              "content": "And a martyr complex too - the way OP words things - it doesn’t take “all night” and “getting up early” to make a batch of cupcakes. Obviously they want a pat on the back for doing something basic.",
              "id": 188,
              "comments": [
                {
                  "score": 72,
                  "content": "I immediately caught onto that too. Like, cupcakes are quick, easy and inexpensive.. unless you're going over the top and making some gourmet shit, which maybe she did idk. But yeah total martyr complex. Annoying. Sounds like my mother",
                  "id": 189,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Yeah I was trying to figure out the whole baking all night and frosting the next morning for two dozen cup cakes and then complaining about the expense.  I have seen a hack where you use a caning jar ring to hold a cupcake liner.  There are dozens of ways she could have made 25 by putting a liner in something else.  Or just made a whole cake.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Giggling here over martyr cupcakes.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Instead of, you know, working.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 85,
          "content": "YTA OP for inventing cupcake shenanigans. For real though, who would intentionally do this stuff and then assign cupcakes? The whole office is upset over one cupcake? Now OP after over sharing with them at the party is suddenly unable to communicate a sentence to explain? Easy solution, say you made 24 and if Leo had taken one then you wouldn't have. Unless OP also didn't have one? This story has more plot holes than GOT.\n\n**Edit:** punctuation.",
          "id": 193,
          "comments": [
            {
              "score": 5,
              "content": "A story on here made up for karma, attention, or boredom?  I am shocked.  Shocked I tell ya!!",
              "id": 194,
              "comments": [
                {
                  "score": 4,
                  "content": "As am I! Let us outrage in unison!",
                  "id": 195,
                  "comments": [
                    {
                      "score": 4,
                      "content": "You want to pick up the pitchforks or the torches?  I want to make sure we coordinate.",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "Right. I would have baked 30. maybe today is the day this guy says yes to a cupcake. Or maybe someone dropped theirs, wants a second one, or has their kid in the office that day. Make extras just in case - it’s generous and avoids the drama.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "NAH? So the grown man who refused the cupcake in the first place but expected that one was still left for him, just to not give the satisfaction to OP of accepting her grace, and then threw a tantrum over it, that man is not the asshole?\n\nEveryone except OP is the asshole: Leo, and the busybodies who are gossiping about who got how many cupcakes instead of working",
          "id": 198,
          "comments": [
            {
              "score": 12,
              "content": "I don’t see what Leo did wrong here. He (in OP’s words) “respectfully” declined to take a cupcake. Not an asshole move. \nHe didn’t say anything to OP about it afterwards. No asshole move here.\nHe was a little upset? Perfectly reasonable given than OP singled him out as the one person that she didn’t bake for. Still not an asshole.",
              "id": 199,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I would guess she wants to make sure everyone gets one instead of a few people taking more than one so others get none.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "OP seemed to go out of her way to make sure someone knew she intentionally didn't make enough. \n\nWhen you make a box mix of cake, it's meant for 24 cupcakes. She could have said, \"I made a box mix of cupcakes, that's 24. Good thing not everyone wanted one, and I didn't plan to have one myself. But, unfortunately there are no extras.\" She didn't have to mention Leo.\n\nOP, YTA for how you handled it, not for only making 24 cupcakes.",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4758,
      "content": "ESH. \n\nYou - for your long winded explanation of why there wasn't extra. You should have just said there were no leftovers or that you ate it already.\n\nYour co-workers- for spreading the gossip that you gave them\n\nLeo- for being such a passive aggressive piece of work.\n\nBtw, not an extra cupcake at all.",
      "id": 202,
      "comments": [
        {
          "score": 756,
          "content": "OP, just say you accidentally dropped one.\n\nYTA for taking your chance to kvetch about Leo. Just move on. He doesn't want your food and you are taking that personally. He's allowed to not want it.",
          "id": 203,
          "comments": [
            {
              "score": 164,
              "content": "Really? Sounds like he wanted it",
              "id": 204,
              "comments": [
                {
                  "score": 248,
                  "content": "Yeah, he just didn't want to admit wanting it!",
                  "id": 205,
                  "comments": [
                    {
                      "score": 379,
                      "content": "Leo sounds fucken insufferable. Am sick of nice people being told they should be nicer",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "It sounds more like he wanted to stir the pot by making it sound like he wanted one because he knew it would cause problems.",
                  "id": 207,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Leo didn’t say anything though, OP said that other people were saying stuff about Leo being sad and wanting one.",
                      "id": 208,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I mean, I think it's much more likely that someone wanted a second cupcake upon hearing there might be an extra. And then OP went on the weird unexpected rant about a coworker, of course they're going to tell that coworker.",
                  "id": 209,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "My guess is he didn’t actually want it, but he was mad at not getting one. He heard there actually wasn’t one made for him and he decided to throw a fit to make OP look even more bad. “Oh cry I wanted the one in the fridge later :(“ she didn’t make them for the coworkers to have in the fridge later, she made them for the coworkers to have during the time she handed them out and he’s a real asshole for that move alone.",
                  "id": 210,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 252,
          "content": "Exactly. The person didn’t ask for the life story of the cupcakes. You could have just said “they’re  all gone” and went on with your life. This should have been an episode of The Office.",
          "id": 211,
          "comments": [
            {
              "score": 68,
              "content": "oh I can just picture this. Michael decides to make everyone cupcakes except Toby and goes to each cubicle handing them out/forcing them to take one, and then stands there and waits for their reaction as they eat it. \n\nThe cupcakes taste terrible but everyone *pretends* to like them, except Kevin, who announces that the cupcakes are gross and Michael loses his shit.\n\nBonus: Creed actually likes the gross cupcakes",
              "id": 212,
              "comments": [
                {
                  "score": 8,
                  "content": "I just pictured this in my mind a laughed out loud!",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Leo may be an A H in other situations, but he’s not at fault in this instance. He didn’t have to do a thing: OP did all the work herself for that designation in this incident. Bet he enjoyed the hell out of it.",
          "id": 214,
          "comments": [
            {
              "score": 15,
              "content": "We also don't really know anything directly that Leo did other than politely declining the cupcake (fortunately, since there wasn't actually one for him in spite of the offer).\n\nMaybe Leo bitched about it afterwards, maybe the colleague who wanted an extra and got the whole overshare is stirring the pot - we don't even know for sure how that colleague passed on the overshare to Leo.  We just know that OP doesn't like him and he wasn't satisfied with her work when she first started and he declined a cupcake in a respectful fashion.\n\nEdit: grammar",
              "id": 215,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 53,
          "content": "Also the person asking for the cupcake is weird to me.",
          "id": 216,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "> Leo- for being such a passive aggressive piece of work.\n\n\nNegl, I'mma need work related info.\n\nBc just from reading this, I'm starting to believe Leo might have some points on why he doesn't fuck with her.",
          "id": 217,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I mean I have really bad anxiety and sometimes I just over explain things when people ask me because I get stressed and feel like they might somehow know I am lying or leaving something out. Op is a year older than me and if the coworkers are older than them I really can just picture myself doing the same thing",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3160,
      "content": "ESH. You sound like a bunch of kindergartners",
      "id": 219,
      "comments": [
        {
          "score": 711,
          "content": "I couldn’t imagine walking around to desks to offer cupcakes. I also love to bake. Excess goes into the kitchen and I send a friendly email that they’re there.",
          "id": 220,
          "comments": [
            {
              "score": 115,
              "content": "What? It’s routine in my team to bring sweet treats every now and then and walk around distributing them. And then keep the leftovers/excess in the kitchen.  \n\nGranted, none of us ever buys/bakes/cooks less than needed, but there’s nothing strange in walking around.",
              "id": 221,
              "comments": [
                {
                  "score": 162,
                  "content": "Interesting! I've never walked around - maybe in part because I work in a research lab and food is off limits in a lot of parts of our building... But people have diets or aren't in the mood, etc, so imo it's best to not put people on the spot like that. If they want some, they'll get it. \n\nThis story really almost sounds fake to me - I don't think I've ever brought food to the office and had every single person want some. Some of my coworkers don't eat sugar, have food allergies, etc, so I'm surprised that all 24 people wanted a cupcake at that exact time.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Oh your work setting makes sense then.  \n\nYeah, me neither. There’s always someone with a food allergy, or on a diet, or simply doesn’t feel like one at the moment.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Everyone wanting some is normal for me, but there is rarely more than 10 people in the office at a time. \n\nWhat I find fake is that it took \"all night\" to bake 24 cupcakes... especially for someone who \"loves baking\". It would've taken an hour, max. With 40 minutes being sit around and wait for it to bake.",
                      "id": 224,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "It would not be ok to do this where I have worked. You’re wasting your work time and distracting coworkers.",
                  "id": 225,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "My old desk job would not be okay with that. It takes away time from the person handing out treats when we could just have them in the break room and get them when we wanted or announce it on break and enjoy them as a team. Really depends on the work environment you are in.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Everyone's saying that she should have just left the cupcakes in the break room or something, but all offices work differently, and maybe this is just how they do things there. And, generally speaking, not everyone is going to want any given treat. Leo refused the cupcake when she offered it, and he put someone else up to specifically asking for *HIS* cupcake. A man 12 years older than OP conspired with this other coworker to bait OP into admitting there were no more cupcakes after he's rejected every other baked good she's ever brought in. The fact that she over-explained the lack of cupcake leads me to believe she's neurodivergent and prone to such things. (I'm autistic, and I can't stop myself from over-explaining even when I'm in the middle of doing it. My brain just won't stop the words from coming out.) Leo's the real AH here.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "“Hey guys! It’s cupcake Tuesday in the break room, enjoy!”",
              "id": 228,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "“I made you a cupcake for your birthday!”\n\n“Uh, it’s not my birthday.”\n\n“Oh, I thought we had the same birthday!”\n\nDeep sigh. “Happy birthday, Linda.”\n\n(Repeat for each coworker.)",
              "id": 229,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Right? I could see bringing one to a favorite coworker, or to someone who just had surgery or who’s rushing to meet a deadline because you don’t want them to miss out, but delivering every single one to its intended recipient?",
              "id": 230,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It is a common thing to do in my office when we share food...Like we would present food in a box with both our hands and offer it. Directly offering it to someone show that I care about the person and would like them to have it.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 139,
          "content": "Hell, I was taught in kindergarten that if you don’t have enough for everybody then don’t bring them at all.",
          "id": 232,
          "comments": [
            {
              "score": 10,
              "content": "This is exactly it. OP’s an ass.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That’s what I say. This person was the supreme cupcake controller. She should have just said nothing about not baking one for the weird guy. And the person who asked for the “ leftover” cupcake has no manners. \nSounds like a lot of unnecessary juvenile drama to me.",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Right? I wish workplaces answered honestly during an interview . . .what's the culture like in your office. Oh you know we do playground shenanigans and we have office gangs. Don't cross Patty she a real one, and she'll cut you if you don't accept her food.",
          "id": 235,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2373,
      "content": "aware long bewildered busy bear snow toy wide smile whole\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "id": 236,
      "comments": [
        {
          "score": 481,
          "content": "No, OP is TA because it doesn’t take all night to bake cupcakes, and all the other silly excuses like limitations of an oven, etc etc. she didn’t want to make him one because they don’t get along. Just say that OP and rid of us of all the fluff.",
          "id": 237,
          "comments": [
            {
              "score": 229,
              "content": "I was thinking that too... Making more batter is barely more effort and when the oven is hot it's max 20min more to put the tin back with a fresh batch and let that bake too...\n\nOP excluding Leo on purpose and explicitly telling people about it. Leo refusing a cupcake he actually wants because OP made it... Both are really immature here...",
              "id": 238,
              "comments": [
                {
                  "score": 121,
                  "content": "Even if she literally didn’t have any additional ingredients, it’s trivially easy to slightly under fill the cupcake tins so you stretch the batter to make a few extra, and a third batch in the oven is just another 25 minutes while you wash up the dishes. She only wanted to make 24 cupcakes and didn’t want to make sure there were enough for everybody, just own it rather than claiming it would be impossible.",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Most tins hold 12 cupcakes",
                  "id": 240,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I was starting to think I was the only one thinking that.  Who spends all night baking cupcakes? It really doesn’t take all that long. And it would be super easy to make enough for one extra cupcake.  You could easily divide out your batter for one extra.  Yes it would have to go in the oven by itself, but they don’t take a crazy amount of time to cook.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 92,
          "content": "Because she is petty and planned it to be this way. What if that day he had said yes? She wanted it known that she excluded him.",
          "id": 242,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Leo doesn't like her and she doesn't like Leo. Doesn't mean they need to air their dirty laundry in the work place so now OP looks like TA for needing to tell everyone about it. Hope she learns a lesson from this.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1274,
      "content": "YTA for how you handled things. Not the baking but in telling anyone you knowingly excluded someone.  How about “sorry there are no extras”",
      "id": 244,
      "comments": [
        {
          "score": 263,
          "content": "Even just \"Sorry, it would be unfair of me to give you two because everyone else only got one\" or \"I ate the extra since originally there weren't enough for me to have one.\"",
          "id": 245,
          "comments": [
            {
              "score": 16,
              "content": "Yeah tbh the coworker was a little rude to be asking for a second one when there wasn't enough for others to have an extra one.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "right- like “oh i miscounted!” or dropped one or something.",
          "id": 247,
          "comments": [
            {
              "score": 3,
              "content": "Or like I’m the birthday bioch that baked these so any cupcake that gets declined is goin down the hatch",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Oh I'm so embarrassed! I accidently dropped one on the way in!",
          "id": 249,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 785,
      "content": "I’m sorry, is no one going to address that, at some point, OP allegedly made Leo vomit blood??? Like…can we please put a pause on the actual question until we address this?!",
      "id": 250,
      "comments": [
        {
          "score": 654,
          "content": "It is a Chinese phrase [which basically meant that i frustrated him too much.](https://en.m.wiktionary.org/wiki/%E5%90%90%E8%A1%80#:~:text=(medicine)%20to%20vomit%20blood,very%20excited%2C%20angry%20or%20frustrated)",
          "id": 251,
          "comments": [
            {
              "score": 328,
              "content": "I just realized how asian I am from this comment lol. It didn’t even register to me that this phrase was weird to some.",
              "id": 252,
              "comments": [
                {
                  "score": 132,
                  "content": "Same lmao. The “lose face” part also instantly screamed asian.",
                  "id": 253,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "I just instantly pictured one of those scenes in xianxia dramas where someone gets so mad they almost qi deviate and then hurk up a mouthful of blood. But like, onto a keyboard in an office cubicle wearing a suit and tie.",
                  "id": 254,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Same! My mom says it when she's yelling at people.",
                  "id": 255,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 177,
              "content": "TIL",
              "id": 256,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "Well, explains why you were worried about losing face. I wondered. But you still managed to make yourself look bad. Learn a lesson from this.",
              "id": 257,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "Been looking for this in the comments. I could tell from phrasing OP isn’t a native English speaker, and I assumed this was a bad translation. Because there are no circumstances in which that seems like a normal thing to say, even about someone you don’t like.\n\n“You know Brenda?”\n“Ugh, yeah. She makes me *vomit blood*.”\n\nSay what now?",
          "id": 258,
          "comments": [
            {
              "score": 6,
              "content": "I'm a native English speaker born and raised and currently living in the US and have definitely heard (non Asian) people use the phrase \"vomit blood\" to indicate some extreme emotion like jealousy (\"I'm so fucking jealous I'm vomiting blood\") or overwork (\"If they give me one more project, I'm going to start vomiting blood\"). Even in your own example, if someone said that to me, I wouldn't bat an eye. It might be regional or generational, IDK, as a high school teacher I hear a lot of expressions and words that are unfamiliar to previous generations. Or it could be from living in certain places with a high Asian population makes some Asian phrasing/ideas more populous even among non-Asians.\nThe point is, saying \"there are no circumstances in which that seems like a normal thing to say\" is not accurate.\n\nEdit:grammar",
              "id": 259,
              "comments": [
                {
                  "score": 3,
                  "content": "Your examples seem very odd to me as well. If someone said either of those things, I would probably comment on it.\n\nI will also point out that I said \"seems\" like a normal thing to say because to me it \"seems\" quite odd. I didn't say it's not normal; indeed, I mentioned that I thought it was a strangely translated foreign idiom, meaning for OP, it's quite likely an exceedingly normal thing to say.\n\nBut I stand by my statement of how it comes across to me. Not sure how my feelings on it can really be inaccurate; that is absolutely how the phrase seems to me.",
                  "id": 260,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I’m going to take a guess here that OP is Singaporean because it’s quite commonly used in Singapore as Singlish (Singaporean English).",
          "id": 261,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 781,
      "content": "I'm curious- you offered Leo a cupcake expecting him to reject it. What was your plan if he had accepted?",
      "id": 262,
      "comments": [
        {
          "score": 149,
          "content": "I was wondering this too",
          "id": 263,
          "comments": [
            {
              "score": 88,
              "content": "It was a gamble, but I think it was a pretty safe one. Just reading three sentences about Leo, I've met enough people like that to know there was almost a 0% chance of him accepting. This is the kind of person who rejects the cupcake for the sake of disagreeability.",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Bigger confusion: the whole point of not baking a cupcake for Leo was to “save face” by avoiding rejection (plus the ridiculous story about slaving for hours over some cupcakes.) \n\nIt seems like OP is not telling the whole truth. Why is everyone in the office so upset Leo didn’t get a cupcake if you truly offered him one in front of everybody?",
          "id": 265,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "She could have not eaten hers",
          "id": 266,
          "comments": [
            {
              "score": 186,
              "content": "She said there's 25 people excluding her. I read that as 26 total. She made 24 assuming Leo wouldn't want one.",
              "id": 267,
              "comments": [
                {
                  "score": 73,
                  "content": "Oh you’re right. I skipped right over that. hard to imagine doing all that work intending not to have one yourself, on your own birthday at that",
                  "id": 268,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 502,
      "content": "YTA. You’re not an AH for only baking 24 cupcakes although that was risky. You’re an AH for the way you answered the request for the extra cupcake. You made it clear that you deliberately left Leo out & that was rude plus you made it clear that he wasn’t worth the cost of an extra cupcake which is how much? $1 USD? $2USD? You should have just said, “sorry, they’re all gone”, and stopped talking.",
      "id": 269,
      "comments": [
        {
          "score": 196,
          "content": "Literally just put 1/24th less in each cup and then prop up a 25th cupcake liner with a little aluminum foil. It takes 2 cents more money and 10 seconds more time and 1000% less drama. Sheesh. And then worst case scenario you have a cupcake for yourself. ESH bc he sounds like a dick but OP spent a lot of time making excuses to make drama and then unnecessarily involved others in that drama.",
          "id": 270,
          "comments": [
            {
              "score": 58,
              "content": "I always find that my cupcake recipes make at least a couple of cupcakes extra anyway. I have two 12-hole tins and a 6-hole tin for the \"spares\", so I can put them all in the oven at once (and the tins nest so it doesn't take up that much extra storage space). That way I can make a \"full batch\" of 24 and be guaranteed to a) have a couple for myself, and b) can pick the best decorated to take to a party.",
              "id": 271,
              "comments": [
                {
                  "score": 2,
                  "content": "She also could have done mini muffins and make double. So there's extra.",
                  "id": 272,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly. A cupcake takes, what, 12 minutes to bake? That's not an unreasonable amount of time and a little bit less out of each one wouldn't make a difference in how they tasted. Hell, make 30 if you dont want to feel like the extra one was specifically made for him. OP went out of her way to exclude Leo and used the opportunity to broadcast it to the office. Even if he chose not to take a cupcake, out of 23 other people, someone would have eaten 2 or taken one home to their SO or kid. Extras wouldn't have gone to waste. YTA",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 100,
          "content": "And a martyr complex too - the way OP words things - it doesn’t take “all night” and “getting up early” to make a batch of cupcakes. Obviously they want a pat on the back for doing something basic.",
          "id": 274,
          "comments": [
            {
              "score": 49,
              "content": "Yeah. Cupcake are easy. One night for 24 ? Did she harvest and makes her own ingrédients ?",
              "id": 275,
              "comments": [
                {
                  "score": 4,
                  "content": "That's what I was wondering.  I made 6 rhubarb pies yesterday (and I harvested my own rhubarb lol) and it took me about 45 mins for prep, including making the pie crusts, and then 2 hours for baking.  \n\nOn a side note, my parents made all the cupcakes for my wedding and it took dad 3 hours to make 200.",
                  "id": 276,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That’s impressive!  There’s no way I could make 6 pies in under an hour.  It takes me 30 minutes for one.",
                      "id": 277,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Seriously though, because they said they LOVE baking and love sharing their baked goods buuut purposely excluded one person. \nJust comes off petty af. We obvs don't know what happened between them as OP said \"events went down years ago\" between them, but the fact is, they put their own foot in it anyway by explaining who they were excluding. \n\nAnd yeah, I got the same vibes reading the post lol.",
              "id": 278,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "I live in an Asian country where the currency exchange rate isn't that favorable. Like when I first started out as a fresh graduate my salary was around USD $5/hr, and it has only slightly increased. USD $5 converted to my local currency was considered a good pay!\n\nMilk, cream, etc all are imported goods and considered a luxury.  Most people used powdered milk but I had to source for fresh milk, butter, cream etc...For the cupcakes....",
          "id": 279,
          "comments": [
            {
              "score": 4,
              "content": "The actual point of my post is that you should have handled the request for a cupcake much differently. Saying, “sorry, the cupcakes are all gone”, is much better than a long winded explanation of why you don’t think one of your colleagues is worth making a cupcake for.  You are just digging the hole deeper by explaining what the cupcakes cost. In most workplaces, there will be people you don’t like. You usually have to find a way to get along well enough to work together. Instead you made treats for every person except one & then made a point of explaining why. That behavior wouldn’t be tolerated in a child’s school classroom. \n\nBut since you brought up the ingredients, why didn’t you just put a little bit less in every cupcake holder so you could make 25 cupcakes instead of 24? True, it’s one more round of baking (15 minutes?) but that’s better than having the whole office talking about you & Leo.",
              "id": 280,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}