{
  "post content": "A couple years ago, a close friend, Ashley, started a long-distance relationship with a guy, Chris. He has been really good to her and after meeting in person a few times, they decided to move in together. I was super happy for her as she had a few bad relationships over the years and it was nice to see her in a healthy one. That joy faded the last couple months before she moved a few states over to be with him.\n\n&#x200B;\n\nThe issue isn't her moving, but that she repeatedly joked about having a baby from Chris. At first, I accepted it as jokes, but over time I realized Ashley was serious.\n\n&#x200B;\n\nFor context, Ashley has two children from a previous previous relationship, ages 10 and 12. Chris absolutely doesn't want kids. He told her this at the start and anytime she hinted possibly wanting more, he shot it down, saying it was a deal breaker. Now, Chris is more than willing to accept her children as her own, because he loves her and after meeting her kids, them as well. He's accepted that they are a package deal with her, and since they are at an age where they are semi-independent, it's not an issue for him.\n\n&#x200B;\n\nTo me, Chris is a real bro for taking on her kids without issue. Hearing Ashley say she wants a baby out of him, \"one way or another\", bothered me to no end. It's hard enough to find a partner that treats you well and accepts children that aren't their own. To find one that does and then talk about plotting to force a baby seems gross and manipulative.\n\n&#x200B;\n\nBefore her move, I had sat down with Ashley, trying to talk sense into her. At first she resisted, but finally it seemed she understood how shitty it would be. After I felt like she had understood, I put the issue behind me and helped support her thru the hassle of moving.\n\n&#x200B;\n\nA few days after she left, I got a call from a mutual friend who delves into the Wiccan/Metaphysical realm. She was distraught and confessed to me that shortly before Ashley's move, Ashley had come to her asking for a fertility spell. This friend didn't feel comfortable about it and refused. When pushed, she said she cast a spell for a healthy and honest relationship, but told Ashley it was for fertility.\n\n&#x200B;\n\nAs you can imagine, I was livid. I messaged Ashley, confronting her about what I learned and she laughed it off as she was desperate, but magic is fake anyway, so what's the harm? She then let it slip, that since Chris was planning on getting a vasectomy in a few months, she had poked holes in their condoms as a last ditch effort.\n\n&#x200B;\n\nAt that point, I couldn't stay silent. I gathered up screenshots of all the conversations over the last few months and sent them to Chris. He understandably freaked out and kicked her out. Now, Ashley hates me because she was kicked out after a huge move and didn't have a job or money to make it back. She said I'm a terrible person for putting her and her kids out on the street.\n\n&#x200B;\n\nAm I the asshole here? Should I have kept quiet?",
  "id": 1,
  "comments": [
    {
      "score": 37177,
      "content": "NTA. YOURE 👏 LITERALLY 👏 SAVING 👏 SOMEONE 👏 FROM 👏 BEING 👏 BABY-TRAPPED. 👏 WE 👏 NEED 👏 MORE 👏 PEOPLE 👏 LIKE 👏 YOU 👏\n\n\n\nEdit: Thank you so much for the awards and the record-breaking 27000 upvotes! :D - 7:30 AM\n\nEdit 2: ty for another gold and 34K upvotes - 1:53 PM",
      "id": 2,
      "comments": [
        {
          "score": 11445,
          "content": "This but without the emojis.",
          "id": 3,
          "comments": [
            {
              "score": 14879,
              "content": "This but without the unnecessary negativity.\nEdit: Wow, I had no idea this would be my most popular comment! Thanks for the karma and awards!\nI would like to add, though, I was reminded by another redditor that screen readers have a hard time parsing emojis, and shouldn't be used as liberally or in between words. Sorry if this came off as ignorant!\n\nEdit 2: Since everyone was such a fan of my first \"award speech\", I decided that make it longer! Thanks every single one of you who upvoted or gave me an award, you really made my day :) and to all the very original comments, I'm glad you all cared enough to take time out of your day to repeat a joke to me, thank you!\n\nHave a fantastic day everyone!!!\n\nAnd OP, NTA",
              "id": 4,
              "comments": [
                {
                  "score": 4916,
                  "content": "This but with so much negativity. Poking holes in condoms is rape, you've changed the consent levels and it's fucking rape.\n\nAs a note, I am a woman and if a man was poking holes in condoms to make a baby with me I would consider it rape. It is the same in a woman doing so with a man. Baby-trapping is fucking rape and it's not okay. She deserves to be kicked out, if it's after an expensive move, that's her own damn fault.\n\nOp, you saved a man from an abusive relationship after he gave so much already to accept her kids while being childfree. You saved him, she is absolute dogshit.\n\nEdit: a couple awards I've gotten state that it should be considered assault. I mean, yes. But also rape. \n\nYes, the big R-word. Rape is rape. I am a rather militant feminist, if a man were poking holes in the condom to trap a woman in to a reproductive-based relationship, it would absolutely be considered rape. The woman doing it is exactly the same. He did not consent to what at this point is essentially bare-backing. He didn't consent to all levels of this sexual encounter, in fact with his choice to use a condom he explicitly did not consent to the sexual encounter being reproductive. She made that choice against his consent, and thus it's rape. \n\nIt's really, really not difficult to understand. He didn't want a baby, he wore a condom to prevent that, she wanted a baby and knew he didn't so she sabotaged the condoms. She is a rapist. He did not consent.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1882,
                      "content": "It's a special kind, called reproductive coercion. Revolting and horrifying in it's own unique way. Fuck everyone who pulls any kind of this.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 770,
                      "content": "THIS.\n\nFeminists have been arguing for some time now that if a man quietly slips a condom off just before sex, it's rape. \n\nBaby-trapping a guy by poking holes in a condom (or even just lying about being on birth control) should also be considered rape. \n\n(And yes, I am a woman and a feminist.)",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 500,
                      "content": "I totally agree with you! For the record, my negativity comment was directed at the anti emoji comment. I truly hope Ashely gets jail time!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 409,
                      "content": "I’m on this side of the line. Ashley is a fucking calculated sociopath, who is responsible for destroying her own relationship and getting herself and her children evicted. In true sociopathic form, she’s completely unable to take any personal accountability and sees nothing wrong with literally stealing another’s person’s right to avoid bringing children into this world. It’s sick, really. She’s not a well person, and her actions paint a genuinely frightening picture. If this is who she is- at her best, when life is fundamentally good- I shudder to think who she is at her worst, most desperate and self serving. When someone is willing- so nonchalantly, at that- to cross such firm, personal boundaries, it’s almost impossible to predict how far they are willing to go in other situations that aren’t going the way they want. \n\nGross.\n\nYou did the right thing. 100% And, frankly, I wouldn’t want her as a friend.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 181,
                      "content": "Fun fact: A man in Canada poked holes in condoms and was charged with sexual assault.   \n\n\nLet's just respect others' fertility decisions and get furbabies out of shelters if we need to parent something so much.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "It’s also considered reproductive coercion for the same reasons you listed. Love the username btw",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "It's rape because the consent was conditional, someone consenting to sex with a condom on is not consenting to sex without one - if it's slipped off secretly during, or holes are poked in that's not the sex they consented to. Sex you didn't consent to isn't sex anymore. That's rape.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Couldn’t agree more.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "As a woman who was pinned to the bed by my throat, having my ability to breathe cut off while raped, *THIS*!!! Sexual contact in a way not consented to is rape. Period.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "100%! Consent to sex is not consent to unprotected sex",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1952,
                  "content": "This but without the negativity. Edit: Wow, I had no idea this would be my most popular comment! Thanks for the karma! I would like to add, though, I was reminded by another redditor that readers have a hard time parsing whole paragraphs, and shouldn't be used as liberally. Sorry if this came off as ignorant!",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1287,
                      "content": "This but without the.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "This but without negativity.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "This but without the award speech edit.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 155,
                  "content": "That's not negativity or being malicious, that's unfortunately founded in a real issue. An emoji after each word and all caps really make it much harder to read. (I can expand on the reasons if you like)",
                  "id": 20,
                  "comments": [
                    {
                      "score": 103,
                      "content": "You know what, your comment actually made me realize that people who use screen readers are really disadvantaged by emojis. Thanks for bringing this back to my attention, I suppose my privilege is showing.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "The manner of speech that people are trying to convey with clapping emojis + all caps should really be its own font / presentation style, tbh.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I find it extremely hard to read stuff like this, or when people put a period after every word. It’s almost like my brain can’t comprehend that they’re all part of the same sentence, so it treats every word between the emojis as a new thought, and I’m fighting with my brain to understand what the message is. \n\nI also have ADHD, so I don’t know if this is common for everyone or if it’s just because my brain is funky already. I haven’t ever talked about it with a doctor because I thought that it was hard for everyone lmao",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 60,
                  "content": "This but without the terrible edit awards speech",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "This but without the awards",
                  "id": 25,
                  "comments": [
                    {
                      "score": 8,
                      "content": "More like this, but without the edit thanking ppl for the awards. Do ppl not know they can thank the person directly that gave them to award and not edit their post like they just won a Golden Globe?",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "This without the edit",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This but without the unnecessary award speech. It's fucking reddit, not the Oscars",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "This but without the cringy award acceptance speech",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "r/awardspeechedits",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "This edit is such a cringey reddit stereotype. Nevermind, the whole post is. And the fact that it has double the amount of positive response compared to the sensible one you're replying to... 🙄",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 170,
              "content": "But surely there's no other way to convey emotion?",
              "id": 32,
              "comments": [
                {
                  "score": 217,
                  "content": "You don't have to be against any and all emojis to hate monstrosities like that. Outside of reddit, I use emojis frequently. However, putting a (clapping) emoji between every word makes it incredibly annoying to read.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Also makes it a mess to read for screen readers. \n\n(Happy cake day!)",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "TIL what that emoji even was. Can't really tell by looking.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "This. Exactly this. Thank you.\n\nHappy Cakeday btw!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 116,
                  "content": "[deleted]",
                  "id": 37,
                  "comments": [
                    {
                      "score": 142,
                      "content": "WRITING [enthusiastic clap] IT [enthusiastic clap] OUT",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "\n>But surely there's no other way to convey emotion?\n\nEasier emojis while typing?, like \"I hate my life ;)\" is more cute, it can also looks like you're screaming >:V , or shocked :-O , or has a unibrow }:‑)",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 134,
              "content": "NTA. YOURE LITERALLY SAVING SOMEONE FROM BEING BABY-TRAPPED. WE NEED MORE PEOPLE LIKE YOU. :)",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "R/Redditmoment",
              "id": 41,
              "comments": [
                {
                  "score": 43,
                  "content": "r/foundthemobileuser WHOLESOME 100 /s",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "This but with emojis clapping on beat.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "This but potentially with extra red flag emojis.",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "hAhA EmOJi bAd vErY FuNNy NoW GiVe UpVOTe",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "I think the emojis were justified for this specific comment. And most definitely NTA",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "That but with twice the emojis.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Reddit moment",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 663,
          "content": "Seriously, OP, THANK YOU for doing this. You not only saved Chris- you saved that potential child as well. No one deserves to come into the world under such disgusting and manipulative circumstances. Ashley's the only person who put her and her kids on the street. If only she had enough self-awareness to realize how horrible it is that she's forcing her poor kids to suffer the consequences of her awful actions.",
          "id": 49,
          "comments": [
            {
              "score": 39,
              "content": "As someone who came into this world because my dad told my mom he couldn't have children because of something he had when he was a kid (because he basically didn't want to wear a condom), you're totally right, no one deserves that, it's basically sexual assault",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 320,
          "content": "Just because it’s the top comment \n\nBut isn’t poking holes in condoms sexual assault?",
          "id": 51,
          "comments": [
            {
              "score": 117,
              "content": "> isn’t poking holes in condoms sexual assault?\n\nDepends on the location, it can be sexual assault, aggravated sexual assault, or even (in some places) rape.",
              "id": 52,
              "comments": [
                {
                  "score": 9,
                  "content": "But even in this type of situation, the man still ends up on the hook for child support.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "In Canada it's sexual assault (we don't have a crime called \"rape\"; it's all various levels of sexual assault).",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 49,
              "content": "If not, it should be.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 179,
          "content": "[removed]",
          "id": 56,
          "comments": [
            {
              "score": 10,
              "content": "[deleted]",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 156,
          "content": "This, because baby-trapping is reproductive coercion, sabotaging condoms is stealthing, and stealthing is rape.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Preach. You saved that man from a life of misery and that possible future kid from having a manipulative, evil mom and a father who never wanted him. It would have been heartbreak all around, and frankly good riddance for your friend. She isn’t good friend material, let alone good partner material. That’s such a sick thing to do!!! NTA, I’m only sad for the kids she already has, hope they at least have a good dad.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "Baby-trapped? How about raped",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "I think your space bar is broken.",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "This but without..holuuuup.....wait fertility spell?",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "But also, any guy reading this if you don’t want a child, wear a condom",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8585,
      "content": "NTA. You didnt get her kicked out, she did with her deceitful and potentially very harmful behavior. This is worse than cheating on someone imo. Can you imagine if it were the other way around and he were the one poking holes in condoms? Ppl would drag him through the mud, and pretty sure its illegal to do in many places. Choosing to be a parent or not is incredibly personal and should never, ever be a coerced decision. \n\nConsidering how awful and disrespectful she is to someone she was supposed to be in love with, I dont think you're losing out on much of a friend here. You're a hero in my eyes.",
      "id": 64,
      "comments": [
        {
          "score": 955,
          "content": "[deleted]",
          "id": 65,
          "comments": [
            {
              "score": 528,
              "content": "And illegal in some places I’m fairly sure",
              "id": 66,
              "comments": [
                {
                  "score": 435,
                  "content": "God I wish this was illegal everywhere.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 224,
                      "content": "Yeah same. Happened twice on my college campus and the guy didn’t even get expelled",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "This is so one of those \"You mean its not?!?!\" moments because it should be.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 479,
              "content": "It’s not just reproductive coercion, it’s rape.\n\nThe sex is consensual as long as it is with a condom. Poking holes in a condom is sexual assault as much as taking off the condom during sex without the other partner knowing.\n\nIt’s a complicated issue, but if I were Chris I’d be filing a police report. You did the right thing OP, we’re proud of you!",
              "id": 70,
              "comments": [
                {
                  "score": 225,
                  "content": "Yes, this is stealthing which in many jurisdictions is considered sexual assault or rape.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "I was coming here to say that, we need to stop calling rape by other names. We need to normalize calling it what it is.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "A lot of places only count it as rape if he was penetrated(which is a really dumb rule). He should definitely report it though and see if something can happen.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Reproductive rape is what it is.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Isn’t it considered rape (in some places) to have sex with someone while lying about the circumstances? That man had agreed to SAFE sex, he did NOT, very clearly, agree to unprotected sex. Not having full consent is rape. OP saved that man from things turning real ugly.",
              "id": 75,
              "comments": [
                {
                  "score": 38,
                  "content": "Yep. The social definition of rape would be what you said. The legal definition is highly variable by country, state/region, and even city.\n\nSome places still do not enable women to be charged with rape. Some only will charge a male victim's rapist if he was penetrated. Typically a lessor crime is used, sometimes even just a misdemeanor battery/assault. In some places women cannot be charged with anything basically, as \"intercourse is only possible if the man is hard, and if the man is hard it means he wanted it\".\n\nThe issue for a lot of places is that the legal definition of rape involved penetration of the victim. Luckily more and more places are broadening the definition of rape to include really anything sexual that was not consented to. Some areas are just adding more potential crimes to the legal guidelines like reproductive coercion.\n\nReproductive coercion (rape) is scary as hell. It is just so unbelievably shitty. All rape is horrid, but the notion that someone thinks it is okay to trick someone into having a child is abhorrent, regardless of whether you are female or male. \n\nA woman could roofie a guy, rape him, get pregnant, and then demand child support for the next 18 years. From what I've read being raped is not a defense to get out of child support. Courts do not care about circumstance, only that two individuals provide financial support to the child.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Its called rape.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "I would argue this could even be seen as a form of rape/sexual violence under some legal jurisdictions.",
          "id": 78,
          "comments": [
            {
              "score": 220,
              "content": "I know in a lot of places, taking off the condom/ not wearing one while your partner thinks you are is sexual assault. This is the same thing as the conditions of the sex you agreed to arent the same",
              "id": 79,
              "comments": [
                {
                  "score": 76,
                  "content": "I was gonna say the same thing. If you don't consent to the same conditions, you really haven't consented at all.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This is the equivalent of stealthing. He consented to sex with non compromised contraception, not sex with ruined contraception. OP is NTA.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "[deleted]",
              "id": 82,
              "comments": [
                {
                  "score": 3,
                  "content": "~~It's... really not, it IS rape, but it's not considered domestic violence. Sexual abuse, but a different thing legally to violence~~",
                  "id": 83,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It's specifically a type of domestic abuse called **Reproductive Coercion**, as well as probably also being rape/sexual assualt depending on jurisdiction. Often it's paired with **Financial abuse**. Just in case anyone on here needs the words to start googling.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "This! And a baby is not a relationshiip tool! How sad i feel for the other kids if this is their mom's mo!",
          "id": 86,
          "comments": [
            {
              "score": 73,
              "content": "Absolutely. The more I think about this situation, the more my mind is blown by this woman's audacity. I truly believe she needs some serious help. She wasn't thinking about her partner in this. She wasn't thinking about what kind of life the child would have being born to a parent that really didn't want it. She wasn't even thinking about herself, bc ofc forcing someone into being a parent would lead to resentment and usually ruins the relationship. Its so bizarre.",
              "id": 87,
              "comments": [
                {
                  "score": 7,
                  "content": "Sounds like she rationalized it to herself as no big deal. She was probably fantasizing that \"he may not love babies now, but he'll totally change his mind and love it if it's *his* baby!\" which is extremely selfish, unrealistic, and disrespectful to her partner and her children.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "It's hard for me to understand what the end game was. Was OPs friend trying to trap her boyfriend into staying in a relationship with her because they had a baby together? A baby he clearly dosen't want to the point that he is scheduled for a vasectomy? Does she want to be in a relationship full of resentment? I don't get it.",
              "id": 89,
              "comments": [
                {
                  "score": 31,
                  "content": "> Was OPs friend trying to trap her boyfriend into staying in a relationship with her because they had a baby together? \n\nYes.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 8,
                      "content": "You would think she would know better given she has 2 kids from defunct relationships already...",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I suspect she wanted a baby not to trap him but to have a baby. A baby was more important to her than anything - more important than her relationship or her current children.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It begs the question were her 2 kids conceived that way? 🤔",
              "id": 93,
              "comments": [
                {
                  "score": 4,
                  "content": "Yrp!",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "It’s considered tampering with property in most places. It doesn’t matter who bought it either, it’s a product used between two people so if one pokes holes in it that one person gets in trouble",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Ashely should have thought about losing a home before trying to baby trap him. That is her own fault and even if she did get pregnant, it is likely he would kick her out and tell her to find another place to live. I feel bad for the kids here, their mother clearly only thought about her wants and her wants alone. Seriously, screw you Ashley, very few people like or have sympathy for baby-trappers.",
          "id": 96,
          "comments": [
            {
              "score": 12,
              "content": "And the ones that like or have sympathy for baby trappers are awful people themselves.",
              "id": 97,
              "comments": [
                {
                  "score": 11,
                  "content": "Yup. They enable crappy behavior for their twisted sense of morals.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Hijacking this comment to say 100% agree with this.\n\nAlso, does anyone else see the irony in lying about a spell when secretly casting one for 'honesty in the relationship'? Resulting in a person walking away believing they are *more fertile* and more likely to succeed in pregnancy, so are now ready to make further deceptive attempts at reproductive coercion? That shit's messed up.",
          "id": 99,
          "comments": [
            {
              "score": 4,
              "content": "I'd say the irony is that the spell cast for honesty worked",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I know saying you will use a condom and then not doing so has been classified as rape in some cases at least, because consent was given under certain conditions that were not upheld and therefore the concent is no longer valid.\n\nNot sure if this situation has any examples in the court room but it definitely follows the same reasoning. I do think in the example I gave part of the issue was the potential for serious bodily harm due to not using protection, as in pregnancy and STI.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4011,
      "content": "NTA and I'm guessing her previous bad relationships were partially her fault,  she needs professional help",
      "id": 102,
      "comments": [
        {
          "score": 946,
          "content": "Yep. If you're the common denominator what does that tell you?...",
          "id": 103,
          "comments": [
            {
              "score": 542,
              "content": "Well, technically, you’re the common denominator in all of your relationships",
              "id": 104,
              "comments": [
                {
                  "score": 286,
                  "content": "Exactly my point.  So if someone has had a long string of shitty relationships, maybe it's not everybody else's fault.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 212,
                      "content": "If you think everyone is an asshole, maybe it's *you* who is the asshole instead.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 74,
              "content": "I mean, this is true in some cases for sure.. However, there is something to be said for toxic individuals seeking out vulnerable people.",
              "id": 107,
              "comments": [
                {
                  "score": 24,
                  "content": "And when you're in an abusive relationship once, your brain relearns what love is supposed to be. After I left a 5 year abusive-filled holy fuck get me out of here relationship, my next 3 relationships after that were steadily \"not as bad\" as I progressively went through therapy and eventually got into a pretty healthy relationship. Once in the healthy relationship at first I was like... What do you mean you actually care about me?",
                  "id": 108,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Thanks for this comment. I just figured out why I’ve had such epically awful relationships starting with a very abusive one.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Ok, while I get that argument for general things of someone claiming all their exes were (x trait), I will make an important distinction:\n\nBad relationships, this may stand. Abusive relationships, abusers tend to look for particularly vulnerable people, and people with previous abusive relationships are perfect targets. Going through stuff like that can do a lot of damage and leave you with some very toxic stuff, and therapy is really important to unraveling that. We don't know that they were abusive, but I felt it was important to state this, because it's a particularly nasty stigma that can mess with your head on top of what the abuse already did.\n\nThat's not to say that someone doesn't have a personal responsibility to get help where they can and do the work to heal, so that they break the cycle rather than inflicting the toxic ideas on someone else, it's just to say that if someone has been in a string of abusive relationships, ESPECIALLY if they come from an abusive childhood, pulling the \"common denominator\" card kinda sucks and ignores that there's more than one common denominator, at minimum being that all of those people were abusers.\n\nSorry for the rant. I just felt like it needed to be said.\n\nThis situation is terrifying and she absolutely needs to get help, OP is a good person that saved everyone involved (including the would-be-3 kids) from a lot of pain and distress. NTA at all.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 170,
          "content": "My guess is she is baby crazy. She chose crappy dudes previously because she'll look past anything for the baby. Including sabotaging a great relationship.\n\nI cannot understand these people. I'm a parent and it still bewilders me.",
          "id": 111,
          "comments": [
            {
              "score": 43,
              "content": "[deleted]",
              "id": 112,
              "comments": [
                {
                  "score": 25,
                  "content": "I've never heard anyone who actually considers it a medical condition. It's a slang term for this woman's selfish attitude. She wants another baby in the sense that she wants a cute little babydoll toy that she can show off and play dress-up with, and she selfishly puts that fantasy over consideration for any other people.",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "If I had to analyse it I would say she is likely super, super insecure and cannot understand why someone would stay with her without a shared responsibility like a child. If she is the mother of his child, he HAS to be around her, otherwise she may think he just moves on.   \n\n\nNot saying that justifies her actions btw - she's a horrible, horrible human being.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2716,
      "content": "NTA. I don’t know in what universe you would think you’re the asshole- your “friend” is trying to force someone into a lifelong commitment they don’t want by lying and deceit. You absolutely did the right thing, don’t lose any sleep over it and cut this toxic person out of your life immediately.",
      "id": 115,
      "comments": [
        {
          "score": 690,
          "content": "I can understand feeling like the asshole in this situation, since a good friend is mad now. I’m sure she manipulated all of her friends the same way she manipulated her boyfriend, so they are better off without her. \n\nBut yes, 100% NTA",
          "id": 116,
          "comments": [
            {
              "score": 188,
              "content": "> a good friend\n\nYeah, about that...",
              "id": 117,
              "comments": [
                {
                  "score": 65,
                  "content": "She can be an asshole to one friend and still be a good friend to another.\nI completely disagree with what she was doing  but that doesn't automatically make her a bad friend to OP.  \nI'm not a fan of these blanket statements.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 90,
                      "content": "Yeah but would you really want to be friends with someone who basically raped the man she “loved”? Idk she could be the best friend ever but I’d still distance myself from someone like that, especially having close friends who were rape victims.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "I'm so confused by the whole situation. Why does Ashley want to have a baby with somebody who is all, \"EW BABIES\"? Does she think that dynamic will make for a happy home life?",
          "id": 120,
          "comments": [
            {
              "score": 148,
              "content": "[deleted]",
              "id": 121,
              "comments": [
                {
                  "score": 42,
                  "content": "Bingo.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Which is madness because... she has multiple kids already with other people.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Who’s willing to bet the kids she’s already got were conceived through reproductive coercion too?",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "yeah",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "So much this!\n\nMy husband's ex did this to him... Twice! He stayed with her crazy ass for 11 years!\nJokes on her though, I've got him, and we've got the kids!",
                  "id": 126,
                  "comments": [
                    {
                      "score": 7,
                      "content": "i'm glad you have the kids - they need someone that wants them as individuals, not tools.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "\"He will change his mind when he meets OUR baby.\" -Ashley, definitely.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Because some people think everyone automatically loves a child they were forced to have and that it'll keep them there because \"oh look at our bundle of joy\"",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "\"They're different when they're your own.\" She was going to 'teach' him to love babies; how enlightened!",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I agree with everything you wrote, but cutting that toxic person out of their life was the best advice!",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Happy cake day!",
          "id": 132,
          "comments": [
            {
              "score": 9,
              "content": "Thank you! :)",
              "id": 133,
              "comments": [
                {
                  "score": 6,
                  "content": "Happy cake day!",
                  "id": 134,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Happy cake day!",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Happy cake day!!! Also you're totally right.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1385,
      "content": "NTA, this sounds like female on male  rape(aka forcing/tricking him to penetrate her in a way he didn't concent to...)",
      "id": 137,
      "comments": [
        {
          "score": 1404,
          "content": "It's called reproductive coercion and it is a very real form of assault and abuse",
          "id": 138,
          "comments": [
            {
              "score": 177,
              "content": "Tell that to the courts.",
              "id": 139,
              "comments": [
                {
                  "score": 240,
                  "content": "It's super unfortunate not everywhere considers this assault to be what it is. There are tons of resources online for victims (though most are aimed at women) to reach out to, and networks to help these victims",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "You can't even get someone arrested for standard rape most of the time, the system really fails when it comes to sexual assault",
                  "id": 141,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I agree that the system really fails at these crimes, but the issue lies in the fact that most of them are he said/she said situations. You need definitive proof of a crime to convict someone, and most of the cases where the crimes occur in sexual assault/rape/coercion, you aren't going to have a way to get that proof.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "Sexual assault I think. You consent to sex, not each different aspect of it. If you outwardly express that you don’t want to do one thing, and the other person does it anyways, that’s sexual assault. Just as bad as rape, imo, but has a different name.",
          "id": 143,
          "comments": [
            {
              "score": 100,
              "content": "Any time a person is forcing or tricking someone into a reproductive decision they don’t want, it’s called “reproductive coercion” and you’re right—it’s a form of sexual abuse and domestic abuse. You’re also right to point out how it’s different than rape, because it can involve consensual sex or it can include rape. It can be deceiving someone regarding birth control, forcing someone to have or not have an abortion, etc.",
              "id": 144,
              "comments": [
                {
                  "score": 42,
                  "content": "It’s arguably rape and a current topic of debate. In these cases sex is conditional on a use of birth control (with the possibility of failure being part of that decision). If the bc is tampered with or secretly removed, consent for sex would not be given and would not fall into the exception carved out by bc not being 100% effective due to the deceitful act.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Ugh. This spoke to my soul and is so much of the reason I don’t date anymore.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "absolutely!!!",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1219,
      "content": "NTA. Poking holes in a condom when it’s plain as day that he doesn’t want kids is horrifying. I mean seriously, that sounds psychopathic. 100% bravo on saving that dude. She will always hate you because you interrupted her selfish happiness. Best to let that friendship go man.",
      "id": 148,
      "comments": [
        {
          "score": 300,
          "content": "I second this, and also just wanted to chime in: I’m a girl who *wants* kids someday and I would be *livid* if someone did this to me. I don’t care if we’re married/in a long term relationship, if we haven’t both discussed it at length and agreed to start “trying” then you should never be tampering with that shit, whether it’s poking holes in a condom or like, hiding my birth control. The fact that he actively doesn’t ever want kids is just awful icing on this shitty cake.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "What's sick is she would have gotten away with it if she hadnt talked about it",
          "id": 150,
          "comments": [
            {
              "score": 19,
              "content": "Like an evil villain monologuing their plans to the hero!",
              "id": 151,
              "comments": [
                {
                  "score": 19,
                  "content": "She's evil AND stupid.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Indeed she is OP is so NTA 1,000 times over and then some.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Agreed, and I doubt she only told two people too, if she jokes about it like it’s nothing!  Many people likely let it go as a joke (or none of their business) but OP saw the 🚩, asked questions, followed up, reasoned with her - OP, you are no doubt a hero, totally NTA!",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 644,
      "content": "NTA, lying about being on birth control and poking holes in condoms etc. are acts of sexual assault. You absolutely did the right thing by letting him know",
      "id": 155,
      "comments": [
        {
          "score": 150,
          "content": "This!  Depending on where you live, this is actually a prosecutable offense.  Flip the story for your friend—would she have wanted you to tell her if she was trying to prevent pregnancy and her bf was sabotaging her?  Of course!\n\nYou’re absolutely NTA, OP.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 394,
      "content": "NTA. What she was doing/planning on doing is absolutely despicable. This is the consequence of her actions. It's not like she was planning on getting a plant without his permission. She was actively lying to him and *poking holes in condoms* what is wrong with people?",
      "id": 157,
      "comments": [
        {
          "score": 8,
          "content": "Also, apparently she can't even take care of the two kids she already has because she doesn't have a job. How can she care for a third? That poor bugger would forever be trapped, paying child support to a child he didn't want in the first place.\nAaah, the horror.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 261,
      "content": "NTA. You actually saved his life from becoming disastrous. He deserved to know the kind of person he was with. They'd have brought a child into a house where it's dad wouldn't have wanted them. She's a horrible and manipulative person and she absolutely deserved being kicked out. She deserves to face the consequences of her actions.",
      "id": 159,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 254,
      "content": "NTA. If she poked holes in the condoms without telling him that’s rape. You did the right thing.",
      "id": 160,
      "comments": [
        {
          "score": 39,
          "content": "I'm confused how is that rape? And not saying what she did isn't wrong. It 100% is but I just don't understand where rape came from\n\nEdit: ok I've already had several people explain to me. I understand now. Thank you",
          "id": 161,
          "comments": [
            {
              "score": 163,
              "content": "He consented to protected sex. He didn’t consent to unprotected sex. She effectively deceived him into having a kind of sex he didn’t want to, which is rape.",
              "id": 162,
              "comments": [
                {
                  "score": 45,
                  "content": "Ok. I understand that now. Thanks for explaining :)",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "It’s the same as a guy slipping off a condom partway through after agreeing to wear one",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Changing of the circumstances of consent",
              "id": 165,
              "comments": [
                {
                  "score": 5,
                  "content": "Ok. That makes more sense. Thank you for explaining :)",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "The idea is that his consent hinges on the sex being reasonably protected from pregnancy. She took away the thing his consent hinges on, meaning he didn’t consent to the type of sex they were having.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "For more info, you can check out stealthing. An existing similar situation which has already gone to courts.",
              "id": 168,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "It’s called reproductive coercion and it’s a form of sexual abuse",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}