{
  "post content": "My lovely girlfriend and I have been together for 8 months. She slept over at my place last night, and in the morning she woke me up saying she had went out and brought back a couple of lattes and pastries from a coffee shop around the corner from my apartment for breakfast.\n\nMy issue with this is that my apartment has a two factor entry, first my student ID to scan in and then my key to get back into the apartment (it auto locks).\n\nI asked her how she was able to get back into the apartment and she said that she grabbed my keychain (which has my ID on it in a wallet type thing) before heading out to buy us breakfast so she would be able to get back in. I told her that I didn’t appreciate her violating my privacy like that, and she got upset, saying that she was just trying to do something nice for me. We started to fight about it and I ended up asking her to leave.\n\nSince then, she hasn’t answered any of my texts or calls. When I told my roommate about this he said that I was the asshole because she did something thoughtful for me and I yelled at her about it. I think she was violating my privacy by stealing my keys. AITA?\n\nEdit: I thought it was weird that she took my keys without asking, they could have gotten stolen or something while she was out, I get that she was being nice but why couldn’t she have asked??\n\nEdit 2: and no she still hasn’t responded to me\n\nEdit: I’m at work now obsessing but I know that I screwed up. I had a bad experience with privacy in my last relationship and i guess I’m projecting or something. And no, my girlfriend hasn’t responded to any of my voicemails or texts besides sending back money I tried to send her for the breakfast last night but she might not be awake yet, it’s early in my time zone\n\nFinal edit because people keep messaging me: long story short, she texted me and we met for coffee earlier this afternoon. I brought her flowers and apologized for being insane. We had a long talk about my privacy issues from my last relationship.  She chose not to break up with me, she will be getting lots of dates and back rubs in the future.\n\nAlso, I am already in therapy but thanks for suggesting it",
  "id": 1,
  "comments": [
    {
      "score": 29447,
      "content": "Oh man! I hope this red flag is enough of a warning for her.\n\nEdit: YTA",
      "id": 2,
      "comments": [
        {
          "score": 12225,
          "content": "What privacy was violated?? \n\n\nOP, bro, definitely YTA.",
          "id": 3,
          "comments": [
            {
              "score": 7404,
              "content": "I'm confused as to how he thinks his privacy was violated. She was already in the room with him. It's not like she sneaked off with them one time, made copies, and broke in to his apartment with coffee while he was asleep.",
              "id": 4,
              "comments": [
                {
                  "score": 3747,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2656,
                      "content": "No shit, gets up... Goes out and returns with breakfast...\n\n\nOp the control freak \n\nYta",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 655,
                      "content": "Speaking of. Swing her number my way when she breaks up with you OP. This kinda treatment is rather warm and fuzzy.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "If she wants to come over, sleep with me then go buy me breakfast, she can run a damn credit check for all i care.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2253,
                  "content": "OP sounds like someone who needs to be in control of any given situation. I would be surprised if he actually thinks it's violating his privacy, but he's using that term to loosely hang on to any sense of self-righteousness he's feeling right now. He knows somewhere in the back of his mind that he has no ground to stand on. Instead of admitting that he was wrong, he's choosing to stand by his initial reaction, which was to get angry at someone doing something nice for him.\n\n\nIt's a bullshit excuse, but in OPs mind it's better to *feel* right all the while digging himself a hole the copper industry would be envious of.\n\n\nI was that person once. And it took ruining many good relationships and a lot of regret before I changed. Hopeful OP matures out of it.\n\n\nIn the meantime, YTA OP.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 489,
                      "content": "This hit the nail on the head. It's pretty much human nature to have a gut reaction and then try to rationalize it afterward, but you need to be able to admit when your gut reaction was wrong.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 279,
                      "content": "I think you're describing classic narcissistic behavior. If that's true, the poor girl should run for her life.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Even better, he kicked her out after losing his shit over it and now somehow is still wondering why she won't talk to him. This for me is the real mystery.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I had a friend ike that.\n\nHe never grew out of it unfortunately... no longer a friend either.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Yup. He's just digging in his heels on this one. What if she'd forgotten her toothbrush in her car? She should have to *ask OP for permission to leave the apartment and reenter*? She can't just grab the keys and run out? What if she was a smoker, she'd have to **ask** every time she wanted to step outside for a smoke because she can't touch OP's keys without permission? \n\nYTA OP.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 707,
                  "content": "Yea I thought he was gonna say that she either stole his keys and took his car (which I think would be a no asshole situation bc I could understand being upset if someone drove your car without your knowledge but at the same time I wouldn't call her an asshole for it either bc she was just trying to do something nice) or stole his keys and made a copy (in which case she would be the asshole bc that's just creepy to do without the explicit knowledge and consent of the key owner) so this post really threw me for a loop bc I just could not figure out how she was invading his privacy by leaving from his place where she was already at and taking his keys so she could return without waking him to surprise him.\n\nAnd then like the edit just makes it worse imo bc he says she could have either lost them or had them stolen from her and like if they got stolen from her I would imagine she would have gotten mugged bc I don't see her setting them down anywhere to go order some coffee and pastries to go, at least I never set my keys down when ordering or grabbing something to go. So like if she got mugged and they were stolen would he not be more concerned about her welfare than his keys?? \n\nTruly bizarre",
                  "id": 15,
                  "comments": [
                    {
                      "score": 829,
                      "content": "It's 8 months into a relationship and he doesn't trust her with keys and an ID. That says all you need to know about this situation.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 303,
                      "content": "i guess he thinks she is a child and not an adult? Just someone who is not capable of taking care of things, not like him anyway. He would never lose his keys or id - not like his gf. 😦",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 110,
                      "content": "Even if she lost them, I guarantee that she will be extremely sad and regretful since all she wanted to do is do something nice for him and she goes and causes an inconvenience for him. She might even have helped pay for a locksmith to make another car key (I'm guessing the dorm would have spares for his door)",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Bizarre is the right word. Keys are suddenly private? And that edit was truly off kilter thinking someone might steal the keys. Sounds like there is some paranoia involved. This is one of the weirdest posts I have read on this sub.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Lol. She sleeps in his flat, uses his bathroom, touches OPs tiny weiner—but his **keys**?!? A man can only take so much",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Literally! How can he trust her enough for her to stay the night, but not to briefly use the keys?? He's just spent hours lying in the dark, unconscious, and she could have done/stolen *anything she wanted*, and what she did was **bring breakfast**. I'd be relieved, not angry.\n\nI have OCD and anxiety, so definitely some control issues. I'd be uncomfortable knowing things have been going on while I slept, and that the door may not have been secured the exact way I like, etc, but OP has felt that and *ran* with it.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Wait...maybe she did make copies, yeah, that's it and the rest will come later... Doubtless it's all part of her master plan, go with the guy for 8 mo., gain his trust (well, not HIS trust, I mean) and wham, make your master plan move!",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 923,
              "content": "This. YTA. She did something nice.  OP, If you do feel that way, you could have had the conversation in a way that you will forget about this incident and tell her not to do this again.",
              "id": 23,
              "comments": [
                {
                  "score": 574,
                  "content": "I’m really struggling to think of a key related scenario where a flip out of this magnitude is warranted. The girlfriend sounds like a total sweetheart. Hope OP didn’t completely fuck himself over.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 868,
                      "content": "My now-husband got mad at me for taking his keys to go to Starbucks while we were out of town once. I woke up early, before everybody and wanted coffee, so I dug his keys out of his pocket and left. He called me super upset and I just couldn't understand why. We lived together! It should not have been a thing. He was waiting for me when I pulled back in the driveway and gave me the third degree. I was so ticked at him and spent a good hour bitching to his sister about what an ass he was being. Turns out he had an engagement ring in the same pocket of his jeans and he ended up proposing to me later that day. He was flipping out because he thought I found the ring. It makes for a funny engagement story.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 279,
                      "content": "Only time I ever got mad at a gf over keys was when she left for a conference in DC and accidentally took my keys with her. I didn’t realize until she was in DC and I was in northwest Pa. only reason I was even mad was I had to be about 100 miles away in 3 days for jury duty. I didn’t yell or anything at her I just told her she had to fedex me my keys and do the overnight delivery so I was able to get to jury duty",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I was waiting to hear the keys were to his Ferrari or something\n\nYTA",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Actually, I hope OP \\*did\\* completely fuck himself over, because then sweetheart GF gets rid of his controlling ass and maybe, just maybe, he starts to recognize he has a problem. That would be a win-win.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I hope he did. She probably deserves a lot better.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She sucked his dick already- privacy already breached. She didn't go through his phone or laptop or anything. WTF is he on about.\nYes control freak, yes I hope she never answershis call again except to say fuck off, and YES YOU ARE THE ARSEHOLE YTA YTA YTA🤯🤯 her I'm mad and scared for her! Run girl! I suspect we have a future hitter on our hands.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2930,
          "content": "YTA!! Dude are you being serious right now?!? She got up and did something nice for you! She probably just grabbed the keys because she didn’t want to have to call you and wake you up to ruin the surprise she had worked out in her head! If she would have like stollen your keys to go make a copy and come back which is where I thought this post was going at first it would be another story. Fuck man you screwed up and probably lost your GF over it! How exactly do you feel she didn’t respect your privacy, this post baffles me!!!",
          "id": 32,
          "comments": [
            {
              "score": 1070,
              "content": "> probably lost your GF over it\n\nI was confused at this part because I kind of skimmed the post. I thought this was like a couple dates in because of the context.... But gf of 8 months?! Other guy is right... serious trust issues.",
              "id": 33,
              "comments": [
                {
                  "score": 269,
                  "content": "Dude has control issues. I've been in her shoes, OP. I hope she's out of there and surrounded by supportive friends. YTA.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I didnt remember the 8 months part when I voted YTA but wow",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Holy shit I missed that too.  What a wanker (well he will be now)",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "Dude has trust issues...",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 209,
              "content": "Ikr she was being nice and he’s acting like she did something wrong all because she didn’t ask!! Some girls wouldn’t do stuff like this.",
              "id": 38,
              "comments": [
                {
                  "score": 317,
                  "content": "Her love language is clearly acts of service. I can’t  imagine shitting all over someone for demonstrating their affection for me.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 21,
                      "content": "IKR if he had half the mind he’d do anything he can to make it up to her but he’ll probably just let her go..... it really annoys me when someone can’t see how good they have it with their partner !!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "“Love language”- it’s nice to see this familiar term being used on Reddit.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This cannot be real. If it is, OP is forever alone. I'm surprised she stuck with him for 8 months to be honest. If he's that picky, at that point I wouldn't even mind if my girl used my card to buy us breakfast. Dude is gonna wake up one day and wonder why he's alone.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1616,
          "content": "I'm not usually on the \"dump whomever over whatever little thing\" thing reddit does but...\n\nI agree.\n\nOP, YTA. Go find this girl and apologize to her.\n\nAre you fucking serious? She went and got your breakfast. Girls like her are to be treasured AND YOU FUCKING YELLED AT HER?\n\nShe probably cried, too. Sounds like a really wholesome girl.",
          "id": 43,
          "comments": [
            {
              "score": 305,
              "content": "petition to find the gf and welcome her in the r/wholesomememes community",
              "id": 44,
              "comments": [
                {
                  "score": 163,
                  "content": "[deleted]",
                  "id": 45,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yes. I volunteer to make her muffins and kona coffee. That girl is 100% solid gold.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I really hope he stays the fuck away from her, she sounds really nice and I'm pulling for her to find a boyfriend just as sweet. The OP has massive issues of he's this controlling and angry.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "And kicked her out of his apartment!",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "No save the girlfriend get her far far away from this guy. No reconciliation!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 326,
          "content": "I wonder how many she's already missed...",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 318,
          "content": "You should add \"YTA\" so your judgement is counted \n\n&#x200B;\n\n:)",
          "id": 51,
          "comments": [
            {
              "score": 63,
              "content": "I don’t understand the people that comment on here and don’t give a judgment, never mind the people that upvote the comments without judgements!",
              "id": 52,
              "comments": [
                {
                  "score": 98,
                  "content": "I feel pretty confident that the tally isn’t going to be too close on this one. I’ll add a YTA here for good measure since I didn’t leave it on my last comment.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Replies to comments with judgments aren’t actually counted for the final vote",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "sometimes im so offended, disgusted, think its a shitpost, etc. to GAF about posting a verdict.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Seems like it was, since she won't respond to him.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "For real. Op is totally a YTA.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I can't get over the part where he kicked her out. For buying him breakfast. I hope she dumps his ass. Such a baby.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yeah! What type of horrible person sleeps with someone and then, without waking them in the morning, pops out to the shops and brings back pasties? \n\nI could use such an asshole in my life.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "i hope she never returns his phonecalls and texts. YTA",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22127,
      "content": "YTA. Your ex girlfriend was being nice. It’s not like she stole them to make copies. She just wanted to be nice.",
      "id": 61,
      "comments": [
        {
          "score": 11271,
          "content": "DAMN “ex” girlfriend.. youre a madman. i like it.",
          "id": 62,
          "comments": [
            {
              "score": 526,
              "content": "[removed]",
              "id": 63,
              "comments": [
                {
                  "score": 14,
                  "content": "Rule 1 friendly reminder....",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "*How to blow something completely out of proportion 101*",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "r/madlads",
              "id": 66,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Madlad*",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3533,
          "content": ">ex girlfriend\n\nHoly fucking shit my dude, savage as fuck...",
          "id": 68,
          "comments": [
            {
              "score": 15,
              "content": "Unfortunately it’s likely true, reading his last edits. The girl is sending back the money he’s trying to send her for breakfast. She mad, and at least for now wants nothing to do with the dude.",
              "id": 69,
              "comments": [
                {
                  "score": 6,
                  "content": "Which is honestly completely fair, this is a GIANT red flag for the relationship, she tried to do something nice and got yelled at for basically no reason.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It’s literally the “how could you say something so controversial yet so brave” meme.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2101,
          "content": "Not to mention she was totally upfront about taking your keys so its not like she was trying to hide anything so.... YTA",
          "id": 72,
          "comments": [
            {
              "score": 33,
              "content": "They're 8 months together and haven't had a discussion yet about personal items / personal space and disclosure expectations?",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1813,
          "content": "and his next excuse that his keys \"could've gotten stolen or something while she was out\"... how would her asking him have helped in any way with that situation lmao",
          "id": 74,
          "comments": [
            {
              "score": 1210,
              "content": "He's full of shit and just wanted to exercise control and display power over her - whether it was subconsciously or not",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 851,
              "content": "If the keys were stolen from her wouldn’t that imply she somehow got mugged during this trip? How are the keys the primary concern in that scenario? Girlfriend gets robbed at gunpoint and OP is over here peeing his pants over the fucking keys.",
              "id": 76,
              "comments": [
                {
                  "score": 300,
                  "content": "[deleted]",
                  "id": 77,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Generally controlling people tend to view their SO as an object, not an individual human, so in their eyes they can be replaced too.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Also who steals keys to an apartment or house? They are gonna steal her wallet, and her phone, not to mention they wouldn't even know where they lived if they stole her purse with her info on it, AND on top of that he said there's 2 factor entry (probably a dorm if there are doormen/staff in the lobby).\n\nWorrying about stolen keys so someone could break into your apartment is almost a non issue, even if they were stolen. You could just invalidate the id card and get a new one issued, or change locks if you were so paranoid that someone stalked you to find out where you lived, and somehow got a working id card on top of it all to pass the first layer.\n\nYeah OP YTA, that was an amazing and cute thing they did, not a breach of anything at all.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This made me fucking cackle, thank you",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Exactly this. OP, if you take your keys out they could be stolen too. That could have happened any time, anywhere, any place. \n\nYTA, OP.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "She's responsible enough to spend the night with him. But not hold keys. WOW",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I thought this was heading towards the building having a policy of not using other people’s IDs but wow this excuse was shitty",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Lmao like he’s immune to having his own keys stolen too, by his own logic he shouldn’t ever leave his apartment",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "How does he expect her to.... You know... Have existed as a functional human being up to this point in time if she can't even, by his train of thought, keep an eye on the keys to her place for the 20? 30? minutes she went out to get him breakfast.\n\nThat's just insulting and a huge insight to what OP really thinks of his gf. I hope she finds someone who will let HER sleep in while they get breakfast.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "from the top rope",
          "id": 86,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 139,
          "content": "Nearly thought I was on r/roastme damn",
          "id": 87,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "i should hope she's an ex by now. she deserves better.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Totally ex. This is a huge red flag for anyone. OP, dude she was doing something nice. Accept it, and set boundaries later. It's understandable that he wasn't a fan of how it happened, but except her act of kindess and say something later.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Ruthless",
          "id": 90,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "We can only hope",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14331,
      "content": "YTA-  invading your privacy? She was already at your place...taking your keys literally to DO A NICE THING isnt invading your privacy. \n\nShe didnt go into your porn folder on your computer to make sure she could get back into the room lmao. She took your keys and bought you food. \n\nWhat a baby.",
      "id": 92,
      "comments": [
        {
          "score": 4257,
          "content": "I’d be weirded out by the situation if a girl did this to me after we’d been seeing each other for a week or two. That isn’t enough time to get to establish sufficient intimacy and trust to the point where I’m cool with her taking my keys while I’m asleep. But 8 months? No privacy was violated here, OP. YTA.",
          "id": 93,
          "comments": [
            {
              "score": 2172,
              "content": "[deleted]",
              "id": 94,
              "comments": [
                {
                  "score": 337,
                  "content": "dont u usually exchange keys by 8 months? (genuine question) wtf is wrong with this guy, tho.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 285,
                      "content": "Sounds like OP is in a dorm situation so won't have a spare key and can't just go get one cut.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Is this a rule?",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Granted I've known my partner for 8 years but we've only been together for 5 months and he's insured on my car lol",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Hell naw. Way too soon for that (generally speaking). But the chick grabbed the keys while he was sleeping to buy breakfast, I was waiting for “and then she made copies”. But nope, OP just has a touch of the weird.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 592,
              "content": "Maybe I'm too trusting but I wouldn't even mind if a 1 night stand did this if they came back with coffee, haha",
              "id": 100,
              "comments": [
                {
                  "score": 313,
                  "content": "Same! Where's the privacy violation? She's already there, she's just briefly leaving and coming back, but with food.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 287,
                      "content": "The only issue would be if you woke up and she was gone. Then you realize she stole your keys, that'd be a very uncomfortable situation.\n\nOf course then you text her and she's just like \"How do you take your coffee\" and everything is fine because you're not a control freak psycho like OP.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Same here.\n\nIf a 1 night stand wants to steal my keys then they're stealing them anyway!",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Exactly! I feel like bumping uglies is a LOT more\nPrivate than a set of keys",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Same, i live in an apartment that you need a swiper and key  and i have had a guy that i had only seen twice stay the night (normally i have a hard fast rule no staying the night) because his housemate was being a dick, and as thanks he went out and got coffee and pastries for breakfast while i was asleep. I woke to the smell of coffee and pastry, and it was amazing. Couldn't care less that he took the keys, he could copy the key but not the swipe card so what's he going to do anyway.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "It’s funny that people trust others enough to have sex with them and go to sleep with them...but my keys?? Hang on a second, let’s not go crazy.",
                  "id": 106,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Me neither, it sounds very reasonable!",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Me too but I know I am far too trusting for my own good.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Agreed. The girl went out of her way to do something thoughtful. If her using his keys within an hour time frame is unacceptable after 8 months, then how much trust did those 8 months actually build? If they barely knew each other, that's something else entirely.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Right like that's what I'm here saying. By 8 months, nearly a year of dating, obviously staying overnights together and likely weekends, he hasn't established enough trust with her to let her borrow his keys? For any legit reason? \nIs there *any* trust in this relationship? You have to ask yourself. \n\nHe's definently the asshole.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My boyfriend gave me his keys after our 2nd date... it stunned me, but ever since I’m always the first one to get the spare keys to his apartment. \n\nShe tried to be nice and got a completely unwarranted response from you. YTA definitely. And she is lucky to not have wasted a whole year with you.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Honestly, I wouldn't be bothered after any amount of time if a girl I'm seeing gets up early and wants to grab me breakfast.  It's just a key to the door to get back in.  It's not a big deal.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "YTA - If her borrowing your keys was such a problem, you needed to communicate that to her.\n\nWhile I could totally see someone having a legitimate concern with anyone borrowing their keys - especially in a place with 2 factor authentication or if one works in certain professions or locations.\n\nBut if you are dating someone for really anything more than a month, and you have a concern like that, it is on you to communicate explicitly this boundary.\n\nFor example: I have a multipart key chain - certain items on one of the parts could constitute a felony for someone to be in unauthorized possession of - My wife and I have had a conversation in no uncertain terms that if she borrows my key chain, she has to make sure to remove that part and leave it in my desk drawer. \n\nShe can grab any car keys, keys to the other houses, safe or bank keys that she needs  - but my work related stuff needs to stay in my desk drawer.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Honestly even after the second date it’s a NTA situation. She’s already in the apartment. What’s the alternative? “No you can’t leave my apartment without my permission!”",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "But you would have established sufficient intimacy to sleep with her?",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 226,
          "content": "baby rage",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "On top of everything else, can we not forget that his super important privacy thing is literally just his fucking STUDENT ID? Like you show that to just *anyone* at a  store for a student discount. Wtf could possibly be on there that his gf of 8 months couldn't possibly already know?\n\nYTA",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "She wasn't invading his privacy when he asked her for a rimjob the night before. Taking his keys to get coffee is seriously crossing the fucking line.",
          "id": 118,
          "comments": [
            {
              "score": 7,
              "content": "I know! She even took his \"wallet thing\"! How vulgar.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This is one of those life lessons that the OP is going to have plenty of time thinking about as he masturbates over the next 6 months.\n\nThis isn't just a YTA situation.  This requires a new category.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I’m really confused at what sort of privacy he thinks is included in a key",
          "id": 121,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Exactly lol I can see my ex doing something like this if I tried to do the same thing",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11930,
      "content": "Very thoughtful of you to show her your true colours before she gets too invested into the relationship. YTA. Poor girl.",
      "id": 123,
      "comments": [
        {
          "score": 3151,
          "content": "Yeah this is hilarious. I wouldn't expect those calls or texts to be returned at any point, OP. She's already out the door counting her blessings and all her friends probably know the story and to stay away from you too.\n\nIt's a student ID, not a social security card. You can get a new one of those by walking to the registrar's office and saying, \"hey I lost my student ID\" lol.",
          "id": 124,
          "comments": [
            {
              "score": 1550,
              "content": "As thoughtful and caring as she seems to be, she’s probably truly crushed and confused. Either way, definitely TA",
              "id": 125,
              "comments": [
                {
                  "score": 1803,
                  "content": "Right?\n\nI'm just picturing some poor girl holding out pastries and this dude screaming at her, \"YOU TOOK MY KEYS TO GET PASTRIES?!!?!?!!!\" \n\nImagine if they were married. She's like in the kitchen making him pancakes on the weekend and he storms downstairs like, \"YOU'RE PUTTING MY LIFE IN DANGER OF A FIRE BY MAKING PANCAKES ON MY STOVE/!??!/1/?!\"",
                  "id": 126,
                  "comments": [
                    {
                      "score": 616,
                      "content": "Lol... it’s funny but it’s not. Poor girl. If my girl did this for me I would be ecstatic at the thoughtfulness and effort",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 95,
                      "content": "Ha! Reminds me of my ex who accused me of trying to kill him (or at the very least wanting him dead) because I suggested going out for Italian.  \"YOU KNOW I WAS JUST DIAGNOSED WITH METABOLIC DISEASE AND NEED TO LOSE WEIGHT!\"\n\nOh, and YTA and I hope your ex-girlfriend finds someone who appreciates her.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I hope she finds this thread so she knows how sweet and kind her gesture was. She sounds like a very nice girl, she deserves someone who appreciates her efforts. She did nothing but try to put a smile on her boyfriends face, and she got yelled at for it. So harsh.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> It's a student ID, not a social security card\n\nI bet you 10 bucks that the student ID is better at identifying the person AND has far more security measures built in. So it should be even less concern for breaking 'privacy'.\n\nSome people in relationships are just... how?! HOW are you this far from reality.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 512,
          "content": "Hmm. I'm confused as to whether it should be YTA or NTA. YTA for the action, but NTA in the bigger picture for saving someone a potential lifetime of unhappiness?",
          "id": 131,
          "comments": [
            {
              "score": 106,
              "content": "Doesn't NTA imply that she is TA? I have a hard time seeing that as the case. Maybe NAH. Ah, who are we kidding. It really is YTA.",
              "id": 132,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "I was gonna say you're mad thinking this is NTA. But then was like \"ohh yeah.. thats true\"",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It’s still YTA imo as the “potential lifetime of unhappiness” stems from him being an asshole.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 295,
          "content": "Imagine all the other crazy shit he's pulled in the last 8 months 🤣",
          "id": 135,
          "comments": [
            {
              "score": 3,
              "content": "Can you imagine if he gets this creepy and controlling over keys how much he would blow up by her using his toothpaste or something? I hope he never sees her again. Poor woman.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Scenario 1:\n\nGF: Good morning! I brought you breakfast.\n\nNormal person: Thank you!\n\n&#x200B;\n\nScenario 2:\n\nGF: Good morning! I brought you breakfast.\n\nOP: OMFG you stole from me in my sleep!!! HOW DARE YOU? I TRUSTED YOU! \\*throws pastries at the wall\\* You violated my privacy, you f-cking cat burglar! Get out of my room! Out! OUT!!! \\*feverishly types about his betrayal on reddit as she flees\\*",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I said much the same thing before I saw this comment. hopefully she finds someone who appreciates her",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I would be devastated in her position haha",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8042,
      "content": "YTA. She didn't steal your keys.",
      "id": 140,
      "comments": [
        {
          "score": 4071,
          "content": "That’s my thing. She came *right back*, evidently before he even noticed she was gone. If you’re bringing me pastries, you can “steal” my car, wallet, keys, and firstborn. Who the fuck gets upset that their SO went out and got them breakfast???",
          "id": 141,
          "comments": [
            {
              "score": 1865,
              "content": "I agree. On the plus side, it sounds like OP's ex is single now, so hopefully she'll find her true pastry loving love here soon.",
              "id": 142,
              "comments": [
                {
                  "score": 396,
                  "content": "When I read the title I thought OP meant she took the keys to drive his car. Which possibly would be something to be pissed off about. But just the keys to the apartment? Ridiculous!  YTA , OP.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Honestly even then, if she didn't have her own car and she bought me pastries I'd be pretty pumped.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "> true pastry loving love\n\nAh come on. The pastry doesn't even matter. If my SO gets up earlier than me, goes out, spends time and money to bring me something as a surprise, they getting loved. Jesus, you could bring me some raisin bread type shit and i'd appreciate it anyway.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Toasted raisin bread with some cream cheese between is really good.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "I hope she isn't put off too much by this. Good chance she will never do it again.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Oh no, this just made me genuinely sad. She's going to think it's not safe to surprise someone like this.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 460,
              "content": "I laughed pretty hard at this but you're right. If you're taking the time out of your morning to surprise me with breakfast in bed, or hell - even just a coffee, take whatever you want to make that happen.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 438,
              "content": "I mean, not just the pastries, but fresh, hot caffeinated beverages?!\nI'm not worried about you stealing my keys. I'm thinking about how to make you my spouse lol.",
              "id": 150,
              "comments": [
                {
                  "score": 185,
                  "content": "Hells to the yes! The only reason I'm worrying about getting my keys back is so that I can use the keyring to propose before someone else discovers her!",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 250,
              "content": "> If you’re bringing me pastries, you can “steal” my car, wallet, keys, and firstborn.  \n  \nAka the wifey taking the kid to grab breakfast...",
              "id": 152,
              "comments": [
                {
                  "score": 21,
                  "content": "To be fair that's an added bonus if she takes all the kids, half an hour of peace is priceless (especially first thing in the morning)",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "OP definitely overreacted, but I can understand where OP is coming from to a slight extent. In hindsight, this would have been a much better way to handle the situation:\n\n&#x200B;\n\n>OP's ex: I got us some breakfast!  \n>  \n>OP: Thanks, that was really sweet of you.  \n>  \n>*<both eat breakfast>*  \n>  \n>OP: Hey, I really appreciate the breakfast. Thanks again. Oh, did you happen to borrow my keys while you were out?  \n>  \n>OP's ex: Yes, I needed them to get back in the building.  \n>  \n>OP: Oh, okay. Just making sure, thought I lost them for a minute there.  \n>  \n>OP's ex: No, I just had to borrow them for a few minutes, silly. \n\n&#x200B;\n\nThat scenario would have both shown appreciation for the GF's gesture and hinted at \"please ask before taking my keys next time.\" I'm not OCD, but I don't like people borrowing my stuff without asking. Even at that, I don't get upset unless my stuff gets broken or lost. 9 times out of 10 in a similar scenario to this, everything works out fine and it's nothing to get upset over. \n\n&#x200B;\n\nNot really sure where OP is getting \"violated my privacy\" from. \"Impersonating me to get back into the building\" would be more accurate, but that's stretching it. If you don't want your privacy violated, then don't get in a relationship (though OP seems to have fixed that bit).",
              "id": 154,
              "comments": [
                {
                  "score": 24,
                  "content": "Worst part is that there's no guest access framework she could have used anyway so he's getting mad at her for not getting herself locked out essentially.\n\n\n\n\n\nI saw someone above saying you don't earn trust with time, but assuming OP isn't a mormon or some other type of hyper strict religion if you've been with someone long enough to have sleepovers and be intimate with them your \"privacy\" is almost nonexistent anyways.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Oh man where can I get a such a mystery guest that gets up with my first born when he wakes and takes him out to get me breakfast while I sleep in?!",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "What gets me is that if this was a thing he was weird about, wouldn't he make that evident sooner? Like, \"hey if you ever wanna use my keys for the apartment, can you let me know first 'cause I'm kinda self-conscious about my stuff?\"\n\nLike... after 8 months that's something you should've at least had a conversation over",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "SO of 8 months, no less!",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 335,
          "content": "Yeah, that’s such a weird and paranoid verb to choose.",
          "id": 159,
          "comments": [
            {
              "score": 402,
              "content": "Yes! She BORROWED the keys, returning them immediately after and volunteering the information openly. Labelling it theft and an invasion of privacy is hyperbole. \nOP is YTA, and should have a pastry and chill.",
              "id": 160,
              "comments": [
                {
                  "score": 204,
                  "content": "OP doesn't deserve the pastries",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "\"But muh privacy\" \nCheaters and liars use that phrase.",
              "id": 162,
              "comments": [
                {
                  "score": 19,
                  "content": "Also control freaks, which is what OP is. He isn't a cheater or a liar lol.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 8,
                      "content": "He could be more than one, really. Or he could be the trifecta!",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7125,
      "content": "She’s your girlfriend, and she can’t even use your keys to get in and out of the building with out you kicking her out? YTA",
      "id": 165,
      "comments": [
        {
          "score": 1737,
          "content": "[deleted]",
          "id": 166,
          "comments": [
            {
              "score": 864,
              "content": "Removed due to API protest. -- mass edited with https://redact.dev/",
              "id": 167,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 223,
          "content": "without even mentioning the fact that she was trying to surprise him w something nice. smh fuck op",
          "id": 168,
          "comments": [
            {
              "score": 6,
              "content": "Yeah, I'm thinking, I \"stole\" my girlfriend's keys (with attached wallet!) so that I could give her car a full interior detail while she was sleeping.\n\nI'm really glad I didn't get yelled at and kicked out for doing so, that would have sucked...",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 183,
          "content": "This right here, if she stole your keys, she would’ve have come back. Really think you need to re-evaluate your privacy concerns considering you’ve been dating for e i g h t months.",
          "id": 170,
          "comments": [
            {
              "score": 43,
              "content": "*wouldn’t",
              "id": 171,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "She was his girlfriend*",
          "id": 172,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "And now she’s an ex girlfriend 🙏🏼",
          "id": 173,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "She's his EX. She dumped this chump when he dissed her for buying him coffee after giving him sex.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "The apartment that she’s *already in* don’t forget. In my book it doesn’t matter how well or how long you’ve known someone, if you’ve let them into your apartment voluntarily, and you’re asleep, they have the right to briefly take the key to nip out and let themselves back in without waking you. Whether it’s to go for a cigarette, grab something from the car... going to get you something nice is just the icing on the cake that says she’s not the asshole, OP, YTA.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4704,
      "content": "YTA. And how is that “violating your privacy?”  What info does she know about you after this egregious violation?  Dude... you’ve been dating for 8 months..  she isn’t a stranger.  My guess... she’s  not responding because she is done. Not only are YTA, you insulted her by suggesting she was somehow doing something shady by trying to do something nice.",
      "id": 176,
      "comments": [
        {
          "score": 1142,
          "content": "Well, now she knows he has keys to his place and a student ID. That’s clearly Fort Knox level of security clearance information.",
          "id": 177,
          "comments": [
            {
              "score": 609,
              "content": "Captain crypto over here also put both of his \"two factors\" on the same keychain.",
              "id": 178,
              "comments": [
                {
                  "score": 201,
                  "content": "This was one of the more puzzling parts. If it was that importnt his id would be at least in his wallet. \n\nEven if his rental agreement had a weird clause about lending ID and fines or eviction, dude could have thanked her then politely explain the policy so it isnt repeated with a bonus request to go together next time.\n\nYTA here OP. Its okay to have silence before you respond as opposed to knee jerk reacting and yelling at people. Heck next time something makes you mad get cold especially around your head. Itll pull the blood back to your frontal lobe so you can respond with the thinking part of your brain.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Definitely this. I would be uncomfortable about my own mother taking my keys simply because she may lose them, but it’s ridiculous how such a selfless and wholesome act wouldn’t trump that worry. I think OP has their priorities muddled",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "It ain't even two factor, since both the key and ID card are something he has. Now if the ID card scan was instead \"type in your student ID number\", then that's two factor (something you know along with the key as something you have).",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "captain fuckin crypto hahahaha i'm dead bruh on god",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "You made me laugh out loud, thank you!",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I've seen some pretty intense spy movies man. In the time it takes to get a coffee who knows what she could do with those keys and ID. Open bank accounts in his name, rob said banks at key point, topple foreign governments.",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "She also knows OP is a massive dickwad now. (YTA OP)",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 162,
          "content": "that's what I kept thinking! I dont think op understands the phrase \"violation of privacy\", it's just a cool buzz phrase that can be thrown around to justify his unreasonable response. She *borrowed* his keys to do something nice. YTA OP without a doubt.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I’m willing to bet this wasn’t some out of the blue ordeal if she’s ghosting him after eight months.",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I just assume that OP is Dexter and hiding some blood trophies in a storage locker to be this concerned with “privacy” over a set of keys.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I'm imagining OP losing his keys and freaking out on some good Samaritan who returned them\n\n\"YOU HAVE MY KEYS? WHAT DO YOU KNOW? oh god my privacy...\"",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah if they’ve been dating a week and he woke up to her gone and the keys missing I can see the panic. But he didn’t even have that moment of panic.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Watch out, she might.......I don't know. I tried to think of something snarky but it's a fucking student ID. Kudos to the girl for leaving.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Then thinks he’s being nice by sending her money for the breakfast. Dude might be missing some social skills.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3083,
      "content": "YTA. She didn't steal anything. She brought your keys with her so she could get back in. She was trying to be thoughtful. \n\nIf you're not comfortable with her using your keys for some reason, then say so. But accusing her of stealing from you and violating your privacy and then kicking her out when she was just trying to do something nice for you is a huge overreaction and definitely makes you TA.",
      "id": 193,
      "comments": [
        {
          "score": 872,
          "content": "No kidding. I had to read the post twice because he kept saying 'stole' and nowhere could I find any theft going on. I assumed she made copies or had friends over when he was gone and somehow I'd missed this huge detail.  Turns out, no.  No, she just ran out for coffee and cakes and came right back.  Not one thing worthy of even a raised eyebrow.",
          "id": 194,
          "comments": [
            {
              "score": 533,
              "content": "Yep. OP is just exaggerating to make it sound less ridiculous that he kicked his girlfriend out of his house for getting him a latte.",
              "id": 195,
              "comments": [
                {
                  "score": 279,
                  "content": "[deleted]",
                  "id": 196,
                  "comments": [
                    {
                      "score": 126,
                      "content": "If I were her, I'd have lost my appetite anyway.",
                      "id": 197,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 104,
                      "content": "I hope she threw them at him but she sounds too nice",
                      "id": 198,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "If I were her I’d have taken it all with me and enjoyed it all!  She didn’t even use his money to buy the stuff.  Telling her that the keys could have been stolen from her - treating her like someone who isn’t mature enough to take care of keys for 10 mins. She’s seen the light now. YTTA",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "\"I think you should leave right now... but leave the food\"",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "He says in an update he actually sent her the money for breakfast and she sent it back. It was her only communication with him. God, he’s an ass hole. That poor girl. He needs some therapy and to let this girl go.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Of course, that's why he sent her the money afterwards, which she returned!",
                      "id": 202,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 97,
              "content": "Yeah, from the title, that’s what I expected. I was sitting here waiting for him to say she copied it and was going full bunny boiler, not that she surprised him with breakfast.",
              "id": 203,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 58,
              "content": "And he said the key card was in \"a wallet type thing,\" so I reread it to see if she had gone through his actual wallet.  Nope.  Didn't touch his wallet.",
              "id": 204,
              "comments": [
                {
                  "score": 21,
                  "content": "Anyone else picturing of those wannabe punk chains with a velcro wallet attachment?",
                  "id": 205,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I remember these wallets from college. Basically just a slot for the ID card plus the keychain.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": "Yeah, I dated a guy who acted similarly. He made a huge deal of barring me from the place when we broke up like I was some maniac who'd trash the place. Too bad it took two years instead of only eight months for me to find that out. She has my sympathy. It's no fun to be treated like a common criminal by somebody you thought you could trust.",
          "id": 207,
          "comments": [
            {
              "score": 253,
              "content": "Right? He talks in another comment about how he uses her phone sometimes for his own convenience, and that's cool. Because we all know that keys are more private than someone's phone...",
              "id": 208,
              "comments": [
                {
                  "score": 136,
                  "content": "LOL like he's not spying on her texts when he \"borrows\" her phone.\n\nProtesting too much is a possible explanation for his ridiculous overreaction.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "D: wtf?! That’s potentially more private than a keypass to a venue that you are....literally already inside....\nOP can’t extend the same trust *to* his girlfriend that he expects *from* his girlfriend. \n\nI guess a clear discussion about different personal boundaries is in order.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Lol ok, while phones are definitely more private than keys, I once got into an argument with a dude on imgur who insisted that the privacy of phones was fucking sacred and it was a huge violation for me to glance at my husband’s phone so I can tell him who’s calling on the rare occasion he forgets to take it into the bathroom with him, or use it to answer our intercom and let the delivery person in if his phone is the closest. Like, the reason he doesn’t mind that I look at his phone or play minesweeper is because we actually do trust each other and he knows I won’t snoop, I just want my Thai food.",
                  "id": 211,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Oh I think using as partner's phone when you need to is fine. I just think using a partner's phone but throwing a temper tantrum when she borrows your keys to get back inside, because keys are somehow more private than phones is crazy.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "[deleted]",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Sounds like a lot of insecurity on his part. I don’t think it will get better as a single dude now.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "And who wants to bet he'd be equally as pissed if she came back, and pounded on the door to be let in? OP, YTA.\n\nEdit: I forgot to end my question with a question mark Jesus Christ",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3047,
      "content": "YTA she didn’t steal your keys, she bought you breakfast",
      "id": 216,
      "comments": [
        {
          "score": 12,
          "content": "This comment really highlights the magical power of perspective, and how badly it can fuck us over.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2591,
      "content": "[removed]",
      "id": 218,
      "comments": [
        {
          "score": 1769,
          "content": "Didn’t you see what this chick did?\n\nShe stole his keys\n\nStole his car\n\nStole breakfast from the store\n\nReverse stole the car\n\nReverse stole the keys\n\nThen reverse stole breakfast to this guy\n\nShe’s a monster",
          "id": 219,
          "comments": [
            {
              "score": 210,
              "content": "How rude of her!!",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "There's no car involved",
              "id": 221,
              "comments": [
                {
                  "score": 285,
                  "content": "Oh my gosh, SHE LOST THE CAR!? That’s even worse!!",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "holy shit, you're right. this dipshit didn't even have his car borrowed!!",
                  "id": 223,
                  "comments": [
                    {
                      "score": 9,
                      "content": ">this dipshit didn't even have his car ~~borrowed~~stolen!!",
                      "id": 224,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "She didn't reverse steal the pastries, she made poor OP an accessory to her crime.",
              "id": 225,
              "comments": [
                {
                  "score": 7,
                  "content": "She stole the pastries but reverse stole her money to the store.",
                  "id": 226,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "I just hope she doesn't reverse breakup",
              "id": 227,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Don’t forget she started by stealing his bed and the covers after stealing sex from him.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Sad thing is she walked she didn't even use a car lol.",
              "id": 229,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "lol you said what I was thinking",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Uh, yes. Obviously.",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "I think we all know the answer to that...except maybe OP who had to ask if he was the asshole here.",
          "id": 232,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "Lmao this is all that  needs to be said. This guy doesnt deserve a girlfriend like this after 8 months. This is insane to me.\n\nIf my girlfriend did this (after 8 months of dating) I would be immediately thinking about marriage.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is my favorite comment in this entire thread. I can't believe OP is this thick and blind to his actions",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Right? He’s concerned that his keys could have gotten stolen while she was out. Ok, what happens when you two are out and she holds your phone while you’re on the can? My god, what your phone gets stolen then? Actually, he sounds like the kind of guy who wouldn’t let his gf even hold his phone due to protecting his “privacy,” but by all means it’s fine to do all this stuff when HE is present.",
          "id": 235,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "One very important thing to remember in life: 100 is only the average IQ. Some people, like OP, live their whole lives below 80.",
          "id": 236,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Lmao OP you weirdo",
          "id": 237,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}