{
  "post content": "I (37f) am married to my husband (38m) and we have a daughter together (11f). \n\nMy daughter is very small for her age and as a result gets treated like a younger child sometimes. \n\nShe loves to hop in my or my husbsnds lap and cuddle with us on the couch or in a chair.\n\nI have been thinking that she may be too old for that sort of thing and maybe I'm hurting her by letting her continue. \n\nYesterday she tried to hop in my lap and cuddle and I told her she was too old for that and to get off me. She got really upset, got off me and went to her room and slammed the door. \n\nShe hasnt tried to get in my lap since then and things are tense between us. She doesnt talk to me unless she has to and when I hugged her goodnight last night she didnt hug me back. \n\nI feel really guilty because I obviously hurt her feelings but I feel like she might be too old for sitting on my lap. \n\nAITAH",
  "id": 1,
  "comments": [
    {
      "score": 36768,
      "content": "YTA. She's not going to want to cuddle you much longer. You maybe have a year left. And you're throwing that time away instead of cherishing it.",
      "id": 2,
      "comments": [
        {
          "score": 9664,
          "content": "Seriously. I wish my kid would have kept doing that to 11. This woman is lucky AF and doesn’t want to be",
          "id": 3,
          "comments": [
            {
              "score": 5281,
              "content": "Shit, I’m 40 and still have moments where I wish I could sit and cuddle with my mom. She’s on the other side of the country, but still…",
              "id": 4,
              "comments": [
                {
                  "score": 3330,
                  "content": "I have a picture of me sitting in my mom's lap when I was in my 20s.  She was the best mom and my best friend too.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2488,
                      "content": "My daughter is 19 and a lot taller than me. She stills cuddles on my lap if she's not feeling well or having a bad day.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1052,
                      "content": "I have a picture of my brother when he was about 20 sitting in my dad’s lap at Christmas. We didn’t know it would be my brother’s last Christmas, he was killed 8 months later. OP needs to cherish these moments while she has them.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 236,
                      "content": "I’m sure she cherished those moments with you.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 233,
                      "content": "I have a picture of my toddler sitting on my lap and my 20's sister sitting in our moms lap.  Just two moms holding their kids in their laps lol",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 163,
                      "content": "I'm 27 and I still sit in my mom's lap.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 65,
                      "content": "Same! One of my favorite pictures of me and my mom is me sitting on her lap when I’m about 24. It was around my birthday.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "There’s a poem that goes around talking about being a mom and how there are so many times that are the last time for something and you don’t realize it until it’s gone- it’s sad to think about so every so often when I realize I haven’t done something in a while- like pick up and carry my kid- I do it to reset the timer.  Kiddo is getting pretty hard to carry now but damn it I won’t let time win until I absolutely have to!  They think it is hilarious and then try to pick me up in return- and they’re getting closer to being successful!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I have a picture on my dresser of me at age 22 with my upper body in my mom's lap.  That's all I could fit without squishing her.  I wish I could do it now.  I miss her.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My son is in his 20s and will come and Sit on my lap. He’s bigger than me so it must look funny but I know it makes him happy and he doesn’t stay long cause he’s bigger than me. Some day he won’t any more and I’ll miss it. My younger sons are teens and never sit in my lap anymore.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 681,
                  "content": "Same! 32 and I will ALWAYS snuggle up to my mom when she visits, give her big hugs and kiss her on the cheek goodbye. Lol!\n\nOP, YTA. You really hurt your daughter by rejecting her so harshly in that moment. This is clearly how your daughter seeks comfort, and how she shows you guys affection. You just ruined that.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 181,
                      "content": "Yeah, that is a memory that is going to stick with the daughter for a looong time.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Same happened to me with both parents when I was a kid. I stopped hugging and showing them affection because I didn't want to go through that feeling of rejection again.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I remember as a child wishing that my mother was mo4e affection!te and available for hugging. Then when was an adult and she wanted affection it wasn't naturally there.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, 34F and still give my mom a cuddle when we're watching TV on the couch.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 536,
                  "content": "Mine are 27 and 24 and I still pat my lap and say \"cuddle Mommy!!!\" They oblige by plopping their full weight and height on me (both much taller than I am) and squishing me. I squeeze them as hard as possible until they go \"get off me, woman!\" 5 stars. Would recommend.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Aww, that's so cute.\n\nI want my mum.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My youngest is 15, and does the same thing. He still at least once a day demands a hug from me. I know eventually it will stop, but I'm gonna soak it up and enjoy every moment I can cuddle him, knowing one of these days is going to be the last time.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You're exactly like my mum. Wouldn't change it for the world!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 303,
                  "content": "My 23 year old greets me almost every morning with a hug and I cherish those moments. Never, ever pass up an opportunity to show your kids affection in whatever way they need.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 132,
                      "content": "Same. My 23 year old son tells me he loves me and gives me hugs all the time. I feel unbelievably lucky that he is so affectionate.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 122,
                      "content": "exactly! I grew up extremely attention starved because my parents never showed me any affection. \n\nas a parent I make a point of always hugging my son, pulling him on my lap for a hug for a moment. forehead kiss. no way will I ever let my child feel like I did as a child.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "One of my favorite things about seeing my nonagenarian parents is how my 28 year old son always, without fail, makes sure to offer a hug when we leave.  It's almost like a ritual!  (All consensual--we are a huggy family but would respect anyone who doesn't want one).",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I think it's sad that she just randomly did this to the girl with no warning. As a 25 year old, it sucks to feel that you're too old for things, she needs to apologize asap",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 166,
                  "content": "I lived with my mother till I was 24. Not a day off went by when we weren't cuddled up on the couch watching TV. I miss those days.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 7,
                      "content": "One of the things I loved about the isolation during the pandemic is that my daughter and I had a TikTok period where we’d spend an hour or two every few days huddled up and sharing our favorites.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 124,
                  "content": "I can’t quite sit on my mums lap but there’s plenty of times I’ll go round just to have a cuddle on the sofa and watch some shit telly. YTA OP, nothing beats a mum or dad cuddle",
                  "id": 31,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Me too! We get a blanket and some wine and watch cheesy reality tv lol",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 118,
                  "content": "I'll be 50 this year, mom passed in April 2021. 19 years and a month after dad passed.\n\nIf there's any way you can make that happen, do it. You'll never regret that trip.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 56,
                      "content": "I\"m so sorry for your losses.  I'm 62 and my nonagenarian parents are still on this planet (and luckily less than an hour away), but my mom has fallen and broken things twice in the past year and I live in a mixture of gratitude and dread all the time.  You'd better believe we hug a lot on every visit!",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I'm so sorry for your loss.  I lost my mom in 1996 and my dad in 1966,  I don't remember cuddling with my dad but I have pics of him holding me.   I have always cuddled and hugged my kids, grandkids, and even my \"adopted\" kids ( I have a few adult kids that call me mama).",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 114,
                  "content": "I'm 27 and on bad days I cuddle with my mom and let her stroke my hair. There's no age cap on physical comfort.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "I'm 36 and when I visit my mum (70) I still get all the cuddles. You're never too old for cuddles.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "I'm 61 and wish I could see my mom. Many times it just doesn't stop.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Same. I'm 60 and lost my mom unexpectedly in 2012. (Brain aneurysm). Sometimes when my kids get mad at me over something silly (like I kept sister's child one day longer than the other sister's child, etc.), I just want to tell them that they'll long for these days someday. But I think that sounds sort of like I just want attention, so I don't do it. But I miss my mom every day and would give anything for just one more hug, one more conversation, one more \"I love you\". \n\nTreasure your family while you can. No one is guaranteed tomorrow.\n\nEdited to add:  OP, YTA.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 353,
              "content": "Never too old for cuddles. I work at a nursing home. We have a 78 year old man who comes to visit his 99 year old mother every week. She has dementia and they hold each other and they both light up. You never outgrow the need for love and affection from your parents.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 342,
              "content": "my parents disowned me for being trans. im almost 22 and sometimes i still wish i could sit in her lap and get a hug from her one more time. \n\nYTA op. big time.\n\nEdit: thank you for all the kind words, strangers!",
              "id": 41,
              "comments": [
                {
                  "score": 136,
                  "content": "I'm sorry.  Would you accept a virtual hug from some stranger on the internet?\n\n** hug **",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "As a mother, I'd like to tell you that I'm so proud of you for being true to yourself and how frightening that must have been. You've been brave and so strong. Sending you a mom hug and if you need volunteer mom talks, message me anytime.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I had to disown mine because they kept trying to make me detransition, I’m sorry for your loss as well, it’s a very specific pain that never fully heals",
                  "id": 44,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I'm so sorry",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That’s terrible, I’m so sorry they can’t see that it’s your life. If you ever need some motherly support I’d be happy to help.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I'm so sorry that your parents disowned you.   I wish I could be your adopted mama.   My mom was a huge advocate for the LGBTQ+ since the 60's and our house was known as a place you could come out without judgment.  I have tried to continue her legacy, and luckily there are fewer that need a safe place, but I'm still willing to provide that space to all who need it.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Hugs. 💚",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Virtual hugs to you!",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Sending loving hugs your way.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m sorry. I’m 30 so it won’t quite be the same but you’re welcome to sit on my lap for a cuddle ❤️",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Free virtual hugs, if you want them.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Hugs!",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 184,
              "content": "She really is lucky AF.  I miss my daughter cuddling up to her dad and I.  She’s 13 almost 14 and I’m lucky if I can give her a kiss on the forehead before bed. \n\nMy parents were never huggers or cuddlers and I wish that they were.  \n\nYTA mom.  Be happy with the affection while your daughter willingly is giving it.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "well, she *was* lucky",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I’m not a parent, but I am 25 with a 12 year old brother. \n\nI recently visited him (out of state) for the first time in a while and he immediately dove into my lap and cuddled me for the next hour until we had to leave to catch a movie. \n\nHe is big asf. My leg fell asleep very quickly. I can’t even imagine myself or our parents  telling him he’s too big/old to love us!!! I hope he never stops sitting in my lap to tell me about his day! He’s my baby 💖",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Seriously! I dread the day when my daughter would stop with all the affection. But in the meantime, I cherish every hug, kiss, cuddle. My daughter is 15 and she is welcome to sit on my lap anytime.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "By 11, I was full adult height and build, and bigger than my mom.  I wish I had gotten to be kid-sized for just a little longer.  Don’t rush her, OP.  Let her be a kid while she still can.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My son is almost 10 and I know our cuddles are numbered and it makes me so so sad 😭 I’d never ever deny him a cuddle",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Mom’s a wannabe mean girl.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1421,
          "content": "Yeah she no longer has a year left, it’s over.",
          "id": 61,
          "comments": [
            {
              "score": 901,
              "content": "This.  I feel so sad for your daughter.  To make her feel self conscious for loving you.  The end of cuddling and the end probably of her real honest trust.\n\nShe was comfortable being vulnerable with you and you stomped it.  So, that’s done.",
              "id": 62,
              "comments": [
                {
                  "score": 254,
                  "content": "I’m sure I’ll make a lot of mistakes, but I will never, ever do this to my baby girl.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 241,
                  "content": "Yes this! Op didn’t even tell her in a time where she was ok and bring it up during a moment where she wasn’t sitting on her lap. She brought it up when her daughter wanted to do it again because she needed her! I also agree with the others that she probably just had a year left too, but being a kid who was constantly told I was too old for things (like Barbie dolls around the time I turned 11) it made me upset and felt like I was constantly being judged by my family. Now I’m 20 and I still sleep with a stuffed animal and do things that I wanted to enjoy as a kid that I felt ashamed of doing because of my family. Luckily my boyfriend doesn’t care what I do and encourages it because he understands. Please don’t ever say things like these to your children!",
                  "id": 64,
                  "comments": [
                    {
                      "score": 58,
                      "content": "I feel you. Got told at 11-12 that I was too old for things like pokemon, and kinda got forced to grow up too quick. You bet that I am there at the local gamestore when the new games release",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "If there’s one thing my last 20 years on this planet has shown me- “normal” is way overrated!  And honestly there are a lot of people who have decided to push back against that.  I look at the various cons/cosplays, adult inflatable floating obstacle courses, the growing acceptance of “non-natural” hair colors etc in the workplace and I’m glad people are enjoying the things they’re passionate about.  One doesn’t need to die inside and fall in line once one is 18.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I played with my dolls until I was 13 or 14, my family always said things about me being too old. Now with my four daughters I will never tell them they are too old. My 19 year old has a stuffed eeyore from\nChildhood that she still sleeps with sometimes. My 17 and 18 year both have stuffed animals and enjoy playing with slime sometimes or other little toys. And my 9 year old plays with a whole bunch of toys and I very willingly will play with her as well. I'm glad your boyfriend understands.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I’m 27, my husband (30) and I have a king bed and we have at least 50 stuffed animals from small to massive. They hang out on the bed and I am going to make some name tags to stitch to them. You are never too old for stuffed animals.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yes to me the worst part was rejecting her when her daughter was seeking affection, and telling her to basically go away and stop acting like a baby. That would have been really hurtful and humiliating. Even with a apology that child will be cautious about being emotionally vulnerable or showing affection with her mum for a while.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yes. OP you need to spin some story that you didn’t want to explain you had embarrassing stomach pains/gas or something, then let her sit on your laps as much as she likes. I’d have been devastated.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah and she did it in such a rude and abrupt way! Pushed her off and just stated she's too old. That's not the way you break something sensitive to someone. Not that this should ever be an issue.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 444,
              "content": "Dude OP fucked up so bad. She just taught her daughter that showing affection is wrong and will recieve a scolding. Holy fucking shit I cannot believe OP would have this thought, write this out, and expect *anyone* to say anything other than YTA.",
              "id": 72,
              "comments": [
                {
                  "score": 116,
                  "content": "Yep, and then when she goes to seek comfort elsewhere from the wrong people with bad intentions OP will be *shocked pikachu* “How did we get here?”",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 347,
              "content": "Teaching kids appropriate physical contact and affection is hard. And unfortunately it takes one comment, like OP's , to completely derail it.\n\nMy kiddo is 16, they'll still hold my hand in a parking lot/ grocery store,put their legs in my lap on the couch, give me a hug or tuck under my arm on the couch.\n\n All things I did not have in my household growing up because of comments like \"your too big/old for that.\" They're not, they never are.",
              "id": 74,
              "comments": [
                {
                  "score": 146,
                  "content": "I’m so disturbed by OP’s post. \n\nWhy does she think an 11 year old child wanting to be cuddled or hugged by a parent is inappropriate? Does she expect her child to just be touched starved until she starts dating? I don’t understand the logic, and I find the whole thing alarming. \n\nOP needs to unpack this shit with someone qualified.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 15,
                      "content": "As someone with Scandinavian/ German parents who stopped all physical forms of affection well before I was 12, my heart is warmed by all of the parents on here who are still cuddling their kids.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "yeah, what’s wrong with her that she things her daughter sitting on her lap at 11 is inappropriate… sounds like she has deeper issues",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 89,
                  "content": "Same!  My kids are teens and 20s.  I don't want them to do what I did, and accept shitty things from people who were willing to give me physical affection because I didn't get any at home.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I was 4 when my mother stopped holding me because I was \"too big.\" Wouldn't let me put my head on her shoulder, hold my hand, much less sitting on her lap! I wish my mom was like you.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 233,
              "content": "True story. I remember being about that age and wanting to hold my dad’s hand. He brutally rebuffed me in public telling me I was too old for that and walked away. I cried so hard. Never tried again.",
              "id": 80,
              "comments": [
                {
                  "score": 153,
                  "content": "So hand holding did make me self-conscious with my 12yo twin boys...but 1. I didn't say anything because my overriding thought was \"well, he probably needs this\", & then 2. I realized \"holy eff, my preteen not only isn't embarrassed to be seen with me but is seeking me out. Anyone put off by this can kiss my arse!!!\"",
                  "id": 81,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Right?!? I had no issues with my son holding my hand during his pre-teen years, I cherished it hard!! I’m so sad he’s too old to now.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Holy crap I'm sorry you went through that, wtf was he doing",
                  "id": 83,
                  "comments": [
                    {
                      "score": 59,
                      "content": "He didn’t want me. I wasn’t “his” (he adopted me after marrying my mom). I was the daily reminder that my mom went and screwed other guys while he was married to someone else. I just wanted a dad, but he couldn’t be bothered to do anything other than abuse me 🤷‍♀️",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Same here.   I have a very distinct memory of trying to hold my Dad's hand while crossing an icy parking lot (He was a very lorge dude - 6'4\", 300+ lbs - so I always figured there was no way I'd pull him down with me if I slipped) only for him to jerk his hand away and tell me \"You're too old to be doing this shit, knock it off\". \n\nI don't think I cried that day, but that comment was the catalyst for over a decade of struggle between he and I - and it all could've been delayed or avoided entirely if a grown-ass man had just held his daughter's hand for the 45 second walk from the car to the store.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Came here to say this.",
              "id": 86,
              "comments": [
                {
                  "score": 244,
                  "content": "What a note to end this era of her daughter’s childhood on.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Absolutely right. I doubt she'll be able to fix this.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Yep, my mom told me I was too old to ask her to rub my back to help me fall asleep when I was around 7 or 8... we literally have never cuddled since and barely hug. That kind of rejection leaves a mark.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 830,
          "content": "What’s even more sad as this simple cuddling was an extension of the girl’s affection for the parents and now she doesn’t even want to hug or talk to them! She probably feels like any of those types of cuddle/comfort/love are like “the same thing” to a child, and by the presents saying “youre too old for one of them” she probably relates it being “you’re too old for all of it”. \n\nNow she doesn’t feel like or isn’t comfortable even hugging her own parents. What a terrible shame & sad thing to do to your own child, OP. YTA.",
          "id": 90,
          "comments": [
            {
              "score": 163,
              "content": "And it's sad that right up until that moment they were doing something right that their 11 year old did not feel like she was too old for that on her own already.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 681,
          "content": "[deleted]",
          "id": 92,
          "comments": [
            {
              "score": 518,
              "content": "This entire thread is a bit triggering for me because I don't have a single memory of cuddling with my mother. Ever. \n\nWhich makes sense as my mother is not a good or safe person, but it's just a little alarming sometimes when you realize how far from the norm your childhood was. It would never occur to me to even ask for cuddles.\n\nI'm glad you cuddle your kids. Give them a snuggle for me.",
              "id": 93,
              "comments": [
                {
                  "score": 498,
                  "content": "Hello i am your mother now. Eat your vegetables. No tv until you finish your school work. Wash behind your ears and your knees. Be careful. Make good choices. Love you.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 200,
                      "content": "Yes mom. Love you too.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "My mom always threatened to shout “make good choices” at me out the window when she dropped me off for high school. I had forgotten about that until just now but damn you got mom-ing down on point.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I'm pregnant and this comment wins my random crying award for the day",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Can I get adopted too?",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Washing behind your knees is a thing?",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "Reading your comment and I went wait a minute, well shit neither do I, I have a memories of my stepdad hugging me (he was still an abusive jerk aswell) and the tight hugs my great grandmother used to give me, but affection from my mother, cant remember a thing\n\nIm sorry for the both of us, we deserved those cuddles 🤗🤗",
                  "id": 100,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Hugs and I’m sorry for you.  \n  \nI got the occasional hug, but I used to have horrible nightmares/waking nightmares as a kid and I remember being about 5 when my mom told me I wasn’t allowed to sleep in her bed.  So when things were really scary I used to go to her bed and sleep with my head on the windowsill so I could see the sky lightening, then sneak back into my room before she woke up.  Then I just started crawling into my younger sister’s bed (I asked her when she was awake if it was ok if I had a nightmare) and I think the last time I needed to do that I was 13-14?  I still have nightmares even though they’re fewer and the subject matter has changed.  If I need to though I can wake my husband up these days (maybe 1-2x/year) if they’re bad.  There is no age limit on needing comfort.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My mom died of dementia 2 years ago and there was an absolute horror show of 5 years before that. Still comments like yours always remind me how lucky I was because I had an amazing kickass mom for 30 years.\n\nI'm sorry you didn't get that and that my mom's not still around so I could share her with you. Instead let me give you a hug and a cuddle in her stead.\n\nLet me also suggest- r/MomForAMinute",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Sending you both all the virtual hugs you would want to accept.  Not as squishy, but as heartfelt.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "May I send you a virtual hug also?",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "Same here. I have no memories of any affection from my mother. One of my aunts, who has known me my whole life, told me that she can't remember ever seeing my mother hug any of us (I have two brothers). I hug my kids sooo much. I constantly tell them I love them. I make sure to do both every day.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 13,
                      "content": "My mother believed that there were only 2 reasons to touch a child: washing and discipline. I was the complete opposite with my LOs. My LOs are now grown, and they still want hugs. And they get them, too.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "The best thing are the hugs from my adult sons. They are always a bit long. I devour the feeling and overwhelming love for my boys. And we never end a phone convo without saying I love you. Or when they leave after a visit. I can remember 1 time my Mum said I love you. And I was a teenager. I vowed when I had kids, it would be different, and it is.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is reminding me... A therapist once asked me how I knew my father loved me. I thought about it. She prompted me, \"Did he ever tell you?\" No. \"Did he hug you?\" No. Silence. Then I said, \"I know he loved me because one time we were walking and he put his hand on my back for a moment.\" \n\nIt was the expression on her face that let me know that was not normal.  My father did love us kids, but he sure as hell wasn't going to say it or show it with a hug.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I remember sitting on my mom’s lap just once. I think I may have been around 8 or 9. It was the most uncomfortable feeling and I couldn’t wait to scramble away. Cuddling with the parents just wasn’t a thing in my family.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 6,
                      "content": "My parents weren’t cuddlers either, but my dad’s sister was. I remember when I was 14 she asked me to come sit in her lap and tell her about my day. I told her I was too old to sit in her lap and she said you are never too old to be cuddled. ♥️",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "My mom never shows affection besides the occasional awkward hug.. can confirm it is extremely damaging and our relationship is permanently weird. I am sure to always cuddle my kids, hug them and love them for as long as they will let me. I hope they do it forever but I know they won’t so I am just soaking it all up whenever I can. OP YTA. I hope you can repair it but not sounding good.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 5,
                      "content": "My brother is in his 30s and still likes to rest his head on my shoulder (I’m in my 40s) it’s like an armless hug. There’s hope they won’t grow out of it!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I get this. My family is not at all affectionate where as my husband side is and I deeply want to change that for my kids. I once hugged my aunt and uncle and my mom was offended by it (not my aunt or uncle)  it really hurt me and don't look at my mom same anymore",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 499,
              "content": "I sent my mom the “one day your parents put you down and never picked you back up”.\n\nGuess what the crazy lady did next time I saw her? She insisted on picking me up.",
              "id": 114,
              "comments": [
                {
                  "score": 165,
                  "content": "If I told my mom that I would like to cuddle. Guess what? She would open her arms and do it. I am 33, and she is 55😂 I love that women(And she is my stepmom. My biomom would be like OP. And which mom do you think am i lc with?). And your mom sounds awesome! Go hug that lady!\n\nAnd op YTA",
                  "id": 115,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I'm 37 and sat on my mom's lap recently. \n\nBriefly, so I didn't suffocate her, but still! 😂",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "I’m a disabled mum with a bad back. When my kid was born I was so injured I was told not to pick up my own baby, which was horrible and I gave in pretty much instantly. Since then I’ve worked on my strength so I can still pick up my now ten year old. It’s gonna get harder when he’s bigger than me but damn it I’ll keep trying",
                  "id": 117,
                  "comments": [
                    {
                      "score": 83,
                      "content": "My uncle has been working out specifically to be able to walk with his grandson on his shoulders and climb on playground equipment with him.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "I love this! What a mom",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My mother would probably just text back, \"No, I just picked up all your crap for another decade.\"",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I'm 60, my daughter is 42. I still pick her up and huggle her when I see her. Of course, I'm taller than she is so it's not hard.",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 404,
          "content": "Yeah 11 is still a kid. YTA.",
          "id": 122,
          "comments": [
            {
              "score": 187,
              "content": "My child is almost my height and we wear the same size shoe. He's around her age. I know it's almost time where he will be too cool to hug me. I would never turn that opportunity down. \n\nYTA OP because we only have so long until they stop doing this. You missed your chances.",
              "id": 123,
              "comments": [
                {
                  "score": 101,
                  "content": "I hear you. Yesterday my kid was looking for something and went on tiptoe in front of me: I have suddenly realized that I could look him in the eyes without moving mine an inch.\n\nTonight he asked me to cuddle on the couch with a blanket while watching The Simpsons and of course I said yes.\nIn three weeks he will be taller than me and my couch will be sooo spacious...\n\nOP, YTA, apologize to your daughter.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Seriously tho. She mentioned her kid being small, all I could think is, My (almost) 6yr old is 4ft tall and 60lbs. I don’t even care. She can get in my lap and cuddle me any time. Most of the time in the evening she will sit by me while I hold her and we’ll watch some tv or play a game on my phone. \n\nOp YTA for sure. I dunno why you all of the sudden decided your child was “too old” to feel loved. I’d say you should reevaluate that but the damage is already done really.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "My best friend's son is 14 and still cudly. He's cool enough to not be akward about it. I wish your child hugs you for years to come still :)",
                  "id": 126,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Honestly I think these cuddly boys are going to grow up to be the best dads! (If they want to have kiddos)",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My kids are 11 and 13.  We still hug and cuddle.  In fact the older is taller than me (and the younger not that far behind).",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 202,
          "content": "Hopping on top comment to say OP is super YTA.\nI'm turning 26 on Sunday and still cuddle my mom. life is hard and that few minutes of cuddling makes it bearable.",
          "id": 129,
          "comments": [
            {
              "score": 87,
              "content": "My children are 17y (F), 15yr (M), 13yr (F) and 11yr (F). They all still have some sort of “cuddle” “snuggle” etc. \n\nI’m 35y (F) and I still sit close to my mom and need cuddles/closeness. My dad and I have a routine (cheek kiss, head bump, fist bump, high five) that we’ve done since I was a small child. \n\nThe need for physical affection doesn’t lessen with age. The parents reaction to it causes the children to not want to. \n\nI leave it up to my children, but for 17yrs, I’ve always tucked them in, snuggled them, etc, as they needed/wanted, and I will always continue to do so.",
              "id": 130,
              "comments": [
                {
                  "score": 5,
                  "content": "This! I’m 36 and I lost my mom 2 years ago. My dad tells me he loves me every time I talk to him, and hugs me every time I see him",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm a 40 year old, 6'1\" 250 pound man.... and I still cuddle with my mom and dad when I visit.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 199,
          "content": "\"You're too old for that, get off me\" is the real kicker here.",
          "id": 133,
          "comments": [
            {
              "score": 60,
              "content": "Nice shaming technique mom has . . .",
              "id": 134,
              "comments": [
                {
                  "score": 25,
                  "content": "She's gonna be back in like 10 years asking why her kid doesn't talk to her anymore",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 123,
          "content": "This.  My youngest son is 9 and he still sits close and cuddles.  As a dad I'll take it for as long as it goes.  I know I have a year or so left.  It's kind of sad.  I'll miss that.",
          "id": 136,
          "comments": [
            {
              "score": 91,
              "content": "My son will be 9 in a few weeks and he gave me a little speech about how when hes a teenager he wont want to hug me or hold my hand but he will still love me!",
              "id": 137,
              "comments": [
                {
                  "score": 30,
                  "content": "That's adorable.  Mine hasn't done that yet.  But he is getting very stingey with his hugs.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My friend is 31 and an attorney and still sits close to his dad. Their whole family is like that. Some think it’s weird but I think it’s sweet.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Nope, doesn't have a year left anymore! OP just prematurely bought that forward :( I'm pretty sad to think about what other innocent familial expressions of comfort and love this kid is getting withheld so as not to 'hurt' her.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "Hopping on here to say that a friend has a 21 year old son-he still lays his head on her lap & falls asleep. She'll NEVER push him away.\n\nImagine that, feeling safe & loved by a parent.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12632,
      "content": "I didn't realize there is an age limit for parental affection. When I'm too big for my mom's lap, I'll start holding her. My 16 yo still curls up for snuggles.",
      "id": 142,
      "comments": [
        {
          "score": 2492,
          "content": "I’m already pre-sad about the time when my kid will no longer want cuddles and she’s only 5.",
          "id": 143,
          "comments": [
            {
              "score": 655,
              "content": "I'm jealous. My daughter is 9 and is too old for cuddles:(unless she wants something, or is tired or upset)",
              "id": 144,
              "comments": [
                {
                  "score": 332,
                  "content": "I have a 9 year old daughter too and in those very rare special occasions when she wants to cuddle or sit on my lap I get so so happy! I wouldn't trade those moments for the world.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 161,
                  "content": "My kiddo didn't want cuddles from about 9 to 22. She is 27 now and loves when I visit - because we can lay in bed together for a while and I will rub her back before I go back to the guest room to sleep",
                  "id": 146,
                  "comments": [
                    {
                      "score": 159,
                      "content": "it’s absolutely a bell curve - wouldn’t have been caught dead snuggling my parents as a teen, now at 24 i sometimes drive the 45 minutes just to hug my mom. it comes back around ¯\\_(ツ)_/¯",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "That's encouraging, but also a long time to wait. 😅",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Tired or upset snuggles are the most important",
                  "id": 149,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Absolutely agree!!",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "They certainly are.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm 21 and still cuddle my mom ✊️😔",
                  "id": 152,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "I’m pregnant with my first and i’m already sad that it might end one day",
              "id": 153,
              "comments": [
                {
                  "score": 136,
                  "content": "A quote that has always stuck with me is “at some point your parents put you down and never picked you up again” 😭 I am dreading this happening with my own kids and they are only 2yo and 14wks.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 94,
                      "content": "I’ve seen this quote so many times and it’s just made me determined to pick mine up every now and then or attempt to until I die lmao",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "That quote is sadly triggering to me. It was very literal in my case.\n\nMy 6yo had always been a snuggle monster. He passed away without warning, and I will always remember the last time I picked him up. OP has no idea how much time she has with her child and is throwing this precious connection away.\n\nI have a 4 month old daughter now and I can 100% guarantee I will snuggle her every day for the rest of our lives!",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "What’s kind of sad is there is a flip side. They put you down and didn’t pick you back up again… and eventually you’ll be there to pick them (parents) up until you set them down for the last time. \n\nPhysical intimacy and caring for our loved ones go beyond childhood, and the idea that maturity is growing beyond needing or showing that… that’s cruel.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "No joke, that’s one reason I started lifting weights.",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "omg this makes me tear up. my mom would pick me up from bed every. single. morning. and carry me to the table for breakfast all wrapped up in blankets, until i was probably in middle school. she’s 5’2” and i’m small too, but lugging around a 12 year old carrying dead weight at 6am is no one’s dream, but she did it. and she definitely still would.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Right!! It’s the best! My son is 5 and I know how precious this time is. I don’t want him to ever be “too big” to want cuddles.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Same!",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Same. Cuddles are the best 🥰",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 290,
          "content": "I’m 30 and I don’t sit on my mom’s lap anymore but every once in a while I still curl up by her side when I visit",
          "id": 163,
          "comments": [
            {
              "score": 134,
              "content": "I’m 27 and still curl up next to my mom whenever I visit!",
              "id": 164,
              "comments": [
                {
                  "score": 213,
                  "content": "I used to work in a jursing home for people with dementia,  there was one old lady who liked to lay on the sofa and sleep. Her daughter (50s I would say) would come tonsee her most days and just hold her while she slept. Sometimes her Mum's head would be resting on her knee, sometimes her Mum would curl into a ball and cuddle up like she was a child...made everyone cry at different times x",
                  "id": 165,
                  "comments": [
                    {
                      "score": 50,
                      "content": "You also made me cry. Omg.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "My mom recently died of Alzheimer’s. In her last several months, she couldn’t communicate much. But she always was comforted by gentle touch. If she was in bed when I went to visit, I would sometimes just lay down beside her and snuggle up. She loved that and would often go right to sleep. I’m 54.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "I'm 38 and I do that too.\n\nWhen I visit and we watch TV, I would just curl up and rest my head on her should.\n\nOne time she fell asleep with her head on my shoulder and I thought I was about to cry.\n\nWe were never really close, but we are trying to catch up.",
              "id": 168,
              "comments": [
                {
                  "score": 8,
                  "content": "\"We were never really close, but we are trying to catch up.\" \n\nWhere did all this dust come from",
                  "id": 169,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "41 and I still cuddle my mom.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You sound like my daughter!",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 192,
          "content": "This. There’s no age limit. My 15yo still does this and if she has a bad day I AM HER SAFE PLACE! She needs those head scratches and affection. YTA. Yeesh.\n\nETA: and yes my own mother is also the same kind of affectionate with me. SAFE PLACE! COMFORT!",
          "id": 172,
          "comments": [
            {
              "score": 9,
              "content": "I can't even imagine what it would be like to have such a relationship like that with my mother. You're so lucky and sound like a great parent :)",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My 21 year old daughter does the same.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "I'm 52, and I still have days I wish I could sit on my Daddy's lap and get a hug...",
          "id": 175,
          "comments": [
            {
              "score": 9,
              "content": "My dad just recently passed, he was never much of a showing affection kind of guy but I miss a lot his ways to show affection which was cooking me breakfast, petting me on the head, and changing my guitar strings.",
              "id": 176,
              "comments": [
                {
                  "score": 6,
                  "content": "Monday was the 10 year anniversary of mine passing. My heart goes out to you.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "My husband is about a foot taller than his mom and occasionally wraps her in a huge bear hug. It gives me hope for when our boys (now 5 and 2) are big that hopefully they'll still want snuggles with me!",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "I’m 23 and when I’ve had a rough time I still go to my mom for a hug! Affection to your kids doesn’t have an age limit",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "My mom asked me if I wanted to sit in her lap for cuddles when I was sad until she died when I was 47. I never did once I was taller than she was, but she never cut me off.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Im 31, and now I have my mom sit on my lap because I'm 6 inches taller than her haha",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I'm 29 and now I'm going to sit on my mom's lap for a snug thr next time I see her.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I am literally 30 and will cuddle with my mom. That's how you know you did something right.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8648,
      "content": "YTA. And handled that terribly. You made her feel like she'd done something wrong. People sit in their parents laps at all ages. I've seen full grown adults do it. She's a child. No wonder she's upset with you.",
      "id": 184,
      "comments": [
        {
          "score": 1995,
          "content": "Agreed. When I, 24F, was sick in the hospital I got my mom to get into the hospital bed so I could curl up with her. She, without hesitation, did it. I would have been upset if she had of said no when I has in hospital let alone when I was 11!",
          "id": 185,
          "comments": [
            {
              "score": 736,
              "content": "I had the latter happen. I asked for mom’s help after a surgery and she laughed me off and refused. Like sure, I recovered fine…but I never asked for help again because I knew I would never get it. It was one of many nails building up to my self-estrangement.",
              "id": 186,
              "comments": [
                {
                  "score": 309,
                  "content": "This was my point when I commented. All she’s done is create a moment of resentment in her child for literally no reason",
                  "id": 187,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Exactly. I mean, it’s almost guaranteed that parents will do something their children will resent them for (even if just a little). Usually unintentionally.\n\nBut why do that on purpose? Why knowingly hurt them?",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I can relate.  I had brain surgery two weeks ago and live alone.  My mother, who lives 15 minutes, away never called to see how I've been doing, or offered any help at all.  I know better than to even ask.  She never had my back and never will.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I’m sorry you experienced that. You deserved better. I hope you’re healing well.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My mom treated me horribly when I had my 2 surgeries. The first one, (I had ruptured intestines) she was abusive and pissed off because I'm supposed to be her slave. She's not supposed to help me and she didn't. \n\nFor my 2nd surgery, my friends wanted to put me into a hotel (at the start of COVID) and take care of me because I had lots of pets and my mother would make me feed them, etc. She promised I wouldn't have to do anything. I returned home the day after my surgery and she told me she didn't get anyone to help because my surgery wasn't that big of a deal. (I had a kidney removed.) My neighbor was feeding my outside pets and when she came over, my mom tried to tell her I could do it now that I was home as if I was 100% back to normal after 2 days. My neighbor, being a nice person who has had her own health issues, told my mom no, that she knows how it is and would do it for a few more days. \n\nMy mom is the biggest baby in the world who once asked me if she needed stitches for a paper cut and screams as if she's being killed if you lightly bump her. Narcissists have to have a dog to kick and that dog can't be sick and still tend to their massive egos, so they treat you like dirt.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My mom and I are close, but she was awful at taking care of us when we were sick growing up. I think she felt stressed and lashed out at us when she couldn’t make it all better.  But as a result, all three of us prefer to be alone when we are sick and don’t want her help.  I think she wants to help us now, but we don’t want it.  It feels like you have to try to seem like you feel better than you do, a lot of pressure when you are sick.  My mom sounds far better than yours, but these things stick with kids.",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Ugh sorry. Learning about your parent’s empathy deficit is really shitty. Hope you’ve got other lovely people in your life.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "When I was in the hospital waiting to be transferred to an inpatient program I asked my dad to sit down next to me and rub my back because I wanted to be close to him. I’m 23. And he did it. Because he loves me. I’m sure OP loves her child, but she certainly isn’t showing it.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "Agreed, I’m 23 and when I get to meet my parents and have time to just hangout I still cuddle them.\nI’m literally their flesh and blood and love them very much. What’s the issue🤷‍♀️",
          "id": 195,
          "comments": [
            {
              "score": 72,
              "content": "I'm nearly 30 and when I come to visit my parents my mum often invites me for a cuddle if she's having a lie in.",
              "id": 196,
              "comments": [
                {
                  "score": 10,
                  "content": "Yep. I'm 30 and I still sit on my parents lap and cuddle with them when they visit.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "BEAUTIFULLY SAID !",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My dad passed when I was 28 but I sat on his lap my whole life. I'd keep it brief because I know I'm bony and not exactly comfortable to host on a lap but he loved it. My dad adored me and I adored him and just walking over to sit on his lap for a minute was so great. I'd be, first of all, shocked and so sad if he ever told me I was too old for that",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "I'm too big to sit on my mum's lap. So I pick her up instead",
          "id": 200,
          "comments": [
            {
              "score": 47,
              "content": "Awww good alternative 100%",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I am 34 and still sit on my mum’s lap 😅 I’m not the biggest fan, but I know it makes her happy like I’m a kid again for a moment and sometimes I want to be a kid again.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "These are words that will echo in her head forever and may even affect her relationships with other people in her adult life. Nice fuck up OP. YTA",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I don't think she can reverse this. What she did was reject her daughter in a rather rude way. I don't see the trust coming back and she will always feel self-conscience if she tries. These kinds of things can hurt for a lifetime. You were uncomfortable so you took it out on her. Either that or you truly believe it but, either way, YTA",
          "id": 204,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I’m 35 and my sister is 38, we still both sort of jokingly will get in my mom’s lap and cuddle.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Cue the scenes from Elf where Buddy is sitting on his (elf) dad's lap and his dad doesn't mind at all.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3794,
      "content": "YTA - too old? No, that's for her to determine, not you.",
      "id": 207,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2827,
      "content": "INFO:  How did you tell her?  Did you literally say \"You're too old!  Get off me!\"?  Or did you say something like \"I enjoy snuggling with you, but you're no longer small enough to fit comfortably on my lap.  Why don't you sit next to me and we can snuggle up that way?\"\n\nThere's nothing wrong with directing a child towards more age-appropriate behaviors or expressing that something is no longer comfortable for you.  That's part of helping a child grow up.  But you do need to redirect them to a behavior that *is* appropriate (because they need to be taught, they don't automatically know) and reinforce that while your relationship with them is changing, your love for them is consistent.  If you literally told her to \"Get off\" with no warning, it's no wonder why she perceived that as rejection and is now completely confused as to what sort of physical affection is ok or will get her snapped at.",
      "id": 208,
      "comments": [
        {
          "score": 1128,
          "content": "OP clearly stated in her post that her daughter is uncharacteristically small for her age so size is not the issue here. OP’s concern was clear in that she thinks the kid is somehow too old to be wanting physical affection that way and allowing her to continue would somehow be harmful.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "This is the best take I have seen so far. This could/should have been used as a learning opportunity but instead it reads as though OP just rejected her daughter's attempts at showing affection, which I am sure was extremely devastating and confusing for her. \n\nOP - boundaries are great but this was not a good way to go about setting them. YTA.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "“Age-appropriate” doesn’t seem to fit here. I think we need to be more open to what is “age-appropriate.” Little kids shouldn’t be watching violent movies; most teenagers shouldn’t be relying on their parents to do basic tasks for them (e.g. helping brush teeth or bathe). But there’s a lot of stuff that is only “age-appropriate” because of social norms (e.g. teenagers are allowed to like playing with dolls or watching TV shows made for toddlers). Why force kids to “grow up” if their “immature” wants (such as sitting in their parents’ laps) are not hurting anyone? Unless your kid is *actually* not maturing, this isn’t a problem.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1668,
      "content": "YTA. Your kid obviously loves you and shows love through cuddling up with you guys and feels comfortable. What you did by saying this is basically makes her feel embarrassed/bad about showing you guys love. Yikes",
      "id": 212,
      "comments": [
        {
          "score": 587,
          "content": "My dad did that, and I literally never hugged him again.",
          "id": 213,
          "comments": [
            {
              "score": 282,
              "content": "My mom told me when I was around 12 that I needed to stop sitting in my dads lap and getting piggyback rides and had my dad stop sending flowers to me at my school for Valentines Day when I was 14. Never fully recovered affection for either one after that. Mad at my mom for trying to control my relationship with my dad and mad at my dad for letting her.",
              "id": 214,
              "comments": [
                {
                  "score": 104,
                  "content": "i remember i used to call my dad “daddy” and he told me to stop. i never called him that again even when he would say it’s okay to YEARS later as a then-12 year old",
                  "id": 215,
                  "comments": [
                    {
                      "score": 113,
                      "content": "I used to call my dad by his first name when I was a kid. I don’t remember why or how it started, but my parents used to joke and talk about it fondly. When I was around 10, i called him that and he snapped “don’t call me that, call me dad, I’m your dad.” \n\nHe never told me it bothered him. I thought of it as a fun inside joke or something between us. I wouldn’t have had a problem if he’d sat me down and told me that he’d like to me to call him dad. \n\nJust like this post, it didn’t have to be a negative thing. It could’ve been a conversation. That hurt my feelings, and it clearly hurt OP’s daughter’s feeling too.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "That’s nonsensical and ridiculous. I guess the only thing to take from these situations is how not to be with the children we may have. \n\nI thought the goal was to let kids be kids as long as possible. You’ll be an adult for the rest of your life.",
                      "id": 217,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I called my dad Daddy my entire life. He passed when I was 28 and that's still his name to me. My brother, my mom, and I still call him Daddy. And I'll always call him Daddy",
                      "id": 218,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "It’s really depressing we live in a world where people fetishize incest to the point a child can’t keep using daddy for their parent or be given affection.",
                      "id": 219,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "The saddest thing I ever saw was when visiting a friend who was in a skilled nursing facility/rehab hospital recovering from a battle with sepsis. Some old dude in the dayroom near where my friend and I were sitting asked his son for a hug and the son told him back, \"Dad, you forbade me from hugging you when I was 7 and you punished me every time I tried after that. It's been 40 years, but I just can't touch you now!\"",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 234,
          "content": "I stopped hugging my mother when I was twelve. Her standard reaction from my earliest memories was to sigh and wait until I let go. When I turned twelve, it became a sharp jab in the ribs and \"yeah, get off me\".",
          "id": 221,
          "comments": [
            {
              "score": 74,
              "content": "Hi, hello. I'm your family now. \n\nDealer's choice:\n\n•mom\n\n•weird aunt\n\n•sister\n\n•amorphous cryptid in the woods\n\nYou deserve to know that you have people who care about you.",
              "id": 222,
              "comments": [
                {
                  "score": 15,
                  "content": "This genuinely made me laugh aloud. Thank you - I have been lucky enough to be emotionally adopted by others who love me fiercely. They've been my personal north star for a long time now.",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "I'm so sorry this happened to you :(",
              "id": 224,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah, at some point my mother - who had a lot of problems - started shrugging me off or pushing me away when I tried to hug her. I think I was about eight. \n\nA lot worse would happen but strangely that is something that really traumatised me. I think I decided at that point I was unlovable and I don’t know I ever really recovered. \n\nI have a cat now, kids didn’t work out for me, and I let him wake me up in the middle of the night for attention. Everyone says I should lock him out of the room instead of waking up and patting and talking to him at 3am but… I never what this cat to think he’s not loved.\n\nA cat. \n\nI don’t know how my mother or yours were like they were. It makes no sense to me.",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1136,
      "content": "What the heck, YTA. You just told your kid not to show you affection and now you are sad she isn’t showing you affection? I know 30 year old women with their own kids who still sit on their mom’s lap to hug them. You’re the only one making it weird. Apologize to your daughter.",
      "id": 226,
      "comments": [
        {
          "score": 401,
          "content": "You don’t understand! She told her daughter not to touch her. And now she wants her daughter to touch her.  Totally makes sense!",
          "id": 227,
          "comments": [
            {
              "score": 127,
              "content": "Oh right! How did I miss that? Thanks for clarifying! 😃",
              "id": 228,
              "comments": [
                {
                  "score": 45,
                  "content": "😂",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Ah yes that’s me. I hop onto my mums lap & curl up into a ball just for a little affection.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "So true! I'm  a 33 married grown adult and sometimes I sit on my MIL's lap to cuddle when I'm feeling a bit down. She actually asks us (me, her daughter and daughter's girlfriend) to cuddle with her when she's feeling affectionate. It would be one thing if OP felt uncomfortable with the abrupt cuddling, but there's nothing wrong with an 11 y/o wanting to cuddle her parents, and there's literally no age limit for cuddles",
          "id": 231,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 939,
      "content": "YTA. You should have talked to her about it before hand rather than abruptly telling her to get off. \n\nWith no explanation from you, it’s easy to get confused why something was okay one day and now it’s not. If you’re both okay with cuddling, what’s the problem?",
      "id": 232,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 856,
      "content": "YTA. Why are you denying her affection? I'm 29 and still cuddle with my mum from time to time. If I'm down, it helps immensely just having that comfort and love. If I was told, *at 11 years old,* that I was too old for affection from a parent, I would assume they no longer love me as much.\n\nYou should feel guilty.",
      "id": 233,
      "comments": [
        {
          "score": 463,
          "content": "I feel so guilty and the thought of my daughter feeling like I love her less now makes me want to cry. I will apologize to her later today and try to make things better.",
          "id": 234,
          "comments": [
            {
              "score": 506,
              "content": "My advice is to just tell her you messed up and you love cuddling with her,  but something you heard made you feel that maybe you were treating her too young for her age and that might be doing her a disservice,  but you've thought about it some more and you were wrong and you're sorry.   Also,   if your parents stopped cuddling you at a young age,  tell her you were following that without thinking about it.",
              "id": 235,
              "comments": [
                {
                  "score": 451,
                  "content": "Yes I think I will tell her something like that because that is really the case. I made a stupid mistake and it caused this problem but i love cuddling with her and want it to continue.",
                  "id": 236,
                  "comments": [
                    {
                      "score": 183,
                      "content": "OP this response shows that you care and you are really trying your best. A lot of times, the best thing you can do for your child is just to acknowledge your mistakes, apologize, and try to do better. It’s also totally okay to not want to have her on your lap all the time and I’m sure with some loving communication that’s something she’ll grow to understand as well. But parental affection is so important at every age. This post is making me want to drive 30 minutes to my parents house and hug my mom lol",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Thank you for listening to what people told you, instead of doubling down.",
                      "id": 238,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Say exactly what went down in your head and tell her you love her and wanted to make sure you were doing the right thing, and in all of  that need to love and protect her, you made a mistake and that you now realize that.  \n\n\nKids are much smarter than we give them credit for I would bet my ass she will understand to an extent that resolves everything.",
                      "id": 239,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Your daughter will be a teen soon enough and you want to keep her as close as you can, not push her away.\n\nYou really need to think this through.  The message you sent was very cold.  Everyone needs affection and your daughter will seek it somewhere else.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 188,
              "content": "It’s okay to mess up. An apology goes a long way for a kid.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I just want to chime in here. I know you're feeling guilty, and in my opinion, that's good! It shows that you aren't unyielding. \n\nA lot of families have similar \"rules\" for showing affection. When I was a kid, my mom showed a ton of affection, but by 10-11, it stopped. \n\nI KNOW my mom loves me, but it was quite a culture shock when I had a friend going through a rough situation and we cuddled platonically. \n\nIt felt so nice to be close - not sexual at all - but it also felt taboo. \n\nI try to surround myself with people who are not averse to physical contact because I like to be physically close to my friends, but I hate that I feel the stigma still. \n\nI'm guessing this is something that was passed down, or a nosy grandparent said something that had you questioning yourself, but from the perspective of a 32 year old male, i would tell you without a doubt if my parents wanted to show that kind of physical connection, I would jump at the chance.\n\nI speculate it actually reinforces positive interaction and helps people from becoming averse to touch. \n\nJust remember that while this is a hiccup, you didn't permanently ruin something. Based on your replies here, you plan on fixing it. Will probably bring you closer.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "You're clearly a very loving parent op, you just had a lapse in judgement and made a snap decision on saying something. It happens, we are human.\n\nI hope your apologies to your daughter goes well, and that you take advantage of this opportunity to teach her about consent and boundaries for others and for herself. She may need time to gain that blind faith in parental affection back, but with some work you'll get there im sure. Communication is key, you're there to teach her how to be a person.\n\nDont forget that one of the only solid things we can rely on in this world as a kid is our parents having our back and loving us, and an upsettlingly large amount of people dont even have that. Dont let her lose it, cause its agony.\n\nSincerely - a 21 year old with an amazing loving mum and a dad who constantly acts like i have to earn his love and respect by reading his mind and knowing what he wants me to do or say.\n\nGood luck :)",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Post an update! 🤗",
              "id": 244,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Here's some good news: parenting well is not about being perfect, but being willing to repair our wrongs. Apologizing to your kid takes bravery and hearing I'm sorry from and adult is truly life changing for a child.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My mum never hugged me. But when I was about your daughter’s age I was in hospital the whole summer. Late 80s so not as big on visitors and giving kids support. I was very underweight and small when I got out and it had been so tough I actually risked trying to cuddle my mum.\n\nShe reacted like you and as I already knew she was unsafe comfort wise, I absorbed the message girls must not get bigger. And the disordered eating I had became full blown eating disorder. I am 44 and still not entirely recovered from my restrictive eating disorder. \n\nI am no contact with my whole family because you know what else happens? People defer to the boundaries mom and dad set with pre teen kids usually. They mirror that so if mom says you are too old for X they don’t want to compromise a child by saying ‘no but its ok if this adult is different with you and touches you.’ They assume you are parenting this way for a reason. It doesn’t occur to people that reason is not good. I learned everyone in my family didn’t hug me because they deferred to my mum’s rule thinking as my parent it was to undermine her or harm me (such as infantilizing your smaller than average daughter). So that support network goes too.\n\nAnd FYI your reply is entirely ‘I’ and ‘me’ and how you feel. You haven’t thought how your daughter might feel so that apology is not sounding great based on that. You aren’t saying ‘I am upset my daughter feels alone’ you are saying ‘I want to feel less guilty I have a consequence of this.’ You need to set your guilt for you to handle and put your daughter’s needs first. This reads like you will tell her you feel guilty which then makes her carry that on top of your rejection.\n\nThat will just drive this wedge deeper. You can still do a lot here if you approach it well. YTA. If you are now almost crying that your 11 year old needs some space imagine how devastated she was with your blunt ‘get off me.’ Flip it and it will help the empathy your apology needs.",
              "id": 246,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I’m 33. And 7 months pregnant. We found out my grandma has triple negative breast cancer today. I climbed into my moms lap and cried. I think it’s really important you think long and hard about where your feelings are coming from, particularly this perception that physical affection past a certain age can be harmful. You can heal this rift with your child, and perhaps something within yourself as well.",
              "id": 247,
              "comments": [
                {
                  "score": 5,
                  "content": "My bonus-daughter showed up a few weeks ago with her 2 month old unannounced and climbed into her Dad's lap for a good cuddle and a cry because she was feeling overwhelmed. I held the baby, and he sat there bemused and cuddled her and made outlandish promises about how everything, forever and always, would be juuuust fine, and if it wasn't, her Daddy would fix it. Then she headed home feeling much better. It's totally normal behaviour in our family.",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 396,
      "content": "YTA. And you really, *really* hurt her too. This one may even be a core memory for her. Not much can fix this imo. She would need more affection from you and clearly you’re uncomfortable with that.",
      "id": 249,
      "comments": [
        {
          "score": 251,
          "content": "I'm NOT uncomfortable with affection and later tonight I'm gonna tell her I'm sorry and explain I was wrong, and then I'm gonna give her a big hug and lots of kisses.",
          "id": 250,
          "comments": [
            {
              "score": 167,
              "content": "Ask her if you can give her the hug and kisses. Then start turning it into tickle kisses, if she still likes those.\n\nShe may not be ready after the feeling of rejection",
              "id": 251,
              "comments": [
                {
                  "score": 184,
                  "content": "Oh yes I will certainly ask her if shes okay with the hug and kisses, shes never said no to hugs and kisses  before but I know that may have changed because if this incident.",
                  "id": 252,
                  "comments": [
                    {
                      "score": 106,
                      "content": "Good on you for listening and accepting that you fucked up and are willing to try and make amends.  You were 100% TA, but even the best parents make missteps and I hope that your sincere apology helps to repair the rift. Just don't rush it if she's not ready.",
                      "id": 253,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Your responses and willingness to admit you messed up brought me to actual tears. I hope the best for you and your daughter 🥹",
                      "id": 254,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Loving your attitude 💜 best of luck",
                      "id": 255,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Parents don’t have all the best answers, the point of being a good parent is learning from your mistakes through speaking with your child about what’s best for their needs and coming to a better understanding of each other. Being able to talk openly and apologise if your in the wrong and saying thank you when they help while also telling them if they don’t help out which isn’t giving them the skills they need in life or if they hurt your feelings so they can also learn to apologise and say thanks when they recognise you are doing nice things for them then learn to do nice things for u. The kid and the parent are both learning when raising a child. The other thing that really matters is not going out your way to be difficult with them and they will see that isn’t what your doing when u take their feelings into consideration. I truly think she’ll forgive you cause you sound like a good parent and that involves worrying if your doing what’s best for them and sometimes being wrong. It doesn’t make you a AH it makes you a good person realising your in the wrong and actually trying to fix it! You were clearly worrying incase you were doing something wrong by maybe babying her so came on here to find out if u went too far. They’re is a program called ‘child of our time’ and it goes through all the stages of growing up. They followed the same kids for all their childhood and it was amazing to get proper scientific information about child rearing. I really hope u see this. Good luck",
                      "id": 256,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "❤️ glad to see. i'm sure this will help",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This. She will need this. As long as she allows it, and it may take some time. She clearly loves you both so much. Patience, time, and affection.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Yeah. My mom made me feel weird for holding her hand while I was about 11 and it really messed me up.",
          "id": 259,
          "comments": [
            {
              "score": 24,
              "content": "I’m so sorry that happened. Children need physical affection. If a parent is uncomfortable giving your own child physical affection, it is selfish to be a parent.",
              "id": 260,
              "comments": [
                {
                  "score": 7,
                  "content": "Thanks <3",
                  "id": 261,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "[deleted]",
              "id": 262,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}