{
  "post content": "I (21f) usually always sit with the same group of people in my university’s dining area. \nThere’s this girl who i’ve talked to a few times, but i’m not really friends with. She’s kind of quiet, but when she finally talks she seems normal. \nI’ve sat across from her a few times and noticed how she was eating because it was weird to me. She eats maybe half of her food (keep in mind you control the amount of food. it’s cooked by the cafeteria staff buffet-style. \nshe could easily take less) and kind of plays with it with her fork when she’s “done” (aka eating half of it, sometimes even less). \n\nI didn’t say anything for a while, but a few weeks ago I had to ask her why she always only ate half her food. She seemed a  embarrassed, but answered she thought she was more hungry and laughed it off. I then asked her why she made this mistake every time we ate, and that she must have learned by now. \nShe didn’t really answer (I don’t actually remember, but it wasn’t actually an explanation) and left pretty quickly. \nShe doesn’t really show up that much anymore, but when she does she still eats like this, and I couldn’t hold it in anymore. I asked her once again, and also asked her if her parents never told her not to play with her food. \n\nIt was a genuine question, some people are raised in households where manners aren’t important, but obviously they are for most people. She got really mad at me and told me to stop commenting on her eating habits and that it was none of my business. I told her that it absolutely was since she was sitting at our table and obviously wasting food. She told me to go fuck myself and left and threw out the rest of her food (AGAIN!) \nAfter she left, one of my friends told me to leave her alone as she seemed like she was having a hard time and maybe had some sort of issue with food. \nYeah, obviously she has an issue with food?? She keeps wasting it! She hasn’t shown up again, i’m assuming she buys her own food now, which might teach her not to waste it so that’s good. The same friend who told me to leave her alone keeps pestering me to apologise to her, but I think she should apologise to me. She’s unnecessarily rude when being asked the most basic and obvious questions and also told me to go fuck myself? That’s way more harsh than anything i’ve ever told her. \nKeep in mind that I care a lot about food waste and the environment.\nAITA for telling a girl to stop wasting food?\n\n\nEDIT: OK! I’m the asshole! Sorry i’m not studying to be an eating disorder specialist. I looked up stuff about it and i’m realising I was too harsh. I’ll apologise the next time I see her and try not to be so condescending. But you should all follow your own advice. If people genuinely don’t know something you should tell them nicely instead, and i realise i should’ve tried to educate her NICELY about food waste and not have commented at all on how she was eating",
  "id": 1,
  "comments": [
    {
      "score": 57200,
      "content": "YTA\n\n    Some people are raised in a households where manners aren’t important\n\nApparently that includes you because you’re rude as hell.",
      "id": 2,
      "comments": [
        {
          "score": 9448,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 2759,
              "content": "I'm surprised OP has any friends",
              "id": 4,
              "comments": [
                {
                  "score": 968,
                  "content": "There are always people who like bullying behavior and some even encourage the bully.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 387,
                      "content": "Yeah, minor bullies need a Queen bully to torment the cafeteria",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "There are also people who don’t mind or recognize bullying if it’s not being directed at them.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "And some who don't cross a bully so they'll stay out of the bully's crosshairs...",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 658,
                  "content": "Does she? Or does she just have people who humor her because they’re stuck in her orbit and it’s easier to seem like a friend then end up as a target.\n\nGotta feeling once op is out of university the majority of these ‘friends’ will ghost her.\n\nYTA- this girls eating habits is none of your business. It’s not your food, it’s not your property it’s not your business.\n\nYou’re just being a bully- instead of focusing on some total strangers eating habits maybe you can focus on trying to turn yourself into a halfway decent human being.\n\nGood luck it’s gonna take a lot of work",
                  "id": 9,
                  "comments": [
                    {
                      "score": 398,
                      "content": "Girl acts like the cafeteria is literally making extra food just for this girl LOL I have news for you: What's not being sold will still be wasted!\n\nI take kratom for chronic pain. It affects appetite. When I would go on my lunch, I'd try to at least try to eat something, knowing I rarely even got my last ten minute break and that it's not long enough to eat, anyway, but I often would eat this way, as well. I HATE wasting food, so it was definitely stressful, to both feel physically hungry and too bloated/\"full\" to actually eat. I'd struggle over an hour break to eat very little food. Unfortunately, trying to take kratom AFTER lunch would mean so much pain I could barely stand, to come back to work... Which was standing on concrete. \n\nYou never know what a person has going on! If someone asked me - again! - how my parents raised me, my food would be in their damn face.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I mean the OP didn't even call te hem friends besides one, she called them the group she sits with while eating.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "I'm truly stunned anyone wants to be around her after watching her act like this",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "She sounds so clueless about social interactions I wouldn't be surprised if the girl she bullied is the one who is friends with this group and OP just sits with them and declares they're actually **her** friends",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "She doesn’t, not really. She’ll find that out soon enough.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Not one of these \"friends\" stopped her in the middle of bullying this poor girl. They waited until she was done and made the poor girl feel terrible.\n\nGreat people, all of them. 🙄",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "She probably does not have any friends. They all secretly hate and bad mouth each other.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "it's the mean girls' table.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I had to grit my teeth at the “it was (my business) since she sat at OUR table” but I think I wore them to nubs by the time I got to “Keep in mind that I care a lot about food waste and the environment”. Ugh, so she’s one of those ‘activists’ who has to be an ass to everyone who doesn’t do exactly as she wants. (I get activism, and caring about food waste and the environment, but damn, there’s a limit) If OP has any friends, I’m surprised they’re still sitting with her at “their” table after that awful behavior.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Some people confuse arrogance for confidence.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 707,
              "content": "No, no, don’t you see? Op is just worried about this girl wAsTinG FoOd! If op doesn’t micromanage the daily activities of everyone around her who will?\n\nBut on a serious note I used to have a roommate who would do things like this. It wasn’t really bullying behavior, at least it didn’t come from that place. He was definitely somewhere on the spectrum and once I got to know him better I could see that it was like a tic for him that when he saw someone doing something he considered illogical he HAD to butt in and tell them, he seemingly couldn’t help himself. This is how I’m picturing op, even after that super oblivious edit admitting fault for all the wrong reasons.\n\nBut either way YTA for sure.",
              "id": 20,
              "comments": [
                {
                  "score": 427,
                  "content": "I will respectfully disagree. And yes that edit is abhorrent. She should have tried to educate her nicely?",
                  "id": 21,
                  "comments": [
                    {
                      "score": 438,
                      "content": "Seriously. How does OP go on a tirade about manners, but doesn't get that it's super rude to think she has the right to tell anyone and everyone what to do? Smh",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 262,
                      "content": "I was appalled by that edit. OP doesn't get it, or won't get it. I think it's the latter. Anyone that is different from her and doesn't meet her approval will be met by her arrogance and bullying.\nThis week is actually eating disorder awareness so when I came across this post I got really angry. I'm in my 50's and have anorexia. It's people like her (my sister is one of those) that make it a lot harder to recover.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 142,
                      "content": "Her edit made me laugh",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 93,
                      "content": "Yeah this girl went to uni to get educated by professors, not by self-righteous students. I would tell OP off too.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Educate her about what?  She should mind her own business",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "While I see your point, food is such a major issue for a lot of people. No one should bring attention to how much or little someone eats. It’s inappropriate and unhelpful at best, but could easily worsen an eating disorder.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "The sheer arrogance of the edit is almost a thing of beauty. It’s just so pure in its arrogance.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "And she’ll try not to be condescending? Good luck with that.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "It’s none of OP’s business. It’s not her place to educate this woman on anything unless specifically asked for assistance. YTA.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Or \"sorry I'm not studying to be a food disorder specialist\"??! OP is stuck up in her own ways and still thinks she is right and she needs to tell others how they should eat. OP must have either been a lifelong bully, or never went to public school before. This was the same exact stuff I went through, with a big group of people like OP, who caused me to have a bad self-image of myself for being shy to eat around others as well as having a literal disease that zapped all my food resources, which would get worse with stress. I may be exaggerating due to my own experiences, but OP is ignorant and I hope she experiences true emotional pain that she just put the other girl through so maybe she can learn some empathy. It hurts so badly when people nitpick at your dietary habits and your body when you're already trying your best",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "see if i was op, id be way more worried about someone who i see every day not eating a lot than the fact they’re wasting food. i’ve been there especially when i was losing weight from an ed where it all looked rly good then once i sat down w my friends i couldn’t get myself to eat all of it. not bc i didn’t want to but bc my ed told me my friends would judge how much i got and how much i ate",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I had a roommate that would similarly hyper focus on things like this, but her reason was environmental impact, rather than finding us “illogical”. \n\nOP reminded me of her quite a bit, going on about food waste and HAVING to bring it up over and over when her comments were clearly not welcome. \n\nWith my roommate, it started with the bathroom wastebasket. House full of women, we always had to line the trash with something for period products. \n\nInstead of buying bin liners, we would save the plastic bags we got from grocery shopping and use those to line the trash can. We figured “hey, might as well get two uses out of them? Better for the planet?”\n\nBut she was adamant that we shouldn’t use plastic bags at the grocery store at all, and should only use reusable (nice idea. But we often forgot.). Paper at our local store wasn’t an option. \n\nWhich meant carrying all your stuff in your arms was the right thing to do, if you forgot your reusable bag. Never accept plastic bags. \n\nWe asked what she proposed we do to line the trash can and she said we should use nothing 🤢 and just scrub the bin by hand if any blood got in it. \n\nShe was majorly outvoted on that one. None of the four of us wanted to scrub each other’s menstrual blood out once a week. \n\nSome people are coming from a good place and trying to help the environment. I can see OP using that as a defense. \n\nBut OP, like my roommate, has to learn to let it go when the other people aren’t interested in the “lesson” you’re insisting on teaching them. \n\nIf you must, suggest a better solution ONCE. But if it’s not welcome, move on and don’t be a bully about it. Instead, go do one good deed for the environment instead to negate the little food waste your friend makes that you can’t tolerate.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I know several adults with autism. My first thought after reading OP’s post and edit is that she is likely on the spectrum. Either that, or she’s severely lacking in social graces and empathy. Regardless, YTA OP.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 293,
              "content": "[removed]",
              "id": 35,
              "comments": [
                {
                  "score": 6,
                  "content": "Bullies always think they are in the right. She has a bright path to a public meltdown over something completely inconsequential ahead of her if she doesn't clean up her controlling attitude or whatever possesses her to care about what others are eating. Sounds like an issue stemming from food insecurity or get own insecurities.",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "at school.",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "Just imagine in a year or two when OP has a job... she will be the person that everybody hates but the boss loves (because she is a kiss-ass rule follower), so even though she has a horrific personality she will be next to impossible to get rid of.  \n\nLet's hope this B doesn't end up in HR...",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "From someone who has struggled with an eating disorder, thank you so much for this. When I was in my freshman/sophomore years of college I very much was like the (maligned) girl in this post. Taking more food than I would actually eat helped me to not visually count my calories and obsess over exactly how much I was eating. Thank god nobody did this to me because it would have been really traumatizing. \n\nAlso, I understand food waste is something we should all consider but individual people should never be pressured to finish everything on their plate (especially with our obesity crisis). The remainder of that food wouldn’t have been magically teleported to a starving child in Africa, and grocery stores/restaurants/food suppliers contribute way more to food waste than individuals.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Even the edit OP added is crappy. WE aren't being nice enough calling OP out? Some people can't just admit they're wrong and take their lumps. This is something to learn how to do, you'll go a lot farther in life if you can be humble.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "A bully with no self awareness! I'm not even amazed anymore with these types of people. They post at least once a day. OP YTA clearly and I can't believe you could type all that out and not had that realization!",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I’m in my 40s and my last boss bullied half the staff out when he took over. He literally ran someone out of town. Bullying sadly never stops.",
              "id": 42,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "OP’s edit made it worse lol. Still not getting the hint. YOURE SUPPOSED TO LEAVE THEM BE, LET THEM DO WHATEVER THEY WANT OP ITS NOT YOUR CONCERN.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9350,
          "content": "Seriously!! Plus the “she’s kind of quiet, but when she *finally* talks she seems normal.”",
          "id": 44,
          "comments": [
            {
              "score": 6224,
              "content": "I’m an introvert and that line really pissed me off.",
              "id": 45,
              "comments": [
                {
                  "score": 2997,
                  "content": "I'm an introvert and people looooove to make comments about my eating. This entire post pissed me off!",
                  "id": 46,
                  "comments": [
                    {
                      "score": 1061,
                      "content": "SAME. I'm a huge introvert and growing up most people just commented on my eating habits. Especially since I was very tall and *very* thin but ate a lot but also felt like I was always being watched while I ate so the timing of my eating was... weird. I'd sneak food throughout the day at school and eat meekly during actual lunch because I felt like I was always being watched. Then I'd go game and eat an entire box of pasta. Adults always did this shit too. Like bih I'm a 16 year old girl. The last thing you should mention is my eating habits or my body. And yet that's mostly what people talked about to me, as the shy introvert",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "This is the main reason I don't like eating with other people. Too many of 'em just can't seem to keep their fucking opinions to themselves. Yes, I'm a picky eater; yes, maybe I ate the least out of everyone at the table. WHAT ABOUT IT?? Is it personally affecting you? Is my food somehow gonna end up in your stomach? No? Then shut up already and just eat what works for you.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 606,
                  "content": "Same! The whole thing about “she seems normal” and “how she was eating seemed weird to me” - just UGH.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 422,
                  "content": "I’m an extrovert and it pissed me off! Not everyone feels the need to talk as much as I do, and that’s okay!",
                  "id": 50,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Thank you for being an understanding extrovert. Not all extroverts are like this :)",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Can you imagine how noisy the world would be if everyone was an extrovert?",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I drive a car with inverted wheels and I'm pissed too.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Same here! Also just want to add, I love to play with my food and OP can fuck all the way off with the whole \"didn't your parents ever teach you\" bullshit.\nAfter I've finished eating, mashing up my food and mindlessly rearranging everything is therapeutic af. OP needs to chill.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "yeah, same, i don’t understand why people think we’re the oddballs for not talking 24/7.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Same!!!",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1503,
              "content": "She sensed how judgmental and ABNORMALLY nosy the OP was so she chose to keep quiet.  Seriously, the only truly bizarre behavior I'm noticing is the OP's obsession with this quiet girl she barely knows.",
              "id": 57,
              "comments": [
                {
                  "score": 424,
                  "content": "Exactly! I have my own issues with food and I’m so self conscious about it. I would 100% pick up that the person across from me was staring me down while I ate.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Probably why she didn't want to eat that much. And also some of us would find it awkward to tell cafeteria worker\"hey stop I only want 20 black beans\" I went to college and granted it was in 1996- but I received normal portions.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 410,
              "content": "Mean, girls gotta mean girl!",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 344,
              "content": "Exactly… so is OP saying people that are quiet are abnormal?",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Girls like OP are exactly why I am quiet now. I used to be SUPER extroverted.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Jesus OP sounds mean as hell",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Because apparently being quiet isn't normal.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I left a comment above about that . That’s when I knew this poster was going to be the asshole.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I literally yelled WTF at my laptop when I read that.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2206,
          "content": "Did you check out the edit? It’s feels just as rude. I’m amazed by folks like this one. It might just be their writing style? But come on!!",
          "id": 67,
          "comments": [
            {
              "score": 1448,
              "content": "I know, she's has learned nothing, and is still going to torment that poor girl, but 'nicely' this time.  OP, you're still TA, even post edit",
              "id": 68,
              "comments": [
                {
                  "score": 713,
                  "content": "Right?  She still thinks somehow it's her place to \"educate\" a fellow student.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 129,
                      "content": "And us.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "The edit made it worse.",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 43,
                  "content": "Commence patronizing in three…two…",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1079,
              "content": "Look through her comments, she's such an asshole. She tells people to stop smoking too and doesn't think it's rude. Her rehearsal of how she would apologize ends with \"but still, try to think about food waste ok?\" Honestly grade A assholery.",
              "id": 73,
              "comments": [
                {
                  "score": 794,
                  "content": "Seeing the edit after commenting this afternoon re-pissed me off. Like she didn’t learn that next time she should just not say anything at all, she just learned that she shouldn’t talk about *how* she was eating. But also made it all about how our responses were not nice, she’s not studying to be a “eating order specialist.” It’s just a condescending insincere apology because she genuinely thought she wasn’t an AH somehow.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 251,
                      "content": "Seriously. It’s like the “I’m sorry you were upset” apology.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "I also wonder how much food the cafeteria throws away on the daily?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Probably enough that Op would crap herself if she considered it. But better to focus on the insignificant waste one person makes per day and berate them for it. \n\nI worked in a diner in high school/early college. The amount of wasted food was ridiculous. But food safety meant you couldn’t give it away legally. It had to be trashed if it had ever left the kitchen even for a second. \n\nThen one of the waitresses had an idea. Her neighbor had pigs. Who eat literally anything/everything. So we started putting food only in a separate bin, and she would take it to her neighbor every night on her way home to give to the pigs. \n\nIn return, the pig owner would give our staff each some sausages/bacon every time they processed a pig to say thanks. \n\nWin/win.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 756,
              "content": "Yeah basically she admits that she will continue to harass the girl but she'll be \"nicer\" about it.",
              "id": 78,
              "comments": [
                {
                  "score": 489,
                  "content": "God forbid she mind her own business.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 27,
                      "content": "She probably voted for Trump when she was 18",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 666,
              "content": "yeah, the edit just makes OP even more of an asshole.\"I didn't know\" okay, but you should've at least known that people in general can go through shit you don't know about.\n\nIt was literally none of OP's business at all. OP drove her to stop sitting at that table. And the edit makes it clear OP hasn't learned anything and was only a 'little harsh'.\n\nThe level of entitlement is on another level.\n\nYTA, OP",
              "id": 81,
              "comments": [
                {
                  "score": 38,
                  "content": "The entitlement is unreal.\n\nHow could someone get like this? Even if they're, idk, on the spectrum (?), has no one ever taught them that it's not their job to judge or patrol people's eating patterns. If not, their parents were AHs too.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Agreed that the edit made it so much worse.  OP, YTA two times over in this post alone. I can’t imagine how many other AH situations you create daily with your entitlement. A lot of us care about the environment but we know that creating change is not done by criticizing others. You owe her an apology, period, no more “educating” people who don’t need educating.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 532,
              "content": "Yeah, the edit is…not great. OP had to research eating disorders to be able to judge the woman more positively instead of just realizing she should mind her own damn business? Oof.\n\nInfo: OP, why do you feel that what a grown-ass adult does with their own cafeteria meal is in any way your concern? Stay in your lane, as they say.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 461,
              "content": "The edit is insane. \"Hey stop being mean by telling me I was mean. I should have educated her nicely I guess and I'm still not getting it that the right thing to do is shut the fuck up\"",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 309,
              "content": "Yeah, their edit shows they've learned very little from this.  I'm guessing since this girl is now actively avoiding OP she's likely not going to enjoy what OP would view as an apology.  An apology that 10 to 1 starts with I'm sorry followed with the word but and an additional lecture from the self appointed Ms. Manners.",
              "id": 86,
              "comments": [
                {
                  "score": 43,
                  "content": "That’s not fair to Miss Manners. She will be the first to say you don’t go around lecturing people on behavior. Even if there is genuine danger you can find a way not to be rude.",
                  "id": 87,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 287,
              "content": "That was the weirdest part. She admits she was wrong, continues to not sound sorry and then gaslights people for giving the opinion she asked for in the first place. I don’t think the other girl should be holding her breath for a sincere apology and maybe the whole crew should move to another table without OP so they can eat (or not eat) in peace.",
              "id": 88,
              "comments": [
                {
                  "score": 32,
                  "content": "Apparently she can give unwanted opinions and constantly badger someone but being told she was the asshole when she asked was too much and too rude. Like... Why?",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Yeah his edit is demanding an explanation so he can excuse his shitty behavior. What a toxic asshole",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "The edit made it sooooo much worse.\nNo OP, you don’t need to educate her “nicely” about food waste.\nYou need to mind your own GD business and stop being a snotty mean girl",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1582,
          "content": "This jumped right out at me, too!",
          "id": 92,
          "comments": [
            {
              "score": 216,
              "content": "[removed]",
              "id": 93,
              "comments": [
                {
                  "score": 77,
                  "content": "That edit itself was full of op being condescending and horrible and claiming commenters need to be nice when OPs friend was already nice telling them to leave the girl alone because she could have an issue with food… like what",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1225,
          "content": "I listen to an etiquette podcast, and they've mentioned that it's generally poor etiquette to call out someone else's bad manners, and the gracious thing to do is brush it off, and maybe find a way to politely redirect the behavior if needed.",
          "id": 95,
          "comments": [
            {
              "score": 1000,
              "content": "There's a story of the former Queen of the Netherlands, Wilhelmina, receiving the president of South Africa, Paul Kruger and him attending a formal dinner. Apparently Kruger didn't know that the little basin of water next to one's plate is to dab and clean one's fingers in. He drank from the bowl and in order to save her guest the embarassment, the Queen followed suit and also drank from her bowl.  \n\n\nThis is 1900 at the royal court. Perhaps not quite as high on etiquette as the British, but you know, there must've been plenty of rules. Yet, the Queen, ensured her guest didn't lose face.",
              "id": 96,
              "comments": [
                {
                  "score": 211,
                  "content": "Same story is told about Queen Victoria by the way.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 133,
                      "content": "I'm wondering if it's at all true or just a rumor as many times as I've heard it with different royalty. It's literally a scene in Princess Diaries too",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "I hate to burst your bubble, but the British court has historically been one of the more lax courts with respect to etiquette. The real sticklers were Spain and all the dozens upon dozens upon dozens of postage-stamp German principalities.",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "Same thing happend to the Princess of Genovia",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Sounds like the story used in Shrek!",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Sietze Buning has that story in Purpaleanie and other Permutations.",
                  "id": 102,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "That's a GREAT host.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 577,
              "content": "I had a very strict grandmother and she really loved manners and she was very clear that you never corrected others unless their manners are effecting someone else ie being rude to staff",
              "id": 104,
              "comments": [
                {
                  "score": 29,
                  "content": "I don't even know how to correct people who are being rude to staff. The last time I ended up eating at a table with someone incredibly rude (the guy was manspreading at the table, snapping his fingers at the waitstaff, using a fork to eat sushi, talking with his mouth full, making a giant mess, talking about the woman he fucked the night before, trying to show pictures of said fucking at the table etc) I just sat there being appalled and annoyed that this guy kept putting his knees where my knees should go. (He was a friend of one of my friend's boyfriends, and he was just all around horrible.)",
                  "id": 105,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I've only done it once but I wouldn't even say he was being rude, this dude at a hotel was straight up abusive to the clerk. I was waiting behind him in the lobby. \n\nAnd I was just like \"Hey dude, lay off, you're acting like a jackass.\" But idk, he was being an ass *to* someone else so to me that's not really just about manners anymore. \n\nI've never commented on anyone's table manners and I'm not sure I ever would.",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 247,
              "content": "I used to sit with my work team for dinner (night shift) and one of the team used to talk with her mouth full and also somehow managed to continue to put food in her mouth while she talked, it was simultaneously impressive and disgusting. I noticed the entire table would look away when she went to say anything. This went on for some time and it was pretty gross. \n\nI waited one night until the table was clear and asked her in the most polite tone I could muster to please stop talking with her mouth full. She didn't talk to me for like 2 weeks. I was actually pleased, she was irritating just generally anyway. \n\nWas I rude? Idk :/ it certainly was an issue",
              "id": 107,
              "comments": [
                {
                  "score": 254,
                  "content": "You saw her ugly behavior and waited until the coast was clear to talk to her about it. I say, well done. She probably answered you rudely because what you did, let's face it, was off the wall... BUT you may have opened the door to a better life if she paid attention to what you said.\n\nI have seen people with atrocious eating habits and ACHED to talk with them about it. They will miss out on friendships, loves, job offers and more. . but I just haven't had the nerve to do it.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 29,
                      "content": "This reminds me of a judge who mentored me in law school.  Great guy.  Brilliant. Kind. Thoughtful.  We met for lunch one day when he was busy.  (We couldn't meet in his office & it was lunch time.) \n\nHe had previously mentioned that he worked on cars (and with his hands) on weekends & that was why his hands & nails always looked dirty. I had noticed, but, nbd. That's cool that a judge works on cars as a hobby. \n\nBut the day we had lunch..... we had sandwiches. We had an hour to eat. I've never seen anyone eat like this. He stuffed his mouth,  chewed with his mouth open *while* talking rapid-fire and spraying half chewed across the table onto me. Even worse, he not only ate everything with his dirty hands, but he licked each visibly dirty  finger. \n\nWas it gross? Yes. Did i say anything?? No. He was an incredible person and a kind, brilliant judge who had bad table manners.. he was in his 50's. Married with kids. Why say anything?\n\nBut I didn't meet him for lunch again.  Mostly bc I was concerned he'd realize how gross it was to me. I DO NOT have a poker face, lol.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "A bit different than having a meltdown in front of other people! I like to think I'd like to know, rather than maybe doing something subconsciously that annoys people.\n\nI apparently make little weird sounds, all the time. I literally didn't even know I was doing it until someone I worked with went, \"boop.\" I thought that was kinda weird, but whatev- Then I heard MYSELF go, \"boop\"! Now I hear it LOL I literally had no clue.",
                  "id": 110,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "What’s the name of the podcast?",
              "id": 111,
              "comments": [
                {
                  "score": 10,
                  "content": "Oop, didn't think my comment would blow up! But the podcast is Awesome Etiquette. I highly recommend subscribing on Patreon if you can.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Not sure if it’s the same one but I really enjoyed Awesome Etiquette",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 917,
          "content": "[deleted]",
          "id": 114,
          "comments": [
            {
              "score": 190,
              "content": "\"Wearing the food themselves\" I love that 🤣",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "But, but OP CARES!!  Not about people obviously but about food waste. They're all for bullying people though.\n\n'",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I was reading this entire thing and all i could think is if OP did this to me I'd ask who died and made her the Queen",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 480,
          "content": "[deleted]",
          "id": 118,
          "comments": [
            {
              "score": 343,
              "content": "It’s the policing of how much she eats/doesn’t eat for me. Imagine just minding your business and being yourself and a stranger insistently comments on your eating habits.\n\nPersonally, I hate being wasteful but sometimes it’s going to happen when you either eat with your eyes or come to find something wasn’t as appetizing as you’d thought.",
              "id": 119,
              "comments": [
                {
                  "score": 135,
                  "content": "Honestly, my depression has made that latter statement so true. I'll be 3 bites into my dinner and then suddenly just lose my appetite because my mood is not having it. I *want* to eat the food. I love the food. But the current sight of the food is making me want to puke. \n\nI only ate half my egg salad sandwhich today at lunch, and you know what my friends said to me? *Fucking nothing*. That poor girl",
                  "id": 120,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I feel you, I go through this a lot or become so anxious, I can’t eat. When this happens to me, I try to fill up with smoothies or carry easily accessible snacks like easy to eat fruits or nuts if I can’t trust myself to commit to a whole meal. \n\nIt absolutely happens and I really hope you’re taking care of yourself as best as you can. Sending love to you.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "If I'd been that girl I would have graciously offered OP what was left on my plate (making sure to add\"Hungry? Bless your heart!\") and yelled at her if she tried to throw it out. But of course OP, like most predators, can sense vulnerability, and those are the people she chooses to harass. YTA. Proper sentence would be a 1-way trip to Asshole Island.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The only, only thing that might be acceptable to say to the woman getting rid of food is to say you’d be interested in it when they get up to get rid of the tray.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Right! I keep in mind that even if I may not eat everything on my plate, someone else might and have the habit of portioning off whatever is on my plate. I part-time at a restaurant where our employee meals are free everyday and I end up splitting everything in half and giving it away or sharing if I can. But! I can’t always, if there’s no one to split with and I can’t find someone to give it to. It goes to waste. This is the unfortunate cycle of how food supply functions—larger portions in restaurants, things in the markets being put out if they aren’t cosmetically appetizing or are just about to expire. It’s like how the Dunkin’ Donuts near me puts out nearly everything they don’t sell by the end of day instead of just giving it away to someone hungry. I can’t do anything about that, but I’m not walking in there and castigating anyone working there.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "In middle school I never ate lunch but I would still go through the line and get a tray for anyone who wanted it at the table. All of them had the manners to not ask why I never ate. They just accepted that I didn’t.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 285,
              "content": "My first thought was meds. I used to be on ones that I would be starving but then would suddenly get extremely nauseous while eating sometimes almost as soon as I started eating, sometimes I would get to eat a good amount of my food. It was hard to know how much I would be able to eat.",
              "id": 126,
              "comments": [
                {
                  "score": 109,
                  "content": "I was thinking about this too. When I was in college and living in the dorms, I was also having some mystery stomach issues where I would randomly become really nauseous and have stomach pains and I could never really predict how much food my stomach was going to let me eat. It was incredibly frustrating.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yep. I'm not on meds, but at certain points of my menstrual cycle, sudden nausea can occur in the middle of a meal. So no, I can't 'learn' how much I need to take on my plate as OP expects. Sorry OP.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Maybe she just doesn’t like eating in public and is trying to overcome that. Could be any number of things. But it’s nobody’s business and, agreed, very rude to pry.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I ate like this every day when I went to college and lived in the dorms. The reason may be outstandingly simple.\n\nThe food fucking sucked, and it was only _somewhat tolerable_ when it was fresh and piping hot, and you were hungry. My tray was a few half eaten items every day. You would literally just lose steam halfway through the meal once that immediate hunger was satisfied and the food cooled off. Then you really started to taste how bad all of the ingredients were 😂",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I def have some disordered eating and it has taken a lot of work for me to be like “it’s fine to eat in public. everyone is focused on their own food. no one cares”\n\nif OP said this to me i would fkn spin outttt",
              "id": 131,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 440,
          "content": "And she has the nerve to tell the commenters to “follow your own advice” about correcting her nicely, as if rudely embarrassing someone in front of their friends is the same as having anonymous people message you that you suck. No lesson will be learned unfortunately, YTA",
          "id": 132,
          "comments": [
            {
              "score": 156,
              "content": "Especially after you ASK them if you suck! OP asked and didn't like the answers they got. The poor girl didn't ask to be rudely embarrassed. No need to follow the same advice when the situations are NOT the same.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Not to mention that literally nobody told her to ‘correct her nicely’. Nobody. Every single person is and was telling her to mind her own business and not be a bully.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 415,
          "content": "Really though!\n\n-Treat others as you want to be treated.\n\n-If you don't have anything nice to say, don't say anything at all.\n\n-Mind your own goddamn business.\n\nJust some of the manners I was taught. Well, the third thing is really more advice specific to OP...",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 402,
          "content": "Lolol. Yeah YTA OP. Also, policing individuals about food waste is going to accomplish absolutely nothing to solve the larger issue of food waste. This isn’t about individual shortcomings it’s about a larger system we are all living in.",
          "id": 136,
          "comments": [
            {
              "score": 168,
              "content": "Glad someone said it!! OP giving this poor girl frief because they care so much about food waste and the environment does nothing. At the same time the dining hall might be throwing out large volumes of unconsumed food at the back anyway but apparenrly cios this one girl might have scooped herself a little extra something the whole planet is dying.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 160,
              "content": "OP here's etiquette:\n\nDon't comment on  or question people's bodies - size, shape, color, smell etc.\n\nIf you really think the person is ill or the problem is medical you ask ONCE - have you had a check up? & even that is a knife edge.\n\nDon't comment on people's food, portions, amount eaten/not eaten.\n\nUnless you are hosting this person to dinner and they consistently waste food, especially if others don't get an opportunity to try the food.\n\n\"Pardon me dear friend, I made enough for 6 people to have about 2 servings, from the utensil in the food to serve w. Could you take 1 serving first and come back for seconds when everyone has had an opportunity to try the dish. If there are leftover & you'd like some to take home I'll gladly do that (or kindly explain why no - I  really like having some for lunch tomorrow/dear partner will have some when they get home).\n\nGenerally comments to sat \"That color suits you.\" \"Those slacks balance nicely w your sweater.\" Kindness, appreciation, cheerleading.\n\nNo qualifications that sexualize them.\n\nThat's kind, that's polite.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "The cafeteria food is already made. Whether or not half a plate of it gets chucked has no overall effect on the amount of food consumed by the cafeteria. Oy.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "That was my first thought. Food waste occurs on a much larger scale commercially than from person to person. Multi-billion dollar corporations throw away thousands of lbs of food every year in order to keep profits up. Go bully Walmart, not some poor girl with an eating disorder who is probably going to relapse because of your self-righteous abuse. If this is a genuine concern I would recommend forming a commission of your peers to discuss your concerns regarding food sustainability practices on campus with the appropriate boards.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17966,
      "content": "YTA.\n\nIt was hard to even read the whole thing. Why are you so concerned what this stranger is doing in the cafeteria?\n\nAs much as I hate seeing wasted food what do you think is happening to all the food that isn’t ate that’s cooked at your school? It goes to waste. Same thing happens at a lot of fast food chains and restaurants. \n\nThe fact that you really kind of don’t understand how awkward and embarrassing it is that you felt confident enough to walk up to someone and ask why they don’t eat all their food / is wasteful is odd to me.\n\nWhat if she always thinks she’s able to eat more than she actually is able to? Thinks a dish is going to be good but then after a few bites decides it’s not? Who are you really to say? The fact that you feel entitled to an answer to the question is also odd to me.",
      "id": 141,
      "comments": [
        {
          "score": 13310,
          "content": "YTA. This girl is exhibiting classic ED masking behaviors — and it also sounds like she’s really trying to combat it. She takes a normal proportion, and eats what she can. Then, she chops up the rest and pushes it around her plate to make it look like she’s still eating.\n\nOP just called out this girls’ ED in public.\n\nOP, all of your friends told you not to say something. LISTEN to them.",
          "id": 142,
          "comments": [
            {
              "score": 3568,
              "content": "Yup.\n\nI never had a formal eating disorder diagnosis, but when my anxiety was so bad I couldn't eat, I would deconstruct my food and move it around to make it look like I ate more than I did.",
              "id": 143,
              "comments": [
                {
                  "score": 1793,
                  "content": "Sometimes I'd move it around because I really wanted to want to eat it but I couldn't bring myself to, so I'd just pick and hope it would get more appetizing...\n\nIt typically didnt",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1110,
                  "content": "ADHD screws up how I eat - I get overly hungry because the signals to my brain literally don’t process until I’m starving. At that age a buffet helped me at least introduce novelty in a desperate attempt to avoid satiety hormones. Then if I get distracted or if some AH comments on how little, how much, or how I eat, my appetite shuts off and doesn’t come back for hours. Then I’m overly hungry again AND I associate that restaurant with being interrupted so I can’t come back.\n\nOP says she didn’t know she was supposed to be an expert on eating disorders, but she’s also not an expert in keeping her mouth shut about what other people do, and that doesn’t require taking a class.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 477,
                      "content": "For me, my ADHD meds mess with my appetite. I’ll take a normal amount of food thinking I can eat it all but then halfway through my meds win out and I can’t eat anymore.\n\nWho knows what this poor girl’s situation is, but it’s none of OP’s business!",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 431,
                      "content": "This reminds me of a girl in my graduate program who couldn't abide me bringing fast food to class because it's unhealthy, not organic, and the cups were disposable so wasteful. She wasn't wrong, but with my executive dysfunction, it was cheap fast food or no food some days. Just like the breastfeeding versus formula debate: fed is best. This girl passive aggressively bought me a reusable cup and nearly lost her mind a few months later when I gave her a ride and she saw my stack of fast food cups. You can't use reusable cups in a drive-thru, so I'd transfer the  drink from the fast food cup to the reusable one. \n\nAny time she asked me about why I ate fast food, she wouldn't listen to my answers unless she was going to refute them. She also had accommodations for an anxiety related disability and *heaven forbid* someone not accommodate her. But my way of working around my disability? Excuses and wastefulness.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I'm glad you said something about this because immediately after reading OP's post I thought possible ED and/or ADHD. I wasn't sure if anyone would mention the latter but you did! \n\nMy appetite is wonky af and thankfully my husband is a human garbage disposal and will demolish what I can't eat when my eyes are bigger than my stomach.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 182,
                  "content": "I used to take a bigger plate of food to trick myself into thinking I'd only eaten half. Ed or not though YTA",
                  "id": 149,
                  "comments": [
                    {
                      "score": 42,
                      "content": "My cousin did that when she first started trying to heal from her ED. \n\nWe did NOT remark on her food, whether it was a waste, or on how much she ate. We did our best not to talk about food unless she brought it up in fact.",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "That's such a great work around! Thanks.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "same, it's rough! I sometimes have to tell my family, please don't give me grief, I'm trying to eat as best I can.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah I did the same thing (I'm a high functioning anorexic), you don't eat or pick up enough food and people call you out on it (particularly with guys who generally aren't very educated when it comes to EDs and are just like \"eat more food\" and im like yeah but then ill feel guilty for the next week) so you pick up enough food and try to make it look like you ate more than you did.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "when my gf was recovering, this behaviour and keeping the plate for a bit after supper also helped with an occasional extra bite or so after she thought she was done without it being pressure or feeling observed or like taking 'more'. i was so angry reading this post",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I knew a girl who would eat mashed potatoes with every meal, so she could spread them out to make it look like she wasn’t eating as much as she was until she was full. It was a pretty ingenious solution to her specific food related anxieties.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 777,
              "content": "I immediately thought this from the title. Reading the post was excruciating, as well as the edit. Even in the edit they’re still a huge asshole and basically says their lack of knowledge is to blame. \n\nI feel like people with ‘good manners’ would know not to comment on someone’s eating. With the exception of being lost at sea with limited rations there is absolutely zero reason OP should ever say something about wasting food. Op is a massive YTA. If I were there I would call them much worse than just an asshole.\n\nEdit: I said see when I meant sea",
              "id": 156,
              "comments": [
                {
                  "score": 440,
                  "content": "On top of that, OP says that their friend repeatedly told them that the girl might have problems with food and that she should apologize. I don’t see why OP just ignored this and plowed ahead. They might not know a lot about eating disorders, but their friend clearly tried to warn/explain it to them",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 265,
                  "content": ">Even in the edit they’re still a huge asshole and basically says their lack of knowledge is to blame. \n\nLack of knowledge, my ass. Something tells me that if this isn't rage bait (so many posts reek of it here), then OP definitely saw the signs of a possible ED in that girl and decided to publicly shame and bully her over it in a way that she thinks gives her plausible deniability about whether or not she knew what she was doing.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 170,
                      "content": "Bingo.\n\nOP targeted this girl.\n\nThis is evidenced by OP's attempts to justify her multiple instances of abhorrently rude and shitty behavior AND OP's overly defensive reaction to hearing all of Reddit call her an A. \n\n\"But when she finally talks she seems normal\".....OP \"others\" her by using the word finally. \"Seeming normal\" doesn't outweigh the more deeply rooted opinion that OP has with her lack of engagement. \n\n\"Didn't your parents teach you not to play with your food?\"....OP chooses these words specifically to embarrass and infantilize her publicly. They were tactical.\n\nOP...she probably doesn't talk near you because she can smell your kind a mile away. \n\nAnd so can everyone else.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 88,
                      "content": "I agree. She knows exactly what she’s doing. Just looking for a way to be a bully and not be called out for it. But we see you girl. We all see you.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "This right here. I strongly suspect this is what she was doing.\n\nAlso, sweet user name I’ll tellya hwat",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Oh that edit was awful. They're so full of it talking about nicely educating when they need to realize it's pass time to stay in their lane!",
                  "id": 162,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Lol they even edited their edit. Originally it was about all of Reddit taking our own advice and not being rude about something we didn’t know….?? This may be the most entitled AITA post.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I can understand not knowing things but don’t get defensive when you’re presented with an alternative perspective or new information.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 434,
              "content": "With some folks who have EDs its really hard to eat in public settings too because you're so concerned with the idea that others are observing you & judging you for what you do/don't eat.\n\nI can't imagine how much of a set back it would be should she have an ED. I know when I was still in recovery having folks make *any* comment on my food/eating was enough to have me going back into some bad behaviors. I couldn't imagine how bad it would be if someone decided to make a whole scene about it.",
              "id": 165,
              "comments": [
                {
                  "score": 84,
                  "content": "This! I know personally I’m one that gets major anxiety eating in front of people. Smaller incidents like this have set me back enough that I’ve had to be in crisis care. I can’t even imagine how badly this could have possibly set her back. I wouldn’t want to eat in public ever again.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yes! I’m so worried that the reason the person suddenly wasn’t seen in the cafeteria so much was because she just simply wasn’t eating because her ED was triggered.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "That's actually one of the main identifiers for a lot of eating disorders, is the fact that your relationship with food has become as such that it feels like something shameful so eating it in front of people becomes extremely uncomfortable because you feel disgusted with yourself that youre doing it.\n\nI'm a high functioning anorexic and one of the main most important steps for me to recovery (haven't made it all the way there and frankly most people dont but Im going in a good direction) was actually to stop eating in front of people so much so I could at least eat enough to get by. Of course, atm im working on trying to see eating food as a less shameful act and therefore have started eating with people again. \n\nHonestly it sounds like this girl is at least trying to eat and thats a rly good sign which is why OP is all the worse for calling her out because she might've set back this poor girls progress quite significantly and with ed's, even small setbacks can be permanent.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "that’s the exact reason why I hate eating in public, i feel like everyone is staring. i always order in or take it to go.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 394,
              "content": "Exactly this. I’m worried OP set this girl back considerably in her recovery efforts. Being self-conscious about eating in front of people is also extremely common, and OP just made an already difficult and anxiety-filled activity absolutely hellish for her. \n\nOP, for the record, when you don’t see her in the cafeteria, it’s 1000% NOT because she’s “buying her own food.” It’s because you teamed up with her disorder and harassed her out of eating *anything*. She’s starving, largely because of you. Also, don’t you DARE try to “educate her about food waste.” Seriously. Don’t. Just leave the poor girl alone.",
              "id": 170,
              "comments": [
                {
                  "score": 150,
                  "content": "Yeah OP has done harm to this person and she’s not sorry.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 117,
                      "content": "EXACTLY. Eating disorders are statistically the deadliest mental illness. OP endangered this girl’s life and keeps trying to defend herself.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 100,
              "content": "She might even just legitimately over estimate her appetite. I very rarely finish my food because I almost always over estimate how much I can eat. Or i want a sampling of everything. Or I dont really like what I got and I'm not going to force myself to finish.",
              "id": 173,
              "comments": [
                {
                  "score": 10,
                  "content": "> I very rarely finish my food because I almost always over estimate how much I can eat.\n\nSame for me. I have a healthy relationship with food--I definitely don't have an eating disorder--but I always seem to overestimate how much food it'll take for me to feel \"full\".",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Even on the oppossite of this, this \"Everything on your plate\" mentality can itself make problems and cause obesity too. That was my problem for decades. I was raised to always eat everything on my plate, that food waste was bad, that there were people starving while I didn't eat what was given to me. \n\nAll the while, portioning and plate sizes started to skyrocket, all the while people kept echoing the same thing. To throw out food was bad, to waste the food was bad, Should eat it, or save and eat it, and until I was 18, my mom was firmly the \"Let me plate everyone\" type of woman aside from also being the \"eat everything on your plate\" Type too, so I did not have a good grasp on what actual portioning was or even where to begin to learn how to eat more mindfully. Was up to 370 at my highest before I finally broke myself free of it... and you know how? By telling myself that it's OKAY to stop eating what's on my plate, regardless of if someone else served me or I served myself, and that it's okay to \"Throw out\" food I haven't eaten that I don't plan to eat. Food waste sucks, sure, but it's all shit that breaks down in a landfill or can be composted, so I don't think it's as bad as non-reuseable bottles from bottled water that many of the people who hate on \"Food waste\" but in bulk either. \n\nPeople need to lay off this stupid shit \"Eat everything on your plate\" bit. You give people complexes if they CAN'T eat everything on their plate, and encourage obesity to those who can in exchange for your stupid ability to say you're not \"supporting food waste\".  With that said, I managed to drop much of my weight after getting a Gastric Sleeve surgery(the initial push down before surgery was done by learning to eat properly instead), and I'm legitimately still at this point where I'm trying to get the right portions on my plate and not \"overeat\". Imagine trying to eyeball 2-4 oz of meat, 2 oz of vegetables and 1 oz of starch or a dessert, and going over by a slight amount. I have to give myself permission to toss what's left over, and so far it's worked well. Last family dinner I went to last month, My aunt tried to tell me to take a fucking full piece of pie, and I told her to shove it and only took the tip, split it with my sister while she bitched about \"Food waste\" and that I'm only eating \"partial servicngs\". Op is definitely TA and I feel would be a lot like my aunt.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Not necessarily just ED. Sometimes even other health problems present the same way (arguably though I guess you can call some of it disordered eating)\n\nThere were times  I'll look like I'm eating and don't really eat most of it cause food honestly was painful\n\nRegardless, it's cruel that she was treated like that",
              "id": 176,
              "comments": [
                {
                  "score": 7,
                  "content": "I had stomach and duodenal ulcers and gastritis, and I majority struggled to eat full meals. I would be hungry, but so nauseated.\n\nEta: Adrenal insufficiency did the same thing.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Also not taking into account any other potential health problems.  I mean, the girl has zero reason to share any medical history with OP but OP has appointed herself cafeteria queen so of course they're right.",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Could also be adderall. It makes me so un-hungry I know I need to eat and take enough food, but it often takes me hours to finish it :(",
              "id": 179,
              "comments": [
                {
                  "score": 9,
                  "content": "I had this thought too. It’s incredible how quickly I would feel full when I was in college and on ADHD medication. I would be starving and then a few bites later, full to the point it was physically a struggle to swallow down any more food.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It’s funny, because even though it stunts my appetite, it’s the only way I remember when it’s meal time",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "This!! I personally don’t have an eating disorder, but I’m an extremely slow eater and am self conscious about it around friends. People always finish before me, so I say I’m done when I’m not so they’re not waiting. Sometimes I’ll also randomly feel full after a few bites even when I feel like I’m starving beforehand. So many different reasons can be behind it and OP not being aware of/considering any of them is…concerning",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 477,
          "content": "Nope apparently if you want to throw away any food you actually owe OP an explanation as to what your excuse is and she’ll decide if it’s worthy.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": ">It was hard to even read the whole thing. Why are you so concerned what this stranger is doing in the cafeteria?\n\nHalfway through I literally had to go check the ages and expected it to be 15/M or something, but nope; 21/f.  Crazy.",
          "id": 184,
          "comments": [
            {
              "score": 81,
              "content": "I did exactly the same. I was shocked to find it was a 21\nyear old woman acting this stupid.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "[deleted]",
          "id": 186,
          "comments": [
            {
              "score": 100,
              "content": "I have struggled with ARFID for about 2 years now after having consecutive bouts of food poisoning and cyclic vomiting syndrome in a short period of time.\n\nThere are many times when I make a big plate, eat a few bites, and then the ARFID kicks in and I start to struggle to swallow and have to stop eating so that I won’t start gagging/dry heaving at the table. \n\nOP - I know how it looks. I don’t need people like you to point it out. I wish I could eat, I really do, so I like to give it a good try each time. You suck. YTA.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 157,
          "content": "This. Does OP not know that surplus food that are not sold in restaurants are thrown out at the end of the day so the customers the following morning are served fresh, newly-cooked batch of dishes? OP, don't be a hypocrite. If you really *hate* seeing wasted food, go to a restaurant (at least one restaurant a night), ask for ALL of their excess food, and either consume it all yourself, give them to your friends/family, or donate them to food banks (if you have one in your area). Bullying one person for \"wasting\" half of their food isn't gonna make that much of a difference AND you are further ruining this person's relationship with food.\n\nYTA.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 61,
          "content": "Yeah I was wondering if OP cares when the cafeteria inevitably wastes a huge amount of food or if it only bothers her when this relatively quiet girl who she thinks she can bully does it. What a coinkydink! OP please let us know if you hassle the school administration about the cafeteria’s wasted food.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "She could have grown up with food insecurity and her eyes are bigger than her stomach.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I could only get through half. OP is a bully…. In college.. and that’s a whole level of sad I never thought of before. \n\nYTA. Get a grip and find something interesting to do with your free time.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Not to mention all of the food grocery chains throw out. What a holier than thou nasty person. YTA. \n\nEven the comment she made in her edit is condescending.  She will learn nothing from these comments.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Came to say the same! I can guarantee that at minimum 100x the amount this gal tosses is thrown out after every meal! That food was going in the trash regardless. \n\nPeople, if you want to take stand on issues of waste and environmental impact, stop lecturing individuals! First off, no one responds well to this, you won’t be changing minds by acting holier than thou. Second, individual contribution to food waste, carbon output, and general population is practically nothing compared to large corporations that run our systems. You’re after the wrong people, you won’t be changing a thing if you don’t focus on what the actual problem is. It isn’t that your neighbor doesn’t recycle, they should, but their waste is a piece of sand compared to a tanker truck.\n\nOP is TA, for being rude, but for also claiming to be passionate about something they seemingly know nothing about, as an excuse to be an asshole.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9182,
      "content": "YTA dont comment on peoples eating habits, you dont know if its an underlying ED or whatever reason. She doesnt need to justify it to you.",
      "id": 194,
      "comments": [
        {
          "score": 2921,
          "content": "I immediately thought \"ED behavior\" when I was reading this. I'm surprised it hasn't been pointed out more. She takes what looks like a normal amount of food because people will comment on too-small portions too. Most people don't pay attention to whether or not their tablemates clear their plates, so it could seem like a safer option.\n\nAnd honestly even if it is just about her not knowing her appetite or whatever, YTA for getting involved op. One comment out of concern is enough, she's an adult and she doesn't have to listen to you. Hounding her about it until she stopped showing up to the cafeteria was too much.\n\nEdit: the ED behavior has been pointed out a lot now which is great, but when I wrote this none of the top comments had addressed it yet. Thought I'd clarify now that it's starting to look odd on my part heheh",
          "id": 195,
          "comments": [
            {
              "score": 1021,
              "content": "Also the doubling down in the édit of « sorry that I’m not an expert  in EDs », you don’t need to be a specialist to guess someone having a strange relationship to food could be struggling",
              "id": 196,
              "comments": [
                {
                  "score": 373,
                  "content": "Yeah that edit made me grumpy.",
                  "id": 197,
                  "comments": [
                    {
                      "score": 371,
                      "content": "Her edit show's that she's clearly a bully, and that she likes to gaslight or manipulate situations.",
                      "id": 198,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 199,
                  "content": "And then crying about how rude people are being… like, girl, you harassed a girl you barely knew for a possible ED she might have. You don’t have the high ground here.",
                  "id": 199,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 119,
                  "content": "And OP should NOT try to educate this girl nicely about food waste. Just leave her alone. The point has been made and OP needs to move on.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 57,
                      "content": "RIGHT? I’m searching the comments with a microscope looking for where the hell she thought anyone told her to “educate her nicely.” That’s a funny way to spell “leave her the hell alone.”",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "You also don’t have to be an expert in ED’s to recognize rude behavior in yourself. But some people just weren’t taught good manners at home.",
                  "id": 202,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "> Also the doubling down in the édit of « sorry that I’m not an expert  in EDs », you don’t need to be a specialist to guess someone having a strange relationship to food could be struggling\n\nLiterally none of OP's business. Like if you're going to stick your nose into someone else's business you're gonna be wrong some of the time. Even if this girl doesn't have an eating disorder, hounding someone out of the cafeteria is huge AH behaviour",
                  "id": 203,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Yeah and she’s a 21 year old woman. Absolutely no way does she not know ED exist",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 207,
              "content": "Yes. I immediately thought ED behaviors.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "That was my first thought as well.  It amazes me that with how common place ED’s are now that some people are still so in the dark and uneducated about them.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Yep. The playing with the food to make it look like she’s eating is classic ED masking.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Yep. I had an ED in college and this screams ED behavior to me. I definitely did similar things in social situations to “appear” like I was eating normally.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Same. I was reading this and thinking “has OP never heard of an eating disorder?”",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "So did I. I'm in remission and this is classic.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Even if it isn't ED (I'm a half-eater myself and I can explain if anyone wants but I assure you it's rather boring), still does not matter. She's doing a thing, her way. Yes you were curious and that's fine to ask the first time. But to continue to interrogate and berate her is too far. Maybe she has an ED, maybe not. A lot of people do things 'weird' and you leave them alone to it. All you're doing is making her self conscious about it.\n\nI want to go to OP's university and demand to know why they don't have their pinky up when drinking? Why are they using a different hand to cut the meat than how I was raised. Why are your legs crossed, it's bad for your posture. Speaking of which, sit up straight! Get your elbows off the table! IS THAT THE SAME FORK YOU USED FOR YOUR SALAD AND NOW YOU ARE USING IT FOR PASTA?? Last week you had a bottle of water. Don't you know that's bad for the environment?\n\nThat's how OP sounds.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I can attest. I don’t have an ED, just a very small appetite, and people love to make snide remarks when I take only what I can eat",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 367,
          "content": "She 10000% does. I was this girl in sooo many situations. Commenting on it probably made it so much worse. Cause her eating at all is good. She’ll probably now avoid dining halls and restaurants and eating  even less.",
          "id": 213,
          "comments": [
            {
              "score": 238,
              "content": "That’s what was ringing in my head when OP commented that now she has to buy her own food. Nope, she likely isn’t eating anything now. OP, YTA and in your *deep* concern about food waste, you did more harm than good",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "I remember right after recovery at my new job. They invited me to a birthday party. I declined a piece of cake. You’d think I did the craziest thing!  They stopped inviting me cuz “clearly you don’t like cake”. People are ignorant. Congrats on recovery",
              "id": 215,
              "comments": [
                {
                  "score": 34,
                  "content": "My heart just broke for you. I hope you’re doing better now and are around better people",
                  "id": 216,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I am recovered now (about 7 yrs) Thank you for caring. ❤️",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "That’s so freakin rude!! :( \nGlad to hear you’re doing better.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This, absolutely. So many of my 'ED behaviors' in public were really me trying to figure out how to get food in a way that 1) wouldn't make my brain upset and 2) wouldn't result in people commenting on how much or how little I was eating. The number of times I had people ask \"is that all you're eating?\" was so awful. This poor girl, fucking hell. \n\nEven if she didn't have an ED, comments like can be damaging. Maybe she just wasn't hungry, but now is overanalyzing everything she eats for fear that someone will decide to confront her about it again. Or is avoiding eating in public at all.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 166,
          "content": "Might I add that commenting on people’s eating habits can make them WORSE\n\nYTA",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I thought of that right away and then realized I too have strange eating habits due to neglect, poverty and childhood trauma. I work with food, I get a free meal every shift and it's hard for me to a) accept food from others and b) eating \"properly\" in front of others. I will stand in a corner facing the wall eating standing up rather than sitting down at a table with utensils because I just... dont think of sitting at a table for a \"meal\". It wasn't a part of my upbringing and people make fun of me all the time for it but I've just embraced that yeah, I'm fucked up with food, what of it y'know.\n\nEdit: spelling",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Just think about it. OP being so hung up on her plate they are probably hawkeyeing/starring at her when she eats. Only thinking about it has my skin crawling.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "OP believes her version of “manners” justifies harassing a stranger in public.\n\nSick manners, OP.\n\nYTA.",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Exactly. I’m autistic, have food texture aversions, weird habits of only eating one layer of anything at a time (lasagne, burgers, etc), and have several food allergies that people say aren’t there but really are. I’m also working on recovery for an eating disorder. \n\nYou have no idea what her story is, OP, but you immediately decided you must “educate” her. It is never, *ever*, your job to educate *anyone* unless it’s your own child, or you’re a teacher, and even then it’s only okay for the subject you teach. \n\nInstead, you tormented her, bullied her, insulted her, and have caused her to alter her entire routine simply because of *your* behaviour. Not hers.  Not anyone else’s. *Only yours*\n\nYTA. Leave every person around you alone if you don’t like their eating habits. They are 100% *not your business*. If you have a problem with it, you get up and move. Not them.  Your lucky you so-called friends haven’t gotten up and left you yet for how they see your true colours are those of a bully.",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5126,
      "content": "[removed]",
      "id": 225,
      "comments": [
        {
          "score": 503,
          "content": "Bet you if the victim had been getting portions she could/would eat, OP would have judged that, instead.",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "[removed]",
          "id": 227,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3948,
      "content": "Jesus fucking Christ, yes YTA. \n\nFirst off, you barely know this person. It’s not your fucking place to comment on her eating habits, period. At all. Like just zip your lips, it’s none of your business what she eats or doesn’t eat. \n\nSecond, it sure as hell isn’t your place to repeatedly scold and try to correct her. This isn’t about manners! She doesn’t own you an explanation or have to live up to your personal preferences just because she sits near you! \n\nThird, you have *no idea* what might be going on with her health, physical or mental. Which is why - again, since you seem stubborn - it’s not your place to have an opinion or make a comment on it. \n\nI don’t know what you thought you set out to do by hassling her, but all you have accomplished is letting your friends know you’re an AH and isolating someone who may already be in a vulnerable place.",
      "id": 228,
      "comments": [
        {
          "score": 695,
          "content": "But she dared to sit at OP's tayyble... she asked for it! 🙄",
          "id": 229,
          "comments": [
            {
              "score": 51,
              "content": "Oof. My brain even simulated the vocal fry in that sentence.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 338,
          "content": "Op the type of person to ask a random woman on the street how far along her pregnancy is. Then when she gets told it’s rude to ask a stranger that, she’ll be like “oh okay let me apologize and I’ll make sure I’m polite and educate her about babies”",
          "id": 231,
          "comments": [
            {
              "score": 99,
              "content": "100% - she is still the AH in her edit response.\n\nNo, don’t educate strangers. They didn’t ask your entitled opinion.",
              "id": 232,
              "comments": [
                {
                  "score": 42,
                  "content": "Crazy she had one of the most unanimous votes Ive seen that she was TA. Yet she still somehow managed to completely miss the point. I laughed at the “you all should follow your own advice” bit in the edit, like she doesn’t realize the difference between someone posting to Aita and a random girl eating quietly by herself.",
                  "id": 233,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "I had a total stranger ask me my birth plan at the grocery store. I just said, “I don’t know you” and walked away. It’s so crazy how people treat pregnant people.",
              "id": 234,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I've actually had ppl do that to me about why i don't have kids... if the conversation were any longer, i imagine she would have explained how when a man and a women love each order very much, then demonstrate how to put the penis in the vagina",
              "id": 235,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This is the best comment, like I’m speechless about how arrogant OP is and how entitled they feel they are to this random strangers eating habits.",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "To your last paragraph: Did you see the edit? OP sounds like hardcore bully. I was neglected as a child and people like OP would get mad at me for wearing the same outfit to elementary school when my mom wasn't doing my laundry. I had to be mostly self sufficient by the time I was about 10. People like OP just made it 90 times worse.  At least my bullies had the excuse of being children ffs. YTA OP",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2934,
      "content": "[removed]",
      "id": 238,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2488,
      "content": "[removed]",
      "id": 239,
      "comments": [
        {
          "score": 1284,
          "content": "Oh my god, agreed! the edit was somehow even more annoying and insufferable",
          "id": 240,
          "comments": [
            {
              "score": 518,
              "content": "I skipped the edit at first but I went back to read it after seeing your comment. Holy cow OP sucks.",
              "id": 241,
              "comments": [
                {
                  "score": 412,
                  "content": "it is wild to me how she STILL thinks she should lecture people about food waste. like how does nothing get through to you and you are in uni?",
                  "id": 242,
                  "comments": [
                    {
                      "score": 37,
                      "content": "She should go take a peak behind the counters and see how much food is actually wasted in a restaurant/dining hall. Will she scold the school for wasting food? Probably not she just wanted to be an asshole to this person.",
                      "id": 243,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": "It’s sort of impressive to be such an asshole, then have people tell you you’re an asshole, then make an edit where you’re even more of an asshole. That’s a special kind of special.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "If you think the edit is bad. Read her comments.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 690,
          "content": "Even in her edit, \"sorry I'm not studying to be an eating disorder specialist\", like girl, 95% of the commenters aren't eating disorder specialists but we still know that calling eating behaviors out in public is incredibly rude af and frankly weird.",
          "id": 246,
          "comments": [
            {
              "score": 218,
              "content": "OP’s edit: how weird that you guys think unsolicited advice is rude yet somehow find solicited advice acceptable? Fucking hypocrites”",
              "id": 247,
              "comments": [
                {
                  "score": 19,
                  "content": "LOL",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "And her edit just solidified that further\n\nIt's actually insane how far up her own ass she is.",
          "id": 249,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "OP is one of those people who are always on a high horse pretending to care and thinks she's so smart. Bet that \"apology\" ain't gonna be genuine either.",
          "id": 250,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2430,
      "content": "As the sort of person that you clearly don’t like, YTA.\n\nSometimes, you just think you’re hungrier than you are; it happens.  But from a different perspective, WOW what the hell is wrong with you?  When I was in college, I had disordered eating.  If people talked about food while I ate, ESPECIALLY if it was a comment about what I was eating, I wouldn’t be able to finish my plate.  The thought of it would make me sick, I couldn’t force myself to continue eating.\n\nSeriously, it is NOT your business to comment on her eating habits.  You’re the rude one.  Also, if it actually concerned you, there were better, more empathetic ways to go about voicing your concerns.",
      "id": 251,
      "comments": [
        {
          "score": 344,
          "content": "I too have disordered eating and I was like “yeah this sounds like something I would do.” Like even if it’s not ED masking, my disordered eating associated with my OCD makes it so that I’ll be eating something and then an intrusive thought will happen or I’ll see something that looks off in my food and then I can’t eat the rest of it and THEN I’m embarrassed by it. \n\nIt’s really none of OP’s business either way lmfao like I couldn’t believe what I was reading. Imagine being so pressed about a stranger like this. Major YTA and OP needs to stay in her lane",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "I got to where in high school I simply wouldn’t eat in front of people because no matter what I ate, the other kids made fun of me. I was fat and there was always criticism. Even if I tried to eat healthy they had to make fun of me “oh look she’s trying to diet, like that’s going to work.”",
          "id": 253,
          "comments": [
            {
              "score": 61,
              "content": "Ugh, what a bunch of little shits. Sorry you had to deal with that… I hope they look back in horror at what assholes they were",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1788,
      "content": "YTA YTA YTA \nfrom the beginning you say “seems normal” which is such a rude thing to say like wtf? and second you go on to talk about manners yet know nothing about them , mind your own business the food isn’t coming out your paycheque and if you care so much u can start help providing what an entitled person you are!",
      "id": 255,
      "comments": [
        {
          "score": 198,
          "content": "I feel like this other girl must be unbelievablably beautiful or something, and that the OP is behaving out of pure jealousy. It is such a random thing for her to attack! I don't buy the \"but I don't want food to be wasted\" excuse. She wants to tear this girl down so that she (the OP) can somehow feel superior.",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "yeah. If anyone here isn't normal, its OP!",
          "id": 257,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1110,
      "content": "YTA.  Who elected you to be the food police?  It is none of your business.  I'm not that big into apologies anyway, but she definitely does not owe you one.\n\nIn the Op's edit, OP still wants to tell her what to do.  MYOB, OP.  Not your business.  \n\nYou are telling us to be nice.  You asked for our opinion.  She didn't.",
      "id": 258,
      "comments": [
        {
          "score": 160,
          "content": "yeah, i don't see a reality here where she owes OP an apology.",
          "id": 259,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I love how she tries to double down in the edits telling us all to be nice when she literally just bullied this girl...",
          "id": 260,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Apparently she did when she decided to sit at the same table?!?",
          "id": 261,
          "comments": [
            {
              "score": 17,
              "content": "She didn’t wear pink on Wednesday so op got mad",
              "id": 262,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}