{
  "post content": "Hey all,\n\nI guess I just need to ask this cause it’s bothering me a lot. It’s a throwaway for privacy reasons. \n\nFor context, I suffer from persistent depressive disorder. I have random times of feeling very down about myself in lengths of time that ranges from one day to a few months. I’ve done a lot to improve on my mental health and I’m normal outside of these bad periods. That being said, I also haven’t been the most open person about this to one of my best friends. It’s not because I don’t care to tell, it’s just a very deep emotional wound for me to talk about. Plus, she has also gone through a loss of someone close to her, and I don’t want to have her worry for me causing more stress. \n\nShe invited me to her baby shower a couple of months ago. My mind was already slowly going down the rabbit hole during then and I felt it. And I told her the typical excuse of how I’m not too sure if I’ll make it cause I’d be “busy” but if I can, I will drop by. And unfortunately during the few weeks leading up to the baby shower, I was in a really dark place. The last thing I wanted to do was go and then bawl my eyes out randomly because I probably would. It’ll ruin everything. And when I’m in that dark place, I really isolate myself. So I didn’t message her that I wasn’t coming (I had thought I already confirmed I wasn’t) or follow up with her on her pregnancy. I didn’t message anyone when I didn’t have an emergency or obligation. It wasn’t personal at all. \n\nI totally understand that she feels like I don’t care but I really care a lot. It’s just hard to care for others when I don’t even care for myself. It’s on me for not telling her about my deep problems but part of the anxiety in me is fear of sharing it. \n\nSo fast forward now to maybe a few weeks after the baby shower, I reach out now that I’m in a better place mentally. She ignores me. I feel guilty and hence I start opening up on why and giving her context and letting her know I’ll be here. She deserves to know and I mustered up the courage to let her know my real problems. And that I understand she is angry but I’d still love to make amends and make it up to her. I explained my side and finally told her why and how it wasn’t intentional, that I don’t want to be like this. \n\nShe then accuses me of being a bad friend, being one-sided, and how she doesn’t care about me anymore. It really hurt me a lot. I’ve gone through thick and thin with her and though my actions might have hurt her, it was never intentional. I just wished she tried to understand where I was coming from of all people. \n\nI just wish that she didn’t assume the worst of me from one mistake when I’ve spent a lot of time giving her the best of me.\n\nAITA in all of this? She still ignores me and I just want to communicate. I know she had been through a lot during my absence but I want to show effort since I have the capacity to now.",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": ">I told her the typical excuse of how I’m not too sure if I’ll make it cause I’d be “busy” but if I can, I will drop by.\n\nYTA \n\nIt has nothing to do with your depression, really. Just\n\n1. Instead of saying yes or no, you said \"I don't know, maybe.\" How is anyone supposed to plan around that?\n2. You made it sound like her shower (and hence your friendship?) was not a priority for you. \"I've got important stuff to do, but maybe I'll condescend enough to attend your little shower.\")\n\nYou should have RSVPed \"no.\" Or if you thought you *could* make it and originally RSVPed \"yes,\" then you should have shot her a text or something saying that you weren't feeling well and would not be able to attend.",
      "id": 2,
      "comments": [
        {
          "score": -3,
          "content": "For context, I did RSVP’s no… perhaps my line was misinterpreted. The maybe was referring to if my situation changes, I will still drop by cause she told me I could even if I RSVP’d no.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "NAH\n\nSure, she could have been more understanding, but maybe she doesn't have the capacity, at least for now, to deal with it either.\n\nNot everyone are \"your people\" and that's ok.   May be time to move forward and find your person.  Give it time.  Maybe invite her out in a couple weeks.  Just a casual invitation and let it go however it may.  If she was really meant to be in your life, it will work out.  If not, better to stick with those who will support you and be understanding.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH - as someone who’s been through two major depressive episodes that saw my withdraw from everyone + everything and almost end it all both times, no one here is wrong. \n\nYou’re allowed to take care of yourself. You’re allowed to make yourself the priority. You’re allowed to do that in whatever way is the best and safest for yourself. However, freedom of self expression is not freedom of consequence. Your actions reverberate and unfortunately, when our friends are left without context to our withdrawals it can come across as flaky, uncaring, and inconsiderate. Just as you’re allowed to take space to heal yourself, your friend is allowed the same space to react. She took your absence in an important time in her life personally, and it probably wasn’t an isolated incident either. \n\nYou don’t owe anyone an explanation of why you pull away for extended periods of time, but it does help when we open up about our struggles. The more our friends know about us, the less they see as excuses and us being our honest and open, authentic selves. It creates more space for grace. I hope this is a good lesson and hopefully your friendship heals.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action that I did should be judged would be for missing her baby shower cause I was going through some personal problems.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHey all,\n\nI guess I just need to ask this cause it’s bothering me a lot. It’s a throwaway for privacy reasons. \n\nFor context, I suffer from persistent depressive disorder. I have random times of feeling very down about myself in lengths of time that ranges from one day to a few months. I’ve done a lot to improve on my mental health and I’m normal outside of these bad periods. That being said, I also haven’t been the most open person about this to one of my best friends. It’s not because I don’t care to tell, it’s just a very deep emotional wound for me to talk about. Plus, she has also gone through a loss of someone close to her, and I don’t want to have her worry for me causing more stress. \n\nShe invited me to her baby shower a couple of months ago. My mind was already slowly going down the rabbit hole during then and I felt it. And I told her the typical excuse of how I’m not too sure if I’ll make it cause I’d be “busy” but if I can, I will drop by. And unfortunately during the few weeks leading up to the baby shower, I was in a really dark place. The last thing I wanted to do was go and then bawl my eyes out randomly because I probably would. It’ll ruin everything. And when I’m in that dark place, I really isolate myself. So I didn’t message her that I wasn’t coming (I had thought I already confirmed I wasn’t) or follow up with her on her pregnancy. I didn’t message anyone when I didn’t have an emergency or obligation. It wasn’t personal at all. \n\nI totally understand that she feels like I don’t care but I really care a lot. It’s just hard to care for others when I don’t even care for myself. It’s on me for not telling her about my deep problems but part of the anxiety in me is fear of sharing it. \n\nSo fast forward now to maybe a few weeks after the baby shower, I reach out now that I’m in a better place mentally. She ignores me. I feel guilty and hence I start opening up on why and giving her context and letting her know I’ll be here. She deserves to know and I mustered up the courage to let her know my real problems. And that I understand she is angry but I’d still love to make amends and make it up to her. I explained my side and finally told her why and how it wasn’t intentional, that I don’t want to be like this. \n\nShe then accuses me of being a bad friend, being one-sided, and how she doesn’t care about me anymore. It really hurt me a lot. I’ve gone through thick and thin with her and though my actions might have hurt her, it was never intentional. I just wished she tried to understand where I was coming from of all people. \n\nI just wish that she didn’t assume the worst of me from one mistake when I’ve spent a lot of time giving her the best of me.\n\nAITA in all of this? She still ignores me and I just want to communicate. I know she had been through a lot during my absence but I want to show effort since I have the capacity to now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -1,
      "content": "NTA\n\nSounds like your friend is the one with the problem. She wants you around when she needs something, but when you have needs your criticized for them. Seems like you don't need friends like that.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    }
  ]
}