{
  "post content": "I think everyone sucks except for my cousin, but I'll leave that to you beautiful people.\n\nI (28f) am married to a Green Beret (29m; yes, he’s fine with being called a Green Beret). He’s deployed rather often. I’m used to it, but it sucks sometimes, and I miss him when he’s gone. Anyway, I have a very large family who considers family events, particularly weddings, bridal showers, and baby showers, *very* important. Several months ago, while my partner was deployed, my cousin (24f) announced her engagement. Me, my sister, several of our other cousins, and a few of her friends were chosen as bridesmaids, since she doesn’t have any sisters. Of course, we were all excited and volunteered to help with the planning. We helped pick the flowers, the invitations, our dresses, and hers. Then, about four weeks before the wedding, I found out my partner would be coming home from \\[REDACTED\\] on the wedding date. While the wedding was important to me, I love my partner more than anything and want to be there to meet him at the airport. So I called my cousin and told her that I was sorry, but I wouldn’t be able to make it. She was actually really calm about it and asked why. I told her my partner was coming home, and she said that was okay. Alright, cool. I assumed everything would be fine. Unfortunately, I assumed too soon. I was suddenly bombarded with texts and calls from the rest of the family saying I was a complete asshole and how dare I miss the wedding. My aunt (cousin’s mom) was by far the angriest. I told her why I was missing the wedding, and she said my partner would be deployed a thousand more times, but my cousin would only get married once. I said I was sorry, but my cousin said it was okay and that my husband was very important to me. My aunt called me a selfish jackass and said that some “killing machine prick” was not more important than the wedding. I told her she had no right to call my partner that. She said, “But it’s true. Now quit bitching about Rambo and come to the goddamn wedding.” I called her a bitch and hung up. I haven’t spoken with my family since, except for my cousin and her fiancé apologizing for everyone else's behavior and saying it's fine if I can't go.\n\nSo...AITA?\n\n**EDIT: Ladies and gentlemen (and people who don't identify as either), we have an update.** [**https://www.reddit.com/user/RandomThrowaway3435/comments/mz8i49/update\\_aita\\_for\\_skipping\\_a\\_family\\_wedding\\_after/**](https://www.reddit.com/user/RandomThrowaway3435/comments/mz8i49/update_aita_for_skipping_a_family_wedding_after/)",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I think I'm TA for skipping the wedding and blowing up at my aunt.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH (except cousin)\n\nI'm all for supporting your partner, but presumably he'd understand if you had a wedding commitment that day. If he were deploying and heading out, then I could see your point -- but he's coming home for some period of time, so couldn't you just wait to see him? It seems fairly selfish of you to forego the wedding entirely after initially committing. \n\nObviously the aunt's comments are preposterous and inexcusable.",
      "id": 3,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "This is easy. YTA. You made a commitment and backed out at the last minute. Period.",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "NTA. Holy crap, I can’t believe the Y T A and E S H responses here. Go enjoy your husband being home and hopefully your cousin gets on her family about their behavior.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Repost to remove banned language:  \nNTA. You have a very good reason for backing out, and it’s great that your cousin is so understanding about it. She is definitely not an A H. Having one less bridesmaid, or choosing someone else to do it, won’t change her wedding one bit. The family members giving you a hard time about this are totally out of line. It’s not their wedding, and the bride is the only one you have to answer to for your decision not to come. Your aunt is absolutely ridiculous for saying what she said, and I wouldn’t blame you if you never spoke to her again. She is totally out of line.\n\nPeople make wayyyy too much of weddings, to the point that it seems insane to me. That includes some people in these comments. It’s a wedding, not the end of the world. Obviously your cousin understands it is not some tragedy or a betrayal of your family bond or whatever if you can’t be there. The craziness about weddings as some inviolable “special day” that the whole world should revolve around really needs to stop.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "You can’t see your partner and attend the wedding?",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "Unfortunately, the wedding is a destination wedding, so it's unlikely.",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH \n\nYour family sucks more for being so rude and aggressive. However, you weren't just a wedding guest, you were in the wedding party. Canceling that close to the wedding is an asshole move.",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "But she told the bride/groom. And even from the last line, it seems like they think people are out of line. \n\nIf any of these arguments were with the bride - I’d go with a straight up ESH on both sides. But the bride/groom are being gracious about OP not getting much time with her husband (not to mention the dangers of his job)\n\nAnd frankly - Aunt is bang out of line for calling someone a “machine killing pr!ck”. I wouldn’t have even said another word at that point. I’d have hung up and basically be done with aunt until she apologized a LOT.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Hard disagree. How was she supposed to know her husband would be returning home the day of the wedding?",
          "id": 11,
          "comments": [
            {
              "score": 1,
              "content": "She doesn’t have to cancel everything the day he comes back. This doesn’t feel like a completely out of her control situation but a choice she is making.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "[removed]",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
          "id": 14,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. You didn’t know and his homecoming is far more important, especially since he is special forces. He needs your support when he gets home. He’ll need you. My dad was in the Air Force for 26 years and was part of a squadron where he’d have to leave at a day or so’s notice and be gone for who knows how long. I’d have chosen to see my dad coming home over being in a wedding.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Not that A. Special forces members have horrible life expectancies. This isn't a typical military deployment. Special forces can be out for a long period of time and are more often than not in the worst areas. I'm sorry for your family. The fact that your family can't realize how easily you can have receive the worst has occured show up at your door any time he goes out. Worse still having to be in operations where you can't even know where he's at. Stay strong and welcome that man how you want. Thanks to you and your partner for your service.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    }
  ]
}