{
  "post content": "So I (34f) gave birth on Christmas Day before my sons birth and to lessen visits. We (my husband 28m) made a list in October and sent it out to everyone \n\nSome rules include \n-up to date on ALL vaccines \n-if you feel anyway sick don’t visit \n- let us know a week before hand so we can arrange a day/time\n- no smokers \n- no phone calls or visits between 7:30pm-10pm \n-you can only stay an hour \n-no picking up the baby without consent \n-no Adivce \n-no perfume/deodorant \n- no is no we won’t explain why \n- no pictures to be taken or posted on social media \n- if you visit the first time you will be expected to give mom (me) a gift card and a gift for baby from out approved list\n- before you ever come no matter how many times you will be give a list of a ether food or groceries to bring with you AND a chore for a list of your choosing \n- no more than two visits a week per person \n\nIt’s help to keep the visits to minimum and no one can complain about favouritism because everyone is treated equally. \nWhich brings me onto my current situation my sister in law(20f)  studies in a different part of the country and is rarely home asked to visit last week before she had to go back to school, so We set up a date with link to our gift list than sent her the takeout we’d like including the chores she can choose from \n\nSent immediately texted back saying she’s broke and can she do extra chores instead,\nMe and my husband talked about it and came to the decision that if we bent the rules for one person everyone would want the same treatment \n\nWe told her no that we were very clear about our rules and maybe next time she could visit. She begged even said would clean the whole house because it would be June before she’s would be home again and we simply texted no. She didn’t reply \n\nShe left this morning and we got multiple texts for my in laws belittling us for using our child as a cash grab, my husband simply replied it was our rules and no one deserves special treatment than told his family they were on a time out and blocked them\n\nSince than my family and our friends have told us we were wrong because she is a broke collage student and they would have understood if we looked the other way once. We have tried reaching out to his sister but she won’t reply",
  "id": 1,
  "comments": [
    {
      "score": 64860,
      "content": "YTA. Your rules went from 0 to 60. Like smoking and vaccines, yeah. But gift cards and chores? The entitlement is strong with this one.",
      "id": 2,
      "comments": [
        {
          "score": 20859,
          "content": "Exactly! Like fair enough for safety but the rest? It’s just money grabbing!",
          "id": 3,
          "comments": [
            {
              "score": 17458,
              "content": "I've never even had a kid I wanted to see that badly.",
              "id": 4,
              "comments": [
                {
                  "score": 17957,
                  "content": "OP's poor sister. She was willing to do extra labor she shouldn't have to just to see her nibling, and was denied because she didn't give their entitled Mommy a fucking gift card.. Yikes.\n\nIf it were me, I wouldn't even visit them again unless Mommy apologizes for being an entitled\nbaby-user.\n\nOP, YT massive A.\n\n1. You're using your baby as a cash grab. Gifts - for the baby and *especially* the mother - are something guests should bring as they want and on their own terms. Not as a mandate.\n\n2. She's in college. She's broke. She's willing to do extra labor to see her nibling. What more do you want? **You don't want to maintain the rules, you want money.** And your house cleaned.\n\n3. If you keep this up, your child will have no family. Being too tired for visitors and being a gaping AH are two different things. You're being the latter.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7575,
                      "content": "The best part? They planned all this out back in October. So they intended all along to extort everything they could from their friends and loved ones.\n\nA M A Z I N G",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4946,
                      "content": "Those aren't gifts. They've made their baby a Pay-per-view event.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 768,
                      "content": "Seriously though...at this rate if this kid gets any first birthday gifts from the non immediate family I imagine they're all going to be sent by mail.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "And that poor child. They'll probably have them paying rent by the age of 12.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Also OPs poor baby. Not being given the opportunity to bond with their aunt because she's poor.  Never has saying \"the audacity\" felt so right to me.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "It's not even really a gift. It's the charge for admission - like paying for concert tickets. Ridiculous enough before adding in chores plus a grocery list. Honestly, if I was to visit a friend / family member with a newborn, I'd probably bring something anyway. Maybe a gift for mum and dad more than the baby, some food for the freezer, and would also likely help out with something around the house. I know it can be tough for new parents. However, being TOLD to do all this would make me not visit at all. I don't care who it is. Nope nope nope.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "The best part is he put his parents on “time out” like what? Lol what’s wrong with these people???",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "They wanted cash and takeout and chores! WTAF!! Poor aunt won't see the baby til he's 6 months old. I remember how excited I was to meet each of my sibs babies. They sucked the fun right out of that. If I were the families I would block them.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "She’s freaking broke. She’s not violating any of the safety rules! \nI live with my sister who just had a baby 1.5 weeks ago. She would KILL for someone to clean her whole house willingly.\n\nMost people offer to bring food and bring a gift BECAUSE THEY WANT TO",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1973,
                  "content": "I wouldn’t even want to see my own kid that badly lol.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 320,
                      "content": "Your honesty is inspiring. You’re fun!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "I could definitely reverse uno this. I would do most of the things on this list for someone if they’d take my kids for like, 3 hours.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1327,
                  "content": "I feel like this is made up . I would not want to see anyones baby if they present me with that list .. infact it will be the last interaction between us . Just to wild to be real for me",
                  "id": 18,
                  "comments": [
                    {
                      "score": 439,
                      "content": "Naw. I know one little fucker that would have done this had she been smart enough to think of it.\n\nLuckily she's dumb as a post.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I do too. Too over the top and doesn’t sound right. \n\nWhat is that phrase for it on Reddit ? Rage bait ?",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 435,
                  "content": "I MADE six and I'm dumbfounded. I didn't even expect (nor miss) a baby shower and this one wants people to bring food and gift cards just to see the kid? \nI would never meet the lil sprout.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 24,
                      "content": "youre just pissed bc you realize you let friends and family visit for free SIX times.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "And clean her house. I wonder if her massive balls were a hindrance during delivery.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 213,
                  "content": "I wouldn't want to see my own kid that badly.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Right? I'm more surprised that someone wants to visit them after being told they have to pay tribute.\n\nYT massive A, OP.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "The kid was born on Christmas day. I think you're missing the signs that this is a VERY special child.\n\nNo smokers? Makes sense, it's a barn, there's straw everywhere, that's a fire hazard.\n\nNo perfume? OP's not stupid. Last time this happened someone turned up with myrrh as a gift, and she does NOT want your stinky resin. It's an Amazon gift card or nothing. Get lost with your myrrh.\n\nThe baby needs an actual list of proper, appropriate gifts. OP does NOT need a bunch of shepherds turning up and giving her a lamb. Or some snotty kid with a drum offering to serenade the baby. Nobody with a newborn needs that sort of nonsense.\n\nAnd making guests bring a load of food makes sense. These are clearly people who have no luck in getting reservations at any of the local inns/eateries.\n\nI'm going to be honest, I find this whole thing to be completely unbelievable. There can't really be people this entitled and this removed from reality, with family/friends that are willing to enable them. Can there? \n\nI just hope OP and her husband snap out of this mindset and get over themselves. Otherwise the poor kid is going to grow up thinking he's God's gift.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "I'm assuming the baby is something out of a freak show, that's why they're selling tickets",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I know, right? I want to be supportive of the new parents in my life but frankly If I had it my way I would wait until your kid is 12 or 13 and fun. If I'm coming to see your newborn it's as a courtesy and show of support for you, not because I want to hang out with a newborn. But that's just me. I'm a crabby childless middle-aged  chick.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Prertye sure OP isn't going to have many visitors. How outfreakinrageous are most of thise demands?  lmao and OP is very much TA. Feel sorry for that baby -- imagine the rules she'll set out for them growing up. yikes",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2097,
              "content": "“No more than 2 visits a week?”\n\nOP thinks people will want to visit her…. Twice? \n\nYTA.",
              "id": 30,
              "comments": [
                {
                  "score": 636,
                  "content": "No, not HER. The baby, she'll use that baby right up until it's at least 18\nI've seen some greedy people but selling visits to see a baby  WOW",
                  "id": 31,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Child will either never move out and live in the basement forever OR will move out ASAP and cut off all contact with their insane parents.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I cannot imagine caring enough about someone else's baby to put up with this nonsense. \n\nOP is clearly willing to continue using her baby to money grub, but I'd be shocked if people continued to visit. OP and her husband are likely going to find themselves completely isolated from their support system.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "She thinks they want to go there once with this nonsense!",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "They thought if they bent the rules for one person, other people would want the same. \n\nNo OP, no one wants to do chores in your house. \n\nOp is the AH of the week.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "I've seen the idea of requiring help with chores or a meal as a ticket to see baby in pregnancy related subs as an idea to handle visitors who expect to be hosted by new parents. And it just seemed sad to me that people have to demand assistance from friends and family to get help. If your MIL or whoever is going to expect a three course meal and a spotless house when she visits then just don't let her visit. OP is totally unreasonable though.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3504,
          "content": "[deleted]",
          "id": 37,
          "comments": [
            {
              "score": 1483,
              "content": "Thanks for the Myrrh, where’s my Amazon gift card, Melchior???? You’d better get to mucking the stable! That drummer boy is working on reshingling the roof. \n\nAnd the angel has tried to visit three times this week. Banished!!!!",
              "id": 38,
              "comments": [
                {
                  "score": 449,
                  "content": "Away in a manger \n\nThat's made out of gold\n\nHot damn, little Jesus, \n\nYour mom's pretty bold\n\nDemanding the cards \n\nAnd the gifts and the chores\n\nWhy didn't your grandma \n\nTeach her social mores?",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 217,
                  "content": "I laughed so hard at this. OP is Brian's mom from Life of Brian!",
                  "id": 40,
                  "comments": [
                    {
                      "score": 43,
                      "content": "He’s not the messiah! He’s a very naughty boy!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3141,
          "content": "And that, people is how OP and co became isolated from everyone in their life. And no one will ever visit their house or see their newborn ever.\n\nPoor baby, growing isolated from family and peers due to their parents being gold diggers and entitled. YTA.\n\nEdit: thank you for the reward.",
          "id": 42,
          "comments": [
            {
              "score": 1414,
              "content": "OP will inevitably post a screed on social media about \"how you find out who your real friends and family are when you have a baby.\"",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 511,
              "content": "Fast forward 18 years, and I’m sure the child will be joining the rest of the family in that NC thing.",
              "id": 44,
              "comments": [
                {
                  "score": 34,
                  "content": "Fast forward 18 years and I'm sure we're going to read a post on RBN from OP's kid",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "I don't think the kid will wait that long.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 46,
              "content": "Next thing you know she'll be posting on justnomil about how terrible her husbands family is, and how none of them want anything to do with her or the baby. \"He put his family in a time put\"...for what? Calling out the entitled bs of you and your husband? Good lord...",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I'll bet the list OP had for her bachelorette party/wedding was a hoot. From bridezilla to momzilla.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2011,
          "content": "Lol right, the takeout they’d like? They expected a broke college student to bring a gift, gift card, and take out. Have they never heard of a delivery app? Also, her offer to do extra chores was completely reasonable. They are using their baby as a cash/chore/gift/food grab.",
          "id": 49,
          "comments": [
            {
              "score": 1446,
              "content": "I don't think her offer to do extra chores was reasonable, only for the fact that I think it's entirely unreasonable for any of the family to entertain this to begin with. Now I just really want the family's perspective on things, especially how they were before all this because I doubt this is the only outrageously entitled thing they've done.",
              "id": 50,
              "comments": [
                {
                  "score": 595,
                  "content": "I bet she was a bridezilla of the highest order.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 234,
                      "content": "MechaBridezilla",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "Let's not forget OP's husband, who sided with his wife on not letting his sister meet his baby. Can you imagine a wedding with both a bridezilla and a groomzilla?\n\nThis is totally unrelated, but for some reason, I get the feeling that OP and her husband are involved in at least a couple MLMs.",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "If you want the privilege of attending my wedding, you need to bring an envelope with cash, a present on the day (from an approved list of things minimum retail price $500) and sacrifice a prize bull. \n\nNo exceptions, we can’t go giving anyone special treatment.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "AND DO CHORES!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I love the husband's response of\n\n>no one deserves special treatment\n\nExcept themselves!  Gotta pay the toll to see the kid.  What a joke.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1159,
          "content": "And no deodorant?!\n\nHow long is this going to last?!",
          "id": 57,
          "comments": [
            {
              "score": 871,
              "content": "Oh god I missed the deodorant part.\n\nDon't get me wrong, but I'm pretty sure people who are sensitive to chemicals in scents are usually okay with most deodorant *other people* are wearing?! Like, I don't wear certain perfume or light candles around my best friend because it'll light her up with hives and asthma, depending, but in 13 years she has never complained about *deodorant*.\n\nETA: deodorant that goes only in the armpits\n\nETA2: I understand people can have bad sensory or allergic reactions to deodorants, but in the context of \"keeping the baby safe\" it doesn't make a lot of sense to ban it, especially if there's no family history and people aren't gonna be sweaty or otherwise rubbing bubs in their armpits.",
              "id": 58,
              "comments": [
                {
                  "score": 306,
                  "content": "Eh. My brother is sensitive enough to smells that strong deodorants do bother him, but he doesn't *complain* about it or try to make others stop wearing it. Mostly because strong BO sets him off worse.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 257,
                      "content": "Yeah I'm just like, baffled about this in terms of a baby. Perfume is worn on the wrists/neck, so if you're worried about contact or airborne allergy, that makes sense, since people tend to cuddle babies into their neck, etc.\n\nBut uh, what normal person is cuddling a baby into their bare armpit, and what responsible parent is letting them do that?!\n\nMost hospitals and other places that have rules about scented products do not extend them to deodorant in my experience either.\n\nETA: deodorant that goes solely in the armpits",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I have a new rule for coming to visit my 600-week old: you MUST wear deodorant.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1056,
          "content": "Don't forget the groceries - the guest had to bring a gift card for mum, a pre-approved gift for bub, buy groceries from their list and do a chore.",
          "id": 62,
          "comments": [
            {
              "score": 1003,
              "content": "This entire post and OP’s entitled existence belong over on r/trashy",
              "id": 63,
              "comments": [
                {
                  "score": 574,
                  "content": "And when OP's child grows up, they will be posting on r/raisedbynarcissists",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 233,
                  "content": "As well as r/AmITheDevil as well as r/iamatotalpieceofshit r/iamanutterpieceofshit and plenty more!",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "And limit the visit to 1hr - probably times to coincide with the \"chores\" they have picked out.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 899,
          "content": "“Sorry you’re too poor to meet my child!!!” SMH",
          "id": 67,
          "comments": [
            {
              "score": 39,
              "content": "Here is something that is always true: anyone who rigidly maintains that sticking to an arbitrary set of rules and making no exceptions even when the rules are clearly hurting people is always an really awful person.\n\nI feel SO sorry for this poor baby. Imagine growing up like this. Nightmarish.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 702,
          "content": "The hell? Gift item and food? You had a baby, you can’t cook for yourself? I mean I understand friends VOLUNTEERING to bring a meal, but to demand food, gifts and a chore? Try having a toddler and a newborn, working full time. You both sound insufferable.",
          "id": 69,
          "comments": [
            {
              "score": 313,
              "content": "My sister had her third in December and still has a  deep freezer full of casseroles and dinners we all brought for her. I send DoorDash once a week or so, because everyone needs Chipotle now and then.\n\nShe sure as hell thanks all of us repeatedly because it’s appreciated and wasn’t expected, certainly not demanded.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "This. My best friend had a baby 2 years ago and were so thrilled we could, we bought groceries, beer for her husband (rip to drinking while breastfeeding), a gift for the baby, and a 100 gift card bc we wanted help. Expecting all of it? Hell fucking no. But my best friend isn't a money grabbing asshole so idk.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I’d be mortified asking for stuff. We made meals ahead and froze them when I had our kid. We def didn’t make anyone clean our house lol",
              "id": 72,
              "comments": [
                {
                  "score": 13,
                  "content": "Some people in my bumper group did that. I was like lol I bet it will be fine. \n\nIt wasn’t fine. We get take out everyday now.",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "When I had my son we didn't ask for much except certain vaccines (pre covid) and no smoking. If you did smoke jsut change your shirt. My MIL and a lady we worked with brought us home cooked meals we could reheat out of the kindness of their hearts. OP is fucking insane. This poor child is in for the ride of his/her life.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 419,
          "content": "Rule 1: wash your hands before touching baby.\n\nRule 2: make sure you support her head when you hold her.\n\nRule 3: each visitor is asked to consider making a contribution to baby's college fund.\n\nRule 4: if the previous visitor has given a contribution, you MUST exceed it or no baby for you!\n\nRule 5: bring me caviar and a Maserati!\n\nRule 6: BRING ME JOHN THE BAPTIST'S HEAD ON A SOLID GOLD PLATTER AND BOW DOWN BEFORE MY GLORIOUSNESS, YOU PEONS!",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 337,
          "content": "I was thinking maybe they set the rules because then no one would want to visit? Because who really wants to be shaken down to visit a newborn.",
          "id": 76,
          "comments": [
            {
              "score": 257,
              "content": "I think it's pretty clear they're trying to limit visits in a cowardly, money-grabbing way, instead of growing some spines. I don't think they realize they're hurting their kid down the line if the son has no relationship with any relatives because it's too much work to deal with his parents.\n\nETA: [I was right](https://www.reddit.com/r/AmItheAsshole/comments/sedejn/aita_for_refusing_to_bend_the_rules_on_seeing_my/huimrvr?utm_medium=android_app&utm_source=share&context=3)",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 26839,
      "content": "YTA. That \"list\" of yours is *ridiculous*. Anyone who wants to see the baby must bow at your feet, bring tribute, and go to work for you? Wtf?",
      "id": 78,
      "comments": [
        {
          "score": 9433,
          "content": "Does she realize that even those that visited Jesus didn't have to do that much.  They did bring gifts, but I don't recall anywhere in the bible where mucking out the manger was part of the deal to visit the savior of Christianity.",
          "id": 79,
          "comments": [
            {
              "score": 2203,
              "content": "Yeah but they brought gold and perfume. That’s some quality shit. I’m sure Mary was happy to waive the chores for those dudes.",
              "id": 80,
              "comments": [
                {
                  "score": 1122,
                  "content": "That kid with the drums, though… No, we do not accept music in lieu of material goods.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 456,
                      "content": "Damn right. Mary probably didn’t want some drummer waking up her baby. Messiah or not, nap time is precious.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Then someone has some shit taste. Because I want tasty jams over heavy-ass chests of myrrh and frankincense. Leave the gold with the bouncer, though.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 509,
                  "content": "They wouldn't have been able to visit OPs baby with that perfume",
                  "id": 84,
                  "comments": [
                    {
                      "score": 302,
                      "content": "“Go back to the Orient, Melchior! You and your goddamn myrrh! And you, Gaspar, take your ass and your rank frankincense with you! Balthazar, you can leave the gold, but unless you’re going to wash the donkey, you need to leave. And don’t even get me started on these shepherds and the heavenly host keeping me awake at all hours with their hymns of rejoicing!”",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Gotta cover up the stable smell somehow.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "I’m sorry, but rules are rules.  Today you’re making an exception for some wise men with frankincense - tomorrow it’s some dumbass with the wrong kind of artisan bread.  It’s a slippery slope.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "This reminds me of the meme of Mary like \"thanks for the perfume and incense, things all babies love... and especially the boy that played the drum right in my face\"",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "But if we bend the rules for one person, we'll have to do the same for everyone!\n\niT's OnLy fAiR!",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "But OP specifically said no perfume. Gifts good enough for Jesus are still not up to OP's standard...",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "Drum solo worked for Jesus. Pa ra pa pa dum…..",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "They also DID NOT HAVE TO, they wanted to do it. The virgin mary did not post a list at the entrance to the stable reading: give mommy gold or incense, and clean out the stables, otherwise, you don't get to see the savior.   \nYTA",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "But they turned up unannounced *and* didn't bring a curry. Mary told them no, and that rules are rules. But that doesn't read as well so they changed it for the book.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 593,
          "content": "Yeah YTA for the list alone OP. \n\nBeing an AH to your SIL is just the cherry on top of your asshole sundae.",
          "id": 94,
          "comments": [
            {
              "score": 90,
              "content": "AH of the year and it's only January.",
              "id": 95,
              "comments": [
                {
                  "score": 19,
                  "content": "I am sceptical that anyone will top this in the next eleven months.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 343,
          "content": "Does anyone care about their baby enough to visit? I hope not.",
          "id": 97,
          "comments": [
            {
              "score": 57,
              "content": "Yea, I’d be like, see you at the family BBQ next summer!",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Probably making bank off the grandparents",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "I totally get asking a family guest or close friend to pitch in on a quick chore or two when you're a parent with a newborn. You're barely sleeping, every waking moment is about the baby, and the place falls into a mess. For this reason if I go to visit a new parent friend I'll usually offer to wash the few dishes in the sink, or make lunch for everyone, or take out the garbage bags that have been sitting by the front door since yesterday. I had people do the same for me when my kids were born, its a lovely way to show support and to feel supported.\n\nBut a *chore list* for every visitor?? Are you absolutely out of your mind?? You need to understand that, while its technically customary in most cultures to offer help to new parents around the house, your house is still *your* responsibility, and if friends and family choose to help you out in this way you should damn well be *grateful*, because not everyone is so lucky. To think you get to sit here and make demands like this of your family and friends is disgusting when there are countless parents across the world doing it all themselves every single day. Be thankful you aren't in their position.\n\nThe same goes for the gifts. Again, typically gifts for a newborn are customary in a lot of places, but to *demand* one as a prerequisite to visits?? And for yourself too?? Once again, be thankful you get anything at all. Something tells me that, if your family is happy to stand for this and bow to these ridiculous demands, they're probably pretty used to being held hostage to this high maintenance, transactional attitude of yours. \"Oh you wanna see my baby? That'll be 2 brand name onesies, the most expensive diapers, a $30 starbucks gift card for mum and 3 hours of your time and labour please.\"\n\nThe entitlement on you is gross. If i was related to you i wouldn't put up with you. YTA OP.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "She might as well have said that visitors may only leave rooms walking backwards away from her after providing a curtsy/bow",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "She already suffers from golden vayjay symptom —- meaning I gave birth worship me. I had friends like that - we didn’t stay friends",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "This *has* to be fake, right? Please, please let it be fake.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I went from ok, ok, reasonable, a bit tactless but still ok, excuse me what the fuck?\n\nThe sense of entitlement on this one. People actually entertain that crap?",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "I was like “vaccinated, makes sense. No late visitors, makes sense. REQUIRES A GIFT FOR BOTH MUM AND BABY?????”",
          "id": 105,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15758,
      "content": "YTA. \n\nAnd yes, you are using your child as a cash grab. NO ONE is obligated to buy you gifts or takeout. Or groceries. It seems like your friends and family are realizing that you don't want them to actually bond with the baby or visit because they are family. You just want things. Oh and your house cleaned.",
      "id": 106,
      "comments": [
        {
          "score": 4263,
          "content": "The fact that SIL was willing to submit to those rules if only she could afford it, like she was willing to ignore the insanity of those rules and offer to clean their entire house because she wanted to see the baby so badly. The heartlessness of OP and husband to say no to that because that means other people wouldn't spend $80 on a visit. Gosh.\n\nEdit: a broke college student, nonetheless. Only probably 18-24 years old.",
          "id": 107,
          "comments": [
            {
              "score": 948,
              "content": "While I would say that nobody is entitled to visit anybody elses babies... Yeah the motivation behind denying her is so gross. They really were just worried other people might not bring them gifts. Like??! What? You tell them they can do extra chores too then?! As if it's impossible to be consistent and considerate at the same time.",
              "id": 108,
              "comments": [
                {
                  "score": 275,
                  "content": "Yeah, when I read the title, I thought it would be like, SIL was refusing to vax or mask or something, but shit.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 945,
              "content": "I feel like a lot of people are also overlooking the fact that OP said her husband put his own family in a \"time-out\". 🙃",
              "id": 110,
              "comments": [
                {
                  "score": 139,
                  "content": ">her husband put his own family in a \"time-out\".\n\nThat time-out will likely go both ways and they shouldn't be surprised if family blocks them back. \n\nJust wait until something goes south or they have an emergency and they need their friend's and family's help. Oh sorry.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Sorry I can't help you unless you give me a gift card, do my chores and buy my groceries.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "The AUDACITY of this couple!",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Let's be honest, the family is probably relieved",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 304,
              "content": "Man... I would have loved a visit from any family members, any food brought, anything offered. And if someone had offered to do some chores or laundry I would have wept and thanked them. Hold the baby while I take a shower? Cool thanks here you go I'm running to the bathroom now. \n\nI cannot even fathom this level of entitlement it just doesn't compute.",
              "id": 115,
              "comments": [
                {
                  "score": 34,
                  "content": "I know right? In fact if my family came over to see me and my baby I’d be offering THEM snacks and drinks as guests in my home.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Well, and the chores could be a deal breaker for some people. Both of my parents are handicapped. They can do chores but it is very difficult and physically painful for them. How far can someone expect to take this? If she denies her SIL a visit because she is broke, maybe she doesn't care about physical limitations, either. I hope to GOD she's trolling.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I also love that they think everyone is keeping tabs in this. “Well suzy didn’t get you a gift card!!” Screams center of the universe delusion.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "In a few months/A few years they're going to want a date night or some help with baby. \n\nI only hope the family bide their time to send a list of demands for their services in return.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 332,
          "content": "They've got balls I'll give them that. This list is seriously audacious even if I had wanted to see the baby I would refuse to go because of this",
          "id": 120,
          "comments": [
            {
              "score": 22,
              "content": "I have never, in my life wanted to visit a baby this bad. Who are these people following these rules? I’d nope out of that so fast.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Agreed, if this is real and that's a family member of mine...... It's pretty safe to say I'm probably never meeting that baby.",
              "id": 122,
              "comments": [
                {
                  "score": 17,
                  "content": "Or put some money aside to help him pay for therapy when he's older.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "She acts like the baby somehow becomes partially their responsibility because they walked into her home. If I step into a doctor's office, am I suddenly responsible for doing some of their paperwork? \n\nYou had kids on your own volition, OP. If you couldn't handle the extra work and expenses, that's your own problem. If someone extends help that's great, but they have no obligation.",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11734,
      "content": "YTA what kind of greedy people are you guys? I thought you were going to say that you weren’t making exceptions on visits before the baby is healthy enough or something. You’re charging people to see your baby? That’s so weird.",
      "id": 125,
      "comments": [
        {
          "score": 4931,
          "content": "Lol “no one deserves special treatment” says couple demanding that family and friends bring gifts for mother and baby, buy their groceries/takeout and clean their house as a requirement to visit",
          "id": 126,
          "comments": [
            {
              "score": 49,
              "content": "Right?! And I DOUBT that OP and her husband ever did anything like this for other family members when they had babies. “No one deserves special treatment”… except for them? LMAO.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "And don't forget, they only get 1 hour. So they have to fit their chores in, and maybe see the baby around that if they have time.",
              "id": 128,
              "comments": [
                {
                  "score": 12,
                  "content": "I didn’t even think of that. Definitely makes the situation worse",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I was on board until the GIFT CARD, FOOD, AND CHORES REQUIREMENTS??? WHAT IN THE FUCK? Wtf is wrong with you guys? You're using your family wanting to see your baby as a cash grab. This is so gross. And it's not even really bending the rules because your poor (literally poor) SIL is broke and offered to clean the entire house. That isn't good enough for you?? Yall are nasty. Unbelievable. Wtf. YTA OP",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Some people actually type all this shit up and still *truly* think they're not the assholes. It kind of blows my mind.",
          "id": 131,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10167,
      "content": "YTA. What special tricks does your baby perform to warrant an admission fee? This is literally a cash grab and you should be ashamed of yourselves.",
      "id": 132,
      "comments": [
        {
          "score": 1121,
          "content": "Maybe he poops gold and burps rainbows...\n\n\nThat... I would pay to see lol",
          "id": 133,
          "comments": [
            {
              "score": 111,
              "content": "Or he cries diamond tears. Still not worth it IMO.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "I might know some grownups who can do that… lol",
              "id": 135,
              "comments": [
                {
                  "score": 40,
                  "content": "Goldschlager and a family size pack of skittles.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "The poop is golden if they're breastfed. You can come change my baby if you want to see it. It smells like ass butter.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Or it's the bearded baby in this three ring circus with a clown of a mother...",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Tywin Lannister, is that you?",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 390,
          "content": "I'm trying to remember the word for what the parents are doing.......oh yeah, pimping!",
          "id": 140,
          "comments": [
            {
              "score": 66,
              "content": "Omg, they are baby pimps. Sounds so wrong.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 234,
          "content": "I know right. It's a baby, not a tourist attraction",
          "id": 142,
          "comments": [
            {
              "score": 22,
              "content": "reminds me of the time when Bangladeshis broke the lockdown to visit the newborn  baby cow, apparently the tiniest in the world.",
              "id": 143,
              "comments": [
                {
                  "score": 15,
                  "content": "I would pay to see that, did they give her a little sweater you think?",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "lol I’d have to just see that baby at thanksgiving!",
          "id": 145,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 64,
          "content": "Apparently he's Jesus Christ, born on December 25th!",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "This screams golden child in the future. I hope they don't have another kid.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "You have to pay an entrance fee for a zoo or circus, but you dont have to clean there.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "This. OR… Baby must be enchanted after coming out of the cave of wonders.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6556,
      "content": "Yta. You just ruined your relationship. Your list was reasonable until these.\n\n> if you visit the first time you will be expected to give mom (me) a gift card and a gift for baby from out approved list - before you ever come no matter how many times you will be give a list of a ether food or groceries to bring with you AND a chore for a list of your choosing\n\nThat is a cash grab and you both know it. I would avoid you until the baby was an adult at this point. Paying to see a baby is not a good relationship.",
      "id": 150,
      "comments": [
        {
          "score": 1716,
          "content": "Maybe the OP should charge per hour to see the baby. Or per minute!\n\nAnd \"Visitors must perform a dance of their own invention\" would give the rather boring list a bit more zing.",
          "id": 151,
          "comments": [
            {
              "score": 312,
              "content": "I find that more reasonable than giving them a gift card, baby gift, groceries, and chores all at the same time. At least they have some say over the amount of money then.",
              "id": 152,
              "comments": [
                {
                  "score": 319,
                  "content": "\"We are coming round but can only afford to stay for 8 minutes\" lol",
                  "id": 153,
                  "comments": [
                    {
                      "score": 124,
                      "content": "Exactly. Nice and affordable. Although they might charge 50 dollars every half hour though. I'd prefer to spend that on a tattoo. I'd get more satisfaction out of it. Even a bad one.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "\"How much to look at the baby through the window?\"",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Double or triple rate for any minute spent actually touching the baby.",
              "id": 156,
              "comments": [
                {
                  "score": 44,
                  "content": "Finally, someone who understands! Lol. Should be triple tbh. Double for looking at baby",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 219,
          "content": "Nah. She had me at no deodorant and then it quickly spiraled from there. \n\nPerfume, totally makes sense. Deodorant? No.",
          "id": 158,
          "comments": [
            {
              "score": 43,
              "content": "I mean... in my mind i was imagining deodorant in the same vain as cologne, but the fact she mentioned cologne as well, yeah, agreed.\n\nI dont need babies first memory of me being my nasty ass BO lmao\n\nMy pits get stanky dude",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "do you think they will check for deodorant? as in sniffing armpits of the grandfathers?",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "It’s a really dumb arrangement. \n\nI used to bring my niece a gift every single time I saw her. \n\nI noticed when she was about 3 that she “expected” that gift and was behaving like she knew she would get something then she could be moody or whatever she wanted AFTER she grabbed the gift. \n\nI looked at my brother. He handed back my gift. I drove off. My niece kinda of snorted and stomped off (she’s stubborn) and I broke this expectation\n\nShe is now 12 and we have an awesome relationship. We talk all the time. She asks for stuff and gets yes and nos. She doesn’t expect things from me, even though I spoil her she also has rules. We talk about everything. \n\nBecause I, and her father, taught her she wasn’t entitled. And I could see I was teaching to her to be. My fault entirely. \n\nThese people have looney rules creating a future of entitlement",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I honestly thought the no deodorant was unreasonable. Like what if they visited mid day, OP and husband really expects people to not wear deodorant for a whole day? Absurd. But yeah the part you quoted and down is absolutely ridiculous",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I might give them a gift card for therapy. For the baby because no way that child won't eventually need it",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "> I would avoid you until the baby was an adult at this point.\n\nKid in ten years: \"Mom, how come I've never met my grandparents?\"",
          "id": 164,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "I'm petty. I'd buy the gift card labled $25 or whatever put $1 on it and give it to her. Here. You wanted a gift card. And malicious compliance would cover the chores lol, there's plenty of ways to mess up chores.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5147,
      "content": "OMG the mandatory gifts and chores! Lmfao",
      "id": 166,
      "comments": [
        {
          "score": 1658,
          "content": "This post just can’t be real. There can’t actually be people in the world who think this is normal behavior? “You have to pay me AND do my chores to see my baby” WHAT LMAO poor baby to have to grow up in a family dynamic like this if there even is a baby bc I’m convinced there is no way this can be real.",
          "id": 167,
          "comments": [
            {
              "score": 336,
              "content": "Right?!! This has to be a prank, I cannot for the life of me believe that this is true!",
              "id": 168,
              "comments": [
                {
                  "score": 27,
                  "content": "I’m not surprised at all. You must have missed when this couple made the news….\n\nhttps://www.boredpanda.com/entitled-couple-expecting-first-baby-wants-free-meals-housework-from-neighbors/?utm_source=google&utm_medium=organic&utm_campaign=organic",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "And THEN they post the situation on reddit. Did they honestly think they'd be vindicated??? The fuuuuuuuuuck",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "And bring food from a selected list.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Bring food, no perfume, bring gift card and Do Chores BUT dont you dare to Pick up the baby!!!!! \n\nThis has to be fake",
              "id": 172,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "I have met these type of people.  Birth is such a big and important thing for them, that they think it's just as big and important to everyone else.  Often the return to reality, but sometimes they don't.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Imagine when the kid gets to school, \n\n\"you want to teach my precious angel? OK but we change by the hour\". \n\n\"You want to play on the playground with my kid, OK but you mom better be paying\". \n\n\"You want my kid to come to your kid's birthday party? What's it worth to you?\"\n\nAbsolutely ridiculous, OP has managed to out entitle the usual entitled parent steriotype and that's not easy to do.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Imagine her charging her child's future friends for playdates",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Ehhh I wouldn't be so sure. I've seen these lists dozens of times in my moms groups. Not quite the \"pre-approved gifts only\" level here...but these people exist. They think they are special for giving birth and are the first ones ever!!",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 319,
          "content": "The no deodorant thing too just to top it off! My country is in Summer now, and I’d hate to be visiting people , sweaty and smell too ha",
          "id": 177,
          "comments": [
            {
              "score": 136,
              "content": "My pits stink in the middle of winter if I don’t wear deodorant lol. OP would probably complain about the smell too.",
              "id": 178,
              "comments": [
                {
                  "score": 15,
                  "content": "Username checks out lol",
                  "id": 179,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "The perfume thing I get but get the fuck out of here if someone tried to tell me I couldn’t wear deodorant just to meet their precious baby. Do you the baby want to smell my Bo? Because I promise that is way more offensive than my deodorant",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "2022 is really churning out the AHs on this sub! \n\n*grabs popcorn*",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "Don't forget about the groceries.\n\nI can't believe this is real.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "This is literally psychotic. I physically cannot bring myself to believe that this isn't fake. What kind of person charges an *entry fee* to see their baby???",
          "id": 183,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "LMAO right?!? also love that they’re concerned about having people expose baby but also want people to handle food, clean their house, and up to 2x per visits",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4853,
      "content": "[removed]",
      "id": 185,
      "comments": [
        {
          "score": 822,
          "content": "Don’t forget the groceries.",
          "id": 186,
          "comments": [
            {
              "score": 472,
              "content": "The poor woman (op sil) surely can barely afford food for herself and now is expected to pay tribute to see her family (I can't recall for the name of that family bond in English)",
              "id": 187,
              "comments": [
                {
                  "score": 51,
                  "content": "baby is the niece or nephew and the sister in law would be the aunt.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Thanks",
                      "id": 189,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Probably have to wash their feet too, and then hand knit them all fresh socks from the wool you spin from their Merino wool sheep.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 283,
          "content": "I was fully on their side.... Until we got to the must being mum and baby a gift, must do groceries and chores. \nWtf!",
          "id": 191,
          "comments": [
            {
              "score": 32,
              "content": "I got suspicious at no deodorant but maybe that's a thing with babies?",
              "id": 192,
              "comments": [
                {
                  "score": 42,
                  "content": "No perfume is sort of reasonable. But yeah I missed no deodorant. That's over the top unless they have a teen who loves to bathe in linx",
                  "id": 193,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "I’d love if my child had an aunt that wanted to spend time with him so badly she offered to clean the house… \n\nOP you’re missing the point. Your baby is entitled to a family and relationships outside of you and your husband. I’m all for health and safety rules. Gifts and chores is absolutely insane.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I didn’t even finish reading after the rule (demand) that you have to bring gifts, food/groceries, and pick a chore. There wasn’t any redemption OP could have come up with for me after seeing that. Absolutely insane.",
          "id": 195,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "SIL wasn't being reasonable, being reasonable here is \"Wtf is wrong with you, nevermind, I don't want to see your baby. Or you.\"",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": ">Your SIL was being completely reasonable. Being in college is hard and she’s not working right now so how can you expect her to buy you things?\n\nWell then she should have through ahead and popped herself out a little money spinner to change admission for like OP /s",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2874,
      "content": ">if you visit the first time you will be expected to give mom (me) a gift card and a gift for baby from out approved list  \n>  \n>before you ever come no matter how many times you will be give a list of a ether food or groceries to bring with you AND a chore for a list of your choosing\n\nYTA and using your baby as an excuse to behave like the Lord & Lady of some feudal manor. Don't be surprised if your family increasingly ditches your ~~demanded~~  demanding asses behind.\n\nLMAO the presumption.",
      "id": 198,
      "comments": [
        {
          "score": 294,
          "content": "[removed]",
          "id": 199,
          "comments": [
            {
              "score": 37,
              "content": "Also fucked up how OP is depriving her child of a relationship with their aunt. Which can be a very strong bond (at least it was for my sister and I).  \nAlso one day SIL might have her own child and I if I were her I damn well would allow everyone to come and meet and hold my baby except for the brother and OP, and rightly so.     \nThis selfishness and entitlement that op and her husband are displaying is literally destroying their child’s relationship with their wider family for no damn reason and that’s evil.      \n   \nI mean the baby’s a newborn and they’re ALREADY bad parents",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "I mean, this person clearly didn't have any taste to start with.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 114,
          "content": "They must’ve watch too much Bridgeton on Netflix…lol",
          "id": 202,
          "comments": [
            {
              "score": 42,
              "content": "Exactly, you know who should be congratulated for spawning? Salmon that swim thousands of miles, consume their bodies to grow into their final form, then change foundational ecological niches going from salt to freshwater so that they can procreate - dodging hungry fat bears all the while. Then die.\n\nOP doesn't get a prize.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Daphne would *never* behave like this.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "And no doubt the chosen list for baby gifts has nothing below $200.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2200,
      "content": "[removed]",
      "id": 206,
      "comments": [
        {
          "score": 590,
          "content": "Yes! And really... Asshole isn't a strong enough word.",
          "id": 207,
          "comments": [
            {
              "score": 248,
              "content": "Yes but it is all I can say without violating rule 1",
              "id": 208,
              "comments": [
                {
                  "score": 83,
                  "content": "I know. I was struggling to comment without writing something that would assuredly be deleted.",
                  "id": 209,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I bet they called their child something like \"Majesty Bradford Sterling III\" and you HAVE to call him by their full name.",
          "id": 210,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}