{
  "post content": "My friend moved in with me and my 3 year old a couple months ago with her 4 year old and cat. she is mostly only here when she has her kid but the days the kid is with her dad, my friend is hardly ever here, and is over at her boyfriend’s house \n\nShe does come to make sure the litter is cleaned, and the cats (because i have a cat too) are fed before she leaves, but she’s really never here. \n\nIt was an entire month of her leaving the house right after getting home from work, spending some time with the cat, then going straight to her boyfriend’s. Most nights she doesn’t even sleep here. \n\nShe was starting to leave when i asked her if she was going to her boyfriend’s. She said yes, then grabbed her keys. I stopped her and said we really needed to talk about her constantly at her boyfriend’s. She said “what is there to talk about?” I told her that I didn’t appreciate her going there almost everyday if she was going to live here and that there needs to be boundaries. \n\nMy friend said how she is there every night that she has her kid, and that she only leaves when she doesnt because that’s the only time she can see him. She stated that she would invite him here but she wants to be courteous to myself and my son, so she just goes over there and ends up staying the night so that she isn’t coming through the door very late when my son is sleeping. She asked if this was about her leaving the cat there some days, and mentioned that this was not something I told her would be an issue when establishing house rules\n\nI told her it wasn’t about the cat, it was about her never or hardly being here for days at a time, when she lives here. She said she wasn’t gonna just not see her boyfriend and didn’t understand the issue then walked away. This made me feel confused and now i’m wondering if i might be wrong? AITA?\n\nETA: she has also said that she shouldn’t have to adjust her social life just because she moved in, but i’ve told her it’s my house, i have rules and boundaries , she’s moved into it and I feel like she can move in with her boyfriend if this is really a problem",
  "id": 1,
  "comments": [
    {
      "score": 40028,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 13879,
          "content": "Exactly. Besides, as a landlord, you can only control what's in the lease. OP sounds a bit confused on the difference between a roommate and a companion. It's definitely a YTA.",
          "id": 3,
          "comments": [
            {
              "score": 7248,
              "content": "That sinking feeling when you realize that nobody else knows what you’re talking about and that you’re the weird one… YTA.",
              "id": 4,
              "comments": [
                {
                  "score": 3875,
                  "content": "Anyone else feels like she is jealous that the roommate has a partner and she does not? I had a friend once, who was super angry that I did not prioritize her over my then boyfriend, but once she got herself one, she organized her whole life around the guy.\n\nEDIT: I assumed that OP is female, but do we actually know their gender?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3840,
                      "content": "Either jealous she has a boyfriend or wants a friend who has to hang out. Having a paying roommate who is never there is the dream scenario, this is the opposite of a problem!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 216,
                      "content": "See: 50% of my friends lol\n\nI mean, I totally get prioritising your partner and wanting to spend time with them/organising around them to an extent.  It’s more when it turns into, “can x come, too?” and “I can’t because x is busy” all the time that I get annoyed.  Or they’re literally never available because of said partner.\n\nMy partner and I love our quality time together and we’re constantly on the go.  But that’s also exactly why I make an effort to hang with my other friends without him unless it’s a true group outing.  Because I also value those relationships as well.\n\nAnyway, OP is heckin’ weird - is the friend supposed to just sit at home every evening alone?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I think we overlook the part, where the friend only goes to her BF when her kid is not with her. Aka the kid doesn't know the BF yet. And I think that is great, because that shows thought and care for her kid",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I think OP is in love with roommate tbh\n\nI kept waiting for there to be a part where she was leaving her kid with OP all the time, or that she wasn’t taking care of the cat -  but nope. She’s done everything that she should be doing.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "We don't know OPs gender but that doesn't matter because it reads like jealousy anyway. I think OP intended to take the friendship to another level when the \"friend\" moved in and is now pissed, because she doesn't want more...",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Or maybe she thought she'd have a live in babysitter? Or just all of the above reasons everyone else listed.  OP is definitely the AH and a weirdo.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Maybe she is in love with her roomate",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Funny because I had a friend who was jealous as well, but jealous of *me* being with him. She would call me up and say things like “I need to borrow your boyfriend today for x event because I need a man to go with me. He’s going to be my boyfriend this weekend.” She would constantly say things like “we share a boyfriend hahaha” and even tried going on a double date with another couple with *my* boyfriend/husband. \n\nEventually she admitted to liking him and being jealous that he was barely aware she existed. I also definitely did not “lend” her my boyfriend and let her act as if he was hers. He isn’t some shirt to lend to friends whenever they want a boyfriend.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is really common among young people who’ve never lived with someone before and have honestly bizarre expectations. They see TV shows where roommates are best friends and they assume there’s some sort of obligation to have a relationship. That’s not the case.\n\nAlso this use of the word “boundaries” really, really irks me. They’re using “boundaries” when they really mean “expectations.”  \n\nFirst, boundaries are to protect you from people approaching you (physically or otherwise). You out up a boundary to prevent people from engaging with you in a way you won’t tolerate. To protect yourself. They’re not to trap people IN.\n\nSecond, since they really mean they’re trying to set *expectations,* I think it needs to be made clear to them that they have no right to set the expectations they’re trying to set. You’re a landlord / roommate. You can’t control someone else’s choices about where they spend their time, what?",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 665,
                  "content": "I'm so confused as to why she'd be upset if her roommate wasn't there. What boundaries. I'm again, confused.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 416,
                      "content": "OP apparently thinks “boundaries” means like a wall around your house keeping you in",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 269,
                      "content": "Have a roommate that pays on time, takes care of their shit, but is never there. Sounds like a win to me, not sure what OP should be complaining about.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "To be honest, it feels this is kind of made up.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Sounds like they think they can have parental control over the flat mate. That flat mate must be home by a set time and spend quality family time with the flat mate.Op you’re not her parent with any powers to dictate or control when she’s home, Your property or not, that is not the meaning of flat mate.   \nShe is also not responsible to be your emotional support nor does she need to prioritise your wants on her time. The only boundaries you can set is don’t eat your food, clean up after themselves and don’t make too much noise late at night. What she does with her time you have no say on.\n\nShe is an adult and is free to go out any time she wants as long as she takes care of her responsibilities. If you actually  think you have any right here or that what you’re asking is normal then you’re immature and acting entitled.I take it this is your first flat away from home so you default to expect her to behave like you had to when you were younger and had to follow your parents rules. That was because you were a minor and their child. You have no such say over an adult that pays her own rent so gets autonomy to decide when she wants to be home or not, IT IS HERE HOME TO.  You cannot demand she stays home and braids your hair that’s not a boundary it’s a being a ridiculously entitled asshole.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Some people manipulate the term “boundaries” to mean “I get to control everything you do.” Like, instead of “I get to set boundaries around myself that, as a person in my life, I won’t allow you to cross,” they think it means “I get to set boundaries around you that you may not cross in situations/relationships I’m irrelevant to.” \n\nThe same way that to some people, “respect” means “you do everything I say without question,” instead of “we express mutual regard for one another’s feelings and autonomy and do our best to honor them.”",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2127,
              "content": "sounds like a “you have to spend time with me bc I let you live in *my* house” type of thing. gross",
              "id": 21,
              "comments": [
                {
                  "score": 723,
                  "content": "Is that what it's about? I was so confused why OP would have a problem with basically having the entire space to herself and her son so often while still having the monetary benefit of a roommate.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 318,
                      "content": "That's a win-win in my book, turning cash with what I'm assuming is virtually no effort beyond cashing a check.  If I were her friend I'd just move out and not bother talking to OP again.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Because she’s got serious emotional problems around controlling behaviour, and/or thinks she’s her roommate’s mother. This smacks hard of someone who has never emotionally matured into sharing space with people without a parental hierarchy involved.\n\nOP, YTA, get a grip of yourself. This is a fellow adult. You don’t get to interfere in her relationship. You don’t get to set “boundaries” about how much time she spends where. She’s taking care of the animals, you’re being ridiculous.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "My thought is that OP doesn’t have shared custody and/or a relationship and is jealous that the friend has time for herself and having fun.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 58,
                  "content": "Or…why aren’t you here so I can have you watch my kid for a bit as I go out?",
                  "id": 26,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That’s the sense I’m getting.  Apparently her share of the rent, groceries and pet care for both pets isn’t enough for the privilege of living with OP, she wants free childcare too. \n\nUnless they agreed to a Kate and Allie situation (2 straight, single moms move in together to raise their kids). But then that should have been agreed upon in advance and if the friend isn’t holding up her part of the bargain, discuss it when both are calm. And use one’s words like a grown up",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I do agree that she’s being unreasonable but I also see how 2 friends would talk about moving in together and helping with each other’s kids. If nothing else it’s nice to have another adult to talk to",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "My live in landlady (who also has a 3 year old child) is EXACTLY like this. Yes, I will be moving out in a few weeks because it's unbearable. She describes me as 'antisocial and withdrawn' and is butthurt that I don't want to hang out after work. She is also a lonely stay at home mum with few friends. She genuinely thought having a tenant would mean having a new bestie",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "That make more sense now, I was wondering if Op was expecting some babysitting or help around the house type of deal, but that felt liek a reach.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "So I’m not the only one who caught that vibe. Op is being creepy.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1636,
              "content": "and also confused on what 'boundaries' are.\n\nBoundaries would be OP's friend/roommate saying hey, you're kinda being too clingy and I really just sometimes need my own space/nights to myself'\n\nNOT 'hey, I'm lonely and needy, I'm setting a boundary that YOU need to be around ME more'\n\nyou don't get to make those demands OP, YTA",
              "id": 32,
              "comments": [
                {
                  "score": 310,
                  "content": "“Boundaries” or “house rules” for me would be not to smoke in the house, for example or taking it in Turns cleaning shared areas. But surely, as grown ups and friends these things don’t necessarily need to be discussed. The friend sounds reasonable and considerate to me.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Yeah it she's leaving dishes in the sink for weeks because she's not home enough to do them and leaving her kid and the cats unattended that is 100% a genuine thing to he upset about. The friend tried to pull \"since I'm not here as much can I pay less rent\" that also wouldn't be cool. But nothing about this situation as described is something OP has any say in calling \"boundaries\" because that's not what boundaries are",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "The only context wherein \"boundaries\" is an appropriate Word when discussing you want a housemate to be around MORE, is when two people have different ideas about how much time and Attention a cat needs, and the Cat owner tends towards \"less\" and then the other Person feels compelled to Care for not-their-own Cat, to avoid animal suffering and/or destructive behaviors.  \"You can only have a cat in my/our-shared House if YOU Take Care of it, which includes [Thing that beneficial to a cat but of controversial/debateable NECCESSITY]\" is a Statement/demand that deserves to be called a boundary. This does Not seem to be the main Problem Here.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 204,
                  "content": "A cage is a type of boundary.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Albeit not a healthy one",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Touché",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Underrated comment",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Despite all my rage I am still just a rat in a cage.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 139,
                  "content": "When I was in college my parents bought a house and got occupancy for me while the owner (freshly divorced) moved out. We were in different wings of this big house, but one evening when I came back late he confronted me and asked where I’d been.\n\nI was taken aback, but briefly explained to him why I was not a person he could expect to order as part of his household. He was surprised enough not to argue, which was a big clue as to why his wife and daughter were nowhere in evidence.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "Yes! It makes me irrationally angry when people say 'boundary' but mean 'i want to put rules on you while retaining a moral high ground so you can't say no.'",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "It’s so bizarre! Also, why would her friend move in with bee boyfriend? It sounds like she hasn’t introduced the kid to the boyfriend yet if she only sees his when she doesn’t have her kid.\n\nLike, random cohabitation isn’t ideal for parenting and can send mixed signals to kids.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Even if they have been introduced, moving in with them is a huge step when you have a kid. You would think a parent with a 3 y/o would understand that! OP sounds like a single parent too",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "OP is the one with boundary issues",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah, a boundary isn’t meant to be a fence to trap the roommate from leaving",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I think its one of those psychology buzzwords that used to be more meaningful and positive, like you said setting boundaries to protect your own peace of mind. Over time it has sort of lost its meaning and become a way for people to try to make their weird or unhealthy relationship rules sound more legitimate.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 513,
              "content": "I moved in with a friend once like this. I was over at my girlfriend’s all the time, but paying bills for the place we shared - it basically ended up being an overpriced storage unit. He got pissed at me and I had to let him know that roommate doesn’t = live-in bff.",
              "id": 48,
              "comments": [
                {
                  "score": 354,
                  "content": "That scenario is my dream flatmate. Pays their share but is never home.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 153,
                      "content": "Right? Thank you for you money please never be in my space.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Right?! I'd be thrilled to have a roomie like this.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Right?! Sounds great and they're actually a thoughtful roommate.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Lived in a situation like that for 5 years, it was great! She was a friend of ours, so it was chill when she was home (she'd usually end up just chilling in her room most of the time.) By the end, she was coming over once every week or two to hang out with us (with her bf, who is also a friend of ours) then still going to sleep at her bfs that night.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "👏🏼 thank you! Let me collect your money💰 for basically just storing your stuff. Easiest side hustle ever.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 161,
                  "content": "My partner is in a living situation like this currently with a long time acquaintance who gets fussy when he spends the night with me multiple nights. He’s doing major renovations at the home he owns so he decided to move in with this friend & split rent with them for a few months to have a space to live without the construction stuff everywhere and it’s become a really annoying situation. He’s planning to move back to his house at the end of august but in the meantime it’s bizarre to observe this roommate act like a scorned bf.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 124,
                  "content": "I don't understand the issue with your example or ops story which seems very similar, sounds amazing to me - place to yourself for half the cost. Do other people not want alone time?! I need a roommate like you and the friend in the post. \n\nOp, YTA they're your roommate, you don't get to control how they live.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 69,
                      "content": "Apparently some people think they’re getting a live in bestie. I was shocked, too. I never anticipated it as a potential issue.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 50,
                  "content": "I had the opposite. I moved into my first place with a friend at college. It was the first time I ever had to share a bedroom as I had 2 brothers. She wouldn't let me have any alone time. If I was in the living room and went into the bedroom, she would follow me and vice versa. Our roommates tried to set house rules like no drinking inside or outside the house. I was 21 but they tried to lock us out one time when we were came home from a friend's house. We had some to drink but were far from drunk. After that, I set the rules that I was an adult who wasn't going to be policed or controlled because they don't like what I'm doing. I never had anyone over. I was thankfully only there for 6 months.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 14,
                      "content": "That sounds like a terrible roommate. It’s such a crapshoot moving in with someone! A respectful, reasonable roommate who’s clean is worth their weight in gold.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I did have a live in bff and this happened (they started spending a lot of time at their girlfriends place) it basically happens a lot when mates get a house together doesn't it? Someone will get a partner and spend a lot of time with new partner. Better than them having that partner essentially move in with you and use your space/utilities/food etc. \n\n\nand yeah it was a little sad to not hang out as much but there's nothing more to it. You hang out with other friends, enjoy the solitude, find a gf yourself etc.\n\n\n\nDoesn't even sound like OP and their flatmate are friends so wtf are OPs boundaries?",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Ugh, this! Judging from these other comments, this is actually a fairly common attitude for roommates to have! So frustrating. Being someone’s roommate doesn’t entitle you to be their bff!\n\nOne of my housemates is like this and it’s *awful.* He can track my movements every time I leave from a different door than normal or say I can’t hang out tonight but then go on to see another friend. Feels personally slighted every time 😭",
                  "id": 61,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I had one like this a few years back too.  It was a  horrible feeling being tracked & monitored all the time.  I hope you can leave soon.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I lived in an apartment with two other women in university. They talked a ton of shit about their previous roommate who kept to herself and stayed in her room a lot. I’m more introverted and while I like company, I do need alone time to recharge. They had a meeting with me to discuss how I don’t hang out with them enough and I was starting to remind them of the previous roommate. I left after the school year was done.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Ok mom, I do NOT need a curfew. Byeeee",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I totally second this. Like why does she care what the roommate is doing? It’s not causing damage to her.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4466,
          "content": "So according to this post, and OP’s comments this person pays rent, buys groceries, takes care of her cat and litter box (even feeds OP’s cat), takes care of her kid when she has them, doesn’t bring boyfriend around to respect roommate privacy and apartment, and stays at boyfriends as to not come in all hours of the night and wake OP/OP’s child. \n\nAm I missing something. I am trying for the life of me to figure out what the problem is?\n\nDid OP hope to get a free babysitter for her kid? Does she want someone to pay her to be her friend? Does OP have feelings for this friend?\n\nI don’t see what this person did wrong or why OP is upset to the point of throwing the friend out. Sounds like a perfect roommate to me. I kept waiting for this horrible thing the friend did and she just got better and better as a roommate.\n\nEdit: Thank you for the awards. And since I forgot YTA OP.",
          "id": 66,
          "comments": [
            {
              "score": 734,
              "content": "I have nothing else to add. You summed it up perfectly.  She even stays out so she doesn't come home late.  The best part of that is she DOESN'T bring him home. OP YTA!",
              "id": 67,
              "comments": [
                {
                  "score": 165,
                  "content": "Exactly! I had to re-read the title of the post because I was so SURE it was going to be a “my roommates boyfriend is basically living with us but doesn’t pay his way” problem. OP has landed on a goldmine honestly.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Right? I kinda thought once I started reading that the roommate left for BF’s house and left OP to care for child or cat.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I theorize OP is an extroverted type who thought she would get a buddy buddy instead of a normal roommate with her own life to lead. These types of people often can't stand being alone for too long...or most lengths of time.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "I do. She takes care of her kid but only leaves for bf's place when her own kid is with their dad. After a while I was expecting them to say she has a trust fund for OPs kid and pitch in to their 401k.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 526,
              "content": "And what’s with the “boundary”? What is it!? The roommate has to stay home and talk to her? Weird",
              "id": 72,
              "comments": [
                {
                  "score": 325,
                  "content": "Yeah, right? She just tosses out the word “boundaries” like that is supposed to explain some terrible thing she did.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 254,
                      "content": "But more than that - OP's use of the term is counter to normal usage, they are looking to keep the other person *within* their boundaries.\n\nWeirdly clear YTA.",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 97,
                      "content": "They’re confusing boundary as something that limits someone with cage that keeps someone in. “My boundary is you can’t hang out with other people and I have to be your only friend.” \n\n“You keep using that word and I do not think you know what it means.”",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 203,
                  "content": "I love how these people use the term “boundaries” as a synonym for “you have to do what I want you to do.” \n\nOP, I don’t think it means what you think it means. YTA.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Boundaries being an electric fence line and a shock collar",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Dang it *I* wanted to make the Princess Bride reference.\n(Also OP YTA)",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Sounds like OP wanted a sit com level of roommates. Hardly ever at work, hardly ever talking to other people.",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Oooh they definitely need to talk about boundaries, but it's not the conversation OP thinks it is.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 151,
              "content": "Definitely getting a single white female vibe from the roommate. Honestly, I'd move out quickly after this conversation!!",
              "id": 81,
              "comments": [
                {
                  "score": 71,
                  "content": "Really? I'm getting neckbeard vibes from this. I can't tell if OP is male or female but this sounds like some fantasy-land friendzone stuff.\n\nEdit: I see from comments that OP is a woman. But I suppose neckbeardism can be gender neutral 🤔",
                  "id": 82,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That's the vibe I get too. \"I did this girl a favour by letting her stay here and now she owes me to be my girlfriend now! We're already living together so she might as well.\" As if that's all it takes to make a relationship. This screams scorned neckbeard.\n\nIf OP is in fact female then there's definitely some S*ingle White Female* shit going on here.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "My first thought after reading that is I don’t see how anyone could row back that conversation having had it, I know that op doesn’t mention what happened after the conversation but I’m presuming roommate of the year went to bf told him about the situation and bf will have either said, I want you to move in with me or it’s not safe for you to be there let’s hop on right move and find you somewhere else.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 71,
              "content": "I think we are all in the same confusion canoe",
              "id": 85,
              "comments": [
                {
                  "score": 118,
                  "content": "I know. Her only explanation in her comments is that she feels like her friend is using her apartment for storage. I feel like if I found someone to pay me full rent to keep some of their shit at my apartment, I would be counting my blessings. I would make sure not a flake of dust touched their stuff lol.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Confusion Canoe is my new favorite phrase — I’ll be looking for opportunities to use it tomorrow!",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": ">at), takes care of her kid when she has them, doesn’t bring boyfriend around to respect roommate privacy and apartment, and stays at boyfriends as to not come in all hours of the night and wake OP/OP’s child.\n\nI personally find this to be a super ideal roommate situation. I wouldn't ask them to change a thing and actively encourage the routine.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "You got it spot on, and I don't see an issue. This person seems like a really good roommate. \n\n\nYTA OP.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’m wondering if OP has a crush on the roommate? Or they’re feeling insecure that the roommate doesn’t want to hang out with them? This is such a weird take.",
              "id": 90,
              "comments": [
                {
                  "score": 7,
                  "content": "I know. I can’t figure it out. OP only says that she feels like her apartment is just used as storage. But I think most people would be thrilled to find someone willing to pay full rent to keep some of their stuff at their place.",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Having a considerate roommate is a problem for OP it seems.",
              "id": 92,
              "comments": [
                {
                  "score": 6,
                  "content": "“I can’t stand my roommate who pays rent, buys groceries and is never hear to eat them, takes care of all her responsibilities and leaves me alone while cutting my rent in half. It’s just so selfish” /s",
                  "id": 93,
                  "comments": [
                    {
                      "score": 5,
                      "content": "They sound like the worst 🤣\n\n/s",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2354,
          "content": "This! The best roommate is the one that’s barely home but fully pays rent on time. OP needs to accept this rare gift and move on.",
          "id": 95,
          "comments": [
            {
              "score": 1179,
              "content": "Ikr? Op basically got a free cat to pet and half her rent covered whilst not really having to share a house? Bro that's pretty fucking epic",
              "id": 96,
              "comments": [
                {
                  "score": 297,
                  "content": "That's what I kept thinking... ummm, are we being punk'd here?  :D",
                  "id": 97,
                  "comments": [
                    {
                      "score": 210,
                      "content": "Like... Bro you just got a free snuggle baby that you don't have to feed and occasionally a kid to play with if you like kids bro this is a win win win win",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 141,
                  "content": "Right like I don’t understand what she’s mad about",
                  "id": 99,
                  "comments": [
                    {
                      "score": 259,
                      "content": "I think it's about their friendship. Like, she expected a roomie who'd hang out with her. She's lonely. But that's not the roommate's problem.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "OP, have you not read the complaing postings here about roommates and their habits that drive their sharing roommate bonkers?  You have the ideal setup.  A roommate that is paying half the rent and is very rarely there.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 203,
              "content": "Exactly what I was thinking.  I had a roommate like this for a year and it was the best thing ever.  We had like four conversations in 12 months.  She basically used my second bedroom as a storage unit and I was happy to oblige her.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "Right? My best roommate ever was a pilot. He was rarely there due to the nature of his job. His gf at the time also worked for the airline, so they traveled often together on their days off. Paid his rent and bills on time, and when he was around, we had a blast just hanging out and catching up. Seriously the best.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "Yeah, the most I would ask for is just a heads-up if she's spending the night out. That way, I know to lock up and that if someone is at the door, they're probably breaking in. That's how we handle it with the friend that lives with us and it's worked out fine.",
              "id": 104,
              "comments": [
                {
                  "score": 26,
                  "content": "I think the only thing I'd be upset about is if there was a mess every day to clean up that wasn't mine.  But that doesn't seem to be the case here.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Seems to even be the opposite of the case. Roommate isn't there long enough to leave a mess before going to her boyfriend's, and spends the time before leaving *feeding OP's cat so she doesn't have to do it*",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Right. I’ve lived with roommates and besides one instance it was a frickin disaster. OP should be blessing her lucky stars!",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Right??? Op basically still gets the house to herself and her child doesn’t need to worry about strangers in her house and being woken up at all hours, takes care of the cat pooper and cats before she leaves, what is the problem?",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Right? Sounds like the ideal roommate to me!",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I don’t think OP was looking for a roommate thou, she was looking to help her friend.",
              "id": 110,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 524,
          "content": "i’m genuinely confused what OP problem is… does she just miss the friend? & want to see her more? cause why would it matter if she’s at her bfs house",
          "id": 111,
          "comments": [
            {
              "score": 290,
              "content": "I assumed that the cat was neglected and acting out or something (I know nothing about cats, but if I don't spend enough time with my dog she turns into a little demon to get attention) but OP's complaint seems to be that *she* feels neglected because the friend isn't glued to her.\n\nOP unless there's a legitimate reason you're leaving out of the post YTA. Your friend actually sounds incredibly considerate of you and your son",
              "id": 112,
              "comments": [
                {
                  "score": 37,
                  "content": "I know!  As I was reading I kept waiting to see what awful thing the friend/roommate was doing, but the more I read, the more considerate and responsible the friend sounded.  I totally agree that she feels neglected, but is trying to disguise that under some kind of \"boundary\" issue.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Roommate is violating what boundaries by being with her boyfriend?   \nI'm so confused. What rules are being broken?",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Is OP actually a dog?!?!?!",
                  "id": 115,
                  "comments": [
                    {
                      "score": 8,
                      "content": "...suddenly it all makes sense! OP has been left alone with the *cat* of all things for hours at a time, obviously she's upset!",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "OP’s problem is called jealousy",
              "id": 117,
              "comments": [
                {
                  "score": 28,
                  "content": "Ding, ding, ding. I wholeheartedly agree.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 162,
              "content": "Definitely just misses her friends and expected her to fill the void of her not having a partner. I get it being a parent can get lonely but just ask homegirl to spend some time with you and stop being petty.\nOp YTA",
              "id": 119,
              "comments": [
                {
                  "score": 30,
                  "content": "Right? If I wanted to hang out with my roommate (when I had one), I'd say things like, \"Hey, wanna stay home Sunday, share a pizza, and re-watch GOT?\" No? OK. *Because I'm not desperate.*  For god's sake no pouting from anyone - no butt hurt - because ultimately, a roommate is a business relationship. Make occasional actual plans if they want, or leave them to take care of their business. As long as they show up with the money and keep their crap outta my way, it's all good.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "I'm also confused by what the problem is. These two aren't dating or something. Why does it matter if the roommate doesn't spend much time in the house.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "It sounds like OP thought she would get childcare help from her friend. If not that, why does she care?",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This is 100% it. I rented with a friend like OP once and I ended up having to cut ties because she was so possessive.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 222,
          "content": "A roommate who pays rent and takes care of responsibilities without spending much time at the house sounds like a dream to me.",
          "id": 124,
          "comments": [
            {
              "score": 52,
              "content": "Exactly!! Basically paying half price for a home you get for yourself most of the time. This is a steal to me.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Seriously. One year in uni, I had one roommate who was regularly at the boyfriend's place and the other left at 6 am and didn't come home until 6 pm or so. Plus they were both good folks.\n\nIt was awesome. I paid for one room but had the place to myself a lot of the time.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 219,
          "content": "This is so weird. OP is complaining about the perfect situation. She's a roommate, not a partner- she doesn't have to be in the place a certain amount of hours. It's actually super cool that she's courteous, does her responsibilities, still pays full rent, and you get the house to yourself!\n\nOP, I don't say this to be rude because I am struggling with the same exact thing, but I think you might be feeling lonely and wanting some more adult company. It's okay to need that and maybe you were hoping for a more close knitted rooming experience, but you can't force anyone to live the way you want them to.",
          "id": 127,
          "comments": [
            {
              "score": 40,
              "content": "This. And honesty I don’t think OP would be out of line to maybe ask for time if OP wants to hang out. Saying “hey, wanna have a movie night?” or “want to do dinner together tonight? I’m feeling lonely” would be okay in my book (with the caveat that it’s fine if roomie says no).",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm wondering if op is a dude...",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I had a roommate who worked a week on, a week off at another distant location. It was awesome. House to myself every other week. \n\nMy first dorm, my roommate actually lived with her boyfriend but her parents didn’t know. So I had a room all the myself 95% of the time. It was great. Except I had to screen calls from parents and claim she was at class or in the shower and then call her to tell her parents called. (Before cell phones were common)",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "Right?! OP just described *the perfect roommate*: pays rent, is super considerate, and makes herself scarce,  and OP is somehow mad about it. \n\nOP, YTA. You seem to expect you can control your friend's movements because they're renting a room from you. Unless you're running a rooming house with strict rules for coming and going in your lease terms, you can't tell her what to do, and also it is very very very extremely weird that you want to.",
          "id": 131,
          "comments": [
            {
              "score": 37,
              "content": "Super weird! \n\nYTA for trying to control your room mate for some \"super weird\" reason.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It very much strikes me as OP viewing the roommate as a child. She is policing roommate's behavior with her own boyfriend, as though roommate were her child. That's not ok.\n\nOP, YTA 1000%\n\nyour roommate is a grown adult and she has no obligation to spend any more time there than she wants. She's paying you full rent, and only using you as storage...? Great! Less utilities cost, trash, water use, wear and tear, etc. In ALL ways, your roommate is ideal. \n\nIf she gets tired of your BS, I'm pretty sure she could find a similar situation without the helicopter parent (uh helicopter landlord) very easily.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "This gives off major Mean Girls vibes \n\n“Why are you so obsessed with me!?” \n\nIt’s Uber creepy that OP thinks she’s entitled to her roommates time. Like, legit typed all of that out and still doesn’t get it. Damn…",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 43,
          "content": "Yeah, there does need to be boundaries. Start with staying TF out of your roommate's business and stop trying to control what she does and where she goes. YTA. How can you even think this is appropriate behavior?",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Right?? That's the perfect roommate imo, one that's never home!",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14812,
      "content": "YTA.  How does it hurt you if she's not there?  She's taking care of all her responsibilities.  Just because you use the word boundaries doesn't mean you're being reasonable.  I don't understand the issue either.",
      "id": 137,
      "comments": [
        {
          "score": 7157,
          "content": "The best kind of roommate is the one who pays rent and bills and who is never there.   The OP should realize this.",
          "id": 138,
          "comments": [
            {
              "score": 1587,
              "content": "[deleted]",
              "id": 139,
              "comments": [
                {
                  "score": 71,
                  "content": "Literally looking a gift horse in the mouth.",
                  "id": 140,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "And she’s a roommate who cleans up after herself",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 817,
              "content": "Honestly sounds like op just wants to be nosey with roomy's life or wants to force her to be her friend.",
              "id": 142,
              "comments": [
                {
                  "score": 487,
                  "content": "I am at a complete loss to understand why OP cares.  Or thinks they have the right to set a 'boundary' in the first place.  Strange things are afoot at the Circle K as the wise men once said.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 29,
                      "content": "OP is just jealous",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Right! That’s not even what a boundary is. The roommate is probably leaving when she can because OP is insane.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Sounds more like the *roommate* needs to set more boundaries for OP to be honest.",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "“strange things are afoot at the Circle K as the wise men once said”\n\nlol. Classic. I’ll be borrowing this.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 218,
                  "content": "yeah either OP is horribly clingy or is using the roomie for free childcare",
                  "id": 148,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Ding ding ding!  Free child care is the only reason I can think of other than op being a clingy person.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "That is what I was thinking! (Free childcare people suck when they just expect it and assume that will be your role).",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I get stage 5 clinger vibes.",
                      "id": 151,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 54,
                  "content": "Or wants an after school babysitter",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "OP is probably lonely and wants her friend around for companionship. She's forgotten they are simply roommates and friend isn't obligated to stick around for her",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Or maybe they want roommate to act as free childcare when her kid isn’t around so OP can be the one going out",
                  "id": 154,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 101,
              "content": "My roommate pays bills and leaves on the weekend. What do I care what he does and where he goes?",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Literally reread the OP twice because I'm so confused lmao. Why... is it an issue if she's NOT there? I'm trying so hard to understand what the problem could be.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I’ve considered getting roommates to save money, and I’m not strictly opposed to becoming friends with a roommate if that’s how it panned out - but I don’t want to force it. And so many of the roommate ads I see mention how they’re looking for a roommate with similar interests, which implies that they want to immediately be buddies with their roommates. \n\nThat’s not how I roll, I’m like a cat around new people. I run away and hide, you have to let me come to you. If you try and force it I’m just going to keep running away",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I would have killed for this situation with my last roommates. One was an alcoholic and constantly had her two sisters spending the night constantly and the other was a passive aggressive bitch that had no friends and took out her hatred of life and people on me, my partner, and the other roommate\n\nHaving a place just to me and my partner is pure bliss",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The OP calls the roommate her friend. I would bet she expected them to be hanging out all the time since they are living together. She’s upset that the boyfriend gets more time with her than she does.",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "And who also isn’t driving up utilities!",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Even takes care of OP’s cat! Like, how could there be a better roommate? Doesn’t want to wake/disturb them coming in late, understands OP may not want a strange man (roommates bf) at her home with her and her kid so goes to his place instead. What a considerate person!",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Sounds like she doesn't want a roommate but someone to be there with her all the time.",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 989,
          "content": "I kind of laughed at the use of \"boundaries\". It's the most topsy-turvy use of the word I've ever seen. \"I have boundaries that require you to be in my space.\" I don't think those are boundaries, those are shackles.",
          "id": 163,
          "comments": [
            {
              "score": 311,
              "content": "This! She used the word boundaries so many times and I kept waiting for her to get to the part where the roommate was in the wrong. “My boundary is that you need to be here more for my own sake” controlling people are so weird.",
              "id": 164,
              "comments": [
                {
                  "score": 7,
                  "content": "I mean a prison wall is a boundary, in its own way.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "And then her solution is to have roommate’s boyfriend move in if it’s too much of a problem to be forced to stay at home??? Like what does OP think the word boundaries even mean? It’s the complete opposite of boundaries!",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "That is definitely not the correct use of that word.",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 303,
          "content": "It's definitely not a boundary. The is one of those times people use the word boundary when it's really about control.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 175,
          "content": "I think OP meant to use the word \"restrictions\" instead",
          "id": 169,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 170,
          "content": "People have a really hard time understanding that boundaries must be in place in their own territory, not others'. \"I have a boundary that you can't leave the house whenever you want.\" isn't a boundary, is interfering with someone's freedom. Jeez.\nOP is basically trying to manipulate their friend into doing what they want because they own the house and know the friend needs the place. Disgusting. Complete YTA.",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 107,
          "content": "I would guess she envisioned them in pjs, watching NetFlix and braiding each other’s hair every night?  She’s mistaken her to be her BFF rather than a roommate.",
          "id": 171,
          "comments": [
            {
              "score": 7,
              "content": "Why not do this when the kids are there? Sure it’s fun to have a friend around but every night would be exhausting.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "The only thing I can think of is OP trying to pawn off her kid to her friend for babysitting. I mean, what other reason could there be for OP to be mad about her friend not being there all the time?",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 71,
          "content": "What boundary is even being crossed? Your roommate being home or not has nothing to do with you. If her responsibilities are met, I feel like op is assuming the roommate has the responsibility to be home more? And do what?",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 62,
          "content": "I can understand the OP  being upset because she thought that she and the friend would spend time together, movie night, girls night, etc so maybe the OP and friend had different expectations. But in the end, the friend isn't doing anything wrong. I'm kind of flabbergasted that the OP thinks the friend isn't allowed to live her life. I just don't get it.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 39,
          "content": "People definitely overuse the word boundaries, especially in attempts to control others.",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11873,
      "content": "I just read somewhere that boundaries are limits you set for yourself, control is limits being set for others.  There is no reason for you to have any control over where she spends her time. Why do you need her to be home? If you would like to spend some time with her as your friend, then you should just tell her that instead of trying to control where she spends her time. Having a roommate who’s hardly home seems like a dream situation to me, unless the reason for having one is for companionship.\n\nETA: Thanks for the awards and upvotes. Definitely did not expect this kind of response to my comment 😳\n\nETA 2: My original comment was an intentionally simplified distinction between setting personal boundaries and trying to exert control over other people's lives. \nMaybe some see this as a distinction without a difference, however, when I think of my personal boundaries, they are meant for self-governance. I understand and accept that I cannot control or change another person. To say that personal boundaries are a form of control over others implies that I have some level of power and authority that I can wield to force compliance to my demands. To seek control over others should not be the motivation in setting personal boundaries. But I guess it's true that we don't see things as they are, we see them as we are...",
      "id": 177,
      "comments": [
        {
          "score": 2353,
          "content": "Yep, what OP described is not a “boundary.”",
          "id": 178,
          "comments": [
            {
              "score": 102,
              "content": "Its a confinement!",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "More like false imprisonment1",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I want you back in my boundary!!!",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 245,
          "content": "This is the perfect explanation. Everything I wanted to say but much better (and succinctly) worded. OP: this is absolutely how you should look at this situation. \n\nFor now, the way you’ve articulated why her absences bother you makes YTA. Her whereabouts in her free time are not a “boundary” infringement. If anything, she is being mindful of *your* boundaries by erring on the side of not imposing/inviting her BF’s presence in your shared home. \n\nAsserting that it’s your house and that as such your “rules” should determine in any way how much time she spends outside of the home outside of cat duties also makes YTA.\n\nBut it’s perfectly fine to miss her friendly companionship around the home and to express that to her.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "this is so true and so important to understand! I tried to express this is in the past once but I didn’t find the right words for it at all! Very well worded! I hope this understanding spreads because it would be a true enrichment for many healthy discussions ——-<—-<-<@",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I like this, will try to remember it in case I need to point it out to someone else.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "She wants to control very specifically the roommate being at her boyfriends house, she made that pretty clear.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7426,
      "content": "This is easily the dumbest thing I’ve read all day. 🥇",
      "id": 186,
      "comments": [
        {
          "score": 896,
          "content": "Lol I’m so glad someone else said it. I was like wtf did I just read.",
          "id": 187,
          "comments": [
            {
              "score": 410,
              "content": "Seriously. I wish this “problem” was my “problem” my god",
              "id": 188,
              "comments": [
                {
                  "score": 253,
                  "content": "People dream of a responsible roommate who’s hardly around. She found the unicorn and is trying to kill it.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm thinking there's more at play here. OP is jealous of her friend...",
                      "id": 190,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "OMG yes, I once had a friend who due to an emergency situation had to stay at my house for a few months. If she had somewhere to go regularly I’d be very happy about it.",
                  "id": 191,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I can't believe I read the entire post waiting for a plot twist to their question 😂",
              "id": 192,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "Right? I had to read it twice because I assumed I missed something",
          "id": 193,
          "comments": [
            {
              "score": 121,
              "content": "Same. Every time I was like “oh, maybe she’s not paying her rent” or “maybe she’s neglecting her cat”, it was addressed in the post. From the info we’ve been given, she’s literally the model roommate. Like… what’s the problem?",
              "id": 194,
              "comments": [
                {
                  "score": 7,
                  "content": "Aaaand she is even thinking ahead and not coming home in the middle of the night, like what is even the problem?",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "This is so fucked … lol",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 160,
          "content": "Even though it is only 10:00 AM at present, I highly doubt that I will come across anything throughout the remainder of the day that can rival the level of absurdity and intellectual vacuity I have encountered in this post.",
          "id": 197,
          "comments": [
            {
              "score": 13,
              "content": "You must not have seen the AITB post about swimming being only for kids. This one is dumb, but I think that one was dumber.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "Sounds like something made up.  Something so stupid it gets people to engage, vote, & comment.  Damn it I fell right into the trap too.",
          "id": 199,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "I read the entire thinking somewhere that the roommate didn't want to pay bills because she was never there or something. But nipe. This person has some type of weird issue within themselves to work out.",
          "id": 200,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Can't be real. What is the thought process",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5061,
      "content": "YTA. She’s not your teenage daughter. Why does it matter if she’s away from the house? You say it’s not about the cat. \n\nDoesn’t sound like she will be your friend for much longer",
      "id": 202,
      "comments": [
        {
          "score": 1160,
          "content": "[deleted]",
          "id": 203,
          "comments": [
            {
              "score": 292,
              "content": "Damn, when my kids became adults and disappeared. I was pretty happy. They were self sufficient, moving in the right direction as far as not living with me until they were 40 and well happy.  I am wanting to be seen as a motel.",
              "id": 204,
              "comments": [
                {
                  "score": 16,
                  "content": "How old are your kids now because if they’re not 40 yet you could still get one or two back before then!! Haha hopefully not but my parents definitely took adult strays back in here and there when life stuff hit the fan.",
                  "id": 205,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Or even 55! My dad moved back in with his mom…who already lived with his sister…at the age of 55. This was 12 years ago. All three still live together, unhappily.",
                      "id": 206,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "For real. If my kids are in their 20s and live away and come over whenever they want that would be ideal",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 91,
              "content": "Isn't that kind of the point? You want your adult children to go out and make friends with people so they can move out and save money and parents get a second wind of what it was like before kids? I am seriously missing the point here. I had a parent pull this crap on me when I was an very young adult. I pretty much barfed reading this post. Sounds like the perfect roommate. I hope my adult children are this awesome.",
              "id": 208,
              "comments": [
                {
                  "score": 5,
                  "content": "I remember telling my dad when I was leaving the house to go out and him replying “I don’t care”. Lmao. At a certain point it was made clear that I was mature enough to make my own decisions without my parents approval.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "[removed]",
              "id": 210,
              "comments": [
                {
                  "score": 7,
                  "content": "Exactly! I have a feeling what they’re actually wanting is for you to spend quality time with them, but they aren’t able to reach the level of introspection and communication skills to be able to verbalize that.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "This is exactly a complaint my mom had with me when I was a teenage girl living at home, I didn’t get the issue then either and that was my mom. If a friend had this complaint I’d be really confused!",
              "id": 212,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Exactly.  Had to deal with this when I lived with my grandmother for a while during my disability claim. Finally just moved in with boyfriends mom who is also a friend because I couldn’t take being treated like a kid. I was 40 and yes I wanted to go have my bf help me with showering and stuff instead of her. Don’t know why that was hard to understand.",
              "id": 213,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Shit, I would run after that comment. Wtf does she want me at the house all the time for?",
          "id": 214,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Loooool even if I was living with my mom and paying rent in my early 20s and she’s like “you have to sleep here 70% of the time that’s my boundary.” I’d be like wtf? I’m a grown ass man and contribute to the house. You can’t be telling me how much time I need to be in the house.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I wouldn't be surprised if OP is religious and that her issue is her staying at a guys house.",
          "id": 216,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2908,
      "content": "YTA. This is bizarre. Did you think she only moved in to be at your beck and call every day? She has her own life and you already said the cat wasn't the problem. Let her live her life.",
      "id": 217,
      "comments": [
        {
          "score": 606,
          "content": "Absolutely bizarre. The only thing I can think of is OP doesn’t have a bf and is jealous her friend gets to have one? She needs to grow up.",
          "id": 218,
          "comments": [
            {
              "score": 346,
              "content": "I think she's secretly in love with the roommate",
              "id": 219,
              "comments": [
                {
                  "score": 130,
                  "content": "I really think this is the answer. Either that or she’s got this weird possession obsession toward her I’ve experienced from mean girls. Or both.",
                  "id": 220,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I don't think so. She just thought her friend was moving in, and they were going to hang out all the time like it was college. She didn't realize her friend was going to act like the tenant that she is.",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I wonder if she wants her friend around to babysit for her",
                  "id": 222,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Yeah my best friends fiancé had a room mate like this before they moved in. I was hanging out with the two of them and her roommate calls her and we listen to them talk for a bit then she hangs up and we’re both like “tell that bitch she’s your roommate not your wife”\n\nAnd she was all like “okay so I’m not crazy? She is acting weird right?”\n\nAnd we’re like even if she was your actual wife she’s still being over the top lol. She moved out a week later",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "Fake is my only thought",
              "id": 224,
              "comments": [
                {
                  "score": 51,
                  "content": "I have known multiple people who have lived with frankly creepy people who tried to control them like this",
                  "id": 225,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Like my cousin… she invited me to move in after a break up! My daughter and I did, as we were out of state moving closer by family and this allowed a solution right away to get out of his house. Her hidden agenda was I cook for their family, clean the house like a maid, and watch her kids. 🤮🤮🤮 \n\nI just don’t understand people so controlling (and my cousin is also very dramatic and everything has to be about her). TOXIC \n\nI hope the roommate moves out as soon as she can… RUN, girl! RUN!!! 🏃‍♀️🏃‍♀️🏃‍♀️",
                      "id": 226,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yes this weird and creepy behavior and surprised not more people have mentioned this. It’s giving single white female",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Or just had this vision that they’d be super-besties.\n\nI’ve been OP to a degree. My best friend and I had moved to another state (where I didn’t really like it.) I was also broke at the time, so going out and doing things in a strange place was both overwhelming, and not entirely feasible. I projected A LOT of my insecurities and emotional needs on him because I was so miserable. And then he got a boyfriend and we spent less and less time together. It sucked. I also didn’t handle it particularly well. It was an extremely unhealthy situation, but of course I didn’t see it at the time.\n\n10 years later, I’m back on my side of the country, doing my thing and happier. He and his husband (not the same guy, lol) are happily married and I visited them just last month. We are still friends, but man, expecting him to fulfill all my emotional needs at the expense of his own life and happiness was just insane. I still feel terrible about it.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I wonder if OP has feelings for her friend cause otherwise, it doesn't make sense on trying to control what her friend does in her free time.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1811,
      "content": "[deleted]",
      "id": 230,
      "comments": [
        {
          "score": 414,
          "content": "I feel like it’s either that or some kind of weird religious disapproval, ie “I don’t think people should spend the night together unless married.” Or maybe a disturbing obsession a la *Single White Female*.",
          "id": 231,
          "comments": [
            {
              "score": 9,
              "content": "Single White Female is the first thing that came to my mind. That, or like you said, some controlling asshole trying to get in her pants.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This was my first thought as well",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I would go for jealousy because the roommate actualy has a bf",
              "id": 234,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Or OP was planning on this friend being a free babysitter.",
              "id": 235,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 114,
          "content": "I assumed that OP was female, but on rereading, it's never specified. This actually makes perfect sense, and I can totally see a certain type of r/niceguys letting a friend move in with the expectation that they'll be getting a bang maid out of the deal.",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "To be honest my first thought was that the op was expecting that the roommate would be there all the time and op could use them for free child care... Or to watch the apartment while op goes on vacations or something. \n\nI honestly can't think of any other reason as to why they would be pissed that their roommate isn't there all the time.\n\nEdit: I was also assuming that OP was a straight female, and not potentially a straight male",
          "id": 237,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "This is the first thing I thought. This sounds like a guy who had a friend moved in so he could have some company hoping it would somehow evolve into a relationship. I don’t think he’d care as much if it wasn’t her boyfriend’s house she was going to. This whole situation sounds creepy.",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1143,
      "content": "YTA, why are you so concerned that she isn’t at home? You don’t mention if she pays rent, and honestly that wouldn’t change my verdict, but you have no say where she is unless she is 1) leaving her child with you (she’s not, you said she only does this when her child is with their father) 2) neglecting her cat (she’s not, you even say she feeds yours or 3) Leaving a mess that she made. She is an adult, you are her roommate, but probably not much longer if you continue with your unreasonable behavior.",
      "id": 239,
      "comments": [
        {
          "score": 119,
          "content": "If the friend isn't paying rent, and OP needs the help, but is forgoing the rent to help a friend. I MIGHT be able to empathize with her. If you aren't here half the time, I could actually rent the room out for money.\" But this would be a long stretch if this were the case. And if it were, I'm sure OP would have stated so.",
          "id": 240,
          "comments": [
            {
              "score": 16,
              "content": "The friend pays rent. But even if you're giving someone a free room just to help them that doesn't mean you can tell them they can't see their bf and sleep over at his house when you have freetime",
              "id": 241,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 965,
      "content": "just say you get no play, it would’ve been easier. YTA",
      "id": 242,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 739,
      "content": "Are you upset because she is spending time with her boyfriend and not you?",
      "id": 243,
      "comments": [
        {
          "score": 57,
          "content": "That's how I'm reading it. Like the classic middle school fight where you hate your friends first girlfriend because your jealous.\n\nBut of course this isn't some craigslist transaction where she is just a landlord who has a stranger who's a paying tenant. She probably let her friend move in because she thought the tradeoffs of having someone in her space was worth spending time with her friend, and now she isn't seeing the positive returns of that tradeoff. So she can ask her to leave if she wants.",
          "id": 244,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "100 percent. Look at ops other comments",
          "id": 245,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}