{
  "post content": "While me and my husband are childless and don’t want any kids of our own, we love to spend time with our nieces and nephews. This includes my brother’s 11-year-old son Allan, 6-year-old daughter Ava, and my sister’s 10-year-old daughter Kelly.\r  \n\r  \nLast May, we planned a weekend trip with the kids to a beach town about an hour away. We did this to spend time with them and also to confirm if they would be ready for longer overnight trips, and we’d also be within driving distance of home if any of them needed to go home early.\r  \n\r  \nMe and my husband expected that Ava may have had a hard time being away from her parents overnight since she’s still 6. But both she and Allan were well-behaved the whole trip. Kelly however misbehaved for the entirety of the beach trip:\r  \n\r  \nFriday: Pick-up from their parents’ houses around 5 and got to the beach town by 7. During the car ride, Kelly was being an instigator and kept trying to start a fight with Allan. Kelly was not listening at the grocery store and refused to take turns with Allan and Ava with the TV.\r  \n\r  \nSaturday: Kelly threw a fit because she wanted ice cream and we told her that we wouldn’t be going to the ice cream store until later. We told her she could have fruit for a snack if she was hungry and Kelly threw some of the fruit in the trash before my husband stopped her. \r  \n\r  \nAt the beach, Kelly kept re-filling the hole Ava was trying to dig with sand despite being told multiple times to stop. Kelly kept trying to start fights with her cousins. During dinner, Kelly was rude to our waitress and was sarcastic the first time we told her to apologize.\r  \n\r  \nSunday: At the gift store, Kelly wanted to have a conch shell and a mermaid doll but didn’t have enough pocket money to get both. When we told Kelly she would need to pick one and couldn’t have both, she ended up being allowed to have neither because she kept throwing a fit.\r  \n\r  \nAt the hotel, Kelly was not listening and kept trying to watch TV despite being told multiple times to help with packing suitcases. During the car ride home, Kelly was again being an instigator and kept trying to start fights with Allan and Ava.\r  \n\r  \nMe and my husband told my sister that Kelly was not coming on any more overnight trips with us because of her behavior. My sister is angry now because we haven’t changed our minds and are staying true to our word by only bringing Allan and Ava to our week-long trip in August.\r  \n\r  \nMy sister told me that Kelly is just acting like a kid and she’s only 10. I agreed with my sister that, exactly, Kelly is a 10-year-old. There’s a reason we waited until the kids got to their current ages. She’s too old to be constantly misbehaving and throwing fits like a 4-year-old.\r  \n\r  \nShe says Allan and Ava may be mature/calm for their ages but I am out of line to punish Kelly for not being the exception to her age and she hopes me and my husband feel good about ourselves after excluding a child. Is my sister right that we’re the AHs?\r",
  "id": 1,
  "comments": [
    {
      "score": 10035,
      "content": "You are 100% NTA. You are aunt and uncle of the year, omg. Don't worry about your sister either. She's just upset that you are being a better parent to her child - by sticking to your word - than she is capable of being.",
      "id": 2,
      "comments": [
        {
          "score": 3453,
          "content": "Not to mention losing a week of free babysitting. NTA OP, Kelly's not the only one who needs to learn actions have consequences.",
          "id": 3,
          "comments": [
            {
              "score": 1279,
              "content": "Sister was probably already planning a childfree week vacation :D",
              "id": 4,
              "comments": [
                {
                  "score": 852,
                  "content": "THIS. My sister, who lived fairly close to the beach town we were visiting, showed up with sleeping bags & her 2 kids\\~ready to drop the off for a \"long weekend.\" \n\n It was all about the free babysitting, and we said \"No.\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 373,
                      "content": "Wait, what? Your sister just… showed up with her kids for you to watch with no prior agreement that you would be watching them?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 155,
                      "content": "During your holiday? Wow that's so rude!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 61,
                      "content": "You need to make this whole story into a post please",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "You need to post this over in r/entitledparents.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I know I would be if anyone volunteered to take my kids.  I'm just not lucky enough to have siblings like OP.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "[removed]",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "It isn't even punishing the child because she has no way of knowing there is even another family trip going on, the sister is just mad because SHE's been punished for raising a brat.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This.  There is a reason those shows like super nanny focus more on the parents than the kids.  OP is NTA and unfortunately, I suspect that OP's sister is blaming OP and husband and not herself or her kid.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1494,
          "content": "For real, if my aunt and uncle reported this behavior back to my parents I would have been grounded and THEY would have said I couldn’t go on the next trip.",
          "id": 14,
          "comments": [
            {
              "score": 326,
              "content": "Not forgetting the punishments. I once misbehaved at a relative place. I was 6 years old. I kicked the bottle of milk out of rage because I wasn't asked first if I wanted to drink it or not and my brother was asked first.  That's it. My parents came to fetch us the next day and my brother told them everything. The looks my parents gave me were enough for me to \"shit my pants \". I was not allowed to go to that relative place for one month. The punishment came from my parents. \nWe laugh about it now but it taught me how to behave\n\n\nEdit\" NTA..",
              "id": 15,
              "comments": [
                {
                  "score": 38,
                  "content": "I think it's a question of the times we inhabit? I have gotten into far worse for having much done much less, and so have my friends and cousins of a similar age...",
                  "id": 16,
                  "comments": [
                    {
                      "score": 196,
                      "content": "It’s not the time we live in, it’s the quality of the parenting.  I’m a teacher.  Maybe 15 -20 percent of students are polite, respectful, kind, and appropriate because their parents raise them that way.  The rest are raging entitled assholes, **because their parents raise them that way.**",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 67,
                      "content": "The brother's kids didn't pull that. My kids would never try any of that.  I don't think it is about the times we live in.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Right but Kelly is an only child and sadly she behaves just like a brat.\n\nTwo of my wife's friends are only children and they look at the world in a completely different way then all of our friends who have siblings.\n\nBeing the center of the world to two parents warps some children's minds.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Sorry to burst the bubble..not all \" only child\" behaves like that. Entitled and mannerless children behave like that. My cousin is the only child for his parents. He is 8 years old and he behaves way more maturely and responsible than this Kelly. \nBeing an only child does not give you the green flag to misbehave.\nIt's all part and parcel of the upbringing.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I have two different cousins that are only children. One is rather spoiled, the other is one of the nicest most considerate guys you’ll ever meet. My youngest sister is more of a spoiled brat than the spoiled cousin and she was never an only child. It’s really down to personality and parenting.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "That ONLY children are selfish and ill-mannered is a myth - they are no more or less likely to be brats than children with siblings.  My child is an only, and didn’t have behavior problems, while I grew up in a family of 7 and a few of my siblings were nightmares, and some of their multiple children are also.  How many siblings you have means nothing - it’s how you are parented.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Parents who make the children the center of their world, are doing their jobs. That is not the issue. The issue is the right and wrong way to love your child. Loving your child means wanting what is best for them, not always giving them what they want. Loving them is providing for their needs, not always indulging their whims. My parents made us, their children, the center of their world. Daddy worked hard to provide shelter, clothing and food for our family. Mom stayed at home and cared for it and us children. Our lives were centered around the family. We knew that we were the most important people in our parents lives, besides themselves as a couple. We were taught that the family was our world. The church was an extended part of our world. But, and here is the caveat...we were also taught that as vast as our centered world was to us, we were a tiny speck in the world at large. We were taught to be supportive of one another, while also becoming independent. We were taught that it was our duty to strive and make the world a better place than it was. We were taught to love and respect people simply because they were people, no matter how different they were than us or if their beliefs weren't the same. Our parents, having decided to have children, dedicated themselves to raise those children to be good, decent and kind people. Yes, we were the center of their universe, everything they did was in effort to provide, support, love, teach and guide us into becoming good people. Our parents KNEW that we would do wrong, all humans do, and they corrected us because they loved us, but no wrongs we committed could ever change their love and commitment to us. Too many parents today have practically raised themselves. No rules, no example of good parenting. Too many children raised with ONLY the rod instead of love being the primary resource. Too many children abandoned, neglected and abused who grew up into parents who want to so far distance themselves from their own troubled upbringing, that they swing too far to the other extreme. Too rigidly controlling or too lax, too protective or outright neglectful, too harsh in their discipline or no discipline at all. Children are clean slates, sponges. As parents and grandparents, aunts and uncles and older siblings and cousins and teachers...it is up to us to make sure what is written on those slates and what is absorbed by those sponges is good and right and loving. Once the slate is full and the sponge saturated, it is very difficult if not impossible, to change the outcome.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "That's totally up to the parents. I'm an only child and no way I would have behaved like that when on a trip with, say, a friend and her parents. Because I knew the second I misbehaved and got home, my mom would have grounded me for like 2 to 3 months. And that included any outing to see a friend and all birthday parties. \n\nA kid behaving like that is a clean indicator of parents that are too lenient with their children.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "My son is seven, an only child, and behaves FAR better than the ten year old in this story. It is about how you raise them.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "I’m an only child who raised an only child. My parents wouldn’t have tolerated that and neither would I. I know lots of obnoxious, entitled children with siblings. Stop with the prejudice against only children.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 276,
              "content": "Totally, I would have been stuck in my room when not at school or meal times and would likely have had washing up duties for a week too minimum. If it was my Dad I would have ended up with a bruised arse.",
              "id": 27,
              "comments": [
                {
                  "score": 28,
                  "content": "Everything except the bruised arse part is what my step-daughter used to get for punishment when the \"crime\" was significant enough.  For smaller misbehaving, it would have been much less of a punishment.  But if you don't mind me asking, was that too much punishment, or was that realistic?",
                  "id": 28,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My mother went the bruised arse route.  According to her once we hit about four years old she didn't have to any more, she just gave us a look and started counting to three.  By the time she got to two we had either scattered or we started doing whatever chore we were slacking on.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "That was only cause my dad was an arse hole and his response to everything was a boot to the arse, if it was more than just tantrums then the punishments would escalate. My Mum was definitely more level headed with her punishments.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "[removed]",
                  "id": 31,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Hilarious how two bots decided to steal the same part of [the same comment](https://www.reddit.com/r/AmItheAsshole/comments/158xgb4/aita_for_refusing_to_bring_my_sisters_child_on_a/jtcez9r?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2) and paste it in the exact same place in the thread just 3 minutes apart... clearly this means they're using the same script/code.\n\n\nThis means u/Honest_Suggestion498 and u/Admirable_Time2480 are both harmful spam bots, reported as such.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "bot",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 34,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Copying u/inFinEgan 's comment. For shame bot.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Stolen comment https://www.reddit.com/r/AmItheAsshole/comments/158xgb4/aita_for_refusing_to_bring_my_sisters_child_on_a/jtcg4wy/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "No kidding.  I don't think that corporal punishment is necessary, but it can be done without bruising your child.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "[removed]",
                  "id": 40,
                  "comments": [
                    {
                      "score": 0,
                      "content": "bot",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "Yes, me too. I would have been grounded until I would turn 40 probably..\n\nAlso I have a 7 year old stepson and if he would behave like this I wouldn’t want others to have to deal with that. He wouldn’t go on any more trips until his behavior would improve.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "My son knows very well that overnight trips are a privilege and will be rescinded the moment there is a serious complaint. Also, I never ask for my son to be taken on overnight stays. It's always the other way round. Asking somebody to take care of your child overnight is a big ask.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Big same. I would have been in so much trouble. My parents never took my side over adults if I misbehaved.",
              "id": 44,
              "comments": [
                {
                  "score": 2,
                  "content": "Years ago when my much younger cousin was about 8 did something (he might have been in the street or something), I went and told his mother about the incident. I was Bothered by it. I was also an adult by then in my 20s. My aunt took her kid's side. I was shocked that she took his word over mine.  And I never went again and told her anything similar.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Sis is likely dying for a break from her hellion",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I would have been in so much trouble when I got home if I behaved like that. If it was one thing that were imprinted in me it was that you were on your best behaviour when being away without my parents.",
              "id": 47,
              "comments": [
                {
                  "score": 2,
                  "content": "Righttt? Man, I would wash dishes without being asked, when I was at an aunt's house or a friends house. I was drilled on good behavior whenever I wasn't with my parents, otherwise there _would be words_.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Exactly this. My parents would have been MORTIFIED if my sibling and I behaved like that.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "My parents would have been so embarrassed and disappointed in me. The biggest punishment would have been to see how disappointed they would have been.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Exactly. My kid would absolutely know that there are consequences for acting like an ahole. I consider raising kids to NOT be AHs one of the most important parts of being a parent. And it shows because none of my kids would ever act that way.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "OP. You’re not parenting, you’re babysitting (for free). This comes with expectations from both the child and their parents to be saints. Your other sibling gets it and their kids get it too because it’s a sweet deal for all of them. Kelly will learn quickly and so will your sis. \n\nThe best part of being an aunt/uncle, you shouldn’t need to deal with the annoying responsibilities that parents need to enforce.",
          "id": 52,
          "comments": [
            {
              "score": 35,
              "content": "I agree with everything except that Kelly and sis will, “learn quickly.” Unfortunately, probably not, but we can live in hope.",
              "id": 53,
              "comments": [
                {
                  "score": 18,
                  "content": "It's been a year since they were told  and they haven't learned, so any chance at “quickly” seems to be gone.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "OP, Kelly *is* the exception for her age, and not in a good way. Source: have been a teacher for over a decade; know dozens of 10-year-olds.\n\nNTA.",
          "id": 55,
          "comments": [
            {
              "score": 22,
              "content": "For sure. They all have their moments, but it shouldn’t be nonstop asshole behavior for several days",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "For real, and honestly a ten year old is PLENTY old enough that she should be able to behave semi functionally on a trip, especially for someone else. I would be so embarrassed to hear a report like that on one of my kids’ behavior! To try to put the blame on op for “unreasonable expectations” from a TEN year old, those were absolutely not unreasonable expectations. This kid is being raised in stereotypical only child fashion and is likely going to have a LOT of hard lessons later on. (Said as an only child raised like an only child who had a lot of hard lessons later on… but could still, at least mostly, behave my ass on a trip with other people smdh)",
          "id": 57,
          "comments": [
            {
              "score": 21,
              "content": "Exactly. If the kid was, say, two years old, that would be different. Toddlers can be unreasonable, stubborn and have tantrums, they're literally still learning how to process the world. Ten years old? Yeah, that's way too old to be acting like that.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Sounds like the sister is mad that she won't get a break from the demon she spawned.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Sister knows how much of a handful her daughter is and is mad OP won't take her off her hands for a bit lmao",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA. Having kids is easy, but raising good kids takes work.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -28,
          "content": "A better parent, lol; that is a wide assumption, we have no idea whats at play here. OP is playing part time parent and sounds like she would rather hire actors to play her kids and pretend to be a parent for a few days vs actually embracing her whole family. As a parent you don’t get to pick and choose which kid you do things with depending on behavior and believe it or not some parents can do everything right and still end up with a difficult child. Its just life and usually is just a phase. If i judged everyone based on their 10year old selves, well that would be weird, right??",
          "id": 62,
          "comments": [
            {
              "score": -15,
              "content": "Thank you, I wanted to write something along those lines, but you did it better.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -71,
          "content": "wow, everybody is parent of the year here. ffs, she's 10. She's annoying, so what. YTA.",
          "id": 64,
          "comments": [
            {
              "score": 46,
              "content": "No, she is not annoying, take it from a mother of 2. She is rude and disrespectful and I guess her behavior is reinforced at home.",
              "id": 65,
              "comments": [
                {
                  "score": -11,
                  "content": "Maybe all kids aren’t the same? It’s possible that the mother is a shitty parent - but it’s equally possible that she just happens to be a difficult child. I have three kids, of which one is super difficult. The other two are the nicest kids ever. Same parents, same rules, same upbringing. Sometimes people are just people.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This is why parents aren't supposed to parent all their children the same way. Treat your children as individuals and customize the parenting to eliminate disrespectful behavior.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "so, auntie doesn't need to look after an annoying kid if she doesn't want to",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "So we all just gotta accept she is harrassing people? No consequences for bad behavior..?",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "I raised two 10 year olds, a boy and a girl.  Not one of those examples is age appropriate or just “annoying”.  And you are doing any kid a disservice by dismissing that kind of behavior",
              "id": 70,
              "comments": [
                {
                  "score": 11,
                  "content": "I agree. I raised 4. None of them ever threw a tantrum at 10. They weren’t perfect, but they were out of the “terrible twos” by the time they hit kindergarten.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -9,
                  "content": "Maybe she has undiagnosed adhd? Maybe a trauma? What do we know.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Fair, but this is a parent issue, not an Auntie issue.  NTA",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -16,
                  "content": "good for you! Sometimes it's just luck. But if you want to keep throwing rocks at a 10yo girl, be my guess.  \n\n\n\"let him who is without sin cast the first stone\", Jesus would be downvoted here.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 6,
                      "content": "No one is throwing rocks at a kid.\n\nConsensus seems to be that the poor kid is the victim of poor parenting by a delusional mother (and maybe the father too) who’s of the opinion that acting like a spoiled two year old is the norm for most 10 year olds.\n\nIt’s not.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Seriously?  No one is throwing rocks.  What OP is doing is providing real life consequences to the child’s actions.  If this wasn’t a “family” issue, would you be okay with this kid doing what she did at a friend’s house.  Would you seriously tell those parents that they have to keep inviting her over even though she was rude, destructive, wasteful and mean?\n\nIsn’t it better to feel those consequences now, with family who will be open to allowing her back when/if she learns basic manners?  \n\nBecause if she did that to a friend’s family, not only would she never be asked back, her behavior would make the rounds and she would more than likely not be invited to anyone else’s home/party.  \n\nBut hey, keep making excuses.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Hey look found Kelly’s mom!",
              "id": 77,
              "comments": [
                {
                  "score": -15,
                  "content": "Lol you can downvote me how much you want to, who cares? You are a bunch of perfect people living perfect lives with perfect children rising up perfectly, good for you. We in the real world are a bit different and sometimes a 10 years old kid is just a 10 years old kid, not some \"brat\" that should be thought how to live. She got time to grow and mature, but I guess you were already such splendid kids at 10, no flows whatsoever. Good for you!",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "You're right, she's 10, and if her parents don't teach her consequences now, her behavior will only escalate. Kid don't wake up magically one day and stop with bad behavior all by themselves.",
              "id": 79,
              "comments": [
                {
                  "score": 0,
                  "content": "Can you please tell me where it is written that her parents aren't punishing her for her behavior on that one week end?\n\nMaybe she's grounded for what you know. But to erase her from family trips after the first one gone wrong is way over-reacting",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3221,
      "content": "NTA at all.\n\nThey raised a brat. Now they have to deal with the consequences of that. My guess is that she throws a lot of tantrums at home and they placate her by giving her whatever she wants. Also, being an only child likely hasn't helped.",
      "id": 81,
      "comments": [
        {
          "score": 841,
          "content": "Only child here. If I behaved like this when I was ten, I might've made an attempt to drown myself at the beach just to escape the embarrassment I'd feel when I stopped throwing a tantrum. We're not _all_ assholes.",
          "id": 82,
          "comments": [
            {
              "score": 291,
              "content": "They didn't mean that.  Only children by definition have less experience of sharing everything all the time no matter if you're at home, school, etc.  \n\nThe other two were used to sharing the TV and all that.  \n\nIt isn't about whether or not only children are brats.  That's down to parenting.  There is definitely a difference in experiences though, and having practice at 24/7 sharing definitely helps when you're expected to do it later.",
              "id": 83,
              "comments": [
                {
                  "score": 30,
                  "content": "Disagree. I’m an only child and I distinctly remember my parents telling me to *stop* sharing my things when I was a kid because I would give away my lunches and school supplies and then not have any. Then again my parents are fucked up, so idk.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 131,
                      "content": "I didn't say only children would be bad at sharing.  Each kid is different. \n\nI specifically said they'd have less experience at 24/7 sharing.  And nothing you said contradicted that.  \n\nWas there another kid that was always at home with you that you had to share with?  No?  Then there's less 24/7 experience with sharing by definition.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "My only child, who is 11, is also very generous with her friends. Perhaps because she’s an only child she gets more of the cool toys than her friends. So she gives them to her friends so they can all play together. I think it is incredibly sweet and I neither encourage her not discourage her from doing so.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I mean... no? I know plenty of people with siblings who never had to share (parents got them their own stuff) and lots of only children who spent a lot of time in daycare who HAD to share because everything there is communal.",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Hard disagree. I’m an only child. My parents put a lot of effort into making sure I was socialized with other children. I had no problem sharing, wouldn’t dare throw a tantrum. My daughter is an only child for now, just a toddler, and she loves sharing.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 3,
                      "content": "So many only children are replying to say things that have nothing to do with what I said.   You're another added to the list.  \n\nI didn't say only children can't share.  I didn't say only children weren't taught to share.  I didn't say only children are bad at sharing.  \n\nI said only children ***by definition*** are not constantly living with another child they have to share all their resources with.  \n\nUnless you're going to say there was another child in the home (in which case you wouldn't be an only child) then this is true.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 98,
              "content": "It's not about the only child, IMO.  It's about the parents.  They often don't know how to raise a kid to have the cooperative skills that children with siblings have.  Very rarely is the kid to blame in most situations, but the parents, who aren't meeting a need or teaching a skill.",
              "id": 90,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly.  My only child is six and hasn't thrown a tantrum since he was two, and even then he barely ever did.  Blaming acting like an asshole on being an only child is ridiculous.  A parent has to guide and teach any child on appropriate behaviour, only child or not. Sucks that your niece didn't receive that guidance, but you and your other niece and nephew don't need to suffer because of it.  I don't deserve any parent of the year award, but I work my ass off to help my child learn how to manage frustration, disappointment, anger, etc. in healthy ways.  Hopefully your niece does learn that from somebody as she grows up.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": ">I might've made an attempt to drown myself at the beach\n\nOnly kids... Always gotta be the center of attention. 🙄",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "My daughter is also an only child and she knew there would be hell to pay if she acted out like this. \n\nI knew how out of control kids annoyed the fuck out of me and made sure my kid wasn't one of them.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm sorry my comment came across the way it did. I was not at all suggesting all only children are like this kid. I was saying that, in her case, it was likely compounded by being an only child-- just her case. Sorry for the confusion.",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Drown yourself at the beach because it's all about you?\n\nYou're *still* an AH!",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Wow, what’s with the only child comment? Bit of a generalisation isn’t it? I’ve known only children with good manners and ones with siblings who don’t have manners. It’s upbringing and the parents too blame.",
          "id": 96,
          "comments": [
            {
              "score": 300,
              "content": "As an only child, I get it though : you grow up being more alone than with other children (physically, on trips with parents, at night) and are more used to alone time. At worst, you’re your parents center of attention and develop weird habits from that, good or bad.\n\nThe key phrase there was “likely hasn’t helped”, it’s not a blatant anti only child comment, but a remark on how it might amplify the bad in this situation…",
              "id": 97,
              "comments": [
                {
                  "score": 102,
                  "content": "Yeah, as an only child, at Kelly's age I was happy being in my room listening to music and reading books (terminal single mum). After mum passed (just before turning 11) I was forced to live with my aunt, uncle and 2 younger cousins (10M & 7F) and well let's just say there were alot of arguments and half of them I got introuble for not leaving my room and playing with my cousins (I was \"antisocial\" apparently).\n\nSo I can see where Kelly might have trouble interacting with her cousins but her behaviour reminds me more of my younger cousins (the 10M) entitled and spoilt behaviour (first born son could do no wrong-even when he threatened to stab me in the knee with a steak knife).",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "As an only child you would have spent more time with adults, in my experience these children have better manners because they learn from those around them.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 3,
                      "content": "As a teacher, I can say that this is quite often not the case. Only children are quite often starving for social interaction, and their being around adults quite often means being ignored. They often end up getting socialization at school and become withdrawn at home, as a result, which often curtails their ability to socialize at school. This compounds what ends up seeming like antisocial tendencies when it is in fact more of a forced seclusion. \n\nIn my experience, children with parents that teach them good manners have good manners. This is generally true of only children AND families with more than one child.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "That can be the case, sometimes they're more used to being alone or more used to being with friends. I knew a few only children who's parents would basically have them spend all of their time with friends/in clubs. Those kids saw their parents like 4-15 hours a week on average, long enough to pour them a bowl of cereal and get them in the bus and then serve them dinner (eaten in a different room, if everyone is even home). Those kids were feral and unraised, we *as their peer-aged friends* taught them proper hygiene because their smell started to get funky. Parenting style plays a massive role, but if you're neglected with older siblings there's at least some chance one of them will guide you or one of their friends/classmates will adopt you.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thank you for noting the \"likely hasn't helped\" part of my comment. Amplification is exactly what I was going for.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 74,
              "content": "Only children *can* be very selfish because they’ve not been forced to share. Typically, only children that are considerate tend to be ones that are close with cousins or friends or were in daycare to learn those skills there. It might be a generalisation, but it isn’t an unfair one. It’s not about being taught good manners, that’s a separate thing that entirely depends on parenting.",
              "id": 103,
              "comments": [
                {
                  "score": 73,
                  "content": "On the other hand, my only child would give away anything she has to someone in need of a smile. She's never had to deal with \"her\" things versus those that belong to other siblings at home, so she isn't really that possessive. I feel very fortunate that I've had enough resources to make her feel secure in that way. I'm pretty permissive and usually explain that if behavior X continues, we shouldn't expect reward Y. We always get Y anyway (so far), because I value her ability to process the mistake and move on. She's pretty tough on herself, so right now it's more about understanding what isn't acceptable and how we turn the situation around. \n\nGranted, she did daycare, and I think that's a very valid point. You have to socialize them somehow if you expect appropriate social behavior. At 10 years old, Kelly should have been in school for more than 4 years. That's plenty of time to overcome fit-throwing and tantrums, and I'm sure she has in the school context. I'm glad she's an only child--2 Kellys probably wouldn't be a lot different than 1 Kelly.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Honestly, I believe daycare is the key. My daughter is an only child and I heavily insisted on daycare. I believe it helped her a lot. And she loves to share her things (she actually gave a lot of her things to her friends when they came for her birthday party) and is always very nice when she is with others kids. Honestly, I believe her \"bratty\" moments happens more at home, specially since I told her that her room is her kingdom! My mistake...",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Same with our kiddo who is an only child.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Permissive parenting isn’t a brag.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Right! My daughter is an only child and she's very respectful, kind, caring, always on her best behavior out of the house and always thinking of others. If she gets a treat from the shop she'll eat half so she can give the other half to her friend the next day.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "As a teacher, many of my most aggressively spoiled kids have 1-2 siblings.",
              "id": 109,
              "comments": [
                {
                  "score": 5,
                  "content": "Same. And they’re almost never the middle kid lol",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I’m one of 4. My sister is the most spoiled brat in the universe. I went NC years ago, but at that point she had been married and divorced twice with 2 kids of her own and STILL throwing tantrums to her what she wanted. My only child is the most thoughtful empathic and caring person - she gladly shares everything she has to the point of depriving herself of things. And laments when she doesn’t have something to share with people who need it.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yeah, my actual 4 year old is an only child and she wouldn't behave like that. We might get one of those incidents over a weekend. Maybe 2 if she wasn't sleeping. But no other family member or friend looking after her would have a problem because she knows better.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "🙋🏻‍♀️ <only child with good manners raises hand> Thank you.",
              "id": 113,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -7,
              "content": "I’m a nanny and no matter how good parents are, there *is* going to be a difference between a child with siblings and a child without when they’re in situations where they have to act like siblings. At school or daycare, no. But around a small group of kids? Cousins or neighbors? Yeah, you can tell who doesn’t have siblings. Only children can be the best behaved kid on the planet and they’re still not going to understand implicit dynamics children with siblings get. Taking turns with choosing television shows. Order of service- the baby goes first or the oldest goes first but an only child is ALWAYS first- or how to interact with kids in different age groups. Can’t tell you how many only children I’ve babysat who can play with kids their own age just fine but bowl a toddler over without a second thought. It’s not always parenting and it’s not always a slight on the kid, they’re just used to a different kind of family. \n\nIn OP’s situation, it’s definitely parenting. But it’s absurd to claim that there isn’t growth a sibling gets that an only child can’t.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Gonna jump in here. Only child myself. When I got to hang out with my cousins and aunt and uncle I loved being there and was on my best behavior. At ten years old this is a parenting problem, not an only child problem. Child has no boundaries because parents chose not to enforce them.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Only child, there's NO way I would have acted like this child has.",
          "id": 116,
          "comments": [
            {
              "score": 2,
              "content": "Because you were likely raised by good parents instead of crappy ones like this kid has.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "My daughter is 6, she's an only child and she is usually very well behaved. I say usually because she's 6 and still has a lot to learn. Being an only child is not an excuse. On the contrary, my husband and I have more time to teach her and be her parents! \n\nI hope she remains an only child. Because her parents are not parenting.",
          "id": 118,
          "comments": [
            {
              "score": 2,
              "content": "You are good parents. They are not. Because they aren't, her being an only child compounds the issue. I'm a teacher. I know plenty of completely well-adjusted only children. I know plenty that aren't well-adjusted. Similarly, the same can be said of siblings. The thing is that when siblings are brats, it tends not to compound the bratty behavior because they are often in competition with each other. It's just something I've noticed over a long career.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": ">being an only child likely hasn't helped\n\nI agree otherwise but this is wrong.",
          "id": 120,
          "comments": [
            {
              "score": 14,
              "content": "Ditto. Everything was spot on till the end. I have an only child and we have several only child family friends.  Our kids are generally the best behaved. Usually it’s the 3 sibling kids that are the worst because by then the parents are too exhausted to follow through with things",
              "id": 121,
              "comments": [
                {
                  "score": 2,
                  "content": "Bingo.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "r/happilyOAD",
                  "id": 123,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh I hadn’t found this one yet! Love the happily, I always feel weird when people have negative feelings about having a family of 3",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "It's spot on through the end. You misinterpreted what I said. I was speaking about her situation specifically, not generalizing about only children.",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "No, it's likely right. She's a spoiled brat, not because she's an only child, but since she is, it's likely compounding the issues the parents are creating in their child.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Its mind boggling how lots of concepts of dog training are the same as with humans and especially kids. \n\nAn important one is to be consequent. Action = reaction. If you do this, this happens AND the important part: then it really does have to happen. \n\nWhat you are teaching kids by giving in to their tantrums is:  tantrum = I get what I want",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I raised an only.  He is the most well behaved person, now young adult.  Everyone (not just family) comment on this, as that is how he was raised.\n\nThis isn't about the number of children, it could be that this child is a handful and the parents didn't want to have another child because of it.  Or they could be parenting  poorly.  There are many reasons.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Only child here and my mom would have whooped my ass if I behaved like that with her or anyone else. There's no excuse. NTA",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1631,
      "content": "NTA - her parents have excused her bad behavior to the point a 6 year old acted better then a 10 year old. This is beyond 'being an exception to their age' unless there is a developmental delay not noted in the post? If so, then it may just not be the right time for overnight trips for her.\nYou are not obligated to put up with bad behavior when trying to do something fun and nice for your nephews and nieces. She is learning that her actions have consequences.",
      "id": 130,
      "comments": [
        {
          "score": 303,
          "content": "Exactly. She wasn’t just “acting like a 10 year old.” The younger child behaved better, and so did the child who was only a year older.",
          "id": 131,
          "comments": [
            {
              "score": 165,
              "content": "She obviously has some learned behaviours from her parents; being rude to the waitress and giving a sarky reply",
              "id": 132,
              "comments": [
                {
                  "score": 2,
                  "content": "This! A 10yo being rude to a waitress is a huge red flag for me. She’s not coming up with stuff like that on her own.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Seriously. And at that age, I KNEW that I wanted to be on my very best behavior if I was doing a special thing with other adults. A childish outburst or two is expected, but it sounds like Kelly was pathologically bad.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah, what a surprise, seemingly good parents raised well behaved kids, and shitty parents raised shitty children. Who would have thought",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "“Oh well the other two are just more mature for their age.”\n\n“Exactly!”\n\nIf you wanted to be treated with more opportunities then you need to act more appropriately. I would’ve been grounded by auntie and uncle. I was *that* picky child and I was not allowed to get away with anything. I think it also helps that my Uncle was scarier (villain facial hair). 😂",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": ">unless there is a developmental delay not noted in the post?\n\nKelly has not shown any signs of a developmental delay or other mental disability, at least not to my or my husband's knowledge.\n\n>If so, then it may just not be the right time for overnight trips for her. \n\nIf Kelly shows us that she has matured, then we will plan another short overnight trip possibly next year. But because of her recent behavior on the weekend trip, she will not be joining us on our August trip.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Or there could be something causing the social issues. Like ADHD.",
          "id": 138,
          "comments": [
            {
              "score": 6,
              "content": "Which would be a developmental delay",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I have a kid with ADHD and she isn’t a little prick like Kelly",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 990,
      "content": "Kelly behaves worse than my 3 year old nephew. This sounds like the find out stage of fucking around. NTA",
      "id": 141,
      "comments": [
        {
          "score": 131,
          "content": "I was thinking the same thing.  My niece will be 4 in a few months and she behaves better than Kelly.",
          "id": 142,
          "comments": [
            {
              "score": 56,
              "content": "I have two 3 year old nieces, and they both behave better than Kelly. And one of them is an only child so no experience with siblings, but she still behaves better than Kelly when she's with her cousins.",
              "id": 143,
              "comments": [
                {
                  "score": 2,
                  "content": "I have a 2 1/2 year old and she acts exactly like Kelly lol. Last night she laid on our rough concrete outside, wearing only a diaper, and caterwauled because she couldn’t get her shoes on. When I asked if she wanted helped she howled louder. When I tried to pick up her foot to put her shoe on she yanked it away and hurt it and howled louder. When I ignored her she kept on crying. Finally I picked her up and she was fine. Gotta love this age lol.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "My 4 year old autistic daughter (who I am very proud of) is better behaved. She'll throw tantrums, all kids at that age do, but she would *never* purposefully hurt or instigate someone else.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Joining the club 🤗 mine are: boy 4 and girl is 3, still better behaved then Kelly",
          "id": 146,
          "comments": [
            {
              "score": 23,
              "content": "My kids were angels with other people - at home not so much. 🧐",
              "id": 147,
              "comments": [
                {
                  "score": 17,
                  "content": "Street angel, house devil. There's a lot of that going around! :D",
                  "id": 148,
                  "comments": [
                    {
                      "score": 19,
                      "content": "It’s kind of a compliment - they feel secure enough at home to test the boundaries a bit. Tho that doesn’t make it any less frustrating some days.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That was my sister. Holy terror at home, perfectly fine with other people. Probably because she knew it was a privilege, not a right. Parents have to put up with your shit, to some degree. Relatives, teachers, babysitters, or friends’ parents? Not so much.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "At least you admit it.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Hahaha! I hear this (with a 4yo). It’s like they gaslight us.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I have 2 year old twins and they only throw tantrums when they are very overwhelmed.\n\n\nWe never have problems taking them on weeklong vacations.",
          "id": 153,
          "comments": [
            {
              "score": 16,
              "content": "I’ll say there is a stage after toddler hood where there’s a bit more resistance and tendency to throw a tantrum. Like they start being more aware of their surroundings and want to do more but it shouldn’t lead to what OP describes and it is definitely something that’s resolved by like 5-6 year olds",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 741,
      "content": "NTA. You don’t owe your nieces and nephews vacations. Kelly didn’t earn the privilege. Allan and Ava did. Leave her the opportunity to show she’s changed in the future, and maybe she’ll catch the next vacation.",
      "id": 155,
      "comments": [
        {
          "score": 115,
          "content": "I think this is important- give her the opportunity to show she’s changed. OP can you take Kelly away on her own mini trip and see how she behaves then? Was the behaviour different to how she behaves at your house?",
          "id": 156,
          "comments": [
            {
              "score": 88,
              "content": "Why would they have to suffer through a mini trip with Kelly just to see if she has changed?",
              "id": 157,
              "comments": [
                {
                  "score": 40,
                  "content": "The mini trip could just as well be a sleepover at auntie’s and uncle’s , the purpose was to see if her behaviour was different 1:1. To see if behaviour changes, they would have to take them **all** away to see if it changed.  OP says they love to spend time with their nieces and nephews *including* Kelly, so this indicates to me that Kelly doesn’t always behave the way she did on the trip, I would be trying to find out what was it in that trip that specifically Kelly found challenging. Maybe Kelly normally spends time 1:1 and not with Alan and Ava, maybe she has something like autism where she struggles with increased noise, different surroundings, things not going how she expects them eg schedule for ice cream. Yea it could be bratty behaviour, but I would be thinking about those other things too. I also think that just expecting Kelly’s behaviour to just change is likely to be unsuccessful unless expectations are spelled out to her. If it is ‘just’ behavioural, that will have come from how parents treat her and she’s not independently going to understand where she’s gone wrong. So they will need to help her think it through and think her emotions through.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Yeah , the aunt and uncle are under no obligation to “help” Kelly through anything. Loving to spend time with her might also mean, visit her in her house or have her over for a few hours, not overnight and not on holidays. \nIf the parents encourage the behaviour and don’t try to find the route of the problem then why they aunt and uncle have to try anything? Especially when it involves spending their money on Kelly . \nFamily doesn’t mean that you owe anyone anything , and especially when they act like this .",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Because she's a fucking kid. Kids change. Fast. Locking in a lifetime position on her behaviour at age ten is ridiculous.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "The only reason is if OP still wants a relationship with Kelly that includes these trips.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 71,
              "content": "Won’t be a true test - no one to pick fights with or harass.",
              "id": 162,
              "comments": [
                {
                  "score": 9,
                  "content": "Agreed, it would have to be with the other two or it wouldn’t be a true test.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "I think the bigger problem here, and why OP is right to continue to be wary, is that Kelly's mother gave no indication that she took Kelly's bad behavior seriously, or would do anything to help correct it, or work on getting Kelly to behave better.\n\nHow likely is it that Kelly will spontaneously start behaving better, if her parent doesn't even see anything wrong with what she did? (instead excusing it due to her age.)  That's the issue, right there.\n\nI also have to think that Kelly must not have misbehaved in other situations, like shorter visits or family get togethers, as OP wasn't expecting this level of misbehavior at all.  Kelly's prior behavior didn't seem to ring alarm bells for OP, which is why they were so taken aback by the way she behaved on the trip.",
              "id": 164,
              "comments": [
                {
                  "score": 12,
                  "content": "Exactly, the child won’t just change if the parents won’t start to parent her. And the sister doesn’t seem to want to do it.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "That is a reward not a test . She is 10 not 2. She is a bully and has zero respect .",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This nta, this is a great lesson for Kelly, she should 100% know she isn’t invited on this vacation because of her disrespectful behavior on last years vacation. Op if you want maybe tell them if Kelly behaves well and proves herself in the next upcoming outing. Her coming along on vacations can be revisited next year.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 195,
      "content": "NTA, if she wants her to go away with other people she should teach her how to behave while she is gone. It is unacceptable for her to act that way, especially away from home. You made the right decision",
      "id": 168,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 186,
      "content": "NTA it sounds to me like Kelly has a case of only child syndrome. I don’t blame you for not wanting to be responsible for her on overnight trips anymore. You made it clear what your reasons were. If your sister wants to be upset, she can be but you did the right thing.",
      "id": 169,
      "comments": [
        {
          "score": 232,
          "content": "Oy vay, I am an only child. I never behaved like this. This is bad parenting rather than a lack of siblings. \n\nI wouldn't take Kelly again until she's shown improvement in behaviour.",
          "id": 170,
          "comments": [
            {
              "score": 90,
              "content": "[deleted]",
              "id": 171,
              "comments": [
                {
                  "score": 9,
                  "content": "Hmm, about, 1.23783 per average week day?!? 🤔 \n\n🤣🫠🤪",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Jup I have a 6-year-old only child and have just got back from a 2-week vacation and she behaved better than Kelly in this story!",
              "id": 173,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "RIGHT. My child was an only child for over 10 years, they NEVER behaved this way",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "I find that term \"only child syndrome\" offensive and ignorant. I'm an only child and I never ever behaved like that. Adults loved me, because I was polite, calm, never demanding, quiet, but happy. I never dared to disrepect any adult, as my mother would have punished me for any bad behaviour. Funnily enough, the brats I knew and grew up with were the ones with siblings, that one spoilt golden child. I only knew one spoilt only child, the rest were the ones who had siblings. Even if Kelly were ever promoted to big sister, she would still not be parented correctly.\n\nEdit: because my mum was a single parent working full time, some of the other mum's at primary school always offered to have me at their homes after school, because they knew I would not play up and was therefore an easy house guest.",
          "id": 175,
          "comments": [
            {
              "score": 29,
              "content": "Yes I agree with you, it is offensive and ignorant.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I find with only children it's often 1 or the other. I know many \"only children\" and they pretty much all fall under 2 categories\" \"only child syndrome\" in which they're self centered, need constant attention and acknowledgement/validation and feel that their feelings and needs should come before anyone else (because that's how it functioned in their household growing up) OR they are mature, polite and easy going attitudes. Really depends on how their parents dealt with them, many parents to only children are overly doting with a \"my child is so perfect and can do no wrong!\" attitude which often results in \"only child syndrome\". Then there's the parents who treat their kids like little adults and place a lot higher expectations for them and those kids often turn out to be more mature and sometimes people pleasing as opposed to the selfish \"OCS\" kids. I see kids of multiple more varied and can go many ways depending on factors like age differences, their placement( oldest, middle, youngest), whether they share both bio parents, how many siblings there are etc.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "In my experience, the only child kids I know are better behaved than those with siblings close in age.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">only child syndrome\n\nWrong. On average, only children are less selfish because they're not used to having to compete for resources all the time, and more mature because they spend relatively more time in the company of adults.\n\nr/happilyOAD",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I'm an only child, and I've had my rear end whooped for not even throwing a tantrum, but just BEGINNING to whine about not getting something I wanted. Another time, I was poking a crab in my aunt's aquarium, and when the FIRST warning from my parents was disregarded, a cane came right to my rear end just 10 seconds after the first warning was disregarded. Due to this stern discipline, I learnt how to behave, how not to test people's patience, and how to respect boundaries and rules.\n\nBeing an only child is one matter. Being a WELL-BEHAVED only child is a totally separate matter.",
          "id": 180,
          "comments": [
            {
              "score": 23,
              "content": "Sorry that your parents abused you. Sounds really frightening.",
              "id": 181,
              "comments": [
                {
                  "score": 0,
                  "content": "Look, they didn't abuse me, ok? They disciplined me - which was heavy-handed, I'll give you that. However, please note - they DID warn me about unacceptable behaviour, BEFORE I went out with them anywhere. And, they DID always give me a warning before starting the discipline.\n\nAs for whining, they always had told me, if they said no to an \"I want!\" from me, no ALWAYS means NO. Whining would only invite discipline, and they said I could feel free to appeal my request, and if I could give a good reason WITHOUT whining, they might consider. The offense here was choosing to whine instead of talking properly. They also made it clear - in the event of a tantrum, it proves I'm out of control, and they would have to discipline me to put my behaviour in order.\n\nAt any rates, I don't know why you categorise this as abuse, because at any rates they called a conclusive stop to it the moment my age entered the double digits (10 and beyond). They started timeouts, grounding and cutting off PC game time after that. I don't call it abuse. I call it heavy-handed discipline. While I won't do the same to my son (who I'll be welcoming into this world in Oct), I appreciate how it made me respect boundaries, and how it taught me to behave myself.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 7,
                      "content": "They're calling it abuse because there is never a good reason to hit a child--*never*.\n\nMultiple studies have shown that spanking has long-term, negative impacts on developing brains.  It increases the chance of mental health issues immediately but also later down the line.  Don't take my word for it: search for \"spanking studies\" and you'll see.",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Sorry hitting kids is abuse. I went to college for childhood education. Just cause you feel like you weren't abused doesn't make it true. I'm actually horrified reading this.",
                      "id": 184,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Okay, no, that's abuse, not discipline. I was told - verbal only, but very firmly - how to behave on outings etc as an only child, because my mother was a single parent who had to take me to her work often because she lacked a babysitter. I behaved myself just fine without a \"whooping\". I got hit for other things, but you know what? I was more likely to repeat the behaviour that got me hit than the stuff that was explained calmly but firmly, because I panicked so much over having done something that would get me hit that I didn't think clearly and compounded the problem. Or I got resentful and tried to hide what I did, just to have the control of getting away with something. Physical violence is not an answer, and causes way more problems than it solves. I am sorry this happened to you, and that you were forced to feel grateful for the abuse you received.",
              "id": 185,
              "comments": [
                {
                  "score": 2,
                  "content": "A cane to the bottom is not abuse.  Physical punishment doesn’t cross the line into abuse until the parent is striking/punching the child just because they have an anger management issue or they hate Mondays or something \n.",
                  "id": 186,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "I beg to differ. It was not abuse. Granted it was a bit stern, and granted, I will not do the same to my son (who will arrive in Oct). But I feel it did have a lot of positive effects in shaping my character and manners. Could my parents have done it a bit lighter? Sure. Was it heavy-handed on their part? Oh yes of course. But I can see how it made me a better person, and while I definitely won't repeat on my son what they did to me, I am thankful that their discipline established clear and firm boundaries for my behaviour.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You can (and should!) absolutely establish clear and firm boundaries for children's behavior.  However, that can (and should!) be done non-violently.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Oh, please. Any child can become a brat whether they have siblings or not. My only child never behaved like that. This is a parenting issue not an only child issue.",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "My daughter is almost 6 and an only child. While she occasionally has some trouble sharing, she already behaves better than this.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I’m not sure this is generalisable. Kelly might have a case of “not enough assertive parenting”.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "My son was raised an only child and is the most well mannered kid I’ve ever met.  It’s about the parenting, not the amount of kids.  My 2nd son died at birth and I couldn’t have any more.  Luckily I didn’t let that stop me from raising my living child not to be an asshole!",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -48,
          "content": "Considering she's one of three,  basic math clearly proves she's got multiple child/ lack of attention syndrome.😂",
          "id": 193,
          "comments": [
            {
              "score": 32,
              "content": "She's one of three cousins, but still an only child.",
              "id": 194,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Allan and Ava are Kelly's cousins, not siblings.",
              "id": 195,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Basic reading comprehension",
              "id": 196,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 172,
      "content": "NTA - yeah, I wouldn’t invite her either. Maybe try again the next year with a short trip, and make it very clear to your sister that if it goes badly again you’ll be done. Yeah she’s still just a kid, but 10 is old enough to behave for one weekend for your aunt and uncle. \n\nIn my experience kids usually behave *better* for people that aren’t their parents, I can only imagine what goes on at home. Kids let it allll out with the people they feel the most comfortable with, but I have a feeling Kelly’s behavior is a direct result of being an over indulged only child.",
      "id": 197,
      "comments": [
        {
          "score": 15,
          "content": "My SIL just invited my two oldest to spend the night so our kids could play together. When I dropped them off I told them to act in a way that makes their aunt want to have them over again.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 107,
      "content": ">She says Allan and Ava may be mature/calm for their ages but I am out of line to punish Kelly for not being the exception to her age\n\nKelly IS an exception to her age; most ten-year-olds behave better than that. Also, you aren't \"punishing\" her; you're just declining to reward her bad behavior or allow her to ruin everybody else's trip. Your sister's notion that Kelly's behavior is perfectly acceptable undoubtedly goes a long way toward explaining that behavior. NTA.",
      "id": 199,
      "comments": [
        {
          "score": 25,
          "content": "Yeah, sounds to me like the sister consistently overindulges Kelly/excuses everything she does because she’s ‘just a kid’. Of course Kelly responds to that by behaving in other settings the way she’s been taught to behave at home. Of course a kid is gonna throw a fit to get ice cream if she’s learnt that doing so makes the treat arrive faster. Of course she’s going to throw a fit about the things she wants to buy if she’s learnt that mom and dad will buy the extra one for her if she looks upset.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "Nta kelly needs serious social skills which is on her parents not you, they’re just bitter they don’t get a break from her",
      "id": 201,
      "comments": [],
      "relation": "Support"
    }
  ]
}