{
  "post content": "I (34m) did not buy or get anything for my wife on Mother’s Day and let me explain why. My wife and her friend planned a trip to the beach for four days which fell on Mothers Day. So I thought to myself that since I’m watching the kids while she’s gone that would count as a gift since she wouldn’t be here to celebrate that day and would get home that night on Mother’s Day. She gets home and realizes that I didn’t do anything for her and later tells me that she is upset and message was received loud and clear. I tried to explain my reasoning and thought process but she didn’t agree.\nSo AITA?\n\nEDIT: I worded this badly and not enough background. Instead of watching I should’ve said taking care of the house and kids. Her going to the beach is what I thought she wanted to do for Mother’s Day and me taking care of everything was enough because we pretty much split everything 50/50, she cooks more and I clean more. She wasn’t expecting gifts but acknowledgement of her is what she was looking for but again her being gone that day I thought that it didn’t mean that much and wasn’t expecting anything. She didn’t speak to me for 4 days after I apologized. Eventually we talked it out and admitted my mistakes for not communicating with her. I want to thank all the people that gave advice and actual conversations and didn’t take personal shots and for the ones that did I was being sarcastic in my responses.\n\n\nUPDATE: She got me a Father’s Day gift and it was not divorce papers.",
  "id": 1,
  "comments": [
    {
      "score": 48488,
      "content": "YTA\n\nTaking care of the kids should be part of your regular duties, not a present/gift.",
      "id": 2,
      "comments": [
        {
          "score": 7721,
          "content": "Very succinctly stated. Agree 100%",
          "id": 3,
          "comments": [
            {
              "score": 5883,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 3462,
                  "content": "Say it louder for the people in the back. OP THIS WASNT A GIFT, ITS CALLED PARENTING. Are you actually saying that you think caring for your kids is a gift to your wife? News flash: you are only doing what SHE has to do every damn day. Now go out and get some Godiva Chocolate and flowers and stop taking your wife for granted. YTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1846,
                      "content": "At this point i think jewelry is required.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 565,
                      "content": "And coulda also spent some time with the kids making cards or something from the kids, would be meaningful to her too. At the very least some flowers from the OP.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "You don’t know their family dynamic. If I took four days away with a friend while my wife flew solo with the kids, I would absolutely look at it as a gift.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Or maybe to explain better to OP (and other guys), if the wife takes care of the kids one Saturday while you go out with a guy friend, or to the office on a rush, or any other reason, does that count as a gift for a birthday or Christmas?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "She solo parents every day? Did OP say he lives in another city or something?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1294,
                  "content": "My husband flew home to help his mom all last week. I watched kiddo alone. Somehow it never occurred to me that this was a \"gift\" to him. OP, you're TA. So big.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 258,
                      "content": "That was your husband's Father's day present and don't you forget it! /s",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "[removed]",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Your gift was to your Mother-in-Law.  You covered your husband's responsibilities at home in addition to yours, so he was free to spend a week helping his mother. Which was very generous of you.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 495,
                  "content": "Thank you!\n\nHe is the father, not the babysitter!\n\nYou're supposed to watch your own kids, sir!",
                  "id": 15,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I'm so happy not to be alone in thinking: you're the father,  you're not doing her a favor,  these are your kids too.\n\nSmh and I'm an auntie, I think op is an asshole",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 494,
                  "content": "Way too many fathers want an award ceremony for doing the bare minimum when it comes to taking care of their kids.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "EXACTLY!  Watching *your own kids* is not a gift OR considered “babysitting”",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "You all are so fixated over taking care of the kids part and willfully ignored the context. OP's wife had the opportunity to take a 4 day vacation trip just for her. She gets to enjoy 4 days of having fun while OP is taking care of all household responsibilities, which is more than watching the kids. Whether it's 4 days at the beach or 4 days at the spa, she did get a very enjoyable \"Mother's Day\" that lasted for more than a day.\n\nIt's another relationship situation on this sub. This situation can't judged accurately since the family dynamic isn't understood. Neither is what he gets for Father's Day. Like most relationship gripes on Reddit, everyone's filling in the blanks with assumptions.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I posted this elsewhere on this thread, but a four day trip away from the house would be an amazing father's day gift, I would love it. Just give me the weekend by myself, it was be the best gift ever.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Sort of like a trip away from the family and kids that everyone seems to just glance over…",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 198,
              "content": "[removed]",
              "id": 22,
              "comments": [
                {
                  "score": 509,
                  "content": "1000% not made up. Many men are like this. My husband put dishes in the dishwasher and did 5 loads of laundry and when I said I didn’t feel like I was treated the way I deserved he said “well I did those things for you and told you that you can go get food for dinner” yet he left me with 5 loads of laundry to put away on my own and a dishwasher to empty.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 194,
                      "content": "My dad has always shared housework, but he still sometimes says things like “I’ll do the dishes for you” to my mom. I always say something if he does this around me. Saying “for you” implies it’s my mom’s job instead of part of managing their shared household. \n\nSame thing about “watching” the kids. This was not a gift. It’s part of your responsibility for the children you helped create.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Lol putting the clothes in the machine is the easiest part.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "And the “gift” is you don’t have to cook dinner but are still expected to provide it. 🤦🏼‍♀️",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Mine wants a fucking participation trophy if he unloads the dishwasher, but he still has to ask me where to put anything but plates, bowls or cutlery.  We have lived in our house for a solid year; we have no children and both work from home. This should be a pretty easy split/shared situ, right? \\*snort\\* He asked me last week where I keep the vacuum cleaner.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 458,
                  "content": "My husband told my kids he didn’t get me a gift because he didn’t need to, that his gift to me was the children and I have never felt less valued or appreciated in my life.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 742,
                      "content": "Girl, give yourself the gift of ✨divorce✨",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 430,
                      "content": "Buy yourself something really nice on Father’s Day - have the kids make up cards for you on Father’s Day…make Father’s Day all about celebrating yourself and your children for allowing him to be the sperm donor.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 94,
                      "content": ">his gift to me was the children\n\nWTF. 30 seconds of effort from him and 9 months of effort from you, and HE gave YOU the kids?",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 40,
                      "content": "Damn dude. Did you thank him for allowing you to have sex with him and then allowing you to be the lucky pick to carry his kids for nine months?  Luckyyyyyy",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "I haven't received any gifts from my husband in years. My kids didn't get me gifts either.  They are over 21 and live at home. \nWe went out for dinner and evidently that is considered my gift. \n\nIt is painful and makes me wonder why I bother at all.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Lord. My husband said this to me a couple weeks ago *as a joke.* Then he proceeded to give me a wonderful relaxing day yesterday with a yummy dinner I had requested.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Have you seen the SNL skit \"Christmas Morning,\" also known as \"I Got a Robe\"? Show it to your husband maybe it'll show him how inconsiderate he was.\n\nhttps://youtu.be/FOVCtUdaMCU",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My husband said, “Sorry, I didn’t have time to get anything”. Um, all this time on TikTok or Xbox you could’ve been on Amazon at least.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "The only time my ex did anything for Mother's Day was performative, if other people were going to be around. Otherwise, \"you're not MY mom, it's the kid's job to do something for you.\"",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 201,
                  "content": "I don't know, I made the mistake of not getting my wife anything for Mother's Day one year. My thought process was, you're not *my* mother, and I did get gifts on behalf of the child. She yelled at me and said maybe I'm not your mother, but **I'm the mother of your child**. I'm pretty dense sometimes, but I completely understood when she put it like that. I apologized (and by that I mean I groveled at her feet) and never made that mistake again.\n\nEdit: changed a few things after I remembered more about the situation.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I actually agree with your original thought. Mother’s Day is when the children gift their parents, the father need only assist until the kid is old enough to do it on their own. My husband makes sure my daughter makes me something (a card or a craft), and then I get to choose what we order for dinner. I am not his mother, I don’t think he needs to give me a gift or a card or do something over and above.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "What does she usually do for you on fathers day? It'd be weird if you didn't feel the need to repay her for the things she's done.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I'm a mom. I dont expect my husband to gift me mothers day gifts. I expect him to help our kids pick out gifts. I'm not his mom, I'm our children's mom. Unless I misunderstood, it sounds like you did that.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My (ex) husband went a step better than you. When our children were very small he refused to buy me mothers day gifts/cards, even on their, behalf because \"you're not my mother - they can buy their own when they're old enough. It'll feel more special\".\n\nHe never ever bought me one from him",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Lol this is extremely common",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 192,
              "content": "Precisely. One cannot “watch their own children” as a gift ffs. That’s literally like telling someone you are going to convert CO2 to O2 as a gift.",
              "id": 45,
              "comments": [
                {
                  "score": 79,
                  "content": "Guess I should go thank some trees 😂",
                  "id": 46,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Always. Wait, you don’t? \n\n*Sheeeet* I think we tree differently",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Taking care of 4 kids solo while your wife goes on a beach vacation is absolutely a gift. Don’t know what planet you live on, but when I go out of town to hang with friends for 4 days I consider it a pretty huge favor my wife is doing me.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Actually, that would be quite the gift if someone converted CO2 to O2 for me.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "If dad left for an entire weekend, would mom be asked to do any more than her usual \"fair share\"? I don't understand why all the women are up in arms here. If my wife wants to leave me ALONE for an entire weekend, that would be a gift to her. If I want to leave her ALONE for an entire weekend (other than work) that would be a gift to me. It's not like he's \"babysitting\" but he is shouldering the entire household burden while she sits on a damn beach. Sure sounds like a gift to me. If my wife was like \"hey do you want to just get away for like the entire day and do whatever you want?\" I would probably cry because she's never gotten me exactly what I want before and it would 100% feel like a gift, most likely with strings attached lol. It makes me sick that people are saying OPs wife should divorce him over this. What is the world coming to?",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "He didn't just watch his kids for a few hours. It was for 4 days straight with no breaks. \n\nSomething tells me you wouldn't be so dismissive if it was his wife watching the kids for 4 days straight.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "[removed]",
              "id": 52,
              "comments": [
                {
                  "score": 4,
                  "content": "u/Wonderfulde is a bot.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "So just to be clear: If I go on a fishing trip with my friends for a weekend and leave my wife at home to take care of our kids by herself while I drink beers and float on a river, then she is \"just doing her job\" and isn't owed anything for allowing me to take time to myself? Is that what you are saying here?",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1544,
          "content": "Surprised he didn’t say he was “babysitting” the kids.  YTA.",
          "id": 55,
          "comments": [
            {
              "score": 589,
              "content": "As a dad, it pisses me off so badly when people say I'm babysitting my kids.",
              "id": 56,
              "comments": [
                {
                  "score": 114,
                  "content": "Of course you’re not a baby sitter \n\nYou’re not getting paid duh",
                  "id": 57,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Getting paid is nothing to do with it - you can't babysit your own kids, but you can babysit nieces and nephews.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "People like OP make all dads look bad.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 3,
                      "content": "People like OP's wife make mother's look selfish and unreasonable.",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 974,
          "content": "Why do dads think that caring for their own kids deserves special recognition?  We need to stop handing out gold stars for mediocrity.",
          "id": 61,
          "comments": [
            {
              "score": 217,
              "content": "Lol and they wonder why birth rates are declining. We're not doing it all any more.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "The bar is in hell",
              "id": 63,
              "comments": [
                {
                  "score": 7,
                  "content": "And somehow people are still smacking their heads into it.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 561,
          "content": "So I don’t know if I get this. If I went on a four day trip and left my kids with my wife for the whole time, I would consider that a HUGE gift. Watching the kids is both of our jobs so if one of us were to hand off those duties for half a week so the other had to do double that’s a lot of work. If the genders were reversed would you still say this?",
          "id": 65,
          "comments": [
            {
              "score": 701,
              "content": "Reverse the genders and most people wouldn’t bat an eye. There’s this expectation that taking care of the kids is mom’s job and a dad’s choice. Dads tend to get brownie points for occasionally doing what Moms do on a daily basis. \n\nI’ll never forget the time my husband was deemed “Father of the Year” by a group of women for simply having braided our daughter’s hair and taking her trick or treating, things I had always done as a matter of course.",
              "id": 66,
              "comments": [
                {
                  "score": 161,
                  "content": "Yeah I’m baffled here. My wife looking after the kids for four days while I have a mini vacation sounds much better than a card.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 66,
                      "content": "I'm not really a gift person, so I tried to talk my kids into taking their dad to a movie and leaving me alone for 3 hours on Mother's Day as my present.  My husband said that wasn't a gift.  I don't know what I would do with 4 days to myself, but I definitely wouldn't expect a card!",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "If you talk about it beforehand and put it that way, okay. “Hey, you’ve been wanting to go to [place] with [friend] — what would you think of making that happen as a Mother’s Day gift from me and the kids?” Then when she gets home she also gets handmade cards from the kids or something. \n\nThe OP’s fault was taking something that they’d already agreed to (her going on the trip) and retroactively turning taking care of their mutual kids into a present. Not cool.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "If a guy went off with his buddies for 4 days and left the wife with the kids, people wouldn’t frame it as an “expected duty” of the wife.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 196,
                      "content": "No one would frame it that way; it would just be taken for granted. No one praises Mom for taking care of the kids by herself when Dad is away. However, they *will* praise Dad for taking care of the kids while Mom is away. Many will respond that Mom is lucky for having such a wonderful husband who would do such a thing. Worse, many will call her selfish for taking a trip and leaving the kids with their dad.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "In fact, we'd have people here calling that guy TA too!",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "I don't think so. If Dad was going on a business trip, maybe. \n\nBut if Dad was going on a 4 day fishing trip, the comments would be all \"That's really unfair, when do YOU get to go on a 4 day spa trip?\" to the wife and imply that the responsibility of taking care of the kids was really unbalanced because Dad went away for 4 days.\n\nParents should share the parenting 50/50 but going away by choice for several days so the other parent has to do a long stretch of solo parenting is an imposition, and the other parent is doing a favor.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 3,
                      "content": "OP SPECIFICALLY said that he, himself alone, decided her vacation was a really good “gift”. \n\nAt no point did he mention that that was the discussed plan and the wife was understandably upset that no forethought was obvious; until AFTER she returned home and was understandably upset.\n\nBuddy didn’t clue her into his thought process until then. Dude is clueless AND an AH for being so obtuse.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Absolutely not.  If a guy posted here that he was going on a trip for four days and still expected a present for father's day, he would get buried in downvotes.  That is ridiculous",
                  "id": 75,
                  "comments": [
                    {
                      "score": 7,
                      "content": "He'd probably still get one though and that's the rub.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 275,
              "content": "Yes, absolutely. Looking after kids solo for four days is a huge undertaking and I wouldn’t undersell that, but further down thread op explains that she looks after the kids most Sundays, so while this four day stretch is certainly challenging I don’t think it should be viewed as hugely notable. Also, it defo could’ve been communicated prior to the trip if it’s intended as the gift. Op says they don’t care about gifts, that’s fine, but clearly wife does and I don’t think a card etc is too much to ask for.",
              "id": 77,
              "comments": [
                {
                  "score": 81,
                  "content": "ikr? not to mention....it was MOTHER'S DAY FFS. \n\nif you can't even make the effort to do something special for the mother of your children on mother's day, you are a lost cause.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 11,
                      "content": "> it was MOTHER'S DAY FFS.\n\nThis is kinda baffling to me. Up until literally this week, I have *never* seen anyone treat Mother's Day (OR Father's Day) with anywhere *near* this level of importance. But suddenly, this year, it's like it's suddenly the world's most important holiday.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "> if you can't even make the effort to do something special for the mother of your children on mother's day, you are a lost cause.\n\nThe mother just came back from a child-free 4 day beach vacation so I'm not sure what the expectation is here.",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 207,
              "content": "It still isn’t recognition of the holiday—or at least discuss it ahead of time so everybody was on the same page. Why didn’t OP say to his wife,”Hey, since it’s going to just be me single-teaming the kids and you’ll be gone on Mother’s Day, I was thinking of keeping it lowkey and just having the kids do stuff for you. Is that okay?” Why don’t couples just talk to each other? 90% of the couple issues on this sun wouldn’t exist if people communicates.",
              "id": 81,
              "comments": [
                {
                  "score": 49,
                  "content": "Yeah indeed, if he had said something like ‘relax and enjoy the trip, I’ve got the kids, enjoy your Mother’s Day’ that would be one thing.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 62,
                      "content": "I would say sure IF op was the one the planned, coordinated and paid for the trip his wife is own with her own friends. Assuming his wife and friends planned the trip themselves.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 174,
              "content": "\\-Facepalm-\n\nThis is one of the rare times where **\"if the genders were reversed\"** works *against* you.\n\n*Everyone* expects mothers to take care of the children. It isn't right, but that's whats expected.",
              "id": 84,
              "comments": [
                {
                  "score": 82,
                  "content": "If this post was about a father who went on a four day golf trip,  came back on Father's day and got mad at his wife for not having a gift waiting for him,  do you really think the comments would all be agreeing and calling the wife a terrible mother?",
                  "id": 85,
                  "comments": [
                    {
                      "score": 47,
                      "content": "LOL the comments would be all \"You should take a 4 day spa trip so he knows how hard it was!\"",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Double standard in this thread for sure. I think it’s a lot of people that are so angry at lazy dads they lost the ability to think objectively. I know at least 50 couples with kids, and NONE of them would consider dad going on a 4 day golf trip and leaving mom solo with kids  a small deal. \n\nHonestly this thread stanks of misandry more than a little.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "> Everyone expects mothers to take care of the children. It isn't right, but that's whats expected.\n\nThat's not this post though. This post is about OP being called an asshole because he took care of the kids so his wife could have a 4 day child-free beach vacation but did not shower her with gifts on her return because Mother's Day happened on one of the days she was on the beach.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 92,
              "content": "Yes. I watch the kids when my husband gets away and vice versa. We’re both parents. That’s the expectation.",
              "id": 89,
              "comments": [
                {
                  "score": 33,
                  "content": "Do you regularly vacation apart? We sure don’t. If I had a bachelor party weekend and my wife covered for the kids I would give her a big THANK YOU. I could have easily not gone on that trip and left her with the kids, but she agreed to step up and I would consider that a gift. I guess if this were a more regular thing then it wouldn’t be as big of a deal.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Lots of couples do. Girls spa or beach weekends, guys hunting trips or something like that. Not everyone does, but it's not so unusual.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "[removed]",
              "id": 92,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "I agree it’s a big favor because you’re solo parenting. But if your wife watched the kids over Fathers Day or your bday, and you didn’t get a thing, not even a card, would it bother you? Maybe not, but it would bother me.",
              "id": 93,
              "comments": [
                {
                  "score": 9,
                  "content": "I don't think it would bother me if I got to go out of town on vacation with my friends for 4 days. Coming home from that, then complaining that \"you didn't get me anything\" seems selfish to me. Also there is a big difference between going out for the day and being gone for 4 days.\n\nThat said, I do think OP could have gotten a card, small gift or something together with the kids (bake a cake or something)",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My wife was out of town last father's day. I didn't give a shit because these are all fake ass holidays. People telling OP he deserves to get divorced or whatever are trash.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 7,
                      "content": "This is what I came here for. I honestly don’t care about father’s/Mother’s Day. It’s a Hallmark holiday. It’s only there to get people to spend money. Now I do get a gift for my wife and she gets a gift for me, but it’s usually something that we need already. I got her a new pair of shoes this Mother’s Day. She got me a pair last Father’s Day. If she wanted to take a trip with a friend and I was left to watch our child, I would treat the vacation as the gift. I would try to get our daughter to make a craft for her or something like that.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It's clearly important to his wife though.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Why is it so hard to get a card/make a card with a heartfelt sentiment. Let your SO know you care/are thinking about them. No matter gender.",
              "id": 98,
              "comments": [
                {
                  "score": 7,
                  "content": "Nothing says heartfelt like paying $7 to the Hallmark monopoly.",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Yeah but the mother would still organise a father's day gift, plus a mother wouldn't say minding their own kids is a gift to the other parent, had this with my ex, taught he was doing me a huge favour while he \"babysat\" our kid",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Reversed genders would be the same answer. OP would still be an AH. Keeping your kids alive while your partner has a few days to themselves is just part of being a good parent and a good partner. Everyone deserves a break if it’s possible, and it shouldn’t be considered a “gift”. The kinds of people who consider watching their own kids a “gift” or “favor” are the same type of people who keep tabs of every minor thing they pay for and expect their partner to pay them back. It’s tacky- do better.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 264,
          "content": "Yup. This would be the correct answer. They are YOUR kids as well. Thats part of being a parent. YTA.",
          "id": 102,
          "comments": [
            {
              "score": 12,
              "content": "> Yup. This would be the correct answer. They are YOUR kids as well. Thats part of being a parent. YTA.\n\nSo OP is the asshole because he took care of the kids while his wife went on a beach vacation but did not shower her with gifts on her return because Mother's Day passed on one of the days she was on vacation??",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Sure. But watching the kids solo while your partner goes on a 4 day vacation with their friends does sound like a mini gift.  Regardless of which parent it is.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "I agree, but there's a difference between taking care of your kids, and taking care of your kids by yourself for 4 days while your wife takes a little vacation with a friend. I still would've gotten her flowers or something, but taking a 4 day break from parenting can be a much better gift.",
          "id": 105,
          "comments": [
            {
              "score": 96,
              "content": "Right… we’re assuming here that wife is the primary caretaker and dad never does anything. Almost all couples with children who I know, mom and dad are equally caring for the kids and if one goes on a vacation it is a lot for the other parents to care for the kids and very much appreciated. \n\nSo OP would need to give us more info on what the dynamic and roles actually look like between both parents for us to see the full picture.\n\nHOWEVER, yes either way there should have still been some sort of gift or thought out to recognize Mother’s Day. So I suppose NTA either way.",
              "id": 106,
              "comments": [
                {
                  "score": 28,
                  "content": "My wife asked me what I wanted to do for Father's Day this year and I just said a hotel by myself for the weekend, lol.",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "I agree.  I feel like I am taking crazy pills reading these comments.  A little weekend getaway without the kids absolutely counts as a present in my eyes. And I am saying this as a mom myself.",
              "id": 108,
              "comments": [
                {
                  "score": 18,
                  "content": "Agreed as well. Not only that, the cost of that trip as well. I wouldn’t personally expect nor want anything additional. Mom of two myself.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "You aren't crazy. Other people are just dumb and just want to be mad at the guy. No reasonable person would care about a mothers day card after they were just on a 4 day girls trip over Mother's day.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes! I really don't get all the anger at him. I have 3 kids, all adults now, but when they were young my husband worked midnights for several years so he could be with them after school and during summer days. We split chores and kid activities as evenly as possible. \n\nWhen I stopped working, my husband took on extra shifts and part time jobs to make that possible for me and the kids. Being a Mom, especially a SAHM is extremely stressful and underappreciated. \n\nBUT so is being the sole breadwinner for the family and the one that makes sure bills are paid, everyone can eat, etc. And also the Dad in general, who the kids want to play ball with no matter how tired he is, the Dad who also has to spend his time off doing the manual labor of replacing fence boards, mowing the lawn..you know all the stuff that gets taken for granted. \n\nWaiting for the downvotes.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My husband and I don’t do gifts for holidays (or birthdays for each other) so I don’t expect one but his gift is usually to keep the kids out of my hair for the day while I relax and do self care. This year he also deep cleaned our living space without being asked which was a nice bonus - proof that old dogs can learn new tricks.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I agree. I think the comments here are projecting because of societies tendancy to reward dads for bare minimum. Somehow its lost that he did his AND HER parenting for days for a non emergency or duty situation.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "For 4 straight days while she's on vacation with friends? I dunno, at some point that starts to seem like a gift. What if it was 7 days? 12 days? Where exactly is that inflection point? \n\nIf he went on a 4 day Father's day outing should he also expect extra gifts upon his return, and get angry when there aren't any? \n\nOr does all of reddit just assume that any dad asking these questions must never watch his own kids?\n\nEdit to judge: NTA. Since we all get to make unfounded assumptions, I'll go ahead and assume OP and his wife equitably share childcare, household,  and work responsibilities.",
          "id": 114,
          "comments": [
            {
              "score": 92,
              "content": "The thing is, its not like the wife went away specifically for mothers day or that the father planned something for her to be away. This seems like a normal vacation, which if you're presuming they share childcare 50/50, you should assume they also both take vacations with their friends without their significant other on a regular basis. Like if a significant person in your life was on vacation for their birthday or Christmas, would you just not get them anything? A card and/or flowers doesn't take much. It sounds like the husband was creating an excuse to not put in any extra effort/doesn't like his wife that much, since if he actually cared about his wife he would've at least talked about it with her and clarified if she considered this trip a mother's day present.",
              "id": 115,
              "comments": [
                {
                  "score": 26,
                  "content": "You're making massive assumptions that both partners routinely take vacations while the other partner takes care of the kids. None of that is mentioned in the original post and taking regular child-free vacations is also NOT normal for many families with young kids. In fact, taking a child-free vacation is absolutely an incredibly rare and super luxurious treat for most parents with young kids.",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "He did put in \"extra effort\". Its called solo parenting for 4 days while she was away. She also isn't his mother.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": ">If he went on a 4 day Father's day outing should he also expect extra gifts upon his return, and get angry when there aren't any?\n\nIt's not about gifts. It's about making your partner feel special. \n\nAnd if you think her taking the trip is a gift, better make sure you both are on the same page.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Couldn't agree more.  Taking care of multiple kids for 4 days while your partner is on a trip is a huge gift.  4 days off as a parent is a huge luxury.  Can really tell who has kids on here and who doesn't.\n\nThat being said, a card and some flowers or a small gift.  Maybe an art project from the kids could have been done\n\nNTA, 4 days is a lot",
              "id": 119,
              "comments": [
                {
                  "score": 14,
                  "content": "I have 2 kids, who are now adults, and I agree that he should have gotten her a gift.\n\nIt's still a holiday and he clearly didn't discuss this with her ahead of timebut rather thought that since the trip 'fell on Mother's Day', he was off the hook for presents or a card or something.\n\nHe also stated in comments that she's alone watching the kids every single Sunday, and we have no idea whether he ever takes trips with his friends, as a lot of couples do.\n\nIt's about communication, plain and simple, which he lacks, and being considerate of one's partner's preferences.\n\nMaybe gift- giving, or marking certain holidays isn't a big deal to him, but it is to her.\n\nShe deserves to be celebrated.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I was leaning toward NAH for reasons you mentioned, but the rest of the reddit kneejerk crowd pushed me toward NTA.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Well I think that everyone needs a break. When you build a family you know that if your partner sometimes needs a break you will have to do more for few days. It's not a gift is taking care of your family and that's what you sign up for when you marry someone and have kids.",
              "id": 122,
              "comments": [
                {
                  "score": 9,
                  "content": "The post was clear... Wife was angry she didn't come home to something extra for Mother's day. So it is about the gifts, which spurred my hypothetical Father's day question that you've all chosen to avoid. Reddit just wanted to make it a referendum about OP as a father.",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Parenting for a long stretch is still parenting and not a gift. Would it be a gift if mom was in the hospital? Dead? Deployed due to military service? Regardless of the reason she was gone for four days, it is laughable to me that she shouldn't have gotten a \"real\" present from her partner. If her trip had ended on Saturday or started on Monday (with the same amount of time away), would you still consider him caring for the kids for 4 days a gift?",
              "id": 124,
              "comments": [
                {
                  "score": 10,
                  "content": ">Would it be a gift if mom was in the hospital? Dead? Deployed due to military service?\n\nNo, no, and no. And you know damn well that we're talking about a vacation, which is a luxury, and not those other things. Stop being disingenuous.",
                  "id": 125,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "But she wasn't away for any of those reasons. She was on vacation which was chosen to be on Mothers' Day weekend.\n\nIf it was reversed and OP had decided to go away for a 4 day golf weekend, OP's wife taking care of the kids would absolutely be a favor and she would probably be justified in having 4 days of her own where OP took care of the kids.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My SO and I also equally take care of our little one. He got to go on two trips where I was the sole caregiver for a bit over a week. This doesn't mean he doesn't get anything on Father's Day, that would be an A move of me I feel. \n\nIt means I love him enough to take care of our kids solo for a X amount of time while he got to go on a trip with his brothers and have some bonding time with them. Parenting takes up SO much of your time, needing to get away and see your brothers is perfectly fine and healthy. And OP's wife could have been doing just that. Having some time to herself which was much needed.\n\nMy SO went on that trip without me expecting anything in return or feeling like that was a \"gift\" but more of.. just a thing partners do for eachother. So thinking OP's wife deserves nothing on Mother's Day just because he did a basic partner thing right before that is an A move. So yes, OP YTA.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "yea big lol. Taking care of the kids as a gift.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Hijacking to add that these things are also not gifts: laundry, emptying the dishwasher, taking out the trash, making kids lunches, cleaning the house, cleaning up the coffee table, scrubbing sinks and toilets. \n\nI mean come on man, you couldn’t even order dinner and have some cake or something? \n\nYTA",
          "id": 129,
          "comments": [
            {
              "score": 5,
              "content": "He was probably too exhausted from looking after the kids on his own for 4 DAYS STRAIGHT.\n\nThere isn't a chance you'd be critical of his wife for this if the roles were reversed. The sexism on this sub is so gross.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "I’m not a parent, but wouldn’t taking care of the kids by yourself for 4 days so your partner can take a friend vacation be considered somewhat of a gift?",
          "id": 131,
          "comments": [
            {
              "score": 82,
              "content": "So do the stay at home parents only deserve gifts in the form of 'oh I guess I'll babysit the kids, but nothing else!' They don't get a special gift for being a parent? If this were a dad thing, and Dad had gone on vacation and came back on father's day, I bet dollars to donuts she would have had a clean house, a nice gift, and some peace and quiet to unwind post trip. Men get awards for literally doing the bare minimum.",
              "id": 132,
              "comments": [
                {
                  "score": 46,
                  "content": "Not really sure what you’re getting at? My mom was a SAHM and as soon as my dad came home from work around 5ish, he took over parenting duties while my mom took a step back. Definitely not 50/50 (due to dad working) but also definitely not solo parenting. \n\nNot sure why you feel the need to make it a man vs woman thing, either. Personally, if my hypothetical wife offered to watch the kids from Th-Sun alone so I could go on a mini-vacation with my buddies, I’d be the one coming back with gifts lol.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I'm a stay at home mom. I do so much, but my husband always  comes home and does his part. But it took communication to get there, which they don't seem to do. And I do make it a men vs women thing bc I see men every day getting away with the bare minimum for their partners and women working themselves to the bone for their families. I had a friend yesterday who got served with divorce papers. She's a sahm, her youngest is still in diapers and baby daddy *bragged* about not changing diapers ever. But when he takes the kids out to the park, oh man dad of the year. The absolute minimum you can do as a partner is celebrate their parenthood status- moms, dads, or anything in between. Not even a 'happy mothers day' or a home made card? Those things are free! That's five minutes of effort!",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I’m a SAHD and would LOVE a 4 day beach vacation. I would expect no other presents and would be surprised if the house was anything but a wreck when I returned. Totally disagree with your post.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "If the dad came home after a four day beach vacation with the boys, away from wife and kids, and got pissed off that he didn't get a gift that weekend you'd be calling him an unappreciative AH. \n\nNobody is suggesting that time away from kids is the only form of gift she's allowed or anything of the sort.  We also don't know if one is a stay at home parent or if they both work and coparent or what so it's hard to make that kind of assumption. \n\nThere's no need to even throw gender into this. Any reasonable spouse, regardless of gender, should be more than happy with a four day vacation with friends and away from the kids as a type of gift. Getting pissed because you didn't get presents when you got home is less than reasonable. That being said, hopefully OP at the very least had the kids make her a card or something.  Mothers/Fathers day should be more about kids expressing love for their parents, anyways. Anniversaries are for giving gifts to your spouse (imo).",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "No. That’s giving your partner a chance to be an adult outside of being a parent and partner.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "As a parent,  yes, it's a huge gift.",
              "id": 138,
              "comments": [
                {
                  "score": 3,
                  "content": "Vacationing with friends away from the kid(s) is the best gift in the world. NTA",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14184,
      "content": "YTA \n\nParenting your own kids isn’t a gift",
      "id": 140,
      "comments": [
        {
          "score": 3147,
          "content": "As a father, him acting like being a parent is a gift to mother is disgusting.  Yta op a huge one.",
          "id": 141,
          "comments": [
            {
              "score": 1106,
              "content": "[removed]",
              "id": 142,
              "comments": [
                {
                  "score": 52,
                  "content": "THIS",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "In addition to growing and birthing said tiny little goblins",
                  "id": 144,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "This tells us a lot about him as a father",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7744,
      "content": "I rolled my eyes at the \"watching the kids is a gift\" part. Are you implying that you'd have made your wife take the kids with her had it not been Mother's Day? If yes, YTA. If no, then YTA for making yourself feel good about an empty gift.",
      "id": 146,
      "comments": [
        {
          "score": 969,
          "content": "I still think it's a moderate YTA, but watching kids entirely by yourself for 4 days is definitely a gift to your partner. \n\nMy wife and I give each other until noon on the respective fathers/mothers day as a present we still do cards and the kids will do things. We also do take mini vacations like this but there is mutual appreciation for that time.",
          "id": 147,
          "comments": [
            {
              "score": 568,
              "content": "Uh yeah my husband travels for work and taking care of the kids (and everything else in the house) for four days is a pain in the ass. It’s exhausting. I would have at least had the kids draw a picture or get a card though.",
              "id": 148,
              "comments": [
                {
                  "score": 603,
                  "content": "It’s still not a gift. Having kids means choosing to do this. If you know your husband travels for work then it’s not a gift to him to watch the kids when he’s gone, it’s the deal you made when having kids. I get it, it’s exhausting. But it’s not a gift. I’m speaking as a parent who frequently is alone with 2 kids.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 280,
                      "content": "Agree with you fully. \n\nKids are exhausting, beyond stressful, overstimulating at times and it’s often a thankless job. \n\nWhether or not both parents are present, *someone* has to care for the kids. It’s not a gift, it’s a duty. Its a responsibility. One chosen the moment you decide to have them. \n\nIf aunt or uncle showed up and said “today is your day! We’re taking care of the kids ALL WEEKEND!! UNCLE ROAD TRIP!!!” So you can get some rest /have a date night/ do whatever - would be a gift. As those relatives have no real obligation. But not *their dad*. He’s responsible for them 24/7, whether or not mom is around.\n\nEdit* seriously can’t even make a box cake and have the kids decorate it? She pushed them out of her broken pelvis, make her cupcakes one day out of the year.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 91,
                      "content": "I don’t know man. I am a working mom to a 3.5 year old. If I went away for a week on a girls trip and my husband was home watching our son, I would definitely feel like that was a gift/favor and feel grateful. The reverse would be true if my husband went away on a leisure trip and left me home with the kid for a few days. We would both do it for each other, but wouldn’t expect it all the time as part of “normal parenting”. Not saying that OPs wife didn’t deserve a separate acknowledgment for Mother’s Day, though. Just wanted to throw out there that once you become a parent, “time off” feels more and more like a luxury.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "There is a difference between working and recreating. \n\nA SAHM watching the kids while her husband is at work, is doing her job while he does his. \n\nWatching the kids while husband is out golfing or chilling on the beach is a gift. \n\nWatching the kids while the other partner is handling basic necessities or family responsibilities is just part of parenting, but taking on all the responsibility for 4 days is an enormous gift.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I don’t know, what if he never travels for work or for fun by himself? Then it’s not like “I do this all the time and you call it a gift, bullshit”. It really does become a big deal then. It is hard and it is very difficult.\n\nEvery time I have had to do it as a dad my respect for single parents has increased dramatically.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'd say watching the kids while the breadwinner goes and wins the bread is not equitable to watching the kids so your partner can go have a vacation with their friends. One is more of a gift than the other. We dont have enough info about the dynamics of their relationship or how the conversation about watching the kids went down to pass judgement on whether this drifts into \"gift\" territory or not tbh. At the very least I'd expect her to do the same for him in the future if she didn't think it was a \"gift\".",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It's not a gift unless it's up to both partners to decide if the vacation is possible but is only possible bc the non vacationing partner takes up extra work.\n\nI had a co worker that had to split weekend shifts w me. We were both equally responsible for the work and were salaried. I took 14 hours worth of work off his plate one weekend so he could go out of town for his bday. \n\nThere were several times where our lab was swamped that I had to go in on his weekend and vice versa. Neither of us were scheduled to work weekends, it just was conducive to our lifestyles to alternate coming in in order to make our work during the week less stressful. If I were to not show up on \"my weekend\", the whole department would get in trouble, not just me. \n\nI feel like if the only way for a parent to take a 4 day trip on mother's day requires the other parent to take on extra tasks, how is this not a gift? My parents never traveled growing up. I had 4 siblings. I remember when my dad's college friends went to go see Prince and invited him. It was a huge thing. My dad would have definitely bought my mom flowers or something if this situation was about him, but child me would have definitely seen this as my mom being \"allowed\" to travel for 4 days as the best gift ever. \n\nDoes OP and his wife constantly take solo trips that require the other to take on more tasks, or, as it sounds like to me, was this a unique situation that OP felt like was happening only bc of Mother's Day?",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Watching your kids while your spouse works is a bit different from watching them while your spouse parties though…",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "If it's for a non work trip, it is a gift.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Traveling for work is different though - it's an obligation and not for fun, you're working. Taking care of the kids on your own while your spouse is on vacation is in my opinion a type of gift (but no, should not have replaced a Mother's Day gift unless she specifically said \"for mother's day, I want to go on a trip while you watch our kids\")",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I’m not saying that it’s a gift for him when he’s traveling for work. But he wants to go on a trip with buddies over Father’s Day and I’m home with the kids by myself not having any sort of break to help, that’s his present and I’d feel the same if roles were reversed.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "My husband is gone for 3.5 MONTHS for work. I'm going insane. Luckily my kids are in school and not toddlers but STILL.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 3,
                      "content": "FOR WORK.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 123,
              "content": "Yeah, a four day trip with your partner shouldering 100% of responsibilities definitely sounds like a gift that doesn’t ( and *shouldn’t* ) happen all the time to me.",
              "id": 162,
              "comments": [
                {
                  "score": 82,
                  "content": "Yeah but it seems like the only reason this husband is considering this a gift for mother's day is bc it fell on mother's day. If it was a week earlier or week later I bet he wouldn't be saying that (but probably wishing he could lol).",
                  "id": 163,
                  "comments": [
                    {
                      "score": 19,
                      "content": "If it wasn’t for Mother’s Day then the question would be when is he going to get a 4 day trip with friends while she solo parents?\n\nAnd yeah, it’s such a “coincidence” that this 4 day holiday she took while he handled everything just happened to fall on Mother’s Day. How strange. Can you think of any reason it might not actually be a coincidence?",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "It's a nice thing for sure, but it's not a gift. Just something you do so your partner can have a life.",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Agreed the number of people not understanding that taking a 4 day trip is different than “just parenting your kids” is rather astounding.",
              "id": 166,
              "comments": [
                {
                  "score": 7,
                  "content": "I don’t think that’s quite it. I think we all know that it’s harder than day-to-day parenting. Those of us who are single parents know this quite well, in fact, because we live it all the time.\n\nThe problem is that OP used his stepping up as a parent as an excuse to do nothing for Mother’s Day. Why?",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I’m a single parent (widow - so no weekends off). But yeah 4 days is super tough ………………",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He states in a comment reply:\n\n[>No. We both go out of town equal amount this was the first time it fell on a “holiday”](https://www.reddit.com/r/AmItheAsshole/comments/13i9loj/aita_for_not_getting_my_wife_anything_on_mothers/jkakuor/)\n\nSo she watches the kids solo as much as he does when he is out of town, but since this time happened to fall on Mother's Day, he is counting it as his gift.\n\nHe tries to make it seem different because when he goes and plays paintball, it's \"work\" because he's wants to eventually go pro.\n\nIt's also super unclear if the \"out of town\" time and the Sundays playing paintball are the same thing of if he's out of town the same amount and also spending most Sundays playing paintball.\n\nHe tries in every comment to call her watching the kids while he plays paintball a \"gift\" so people will consider watching the kids to be a \"gift\" when in reality he's just returning the favor she does for him.\n\nEven if he does get partial credit for that, he didn't do anything with the kids for their Mother's Day gift. He blames not having his kids make something for their mom on his nebulous 'mental illness' of perfectionism, which, even f true, doesn't stop him from having the kids make a card and ask them what they want to do for their mom for mother's day. \n\nHe wants some credit because the oldest helped her clean out her car when she got back. He didn't help, just her son.\n\nI'm going hard YTA on this one.",
              "id": 169,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3397,
      "content": "YTA.  How does you parenting your own kids count as a gift?",
      "id": 170,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2196,
      "content": "[deleted]",
      "id": 171,
      "comments": [
        {
          "score": 345,
          "content": "She’s the mother of his children so yes she deserves a Mother’s Day gift from him Id say",
          "id": 172,
          "comments": [
            {
              "score": 3,
              "content": "Depends on your relationship/culture. My wife and I aren't huge on gifts for holidays. We often do nothing on mother's day, father's day or Valentine's Day. We do little things like a drawing from the little one, but we don't do big elaborate gifts. It's relaxed and that's the way we like it. We get each other gifts randomly when we feel like it.",
              "id": 173,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 136,
          "content": "Mother’s Day is also a day for the father to show love and appreciation for the mother of their children. Not just for the kids to give gifts. \n\nSo, he should have done something thoughtful independent of the kids, too.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "He made her into a mother and she is the mother of his children. He should honor her.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1538,
      "content": "YTA - was it too difficult to go buy some flowers? Or even a card? Did you even wish her a happy mother's day? At least by text?\nHow many times does SHE watches the kids while you do whatever you want? Being a husband and a father are choices that you made. Those choices imply some responsibilities, such as watching your kids, helping out in the house, etc AND show that you care about your partner!",
      "id": 176,
      "comments": [
        {
          "score": 53,
          "content": "Hell, even flowers is a pretty lazy af gift. Considering it's usually the woman who has to unwrap the flowers, cut the flower stems and put them in a vase with water, as many men don't even consider that. For the most part, getting flowers as a present is just another task women have to do. Even so, this dude couldn't even manage that. 🙄",
          "id": 177,
          "comments": [
            {
              "score": 11,
              "content": "Flowers aren’t given until they are in the vase. I have never once considered just handing over the flowers and leaving it at that.",
              "id": 178,
              "comments": [
                {
                  "score": 6,
                  "content": "If you're a dude, then you're in the minority. XD I've never seen a guy put flowers they bought for their mom/significant other in a vase. Kudos to you tho!",
                  "id": 179,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1333,
      "content": "Watching the kids? You mean being a parent? YTA.",
      "id": 180,
      "comments": [
        {
          "score": 281,
          "content": "Society really f*cked up fathers into believing that them taking care of the kids they helped make and raise is just \"babysitting\"",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "So i find this completely normal, my wife and i constantly trade looking after the kids solo for solo time alone/events,  but we have a very close 50/50 split with looking after the kids/ household chores so for us this is normal.  if either of us planned on having 4 day away trip with friends that would be considered a big deal for either of us, that's a lot of solo parenting with no support or someone to tag in when you need your own time.\n\nBut OP should have still gotten something together, flowers, a card, something simple.  NEVER assume that because you looked after the kids for a few days solo that it absolves you from getting a mothers day gift or getting your kids to make her something.  that kind of decision needs to be made before hand.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 673,
      "content": "YTA. You didn't say the age of your children but I am going to say if you have to stay home with them, they are too young to buy their own present. You are a father, watching your kids is you being a father.  Do you consider it a gift every time your wife handles the kids so you can go out and do something? \n\nI suggest you go out and pick up something extra special for your wife.",
      "id": 183,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 534,
      "content": "She’s not your Mother. \n\nHowever, do you seriously believe taking care your own children is a gift?? Be better\n\n~~ESH~~ YTA\n\nEta — Hold up — how old are your kids? You didn’t help them find/make a gift for their mother? You were with them all weekend.\n\nEdit judgment",
      "id": 184,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 510,
      "content": "Info:\n\n\nIs it that uncommon for both of you to watch the kids alone? Are you yourself never going on short trips with friends?\n\n\n\nYTA\n\n\nShe has the kids alone every time you go to paintball. That isn't your gift either. Making it her gift is an ahole move.",
      "id": 185,
      "comments": [],
      "relation": "Attack"
    }
  ]
}