{
  "post content": "On mobile, non-english speaker, sorry for any flaws.\n\nI’m a manager at a company with 50-isch employees. Me and two other managers. I manage three teams of 8-9 people, one of them beeing ”Mike”, 52m. \n\nWhat we do at our firm don’t matter here, but it is highly skilled and very well paid. Training a new employee takes more than a year and is very expensive.\n\nMike joined us three years ago. Good impression, great feedback from former managers. Started off well, but the past year things have taken a turn. He’s sloppy, slow and the quality isn’t up to standard, so his colleagues have to lend a hand. He’s not taking part in meetings, logging in late and going home early. He doesn’t answer calls or e-mails. Rude to co-workers nad management, told anothee manager to ”fuck off” and got written up. I’ve repetedly askes but Mike says he’s got no problems, no illness, no substance abuse.\n\nWe do two products, one rather easy and quick and one that requires time and skill. Important for later.\nTwo weeks ago was Mikes yearly rewiev. We have a system where you’re rewieved on 1. teamwork and taking responsibility, producing good quality etc. 2, the number of ”quick” products you do and 3, the number of ”quality” products you do.\n\nCheck one box - get a slight raise. Two -bigger raise. Etc. Everyone gets a raise equal to inflation, even if no boxes are checked. \n\nI got handed the production stats for Mike from our budget guy ”Paul”. Mike started our meeting bragging about how many products he makes and he should get a good raise. I look at the numbers and Mike haven’t done even half of his requirements. Poor quality, and as stated a horrid behaviour. So no raise above the inlation mark.\n\nMike breaks down and admitts he’s an alchoholic. Drinks every day, even at work. Wife left him cause of it a few months ago. With everything in the open, we talk and long story short he’s now in rehab and then couples therapy that we pay for. He’d on paid leave.\n\nThis weak I check the numbers Paul gave me. He did it wrong; Mike is in fact one of the most productive teammembers. Still bad quality and team-work, but he would have been up for a much higher raise had I known.\n\nI decided to not say anything. This reality-check actually helped Mike out, big time. He will get a raise when he’s back at work.\n\nTold my wife and she thinks I’m an a-hole. He did what he had to do to get a raise, and I’m decieving him from his pay raise.\n\nAm I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 584,
      "content": "Your wife is right. Your personal judgement of him has nothing to do with his ability for the job. Follow procedure and give him the raise. Otherwise it could cause legal trouble later",
      "id": 2,
      "comments": [
        {
          "score": 105,
          "content": "And make sure it's back-dated to when he would have received it had the figures been correct. Tbh OP, he already got his reality check and is in rehab, great. Getting that raise now after all might actually be positive reinforcement, that he did the right thing going in for treatment.",
          "id": 3,
          "comments": [
            {
              "score": 22,
              "content": "This. Cherry on top of cake. I would gather opinions on how to tell him respectfully and apologize respectfully without making him feel like rehab wasn't necessary",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Precisely. There's a massive discrimination case that could happen.",
          "id": 5,
          "comments": [
            {
              "score": 123,
              "content": "Jesus I swear this sub just loves throwing around \"discrimination case\" and any other legal bullcrap without having even the slightest idea how anything works. He admitted to drinking on the job which is an instant dismissal with cause (if the company wants) in any developed country in the world. This guy is extremely lucky to even have a job right now. Should he get the raise he was entitled to? It's debatable but cussing out managers as well as being drunk at work is worthy of being fired at any company in the world. As to your \"discrimination case\" is being an alcoholic a protected class now? Try not throwing around words you've seen before without understanding what they mean.",
              "id": 6,
              "comments": [
                {
                  "score": 34,
                  "content": ">alcoholic\n\nWhoa I read the whole post and completely missed that! What's even going on with me today? Thanks for pointing it out.\n\nI was focused on the false pretences when I made that, but with the alcohol abuse as well it's way murkier.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[Under the ADA, alcoholism can be considered a disability.](https://adata.org/faq/are-alcoholics-covered-ada)\n\nAs per OP, he based his decision to not give a raise based on his alcoholism, **not** his work performance.\n\nOP better hope this doesn't get back to Mike.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Actually since alcoholism is a disease in many countries he would not have necessarily been able to be fired without them offering him rehab etc. \n\nThey need to give him the raise he deserves that is true but his job might actually be safer now that he has claimed a disability/disease. \n\nI don’t have to agree with the law on this so don’t come at me.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That's verifiably false in every country in Europe as well as the US. Feel free to look it up. If you choose to believe there are countries in Africa or Asia that give strong rights to alcoholics or drug addicts then I can't say I've done the research to disprove it but I would bet literally every dime I have that it's laughable to think that.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 201,
      "content": "You weren’t an AH initially because you didn’t know there was a mistake, and yes, it was obviously the shock he needed so no harm done on that part. However, now that you know the numbers were wrong, he needs to get the raise he‘s entitled to. You would definitely be an AH if you kept the raise from him entirely, but it sounds like that wasn’t even your plan. As it stands, I‘d actually check with your legal department on how to proceed because contacting him in rehab about work isn’t a good idea either. It should probably be put to the side for now and settled when he returns. \n\nNAH.",
      "id": 12,
      "comments": [
        {
          "score": 106,
          "content": "I think a lot of people are missing the part about the employee being in rehab/counseling the job is paying for while also on paid leave. He is taking time for his health and relationship. This is good news, that he does get a raise after all but contacting him while he is away for medical care is usually a no-go for management. OP needs to refer this up to HR/legal as there may be policies or boundaries they need to abide by when contacting an employee in this circumstance. \n\nOther options include amending his current pay during leave to the higher amount and providing back payments with a letter to explain. Or providing a lump sum when he returns after explaining the situation. Either way, HR/legal would be doing the bulk of work figuring that out. They'd probably have him sign a \"sorry we bunked up, please don't sue us\" type of agreement as well. \n\nIn the end, this was a wake up call and I hope the employee is able to lead a healthy and more productive life after his treatment. OP is in a sticky spot but their duty is to follow policy about the raise and about fixing the mistake whether or not is was a wake up call. NAH",
          "id": 13,
          "comments": [
            {
              "score": 26,
              "content": ">Other options include amending his current pay during leave to the higher amount and providing back payments with a letter to explain. Or providing a lump sum when he returns after explaining the situation. Either way, HR/legal would be doing the bulk of work figuring that out. They'd probably have him sign a \"sorry we bunked up, please don't sue us\" type of agreement as well.\n\nOne of these should be the solution. Right now he needs to focus on his health and not on his job.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This all depends on who he is being paid. Is he being paid cumulative vacation? If yes, then the raise matters. Is he being paid from a short term policy? If yes, then it most likely won't matter. These policies look at your average paycheck prior to the leave, so even if he had been given the proper wage increase it would not have reflected in the paychecks. \n\nIf he is being paid via a short term insurance policy, which if he is in the US is the most likely situation, the company isn't actually paying him anything. The smartest thing for OP to do it back date the pay raise to when it should have went into effect and then it is up to the company and HR to correct any payroll issues.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I doubt you need to contact him to implement the raise. Just put the paperwork in and you can talk about it when he gets out",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 48,
      "content": "What happened might have helped him in his private life but you're only his superior at his work and it is clear that in professional life you should give him the raise he deserves. You don't know whether it would affect him positively or negatively and everything is out in the open anyways. You're NTA for not giving him the raise in the beginning because you didn't know, but YWBTA and legally in the wrong if you don't correct the mistake",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 33,
      "content": "YTA. I think he needs a wake up call too, but do it the proper way. If he hit those numbers fair and square, get him what he deserves, he is already marked down for his poor teamwork within that system.\n\nAs a manager, YOU are the one who needs to correct the flaws in your employee's attitude with your leadership and people skills. Why do you need to find a fraudulent way to game the system to do a basic part of your job?",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 15,
      "content": "sounds like the system needs changing to be honest as it is rewarding quantity with no regard to quality. I would talk to him when he returns and let him know there was an error and that you will give him the pay rise. He admitted to drinking on the job so really he is lucky he wasn't fired. You have paid for rehab and couples therapy so I think morally you are in the right and we are not here to judge you legally so am going with NTA.\n\nOn a side note, rehab is only the start of the recovery journey so, he is likely to need a lot of support to help him keep on track. I'd consider giving time off for alcohol support meetings if possible and regular catch ups (obviously you don't have to but would benefit both sides).",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "Listen to your spouse. YTA.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "NTA\n\nYou acted appropriately based on the information you had at the time.  \n\nBut you can fix it. Every company has a mechanism for rewarding employees outside of a yearly review.  50 employee companies usually don't have that many layers of management, which is why I love working for a small company, so there are often extraordinary measures that can take place if you talk to the big boss, owner, or president.  Explain the mistake, that the employee is now in rehab, and seems to be in recovery, and his numbers are up.  Get him the raise that he deserved based on his numbers, and encourage him to take action immediately if he relapses, that drinking on the job is grounds for termination, and that you are proud of the actions he has taken.  I have a feeling that you often go the extra mile for your employees, and he definitely sound like he is worth it.  All of his actions and lack of detail could be attributed to his drinking, and as long as it is under control he should continue to improve.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "YTA, give him what he deserves. Glad he's getting the help he needs.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA- Mike is currently on paid leave, in rehab and therapy on the company currency.  This is already above and beyond what many companies would do with the information you had during his review.\n\nYou have then said that, when Mike returns to work, you will revisit his review with the new information you have, and give him the raise (and here I am guessing) the back pay due to the date of the review.\n\nThis is the correct way of handling things.  Whenever somebody is on leave, you don’t want to screw with their pay expectations as they can cause a huge amount of issues.  Is this an error the company will want repayment for, and so on.\n\nAs long as you are correctly calculating back pay and other associated things with the correct raise, let Mike return to work and have that meeting.",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "So, this bad worker who should have been fired for his behaviour alone confesses that he drinks at work. His metrics are very bad. Instead of firing him the company pays for his rehab and he is on paid leave.  You just now found that the metrics were wrong and are for holding on the raise until Mike comes out of rehab so as not to destroy all the work he has done so far to stop his drinking.\n\nFrankly, I do understand and agree with you that telling him that the bad metrics -the very ones that made him accept that his drinking is a problem - were wrong would do more damage than help. He was bragging about his metrics, he very probably used it as proof that his drinking was not a problem. That he could still do his job. Losing his wife didn't seem to have shaken him up, losing his honour as a worker did it.\n\nFinding the one thing that will make an alcoholic seek help in truth is worse that trying to find a black cat in a dark room, blindfolded, with no cat. Destroying that reason seems a risky move.\n\nIf you are that doubtful you could maybe contact the rehab and ask them what they think about not telling him and keeping the money until Mike gets out. He is on paid leave so he is not suffering from lack of money.\n\nNTA",
      "id": 24,
      "comments": [],
      "relation": "Support"
    }
  ]
}