{
  "post content": "Context: sister (29F) has had a dog for about a year now. She is (meant to be) the sole carer of the dog and he is her responsibility entirely. This was the agreement as no one else at home wanted a dog. \n\nEDIT: Important stuff I think is important to understand my position, but in no way excuse me. When we first got the dog, my sister would leave him in a locked play pen all day. He would bark and cry. If I had a break that day id take him outside to sit in the sun, use the bathroom etc. After 9 months of this I told my sister she had to find somewhere else for him to stay throughout the day. I said this as he deserves to be out and playing like a normal dog. She still refused and thought he was fine, so I told her that I would no longer take him out (including bathroom breaks) which meant she HAD to find a new, safe space for him to stay throughout the day. She refused to put him anywhere else, but she would call me throughout the day asking me to take him out. \n\n \nThis dog barks all day, endlessly. I work from home and take calls with customers and colleagues, and he can be heard through the phone, whereas my sister goes into the office. She leaves him locked in the laundry when she's not home. My room has an attaching chute to the laundry so I can very clearly hear this dog whenever he barks/cries. His living conditions are bad in my opinion, he doesn't get to run around during the day, feel the sun or be a normal dog. I've told her it's inhumane to leave him like that, she doesn't listen. \n\nI asked her to find somewhere else for him to stay, not in the laundry, so that I don't have to listen to him cry all day. He's gonna cry and bark regardless because of his circumstances, I just don't want to hear it all day.\n \nNow in this past year, I've learned what triggers my dog. The main thing is bassy music. He doesn't understand it and just barks. I have chosen the warpath\n\nBecause my sister has just blatantly disregarded his barking and my problem with it, I've decided to start triggering my dog when she's home. She's told me to \"just put headphones in and drown him out\". I decided that headphones wont work because i dont want to wear them all day, so the next best thing is music loud enough to drown him out \n\nI'll play loud bassy music outside my room with the door closed. I'll also knock on my desk occasionally to mimic someone knocking at the front door (dog will bark for 20 mins if someone is at the front door and knocking).\n\nHere's the real kicker. When she is home, if he barks for more than 5 minutes straight, she will go nuts and tell him to shut up. She can't stand his barking for 5 mins, but she expects me to just suck it up for 8+ hours a day. This is the exact reason I've chosen this revenge. \n\nSo, AITA for driving my dog crazy while my sister is home?\n\nEdit: I know what I'm doing is really shitty. I really don't know what else to do. If anyone has any other ideas to get my sister to understand that the barking all day isn't okay? I've already spoken to her about professional trainers, staying consistent with training, and even rehoming when nothing has worked.\n\nTo those who have said \"just take the dog out when hes in distress\", I used to do this, but this enabled my sister to keep passing off responsibility and not actually do anything to change his circumstances, which is why I have since stopped doing anything for the dog\n\nFINAL EDIT: Yall have gotten to me. Im gonna stop riling the dog up when my sisters home. I will figure out a way to fuck with my sister directly without collateral. I only came up with this plan a few days ago and I know I was blinded by my frustration, so thank you for destroying any ego I had towards this matter. I admit that my frustration caused me to view the dog as a pawn and not really consider the effects this has on the dog. I will try to be better for the dog. Thank you kind assholes (/s) of the internet for forcing me to quit my bullshit and  forcing me to learn how to deal with this in an appropriate, mature manner",
  "id": 1,
  "comments": [
    {
      "score": 12,
      "content": "ESH here, you’re intentionally causing distress to this poor animal who you already described as having a pretty shitty life.",
      "id": 2,
      "comments": [
        {
          "score": 6,
          "content": "And is it so hard to take the dog out from time to time if you know it’s suffering?  Instead you just make things worse for it.  Yeah, ESH",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "So my sister has actually palmed off responsibility CONSTANTLY. She won't come home to care for him or do anything. My parents do everything for the dog\n\nWhen we first got him I used to take him out all the time, as shed still have him locked up all-day. \n\nAfter a year of this, I told her I'm not taking him out or caring for him because she literally NEVER did. She never prepared our backyard to be safe for him throughout the day. She never prepared a way for him to go to the bathroom. She never prepared a way for him to get fed. Shed just leave home in the morning and come back at night. \n\nMy guy, trust me, I have raised dogs in the past and have never had these issues",
              "id": 4,
              "comments": [
                {
                  "score": 7,
                  "content": "Sounds like you have a sister problem, not a dog problem!  So tough when you are dealing with someone who both “needs” to have a dog and doesn’t care for it, so either it falls on everyone else in the household or the dog suffers.  Nobody wins, especially the doggo",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Youve legit hit the nail on the head. The dog is not the problem, it is my sister. I dont know what to do..",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I don't know if the music causes stress rather than a territorial defence. I only say this because of the knocking at the front door being a trigger for him.\n\nI am in no way trying to excuse myself of any behaviour. I know that if what I'm doing is indeed putting stress on this dog, then I really do suck here",
          "id": 7,
          "comments": [
            {
              "score": 4,
              "content": "Okay then STOP DOING IT.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "You all are maximum AHs. I hope a neighbor calls animal control and reports your family! That poor dog   would be better off living with someone that actually cared for him.",
      "id": 9,
      "comments": [
        {
          "score": 0,
          "content": "You dont know how many times ive secretly prayed that someone calls animal services..",
          "id": 10,
          "comments": [
            {
              "score": 3,
              "content": "You can call it in yourself - these can be done anonymously. That might be what needs to be done to get the dog somewhere safe and your sister blacklisted on shelters.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Call from an anonymous number and report you can hear the dog from outside the house.  Look for a free one use number to make the call.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH I understand why you are doing it but the one in the worst situation of all is the dog. You think your life is tough? Try being that poor dog. And yet you are choosing to make it’s life even worse. Do better.",
      "id": 13,
      "comments": [
        {
          "score": 3,
          "content": "Honestly this comment got me.. i want to do better but ive been struggling a lot mentally recently, and when the dog is put in the mix, i get extremely overwhelmed, illogical and frustrated for a week at a time..  not excusing myself, i know my behaviour is a chosen behaviour, and i cant blame anything/anyone but myself.. i really dont know what to do",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "I appreciate that you are identifying the issue and wanting to be a good person. It’s tough when we get overwhelmed in life but the most important thing, in any situation is “do no harm”. I think you need to have a heart to heart with your sister and explain that it just can’t happen. If you are truly stuck, isn’t there any possibility of you befriending the dog? Get him out of the laundry room? May very well help your mental health. You could even do some fun training. Maybe some agility courses. Teach him to catch a frisbee if he’s big enough. Dogs are amazing for helping us in tough times",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": "Ive had so many heart-to-hearts with her over the past year and its evident she wont change. I have befriended the dog, he loves me. We spend quality time together, ill come and cuddle him when hes alone, locked up or sleeping and he loves it. I train him, he listens, we play fetch or ill just chase him around the backyard. Having a relationship with the dog is not really the issue as we have a great one..",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Ok, you made it sound like you didn’t like him and whenever your sister is gone you leave him in the laundry room.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH. You can't rile up the dog on purpose, distressing it. It's a dog, it's already suffering by being locked in a room 8 hours a day.\n\nYou and your sister clearly live at home as adults. What does everyone else in the house have to say? Are you the only one at home all day?",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "Everyone else just thinks she's doing what she can we should just deal with it. Yet they also work from the office so they don't get the frustration that comes from it",
          "id": 19,
          "comments": [
            {
              "score": 3,
              "content": "She shouldn't have a dog",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": "This is known, but a fact that I havent been able to influence or change",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH, that poor dog. You already know it’s miserable but are happy to distress it even more if it annoys your sister.\n\nNone of you should be pet owners.",
      "id": 22,
      "comments": [
        {
          "score": 1,
          "content": "I AGREE!! I have told her to give him to someone who can give him the life he deserves but she refuses",
          "id": 23,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > What I'm doing to my dog specifically isn't fair. He doesn't deserve to be put through anything more, and I know I'm being an asshole to him. Causing anxiety for him is mean, but I don't know how to deal with this situation\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nContext: sister (29F) has had a dog for about a year now. She is the sole carer of the dog and he is her responsibility entirely. This was the agreement as no one else at home wanted a dog. \n\nThis dog barks all day, endlessly. I work from home whereas my sister goes into the office. She leaves him locked in the laundry when she's not home. My room has an attaching chute to the laundry so I can very clearly hear this dog whenever he barks/cries. His living conditions are bad in my opinion, he doesn't get to run around during the day, feel the sun or be a normal dog. I've told her it's inhumane to leave him like that, she doesn't listen. \n\nI asked her to find somewhere else for him to stay, not in the laundry, so that I don't have to listen to him cry all day. He's gonna cry and bark regardless because of his circumstances, I just don't want to hear it all day.\n \nNow in this past year, I've learned what triggers my dog. The main thing is bassy music. He doesn't understand it and just barks. I have chosen the warpath\n\nBecause my sister has just blatantly disregarded his barking and my problem with it, I've decided to start triggering my dog when she's home. She's told me to \"just put headphones in and drown him out\".\n\nI'll play loud bassy music outside my room with the door closed. I'll also knock on my desk occasionally to mimic someone knocking at the front door (dog will bark for 20 mins if someone is at the front door and knocking).\n\nHere's the real kicker. When she is home, if he barks for more than 5 minutes straight, she will go nuts and tell him to shut up. She can't stand his barking for 5 mins, but she expects me to just suck it up for 8+ hours a day. This is the exact reason I've chosen this revenge. \n\nSo, AITA for driving my dog crazy while my sister is home?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Esh",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "From what I see ETA here. Shame on all of you for treating animals this way. \nAlso, more info needed. You say “my dog”. Is there another dog in the house, like you have one and so does your sister. \nThis all seems a little sus…",
      "id": 27,
      "comments": [
        {
          "score": 1,
          "content": "Bad wording. My sister's dog is what I call my dog.",
          "id": 28,
          "comments": [
            {
              "score": 3,
              "content": "Someone needs to step in and re-home the dog to someone who wants to take care of it and not use it as a pawn.",
              "id": 29,
              "comments": [
                {
                  "score": 1,
                  "content": "Ive had this conversation and im very close to rehoming him without asking her. I 100% agree that he deserves a better home",
                  "id": 30,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Do it. She clearly doesn’t care about him in the slightest. Give him to someone who will. Then you both can have better lives",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA. You are stressing out the dog to piss off your sister. Bullshit move on your part. How about realizing the dog is a creature in need of care and pitching in to help out? While I understand its not your responsibility it would be kind for you to take the dog out for a walk or two during the day. You will both get out of the house for a while and a tired dog is a good dog.",
      "id": 32,
      "comments": [
        {
          "score": 1,
          "content": "I know its a creature in need. I also know my sister isnt the one caring for the dogs needs. Yes I did step up and take him out, play with him and care for him for 9 months. As stated at the beginning of the post, I never wanted a dog, specifically because of the care factor involved.",
          "id": 33,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}