{
  "post content": "I'm 18f, I have one jacket, leather jacket ive had for 5+ years. Its fucked. Its held together with safety pins, staples and pure spite. Its torn, both outside pockets are ripped and my inside pocket has a hole that i keep losing money in. To be fair, I didn't actually have a jacket before this (lacking parents, grew up in foster care).I  Iove it. I also can't afford a new one so this will do until it can't \n\nI do not, however, like when people point out the issues. One of my classmates kept asking why I dont get a new one when the sleeve is close to falling off and there's holes everywhere. This friend has a dad who works for a major airline and managed to keep his job and a GP for a mother. She doesn't really get not being able to afford something. (Example of this is I said I don't qualify for financial aid for college since I cant declare myself an independent and I don't have parents to list a parent income and she just said take it out of your savings as if i have any). \n\nI told her to stop a few times, and she just kept saying that I get a new one. She's said the same about other things, especially when she came over to my place. But the jacket one annoyed me since this is the most obvious od the problems. After a while I said \"If your really want me to get a new jacket, you fucking pay for it or shut your rich mouth and drop the subject \".\n\nShe was upset, she called me an asshole and said I shouldn't have snapped at her. I don't think I'm an ah here but I may as well get a judgement. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 7768,
      "content": "NTA, if you keep poking people with a stick, they will eventually fight back.\n\nYou asked her to stop, she didn't, her loss. If she is *soooo* concerned about your jacket, you are completely right: she can buy you a new one.\n\nEdit: thanks for the awards, kind strangers.\n\nAlso OP, check the comments below, maybe it can help you financially speaking.",
      "id": 2,
      "comments": [
        {
          "score": 1453,
          "content": "She poked the bear, then was surprised when it bit her head off",
          "id": 3,
          "comments": [
            {
              "score": 14,
              "content": "I'm sorry but when you said that all I thought of was [this](\nhttps://images.app.goo.gl/2yjdccwyDNgkWgYUA)",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 876,
          "content": "Yeah, plus if you keep pointing something out like that and the person doesn’t change it, it means: \nA. It has a lot of sentimental value\nOr \nB. The person can’t afford a new item",
          "id": 5,
          "comments": [
            {
              "score": 1197,
              "content": "NTA. I don't know how to direct message you, or I would. I have 2 leather coats that I no longer wear. One is a full length coat, the other is a hip length jacket with a hood. I don't know what size you need, but I am willing to give you one or even both of them if it would help.",
              "id": 6,
              "comments": [
                {
                  "score": 350,
                  "content": "Hey u/RainbowBackRoads, same as u/Leading_Goose50. Not sure what size you wear but I have a couple of bad ass jackets that I’m happy to ship to you. Even if you want to use aforementioned badass jackets to patch your OG jacket! \n\n\nYou rock face for standing up for yourself.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Yay! Let's make sure she's taken care of!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I was able to send her a jacket, although with how many people it seems have offered...I’m starting to feel iffy about it",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 179,
                  "content": "\\^ This person is my hero\n\n&#x200B;\n\nOP, NTA. You asked her multiple times to stop. If she keeps it up she can put up or shut up.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Or put her out of your life. You don't need that.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "u/RainbowBackRoads",
                  "id": 12,
                  "comments": [
                    {
                      "score": 140,
                      "content": "Replying to this tag hoping you'll see it - you've got plenty of offers of jackets and coats, I'd like to help you out with whatever else you might need? Happy to prove my ID with my license/passport to the mods. I live in australia, and I suspect you don't, if you'd like an aussie care pack hmu.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I would be willing to help with shipping fees",
                  "id": 14,
                  "comments": [
                    {
                      "score": 1,
                      "content": "She responded to me but I don't have any more info. I wish I did.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Nice username. Tales of Alagaesia",
              "id": 16,
              "comments": [
                {
                  "score": 11,
                  "content": "Oh, yay! Someone knows my name reference.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Or C. They don’t want to change it and you should mind your own damn business about it!",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Or C. There's alot that can go with C so please don't make alphabetical lists anymore. Because then I have to run through everything under C. And alot of them aren't pleasant.",
              "id": 19,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 615,
          "content": "To be fair, parts of this post don’t make sense.  How is it that someone is declaring OP a dependent on taxes when they were raised in foster care and don’t have enough money for clothes that aren’t falling apart?  That should be the big priority here.  OP should be getting financial aid from their school, like no ifs, ands, or buts.  Talk with the financial aid office and figure out what needs to happen to get covered.  Books and tuition will be covered for you.  Start camping out at the office there and don’t stop until they give you that money, it’s the entire point of that department, and do whatever they say you have to do and fill out whatever forms they ask for so you get that money you deserve.",
          "id": 20,
          "comments": [
            {
              "score": 489,
              "content": "If the parents are deceased or OP has officially been in foster care/a ward of the court, they meet Independent student criteria and can file as such. It’s possible that parents are just deadbeats and everything has been done without paperwork, which the FAFSA is super inflexible on.\n\n*US based only.",
              "id": 21,
              "comments": [
                {
                  "score": 78,
                  "content": "My son filed as an independent student with his college because he didn't want the burden to be on me. I still help him pay for the portion he didn't qualify for aid for but he got full grant and a small student loan and only needed to pay a little out of pocket. Also my niece is a ward of the state and they paid for her to go to college because of it. OP should do more research no reason to live so poor if there are options available.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 143,
                      "content": "That might be individual school policy (if in US), or lack of oversight, but “my parents don’t want to pay” is not a legal reason to file as independent.  Even if parents refuse to give their information for the FAFSA, we can not classify a student as independent.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 64,
                      "content": "This is why actual estranged students get denied and have to drop out... people pretending.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "This is typically not a legal option.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Unless you're emancipated from your son, or your son is over 24, you're not filing FAFSA rules. I'm not going to be the police on this, but FAFSA may find out that you've been lying to them.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "If OP’s parents are deadbeats as @danericsson mentioned, it would surprise me if the parents are still claiming OP as a dependent on taxes, which makes it legally impossible for OP to file for aid as an independent student. Also, if they’re claimed as a dependent on ANY adult guardian’s taxes the same applies. I would say a school based aid like a scholarship would be great for OP. Again, if OP’s parents are deadbeats they likely wouldn’t give OP the financial information necessary to complete the FAFSA but if a different legal guardian claims them maybe they could? The whole federal student financial aid calculations are absolutely ridiculous to me but from personal experience with the joys of completing the FAFSA I have speculated the above. \n\n(US)",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "u/RainbowBackRoads, look up (above this post)!\n\nEDIT: Sorry, I’m on my phone and have no idea how this got posted here. I meant looked at this post: https://www.reddit.com/r/AmItheAsshole/comments/neefcz/aita_for_getting_pissed_when_someone_kept/gyh3ca7/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 8,
                      "content": "> https://www.reddit.com/r/AmItheAsshole/comments/neefcz/aita_for_getting_pissed_when_someone_kept/gyh3ca7/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nSame, if you have a venmo or PayPal, I would send you a couple bucks.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Yeah I have a friend who was technically a “ward of the state” when her mom was having some issues (her (much older) sister basically raised her), and because of that her college tuition was taken care of. OP should look into this if they haven’t already",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I’m trying to help a teen out who is in this exact situation. She’s trying to apply for financial aid now. Thought she was in legal guardianship but the orphan court has no record of that. Trying to figure out who has/had custody of her but I’m worried it will mess up her ability to get financial help. Any advice you might have is very much appreciated. It’s a hard system to navigate!!",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": "When in doubt, contact the financial aid office of the school she’s planning on attending (she should do the contacting, we try not to share aid info with anyone but the student and we look more favorably on a student taking ownership of the process). Schools can make specific professional judgements in grey area situations, though they may require their own documentation they can use more discretion than the FAFSA normally allows. Ask about a dependency override.\n\nCaveat: I’m in Admissions, not Financial Aid so I’m not an expert.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 309,
              "content": "Yes, u/RainbowBackRoads if this post is real then please read the post above. You are absolutely being scammed here/something is wrong, if you have no parents and are a foster child how do you not qualify for financial aide due to parents or dependency? And if someone is claiming you as a dependent, then they should be supporting you financially.\n\nAnyway, you need to squeaky wheel (as in the squeaky wheel gets the grease). You need to openly use your past and current situation, e-mail/call/talk to various finical aide, counselors, the office of the ombudsman, etc. Tell them you are a foster child but were still denied for foster aide, your clothing is falling apart and you can't afford it and everyone keeps commenting, and whatever else your financial woes are, and you have no family to help you and are struggling alone. Tell them you don't understand why you don't qualify for financial aide, you feel there must be some mistake, and can they help you? If they can't, say who can you talk to that can help you resolve this issue?\n\nDo NOT accept the first no as a wall you can't get past. I had a friend sort of like you. They were an orphan disowned by other family and had to leave school for a while due to a medical crisis. Then they were having trouble getting back in since the school wanted student loan payments first they could not make. They were told it was absolutely required. But then I wrote a (completely true) very sympathetic letter about their situation, contacted some people, what can we do, who can help them, etc. And it was eventually resolved. They got back into school, graduated. \n\nIf this is real you need to fix this. Keep asking. Keep talking to new people. Keep asking and looking to who else you can talk to. Don't  be ashamed to make them feel  bad for you. Be honest about all of your hardships, spell them out, and say I really need your help, please help me.",
              "id": 33,
              "comments": [
                {
                  "score": 151,
                  "content": "Also just adding on, if you were in foster care there are likely scholarships you qualify for strictly because of that. (Dependent on country/state I presume. I know my state has foster care scholarships).",
                  "id": 34,
                  "comments": [
                    {
                      "score": 46,
                      "content": "In my province, if you were in foster care there's funding for school after you age out and some universities provide free tuition to former youth in care",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "This.\n\nIt’s a really good point that the first no you receive may seem like a wall.  Break through that wall.  And someone in the government will be very interested to hear about the welfare fraud your foster parents are involved in.  Don’t stop until you find someone or many people who will listen.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Call your federal Congressperson's constituent services office. They have people whose whole job is to solve this kind of problem. My congresswoman was able to help a friend whose FAFSA was fucked because she left her abusive husband, and he wouldn't sign the paperwork for her to finish school, and was dragging his feet on the divorce. The congresswoman's office kept calling and calling the school, because there is a way to deal with women who have left abusive husbands but haven't divorced yet and can't get their FAFSA as a result, and the congresswoman calling finally got it sorted.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "They also might not know, they don't have an adult to teach them this things.",
              "id": 38,
              "comments": [
                {
                  "score": 29,
                  "content": "Likely this",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "Yes, my question too. With no legal guardians or parents how can the OP not qualify for financial aid? OP isn’t an emancipated minor (it seems) but a foster child?",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Perhaps the legal guardian refuses to complete documents? My mother used to use stalling on filling in applications for financial aid as a threat. She always signed just on the last day, when I was nearly throwing up with anxiety, and I would just get the paperwork in on time with about 5 minutes to spare. I had to use student legal support a couple of times to force her hand.",
              "id": 41,
              "comments": [
                {
                  "score": 34,
                  "content": "But, OP! There is student legal support! Please please reach out and find out how you can get to school if you so choose! \n\nWe are all rooting for you.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I completely feel your pain. My mother actually DID this. I didn't qualify for aid because of her income and she refused to sign the document indicating she wasn't paying so that I could reapply without her income considered. Without that there was no chance. I had to wait until I was a mature student to go get my degree. She still refuses to acknowledge the 6+ years she essentially took from me, or accept that she even did anything wrong. :(",
                  "id": 43,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That's just so nasty! Really bad parents are the last people to admit they are doing anything wrong.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My mom had a similar tactic, so I'd lie to her about when it was due. For some reason, she thinks I'm super honest and wouldn't lie to her, so it worked.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "\\*hugs\\* not going to bore you with a textwall on my own experiences but i know exactly where you're coming from, both as the kid and as someone who had to fight like fuck to be allowed to act in loco parentis for someone whose parents just wanted to keep those sweet 'parenting' tax breaks and welfare payments coming in while not actually caring if their kid was fed, clothed, and housed let alone in school.\n\nThe older you get, the further you are from the days where your parents can hang this shit over you, i wish you all the best in life :)",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": ">How is it that someone is declaring OP a dependent on their taxes\n\nthis is what stood out to me the most?? what - do everything you can to get the thousands you're likely entitled to",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "Came to the comments to figure this out specifically. I actually work with foster youth that are \"Non-Minor Dependants\" meaning they are 18-21yo and still dependants of the California foster care system - they either are enrolled in an independent housing program like the one I work for, or they find housing independently (rent on their own, stay with friends, continue living with foster family, etc) but they continue to receive foster system support. They keep their social worker, often receive stipend checks, and continue receiving money to what's called an \"emancipation account\" which they get access to once they exit foster care, whenever that may be.\n\n\nHowever, our program actually requires these young adults to be working or going to school in order to be eligible for the free housing we provide (they pay their own bills minus rent). And our case workers help them get financial aid and other benefits without any kind of issue at all. If OP is a NMD then the county he's a dependent of shouldn't be blocking any kind of financial aid - most of the county social workers I work with are trying to get any and every support for these young adults while they're in the system!",
              "id": 48,
              "comments": [
                {
                  "score": 9,
                  "content": "There are situations where kids just get jammed. Kids go into foster care, get taken in by someone who family who gets guardianship before 16 and subsequently abandon them or make the home life super hostile so the kid leaves. In this case, the kids don't qualify for any help.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP is a dependent of the state.",
              "id": 50,
              "comments": [
                {
                  "score": 24,
                  "content": "Jumping on the to thread to say that while I realize getting a new jacket is not the issue, I’d like to send you a little something to help you buy one if you’d like one. If so, can you PM me a Venmo or PayPal account? And obviously, NTA",
                  "id": 51,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I don’t think OP will see the comment if you reply to someone who isn’t them, i’d suggest that you find one of OPs comments and reply!",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Financial aid in the states doesnt work that way unfortunately. It took me YEARS to qualify because my parents werent dead. And even then i got a measely 1500$.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I also thought it was weird. I think there's a few conditions to be an independent and I think OPS legal guardianship status could qualify him for independence. OP should definitely qualify for financial aid.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My brother may or may not have actually poked me with a stick till i got back once. \n\n9 year old brothers stink...",
          "id": 55,
          "comments": [
            {
              "score": 2,
              "content": "He sounds exhausting, stay strong.",
              "id": 56,
              "comments": [
                {
                  "score": 1,
                  "content": "Lol",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "OP, if you're near Philadelphia or can have it shipped here, PM me. I might be able to fix it for you.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "NTA. \n\nThis person acted like a jerk repeatedly. You aren’t the AH here.\n\nAre there community organisations that can help you file for the ability to get financial aid?",
          "id": 59,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1103,
      "content": "NTA. People need to mind their own f*ng business.",
      "id": 60,
      "comments": [
        {
          "score": -104,
          "content": "Yea seriously. And I’m glad you have so many upvotes that agree with you. I’m sure all those people would also agree that people need to mind their own fucking business about whether someone is wearing a mask or not too.",
          "id": 61,
          "comments": [
            {
              "score": 57,
              "content": "[deleted]",
              "id": 62,
              "comments": [
                {
                  "score": 3,
                  "content": "\"Don't feed the TROLLS!\"",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -49,
                  "content": "It's just clothing like anything else. It doesn't effect anything and you've all been lied to.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[wait in this post you seem to be pro-mask. What changed in the last 50 days?](https://www.reddit.com/r/FemaleDatingStrategy/comments/mdyv9t/the_amount_of_old_men_who_feel_entitled_to_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "What the fuck.",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 826,
      "content": "Def NTA.\nIf she doesn't want to get snapped at, she needs to learn to respect peoples boundaries. You told her to stop, she didn't, she faced the consequences.",
      "id": 67,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 708,
      "content": "NTA. I feel for you and the difficulty you've had growing up. People should never criticize others' clothing, especially if it's because of the other person's lack of resources. \n\nBut having said that, I wonder a couple of things. Aren't foster parents legally responsible for providing things like weather-appropriate clothing for their charges? \n\nAlso, there are many places where you can get jackets that are reasonably cheap. You can get some like-new or vintage-look clothing at a thrift shop. And many places such as churches have clothing closets that provide free clothes to people in need.\n\nMaybe you live in a country where none of this is possible. But in the places I have lived, there are plenty of ways around this problem.\n\nHowever I'll return to my original verdict: NTA. Nobody has a right to make fun of or criticize your jacket.",
      "id": 68,
      "comments": [
        {
          "score": 540,
          "content": ">But having said that, I wonder a couple of things. Aren't foster parents legally responsible for providing things like weather-appropriate clothing for their charges?\n\nYes, but abuse in the system where I live in rampant. And the cheques they get barely covers new socks most the time. The jacket is overall weather appropriate, just fucked.\n\n>You can get some like-new or vintage-look clothing at a thrift shop.\n\nThe alt people snatch that shit up the second the charity shops open in the morning. \n\n>And many places such as churches have clothing closets that provide free clothes to people in need.\n\nOurs typically only do that for young children living out out of hotels, and it's an independent charity that runs off donations, not something like the mass basket. Pandemic made it take a hit.",
          "id": 69,
          "comments": [
            {
              "score": 427,
              "content": "NTA I once got it into my head I was going to get a cool 40 year old leather jacket for a song by shopping around charity shops and thrift places. Good fucking luck. Not happening. You know the staff at those places are one of the main reasons you and I don't get the bargains? They buy those jackets themselves, just write \"jacket - £10\" on the receipt and flog it themselves on ebay for £200. \n\nI've got a colleague like your friend who upon finding out that I haven't had a holiday in 10 years, asked me why I don't just go skiing with my friends \"for a couple of weeks\" I said \"because I'm not a millionaire, [Redacted]\" she said \"I'm not a... oh...\" sometimes they need reminding a bit harshly, they have a tenancy to forget or ignore the soft reminders.",
              "id": 70,
              "comments": [
                {
                  "score": 384,
                  "content": "I know way too many girls who ransack charity shops only to post what they got on depop 3 hours later to make 300% profit. And then they try to justify it? And I'm just sat thinking...I might actually have clothes if they didn't do that. By the time i get to charity shops they're *gone*. \n\nAlso the holiday thing, recently enough had a teacher tell me surely I'd been abroad in the last few years or even ever. No,  I really haven't. I haven't even been on the poor kids holidays. I've been as far as the river, but that's right across from my flat.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 176,
                      "content": "In the UK, our charity shops charge close to, if not more than budget clothing retailers for comparable items. Then people wonder why 'fast fashion' keeps producing so many new garments (harming the environment in the process) at a time when old garments are in style. \n\nCharity shops claim compassion but they exist to raise money for the charities that own them, not to provide poor people with inexpensive goods. What do those big charities spend most of their money on? The money they get from charging £10 for a shirt when a new one is only £8? Advertising and marketing, to get more money.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Dude, you are getting mad at the wrong people.  Your foster family isn’t using the money provided by the government for your care ON YOUR CARE.  That jacket is not “weather appropriate” if it is held together with safety pins and staples.  Stop letting them use you as a dependent on their taxes because they are basically stealing thousands from you, the money you would be getting from financial aid.  Those people are gross and you should cut all contact.  Call the cops if they keep up with the tax fraud, because that is what they are doing.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Man, it's really different in the United states. Here we have more clothes than we know what to do with, like there are at least 20 thrift stores in my mid-size city and they never run out. Do you happen to have a mailing address? I could try to find a jacket for you at the thrift store the next time I go.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Look at /r/visiblemending. Get a spool of thread and a needle, and you'll have an unfucked, unique, functional jacket that won't drop money anymore.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Might be worth having a casual conversation with the charity shop staff, see if they can hold you something semidecent in your limited budget. Some do try to help with interview clothes and stuff, so they may be interested in helping out.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Hey OP- just a thought, if you have Facebook. Search \"Buy Nothing (Insert your town name here)\", or freecycle (insert town name) We have these groups where I am from in the states, I'm sure something similar exists where you are. All posts are either \"Give\" or \"Ask\" where people can give away things they don't need or ask for things they do need to avoid having to buy new. This maybe a way for you to get more of the things you need from kind strangers. And the whole premise is reuse and recycle, less charity.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "im really sorry and I don't know if this would work but can you ask one of the workers to save you jackets that come in that are your size until you can check them out since you actually need a jacket? Maybe a nice worker would help? though I don't know if they're allowed to do this tbh",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Now they're starting back up, try car boot sales -- the bigger the better. While you do get people sniffing around for things for resale they're generally only after jewellry, phones and antiques.\n\nI'll give you a tip too; the best times to shop at a car boot sale are at the very beginning before stuff goes and at the very end, particularly when its starting to rain. If you see something you like but can't afford always go back at the end to see if its still there and haggle a bit.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I always loved the \"Where'd you go for spring/summer/winter vacation\" like...nowhere. Loved being a poorer kid in a high school of rich people, you get to hear all about everyone's beach trips and then get questioned why you're not tan.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "There was this thread on Twitter of girls justifying it by “oh everyone gets a chance to buy it “ and how everyone needs to make some money because cApItAlIsM",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I've had to tell someone \"update: I'M STILL POOR. Believe me, you'll know if that changes\" when they kept bugging me about replacing something.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Glad the thrift store I went to had people who don't know the value of things working there if thats the case. I found an antique bassinet that would easily go for $500 minimum at an antique shop and I bought it for $20.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "You foster parents lied to you. They got at least €352 per week for keeping you. €352 per week is the lowest level of payment. They were probably using the cheques to pay their rent or mortgage. \nhttps://www.citizensinformation.ie/en/birth_family_relationships/adoption_and_fostering/fostering.html#l078f5",
              "id": 84,
              "comments": [
                {
                  "score": 68,
                  "content": "To be fair they did take most of my wages off me too as rent and kicked me out the week after I turned 18. They weren't the nicest",
                  "id": 85,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Hey OP, I can buy you a coat. I’m not a creep. Just a lady with disposable income, having a shit day and wanting to do something nice.\n\nEdit: DM me OP. I’m for reals.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "They sound absolutely awful, I am really sorry OP. I'm glad you got out at least.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "OP, you really need to get in touch with a charity. In the UK, you can easily get estranged students allowance from sfe if you have a tutor or counsellor to sign the forms and verify",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "They may still be claiming that you live with them and still recieving those cheques you might want to talk to your worker and find out because that could be why you don't qualify for any aid",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I posted elsewhere, but wanted to respond directly to you. I’m happy to send you something to help with costs. You can dm me a venmo or PayPal name",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "I know that if I shared on my church's e-newsletter that I knew somebody that needed a coat, I'd have 20 offers (of good used coats or gift cards to a store with new ones) within the hour. So there are places out there that can fill the need.",
              "id": 91,
              "comments": [
                {
                  "score": 27,
                  "content": "The problem with hyper-local networks like that is that people have to be plugged into them. If OP doesn’t know you or someone who knows you, none of those coats will ever make it to OP",
                  "id": 92,
                  "comments": [
                    {
                      "score": 2,
                      "content": "My church is located downtown. Anyone can walk in to ask for help. If the church has the resources available, it’s given. Churches are given that charity tax standing for a reason.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 94,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My verdict was in my original post, to which this was a response.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I understand you want a jacket that fits your style and all, and I completely agree that etsy and depop people can go to hell, but maybe you should buy a backup jacket that isn't your style. Just.so you can be warm.",
              "id": 96,
              "comments": [
                {
                  "score": 0,
                  "content": "The problem here isn’t she can’t find the style, the problem here is abject poverty. Read the room.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 2,
                      "content": "No I understand that, but she seems like she's hell bent on getting a leather jacket if she decided to get a new one. (Which, obvi she doesn't if she doesn't want to or can't afford) \"all the alt people take them\" alt people don't take puffy jackets or hoodies or sweat shirts.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Posts like this are literally the reason I want to adopt kids are are aging/aged out if the system. 😥 I hope you find the help you need u/RainbowBackRoads!",
              "id": 99,
              "comments": [
                {
                  "score": 1,
                  "content": "I'm not in a position to at the moment but I really want to look into fostering in the future purely to save some kids from ending up in homes like the OP had.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Just a possibility for college for you, you might be able to apply for aid differently without parent information for having been a ward of the state.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Are you familiar with the japanese tradition of *boro* or patchwork mending? Related to that, there's *sashiko* a way to reinforce worn fabrics",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "OP if you really did grow up in foster care then I don't understand why you don't think you qualify for financial aid. You are considered independent and foster care students receive tons of extra benefits and help not available to others. \n\nContact the financial aid office at your school, fill out the FAFSA (I believe there is even a question on that form about being in foster care). \n\n[At any time since you turned age 13, were both your parents deceased, were you in foster care, or were you a dependent or ward of the court?](https://studentaid.gov/2021/help/orphan-foster-ward-court)\n\nThis is question 52 on the paper Free Application for Federal Student Aid (FAFSA®) form.",
              "id": 103,
              "comments": [
                {
                  "score": 1,
                  "content": "She's not in the US.",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "what i dont understand is how you don't qualify for financial aid?  wouldnt your foster parents be the listed income?\n\n&#x200B;\n\nand if you dont live with them now, arent you an independent?",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "I used to volunteer at a charity shop and we’d hold back specific items that people in need needed so others couldn’t grab them. So it might be worth speaking to the people who work there and seeing if they can hold a jacket or two in your size for you",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Women resource centers may help with clothing and other things like resume, etc.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 379,
      "content": "What's your size? I've got a load of real leather jackets that I turn into battle Jackets just sitting around my studio. If you pm me I'll post it to you. It might be one of my custom painted ones if that's okay.\n\nEdit: NTA, forgot",
      "id": 108,
      "comments": [
        {
          "score": 104,
          "content": "/u/RainbowBackRoads dude is offering you a free leather jacket ^",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "This is a really sweet offer. I would suggest DM-ing OP to make sure they see it!",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Did he respond? I’m in the US but the mom of teens. Hate to think of any teen without a good coat.",
          "id": 111,
          "comments": [
            {
              "score": 38,
              "content": "I pm'd him but no response yet. Also offered up to fix up the original and send it back. I was homeless for a bit and a friend gifted me a pair of Dr martens that I wore to literal pieces. Patched them up over and over again. I definitely get the sentimental value of a well worn item of clothing.",
              "id": 112,
              "comments": [
                {
                  "score": 6,
                  "content": "OP is a female btw. Just letting you know since I'm not sure if leather jackets are made to all fit.\n\nAlso, thanks for the new vocab! I didn't know battle jackets were a thing. I custom 3d printed a violin a while back and made it \"battle worn\" -- very similar to a battle jacket haha",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "how sweet!!!!!",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I wish I had an award to give you. This is so wholesome.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -63,
          "content": "If op doesn't take you up on that offer i will lmao. Free real leather jacket, with possible custom paint job omg\n\nEDIT: I didn't realize my comment came off as insensitive, I was just trying to show that I think they're awesome for giving an otherwise hella expensive jacket away. I wouldn't actually take a jacket from them when they can (and should) give one to op. I have a lot of trouble wording things.",
          "id": 116,
          "comments": [
            {
              "score": 18,
              "content": "What an insensitive comment to make on a post like this... check yourself, -_-QueenBitch-_- ... you’re really living up to your username here.",
              "id": 117,
              "comments": [
                {
                  "score": -3,
                  "content": "How was it insensitive?? I just thought that they were really cool to give a jacket to op, and expressed that within my comment.\n\n I understand how hard the struggle of being poor is, I would never try to invalidate someone in op's situation.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yes... the commenter wanted to give a jacket to OP who is stuck in a shit, unfortunate situation. Lemme just ask you this - how many jackets do you already have? \n\nA nicer and more mindful comment would have been, for example, asking the commenter if they have any jackets for sale so that you can support their art. Or even ask for social media to follow their creations and what they're making. Asking for the jacket if OP doesn't want is pretty rude considering the commenter *offered to give it to someone who doesn't have another option to wear* NOT *a random person on the internet who wants free things that the maker spent time and effort on*.\n\nedit - added some words",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 351,
      "content": "NTA. \n\nSide note. If you phased out of the foster care system. (You were in til 18) go talk to your financial aid office. They can help you with the paperwork for independent student. I phased out of the foster care system and didn't know until I was in my 2nd year that you can be independent you just have to prove it, and they will help. A foster kids success story at their school is good. They want to help. All the best to you.",
      "id": 120,
      "comments": [
        {
          "score": 131,
          "content": "I tried ringing them, explained my situation. Asked why I have to wait until 23 and just. Ahhh",
          "id": 121,
          "comments": [
            {
              "score": 130,
              "content": "https://studentaid.gov/apply-for-aid/fafsa/filling-out/dependency\n\nSo it looks like it's more on the fasfa side. But I know my office helped me. I believe we filled an emancipation declaration. Which you'd want anyway if you're not dependent. \n\nIt's nice that people think that everyone has parents that will support them after 18. Or have parents at all.",
              "id": 122,
              "comments": [
                {
                  "score": 132,
                  "content": "That's American, unfortunately not American. Our one is ridiculously stupid. One of my friends tried to list their child (had the kid at 14, kid was 4 when applying) as a dependent. The grant people said there was no way to list this child as a dependent, then the friend didn't get the grant because her benefits were €2 over the limit for household income",
                  "id": 123,
                  "comments": [
                    {
                      "score": 55,
                      "content": "I'm sorry!! My apologies on assuming. That's really messed up. I wish you I had the ability to help you out.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "So I live in America, but would this loophole still work for you? Here, married people can’t count as defendants so my boyfriend actually married his girlfriend in college just to get their EFC (expected family contribution) to 0, dramatically increasing the aid they got. Do you have any friends who’d be willing to just sign a paper at a courthouse?\n\nThis isn’t worth it for seniors because it changes the efc from the date the marriage is signed in, but if you’re in early days in college, it’s probably the best solution.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -13,
                      "content": "In the US there is Legal Aid and sometimes Law Schools have Legal Clinics where Lawyers in training can help with Legal advice on an income basis. I'm sure there are letters that can be written to establish you as independent. Does your Finanacial Aid office currently have appointments? If so make an appointment. The people who answer the phones don't always know what they are talking about. Also contact your old Social workers they might have information to help you out. Ask and keep asking until you get a good answer. Also Google your situation. Since I am in the US the US information keeps coming up Just put \"Foster Kid aged out of the system in XXXX country how to declare independence for University Finacial Aid\" See if anything comes up for you",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "If you're in England, note that your local authority have financial responsibility for your education if you were a Looked After Child.  Suggest contacting the Child Law Advice Service to ensure you're getting what you're entitled to.\nBut aged leather jackets can look very cool.",
              "id": 127,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "www.susi.ie/information-for-care-leavers/\n\nI presume you've already looked this up but if you're still with your foster parents, they don't take their income into account although you do have to give their details.\n\nIf you're by yourself, there's an 'aftercare' option on the online form.",
              "id": 128,
              "comments": [
                {
                  "score": 25,
                  "content": "u/RainbowBackRoads Please read this, you don't have to wait til you at 23 to get SUSI. Also contact Citizens Information. There is support available to you and they can help you find it.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Also, if you have a particular university in mind, check to see what other financial supports they offer. For example, [Maynooth has this](https://www.maynoothuniversity.ie/access-office/SAF) pot of money that they dole out to students during the year based on their individual circumstances and needs, and it's meant to support students who come from financial hardship. You'd be an ideal candidate, but you'd need to engage with that office and apply for it. \n\nThere are little dig-outs like that all over the place at Maynooth, and I'm sure other universities are the same. There's also a grant you could go for that gives foster children refurbished laptops to use in continuing education. \n\nMaybe you've already checked all this stuff out, but if you haven't you should go for it.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "First, NTA. She wouldn't drop the issue so you were blunt and factual in your explanation. \n\nSecond, I know there's a million different situations out there, but when i tried looking up help for kids leaving foster care UK, some different links that came up that i included below.\n\nThey may not apply to you at all, but i also know that sometimes the people you reach on the phone that should be knowledgeable, just aren't. It's sad, but you have to be your own advocate to make sure you're getting all the help and assistance that's available. The best advice I could give is to never accept a simple no (on important matters like this) without at least a little research.  Best of luck in all things. \n\nhttps://www.gov.uk/leaving-foster-or-local-authority-care\n\nhttps:///information-pages/services-for-children-leavinchildlawadvice.org.ukg-care/\n\nwww.thecompleteuniversityguide.co.uk",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "NTA, she earned it by going on and on. \n\nBack in the Punk Era, you could have bent her ear about the failure of capitalism etc, or gone full punk with you jacket.",
      "id": 132,
      "comments": [
        {
          "score": 44,
          "content": "I, too, was thinking that the jacket sounded pretty damn punk to me!\n\nBut the punk aesthetic is only cool if it's a choice. If it's worn because you have no other option then it's a whole different situation.\n\nOP would maybe benefit though from looking at some 70s/80s punk photos and seeing how leather jackets were customised back then. They could perhaps get some ideas on how to make the work that they have had to do by necessity look as if it was done intentionally for stylistic reasons.\n\nThings like adding extra safety pins in rows, for example, would be a good place to start.\n\nMaybe some duct tape art too? \n\nI still have my leather jacket that I wore in the early 90s. I haven't worn it in decades but I used to use silver paint pens to write on it. It's also painted on the back and sleeve with enamel paints, I believe. It's full of great memories.",
          "id": 133,
          "comments": [
            {
              "score": 12,
              "content": "Thick needle and DENTAL FLOSS thread is the punk aesthetic. Dental floss will not rip like cheap dollar store thread under load. \n\nJust have to figure out how youre going to get a needle through the leather. If its fake leather this might not work so well. Real leather will hold together with dental floss.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "NTA\n\nYour friend pushed a sore point way too far. You'd told her to stop several times and she chose not to. She deserved snapping at.\n\nWhat to do next depends on how much you value the friendship. If she's important to you, apologise for upsetting her but make it damn clear that she has been upsetting you over this for a long time.",
      "id": 135,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 33,
      "content": "I assume you're in the UK, I was under 23 when I was seen as a unsupported student, from what I read it's only having to evidence no support from parent/guardian for last 12 months.\nI found this via gov website https://www.standalone.org.uk/guides/student-guide/",
      "id": 136,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "NTA. Being financially challenged stinks. Just a suggestion here: Needle, thread and tape. Remove all the pins and staples. From the inside of the jacket lining, use heavy tape to close all the gaps in the leather while trying to line up the edges of the tears as best you can. Use needle and thread (heavy duty thread or 2-4x single thread) and make cross stitches  (very simple stitch where you make a line of Xs in a row: make a line of angled stitches down the line then on the reverse cross the angles with new angles making an X) where you taped. You can get creative by using contrasting thread colors or use the same color as the leather (whatever you prefer or can get your hands on). The tape holds the leather together while you stitch but will also provide reinforcement on the tears and stitches. Once you get the outside done, start with stitching the pockets and lining. If not enough fabric there to work with, you can cut patches out of scraps from donated clothing you can pick up for nothing at donation boxes. When you're done you've made it your own and with today's styles it will look deliberate. Being poor means you have to get creative in all things. I would push on the school aide. Maybe see if you get in to see a lawyer for a free consult for some pro bono representation to go after your government for cutting foster kids loose at 18 with absolutely no support and no assistance until 23. That is so very wrong.",
      "id": 137,
      "comments": [],
      "relation": "Support"
    }
  ]
}