{
  "post content": "I have been dating \"Elle\" for just under 10 months. Truly amazing relationship and I've fallen for her hard. I guess we've never formally talked about being exclusive (I honestly had to think back) but she always says things like \"when we get married...\" and \"our kids will be geniuses!\" that I think are sweet and I thought were a sign of us being in a committed/exclusive relationship. \n\nThe other night I went out to dinner with friends to a really cool bar/restaurant. I could see Elle inside but I don't think she could see me. She was with another guy. I know that she comes from a family where she has something like 42 cousins, all of whom live locally and she says she hangs out with them all the time. And the guy had more than a passing resemblance to her so I figured that must be the answer. I had planned on going over and saying hi when a lull happened at our table but in that time I saw the dude like pin her wrist to the table with his hand and she was trying to pull it away. Then he tried to really forcefully grab her behind the neck and pull her in for a kiss. I lost my shit and went charging inside and sort of grabbed the guys wrist and arm and told him to leave her the fuck alone. \n\nElle screamed something like holy shit what the fuck are you doing? I was like I'm helping you! She said she was just flirting with him and they were there together. At that point I was like what in the fuck are you talking about? We're dating! She said that yes we are dating but she's still dating other people. I was so freaking embarrassed because the entire restaurant was staring at us and I wanted to crawl into a hole and die. I left without paying the bill (I sent my friends money on apple pay so I didn't stiff anyone) and got an uber and went home and figured that was that and figured I'd never see her again. \n\nWell I had tickets to the Sharks game and Elle was supposed to go with me but I just wanted to wallow in self pity. But sure enough the showed up at the exact time we agreed decked out in blue and black complete with her shark pasties so she could flash the camera. She basically just said \"hey I need you to know I really like you but I'm still seeing other people\" I asked her I thought we were exclusive. She said if she choses me to be exclusive, I'll know it but I acted like a real asshole at the restaurant the previous night. I asked her what the deal with the grabbing was she said that was she and Ken's \"love language\" (great I know another guys name). She asked if I could be cool, so I said yes. The game was fun and she acted is if nothing whatsoever happened and was like the same, super cool, fun, loving girl she always had been. I felt like there was a 2000lb weight on my back. \n\nto help me find some clarity was I the asshole for assuming we were exlusive? Was I the asshole for how I acted at the restaurant?",
  "id": 1,
  "comments": [
    {
      "score": 2100,
      "content": "Eh, I'd just end it. Seems like she likes to keep a safe option open while seeing skeezebags.\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 191,
          "content": "I’m a little confused about why the other guy is a skeezebag...",
          "id": 3,
          "comments": [
            {
              "score": 497,
              "content": ">I saw the dude like pin her wrist to the table with his hand and she was trying to pull it away. Then he tried to really forcefully grab her behind the neck and pull her in for a kiss.\n\nIf you do that you are a giant fucking skeezebag.",
              "id": 4,
              "comments": [
                {
                  "score": 300,
                  "content": "We’re reading this from OPs point of view. We don’t know what was really happening. Also OP’s “girlfriend” *said* she was into it. If it’s all consensual there is nothing skeazey going on",
                  "id": 5,
                  "comments": [
                    {
                      "score": 168,
                      "content": "Ok well you can say that for literally every post.  If you aren't going to take what op says as what happened then there is no point coming to this sub.  This sub isn't do detective work to find out the real truth, it's would x person be the asshole in the situation presented.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 46,
                      "content": "Consensual rough play in private is fine, but to act like that in public is not. Others are going to see a woman in trouble and a man acting like an ass. Since we have a big problem with sexual assault, rape, domestic violence in the world, it's not okay to behave like that around others, who don't know what's going on, and haven't consented to seeing a woman being assaulted, consensual or not.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "People say all kinds of things to not have to confront the problems in their lives.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -3,
                      "content": "Found the Skeze Master",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "Iv been married 20 years, My wife LOVES this sort of treatment...am I skeezebag?",
                  "id": 10,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Would the average walker by think you are abusive/being forceful on your wife?",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "[removed]",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 37,
                  "content": "She said it was consensual(their love language) so not really\n\nYou could make an argument for not doing it in public, but i still don’t think it makes him a skeeze",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "I will describe subby stuff like this in detail for what's ok/not in advance of meeting up with someone who's into it. It's definitely a fine way to flirt but worrying other people by acting it out in public is a really bad move. It's so gross. It's not responsible, it's tacky & can be harmfully distressing to people witnessing it.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "She literally said she was into that..",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "bUt ThAt'S tHeIr LoVe LaNgUaGE",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Not if the girl is into it - which OP said she was.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -3,
                  "content": "It sounds like their “love language” might be rape/assault fantasy. I don’t mean to talk shit on anyone’s kink but.... yikes.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I dunno sounds pretty tame to me but I hang out on fetlife.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 136,
          "content": "NTA\n\nBut OP you are if you continue to allow someone to use you like this. Sorry, but after almost a year and talking about the future and kids and marriage it’s pretty much understood that you’re exclusive. That’s a girl that’s using you. Ditch her and find someone who will treat you the way you deserve. Quite frankly I’d have told her to fuck off when she showed up for the game. \n\nEdit: deleted a judgy comment",
          "id": 20,
          "comments": [
            {
              "score": -4,
              "content": "Why do you think she is using op ? Maybe that's just the way she lives. I agree she should have been honest about that.  But why shouldn't you date multiple people. Maybe op is her main.  We don't know.  I feel like people on reddit are always  a bit jugemental about these things.  I totally agree about your NTA jugment though.",
              "id": 21,
              "comments": [
                {
                  "score": 3,
                  "content": "I just personally feel (this JUST my opinion) that if want to date multiple people that’s totally fine BUT the issue I see is her not being upfront about it. If you want to see multiple people and have a “love language” with each of them that’s your business but this seemed to me more as if she was having a one-sided open relationship and not just seeing multiple people until she decides on one. To me, (and I am willing to admit I could be wrong) this is usually why you are seeing multiple people: you’re not ready to settle down with one just yet. But if she was talking future kids and future marriage that would make me think she was in a committed exclusive relationship. Per OP, didn’t she say we “will” have the cutest kids and “when” we get married and not “if?”",
                  "id": 22,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You got a point there ....",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "What decent human being lives like that? After 10 months there’s a reasonable expectation of exclusivity. If OP is too passive to start that discussion (and it honestly sounds like he is), then she should have started the convo herself or moved on from him",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": ">Maybe op is her main.  \n  \nAre you reading what you're saying? I'm just gonna assume you're the similar type of person based on what you said.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -13,
              "content": "Agree let me guess you do a lot of cool shit on your dime right.(because the man  is supposed to pay for everything) . Women cherry picking equality at it’s finest.",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "Actually, if I want to do “something cool” I am perfectly fine paying for it myself. \n\nAnd I’ll go you one better: if I was OP, I’d have had a friend at my place ready to go with me (guy or girl) in case she showed up for the game like nothing was wrong. Then OP could’ve laughed in her face and told her to go enjoy her love language/s with her other guy/s. Buh-bye",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Well, I do not want to be rude but why are you trying to be with her? She clearly does not love you or even like you enough after 10 months to be exclusive or to even not be mindful that she hurt you. \"If she chooses you to be exclusive you'll know it\" WT* is that? She is stringing you along while she is looking for someone better. Grow a pair of balls and end it.",
          "id": 28,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "She’s a first class user. NTA. I hope op will get over her..",
          "id": 29,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1265,
      "content": "[deleted]",
      "id": 30,
      "comments": [
        {
          "score": 395,
          "content": "I mean OP made a huge scene at the restaurant but it was nothing for her to still show up to the paid-for date with him like nothing happened. She's using him through and through.",
          "id": 31,
          "comments": [
            {
              "score": 123,
              "content": "[deleted]",
              "id": 32,
              "comments": [
                {
                  "score": 151,
                  "content": "You clearly didn't understand my point. I never said OP was wrong to do that. He thought his girlfriend was being pressed by another man. What I'm saying is, that's still an incredibly awkward and intense situation. I doubt she would have showed up to the sharks game acting like literally nothing happened. She still wanted that free shit. They didn't even talk between the incident and the game.",
                  "id": 33,
                  "comments": [
                    {
                      "score": -28,
                      "content": "it was starting with \"I mean\" it gives it a defensive connotation \"I Mean\" is basically \"but\" in alot of scenarios, i think thats what started all the confusion\n\nEDIT: Why am I being down voted. I understood the comment, im Not the other commenter either so I don't understand, I'm merely attempting to let others see how he may of been confused in the context.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -69,
                      "content": "You could’ve worded your point more clearly. It’s kind of ambiguous what you were trying to say in your original comment. It sounds like you’re criticizing OP",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1214,
      "content": "YTA to yourself for still going to the hockey game with her.",
      "id": 36,
      "comments": [
        {
          "score": 360,
          "content": "They had us in the first half no gonna lie",
          "id": 37,
          "comments": [
            {
              "score": 20,
              "content": "True",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "They had us in the first period, not gonna lie***",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Hockey games don't have halfs.",
              "id": 40,
              "comments": [
                {
                  "score": 2,
                  "content": "RIP",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "They breed em strange in the shire",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "Seriously, where's the self respect OP??? She's a user, 100%.",
          "id": 43,
          "comments": [
            {
              "score": 4,
              "content": "She's hot and he's thinking with his dick. This is not a good look. They are not using protection and she has an unknown number of partners - this is an STD infection waiting to happen.",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "Yup should kick her to the curb, block her and gone by yourself. Now she just got fucked by ol kenny and then made you pay for hockey tickets. Which are playoff tickets in the western conference final and aren’t cheap...you played yourself",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "But she had on the shark pasties to flash the camera...",
          "id": 46,
          "comments": [
            {
              "score": 28,
              "content": "sounds classy",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I was hoping he had both tickets and was going to take a friend and leave her in the parking lot.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Hopefully it was yesterday's game 2 because the Sharks lost",
          "id": 49,
          "comments": [
            {
              "score": 4,
              "content": "Don't kids go to the games??\n\n&#x200B;\n\n decked out in blue and black complete with her shark pasties so she could flash the camera.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Maybe not an asshole. I get that he might have been shellshocked and just went along with it but now he’s had some time to think and needs to grow some self respect. She knew he thought they were exclusive but never corrected it or mentioned it specifically so that if he ever caught her with other guys she could run back to the “we never had the exclusivity talk!!!”",
          "id": 51,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": " \"decked out in blue and black complete with her shark pasties so she could flash the camera. \"\n\n&#x200B;\n\nHmmm...",
          "id": 52,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "I know. OP is fucking pathetic. How could you still take her to the game?  My god dude, have a little self respect. What a rotten woman.",
          "id": 53,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "No need to kick him while he's down. He gets it now, it's why he came here.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 440,
      "content": "NTA. She led you to believe you were exclusive, and she seemed in distress at the restaurant so you intervened.  Personally I'd move on.  She's playing the field, and playing you.  Who knows how many other guys she's seeing and hooking up with.",
      "id": 55,
      "comments": [
        {
          "score": -14,
          "content": "How is it leading on when there was no communication about being exclusive or not?",
          "id": 56,
          "comments": [
            {
              "score": 6,
              "content": "If you ask me, if you are dating, you by default are exclusive unless talked about. Especially considering other things that were said",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -17,
          "content": ">NTA. She led you to believe you were exclusive\n\nYes. he is the asshole. (OP YTA) \n\nbecause he didn't DEFINE THE RELATIONSHIP. \n\nif you are not willing to define in you have no right to be upset when it doesn't fit your expectations.",
          "id": 58,
          "comments": [
            {
              "score": 3,
              "content": "If you're having sex with multiple partners (and yes, in this context kissing counts), they all need to know when 1. when a new person is added and 2. how often you are getting tested. She is the asshole for not letting him know he's being exposed to a petri dish.",
              "id": 59,
              "comments": [
                {
                  "score": -1,
                  "content": "> they all need to know when 1. when a new person is added \n\nIrrelevant to them. \n\n>2. how often you are getting tested.\n\n.... has nothing to do their relationship. they should get tested regularly if they're having sex with other people and are not exclusive. \n\n..... \n\n\n> She is the asshole for not letting him know he's being exposed to a petri dish.\n\nHE SHOULD FUCKING KNOW THAT ALREADY. \n\nyou have to use your fucking brain sometimes. its just that simple.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 1,
                      "content": "ahahahahahaha wtf you wild wyd",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -31,
          "content": "Nothing wrong with that btw. Playing the field is fine. I’ve had this same scenario where I thought we were exclusive but turns out nope. It’s hard, but some people want that for themselves. It’s just not for me or OP.",
          "id": 62,
          "comments": [
            {
              "score": 21,
              "content": "If you're playing the field, you A: let people know you are, and B: don't say things like, \"When we get married,\" or, \"our kids are going to...\".",
              "id": 63,
              "comments": [
                {
                  "score": -10,
                  "content": ">If you're playing the field, you A: let people know you are,\n\nHow bout if you want to be exclusive with the person you're dating DEFINE YOUR FUCKING RELATIONSHIP AND TELL THEM. \n\n.... you have every right to do that. why can't OP say \"I want to be exclusive\" \n\nhe had 10 fucking months to do it. \n\nbut what it didn't cross his mind?",
                  "id": 64,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Because that's why you date? To be exclusive? If you want to fuck around just fuck around, but why would she say things that only happen in an exclusive relationship? She's the asshole for making him think she was actually capable of having a normal relationship.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "If you're dating someone for close to a year and talking of marriage and children, that's a pretty damn clear sign you're exclusive.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "10 months in though?  I’ve done it too, but maybe for 2 months tops. That far in I’d be pretty sure we were exclusive, conversation or not.",
              "id": 67,
              "comments": [
                {
                  "score": -3,
                  "content": "I'm not saying I agree with her methodology but I will say clinging to self-evident norms is an excellent way to get yourself hurt. People have vastly different interpretations of the rules and to place assumptions on their way of thinking without flushing it out is to be naive.  \n\n\nI agree with your core philosophies and I believe we have a lot of values in common. There was a time in my life where I would have agreed on the implied contract of commitment. The world's fucked up though man and it's shitty to have a philosophy that doesn't work. Everything she did was under the assumption that *her* idea of dating was the one being used by both parties. This assumption on both their parts led to this conflict.  \n\n\nI would be happier with OP walking away from this with a better understanding of reality, not with a crowd-supported view that Elle was a bad person and that's that.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 435,
      "content": "NTA. My honest and true advice is to run from this woman as far as you can. I don’t care how beautiful she is, or how strong you thought the connection was. RUN. She was playing you,man. Friends of mine will often use the excuse that they haven’t had the official “relationship talk” to give them moral grounds to play the field. Men also do this often. Unless your moral compass is that far off, you would have to be blind to not see that she really couldn’t care less about your feelings, how embarrassed you were etc. It’s all about her! And it’s that type of selfish woman you should keep at an arms length. Save yourself the further aggravation, bc in the future she will expect you to watch her walk out the door and go on a date with other men and happily accept that. And welcome her with open arms when she slips back in bed at night. If you ignore this red flag, the universe will punish you for it!",
      "id": 69,
      "comments": [
        {
          "score": 62,
          "content": "> If you ignore this red flag, the universe will punish you for it!\n\nI couldn't have said it better. NTA!",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "She’s finally being honest about who she is and OP needs to believe her.",
          "id": 71,
          "comments": [
            {
              "score": 4,
              "content": "OP doesn't care because \"but she's hot\". the rules are different for hot women apparently, you can be dishonest and untrustworthy if you're attractive enough and people will worry that THEY are the assholes for feeling bad.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 210,
      "content": "NTA - Bail. Bail! BAIL!",
      "id": 73,
      "comments": [
        {
          "score": 77,
          "content": "Yeah 10 months is a fucking long time to decide that you're not exclusive. What does she want as a sign that you're exclusive?",
          "id": 74,
          "comments": [
            {
              "score": 1,
              "content": "Yeah I could understand if they'd only been seeing each other for a couple of weeks or a month and hadn't had a chat about what their relationship was but 10 months is a ridiculously long time and obviously implies commitment.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 171,
      "content": "NTA bro\n\nrun while u can",
      "id": 76,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 161,
      "content": "NTA - But you need a friend to go to hockey games with.\n\nHi, I live in Canada and don't know you, but if youre rich and ever want to fly a straight and married man down to watch a hockey game with you with no strings attached, fucking PM me. \n\nImagine taking this girl to a playoff NHL game. Talk about un-deserving. \n\nNTA.",
      "id": 77,
      "comments": [
        {
          "score": 43,
          "content": "lol, no she's a genuine fan. She actually played and tried out for both the Canadian and USA women's programs (her dad was born in Winnipeg). It's one of the things I thought I loved about her.",
          "id": 78,
          "comments": [
            {
              "score": 42,
              "content": "> lol, no she's a genuine fan. She actually played and tried out for both the Canadian and USA women's programs (her dad was born in Winnipeg). It's one of the things I thought I loved about her.\n\nOkay, that's fair.",
              "id": 79,
              "comments": [
                {
                  "score": 35,
                  "content": "Yeah but really if he does want a new hockey bro to go with that doesn't suck, you get first dibs, but if you're like.. sick, or dead, or something, I get second dibs.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 38,
                      "content": ">  sick, or dead, or something\n\nSounds like Second Dibs has some pretty concrete plans on becoming First Dibs.",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Had to shoot your slapshot. Respect",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "It's fine if she's a fan, but playoff tickets are an exclusively-dating level of date.",
              "id": 83,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 118,
      "content": "NTA, I mean you sort of made the best assumption based on all the information you had at your disposal. I think after 10 months there's a reasonable expectation of exclusivity and it does sound like (at least how you describe) the other guys' actions could be interpreted in a very shady light. \nI guess the question is after finding this out, why stay with her? I get that it's cute she says all the stuff about your future which is apparently her love language with you, but now you know that she has \"love languages\" with at least one other person. I don't think she did anything wrong but it's certainly something you don't have to put up with.",
      "id": 84,
      "comments": [
        {
          "score": 102,
          "content": ">after 10 months there’s a reasonable expectation of exclusivity.....\n\nAfter 1 month there is reasonable expectation \n\nAfter 2 months it’s probable\n\nAfter 3 months it’s exclusive, regardless is you sit down and actually say “hey, are you like, my girlfriend now?” Like a couple middle-schoolers.  \n\nIf she’s been dating this guy almost a year, and makes comments about marriage and kids, they are exclusive, and she cheated. There is no “assumption”, or “probably”, they are 100% exclusive.",
          "id": 85,
          "comments": [
            {
              "score": 12,
              "content": "If you're seeing multiple people (not one night stands) it's your responsibility to make that really clear early on. When I was single and seeing multiple people I would make sure I told them before hand \"I'm seeing other people, this isn't going to be exclusive and if you're not okay with that this won't go any further\". It's the decent thing to do",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA for assuming you were exclusive, I mean 10 months? Talking about kids and marriage? And so if you assume that and you thought a guy was trying to molest her then yeah I get trying to protect her. I mean I never have had an \"exclusive\" talk it always was a given after a few months especially if kids and marriage are being discussed. I know you are going to get a lot of \"communication\" comments, but c'mon who wouldn't think it was exclusive.\n\nEdit: typo",
      "id": 87,
      "comments": [],
      "relation": "Support"
    }
  ]
}