{
  "post content": "I’ve (m32) been dating Siobhan (f32) for 6 months now. She’s always been very vague about what she does for a living (sati things like writing and working from home writing) but recently, one of her friends mentioned something and I finally dragged it out of her. She’s an author, she write and self published romance and erotica stories and novels and while not rich, she’s able to make a living out of it.\n\nI googled her name and couldn’t find anything so I confronted her about this.\n\nShe said she’s writing under a pen name so I demanded she gives it to me so I know what she does.\n\nShe refuses saying she doesn’t want it to be leaked even by accident and no one knows.\n\nI accused her of not trusting me and she still refused which was really annoying.\n\nI tried nicer approach and told her that I want to know her fantasies so I can try it out with her and she told me that what she writes aren’t her fantasies but her readers and she’s still not going to tell me.\n\nAt night I tried to check her laptop for her pen name but she changed her password before bed. I was annoyed and told her she clearly doesn’t trust me and it’s not fair because I have a right to know what she writes especially since it’s a sensitive topic and I don’t know her if I don’t know her pen name.\n\nShe was furious I tried to look on her laptop and told me to go home. Before leaving I told her when she calls to apologize, I expect to get her pen name with the apology.\nShe called me an asshole on my way out.\n\nI thought she’d call by now but she hasn’t. My sister told me I was the asshole and I should apologize but I just don’t see it and need. Second opinion. Was I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 69332,
      "content": "YTA\n\n>I have a right to know what she writes \n\nBased on what? You WANT to know what she writes - don't confuse that with having any sort of RIGHT to the information.",
      "id": 2,
      "comments": [
        {
          "score": 20722,
          "content": "Gosh I missed the \"I have the right to\" part. \n\nThe red flags are strong with this one.",
          "id": 3,
          "comments": [
            {
              "score": 17561,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 7939,
                  "content": "Crazy that she doesn't trust him...",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5249,
                      "content": "Yeah it’s literally his next sentence that he’s annoyed she doesn’t trust him. How clueless can a person actually be??",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 814,
                      "content": "It's truly a mystery as to why! He seems sooooooo trustworthy and innocent and not controlling or invasive at all!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 618,
                      "content": "If it was me I would never divulge that information to him after the way he behaved. Hopefully, she's just done with him now. How creepy to become obsessed with her writing to the point of going behind her back! \n\nHe must be delusional to demand an apology when he is the one behaving badly and then add insult to injury by making the ridiculous demand for the information she already said she wasn't giving in order to accept the apology he isn't owed.\n\nSeems to me he's big time insecure about her knowledge of erotica and only wants to read what she writes to have more leverage to make power moves like the one he tried and failed to pull off here.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 314,
                      "content": "Indeed. He gives off major spoilt AH vibes. First argument they have he’s telling everyone",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "He's going to make a good villain in her next book 🤣",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "OP needs to realise that she can't tell possible ex- boyfriends her pen name and expect continued anonymity. Since he is trying very, very hard to be an ex boyfriend by proving that he can't be trusted and by being controlling, he has illustrated clearly why she should not tell him.\n\nFrankly if you really, really want to keep a secret you tell no one, ever, and that includes a spouse you love and fully trust.  The girlfriend is in no way obliged to tell him this ever even if they had been married 20 years.\n\nHey OP YTA, and I suspect, also the ex-boyfriend.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "Yep. He’s exactly the kind of person who would then become unhinged and judgmental based on what she writes, OR start demanding that she “give him” any sort of fetish or erotica and attacking her verbally if she refuses.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Nor should she, in fact she should run. \nThis smacks of effort to push boundaries and use her legit career as a shaming tool.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Yeah… he is only invading her privacy and forcing her to give up information she does not want to give… I can’t imagine why she does not trust him at all…",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Crazy that she hasn't dumped him.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1193,
                  "content": "> At night I tried to check her laptop for her pen name but she changed her password before bed. I was annoyed and told her she clearly doesn’t trust me\n\nThis has to be a troll\n\nThe amount of mental gymnastics you have to go through to even have this thought\n\n\"I wanted to invade my girlfriend's privacy but she changed her password to prevent me from doing the exact untrustworthy thing I am accused of being untrustworthy for doing. How dare she not trust me!\"\n\nLike, literally acknowledges that changing your password to prevent intrusion is a sign of distrust, without realizing it is their own behavior which is the reason for being distrusted",
                  "id": 16,
                  "comments": [
                    {
                      "score": 425,
                      "content": "Sadly it's probably not. Too many guys out there behave like this asshole for me to assume it's fiction.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 328,
                      "content": "\"Sex is for men, and specifically for me! If she's writing erotica, she MUST have fantasies that I have a right to use to get my dick wet! IT'S ALLLLLLLLL ABOUT ME!!!!!!!!!!!\"",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 49,
                      "content": "I don't think so. I met a lot of guys like this. \n\nHere's the worst: I draw NSFW erotic art, and I had a roommate who thought I was in the wrong for not letting him see my work. He was furious and kept finding excuses to break into my room and get on my computer.\n\nHe really acted like he was owed access to my most personal and private stuff.\n\nThis guy also opened another roommate's mail to make fun of what they bought. He was shocked that the rest of us didn't find this funny. Everyone was furious at him. He didn't understand he committed a felony. In his mind, doing something for a laugh made everything okay.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "Nope. You're lucky to not know that guys like this one are a dime a dozen....there's a ton of them out there, just like this.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 37,
                      "content": "No... this is exactly the kind of thing a narcissist would do/think.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1151,
                  "content": "He accused her of not trusting him when he went behind her back.  He is totally unhinged.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 26,
                      "content": "With the demands and rights he thinks he has - it's a shocker.. /s",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 962,
                  "content": "I personally liked\n\n>I tried nicer approach and told her that I want to know her fantasies so I can try it out\n\nHe basically says she didn't give me what I wanted, so I tried to manipulate the information out of her. That girl def dodged a bullet. \n\nYTA, OP.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 373,
                      "content": "And laughing at, \"They're not MY fantasies!\"\n\nLike it's literally her job that she does to make money. She isn't writing for her own tittilation. She's writing to earn a living.\n\nPeople mistaking it for her own fantasies and approaching her inappropriately trying to use it on her is probably one of the reasons she wants to protect her true identity.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 218,
                      "content": "That jumped out at me too. His “nicer approach” was just to shift manipulation tactics.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "It was at that point that I really, really wished that his girlfriend was writing hardcore gay BDSM.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Not to mention ... if she's got any fantasies that she wants to share, she'll do it in her own time and not when he decides.\n\nWell, would have done. I suppose she might not dump him, but I hope she does. This guy is bad news.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 67,
                  "content": ">I was annoyed and told her she clearly doesn’t trust me \n\nShe doesn't trust him because he's...  untrustworthy.  OP, a trustworthy person doesn't try to break into someone's private spaces - like their laptop.\n\nSuch an AH.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 46,
                  "content": "This guy is EXACTLY the type to out her real name to the psychos of the world. Of which he might be one.  I think he will be waiting for that call until judgement day.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 35,
                  "content": "Yeah someone trying to go through my laptop would be immediate grounds for me to dump their ass. In a trusting relationship I have no problems giving people access to my things, because I trust them. But if it’s before that period of trust, or if you still violate whatever thing I haven’t trusted you with, then you bet your ass that’s where it ends",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "How about I expect to get the pen name with the apology?",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "Agreed, literally everything op is writing is just such a gigantic red flag for being manipulative, and he wonders why she doesn't trust him. What I'm wondering is why she's still with him",
                  "id": 33,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I have a feeling she won’t be after this",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "It's also incredibly transparent even from OP's description that each attempt was totally insincere, and entirely aimed at convincing her to reveal information she didn't want to reveal.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1425,
              "content": "This dude selling red flags down at the red flag outlet mall. Probably gives them out at Halloween too.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "OP is full of red flags..\n\n\"I dragged it out of her...\"\n\n\"I demanded...\"\n\n\"I accused her...\"\n\n\"I have the right to know...\"\n\n\"I expect to get the pen name, with an apology...\"\n\nThe gf needs to flee.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "Yeah at 6 months he has no rights to know any of this -  he’s ridiculous!",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "How about wanting to know what she fights so he he try it on her without once considering that she has no interest in doing anything erotic she writes. Idk, dude seems so  predatory, and only knowing this woman for 6 months. It’s all types of yikes.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I feel like we all have a right to know her pen name, so we can buy all her books, make her rich and support the shit outta her right to privacy ;)\n\nYTA so badly op",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8225,
          "content": "There's a certain kind of person who believes being in a relationship confers to them some kind of ownership over their partner. But the truth is that a relationship is an agreement and bond between two separate people, who together come to an agreement on the terms and boundaries of their own relationship. \n\nOP, if your girlfriend wants to keep this part of her life private for now, then you need to either respect that, or, if you can't handle it, end the relationship. You don't get to *go snooping through her personal devices against her explicitly stated wishes*. Jesus Christ.",
          "id": 41,
          "comments": [
            {
              "score": 2660,
              "content": "Not to mention that they’ve only been dating for 6 months. If they’d been married for 20 years he might have more ground to stand on, but dating for 6 months? That’s nothing",
              "id": 42,
              "comments": [
                {
                  "score": 1490,
                  "content": "Regarding after 20 years: If he's sneaking in and trying to break into her laptop? You are allowed to have your secrets in a relationship. This idea that you have to share every, single, solitary fact about yourself with someone else is damaging.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 25,
                      "content": "He couldn't announce any louder that as soon as he found out the pen name, he'd tell everyone",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "yeah, she's right not to trust him! he is totally TA.\n\nfast forward a few weeks and he'll be on here saying \"my girlfriend broke up with me and I had a huge tanty. AITA?\"",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Hell, I’ve been married for almost 51 years and I don’t open my husband’s mail. **You don’t own people or their thoughts.** OP, the sooner you realize this, the sooner you’ll find a healthy relationship.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I hope he ends it, for her sake. Actually, I hope *she* ends it. I hope she's not too far in to see how toxic this is.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2396,
          "content": "Bro wtf. YTA. She wants to keep it private and you keep invading her privacy to the point of going through her private things. You sound super weird regarding her basic request to not share her Penn name with you. Honestly, it sounds like if you found out you would blast it off everywhere so your gf has a point. Hope you never find out.\n\nEdited to add you're 32. Grow up. What is this behavior?!",
          "id": 48,
          "comments": [
            {
              "score": 874,
              "content": "If they ever break up he will definitely tell everyone, just out of spite.",
              "id": 49,
              "comments": [
                {
                  "score": 1002,
                  "content": "I have a feeling they *DID* break up.  He just hasn't figured it out yet",
                  "id": 50,
                  "comments": [
                    {
                      "score": 320,
                      "content": "I have a feeling you're correct. Especially since she still hasn't called to apologise (yet another WTF moment from this guy).",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Or she did tell him and he doesn’t want to accept that so to him, they are not…he seems like that type of controlling….",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 208,
              "content": "It doesn't matter if he is the most trustworthy person on earth. \n\nShe does not want to share this info, and she doesn't need a reason not to.",
              "id": 53,
              "comments": [
                {
                  "score": 41,
                  "content": "Exactly! Then he admits he approached her in a rough manner. Also he wants information she gives no one after 6months of dating?! \n\nI’m sorry why do you think you qualify for that information sir? \n\nAlso agreed no matter how trustworthy he is. But he literally proved he isn’t trustworthy by then going in her laptop. How dumb is this dude… YTA",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Also the part about he wants to know what she writes so they can try it out because he thinks it is what she wants. That's not how writing works, if it was then these crime serial killer authors must be dangerous to know.  Hahaha. OP is seriously YTA. I hope the gf dumps him asap.",
              "id": 55,
              "comments": [
                {
                  "score": 26,
                  "content": "Tbf, he did say he was just trying that tack. With all the subtlety of a toddler. Or a brick. Or a toddler brick. It was pretty clear to all including Siobhán that it was a lie.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "OP is 32 pulling this?!? I’m even more disgusted",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "Omfg he’s *32?!?!*",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Yes. I was shocked that he wasn’t a pimply teen because he definitely seems like one. She needs to dump his ass and get with a grown-up.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1428,
          "content": "She accused me of not trusting her.... Yeah, I don't know how she would do that...",
          "id": 60,
          "comments": [
            {
              "score": 76,
              "content": "Such a mystery!   It's not like he tried to go behind her back and snoop through her computer or anything. This guy is no bueno and ripe for dumping.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "He has no respect for her",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1271,
          "content": "\"She does not trust me with this important information!  So I will go to the INTERNET to bitch to total strangers about it!\"\n\nWho needs drugs when we have this level of unironic surrealism.",
          "id": 63,
          "comments": [
            {
              "score": 132,
              "content": "\"AND tell total strangers her first name instead of making one up, THAT'S how little I give a shit about her privacy!\"",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "And tell my sister , who probably knows her IRL",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Right?? Can't begin to fathom why she wouldn't trust him, with both his reaction AND his \"AITA\" go-to...this is the EXACT type that would pull back the curtain on her identity the moment he didn't like something minute she did. \n\nInfinite AH, in case it wasn't clear. 🤷",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Bonus points if her actual first name is Siobhan.",
              "id": 67,
              "comments": [
                {
                  "score": 27,
                  "content": "Right?? Like Siobhan is such a specific name I'm sure it's not a fake one",
                  "id": 68,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Maybe her name is Aoife or Eilis or Eithne and he's more subtle than we think. Although that assumes curiosity about the world in general and a sense of irony, and he clearly has neither.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 776,
          "content": "*Dude complains saying he feels she doesn't trust him. Looks at her laptop without her consent*",
          "id": 70,
          "comments": [
            {
              "score": 37,
              "content": "And complains to her that she doesn't trust him because she changed her password. Seriously, can one person be this oblivious?!",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 366,
          "content": "This is great material for her book. O ya, he’s probably already dumped by her and didn’t realize it- also great material for her book",
          "id": 72,
          "comments": [
            {
              "score": 522,
              "content": "Oh, he’s dumped.\n\nOP: you’d better give me your pen name when you call to apologize \n\nAlso OP: wonders why she hasn’t called yet",
              "id": 73,
              "comments": [
                {
                  "score": 46,
                  "content": "Ik, that part made me genuinely laugh",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "*Looks at watch*\n\nYup, he's going to be waiting a very long time.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 504,
              "content": "He's PERFECT for the shiddy ex that gets dumped for a hot billionaire CEO who also just happens to be a werewolf. 🤣🤌",
              "id": 76,
              "comments": [
                {
                  "score": 152,
                  "content": "“When you’re ready to apologize, I expect your pen name along with it”😤 Ong that’s what an ex would say in a novel before she meets the man of her dreams😌 here’s hoping!",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "Hey at least they are going to be a supportive and trusting werewolf.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "At least you could trust a werewolf to keep a secret!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 338,
          "content": "Exactly OP is TA\n\n6 months yikes - not even engaged or married.\n\nIn any scenario you have the right to ask and she has the right to decline to answer. You must respect that.\n\nIts ironic you are telling her she doesn't trust you when you are essentially trying to \"break\" into her laptop and invade her personal property, right to privacy and / or intellectual property rights. You have shown to her you do not deserve the trust as you are willing to go against her will.\n\nImagine you guys break up and you post her in revenge and essentially dox her. Or even if you are dating still and you do it by accident.",
          "id": 80,
          "comments": [
            {
              "score": 52,
              "content": "I suspect she already has experience of this, now she is extra careful.\n\nAnd OP barges in shitting all over her boundaries, expecting trust, then shitting on any possibility of that as well. THEN, and this is the best part, HE expects an apology.\n\nYeah, he is special. She must write about him under another name and send that to him. Call him a beta and everything. \n\nYTA.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "After 6 years of marriage I could see being hurt that my wife didn't trust me enough to bring me in on what's going on with her career. But after 6 months of dating? She has no obligation to tell him anything. This guy is seriously unhinged.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 28902,
      "content": "YTA \n\nWell you’re just a walking red flag OP, demanding, controlling and feel like it’s your right to snoop.\n\nThat’s just grim.\n\nEnjoy being single",
      "id": 83,
      "comments": [
        {
          "score": 6685,
          "content": "I'm seeing a potential plot for her next book here.",
          "id": 84,
          "comments": [
            {
              "score": 3296,
              "content": "Yep. It will be about a wonderful person who sweeps a writer off her feet after she left a controlling abusive boyfriend of... 6 months.",
              "id": 85,
              "comments": [
                {
                  "score": 676,
                  "content": "And then she finds out he died in a way that mirrors how someone dies in her current book - in a very graphic scene that causes him a lot of pain.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 305,
                      "content": "While investigating his death, police discover the coincidence of her writing about the exact manner of his demise and she becomes a suspect, and now has to prove her innocence: another genre UNLOCKED! WooHoo!",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "Jeebus, I missed the 6 month thing.  Just when I thought OP couldn’t get any sketchier.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I initially missed that he's 32. THIRTY TWO!! 🤦",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 479,
          "content": "And hoping this man stays single for a long time. No woman should be inflicted with this human incarnate of a red flag.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 389,
          "content": "I demand OP give us his real name. We have a right to warn women everywhere.",
          "id": 91,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 329,
          "content": "‘Confronting’ her - about being an author he doesn’t know.\n‘Accusing’ her of not trusting him - tries to access her laptop without permission - he’s not trustworthy.\n\nRightly gets kicked out but Demands an apology - he might get a thank you, not every day the trash walks itself out.",
          "id": 92,
          "comments": [
            {
              "score": 24,
              "content": "honesty, he keeps going on about how 'she doesn't trust him' while he keeps giving her reasons not to. This guy is a walking red flag!",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "I normally don't like making quick judgements about a person based on a few paragraphs, but I just have a feeling OP would be the type of person to leak the girlfriend's real name if she breaks up with him. I hope she stays firm in not telling him her penname, breaks up with him, and stays away from him.",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "You forgot manipulating - \"I tried a nicer approach by saying I wanted to know her fantasies\"",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23981,
      "content": "YTA with bells on.\n\nShe wants to write erotica from the safety of anonymity. You don't get to remove that.\n\nYou're a double asshole for expecting an apology.\n\nIf she were here, half the sub (more like 95%) would be urging her to dump your controlling ass that would probably doxx her in the event of a messy breakup.",
      "id": 96,
      "comments": [
        {
          "score": 6262,
          "content": "Luckily, she already did (effectively) dump him when she kicked him out of her home.\n\nI really hope he doesn't have a key.",
          "id": 97,
          "comments": [
            {
              "score": 4538,
              "content": "She knew enough to change her laptop password, she seems smart and on top of it.  If he has a key and she doesn't want him back, those locks are already (hopefully) changed.",
              "id": 98,
              "comments": [
                {
                  "score": 3050,
                  "content": "Yep. I’m a writer with a pen name. He’s done. She’ll never trust him.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 2947,
                      "content": "What’s your pen name? I have a right to know.",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 43,
                      "content": "I am not a writer, but a reader. I read everything. I kinda just wanna know OPs gfs pen name so I can support her so she can upgrade her security to make sure he NEVER finds out. \nAlso, all you writers out there hit me with your top tens but make sure you add yourself somewhere in there.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2080,
          "content": ">your controlling ass that would probably doxx her in the event of a messy breakup.\n\nI 100% have that impression after reading this post. OP's girlfriend is very wise to not give OP this kind of personal information when he seems like the type to weaponize it later. His behavior has demonstrated him to be someone who is fundamentally untrustworthy.",
          "id": 102,
          "comments": [
            {
              "score": 972,
              "content": "I 100% believe he would have, too. He would've probably ran to all her friends and family and been like \"did you knooowwww that she writes porn?! for a LIVING?!?!? your daughter/friend/colleague is basically a sex worker!\"  \n\n\nWhy can't men just leave women with their erotica alone.",
              "id": 103,
              "comments": [
                {
                  "score": 355,
                  "content": "And in the event that they didn't break up he would absolutely be the time to use her work to shame and abuse her further during the relationship to try to break her. On top of that he would be expecting her to share her writing income with him the entire time.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 46,
                      "content": "I can see it now... \"You wrote about this in a scene in your story so why won't you just give it to me? You can sell your fantasies to everyone else but you won't even give me your body in this act that you wrote because popular erotic fantasy and not necessarily because you have any interest in ever performing the act yourself? I DEMAND you do this with me!\" OP is beyond TA status.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "But he would do that after demanding that she perform any and all fetishes or kinks that he dreams up.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Further to this: why can't everyone just go back to minding their own business. OP is right fucked in the head if he actually believes he has any right to anything private of hers unless she so chooses to share it. Fundamental human rights that would fall under. For clarity, I mean her fundamental human rights to privacy, not his made up one's to someone else's privacy.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 372,
          "content": "Heck, I didn’t even read far enough to get to the apology part.  I hope Siobhan has already dumped him.",
          "id": 108,
          "comments": [
            {
              "score": 325,
              "content": "Yeah. He gave her til sundown to give him the password and an apology.\n\n\"Sorry I let you into my life\" work?",
              "id": 109,
              "comments": [
                {
                  "score": 49,
                  "content": "Til sundown?!  What is this, a spaghetti western?  I sincerely hope this is really just Siobhan just working on her next book, because this is almost too crazy to be real in 2023.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 33,
                      "content": "“Meet me in the town square. Sunset. Bring your pen name or I bring you down pard’ner”",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": ">controlling ass that would probably doxx her in the event of a messy breakup.\n\nI thought this immediately. \n\nHe's not safe at all.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19540,
      "content": "I can’t believe she doesn’t trust me, he said, as he attempted to break into her laptop.",
      "id": 113,
      "comments": [
        {
          "score": 3302,
          "content": "[removed]",
          "id": 114,
          "comments": [
            {
              "score": 378,
              "content": "Yeah, I'm off down the entire chain of replies to see if I can find a single one that's on his side. Will update IF I find one.\n\nEdit: Found one! [Update below](https://www.reddit.com/r/AmItheAsshole/comments/114stgg/comment/j8y33l5/)!",
              "id": 115,
              "comments": [
                {
                  "score": 234,
                  "content": "It’s reddit. There will always be some lobsters or tater tots showing up to blame a woman.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Those are good foods! Don't taint them by comparing them to those losers. 😄",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "I saw one ESH when I did my scan, but the comment thread is a lot bigger now. I'm keen to hear the results! 😂",
                  "id": 118,
                  "comments": [
                    {
                      "score": 344,
                      "content": "So you have to scroll down literally about a thousand takes. Probably several thousand by the time you're reading this.\n\nThen you will see a wasteland of ^(comment removed by moderator) interspersed with a few people saying ESH for *reasons* (mostly an inability to grasp the concept of a pen name and why she'd want to keep that secret, as well as a *massive* and somewhat stunning inability to understand the a difference between *writing erotic FICTION* and real life) (seriously, someone ought to explain the concept of truth vs fiction to some of these people), and the occasional bro going \"dude, ignore these people, she's probably just writing \\[derogatory terms that will inevitably get this post removed by the moderators once they get around to it\\].\"\n\nYou really have to go *unusually* far to find anyone who thinks this guy isn't a complete asshole.\n\nEdit: There's one N T A that's only a few hundred down, but it's obviously sarcastic.",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1527,
          "content": "I can't for the life of me figure out why she wouldn't trust this man.",
          "id": 120,
          "comments": [
            {
              "score": 922,
              "content": "i thought girls *liked it* when men sneak behind their backs after being told repeatedly NO. \n\nwomen! so hard to please!",
              "id": 121,
              "comments": [
                {
                  "score": 44,
                  "content": "She does like it she is just playing hard to get… /s",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Right?? Someone who doesn’t respect privacy and boundaries DURING a relationship, totally wouldn’t be the type to tell the whole world her secrets in the middle of an angry break up (that may be just around the corner now!)",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 657,
          "content": "\"Why does she keep implying I can't be trusted?\" whines OP as he actively violates the Computer Fraud and Abuse Act the second she leaves him alone with her devices.",
          "id": 124,
          "comments": [
            {
              "score": 30,
              "content": "I might ask nicely if she would let me read some of her work, if she felt comfortable doing so, without the author's (her pen name) attached. But I would never demand anything. \n\nHe sounds like a controlling AH who doesn't know that she is already his ex.",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "That was my favorite moment. The hypocrisy! I practically hear the swoosh as the point flew by his head.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "“Why won’t she trust me with her pen name?”\n\nI mean, she can’t trust you with her laptop, so…",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "And they've only been dating a grand total of 6 months 🤣",
          "id": 128,
          "comments": [
            {
              "score": 25,
              "content": "I've been with my s/o eight years and it's none of his damn business what name I use on Twitter, Instagram or any of my damn social media. We're not even Facebook friends! 😂😂",
              "id": 129,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "\"I can't believe she thinks I would do exactly what I'm doing right now\"",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7689,
      "content": "[removed]",
      "id": 131,
      "comments": [
        {
          "score": 1126,
          "content": "100 percent, OP is YTA. I can't quite believe he thinks he is in the right here. Such a breach of trust! If I was her girlfriend I would never trust OP with anything again.",
          "id": 132,
          "comments": [
            {
              "score": 808,
              "content": "The fact that he assumed her writing was her fantasies and something he needed to involve (read: CENTER) himself in says a lot. He doesn't respect or understand her art, and the fact that he can't have access to/control of it drives him to toxic behaviors and attempts at violating her privacy MULTIPLE times. Traaaash.",
              "id": 133,
              "comments": [
                {
                  "score": 405,
                  "content": "“I tried nicer approach” - being clear that he had no interest in being involved in her fantasy & just wanted her pen name. \n\nOP, YTA",
                  "id": 134,
                  "comments": [
                    {
                      "score": 295,
                      "content": "“I tried a nicer approach” = “I tried a different manipulation tactic”",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "If he's snooping, demanding and manipulating for the info now, how's he going to act when they break up? Like GF can trust him to keep that secret?",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 875,
          "content": "Dude-you clearly can't handle dating an erotica author. If you were able to dig up her writing the next thing you'd be doing is demanding to know when she did each activity in the book. And then demanding that she does them with you \n\nGo to therapy and deal with your insecurity, your autocratic attitude and your jealousy",
          "id": 137,
          "comments": [
            {
              "score": 444,
              "content": "> Dude-you clearly can't handle dating ~~an erotica author~~.\n\nFTFY",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "The fact that he’s 32 and doesn’t get any of this is absurd.",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "This is one of those fun ones where OP is clearly TA but is so oblivious that he can’t see that. My favourite part was him complaining she doesn’t trust him after he tries to go behind her back and log into her laptop to get the pen name. Zero self-awareness.\n\nYTA",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6555,
      "content": "[deleted]",
      "id": 141,
      "comments": [
        {
          "score": 2555,
          "content": "OP very much seems like the sort that would dox her if they ever got in a fight, and also like he just wants to read what she writes so he can make sure he \"approves\" of it and if she wrote anything he didnt like he would harass her over it until she promised to stop writing. His ex is probably realizing she dodged a huge bullet.",
          "id": 142,
          "comments": [
            {
              "score": 1461,
              "content": "oh no, he is *definitely* the type to dox her. within a small time frame, he accused her of being untrustworthy, \"demanded\" she do what he wants, tries to manipulate her, tries to *break into her laptop* and gets upset cause she changed the password.\n\nop isnt just a bad bf, he was set out to destroy her",
              "id": 143,
              "comments": [
                {
                  "score": 532,
                  "content": "[deleted]",
                  "id": 144,
                  "comments": [
                    {
                      "score": 91,
                      "content": "His whole post reads like that of someone who is a hair's breath away of committing physical violence upon their S.O.\n\nIf she calls him she better have a support system to  run because it is only a matter of time before he gets violent.",
                      "id": 145,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "This. The fact that she preemptively changed her password lends a whole hell of a lot of credence to this. She /knew/ he was capable of this but probably didn't expect he'd actually do it. Now that he's stepped over that barrier you can bet the people in her circle are telling her to leave his ass entirely.\n\nTo which all I can say is thank fuck OP decided to sulk like a child instead of turn right back around and love bomb this poor woman. Gave her the chance to dump his ass for good and I hope she takes it.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Mostly I tell people to break up because honestly there are a lot of people out there. Why settle for less then exactly what you want. If the person you are complaining on here is throwing up red flags than it’s just time to just say “next!”   That being said, this guy is messed up.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 298,
                  "content": "He would dox her and then say its his RIGHT to dox her because she shared her pen name with him. Even if he stole it.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 43,
                      "content": "He'd say \"she already gave him the pwd to her laptop so she basically gave it to me\"",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "He's already attempting to out her right here and now......",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 492,
              "content": "[deleted]",
              "id": 151,
              "comments": [
                {
                  "score": 198,
                  "content": "market full scale shelter steer fearless dolls friendly crime pen\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 152,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "Dude doesn't even realise he's dumped.",
                  "id": 153,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "Her lawyer will call if she needs anything from you, OP.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Especially that he’s expecting that all to be her apologizing and giving him the information he was trying to steal! OP doesn’t even realize he’s not her bf any more…",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "He was already looking to dox her to see if it was worth a paycheck.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "The whole “I tried a nicer approach” part really got me. He’s not even trying to hide that he’s just throwing a variety of manipulative tactics at her until he gets his way. Like he just thinks this is how normal people function.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "If I were her, I’d also let go of the blabbermouth ”friend” who spoke out of turn to OP.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6299,
      "content": "[removed]",
      "id": 159,
      "comments": [
        {
          "score": 1241,
          "content": "He's not a clown, he is the whole circus",
          "id": 160,
          "comments": [
            {
              "score": 316,
              "content": "This is an insult to clowns and circuses.",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 270,
          "content": "> I don't blame her, I mean you're literally fucking posting about it on reddit.\n\nShe's read him perfectly at every turn. Like 25% of OP's problem here is the worry that she might be inside his head",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "WTF...\n\n>**At night I tried to check her laptop** for her pen name **but she changed her password** before bed. I was annoyed and **told her she clearly doesn’t trust me** and it’s not fair because **I have a right to know**....\n\n\nHow does OP not see why his EX does not  have any reason to \"trust\" him?",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3956,
      "content": "YTA!! 100% YTA!\n\nYou have been dating for 6 months. Erotica writers can face horrible situations if they are recognized by fans or by people who disagree with what they write. Also, if she's making a living this way and you were to find out she writes something you don't like, would you start pressuring her to stop? That's a bridge she's not ready to cross with you. Respect her boundaries and keep your hands OFF her work equipment.",
      "id": 164,
      "comments": [
        {
          "score": 1314,
          "content": "OP 100% was going to use her pen name to blackmail and control her",
          "id": 165,
          "comments": [
            {
              "score": 537,
              "content": "Or just send her writings to her family as revenge when she breaks up with him.",
              "id": 166,
              "comments": [
                {
                  "score": 60,
                  "content": "Aita for sending my exes erotica writings to her family after I broke up with her due to the content of her erotica which I demanded to know?",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "This. It her career and livelihood plus reputation and privacy. It is the same as stuff you have to keep secret when working in some company.\n\nPlus dating someone who knows what you write would f up the whole process. Suddenly you are not writing to your fans, you write and it reflects straight to home life. No no no.\n\nHow many times when things go sour would people keep this secret? Even if they were married she shouldn't share the name for the sake of securing the process. She writes for the fans, not for OP.\n\nYTA.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3121,
      "content": "YTA\n\nYou are absolutely *not* entitled to any of her information and the fact that you think otherwise is frightening. Period.\n\n> I tried nicer approach\n\nNo, you tried to manipulate her and thankfully she didn’t fall for it.\n\n> when she calls to apologize, I expect…\n\nYou should expect to be dumped.\n\nAgain, YTA.",
      "id": 169,
      "comments": [
        {
          "score": 786,
          "content": "The worst part of this is the real reasons he actually wants this info is because there's elements of being unable to control her and also jealousy because he's concerned she's writing about things he's unable to provide her.  He's clearly not actually interested in her best interests at all.",
          "id": 170,
          "comments": [
            {
              "score": 226,
              "content": "How did he manage to hide this level of crazy for 6 months?!  Wish we could talk to Siobhan.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Seriously, I'm shocked this person is 32. It sounds like a 15yo who got their relationship advice from really bad movies.",
              "id": 172,
              "comments": [
                {
                  "score": 36,
                  "content": "There is a lot of toxic men (and to be fair people in general) out there who've got through life by ignoring everyone who's ever said something negative about them and have 0 interest in changing their behaviors.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": ">\\> I tried nicer approach  \n>  \n>No, you tried to manipulate her and thankfully she didn’t fall for it.\n\nOn the bright side, he's giving the perfect demonstration of the difference a Nice Guy ^(TM)  and an actual Good Person.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2551,
      "content": "Yta - you come across as someone who would threaten to rage-leak her name every time she displeased you",
      "id": 175,
      "comments": [
        {
          "score": 680,
          "content": "100% this. His entitled attitude alone shows he would definitely hold it over her head if he ever found out. Not a good person. OP, YTA.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "Yup, absolutely a doxxer",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "He definitely gives revenge porn vibes! Glad she trusted her instincts.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}