{
  "post content": "My boyfriend (19M) and I (20F) have been dating for about three years and we've been making plans to get married and get our own place. (I currently live with his grandparents, and him with his parents.) Life happened and we've been struggling to get there and due to medical reasons I've been debating moving back in with my parents for my safety. My boyfriend was a little hesitant with it as I moved out to escape a toxic household but has come to the conclusion it's necessary for my physical health considering his grandparents aren't home when I am and they don't have the ability to help me medically if necessary.\n\nAfter coming to this agreement I went to talk to my parents as they had offered a place for me to come back to since I was having these medical issues, my mom (45F) even offered to help pay for a service dog as it was recommended by not only my doctor, but my therapist and psychiatrist. When I went over to discuss coming back, my dad (45M) pulled me aside and had a long conversation about how he felt that they should be helping my boyfriend out of his toxic situation. I completely agree that my boyfriend has a horrible living situation and I want him out of there too, but my dad said he'd be taking the room that was offered to me. I told him I was planning on moving back in, due to my medical problems, but he said he figured I'd be okay since I was \"getting help\".\n\nI was really frustrated and told my boyfriend about the situation. He was baffled and said, \"As much as I want out and as great as an offer that is, you need it more right now.\" And left it at that. He told me to tell my parents that he respectfully declines their offer, but I could tell he was at least a little bummed at not being able to leave. When I told my parents they told me they wanted to talk to him about it so I should ask him to come over. I told them that I didn't want to be a middle man for them and they should talk to them himself. They then told me they didn't want to make him feel like they were overstepping and I haven't really talked to them about it since.\n\nIt recently came up in conversation with a friend of mine and they called me and a**hole for guilting my boyfriend with my problems, and I should let him go live in a safe place where it was more affordable for him to save money. I tried to explain how I physically can't work right now because of my health problems but they said work didn't matter since my current rent was cheaper than his current rent, and he couldn't afford basic medical help due to the crazy amount of rent his parents charge. I never physically told him he couldn't move in with my parents (it's not my decision anyway), and I won't stop him if he wants to (even though I would prefer if he didn't), but he told me he doesn't want to. AITA here?\n\nEDIT: We can't move in together right now due to money, and parents won't let us live with them together unless we're married. Religion plays a part in the situation, but it isn't the big issue right now. His grandparents don't want him moving in with them due to wanting him to serve a religious mission. My grandparents are all out of state so they aren't options.",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "Info you are adults why can't you move in together....????",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Personal choices and religion, we want to be married before moving in together. It overall would make us more comfortable and keep people from being icky.",
          "id": 3,
          "comments": [
            {
              "score": 13,
              "content": "What does this mean? You move in with someone before you get married to find out if they ARE icky...",
              "id": 4,
              "comments": [
                {
                  "score": 0,
                  "content": "I more meant to keep people from being judgemental and cruel by icky, I agree that moving in together would help with diagnosing if there are certain issues but we're willing to work on things together. We communicate and are willing to work around things, but moving in together isn't an option right now anyway since I'm without a job and he has hardly anything saved due to his parents' crazy rent.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I'm not Christian, but I'm pretty sure Jesus said don't judge others. You're never going to please everyone, particularly in a religious setting. My advice is to save money and create some space with your families as they sound rather toxic. Do what you can with your current means. I hope your health improves and you and boyfriend have a happy life together!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It’s 2023. People do not judge that.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "So.... you're living with HIS grandparents, he's living with HIS parents, now BOTH of you want to live with YOUR parents instead? This is bizarre, but if you've been dating for so long, plan to get married etc. and your parents clearly care for your boyfriend, why wouldn't you both move into the same room?\n\nI don't really know how to judge this because it's so strange. If your parents prefer your boyfriend to move in rather than you, but he prefers to help you than help himself, I'll go NAH. But man this is a weird one.",
      "id": 8,
      "comments": [
        {
          "score": 3,
          "content": "Parents won't let us share a room unless we're married, and they don't have space for us to have separate rooms. They actively are avoiding me coming back all of a sudden and want him to move in instead.",
          "id": 9,
          "comments": [
            {
              "score": 10,
              "content": "This reeks of religious issues. Why would your parents prefer your boyfriend to move in than you, who has medical issues? You're only 20, an adult, but barely. He could live with his gp and you could live with your parents? But if your parents don't want you to move back in, not much you can really do. \n\nDon't get married just for religions sake.",
              "id": 10,
              "comments": [
                {
                  "score": 2,
                  "content": "He can't live with his grandparents due to a religious issue (they want him to serve a mission even though he physically can't, at least right now) they are willing to pay to send him on said mission but not help him with his living situation, we want to get married not just for religion, but that's just a thing on the list my parents have.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You are both too young, too immature and too financially unstable to consider marriage or living as a couple.  Both of you need to stand on your own two feet before you worry about your next step.   Religion aside, make your own way financially and then do what makes you happy and your religion dictates.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "It sounds like if you move back with your parents and he stays with his, you won't have any ability to save money and will remain trapped in this situation for the foreseeable future unless you are able to work / he makes more money. If you can manage with your issues to stay with his GP and he moves in with your parents that may be the best temporary option. But it doesn't sound possible to please everyone and actually have a life.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "I don't get this, we're missing alot of backstory as why you moved from your parents to begin with? \nAnd why his grandparents rather than yours?",
      "id": 14,
      "comments": [
        {
          "score": 2,
          "content": "My parents don't feel like they want to treat me like a person and refuse to communicate with me. It was causing me a lot of stress and mental health issues, but my physical health has declined severely.",
          "id": 15,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "OP said her bf's grandparents aren't able to provide the assistance she needs if push comes to shove. Hew bf is also aware of it. So how is this even a debate? She has no other choice, hence obviously NTA. Also, her parents are absolute morons for not comprehending that if they take her bf instead of her, she might face serious trouble. How tf are they even considering this?",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I expressed that I didn't want my boyfriend moving in with my parents. I think that might make me an asshole because he lives in a much worse situation currently.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I feel like people are missing the point of this post. I know my boyfriend and I aren't financially stable enough to get married or move in together. We both know that. We aren't planning on getting married or living together until things are better. I just wanted to know if I am crappy for not wanting him to live with my parents instead of me. Or if my parents are being crappy for wanting my boyfriend to live with them instead of their own daughter.\n\nWe aren't making any financially crazy decisions any time soon, I need help medically and neither of us have the money or time to take care of me right now.",
      "id": 18,
      "comments": [
        {
          "score": 3,
          "content": "You said his grandparents can't really assist you and even your boyfriend is aware of it. Given these circumstances, you're not an asshole because you don't really have a choice and your parents are morons for not comprehending this.",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "Thank you, I felt that was the case but after my friend yelled at me I was doubting myself...",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "If they're your friend they probably understand the gravity of your condition, so sorry to say this but they're a moron as well.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (19M) and I (20F) have been dating for about three years and we've been making plans to get married and get our own place. (I currently live with his grandparents, and him with his parents.) Life happened and we've been struggling to get there and due to medical reasons I've been debating moving back in with my parents for my safety. My boyfriend was a little hesitant with it as I moved out to escape a toxic household but has come to the conclusion it's necessary for my physical health considering his grandparents aren't home when I am and they don't have the ability to help me medically if necessary.\n\nAfter coming to this agreement I went to talk to my parents as they had offered a place for me to come back to since I was having these medical issues, my mom (45F) even offered to help pay for a service dog as it was recommended by not only my doctor, but my therapist and psychiatrist. When I went over to discuss coming back, my dad (45M) pulled me aside and had a long conversation about how he felt that they should be helping my boyfriend out of his toxic situation. I completely agree that my boyfriend has a horrible living situation and I want him out of there too, but my dad said he'd be taking the room that was offered to me. I told him I was planning on moving back in, due to my medical problems, but he said he figured I'd be okay since I was \"getting help\".\n\nI was really frustrated and told my boyfriend about the situation. He was baffled and said, \"As much as I want out and as great as an offer that is, you need it more right now.\" And left it at that. He told me to tell my parents that he respectfully declines their offer, but I could tell he was at least a little bummed at not being able to leave. When I told my parents they told me they wanted to talk to him about it so I should ask him to come over. I told them that I didn't want to be a middle man for them and they should talk to them himself. They then told me they didn't want to make him feel like they were overstepping and I haven't really talked to them about it since.\n\nIt recently came up in conversation with a friend of mine and they called me and a**hole for guilting my boyfriend with my problems, and I should let him go live in a safe place where it was more affordable for him to save money. I tried to explain how I physically can't work right now because of my health problems but they said work didn't matter since my current rent was cheaper than his current rent, and he couldn't afford basic medical help due to the crazy amount of rent his parents charge. I never physically told him he couldn't move in with my parents (it's not my decision anyway), and I won't stop him if he wants to (even though I would prefer if he didn't), but he told me he doesn't want to. AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    }
  ]
}