{
  "post content": "So I (26M) own my house and it has a in-ground pool. Since I live in a warm weather state, my friends love to come over. The past few months, my house has turned into a hangout spot among my friends. My best friend Tyler is dating Gwen. Gwen has a friend named Julie. We’ve all known each other since freshman year of college. I’ve always had a crush on Julie and we’ve always been part of the same group. One night a few weeks ago I decided to just go for it and texted her to ask her out. She told me that she liked me as a friend. I told her I totally understood and thought that would be the end of it. \n\nWell the next pool day came. I typically send out giant group text to invite everyone. I decided to not invite Julie this time. But she showed up. Not even with Tyler or Jenn. She came with some of the other friends in our group. And it was just really awkward. She tried talking to me the WHOLE time. I’d say something quickly and try to leave. She partnered with me for every drinking game. We have never spoken that much even before I asked her out. After she left that night I told Tyler/Gwen what happened. Gwen told me she already knew. I told them that I didn’t really want her around anymore. Gwen said she would talk to Julie about it. Well this past Saturday I had another pool day. Similar thing, sent out the text, left Julie off of it. I invited a girl that I’ve been talking to. Well Julie shows up again. But this time she spends the whole day talking to the new girl I brought. They became “besties”. Julie even told the girl that I asked her out before. It was just incredibly awkward for me. \n\nSo this Sunday I texted Julie individually and told her that I didn’t want her around anymore. And that she shouldn’t come to the next get together as I felt uncomfortable. She didn’t respond. But now people in the friend group are calling me an AH. Saying that I host most weekends so it’s pretty harsh to put her out. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 18746,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 7195,
          "content": "He just doesn’t want someone in his home that started acting really freaking weird and clingy after she turned him down.",
          "id": 3,
          "comments": [
            {
              "score": 7644,
              "content": "Someone he knows for what seems to be years acted a bit weird after he told her he had feelings for her, for *two parties/get togethers*, so he banished her from his house.\n\nLet's at least get the facts straight here.",
              "id": 4,
              "comments": [
                {
                  "score": 6248,
                  "content": "I'm pretty sure that Julie thought she was friends with OP, not \"his friend's girlfriend's friend\". If they've all been friends since freshman year and he's now 26 - that's 8 years.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4883,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Yeah I mean, he's 26 going on 12. This is some incredibly immature behavior for someone of basically any adult age.\n\n\\-I'd like to date\n\n\\-I'd like to say friends.\n\n\\-Cool, totally understand\n\nNarrator: he did not, in fact, understand. And it was not, in fact \"cool\".",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 958,
                  "content": "Also it’s says he uninvited her after asking her out,  not because she acted weird at the next hangout. So alright he didn’t want to feel awkward or embarrassed but certainly seems just upset she turned him down.\n\nAlso she was maybe just being overly nice at the next party/hangout to show him no reason feel awkward which had the opposite effect.\n\nEdit: Clarification of first sentence.\nUninvited/ didn’t invite after rejection, not later when she was being over nice.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 806,
                      "content": "She may have been talking to him a lot because he specifically didn’t invite her, and she was worried their friendship was damaged by her turning him down",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 523,
                      "content": "Actually he said that he didn't invite Julie to the next pool day after he asked her out.\n\n\"She told me that she liked me as a friend. I told her I totally understood and thought that would be the end of it.\n\nWell the next pool day came. I typically send out giant group text to invite everyone. I decided to not invite Julie this time.\"\n\nOP is the AH, he specifically left his friend out of the pool party invitation because she had turned him down. Sure she turned up anyway and acted weird towards him but he kicked her out of the group to begin with just because she didn't want to date him.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 118,
                      "content": "Either that or she wanted to get to know OP a little better to make the judgement on whether or not she was interested, since he stated they didn't really talk too.kuch prior.\n\nIdk if OP is an asshole, but definitely naive",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": ">Also it’s says he uninvited after asking her not because she acted weird at the next hangout. So alright he didn’t want to feel awkward or embarrassed but certainly seems just upset she turned him down.\n\n\nI mean, it's totally in his right to say that he can't be just friends. But he didn't do that. If he did, it would be nah.\n\nThe only thing that's questionable is what happened between Julie and ops new girl, why did she tell her that op asked her out? What is the use in that?",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Might want to check that again. He uninvited her after getting turned down, and she showed up anyways with others of the group.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 396,
                  "content": "it’s even *worse*. he banned her even before she acted weird. of course she was going to act that way after being excluded for not being interested in him. OP immediately showed that he only valued her for her availability, with no regards to her as a human being",
                  "id": 14,
                  "comments": [
                    {
                      "score": 104,
                      "content": "You're right, the below quote is from before the other parties occurred:\n\n> Well the next pool day came. I typically send out giant group text to invite everyone. I decided to not invite Julie this time.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Right!!! Op says I thought that would be the end of it, like Jules was supposed to be like oh shit I hurt this guys ego, guess I don’t have friends anymore",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "He didn't ban her though. Banning her would have involved turning her away at the door.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 228,
                  "content": "Also let’s get the timeline straight: he asked her out and gets rejected, he doesn’t invite her to the next hang, then she acts “weird and clingy.”\nHe did not “ban” her for being clingy, he 100% is punishing her for turning him down. She may have started hanging around him more post rejection to show she doesn’t care about letting it get in the way of friendship.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yep, 100% right, I skipped over that in the previous comment.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 153,
                  "content": "He didn’t want her to come before she “acted weird”. He was already wanting to exclude her but she didn’t know. She’s being nice to him and wants to show things aren’t weird between them, she’s still his friend.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "With \"weird\" actually being \"look, I'm still your friend and I'm still trying to be close to you, you mean something to me beyond any romantic potential.\"",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "After he had ALREADY uninvited her BEFORE she had a chance to act weird. I’d act weird too if some guy asked me out, I said no, and then my next invite got “lost”. Not inviting her was seriously beyond shitty behaviour by OP.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "He also didn’t invite her to the first party held after he asked her out, before any “weirdness” occurred. He wanted to ban her from the instant he was turned down. I put weirdness in quotes because, while it’s possible she was acting strange, he may have been throwing her behavior way out of proportion because *he* felt awkward. Honestly, she probably was s little extra friendly in an attempt to make it clear she wasn’t bothered by him asking her out, and trying to get to relax a bit and move on. However, he sounds like he was hyper aware of any interactions with her since he felt awkward enough to not invite her. Her little bit of extra friendliness didn’t feel friendly to him when what he really wanted was to avoid her. \n\nOP, I get it. Putting yourself out there to be rejected doesn’t feel great, but Julie didn’t do anything wrong. If you are going to take a chance on a person in your friend group, you have to live with the fact you may still need to interact with this person even when they turn you down. Yes, it’s okay to be a little awkward at first but soon it’ll be a distant memory and it will go back to normal. What you’ve done by ban her from your home is to make it even more awkward for you. Now every last person in your group knows you were rejected by her. They also know your ego is fragile and if you don’t think they are discussing this amongst themselves, you are wrong. If you had acted with even an iota of maturity this situation would have passed quietly and quickly. \n\nAlso, i’d like to point out that there’s a second reason she might have been extra friendly at the next party. She might have been reconsidering her answer. She may have given you a knee jerk response when she said no, but after some consideration thought it could be worth a shot. Her extra attention might have been her trying to get to know you better, or her way of trying to let you know that she had a change of heart. Regardless, even if this is what was happening, banning her from your home because she rejected you certainly reinforced her first answer was the correct one.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Nah, he banished her BEFORE that.  As soon as she turned him down - no more invite",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "He booted her before she even came over once.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 951,
              "content": "He stopped inviting her BEFORE she got weird and clingy.",
              "id": 26,
              "comments": [
                {
                  "score": 257,
                  "content": "FR why was this looked over",
                  "id": 27,
                  "comments": [
                    {
                      "score": 663,
                      "content": "It only proves the commenter’s point more: he kicked her out of a friend gathering for rejecting him romantically, which is super shitty behavior. \n\nAlso “clingy” is by his estimation. She was probably just trying to maintain the friendship and not have things be awkward. Which is what grown ups do. 🙃\n\nYTA op, and it sounds like incapable of friendship with women.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Yeah I kinda missed that in my further reactions, but this really does go against 90% of the counterarguments I'm getting in this thread. He started off by attempting to banish/ghost/whatever her.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 80,
                  "content": "Well if i just asked someone out and i was turned down, i would want some space from them. I think showing up twice after being not asked to come twice is a red flag BUT if his house is the only place they hang out then i might be more on her side",
                  "id": 30,
                  "comments": [
                    {
                      "score": 339,
                      "content": "If you are going to shoot your shot with someone in your friend group, you have to be aware you will be dealing with them afterwards regardless of their answer.  It's not fair to suddenly exclude her from group plans because he put himself in a position to feel awkward and it's not fair to put everyone else in the group in a position to have to decide who to invite and who to exclude.\n\nYou shoot your shot in your friend group and you need to face up to the awkwardness and push through it.  Honestly, the more you pretend it doesn't exist, the more it doesn't exist.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 114,
                      "content": "How is that fair on her? The fact that you think it’s okay to exclude someone out of the friends group because you as an individual didn’t read the situation properly and made a stupid mistake, it’s reprehensible. She shouldn’t be punished by him because she isn’t attracted to him. Also, maybe he should just slow down on the hang outs, or just have the boys around for the next little while so he isn’t excluding just one member of the group",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "She wasn’t asked not to, he never said he wanted space. He just didn’t invite her personally and maybe she wanted to show there was no hard feelings and she’s his friend by going and being nice to him. Like friends do.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "> Well if i just asked someone out and i was turned down, i would want some space from them. \n\nThen you either (1) shouldn't ask out people from the friend group or (2) shouldn't host friend group activities for a while.  \n\nExcluding one person because they didn't go out with you is incredibly manipulative and petty.  That just tells the other single girls in the friend group \"you're going to be cut from this if you turn me down in the future\".   Extremely manipulative and tacky.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I think OP has the right to not invite her to the next thing at his house, provided he had every intention of being an adult about other group hangs-- needing a little time is valid. But, inviting everyone in the group but her is definitely going to come across a certain way regardless.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I bet she wasn’t being weird or clingy, I bet she was trying to let him know that there were no hard feelings. He just knew sex wasn’t possible anymore and so he was no longer interested in her friendship. They’ve all been pals for 8 years, he asked her out, she said no, and suddenly she’s no longer invited? Nah she wasn’t being weird she was trying her best to say, “Hey friend, we’re good.”",
                  "id": 36,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Possibly, doesn't really matter.  He didn't exclude her for being clingy and we know this because the exclusion happened before the clinginess.  There's a decent chance you are right and she was trying to smooth things over after realizing he was pissed she would dare to turn her down.  But without more details about what was said I don't know.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Also making an effort to talk to him after this is not my definition of weird and clingy.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Fair.  I was taking him at his word that she was weird and clingy.  Point remains he excluded her first.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 374,
              "content": "He’s making it awkward and she’s trying to maintain the friendship/ deliberately try to make it NOT awkward. OP should have clarified that he wouldn’t have been able to maintain a friendship because he hoped for a romantic relationship, or that he would need time before continuing the friendship. I could respect either of those responses, but it sounds like maybe OP verbally accepted being just friends without actually accepting it?",
              "id": 40,
              "comments": [
                {
                  "score": 195,
                  "content": "It is awkward if she purposely engaged the new girl and went out of her way to tell her OP previously asked her out. Sounds like sabotage.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Or actually being friendly?",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "I don't think so based on the information we have. In my experience, women tend to bond pretty quickly especially when drinking is involved. Just last weekend I met a new woman and we both know each others darkest relationship experience and were hugging and crying and supporting each other emotionally. This happens to me all the time when I go out.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Except that he attempted to exclude her before any of that actually happened. The reason he doesn’t want her at his house isn’t because she was talking to the new girl and sharing information he would rather she kept to herself. He didn’t invite her because she turned down dating him.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Sounds like warning her that OP acts weird if they get turned down.   Girls typically warn each other like this.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 263,
              "content": "Is it weird and clingy or it's just OP who doesn't care anymore about her as a person now that he knows she's not in the fuck zone?",
              "id": 46,
              "comments": [
                {
                  "score": 161,
                  "content": "Or even that he didn’t mind/notice how much they talked prior to her rejecting him? Of course he probably didn’t mind them interacting when he still had the chance to shag, but now that she’s a nuisance, it sounds like a different story. How do you be in the same friend group for EIGHT YEARS and hang out in YOUR HOUSE and rarely talk? Seems suspicious.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Exactly, this guy is trying so hard to paint himself as the good guy and can't even see how ridiculous he's sounding",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 116,
                  "content": "That’s the vibe I got. OP is totally fine inviting one woman after another to his house as long as he thinks he has a shot with them. Once one girl was no longer an option she was no longer welcome and he moved on to a new girl immediately.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "It's exactly that. OP was fine with her when he thought he had a chance. Once she turned him down he didn't want her near anymore because she wasn't of use anymore. He never saw her as a potencial friend nor cared about her personality. So he discarded her because he couldn't take the L. Then he moved om to the next girl and was upset for having a girl there that he wouldn't f*ck.\nIt's OP's so it's his rules which is understandable. However he was rude and that girl dodged a bullet.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 213,
              "content": "1) she knows he’s excluding her so she’s probably trying to put a lot more effort into their friendship to show him that she still sees them as friends even though he made it weird \n2) he was the one that made it weird. She was absolutely cool with the new dynamic, and she was kind and honest. He, on the other hand, blew it out of proportion and punished her for the risk he took \n3) he’s literally punishing her for not being into him. He can either not host anything at all until he gets over his immature disliking of her, or he can invite her like a normal human being \n4) this guy seems very low on the emotional intelligence level, and you’re taking his word for gospel that she was acting weird. There’s actually a really good chance that she was acting pretty normal but he was hyper aware of everything she did, and looked at her through a lens of dislike because of his immaturity \n5) maybe she is considering the fact that he likes her and is trying to give him a go, and is putting on a bit more of a flirt to see if she can be into him. \n\nYTA",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "She was probably just trying to compensate after rejecting him and show him they can still be friends and over did it because it’s awkward.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Someone who felt bad for turning him down and was trying to be extra nice to show they were still friends and there were no hard feelings*\n\nFtfy",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "But he didn’t want her there *before* that happened, he didn’t know it was going to happen when he decided to not include her in the group invite.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "? He uninvited her right away. Your timing is WAY off.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I was thinking her behavior was a bit odd but this is what I think happened:\nHe asks her out, she declines politely and feels kinda bad since they’re friends. So the next party, she’s determined to show him that she’s not gonna avoid him or act like he’s a creep or anything for asking her out, she’s gonna still treat him like a friend as normal. It seems like OP immediately decided that he no longer wanted anything to do with her after she turned him down, but all he said to her was that he understood her decision. So he’s uncomfortable with this person he no longer has any interest being friends with trying to spend time with him, and she’s thinking that he feels embarrassed and is trying to show him it’s no big deal. \nOp then brings a girl around, she wants to show him she’s fine getting along with her and wants to make her feel welcome. The only thing I can’t think of a logical reason for is telling her that he had asked her out earlier. \nIn any case, YTA for asking her out and then deciding that her turning you down meant that she shouldn’t get to be in the friend group anymore.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1516,
          "content": "YTA. Let's look at this from Julie's perspective.\n\nYou've been hanging out with your friends for the past EIGHT YEARS. You get along with everyone and nothing is weird. One day, one of your friends \"shoots their shot\" and you turn them down. You're hoping to remain friends, because after all, this person has been a friend for the past EIGHT YEARS. The next time they throw a party, your invite gets lost in the mail, so you try to show that you can still be friends like before. And you're friendly to the romantic partner they bring because you want to make it clear you're not competition. Plus, they're actually cool. And now you're uninvited from your friends' primary hangout friend forever.\n\nJulie isn't \"Gwen's friend who comes along\", she's part of the group. And she thought you were friends, because you've always been nice to her, right? She's now finding out that you weren't friends at all, and apparently she's not welcome as a friend - because her only value is as an actual or potential person to bang.\n\nI've been in Julie's position and it sucks. The only thing she did \"wrong\" is not reciprocate your feelings.\n\nYou got your feelings hurt and you've clearly moved on. You're the one making this weird.",
          "id": 57,
          "comments": [
            {
              "score": 217,
              "content": "This. Men like OP are why I can never really relax around male friends. You never know after however many years what their intentions truly are, one day things will be fine then the next day they'll ask you out and when you say no thanks that's it, you're dead to them, friendship over. After so many years of what you thought was an equal friendship. It's heartbreaking in its own way.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "First off… your take is 100% what i think happened. But then I was gonna argue with you because I thought op was a teenager and it was like ‘confused kid that doesn’t understand the signals’ but I saw they’re 26 and fucking own a home.",
              "id": 59,
              "comments": [
                {
                  "score": 3,
                  "content": "Right! How do you own a home and not know how to have an honest conversation",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 347,
          "content": "‘I understood and I thought it would be the end of it’\n\nThe end of what? Your friendship?",
          "id": 61,
          "comments": [
            {
              "score": 191,
              "content": "Turns out they never had a friendship, he'd fuckzoned her for 8 years, ouch.",
              "id": 62,
              "comments": [
                {
                  "score": 4,
                  "content": "Late reply, but I’ve never read “fuckzoned” before and it’s so spot on. Terrible feeling once you realize it, let alone after eight years. This poor woman.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 139,
          "content": "You’re allowed to ask for space after being turned down. You’re allowed to expect they don’t tell people they just met that they turned you down.\n\nEdit: changed “your” to ”you’re”",
          "id": 64,
          "comments": [
            {
              "score": 270,
              "content": "> Your allowed to ask for space after being turned down. \n\nOP didn't ask for space.\n\n> You’re allowed to expect they don’t tell people they just met that they turned you down.\n\nNothing in the OP indicates any proof she did this with malicious intent, or what the context was in bringing this up, so I disagree based on the evidence given.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 138,
          "content": "Is everyone overlooking the fact that he didn’t invite Julie, for whatever reason, but she still showed up? Twice? And Julie shows up and tries to sabotage his new friendship. Maybe OP was hurt or embarrassed by being turned down, but it’s his house and he doesn’t have to invite anyone he doesn’t want there.",
          "id": 66,
          "comments": [
            {
              "score": 249,
              "content": "Is it that weird for y'all to go to a party as a guest even if you haven't been properly invited? Of course there's limits to this and shit, but in any friend groups I've had it's always been fairly normal just to tag along with group shit.",
              "id": 67,
              "comments": [
                {
                  "score": 54,
                  "content": "I’m not saying it’s weird, I know people do that. Personally I wouldn’t go somewhere if I was not invited, but that’s me. But to say he’s wrong for not inviting her and accepting that it’s going to be awkward is not fair imo. Maybe he didn’t invite her because he knew it would be awkward. But she still showed up. OP has a right to exclude her from his get togethers if he wants.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Nope, if im not personally invited. I don’t go. Clear and simple. If im not wanted there, then I won’t be there. I don’t “tag along” because I don’t need to be somewhere im not wanted",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I feel like I’m in the twilight zone reading replies like this. They’ve been a friend group for nearly a decade. OP says himself his place is the hangout spot. \n\nI have been the person whose house is the hangout spot. My friend group (six or eight or so regulars) all just congregated there on weekends. I’ve also been someone who was part of a friend group that hung out at someone else’s place as the regular spot. I would not think it weird at all if the whole group was there every weekend without an explicit invitation. In fact It’d be weird if I said \n\n“Oh hey where’s Julie?”\n\n“Oh she didn’t come because you didn’t invite her”\n\n“What?? She’s here every weekend of course she’s invited”\n\nIt’s not like it was a special event or dinner or something. If there’s a friend group of 10 people that always go to the movies on Saturday why would Friend 1 know they weren’t “invited” unless someone explicitly said so.",
              "id": 70,
              "comments": [
                {
                  "score": 3,
                  "content": "Right? I'm feeling the same way. She may have even gone to another friend and say \"Hey OP didn't invite me\" and the other friend replied \"Oh he probably just forgot, you should come anyway!\"",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "OP knew Julie for years apparently but describes her as just “friend’s girlfriend’s friend.” She probably would have called him “friend.” He cut her off because she turned him down and then it sounds like she tried hard to show him that there were no hard feelings by paying special attention to him when she didn’t get the first invite, because she probably assumed he felt a little awkward about her saying no and wanted him to know that they were okay. I think OP is not completely objective about what happened with the new girl at the next party. Julie was probably just happy that he seemed to have moved on and was engaging normally and being friendly with the girl and the girl asked her about OP because she didn’t know him well so the topic came up organically. She probably overshared a little but I would really love to hear that conversation. If no one in the group is taking his side, there’s a reason. I bet he’s not telling us something and I’m getting incel vibes from this guy.\nI’m getting incel vibes so hard.",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "A friend group that she’s been a party pod from the beginning of freshman college. \n\nShe’s been a main fixture for EIGHT years and now he wants her to go away?\n\nShe’s probably feeling extra awkward and weird and trying to overcompensate by being around you too much, but dude you don’t get to cut her out because she didn’t want to hop on you. \n\nOp you’re being creepy.",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Yes, I've been where Julie is, and it fucking sucks. All of a sudden you're effectively ostracized because you weren't interested in dating someone else in the social group. I eventually worked it out with my friends at the time, but I never forgot how quick they were to abandon me because one of the guys found it awkward to be around me after I turned him down. \n\nOP, be better than that. It only has to be awkward if you make it awkward, and you are.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "OP could have used his words like a big boy and said to Julie, hey, I respect that you’re not into me that way, but would you mind giving me some space for a few weeks to move on so that we can be friends again? And then either ask her to skip a couple of pool days or leave him alone when she’s there. \n\nYTA",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Typical 'nice guy' behavior.",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5412,
      "content": "[deleted]",
      "id": 77,
      "comments": [
        {
          "score": 4355,
          "content": "I disagree. After telling him she only wanted to be friends she shows up at his house uninvited (she had been going for years, but still), hangs around him all day (unlike the other many times she'd been there), then the NEXT time she shows up uninvited she immediately latches onto the girl OP was with and immediately tells her that OP asked her out recently. \n\nI'm a woman, and there are only 2 explanations that make sense for this woman's behavior. \n\n1. After telling OP she was only interested in remaining friends, she reconsidered. Now she wants to try dating OP but is too scared or awkward to talk to OP about it.\n\n2. This girl is playing games. Now that she knows OP likes her, she's latching on to him to remind him of what he can't have, and even going so far as to try and ward off any other girl from dating OP (so she won't lose her \"hold\" over him). Some people, when you disclose vulnerability (such as telling someone you are interested in them), see this as an opportunity to strike.\n\nI think OP is NTA for disinviting this girl, as I'm leaning toward the second explanation.",
          "id": 78,
          "comments": [
            {
              "score": 2544,
              "content": "This is where all her friends hang out.  Does that factor into your rubric at all?",
              "id": 79,
              "comments": [
                {
                  "score": 1295,
                  "content": "His house doesn't matter if all her friends are there. It's his choice who gets to be there.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 1140,
                      "content": "[deleted]",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 184,
                      "content": "Its not if he’s right.  Its if he’s an asshole.",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 147,
                  "content": "Depends, is OP under any moral obligation to have someone who has gone out of their way to make him uncomfortable at their house.\n\nIf this person is actually friends with everybody else they will have opportunities to meet outside of OPs property.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 62,
                      "content": "He didn't invite her before any awkward behaviour was shown. She did not \"go out of her way\".",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "[deleted]",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 61,
                  "content": "His house. If he moves can they still go over for a hangout with the new owners there?",
                  "id": 86,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I actually chuckled, thank you!",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Why should that be considered in the rubric at all? If he asked her out and she didn’t act completely the opposite the next pool party and didn’t intentionally have a conversation with his date the next time she came to the party, maybe he wouldn’t have disinvited her. Switch genders of the parties involved and tell me if your answer would be the same.",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "It’s his home not a bar though. He is allowed to determine who he wants at his home",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Who gives a flying f***k, it’s HIS house not a public park… she can hang with her buds on her time elsewhere",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "No because it's one day out the weekend they have several other times to hang out with their friends is the only place she can she her friends at ops house I think not",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "No. The friends do not need to hang out at his house with her. Just like he doesn’t have to be her friend when he was rejected. \n\nNTA.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1732,
              "content": "I'm also a woman, and there's an option 3.\n\n3. Julie thought that she was friends with OP - they've been hanging out for 8 years and presumably he's always been nice. And now she's uninvited from the main place her friends hang out because she doesn't reciprocate. So she's overcompensating a bit trying to show she's a friend and not competition.",
              "id": 93,
              "comments": [
                {
                  "score": 777,
                  "content": "I feel like this is it. She’s trying hard reinforce that she’s part of the group and is friends enough with OP to still be invited.\n\nShe’s also embarrassed and worried because he immediately stopped inviting her and put the responsibility of awkwardly telling everyone why she’s suddenly no longer allowed to go over.\n\nAlso she’s trying to be friends and be transparent with his new girl so she’s not threatened by her. \n\nWhat a clusterfuck. YTA for not being a good friend OP. You fuckzoned this girl and are trying to justify it.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 174,
                      "content": "This is what I assumed too, just because that's what I would try to do as a girl who has been asked out by male friends and tried to preserve the friendships. Navigating this stuff is awkward and it's very easy to come on too strong. Also, he's acting like she had an agenda by telling the girl that he's talking to that he asked her out before. It could've just come up in conversation.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Also he describes her of a friend of a friends girlfriend. Yes he also says he ‘stopped inviting her’. That indicates that he was directly inviting her, friends of friends don’t usually get direct messages with invites, friends do.\n\nShe clearly thought they were friends. Clear nice guy syndrome",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The fact he doesn't consider her friends after 8 years. He seems like a mysoginist that only values women for sex. He doesn't consider Julie or his friend's gf his friends after nearly a decade of being in a friendgroup that seem tight (they hang out weekly)",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 176,
                  "content": "Yeah people keep forgetting that between party 1 and 2, Jenn had to tell Julie that OP doesn’t want her talking to him anymore. I think that really explains her behavior at the second party. It’s a last ditch effort to prevent someone from kicking you out because you wouldn’t let them in your pants like “hi i’m not interested in your man! please let me keep coming to these”",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "Also a woman and here's my take:\n\nIf that was the case, why did she have to inform his new girl that he asked her out previously? He was chill and didn't kick her out officially until then. She also got super clingy and made it even more awkward by becoming besties with his new girl. That's not being a friend - that's sabotaging his new relationship.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 72,
                      "content": ">She also got super clingy and made it even more awkward by becoming besties with his new girl.\n\n\"his new girl\" - at this point this is just another person he's invited to hang out. They're not actually dating. Even if they were, why does Julie being extra friendly mean she's \"sabotaging\" things? Like wtf do ya'll come up with this stuff. It's like you're looking for drama where there is none.",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 50,
                      "content": "That’s assuming she knew that this random new person was someone the OP invited because he was interested in them, and nowhere in the post does the OP state that Julie knew why this new girl was there. He clearly wasn’t communicating with her at that point, so I think a safe assumption is he didn’t tell Julie who this new person was to him. I don’t think assuming Julie knew who the new girl was is a safe assumption.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "There’s literally nothing in the post to seriously suggest she was trying to ‘sabotage’ anything. Another commenter suggested the new girl asked why the vibes were weird and something like that seems more likely. OP really seems to feel rejected by someone that seemed to believe she was his friend and wants her to just disappear off the face of the earth instead of understanding these things happen, getting over it, and not fracturing his friend group over something this small.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 54,
                  "content": "I would have agreed with this up until he mentioned that she latched onto the new girl he was interested in upon first meeting. Then going as far as to tell new girl that he was interested in her not so long ago - putting new girl and him in an extremely awkward position and possible pushing new girl away from him. Those are red flag behaviors and the girl is playing games.  \n  \nplay stupid games. win stupid prizes.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 21,
                      "content": "OP doesn't own women just cause he invites them over. He's not dating that new girl. Julie doesn't know he likes her. \n\nHow is being friendly to someone new mean she's \"playing games\" ? It sounds like those 2 hit it off. OP never said the girl felt awkward, you're reading into that. \n\nOP could just ask the new girl out directly too. Sounds like he's trying to pull another Julie - be \"friends\" with someone before asking them out and completely cutting them out.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Disagree. You don't tell the girl he's talking to that he asked you out first. That's mean girl behavior.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It is definitely mean girl talk. “He asked me out, I said no” is saying she was his first choice, you’re number 2.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Then why automatically leech onto his new interest???? This is the part for me that makes me believe Julie is playing games. And to tell her he asked her out before is MAKING  it into a competition. Why else bring up that bit of information? Julie is peacocking and trying to establish her dominance in the group and with OP. Come on guys, we’ve all known of women who pull this crap. She’s not overcompensating, she’s trying to maintain control over a guy she’s already rejected because she likes the attention.",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "If that were the case she wouldn't have clung to the woman he invited over the second time and she REALLY would not have told the new woman that he had hit on her previously.\n\nThat is fostering awkwardness and is cock blocking him. There is nothing \"friendly\" about that.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Then why tell the new girl that she was asked out by OP previously?\n\nWhat friend would do that to someone? \nIf OP was really just a friend to her she would want him to move on so it can go back to how things were, instead she sabotaged that, why would she do that?",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "ESH they could talk it out and each stop acting immature.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 398,
              "content": "[deleted]",
              "id": 112,
              "comments": [
                {
                  "score": 36,
                  "content": "I wish it were Reddit free award day because I'd give you mine. OP was the asshole the minute he decided not to saying anything to Julie about not inviting her when she normally attends. I don't care what she did after that. He excluded her solely based on her rejection and didn't bother to communicate with her at all. He's the asshole here. Communication is key in more than romantic relationships, they're important in friendships too. Dudes, it's okay to say you need space and establish boundaries. It's not ok to try and ghost someone you've known for years after they very politely decline your advance.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "This exactly, OPs ego was bruised so he retaliating by trying to push Julie out of the friend group. Hes obviously trying to make her look bad so he has a reason too while looking like a victim.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Just a \"nice guy\" being a \"nice guy\"",
                  "id": 115,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 331,
              "content": "Yeah, how about 3) She's trying to be friendly to prove to him that she still values him as a friend and to paper over the awkwardness?",
              "id": 116,
              "comments": [
                {
                  "score": 75,
                  "content": "Explain telling other people she turned him down.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 178,
                      "content": "OK, scenario one\n\nNew girl: hey, so OP has been staring at you chatting to me. Is there anything between you guys?\n\nOld girl: well, he kinda asked me out. But don't worry, we're just friends. You guys make a much better couple. \n\n\nScenario two\n\nNew girl: people at this party keep telling you they're sorry OP is being weird and uninviting you from stuff - what's the story there?\n\nOld girl: [charitable retelling of story]\n\n\nScenario three (not blameless but totally understandable IMO after how OP has been treating her)\n\nNew girl: so how's your love life\n\nOld girl (tipsy): Well,  tbh, it's not going so well... [insert story here]",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "Or:\n3. We’re getting an unreliable narration from the point of view of someone who feels a lot more uncomfortable now, and what previously was “normal” is now seen differently. \n\nIf OP doesn’t want to host his friends anymore, they should all start meeting elsewhere. But otherwise he’s basically saying she’s no longer a friend because she wouldn’t date him.",
              "id": 119,
              "comments": [
                {
                  "score": 91,
                  "content": "Thank God, someone finally said this! Unreliable narrator. Completely.\n\nYTA",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Oooor she’s known him a long time.  Wants things to be normal again and has gone out of her way to do it.  \n\nI’m a woman and would definitely do something like this.  Especially if we have all the same friends.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "This would make sense if and only if OP still invited her after being rejected. The issue is she was uninvited the second she said no. Julie probably realized why she was uninvited and tried talking to OP and the other girl because she didn’t want to lose her friend of 8 years.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Wow. Literally no benefit of the doubt for a fellow woman at all. This is why we women have the reputations we have for being catty. First of all, you do not speak for all women so claiming there are only two explanations is inaccurate. Second of all, it’s entirely possible Julie was attempting to make sure OP knew she still wanted to be friends with him bc things were likely a little awkward after she shot him down. I know this bc I’ve done it myself. Perhaps she went slightly overboard but we only have OP’s side. Based on the fact that everyone in the friend group seems to be siding with Julie, it’s likely OP’s ego is what’s driving all of this, not some poor, rude behavior from Julie.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I’m a woman (as is the person you replied to) and your narrative is dumb lol. Women are allowed to make new friends. She was polite to the woman OP asked out. Why is that bad? She tried to maintain the friendship with OP, who is looking far too into it. Either she’s being extra nice so he doesn’t feel like their friendship is ruined because she values him as a friend, or OP is just seriously that much in his feelings that he’s noticing things he never did before. \n\nWomen can be nice without wanting to have sex with someone. \n\n*Women can be nice without wanting to have sex with someone.*",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "“I’m a woman and there are only 2 explanations”\n\nNo. Being a woman doesn’t justify you being opinionated. There are many possible reasons and assuming doesn’t help anyone",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "I was actually gonna go with n t a but then I saw his replies. Basically now he's saying that Julie was never really a friend and that all this time when OP asks if she wants to hang out, it was actually as a date but he never specified that with her. So Imma go with YTA too.",
          "id": 126,
          "comments": [
            {
              "score": 58,
              "content": "\"We’ve all known each other since freshman year of college. I’ve always   \nhad a crush on Julie and we’ve always been part of the same group.\"\n\n&#x200B;\n\nbut the instant I try and get in her pants and she says no, then she's out!\n\n&#x200B;\n\nYTA",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I didn’t see OP’s replies but oh hell nah, HE was never really a friend if he’s willing to throw away the 8 years he’s known her because she’s not attracted to him.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I’m thinking OP was only friends with her because he wanted something more. Some guys will be friends with a girl for years because they think they have a shot but when they realize it’s not happening they’re done with her. I was friends with a guy for a whole year and when he realized I only liked him as a friend and nothing more, he didn’t even care to maintain the friendship after he screwed up by kissing me without consent. OP doesn’t value her as a friend the way she does at all.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "if i had a friend divulge to any girl or guy i was talking to that i had previously asked that friend out, especially considering how recent it was, I would consider that sabotage. either julie is a) going above and beyond to stay connected and it's massively backfiring (i see this is as the bset case for julie) b) she is malicious or c) incredibly naïve. \n\nim gay, and i came on to a friend in our group back in college (also gay), and he ended up not returning my feelings bc apparently several years earlier, he had liked me but gotten over me or something. regardess, we remained friendly for the sake of our gorup, but it definitely changed things. \n\nif i had brought another guy around, and my friend did what julie did, I think i would have left the friend group. mostly bc i know my friend, know hes not malicious, but wouldnt know how to handle that type of barrier that could potentially happen again if i brought a new guy around.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2913,
      "content": "YTA\n\nI hate when guys 'shoot their shot' and then get upset when a girl politely rejects them. It makes it sound like if she doesn't want to be your girlfriend then she doesn't get to be part of the group, which is just gross.",
      "id": 131,
      "comments": [
        {
          "score": 695,
          "content": "She's been uninvited to his house, and that is it. \n\nIt's rough for the girl because she's done nothing wrong but why does it seem irrational that he doesn't want her there? It's pretty awkward for him and he wants to avoid it?\n\n*'But this time she spends the whole day talking to the new girl I brought. They became “besties”. Julie even told the girl that I asked her out before. It was just incredibly awkward for me.'*\n\nYou don't think this is weird at all?",
          "id": 132,
          "comments": [
            {
              "score": 707,
              "content": "it sounds like OP is mad because Julie didnt want him, but he didnt talk to Julie very much before. Now he wants another girl, but he doesnt talk to her either, and gets angry that she gets along with someone else.",
              "id": 133,
              "comments": [
                {
                  "score": 799,
                  "content": "He invited another girl he's been talking to. I imagine everyone can see that there's a new girl here, Julie talks to her and becomes friends - no problem.\n\nJulie feels the need to say that she rejected OP, I refuse to believe that was innocent.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 117,
                      "content": "Correct.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah if Julie left that part out she wouldnt be the AH, but thats information that is just exceptionally rude for OP to be in that position. Not to mention no matter a stance of friendship, showing up uninvited to someones house is rude.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I reckon he was acting weird and the new chick asked Julie if there was something going on between them, and she clarified what happened.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "In my opinion, passive-aggressive men who pine over women for years, then freeze them out when they don't like the men back deserve to spend their lives alone until they learn how to treat people.  Julie is enacting justice by ensuring no woman in OP's city ever looks at him twice.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Why do you refuse to believe that was innocent? It could have been a direct question. “Hey since I’m new here can you tell me if OP has been with any of the girls here?” “Well he hasn’t dated any of them. He asked me out a while back and I said I just wanted to be friends.” \n\nSeems pretty innocent to me.",
                      "id": 139,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 277,
                  "content": "[deleted]",
                  "id": 140,
                  "comments": [
                    {
                      "score": 104,
                      "content": "Everyone is an unreliable narrator in this sub to be fair lol",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I think people seem to be overlooking the fact that he stopped inviting her BEFORE any of the supposedly weird behavior. That's makes everything that comes after very suspect, he wanted to look for any reason to keep her from coming over.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "Being a friend and getting over something is what would make him not an asshole.  Instead he alienated her from what was normal for 8 years before.  He is being an A",
              "id": 143,
              "comments": [
                {
                  "score": 11,
                  "content": "This! He’s throwing away an 8 year friendship because he realized it’ll never be anything more, and that just shows he was never a real friend as his intentions were purely that he expected something more.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I mean he shouldn't have asked her out if he was not going to be able to handle the rejection in this scenario. Like it's not just the rejection girl that is affected by her no longer being invited to the place where they all spend the weekend and it fucks with their whole friendship group. \n\nPlus making friends with the girl that your friend brought is not weird at all, and is exactly what I'd have done if I was in her shoes. It welcomes the girl into the group to show both her and him that you're no threat and that you're happy for them.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Sounds like a girl overcompensating to show the dude that she still wants to be friends.",
              "id": 146,
              "comments": [
                {
                  "score": 5,
                  "content": "I think the first day would be an example of overcompensating but the second day is very different.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 58,
          "content": "I don’t understand why you’d want to date someone you can’t even be friends with. It’s gonna be awkward for a bit but if after you ask her out you can’t be around her as friends then I don’t see a relationship working either.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "And then to me it sets this precedent of “oh you want to come to basically every hangout with your friend group? Well you can’t ever reject this guy if he asks you out or you’re done doing the one thing we all do every weekend”",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "And Julie didn’t do anything wrong. So because she doesn’t want to date OP she gets iced out from the friend group?  She’s essentially being punished for not saying yes. \n\nShe had no control over OP asking her out. She has no control over being excluded from hanging out with all of her friends. And she has no control over the fact that now she won’t be able to be part of her friend group anymore because she won’t be allowed to be at the place they’re all hanging out on a regular basis. Julie is being treated incredibly unfairly. And OP holds all the cards here. He’s basically forcing Julie out of the friend group she’s been part of for years because he doesn’t want her around anymore because *he* made a choice that allows him to take away her friends becuse she was honest with him about wanting to keep things the way they were. \n\nOP is a major AH. I get that it’s his house, but he made a decision that is now only affecting Julie. She didn’t do anything wrong and now she gets to deal with the consequences of *his* choice. I hope that the other friends in the group realize how unfair this is and act accordingly. Julie shouldn’t lose all her fiends because OP is a bitter jerk. (We don’t get to hear Julie’s side so I am not going to judge her for her behavior at party 1 and 2 or why she showed up without an invite- although I’d bet that isn’t as malicious as OP wants us to think).",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Exactly my thoughts, and it’s even more embarrassing considering OP is in his mid-20s. I’m in college and I’ve met guys like him and I don’t respect them. It sounds like he was only her friend because he wanted something more, as there are guys who will be friends with a girl for years because they think they have a shot, and once they realize it’s never gonna happen they throw that whole friendship away.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This is so fucking immature no wonder this dude is single, the only thing he has going for him is a party house. He liked Julie enough to crush on her but not enough to keep her around as a friend? **So they were never friends and the only reason he ever valued her was because he wanted to fuck.** Just gross. Failed crushes can end up being great long term friendships in my experience, there's a reason why you were attracted them in the first place. \n\nOP YTA, the only one that made it awkward was you. Julie dodged a fuckin bullet.",
          "id": 152,
          "comments": [
            {
              "score": 4,
              "content": "I find, reading the story after some time has passed, that he is playing the victim and seems like a 'nice guy'.\n\nHe didn't even really invite her on a date, it sounds more like he wanted to hook up and like she would have been shunned by him no matter what she did.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "All of this! You literally summed up my thoughts on this. It’s pretty unfortunate how many guys are out there who are exactly like OP as they’ll befriend a girl they want to pursue and maintain that friendship for as long as they think they have a shot, then once they realize she’s not interested in that way, they’ll throw away that whole friendship, regardless of how long it lasted. One dude was my friend for a whole year because he wanted something more like OP did, but when I made it clear after a year of friendship that I only like him as a friend, he didn’t care to maintain the friendship. Luckily for me that ended sooner, but for OP and Julie that’s 8 years down the drain so it must hurt for Julie.",
              "id": 154,
              "comments": [
                {
                  "score": 4,
                  "content": "Holy fuck I didn't even do the math they they were friends for 8 years, what a fucking pig.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yep! That makes it worst because clearly Julie was only important to OP when he had potential to pursue her. I have no respect for guys like OP, as those people are fake.",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "As a guy, I’m becoming more and more convinced that people mean they want to fuck when they say shoot their shot. It’s only one word off from something else after all.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "No kidding. There sure are a lot of guys ITT who have been rejected and are still bitter about it",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2749,
      "content": "[deleted]",
      "id": 159,
      "comments": [
        {
          "score": 2418,
          "content": "If someone asked me out, and I politely said no, and I showed up at their house, I wouldn’t spend the entire time trying to talk to them and make them uncomfortable. On top of that, she also became more of TA when she told the new girl that he asked her out. For what reason? So uncalled for. At a minimum, it’s ESH.",
          "id": 160,
          "comments": [
            {
              "score": 1663,
              "content": "OP is definitely an unreliable narrator here and I'd say we need to take into account the awkwardness on both sides.\n\n\nMaybe it was just in his perception that she started being more friendly after the rejection or maybe she truly was, wanting to get over the moment itself. I personally would see myself trying to overcompensate this way, tbh.\n\n\nAnd the fact that she told the new girl this, first, we don't have any context on why she said it (maybe it was asked), maybe, again, in an effort to upsell him and help him, wanted to follow up with a compliment.",
              "id": 161,
              "comments": [
                {
                  "score": 622,
                  "content": "It’s totally possible too that OP was hurting from the rejection and *felt* like she spent the whole time talking to him.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Agreed that it's possible. But I'm not really getting the YTAs that are *assuming* he is wrong/lying/exaggerating.\n\n\"You could be wrong about her behavior, in which case you would be TA. So I'm going to say you are, and YTA.\"\n\nI think this is probably an NAH or no judgement possible because the accuracy and perspectives matter so much.",
                      "id": 163,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Full moon effect. Crazy stuff happen all the time but when there is a full moon you pay more attention to it. There is not less craziness on any other night.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "It’s also not hard to believe that she might have overdone her kindness after rejecting him.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 519,
              "content": "I’ve heard a certain kind of person claim that their crush spent ‘the whole time talking to them’ when in reality they talked for maybe 10 minutes. I honestly don’t think we have enough info to know whether OP is hyping the time spent or it really was that she’s suddenly playing games she never bothered to before.",
              "id": 166,
              "comments": [
                {
                  "score": 41,
                  "content": "I agree. I'm not sure the OP is a reliable narrator. I had a dude who was part of my friend group turn me down for a relationship after we hooked up for a while, and then  years later told some mutual friends that I was always talking to him at parties, flirting with him, and touching his arm. Our friends told him he was being ridiculous and that I treated him the exact same way I treated anyone in my friend group. In his head I was always hitting on him, even though at that point I had zero interest and was definitely not hitting on him.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I also agree op is probably overthinking her intentions, she prolly is just making sure that’s it’s clear they’re friends and that’s all they’ll ever be. But it’s weird that she would choose him to be his drinking partner multiple times, if she wasn’t really doing that beforehand",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "I can see her action as her overcompensating to show that she isn’t weirded out by him asking her out, that she wants to keep the friendship and doesn’t want to give him the impression she’s avoiding him.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "We also don’t know the level of friendship they actually had. \n\nIt’s weird to me they have known each other for years, he always had a crush on her, yet according to him- they rarely spoke. \n\nDoesn’t add up",
              "id": 170,
              "comments": [
                {
                  "score": 8,
                  "content": "I have been in a few groups of friends where I was around but rarely spoke to one or more members.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 146,
              "content": "She’s trying to stay friends bc she was scared after he uninvited her the first time. \n\nShe also was trying to get along with the new girl being close to her so that the new girl isn’t threatened by her being around. \n\nShe was basically saying “see? I’m cool, let’s stay friends.” but OP wasn’t having it because his pride is hurt",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "Set a fucking boundary then. If i politely declined someone, I would DEFINITELY be trying to make sure he can tell I genuinely still wanna be friends. If he thinks I'm going too strong, then HE SHOULD TELL ME",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "OPs ego is so bruised and if that’s how he feels then he should be the one to leave the friend group since he is the only one making things awkward here.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1657,
      "content": "YTA. Julie doesn't want to date you but she's making an effort to continue to be your friend. It's not her fault you never saw her as a friend; you led her on in that respect! How was she to know all you wanted was a date/shag? You're now excluding her solely because you can't handle rejection. Not cool.",
      "id": 175,
      "comments": [
        {
          "score": 824,
          "content": "Yeah, that's how I read Julie's weird behavior at the next weekend -- she was making a deliberate effort to be friendly with OP and show that there were no hard feelings on her part, everything was fine, etc. Telling the girl that OP asked her out also sounds like a pre-emptive move on her part, in case OP starts trying to turn new girl against Julie.\n\nOP going \"I asked this girl out and she said no, I agreed to be friends but now I don't want her around (which has the unfortunate side effect that she can't hang out with their mutual friends at his pool which is where they are most weekend)\" is not a good look.\n\nLike, OP, think about this seriously. You're in essence telling your friends they have to pick sides. Either they chill with you during the weekends OR they chill with Julie. \n\nPut it like that, you've got to realize that YTA.",
          "id": 176,
          "comments": [
            {
              "score": 170,
              "content": "I am hung up on the part where she told the other girl. Everyone is jumping to her telling the other girl he asked her out because she was being vindictive. There are so many reasons she would tell her. Things like the girl asking, \"So is anyone or has anyone in the group dated anyone else?\" She could have also said, \"I noticed OP is acting weird around you, why is that?\" Which she shouldn't have to lie in that situation. Someone else could have mentioned it in front of her and the new girl and she just elaborated a little or even just confirmed it. There are so many normal ways that could have come up in conversation.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "As someone who’s had a friend like OP, I wholeheartedly believe any guy who would only befriend a girl, and maintain that friendship for years because he wants something more only to throw it away when he gets friendzoned is a jerk. Friendships shouldn’t be formed based on romantic potential, and it’s sounds like that’s exactly what OP did.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1451,
      "content": "ESH. Yes, it’s your house and you can invite or not invite who you want. But, excluding Julie after she turned you down is not cool. \n\nHaving said that, her continuing to come over and then making “besties” with a girl you’re interested in is some 6th grade level BS. And I have a 6th grader so I know of what I speak. \n\nIt seems as if Julie is now trying to play some kind of weird game and you’re right to no longer invite her. Tell her, in no uncertain terms, she is not welcome. Tell her it is her right to turn you down and you’re fine with it, but that her behaviors after that occurred are strange.",
      "id": 179,
      "comments": [
        {
          "score": 633,
          "content": "Right there I don't understands why everyone says he's sole TA Julie is too. Afte he asked her and she turned it down, fine no worries just stay cordial.\n\nBut Julie then acting this strange being clingy and I would say sabotaging the afford to get close to another girl is definitely AH territory.\n\nSo ESH they both suck.",
          "id": 180,
          "comments": [
            {
              "score": 530,
              "content": "Is it possible that Julie weird behaviour es some clumsy attempt at showing him that there wasn’t any hard feeling and that she was trying to maintain the friendship.\n\nI’ve been in a situation similar to OP and I guarantee you, right now, he’s an unreliable narrator, overthinking everything Julie does or says.",
              "id": 181,
              "comments": [
                {
                  "score": 372,
                  "content": "This. He started excluding her from group hangouts before she even had a chance to do any of this “weird behavior.”\n\nShe’s probably overcompensating because she’s seeing herself getting booted from the friend group. Is her behavior awkward? Sure. Is she being an asshole? Nah, I don’t think so.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 176,
                  "content": "I mean, she only started acting like that after he excluded her from the group. To me it just seemed like she was trying to preserve their friendship.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I agree on that part, but then cozying up to the new girl OP is seeing?? Seems suspect.",
                      "id": 184,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Exactly. From this post alone it's clear that OP's ego is one that needs protecting. No doubt Julie picked up on that pretty quickly, and did what she could to show that there was no hard feelings.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Why go out of your way and tell another girl he is trying to get with that he asked you out first. She is definitely an AH for that.",
                  "id": 186,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 277,
          "content": "Could it possibly be that for the last 8 years she’s lead one life with her friends.  One day, her “friend” asks her out, won’t talk to her and now is alienating her from the friend group.  What do you do with that?  Sounds shitty to me.",
          "id": 187,
          "comments": [
            {
              "score": 192,
              "content": "Especially since they are 26. Aside from this being a friend group she's been part of for 8 years, they're all at an age where it becomes much more of a deliberate choice to maintain friendships, and much more difficult to find new ones. They're long past school days where they can find a replacement friend group by sitting at a different table in the cafeteria. They've been hanging out consistently for 8 years and they are whole-ass adults. This is almost certainly Julie's primary friend group, which OP is now trying to take from her because he feels awkward at her not reciprocating his feelings. Obviously she is going to do whatever she needs to to ingratiate herself to him as a platonic friend, because he currently holds the power to eliminate her entire primary social circle against her will, during a stage in life when that circle is not easily replaced.\n\nThere is no way Julie can possibly be an AH for being a bit clumsy while trying to prevent someone from unilaterally razing her social life. It's pure YTA for OP to so casually disregard the implications of what he is doing, all because his ego was bruised by what was, based on OP's own telling, a considerately-delivered rejection. He's 26, not 14. Being rejected by a crush should not be an offense worthy of ostracism at his age. And clearly it hasn't damaged his ability to love forever if a mere 2 hangouts later he is already bringing over a different romantic prospect to meet his friend group. This is just cruelty by OP for someone having the gall to deny him affections that he felt entitled to.",
              "id": 188,
              "comments": [
                {
                  "score": 18,
                  "content": "Absolutely",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 249,
          "content": "Imagined from Julie's perspective: r/aita\n\nI 26F regularly hangout with a large group of people. We have all been friends for 8-9 years, everyone usually gets along really well. One of the friends bought a house a while back and it became the party house. Every weekend there's a party and it's all very casual. People will bring extra friends and whoever. \n\nWell a couple weeks ago my friend who owns the house asked me to drink and hang out one on one at his place. I only consider him to be a friend and was honest about it. He said \"he was cool with just being friends.\" So that weekend, everyone was talking about the party and we headed over. I tried to be nice to the guy so he knew there was no hard feelings. \n\nThe next weekend we all went over to house for the regular weekend party. I met a really awesome girl and we hit it off. We chatted about the friend group and she asked me about the owner of the house. I said he seems to be a \"nice guy\" he asked me out but we're still friends. \n\nWell, after this it blew up he uninvited me from the texts and group hangouts at his place. I'm not seeing what I did wrong. I tried my best, but now I feel like I've been banished from all my friends because I didn't want to sleep with him. AITA?\"",
          "id": 190,
          "comments": [
            {
              "score": 71,
              "content": "Don't forget to mention, \"Well after I awkwardly turned him down, he uninvited me to his house. I started to panic that he was going to cut me out entirely so I wanted to make it clear that there were no hard feelings and we could still be friends.\"",
              "id": 191,
              "comments": [
                {
                  "score": 11,
                  "content": "He never uninvited her. She just wasn't included in the text and it these things sound very casual like a text inst necessary. You guys are putting way to much intention on sombody being nice.",
                  "id": 192,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This needs to be higher up!",
              "id": 193,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Yeah I hadn’t seen the context of what OP meant by “asking her out” as I hadn’t seen his post history. YTA, OP.",
              "id": 194,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "He knew Julie for 8 years before asking her out. Why do we assume it was obvious to everyone hanging at the house that he was interested in the new girl romantically? Julie could've been excited to make a new friend.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yeah but did she know that this girl was someone he was seeing? It might have said but I forgot already…",
          "id": 196,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 886,
      "content": "So she went from a friend to a stranger the moment you realized she wouldn't fuck you? YTA",
      "id": 197,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 869,
      "content": "YTA, instead of not inviting her, why don’t you address the issue? You should have told Julie you were ok with being friends in the way you were before but her change in behaviour is making you uncomfortable. Ask her to stop that behaviour. Give her the chance to do so and only if she continues to do so, then tell her not to come. It seems like you both reacted differently to the friend conversation - you avoided her and she went the other way trying to be clear you could be friends and all was ok. Neither way was the ‘right’ way. Just talk to her about it.",
      "id": 198,
      "comments": [
        {
          "score": 99,
          "content": "Agree. Communication is key.  If he communicates his discomfort and her new behavior continues, then it’s totally ok to say he doesn’t feel comfortable having her around anymore. But she should at least be given an opportunity to try first, especially as she is so connected to the group.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "What are you, a grownup or something?",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Agreed- banning her without making that effort makes it seem like op only valued her as a potential gf, not as a person. I would hope that isn’t the case, but it is a reasonable interpretation of his behavior.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Seriously. Why is OP being so immature about this? He put her in an awkward situation with not only him but all of her friends. She went the other way trying to show all is good, he sees it as an obnoxious threat and  things escalate.\n\nWhat else is she supposed to do after she rejects him? Awkwardly avoid him at his own house? Ignore the new girl he brought over? \n\nOP needs to learn how to not let his bruised ego color his perception. He’s at risk of turning into a “nice guy”",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Why would he tell her he’s okay with being friends “the way they were before”, when it’s obvious he isn’t? As soon as she turned him down he went straight to “well then you’re not invited to my pool party.” He basically pretended to be her friend so he could fuck her and then banished her when he realized he’ll never have a chance. She’s not behaving in any way that needs to stop, he is. Even after the first time she showed up without being asked, he still didn’t formally tell her he’d rather not have her there, but brought *another girl* (that I’ll go out on a limb and say he’s not really into and was using to make her jealous), and then got mad and tried to banish her when it backfired.\n\nPersonally if I were in the friend group, I’d suggest we find a new place to hang out and leave OP to enjoy his pool by his petty self. YTA",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 695,
      "content": "YTA.\n\nSo when you decided to express your feelings to her, her options became like you or stop hanging out with you and her friends? \n\nWhen she tried to handle an awkward situation with grace you decided to banish her?  \n\nCool cool.",
      "id": 204,
      "comments": [
        {
          "score": 103,
          "content": "What about how Julie then inserted herself when OP invited a new guest/interest? I was YTA, until that part and then flipped.",
          "id": 205,
          "comments": [
            {
              "score": 213,
              "content": "To me, it sounded like maybe new girl had no friends at the party, and Julie was just extending a welcome hand. It just doesn’t seem natural for OP to bring up that he was talking to new girl to Julie. So I don’t think there’s any ulterior motive except unless Julie is warning new girl that OP is inviting new girl only because he sees new girl as a potential gf/shag. But even then, that seems like a pretty far stretch for someone who seems like they genuinely want to show there’s no hard feelings and still wants to continue a friendship with OP. Unless stated otherwise, I think OP might have been jumping to conclusions about why Julie would try to be friends with the new girl.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "[removed]",
              "id": 207,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Something that OP doesn’t clarify, though, is whether or not Julie knew why that new girl was there. If she didn’t, maybe she was just trying to make a new person in the group feel welcome. How do we know that isn’t how Julie always is with new people? Maybe she thought she was just getting New Girl up to speed on everything so she doesn’t feel left out in a conversation because she doesn’t know the context?\n\nAnd we also don’t know the context of the conversation in which Julie says this. What if it was a response to New Girl asking why OP was being super weird around Julie?",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 613,
      "content": "YTA and straight up petty, Julie said she liked you as a friend and you decided to kick her out of the friend group? Believe it or not, boys and girls can be friends!",
      "id": 209,
      "comments": [],
      "relation": "Attack"
    }
  ]
}