{
  "post content": "Not really sure where to begin, so if this feels disorganized or rambly, my apologies. My bro and I (we twins) live with our Uncle and Aunt and their two toddler children. Back in 2019 my bro and I got ourselves fired stupidly from our job (totally our fault) and had some financial issues. We used as much of our savings to pay bills and tried looking for some good job opportunities. But when some jobs feel through and our savings dried up, we couldn't pay our bills. My uncle stepped up and helped us by paying for our bills. This came with the stipulation that we would pay him back when we could, which when we got jobs again, we started to do. However, when we paid more than half of it back, about 5kish, covid hit and we all got furloughed, my bro, uncle aunt and I. My uncle and aunt ended up getting called back to work but now needed babysitters again for their toddlers. Since with covid they didn't trust babysitters outside our bubble, smart, my bro and I stepped up and started babysitting. At first, we were more than happy to help out family and never expected any pay despite having to babysit 30ush hours a week. We thought we would babysit for a month or two and that's it, no big deal. I would also like to add that we stopped paying back what we owed shortly after getting furloughed since my bro and I are simply on unemployment now. However, it's now been nearly a year and we have been babysitting 30ish hrs a week nearly that whole time. I won't lie, it's been tough. Props to all the parents here on reddit but without shit like Masha and Bear or CocoMelon (it's like crack to kids), idk how we woulda done it, I'm not built for kids that's for sure haha. Don't get me wrong,  I'm still happy to help and my cousins are adorable and I've learned a lot about kids which is good. However, we've been babysitting this whole time no pay which I would still be okay with if it wasn't for my Uncle constantly reminding my bro and I of the money we owe him. I get it, we did say we would pay it back, I just think it's a little unfair how helping my bro and I comes with an IOU, while babysitting for them comes with nothing and it's saving them 1200 or more a month on babysitters, they told me how much a while ago. \n\nSo dear reddit, tell me, would I be the ass hole for asking for the rest of the debt to be wiped clean, should I ask for pay continuing on, or what? Generally lost on this and have felt guilty about bringing the situation up with my Uncle when I was so irresponsible in 2019. So let me know what you guys think. \n\nSome info: we babysit 3 days a week and each of those days are about 8 hrs to 11 hrs of babysitting depending on my Uncle and Aunt's schedule. In all this time, we only missed one day of babysitting (got snowed in at a friend's house) resulting in Aunt having to call out. Other than that, we have been ready and available whenever their schedule calls for it.\n\nEdit: to be clear, my bro and I pay all our bills and always have except for the period of time where our debt with Uncle accrued. Right now all bills are paid fairly and evenly since end of 2019.",
  "id": 1,
  "comments": [
    {
      "score": 29,
      "content": "NAH - The babysitting doesn't count towards anything but goodwill until you ask them to start counting it from that moment on.  You failed to even discuss it before so it was taken as goodwill or maybe paying interest on the debt you owed.  That's not a good deal for you, but it's your fault for not bringing it up sooner.\n\nIf you ask them to start counting any future babysitting towards paying down your debt and they don't agree, then let them know you'll stop babysitting in a couple weeks.  That way they'll have time to get a new babysitter or simply change their minds.",
      "id": 2,
      "comments": [
        {
          "score": 11,
          "content": "That's fair, I do agree that we shoulda said something sooner. It was just hard cuz I felt guilty before and I had no idea how long we would be babysitting for. Like I said, at first it seemed like it would be just a couple of months but everyone got comfortable with the status quo. Ty for the honest opinion tho.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 20,
      "content": "YTA if you asked for it point blank.  But NTA if you approach directly;  I would say time to sit down with Uncle and Aunt and have a discussion.  \"Look, we were happy to help as you helped us and as we love you and the kids.  We also understand and appreciate that without your financial assistance, we couldnt have survived 2019 and we promised to pay you back - which we did while we were able.  Now, the child care we provide has gone on much longer than anticipated, and again, we are happy to help and while we never thought to bring it up, you are asking for us to continue to pay you back so seems like there should be a happy medium here.  Between the free child care--which is saving you by your own words over $1200 a month--and our debt to you.  It almost seems like some if not all of the balance of our debt should be settled by our help over these last 12 months... We love you guys and don't want money to become an issue, so we wanted to talk it out -- what do you think?\"  If they don't see where they should step up and forgive the balance or at least part of it...then go from there if you want to continue to help them, or go look for a job to pay them.  Ultimately, you did borrow and did promise to pay it all back.  Let Karma deal with them if they can't appreciate all you've done for them over the last year...",
      "id": 4,
      "comments": [
        {
          "score": 13,
          "content": "I like the way you put it, I'm probably going to borrow your words. I definitely don't want to come across as ungrateful and I've never cared much for money, so it's not like I'm trying to make money on the babysitting even if we agree to set the balance to 0 today, I wouldn't ask for pay in the future.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I love this. Nailed it!",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA, I agree your babysitting should be counted as working off your debt to them, but I doubt they’ll see it that way, which would be unfair if them.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA but remember, he’s not the AH if he says no \n\n\nFrom your uncles perspective, he housed you, fed and cared for you and lent your grown ass selves money. Plus he hasn’t demanded any back whilst you two were furloughed or unemployed. \n\nJust buy the man beer and come to some kinda arrangement.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "[deleted]",
      "id": 9,
      "comments": [
        {
          "score": 6,
          "content": "We split all bulls currently, my bro and I pay for ourselves now and have since near the end of 2019",
          "id": 10,
          "comments": [
            {
              "score": 7,
              "content": "[deleted]",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah, it is a bit of a tricky situation which is why I kinda been in limbo on what to do and just been keeping the status quo. I appreciate your opinion, it's true we kinda have been paying them back.. I mean, we save them over 1200 a month on babysitting services. It's what they use to pay before the pandemic. I plan on talking to them both today after they come home from work and hopefully we can come to a fair agreement.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA to have the conversation and map out hourly rate and hours worked. It would be ridiculous of course to assume you would both be compensated for being around to babysit at same time on a given day, right? Its not a 2 person job",
      "id": 14,
      "comments": [
        {
          "score": 4,
          "content": "I agree it's not a 2 person job, if we went the route of figuring out a fair rate of pay I would only ever consider a flat rate for 1 person over all the babysitting hours. Regardless if my bro and I were babysitting at the same time.",
          "id": 15,
          "comments": [
            {
              "score": 2,
              "content": "We see some strange expectations here on reddit lol\n\nGood for you ;)",
              "id": 16,
              "comments": [
                {
                  "score": 1,
                  "content": "Very true, some people have a hard time considering things beyond themselves. I'm not perfect and have known to be selfish at times, it happens, just try to do better.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH - you are allowing them to work and earn money, which they need to respect. It has been a year. You should have raised this before.",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "Yeah, I've been wanting to but it's been tough. I felt pretty guilty about past mistakes that caused my bro and I to be unable to pay bills. So I just went with the flow since I figured it would end eventually. But talking to my Uncle and Aunt it's pretty obvious they want the babysitting arrangements to continue for at least the next couple of months.",
          "id": 19,
          "comments": [
            {
              "score": 5,
              "content": "A year of free babysitting should be enough to make you feel less guilty and show that you are responsible.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I think I might be the asshole because I originally agreed to pay back the full debt but now I want to go back on that considering all the babysitting I've done and will do.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNot really sure where to begin, so if this feels disorganized or rambly, my apologies. My bro and I (we twins) live with our Uncle and Aunt and their two toddler children. Back in 2019 my bro and I got ourselves fired stupidly from our job (totally our fault) and had some financial issues. We used as much of our savings to pay bills and tried looking for some good job opportunities. But when some jobs feel through and our savings dried up, we couldn't pay our bills. My uncle stepped up and helped us by paying for our bills. This came with the stipulation that we would pay him back when we could, which when we got jobs again, we started to do. However, when we paid more than half of it back, about 5kish, covid hit and we all got furloughed, my bro, uncle aunt and I. My uncle and aunt ended up getting called back to work but now needed babysitters again for their toddlers. Since with covid they didn't trust babysitters outside our bubble, smart, my bro and I stepped up and started babysitting. At first, we were more than happy to help out family and never expected any pay despite having to babysit 30ush hours a week. We thought we would babysit for a month or two and that's it, no big deal. I would also like to add that we stopped paying back what we owed shortly after getting furloughed since my bro and I are simply on unemployment now. However, it's now been nearly a year and we have been babysitting 30ish hrs a week nearly that whole time. I won't lie, it's been tough. Props to all the parents here on reddit but without shit like Masha and Bear or CocoMelon (it's like crack to kids), idk how we woulda done it, I'm not built for kids that's for sure haha. Don't get me wrong,  I'm still happy to help and my cousins are adorable and I've learned a lot about kids which is good. However, we've been babysitting this whole time no pay which I would still be okay with if it wasn't for my Uncle constantly reminding my bro and I of the money we owe him. I get it, we did say we would pay it back, I just think it's a little unfair how helping my bro and I comes with an IOU, while babysitting for them comes with nothing and it's saving them 1200 or more a month on babysitters, they told me how much a while ago. \n\nSo dear reddit, tell me, would I be the ass hole for asking for the rest of the debt to be wiped clean, should I ask for pay continuing on, or what? Generally lost on this and have felt guilty about bringing the situation up with my Uncle when I was so irresponsible in 2019. So let me know what you guys think. \n\nSome info: we babysit 3 days a week and each of those days are about 8 hrs to 11 hrs of babysitting depending on my Uncle and Aunt's schedule. In all this time, we only missed one day of babysitting (got snowed in at a friend's house) resulting in Aunt having to call out. Other than that, we have been ready and available whenever their schedule calls for it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO - Do you guys pay rent?",
      "id": 23,
      "comments": [
        {
          "score": 2,
          "content": "Yes, aside from the period we missed that got us our debt to begin with, we have always paid before and we pay all our bills since.",
          "id": 24,
          "comments": [
            {
              "score": 1,
              "content": "NTA then. I'd figure how much money you two saved during the unemployment period and offset that against the babysitting tho. If you're looking at market rate for babysitting, make sure you are looking at market rate for room and board for two men too. If your uncle is cutting you guys a break by only charging you 200 bucks a month or something clearly low for what you are getting, then I'd charge less for babysitting too.",
              "id": 25,
              "comments": [
                {
                  "score": 2,
                  "content": "No, we pay a fair amount for our rent and bills. Internet and electric is halved, we pay 2 - 300 a month on food and groceries (which is low, but we cover a lot of our own food too, that's just general stuff) and we pay 1350 a month for rent, we rent the basement of a house. I still wouldn't go the full market rate for babysitters tho, it's not like my bro and I are professionals.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}