{
  "post content": "On mobile, bad formatting - sorry. Also maybe a little long but all relevant. Edits have been added to address common responses and things people felt I had left out. I'm happy to answer any questions.\n\nSo, I have been involved in my stepdaughters life since she was a baby (I'm not a homewrecker - she was a happy accident from a one night stand before I met him). I already had one child and so I was very keen, and used my experience to help him with everything when he had her for a few days per week (BC he was pretty clueless). I treated her like she was my own and was as emotionally invested in everything to that degree. \n\n[Edit: she lives with her mother and is with us for 2 - 3 days per week. I am not her primary \"mother figure\" - I know this, and that's not the point here. It seems like being a step-parent in  the UK is different from other places]\n\nWhen she was 4 I was trying to organise our Christmas with her, sort out gifts, time with her grandmother etc. Things were difficult and I was getting upset, and at one point my husband said to me \"I don't know why you're so bothered, she's not even your daughter anyway\" - and it really hurt me, like cut me to the core, because I had given everything to help raise this child for the last 4 years. But I realised that yeah I had given too much and I needed to back off. So I did. \n\n[Edit: my husband is autistic, so he now sees no wrong in what he said as in a literal sense I am not her biological mum. However, when he said it at first, he meant it by way of \"you're too involved, she's my child not yours\" - I know this because we discussed it at the time.]\n\nShe is now almost 10 and very sassy. I have often been in charge of looking after her when she's visited (3 out of 4 weekends) over the last 2 / 3 years because of my husband's hobby. I have sucked it up until just before Covid when I could clearly see that she was becoming resentful that it was me looking after her and not her father. So things started to change and he became more involved, because I made him. Then Covid happened and so now he's here all the time.\n\nWhen she has an issue with her siblings or whatever, I now direct her to talk to her father because I feel like it is his duty to resolve it - and sometimes he's better anyway because I can have a short fuze. \n\nToday she came downstairs, started to complain about something our son had done an hour before. I told her to talk to her father, things started to escalate so I said I was going to time out, and I left the room (BC that's our family plan.) She storms upstairs and slams the bedroom door a few times.  Husband comes to the bottom of the stairs and shouts at her to come down - she refuses. He says for her to stay up there all day then. Then he comes to the bedroom to discuss it with me. (Which he shouldn't do when I'm time out)\n\n[Edit: my son had gone upstairs shouting for his older sister - he hadn't specifically done anything to her but he woke her up. Apparently this was an important thing to add. Also, I do try to talk to her about any issues but if she doesn't want to hear it or I can't resolve it then I tell her to talk to her father, because I don't want to overstep the mark.]\n\nIt emerges that he wants me to sort things out with her because it was me who got angry in the first place. I said no, BC he is the one who shouted etc, and she's not my daughter. Husband says I keep bringing that up because of what he said before and that I'm bitter. He is partly right, I have said it a few times in the past, but I do it to remind him that I'm not doing what I feel is his job, because of what he said to me before. He made it clear it's not my responsibility. And yeah it still really hurts when I think back to when it originally happened. \n\nSo AITA in this situation? And what do I do?\n\nEdit: I just wanted to add, I haven't completely stepped off! I am still very much involved and I feel that I do more for her than her father does. She gets the same from me as my biological children do, but I was getting crap for everything so I tried to drag her father in more. Our family situation is bloody complex so it's not as black and white as is I wsh it was, but I appreciate everyone's responses.\n\nSecond edit: WOW! Ok I need to clarify, I don't just refuse to talk to her when she comes to me with a problem. I think I probably made that sound wrong. I do talk to her, but if she's not happy with my decision or what I have to say then I refer her to her father. I'm not some cold bitch who is saying not my problem, go see dad! Like this morning, I said look, it's been an hour so it can't have bothered you that much. She wasn't happy with that so I said well go and tell your father then. Cue her getting stroppy with me and me saying \"ok rather than argue, I'm going to take 5 minutes out of here\"\n\nEdit: we are having therapy because our situation is complex. My husband has ASD and son had ADHD. However this is something that has only started in the last few weeks. The \"time out\" is part of a gradual system we will be using to affect positive behaviour changes in our household.",
  "id": 1,
  "comments": [
    {
      "score": 1951,
      "content": "He's TA for creating that boundary. Obviously she's not your biological daughter but when you married him, you wanted to accept her into your family as well.\n\nI wanna say ESH because I kind of feel like your frustration with what he said before has now affected your potential relationship with your step-daughter but I'm not super sure. Alternative family dynamics are certainly difficult so I think the best thing to do is discuss with your husband what role you would like to take in your step-daughter's life.",
      "id": 2,
      "comments": [
        {
          "score": 1144,
          "content": "idk... I don't see how she's TA considering:\n\n>I have often been in charge of looking after her when she's visited (3 out of 4 weekends) over the last 2 / 3 years because of my husband's hobby.\n\nThe stepdaughter is resentful of OP because her father ignores her. OP is just making him actually parent now that he's home due to COVID.",
          "id": 3,
          "comments": [
            {
              "score": 57,
              "content": "Who knew someone who handed off parenting their kids sucks at parenting. Tough shit for the husband though it's sink or swim time, he could've been learning how to parent for years, but he didn't and now his child is a more complex person than when she was like 7 or 5 or 3 or 1.",
              "id": 4,
              "comments": [
                {
                  "score": 18,
                  "content": "I hate that the final verdict is E S H.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -52,
              "content": "OP is TA because she’s refusing to resolve conflicts between her step-daughter and her kids.  Not only is she not parenting her step-daughter (and damaging the relationship with a kid whose life she has always been present in), but she’s ignoring how her own kids behave to punish her partner.",
              "id": 6,
              "comments": [
                {
                  "score": 128,
                  "content": "Yeah, I could see that. I still think her husband is a much bigger asshole for ignoring his daughter all these years in favor of his hobby.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Man I need to know what the hobby is now that he can’t be assed to parent his kid for all those weekends... there’s a lot to unpack here",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I agree even if she not parenting the step daughter her kid is still involed",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -173,
              "content": "Because of this:\n\n> But I realised that yeah I had given too much and I needed to back off. So I did.\n\nShe's the only mother this child has known, since she was a baby. She has siblings that are OP's birth children. OP can't just \"back off\" from parenting one of her children while also treating that child's siblings with care and attention she's not receiving. Of course the girl is acting out now. She's Harry Potter at the Dursley's before the first owl. You can't just blame the dad for that. It's both of their responsibilities to raise and care for this child.",
              "id": 10,
              "comments": [
                {
                  "score": 171,
                  "content": "...why do you think OP is the only mother this child has known?",
                  "id": 11,
                  "comments": [
                    {
                      "score": 30,
                      "content": ">why do you think OP is the only mother this child has known?\n\nBecause they aren't reading the post. They want to paint OP in a bad light because she's a step mother and we all know step moms are evil. /s",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 138,
                  "content": ">She's the only mother this child has known, since she was a baby.\n\nIt sounds more like she's only there on the weekends and with her mom the rest of the week.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "Where are you getting that OP is the only mother the child has known? You are just filling in gaps with Harry Potter fan fiction, which is just fucking weird.",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 59,
                  "content": "OP isn't the only mother this child has know! SD is with her and dad just on weekends before COVID, and this child has a biological mother and she's apparently present in her life. And if SD is becoming resentful about being with OP too much, it's his father duty to intervene",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "No? Maybe go back and re-read, lol. \n\nThe kid's actual mother is totally active and involved in her life. They only visit OP 3 out of 4 weekends each month, and the child is with her mother the rest of the time. \n\nOP's husband is entirely uninvolved until the quarantine, and now he's mad that he actually has to parent his child.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "You didn’t actually read the post did you? You just saw a title and thought you could make a Harry Potter joke out of it... secure a few more pop culture references and try again.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Oooh ooh I want to try. She is nebula to gamora and thanos. Matilda. Dang I ran out.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "I'm not the only mother she's ever known, at all. She lives with her mother and comes to us for 2 - 3 days per week.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Minor correction: she's not the only mother the child has ever known, she has her bio mom and lives with her for either half the time ('when he had her for a few days per week') or most of the time ('looking after her when she's visited (3 out of 4 weekends)').",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Man, people like you (the people with an attention span of 3 sentences) are going to ruin this sub in the long run.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "I second this. I don't know where the biological mother fits in this, but really the OP in the beginning wanted to fully accept this child as hers. If the husband didn't make that one comment. And as a super emotional person I know how that one thing just stays for years and even decades and keeps punching. \n\nI wish OP had discussed it with him back then and they had decided what her role is. It seems that she would have been willing to get more and more involved and may have been the mother in the child's life really. \n\nAlso, if the kid was 4 when this happened then there's a chance she remembers you being very close and then starting to make boundaries. Maybe you should have a discussion with both your husband and the child and if you are doing as much as you think then better be a mother and have those rights. Have her call you mom whenever she's ready. Of course, that is if you still want this.",
          "id": 22,
          "comments": [
            {
              "score": 146,
              "content": "Thank you for your empathy. She lives with her mother and they have an amazing relationship. She comes to us on the weekends (or other days at the moment because her mum is a key worker in this messed-up situation). Pretty much all you have said is accurate and I am trying to get my husband to do more things with her but I think he lacks confidence. I am very lucky because she has said before that she thinks of me like her second mother, which was an absolute honor! She has gone through testing out calling me \"mam\" (that's what we say in this part of the world!) but ultimately she feels like its not what she wants. Either way is fine with all of us (even her mother). She knows she is welcome to change her mind in the future if that's what she wants to do. She does tell her friends she has a second mother too though which is super cool!",
              "id": 23,
              "comments": [
                {
                  "score": 133,
                  "content": "> I think he lacks confidence\n\nHe has the \"confidence\" to spend his free time on a hobby, while dumping his half of the childcare on the women in his life. Nobody has confidence when first taking care of a baby/child, but they build it by putting in the time and effort. Don't coddle the real asshole of this situation.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 73,
                  "content": "Lacks confidence...? Why? How? He's had this kid for 10 years. How can he \"lack confidence\"?",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 45,
                  "content": "She sounds like a cool kid. It seems like its totally your husband not giving her time that's messing her. Also, she's 10 so hormonal changes may be starting soon. And of course like any child being stuck indoors is tough. More or less this is a problem that'll resolve once your husband gives her more time. Also,  NTA.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Thanks, she is really cool - and definitely suffering because she can't go anywhere because she's super sociable. Also in her house she's an only child - here she's one of 3 and a middle child to boot so it's really hard on her and add hormones into the mix. I just want to get things sorted because obviously harder days are coming!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "ESH except for this poor kid - it’s been, what? 6 years now and you are still holding a grudge over this (admittedly awful) thing he said?? she HEARS you telling him that she’s not your daughter.  I know, she’s not in the room when you say it, but kids that age have a superpower when it comes to over hearing the adults when they shouldnt.  Just think if the damage you are doing to this girl, repeatedly tantrumming that she’s not your daughter.",
          "id": 28,
          "comments": [
            {
              "score": 38,
              "content": "Repeatedly tantrumming isn't accurate. But thanks for your input, except for that one part I get what you're saying.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1169,
      "content": "ESH. You and your husband have created a really uncomfortable enviroment for a 10 year old to grow up in. Initially your husband started it with his comment, but instead of being a mature adult, and talking to him about how it hurt, you've continued being petty and bitter about something he said 6 years ago. You two need to sit down and establish what role you exactly have in his daughter's life, because if you don't establish it, she's going to grow really frustrated and confused. \n\nShe's a 10 year old child. She sees you as a parental figure in her life, but depending on your mood, you either embrace that role or don't. And that little child can't understand which way the wind blows each day.",
      "id": 30,
      "comments": [
        {
          "score": 73,
          "content": "Well put. I think her taking a “time out” every time  she argues w step daughter is a little ridiculous too. I really hope they turn things around for the sake of this kid.",
          "id": 31,
          "comments": [
            {
              "score": 374,
              "content": "I grew up wishing that my parents would take time outs instead of hitting or emotionally abusing me. Not everyone makes the right decisions while heated, and it’s important to step away and calm down before things escalate.",
              "id": 32,
              "comments": [
                {
                  "score": 148,
                  "content": "This. I was reading  the story thinking.  Huh, that's nice.. my family  should  learn  that method!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Uhhh there is a middle ground.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "...There are other options than physical abuse or sulking off every time you get mad.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 71,
                      "content": "[deleted]",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It's a step up from that, but there's a lot more steps to take.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 129,
              "content": "Its a \"time out\" for when any of us get overwhelmed, because its what we have been told to model for our ADHD son, rather than arguing or shouting. But yeah, I hope we can turn it around too.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "ESH. Agreed. Posts like this always teach me on how to NOT be a terrible parent when it’s time for me to have kids. It always boggles my mind how selfish adults can get and harm innocent children like OP and husband are doing. \n\nThe ten year old is the type of kid I advocate for much needed therapy. OP and husband are setting her up for life so badly.",
          "id": 39,
          "comments": [
            {
              "score": 11,
              "content": "They're already getting therapy. That's why the stated the timeouts.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 373,
      "content": "I think the underlying issue here is: do you feel that she is your daughter and would you like to treat her us such?\n\nFigure it out and have a conversation with your husband and your daughter about what you want.\n\nWhat he said was unfair and extremely painful, but don’t stop his remark from having a fulfilling mother-daughter relationship with her if that is what you want. Forget labels and biology, families are formed in all sorts of ways. If she is your daughter, she is your daughter.",
      "id": 41,
      "comments": [
        {
          "score": 103,
          "content": "Thank you for this.",
          "id": 42,
          "comments": [
            {
              "score": 92,
              "content": "It is not even up to your husband to decide at this point. She is 10, the both of you can decide what relationship you want to have and what you are to each other.\n\nI wish you the best of luck!",
              "id": 43,
              "comments": [
                {
                  "score": 3,
                  "content": "This is a really good point actually maybe it’s her you should talk to not him",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 315,
      "content": "ESH--I mean you andyour husband, not the child who is caught up in this. \n\nJust because he said \"she's not your daughter,\" you decided to back off from the life of a child you'd been helping raise for four years? Who you were still going to be involved with? Just now withdrawn and with less parental behavior? I don't think it really works that way with kids. How do you think she felt? It seems like you're punishing her for her father's shitty behavior...and that has gone on for six years?? \n\nYour response of anger and withdrawal should have been directed at your husband without blaming or involving your child, to whom you are still a parent of circumstance even if you've decided to withdraw your responsibility for her. And that anger and hurt should have been resolved with discussion or therapy or something in the six years since he made that comment.\n\nYour husband sucks for I hope obvious reasons--someone in a parental role doesn't need to be undercut so cruelly by the kind of comment he made. Just because she's not your bio-kid does not mean you can't or shouldn't parent her.\n\nYour child is suffering because of an unresolved issue between you and your husband.",
      "id": 45,
      "comments": [
        {
          "score": 95,
          "content": "Read the edits, she's just sick of everything getting blamed on her.",
          "id": 46,
          "comments": [
            {
              "score": 34,
              "content": "I read every word. Nothing changes the fact that these parents are letting a weird mean-spirited fight between *them* affect a child in their care. I had adults do that to me as a child. It's not OK to do to a kid, and I stand by my judgment.\n\nETA: I am not saying she's a bad person or that she can't change, just that in this situation she's acting like an asshole...she's clearly feeling overwhelmed by these responses, which sucks, but this situation is not OK.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -5,
              "content": "So that justifies acting in a way that harms a 10 year old who she claims to care about?",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -6,
              "content": "The edits just show that she came here fishing for a certain response and when she didn't get it she \"clarified\" how she's really not as bad as she made herself look in the original post, she just didn't explain properly how good and fair she is and how bad and unfair her husband is.  \n\nThe fact is that she's an adult.  She's capable of communicating effectively and setting boundaries.  She didn't do those things and now she approaches every interaction from a place of victimhood and resentment.  She's attempting to passive aggressively punish her husband for previous words and actions and in the process is dragging her stepdaughter, an innocent, into the crossfire.  The stepdaughter is now also approaching interactions from a place of resentment and victimhood (wonder where she learned that?) and the OP hates that she's on the receiving end of it and is now looking for somebody to reassure her that it isn't her fault.  \n\nThis is an ESH.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 170,
      "content": "ESH. Omg everyone in this situation needs therapy and to learn to communicate. Jesus Christ.",
      "id": 50,
      "comments": [
        {
          "score": 97,
          "content": "Yes I will take that! We are getting help, but it is early days",
          "id": 51,
          "comments": [
            {
              "score": 55,
              "content": "Hey good for you, I hope it works out. As someone who has had a lot of therapy as a result of a fucked up childhood that was the result of being raised by people who needed therapy and to learn to communicate, my best piece of advice would be to go into it with an open mind and a willingness to recognize that you're the problem sometimes, and that it doesn't make you a bad person, just someone who needs to work on themselves.",
              "id": 52,
              "comments": [
                {
                  "score": 40,
                  "content": "Thank you, we are trying but yeah it's hard. I hope you're doing ok.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I'm doing okay now 😊 my parents still need therapy and to learn how to communicate, but miraculously all my siblings and I are at least figuring out how to pick up the pieces. We're all a lil fucked up but we're trying.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -15,
              "content": "[deleted]",
              "id": 55,
              "comments": [
                {
                  "score": 9,
                  "content": "You know when the best time to plant a tree is? 6 years ago. You know the second best time? Today.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Meanwhile the kid has had 6 years of OP foisting her off on her father whenever she's inconvenient.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 79,
      "content": "INFO - has he continued to say she’s not your daughter or was it just the one time when she was 4, and follow up: have you been using that line over the past 6 years?",
      "id": 58,
      "comments": [
        {
          "score": 149,
          "content": "When I said to him at the time how upset I was, he responded with \"well she's not though is she\". After that I stepped off all major plan making etc so he hasn't had to say it to me again. I have said it a couple of times. First when I was angry (yeah I know I suck for that) but today for example, I said it because I felt like he was asking me to overstep the boundary that he set by saying I should sort things out.",
          "id": 59,
          "comments": [
            {
              "score": 83,
              "content": "I'm feeling NTA but maybe you're a little TA to yourself on this one. You should have a conversation with your husband about the parenting labor and boundaries.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "A few years ago I was upset about something and when I tried to talk about it with my husband he said \"Nobody likes a martyr.\" I was so hurt and angry by this. I scaled back communication with him and started throwing that phrase back at him. Finally, years later he said that he didn't like when I said that. I told him he said that to me first. He had no memory of this. \n\nSo where did this get me? Years of poor communication with my partner. A bruised relationship. And both of us feel like crap. I kind of feel like this is a very similar situation. \n\nYou need to talk to him.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Honestly I think your husband is a bigger asshole than you. It sounded like he wanted a nanny not you as a full human being that makes relationships with people. Possible he also wanted to hold power over you by clarifying that she isn't your daughter in his eyes.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Is everything always so black and white with you? It just seems like when situations get tense or complicated your husband has really dumb go-tos like \"she isn't your daughter\" or \"sort this out\". It sounds like he doesn't know how to solve problems so in the first example he felt you were causing a situation to be worse and instead of just asking you to back off and let him sort it out alone, he told you in a way you took to heart. But maybe if he asked in a better way you would have still been bitter for 6 years. \n\nAnd it sounds like he wants you to sort things out with his daughter because he doesn't know what to do. Instead of working together to figure it out, you both have removed yourself from the issue. \n\nMaybe instead of telling your husband this isn't your problem, you could try to puzzle out how to fix this together.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -5,
              "content": "This grudge you’re holding is like drinking poison and expecting it to hurt him. Except it’s only hurting you and - most of all - this little girl. Get over yourself and step up for your stepdaughter. Have a heart to heart with your husband so you can fully be there for your stepdaughter without this 6 year old fight getting in the way. \n\nShe absolutely is picking up on more than you think she is.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -7,
              "content": "> When I said to him at the time how upset I was, he responded with \"well she's not though is she\".\n\nSo in the more than half decade that's passed since then, you haven't discussed it again or worked it out? Because that was your job as adults. You just held onto it and let your hurt feelings and your ego dictate how you treat a little girl (when she wasn't even the one who hurt you)? Telling her \"go talk to your father\" every time she has an issue is a slap in the face to her. It's not hurting your husband (or making the passive-aggressive point you think it's making), it's hurting her. Do you just not care?\n\nGee, I wonder why she's \"sassy.\"",
              "id": 65,
              "comments": [
                {
                  "score": 81,
                  "content": "No, we have done but there's a limited amount of characters on here so explaining the last 10 years of my and my husband's life isn't feasible here. It's ok for you to ask questions, and have an opinion. I'll answer any genuine questions you have and respond if I feel the discussion here will benefit, but you going and slating me on every comment I've made isn't helping, and to be honest I feel like you are just being abusive. You think I'm the asshole, that's fine, I get it. I put myself out here expecting judgement, but just give it then,you don't need to keep dragging me.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Girl, you are NTA. Being a step parent is hard. It’s even harder when the bio parent pawns all their responsibilities on the step parent.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 53,
      "content": "ESH. But mostly you for taking it out on a child who has been your daughter her whole life.",
      "id": 68,
      "comments": [
        {
          "score": 56,
          "content": "I'm not taking anything out on her. I'm trying to involve her father in her parenting.",
          "id": 69,
          "comments": [
            {
              "score": 116,
              "content": "Kids hear more then you think. And every time she has an issue you send her to her father... I’ve been that kid. You are totally taking it out on her without even seeing it. Like it or not you are her parent and haven’t been acting like it. Believe me, she notices",
              "id": 70,
              "comments": [
                {
                  "score": 59,
                  "content": "I'm not trying to not be her parent. But I get what you're saying and I will watch what I do in future.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You're basically raising her so, you are her guardian. This child shouldn't have to grow up with a toxic relationship. \n\nI know what he said was hurtful and hes an asshole but so are you. Both of you need to get over yourselves.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -26,
                      "content": "You said it yourself you are not this girls mother so don't try and parent her",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -44,
              "content": "At least she used to mother figures abandoning her. 2 in a lifetime is a a lot.",
              "id": 74,
              "comments": [
                {
                  "score": 45,
                  "content": "Oh please! The father has her on weekends so she lives full time with her mother. She hasn’t been abandoned by either mother figure and seemingly it’s only her father who is failing her by ignoring her and pawning her off on OP. That is where the issue is stemming from.",
                  "id": 75,
                  "comments": [
                    {
                      "score": -36,
                      "content": "Ah so it's just the one mother figure who doesn't care. That's good to know",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 51,
      "content": "ESH. Quit taking your resentment out on the kid. She’s not a pawn. Also realize that people say stupid stuff and don’t always mean it. You’ve held on to this resentment for 6 years, it’s time to let go. \n\nHe needs to quit neglecting (for lack of a better word) his daughter and take an authoritative role without having to be constantly reminded.",
      "id": 77,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 32,
      "content": "After the edits I'll say NTA.",
      "id": 78,
      "comments": [
        {
          "score": 11,
          "content": "I now feel like this belongs in r/tifu",
          "id": 79,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "It's still ESH to me, they both kinda suck. Both need to communicate better and I hope therapy helps that.",
          "id": 80,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -4,
          "content": "I felt that way, to, until I saw the comment that he has autism. She admitted that, to him, it’s a fact that the girl is not OP’s daughter, so when he says it, he doesn’t get why it’s hurtful.  She’s being a huge martyr here for expecting the same level of emotional intelligence despite his autism.  I do think he’s full of crap for not being there three out of every four weekends he has custody, though.  WTF?",
          "id": 81,
          "comments": [
            {
              "score": 18,
              "content": "People with ASD are not incapable of learning social and interpersonal skills. It may not be instinctual like it is for some neurotypical folks, but it *is* possible to learn to at least go through the motions. It doesn’t matter that OP’s husband didn’t understand why she feels the way she did or that he didn’t *intend* to hurt her. He hurt her. He should have apologised and made amends. Expecting that from a life partner and being upset not to receive it doesn’t make OP a martyr.",
              "id": 82,
              "comments": [
                {
                  "score": 2,
                  "content": "I didn’t say they were incapable.  I said it’s unfair to expect the same level of EQ as you would from a neurotypical person.  I’m not saying she shouldn’t hold him accountable.  It’s just something that should be taken into account when judging the comment.  It does and should change the calculus.  And yes, someone who nurses a grudge against their partner based on a comment they made for *years* is a martyr.  Forgive or move on.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -17,
              "content": "Exactly! She knows that he didn’t mean it the way she took it, rather than brush it aside and move on for the sake of the kid she is still taking it out on her 6 years later. Clear YTA in my opinion.",
              "id": 84,
              "comments": [
                {
                  "score": 15,
                  "content": "Whether it's depression, autism, or pregnancy hormones...... doesn't give you the right to be a dick. And this is coming from a depressed aspie.\n\nHe said something dickish and is hiding behind \"well technically.....\"\n\nEdit-samsung autocorrect sucks.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Nothing excuses her taking it out on the kid",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "Child of divorce whose dad just completely stepped out because my stepmum was around. My stepmum was always the one looking after me  because my dad assumed it was the same thing. I resented her so much because she tried to help the same way you did but that just left me with a dad that thought she should help and a stepmum who was not actually responsible. I don’t speak to my dad anymore. NTA",
      "id": 87,
      "comments": [
        {
          "score": 16,
          "content": "This sounds similar and it sucks. Sorry things are bad with your dad.",
          "id": 88,
          "comments": [
            {
              "score": 10,
              "content": "Your husband doesn’t sound like he doesn’t care he just expects you to be the caretaker and you should talk to him about why you aren’t and how you still want to be a role model for his daughter. You aren’t her parent.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}