{
  "post content": "The background: I (31M) live in an apartment on my parents property. I pay market rent, before anybody accuses me of being a dead beat. I have one sister, Tressa (19F) from my moms second marriage.\n\nTressa doesn’t always make the best decisions. For example, she got pregnant with my nephew Jerry (3M) when she was still in high school. She has really bad impulse control and she thinks she can do no wrong, which means she doesn’t take advice well. \n\nI’ve always been into body modification, I have about 15 tattoos and gauges. My job pays pretty well (I’m a lineman for a power company), so I can afford it. Tressa has one tattoo, but she wants more.\n\nAnyway, she got her stimulus money recently, and she also has a few thousand from a legal settlement last year. She told me she wants to get an extra ocular implant. For those who don’t know, it’s a small piece of metal that’s implanted in your eye, and it comes in decorative shapes, like hearts and stars.\n\nI told her she probably couldn’t find an artist to do it. She only has one tat, and in my experience, artists won’t do extreme body modifications unless you’re really tattooed already. Plus it’s very expensive and comes with some risks.\n\nTressa didn’t like that. She told me she already found a guy, and I’d be watching Jerry while she got it and recovered. I told her hell no.\n\nShe said she just wanted to feel “wild and sexy” like other girls her age, and she felt like she was always being pushed into “the mom mold.” \n\nI told her she is a mom, in fact, and she should just spend the money on her son. He’s totally obsessed with skating and hockey, and I suggested to use the money for skating lessons. \n\nShe’s been holed up at her boyfriend’s house since, and she isn’t talking to me. I wasn’t trying to say she’s a bad mom, only educating her. Extra ocular implants are a big decision, and they can really impact her future. Right now she’s working BoH at a restaurant, but if she changes fields, it’ll be harder to find a job.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 7375,
      "content": "NTA\n\nIt’s a bad idea on so many levels. I hope it doesn’t backfire if she goes ahead with it.",
      "id": 2,
      "comments": [
        {
          "score": 3846,
          "content": "How the hell did people even come up with the idea of a DECORATIVE ocular implant in the first place? I thought eye tattooing was a shitty idea, but having a decorative piece of metal in your eye? WTF I don't even.\n\nOp is NTA for so many reasons.",
          "id": 3,
          "comments": [
            {
              "score": 2089,
              "content": "And it sounds like she got a dodgy artist to do it. So much could go wrong. What if she gets infected and ends up blind?",
              "id": 4,
              "comments": [
                {
                  "score": 1597,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 755,
                      "content": "Right? Just go get your belly button and nose pierced and be done with it! Jabbing stuff in your eye isn’t fucking sexy at all.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 115,
                      "content": "I’m in the eye field and I don’t know a single ophthalmologist that would do this for anyone. This is SO sketchy.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 106,
                      "content": "Omg it’s actually on the whole ass eyeball! I don’t know why I assumed in my limited mind that it was something that went under the skin near the eye....",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "Nipple piercings would be a good way to go imho",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "I read the same thing and apparently atm it seems like it only done in NL so if they live anywhere else, you can add the flights to the cost of the whole thing. Plus with the plague going on, don't know how many of them are even doing these things right now, since it needs to be a doctor.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "This! It's weird to me that she already found an artist to do it. It takes a while to find an artist willing to do a risky procedure like this one. She's probably also going to say he won't charge her that much money which would be an even worse sign. \n\nPlease be safe everyone! Tattoos, piercing and any body modifications can be risky. You have to find a good artist (look up what the good and bad signs are if you don't already know) and inform yourself on whatever you want to get because any modification on your body is a big decision.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Have you seen sclera tattoos? Google it only if you aren't squeamish. Why do people do that to themselves? By the way I'm not anti-tattoo, I'm anti the extreme stuff that can cause serious medical issues/disfigurement.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "RIGHT?! Ugh god this just makes me cringe. Especially from a medical standpoint. Do you know what one of the serious concerns are for patients with an open-globe eye injury? Their immune system attacking the other eye (sympathetic ophthalmia) which can lead to blindness. So not only do you have to worry about the piercing itself getting infected, you have to be just as vigilant about the other side and could end up totally blind. I cannot fathom doing that initial damage willingly, for decorative purposes.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 331,
              "content": "Eye + metal implant = nightmare fuel for me. I really hope the sister and anyone else thinking of doing this really consider the risks of such an implant. It's not like you can just get new eyes if the procedure goes wrong, or it gets infected, etc. and you lose your vision!",
              "id": 14,
              "comments": [
                {
                  "score": 109,
                  "content": "The first thing that came to mind when I was reading OP's story was the eye implants I see in science fiction and shit - and these were always bad. Like there was one episode of I think Agents of SHIELD (Not sure if right show, this was a long time ago) where the victims had explosives implanted in their eye (along with a camera that monitored their actions) and if they misbehaved, BOOM. And then an episode of I think Criminal Minds (again, a long time ago) where a camera was implanted into the eye against the victims will.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 41,
                      "content": "That was agents of shield. It was rather scary",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "My brain always thinks of that one NCIS episode where Ziva and Tony play canadian assassin's and the original wife had an implant BEHIND her eye. And i always think what's the point, then I remember in real life it's at the front way too damn close to the cornia😂",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I also think of sci-fi, specifically Scott Westerfeld's Uglies/Pretties/Specials trilogy. In Pretties one of the girls gets jewels implanted in her eyes that light up like an analog clock and tell the time. Super extra. But the whole point of that book was that they were so caught up in being Pretties and living the easy life that they had completely forgotten the world around them and what it meant to genuinely interact with it or actually have to think about things.\n\nIt kind of sounds like that might be what Tressa is after, though. Wanting to focus on something fun and ignore her financial responsibilities to her son and their future. What was the settlement money from? There is probably something else that logically she should be putting it towards (repairs? Therapy?)",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "> Eye + metal implant = nightmare fuel for me.\n\nWhen I was kid (like 4) I had a piece of hot solder fly into my eye. (Dad was fixing my mom's \"improper\" soldering work for my brother's project) That is probably the only memory I have from that age. My eye wasn't damage. But fuck, I can't believe someone would willingly put metal in their eye.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 82,
                      "content": "I am not sheltered. I have a few tattoos and piercings myself. That being said I guess I must be getting old cuz I had no idea what this is. Who the fuck puts metal in their eye? This is not edgy. This is an infected and surgically removed eye waiting to happen. Shit this reminds me of Becca and the pasta water but so much worse!!!\n\nNTA OP\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/l2693f/aita_for_telling_my_roommate_that_she_cant_clean/?utm_source=share&utm_medium=ios_app",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "> My eye wasn't damage.\n\nThank goodness for that.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Hot bacon grease. Was around kindergarten/first grade. Jesus christ on a biscuit that hurt!! And that's how I learned not to stand too close to the stove. Lol.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Thank goodness your eye was okay! Makes sense that would be the only memory from that age you had lol... that must’ve been scary and painful",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I hear ya.  I don't even wear mascara because a flake of that hurts  like hell. I can't even think about paying someone to shove basically a piece of shrapnel in my eye. Just no.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And good luck ever getting an MRI scan",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": ">Eye + metal implant = nightmare fuel for me\n\nYeah, I mean, I have an eye condition that means I sometimes need SHOTS IN MY EYEBALL.\n\nIt is truly the stuff of nightmares. it doesn't hurt much, but NEEDLE IN THE EYEBALL!!!!!!!!!!!!!!  \nI can't imagine voluntarily having someone modify *your eyeball*.   \n\\*Shudder.\\*",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "I'd say I'm more into tattoos and piercings than most, but where does she live that putting a piece of jewelry in your eyeball is anything close to being \"wild and sexy like other girls her age\"? This is absolutely not what most other young girls are doing!",
              "id": 27,
              "comments": [
                {
                  "score": 53,
                  "content": "If someone told me/showed me their eye implant I'd be like WTF is wrong with you. Unlike a tattoo where I can ooh and ahh over (unless it's a god awful tat)",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "I looked it up and oh my god..... It doesn't even look good at all! It just looks like you have a CHUNK OF METAL IN YOUR EYE?!?! Wtf like I love tattoos and body mods but what the FUCK.",
              "id": 29,
              "comments": [
                {
                  "score": 34,
                  "content": "I did too! Looks like you got chonky glitter in your eyeball nnnnooooonononononnnnoooo. Just. No.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Have you ever had chonky glitter in your eye? It is the worst feeling in the world. I can't imagine wanting that to be there permanently. Good Christ. I'm legit going to have nightmares over this post.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Tattoos can look awesome, I've seen some tats that were honest to god masterpieces and they're much more visible (and visually appreciable) from a polite distance. Who are you going to show off an eye implant to???",
                  "id": 32,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Especially when social distancing! 😬",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "You know what’s edgy now a days? having confidence to not need an ocular implant to make yourself feel special.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Right??? I mean, if you really want \"cool\" and \"edgy\" go get some dermal implants or something. Don't just put shit in your eye! What the actual fuck -_-",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "[deleted]",
              "id": 36,
              "comments": [
                {
                  "score": 34,
                  "content": "I do MRI research and this was my first thought - I have to ask our research subjects who are 9-16 year old kids if they ever did metalwork without protective eyewear or have tattooed makeup (which can sometimes have metals in the ink if done cheaply) which seems nuts, but having metal in your eye can cause major problems.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "One of my coworkers has metal in his “eye,” but he’s got an implanted(?) prosthetic eye so obviously very different from a “I want to pay someone shady to stab a piece of metal into my eyeball” type situation.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I was thinking the same thing.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "Yeah, holy everything. I was misreading it and thought it was an ear modification (which would be cochlear if anyone is wondering), so I was like, okay, permanent ear jewellery. No. Nope. Good god, I hope she doesn't go through with it",
              "id": 40,
              "comments": [
                {
                  "score": 12,
                  "content": "I thought that OP meant a dermal *near* the eye at first. What his sister actually wants is completely insane, holy crap. And I say this as someone with both piercings and tattoos, including a surface piercing (which never healed properly due to an injury, and I had it done by a very reputable piercer with high quality jewelry).",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Yeah I think while the sister is TA the real A is whoever first thought “you know, I like my eyes, but you know what would really take them to the next level? *metal*”",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Even if it doesn’t go poorly she will likely never be able to get an mri. Even if it’s non magnetic metal there will be few places taking that chance. That could really impact her quality of care in the future...",
          "id": 43,
          "comments": [
            {
              "score": 44,
              "content": "I had an MRI recently and all of my piercings have high quality jewelry in them (either gold, or implant grade titanium). All non-magnetic. They still asked me to either take them out or put in non-metallic retainers, and I understood that they wouldn’t want to just take my word for it and risk it. I opted to use glass retainers.",
              "id": 44,
              "comments": [
                {
                  "score": 36,
                  "content": "Metal can still heat up and cause artifacts on images, metal causes a black smudge if it's in the area of interest.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 14,
                      "content": "or a total VOID if the metal is close enough- its how i find bobby pins on patients where i missed one :-p )",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yep. I had a lower and middle back MRI and had to have my daith piercing removed, even though it’s 24K white gold. They told me they weren’t chancing it, so I had a glass retainer placed.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yeah, I went to my piercer to have all my jewelry swapped out to glass. It was a semi-emergency MRI to find out if I had a tumor so he didn’t have time to order me anything custom fit, I had to make do with a few glass navel curves dangling out of my ears lmao. My conch wasn’t (and still isn’t) healed yet and bled horribly, so we ended up just leaving the glass in that instead of swapping back after.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Weirdly, most places have told me I could leave my wedding band on. I guess most of the common metals are safe but mine has a meteorite inlay and really, really should not go into an MRI. You'd think to be safe they'd make everyone take wedding bands off, or at least *check*!",
                  "id": 49,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Wedding bands don't go through your skin, and a lot of people can't get their rings off.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Guaranteed she's not bright enough to even ask what kind of metal it is, let alone remember.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "This 100%. I have non-magnetic metal in my chest and I had to get special permission from my surgeon to get an MRI.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "This is now illegal in USA and parts of Canada.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "When I was 12 I got sand in my eye from the playground. This was in the 80s. I ended up scratching the cornea of my eye. My Dad took me  to urgent care where they had to numb my eye, put in that special dye, and use a black light to see. O had to have eye drops every day I believe for at least a week. My husband has ended up with metal shavings in his eyes a few times. Those meant trips to the ER. I was with him one of the times which I believe was the last time. They had to numb his eye to get it out. So yeah purposely implanting something into your eye is a recipe for disaster. She can feel sexy in so many other ways.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yeah... at the end of the day, she *is* a mom now. Which means certain risks should no longer be considered acceptable. Like potentially permanently blinding herself to “look sexy\".",
          "id": 55,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2674,
      "content": "NTA.  ONE SHOULD NEVER MESS WITH THE EYES.  WHO KNOWS WHST KIND OF INFECTION SHE COULD GET YEARS FROM NOW.",
      "id": 56,
      "comments": [
        {
          "score": 772,
          "content": "Even ophthalmologists can blind you doing Lasix and cataract ops and they’ve trained for years just on eye surgery. Obviously that’s very rare by doctors but still happens, never mind when done by someone with no medical qualifications who will have done very few of these. Even if it all goes perfectly, you can get foreign body or allergic reactions to the implant, which might blind you too.",
          "id": 57,
          "comments": [
            {
              "score": 324,
              "content": "They have real time computer tracking for the laser now, so it'll stop automatically if your eye moves. It's really neat and drastically reduced complications!",
              "id": 58,
              "comments": [
                {
                  "score": 205,
                  "content": "My husband has been pushing me to consider Lasik and it fucking terrifies me because lasers and eyes should not mix in my mind.... So this is... somewhat... relieving",
                  "id": 59,
                  "comments": [
                    {
                      "score": 227,
                      "content": "[deleted]",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I’ve had LASIK and PRK, and I preferred the LASIK, but both were fine. I’m pretty sure I got Valium, not Xanax, but it definitely chilled me out and I fell asleep as soon as I was in the car to go home. Highly recommend the eye surgery, if you are a candidate.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "LASIK was the best thing I ever did. My eyes were -9.50 and -9.75. I sat up after the procedure and was able to read the clock on the wall without glasses. The doc talked all the way through it, telling me what I was going to hear when the laser started and what he was going to do. And good gosh I’ve saved soooo much money in glasses. \n\nSo I’ve had someone use a laser on my eyes, and I still can’t imagine getting a piece of metal implanted in my eye!! NTA",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I'm terrified, too. No one talks about the smell of laser-beamed eyeball.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yes but I just got it done and there’s still a whole booklet of things that can go wrong. Even that took me 10 years to finally do - I can’t imagine getting metal stuck in my eye on a whim. I’ll stick with normal body mods instead.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I got mine done a couple years ago. Do you feel the phantom glasses?",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And this right here is why I still wear glasses. Well that and just being used to them at this point.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "100% agree.\n\nOP, you are NTA, but I also think you aren't taking the best approach with your sister. She wants to do something potentially damaging and permeant to her eyes that could impact her life long term. Her reason is she wants to feel sexy and normal and not like just a mom. Your response was \"you are a mom spend the money on your kid\".\n\nThis is going to push her to do it, since it's setting up her options as \"wild sexy cool eye woman\" and \"boring mom who can't do anything for herself/be sexy\".\n\nI'd go back and talk to her and tell her it's fine and normal she wants to be wild and sexy sometimes. Moms can be those things. She is still young and you understand. \n\nHowever, you are worried about the eye modification *specifically.* Say it can't be hidden if she wants to change jobs or careers at some later time like many other tats/mods. And say that if something goes wrong she could damage or lose her vision. Also, if true, you can say you don't think they look that cool or sexy. \n\nSay you understand she wants to get herself something to feel young and sexy, and maybe the two of you could discuss some tattoos or body mods or something else that would make her feel like less of a frumpy mom but don't risk her future. For example, even just her joining a fun and sexy/young activity or group, or using the money to buy herself new clothes, whatever. Also, most young woman her age don't have eye mods so it's not like this will help her fit in. \n\nSure, it would be nice to spend the money on her son, but she's clearly not going to do that, so I think you'll have much better luck with this approach then trying to get her to do a complete 180 and telling her her feelings are wrong.",
          "id": 67,
          "comments": [
            {
              "score": 41,
              "content": "This really ought to be top comment. She's 19, frustrated, and wants to do something for herself - telling her \"nope, you are ONLY a mom, not allowed to do or be anything else\" is not going to change her mind. She's also still young enough to feel invincible, so only focusing (heh) on vision damage might not get through. \n\nWhat she needs is an even cooler alternative. An idea that's sexy, fun, unique, **edgy**. Something beyond the \"traditional\" dye-your-hair-purple-and-get-a-tramp-stamp rebellion but that *won't* make her go blind. \n\n(I may be an old, but in my day you'd get piercings in interesting places and join a munch meetup.)",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Exactly this!!! OP, you are right but you need to strategize this conversation if you actually want her to listen to you.\n\nMaybe you could recommend cosmetic contacts? They're a cool way to enhance her eyes without surgery, and they even come in wild designs that will look unusual. You could even pitch this as a 'try this first to see if you like how it looks before you get the surgery'. If you can't convince her immediately not to do it, the next best thing is to delay her. Maybe she will get talked out of it or reconsider if she has more time to think about it, more people telling her its a bad idea, or more immediately interesting things to spend that money on.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I came here looking for this comment. By telling her to spend the money on her son, he’s basically reaffirming the idea that since she’s a mom now, all her time and resources must be spent on her kid and that her own wants and needs don’t matter anymore. A better response - like you said - would have been to help her find a less reckless way to feel young and sexy. Or at least validate her feelings.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "also will never be able to get an MRI done if she ever needed one. The implant wd be ripped out of her eye.",
          "id": 71,
          "comments": [
            {
              "score": 21,
              "content": "That was my first thought as well. I guess OP was kid when he said his sister is rather impulsive and doesn't think things through...",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "The major concern would be of the metal heating up, they'd use non-ferrous metal for the implant.",
              "id": 73,
              "comments": [
                {
                  "score": 10,
                  "content": "unless you have a random dude in the back of a van do the procedure :-p",
                  "id": 74,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yeah, how does the comment you're responding to have 44 upvotes?",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Glad I wasn’t the only one thinking about MRIs.  I have a benign tumor that we monitor with mris.  Have had about a dozen.  Just imagine having to have this ocular implant removed so they can do a scan.  Ouchies.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Internally screaming at the idea of deliberately getting something put into your eye. Whyyyyyyy? Also I realise this is in the eye of the beholder but it looks really bad... if you wanna feel 'wild and sexy' just get a navel piercing or do some vampy makeup or something...",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1241,
      "content": "NTA- she IS a mom. Once you have kids, it's not all about you anymore. Sure, it's a highly risky procedure, but it's also selfish and short-sighted.",
      "id": 78,
      "comments": [
        {
          "score": 358,
          "content": ">and short-sighted.\n\nIn more ways than one...",
          "id": 79,
          "comments": [
            {
              "score": 117,
              "content": "short-sighted person here, would confirm if i could see",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Just to start a conversation: why is it that as a mom she no longer can think about herself? And her identity now invested in her child? Don’t get me wrong she’s making a terrible decision. But I see this is a common thought process here that once someone is a mother, they have to put everything towards their child. They’d be considered selfish to do something for or think of themselves. \n\nOP: NTA",
          "id": 81,
          "comments": [
            {
              "score": 3,
              "content": "Not at all. Definitely once you have kids you can and should treat yourself. This, however, is a dangerous and unnecessary thing to do. When you accept the responsibility of becoming a parent, you also accept that there are some limitations to what you can do in order to still be able to provide for your child.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 586,
      "content": "NTA for advising, but it is ultimately her (bad) choice.  I looked up these extraocular implants and holy crap, why do people do this to themselves! I don't knkw why she needs to put a piece of metal in het eye to go wild, she could just go out all night once in a while",
      "id": 83,
      "comments": [
        {
          "score": 149,
          "content": "How is this even legal?",
          "id": 84,
          "comments": [
            {
              "score": 143,
              "content": "Right??? I can't even put in contact lenses,  it creeps me out too much, let alone put a PIECE OF METAL IN THE SOFT TISSUE OF MY EYE.",
              "id": 85,
              "comments": [
                {
                  "score": 78,
                  "content": "Do not Google image search this. Nightmare fuel for years to come...",
                  "id": 86,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I wish I had seen your comment before I looked it up. I am not squeamish, but this made me shudder",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I was equal parts curious and terrified of doing a google search. Glad I could read your comment before making a mistake.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Too late. 😕 infected eyes look horrible.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Wish I had seen your comment 2 minutes ago",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Too late. Nightmare fuel!",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It's probably not. My friends who get body mod surgery (tongue splits) do it in secret off the books.\n\n I like extreme body mods but this in particular is the dumbest shit I've ever seen.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 326,
      "content": "I just googled it to see what they look like, the number one thing that shows up is infected eyes, ewww! There are one or two pictures of the successful procedure but it’s quite high risk for something that just won’t be fashionable in 5 years. Has your sister seen what the possible risks look like?? NTA",
      "id": 93,
      "comments": [
        {
          "score": 65,
          "content": "I literally cannot unsee these images. I feel like my eyes are scarred by proxy.",
          "id": 94,
          "comments": [
            {
              "score": 20,
              "content": "I would suggest r/eyebleach, but in context that sounds even worse.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "I did the same because I’m old and out of touch and had never heard of such.  I kind of expected some of them to look kind of cool with bright colors etc but after googling it...I still don’t get it.  The examples are dull colored and hardly noticeable.  I wouldn’t notice it IRL and probably would just think they had something in their eye.   It just seems stupid.  But maybe I’m a fuddy duddy.",
          "id": 96,
          "comments": [
            {
              "score": 29,
              "content": "Hopefully I’m not a fuddy Duddy (25f) and I’m sure you’re not too! But yeah all that cash and risk for something so small? Just get your tongue pierced or your belly button or even nipple and that would look a little more wild",
              "id": 97,
              "comments": [
                {
                  "score": 11,
                  "content": "Exactly because at least with a normal piercing you can take it out if you change your mind later.    This could surely make someone blind or at the very least impaired.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Also all the risks from piercings and other body mods are straightforward medical issues. If you turned up to a hospital with an infected piercing, or let's say the piercer made a huge error and it won't stop bleeding, the hospital can deal with all that and won't give it a second thought.  This sort of thing would likely need very specialised care.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I didn’t even know it was a thing. Not gonna google it, glad you did the hard work. NTA",
          "id": 100,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 252,
      "content": "Mostly NTA. This sounds like a risky and expensive procedure, and it's totally reasonable to point out the risks involved. \n\nBut not sure I agree with this:\n\n>I told her she is a mom, in fact, and she should just spend the money on her son. He’s totally obsessed with skating and hockey, and I suggested to use the money for skating lessons. \n\nBeing a mom doesn't mean you should stop doing anything to enjoy your life, or that every penny you have should go to your kids. Yes, if the kid has some needs that are going unmet the money should definitely go there first. But \"he'd probably like skateboarding lessons, even though he hasn't asked for them\" isn't exactly a need.\n\nWhile an expensive cosmetic surgery probably isn't a good use of your sister's money, she can still spend some money on herself without being a bad mom.",
      "id": 101,
      "comments": [
        {
          "score": 119,
          "content": "This was my thinking as well. He’s NTA for wanting her to avoid getting a dangerous body mod but he is TA for making it seem that you need to give up your sense of self when you become a mom.",
          "id": 102,
          "comments": [
            {
              "score": 76,
              "content": "I did get a slight impression from that phrasing that he feels his sister should be punished for being a young mom. She's free to spend a little money on herself and her interests, and parents absolutely should take time for themselves and their hobbies. Though it's true that it's a very risky thing to pick.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "I also feel like this is exactly the wrong thing to say to talk her out of it. If she wants to do something fun for herself that costs money I would suggest just getting another tattoo.",
          "id": 104,
          "comments": [
            {
              "score": 25,
              "content": "She could literally go buy new clothes, makeup, etc. that make her feel “sexy” *and also* get something nice for her son. Although if she’s being supported financially by her parents and/or brother then OP would be right to be annoyed that she wants to spend her stimulus/settlement money on a risky unnecessary procedure.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "So glad to find this comment. For me this is an ESH and while OP is right about the implant, he needs to unpack some misogynistic thinking.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Thank you! I can't believe I had to scroll down so far to find this comment. Definitely NTA for advising her against this specific body modification since it seems to be very risky. However, there's no reason why she shouldn't be able to spend her money on herself, as long as her son's needs are being met. Mothers are people too! They are entitled to be selfish sometimes.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I agree, a risky thing like that is stupid but moms are still people.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Exactly. He totally missed her point that she wanted to do something for herself, not defined by her mom identity. He could have found her an artist who would do it safely, or steered her to a safer procedure. But now he’s lost that chance.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yeah, while I agree that getting an ocular implant is a terrible idea for someone so young with so few body modifications, and that OP is NTA, this “you can’t have nice things now that you’re a mom” approach didn’t sit right with me. If your kid’s needs are all fulfilled and you can afford it, you can still spend money for your own pleasure as you’re still a person (shocker!). I’m a mom and planning my next tattoo for when I have the money — and not feeling guilty about it at all.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly. He totally missed her point that she wanted to do something for herself, not defined by her mom identity. He could have found her an artist who would do it safely, or steered her to a safer procedure. But now he’s lost that chance.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly!! So many people glossed over that comment. Obviously her son should have things like food, clothing etc but moms are allowed to spend money on themselves and skating lessons for a 3 year old is definitely not a need.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "In this case, I disagree. It is a clear choice that the mother should probably use it for the kid (if not skating, at least for the kid's future education) instead of a stupid and dangerous fad. OP is right here in this situation.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 221,
      "content": "NTA ! that's a very risky modification to get and you're right to be concerned and advising against it.",
      "id": 114,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 144,
      "content": "NTA. It sounds to me like you were just trying to paint the big picture of the ramifications of doing such a risky and potentially career limiting modification. I probably wouldn’t have mentioned her son cause that opened the door for her thinking you were calling her a bad mother. I would have just said “there are better uses for that money” and left it at that.",
      "id": 115,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 131,
      "content": "That's not wild and sexy. That's just gross and creepy and the vast majority of people will be creeped out. I'd be way less weirded out by a split tongue. (You can fix those...)\n\nShe's in a phase. Tell her to get more tattoos and shelve this, at least. Get some sparkly nose jewelry. Or a different unusual piercing.",
      "id": 116,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "NTA - she's a mom and unfortunately having a child at a young age means that you miss out on a lot of stuff. Also, messing with your eyes especially at that young of an age is a terrible idea. I'm also concerned about what quality of artist says they'd do that when she's so young and doesn't have a lot of other body modifications. Your concerns are valid and you're imparting some wisdom as someone who is older and has multiple body modifications. Unfortunately, some people only learn from their own mistakes, and it's even worse that since she has a kid that means anything she does will affect him as well",
      "id": 117,
      "comments": [],
      "relation": "Support"
    }
  ]
}