{
  "post content": "Throwaway because people who know me are on here. \n\nBefore the birth of our daughter, my wife and I both worked full time in low-middle earning jobs with my wife earning a bit more than I but not by much. \n\nMy wife returned to work out of necessity when our daughter was 3 months old. Her mental health became pretty bad and she has a minor disability that makes work life a little hard and she found it a bit worse after having our daughter but we had to do what we had to do. \n\nMy wife's nan who sort of raised her and was her only family passed away sadly when our daughter was 6 months old. My wife inherited everything she owned. It was a big inheritance. Not enough for us both to immediately retire but a lot. Enough for us to buy a decent house outright, a new car each and to put some away for a comfortable retirement.  \n\nShortly after her nan died, my wife stopped working and became a stay at home mom. Partially due to grief and struggles at her job, and a bit because she always would have preferred to stay home with our daughter.  Thing is though, I'd rather not work and be a stay at home dad too but I've been sucking it up because we still need an income to get by. \n\nMy wife spoke with me recently about how to budget so we can live off just my income (she'd been dipping into savings to pull her weight but that's all tied up in investments now). I said if I'm the one who has to work (and I'd rather not) I don't think I should have to spend my money funding her hobbies and spending money. If she chooses not to work then she can buy clothes at the charity shop instead of new and get a friend to cut her hair for free etc. Or she can get a job working a night shift or start an online business or something to fund her spending money. I don't see why I should have to pay for stuff like her sewing materials and gym membership since I don't benefit from them and they're not my responsibility. I'm happy to pay for stuff for our daughter seeing as she's my responsibility so I don't think I'm being unreasonable here. I work 36 hours a week and I already pay for the bills and food. She said that's not fair if I get to enjoy my gym membership and hobbies like video games but the difference is I'm paying for them with my money. My wife said her inheritance was worth more than if she spent her whole life working and without that, both of us would be working anyway and having higher expenses from paying a mortgage and car loans so I should count that as her contribution and share my money with her. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 44817,
      "content": "YTA\n\nYou are aware that the inheritance belonged solely to your wife? Right? She didn’t have to buy you a house, car or fund your retirement.",
      "id": 2,
      "comments": [
        {
          "score": 14537,
          "content": "OP doesn't know how lucky he is lol",
          "id": 3,
          "comments": [
            {
              "score": 14458,
              "content": "I agree.  This insane.  She *bought them their house* but no gym membership?\n\nOP, if you feel this way, pay her for the car you are driving.",
              "id": 4,
              "comments": [
                {
                  "score": 8681,
                  "content": "And the house he's living in.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7951,
                      "content": "OPs wife should definitely start charging him rent. And car payments.  \nJeeeez this guy is delusional. \n\nOP your wife has been through trauma. She has a disability that makes working difficult, she lost the woman who raised her. I don’t buy your ‘sort of raised her’ given that your wife got everything. Obviously her Nan was extremely important and possibly the only real family she had. She used that inheritance to HOUSE YOU. You don’t have to pay a mortgage! You got a new car! Do you realise the position you’re in? \n\n\nDon’t be so bloody petty and jealous about her NEEDING to stay home right now. Have you even been supporting her emotionally during the grieving process?! I doubt it…",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 409,
                      "content": "and then leave, she sounds like she would be better off without this boat anchor.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "But he works a whole 36 hours a week! I mean I don't know how he manages that on top of his wife raising the kids, cooking and cleaning for the family, and providing a retirement fund. He's a trooper!\n\nYTA",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "She should charge him rent for the house  and lease for the car. \n\nSpending money problem solved\n\nShe had a lot of spending money on her hands before she bought a house and a car.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "But he works *36 hours a week!*That's like *almost* full time! /s",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 412,
                  "content": "I mean, if it's her money, it's obviously their money, but if it's his money, it's his money.\n\nAs it should be. \n\n/s",
                  "id": 11,
                  "comments": [
                    {
                      "score": 290,
                      "content": "He sounds jealous and entitled. “You bought us a house and new cars, why do I have to work?”",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "“What’s yours is mine and what’s mine is also mine.”\n\n-OP",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 301,
                  "content": "She should charge him rent for house and lease of the car.\n\nYTA",
                  "id": 14,
                  "comments": [
                    {
                      "score": 19,
                      "content": "So let's do some back of the napkin math.  \n\nUsually rent is about 1% of the house worth.  Since she bought a house outright, he would owe her his half.  So let's say 0.5% of the house worth as a rent check from him, or 1% of half the value.  (He would actually owe it all because it's inheritance and she would own outright but I'm giving him slack).  I'm going to just guess $200k for the house which is really low.\n\nNext the car for him I'm going to guesstimate as $30k.  \n\nThen his retirement which we have no idea about but I'll put a low figure of $100k.  \n\nSo half the house is $100k + $30k car + $100k retirement = $230k to him from her accounts.  1% of that is $2,300/month.  \n\nSo he should write a monthly check for $2,300/month to her and that's her spending money.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I would throw in baby sitting costs as well.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 224,
                  "content": "I hope she didnt put his name on the deed of the house. What a nerve this  OP has. If my hubby pulled something like this, I would not be happy. Of course I get it he doesn't feel it is fair he has to work. Staying at home with a young kid is not a walk in the park. Plus his wife has a disability and she was generous with sharing her inheritance to improve their lives. Your money is my our money but my money is only mine. Pfff.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And half of what child care would cost. Plus if he’s not doing 50% of the cooking and cleaning, charge him for that.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And he only works 36 hours a week!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Her: *Happily buys him a house & car out of the love in her heart*\n\nHim: “$10 a month for her physical health? Naw fuck that, it’s MY MONEY & I need it NOW!”",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 400,
              "content": "He really doesn't. His poor wife! Reading everything he wrote just made my heart hurt so much for her. It's so clear he doesn't value her or her contributions at all, and he seems to have no regard for her at all.\n\n>I don't see why I should have to pay for stuff like her sewing materials and gym membership since I don't benefit from them and they're not my responsibility. I'm happy to pay for stuff for our daughter seeing as she's my responsibility so I don't think I'm being unreasonable here.\n\nJust what is wrong with OP???\n\nYTA, big time.",
              "id": 21,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Not to mention dude works 36 hours a week. Like damn dude. Pick up an extra shift or something and you can probably pay for her shit too",
              "id": 22,
              "comments": [
                {
                  "score": 13,
                  "content": "He isn't having to pay for a mortgage or car now, so could probably get by on those few hours, but is too much of a wanker.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "This is true for many reasons. As u/Bitter-Conflict-4089 pointed out - inheritance solely belongs to your wife, meaning, if she divorces you, you don't get that house, or the car (either of them), or the savings for retirement. You have no claim to it at all. Technically, you have nothing, but whatever you're making in your job. You ARE lucky, so I guess continuing to 'suck it up' to provide for your family is something you'll have to do until you inherit something massive. So bizarre to feel that way about your wife and child. YTA.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I still will never understand how these incredibly selfish people make it past the altar with decent partners. Like how and why??",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yep. Poor woman, what a thankless life she must live. OP definite YTA.",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "And 36 hours a week??",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "The entitlement is real.\n“My wife funded my retirement plan and bought us a\nHouse but paying for her gym membership is unfair :(“",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Don’t forget the cleaning, and child raising, and cooking, and all of the other at home work that still happens. She is pulling her weight and then some. YTA",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "But but but but he works 36 hours a week!!!!",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1782,
          "content": "He is just jealous that he still has to work lol",
          "id": 31,
          "comments": [
            {
              "score": 2153,
              "content": "But he works a whole *36 hours a week* the poor baby\n\nI lost any sympathy I had for him at that. I was thinking he was stuck in 50-80+ hour overtime hell, but OP is living the easy life.",
              "id": 32,
              "comments": [
                {
                  "score": 542,
                  "content": "Sounds like he's in the UK where a full-time job is generally 35-40 hours depending on if you get paid for your lunch break. You're not legally allowed to work over 48 hours unless you sign a contract for it.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 366,
                      "content": "A 40 hour work week is pretty normal in Europe. The Scandinavians are looking into a 30 hour workweek now.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 259,
                      "content": "I am in the UK and can tell you I’d kill to afford to only work 40 hours 😭",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 183,
                      "content": "If he's in the UK working 36 hours and still living comfy I'm jealous! I work 39 hours a week 🙃 I don't get my home and car paid for and complain about having to buy a membership 🤣",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 450,
                  "content": "🙄 And im sitting here in my 60 hr a week warehouse job, still renting, ten year old car, and breaking about even after bills and groceries*. Boo fucking hoo OP.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 158,
                      "content": "Right? I've been stuck at home pulling near 70 hrs oncall a week recently. Gods I wish I could cut down to 36 hrs. \n\nI'm stuck at home and yet I have no real free time outside of fiddling with my phone when I have a minute between random calls and meetings. This dude is so lucky and he's whingin up a storm. I've barely gotten any sleep these last few days. \n\nI wish my SO could fund my retirement and buy me a new car for the low low price of a gym membership and sewing supplies. What's that like less than 300 a month for both?",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yes!!! I’m not saying I’m envious of his situation (but I am) but please don’t come here expecting sympathy from the masses.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 394,
                  "content": "My man works 60+ hr work weeks in a Pyrex factory, and he would NEVER tell me to buy clothes from goodwill or I couldn't go pamper myself at the salon. We have 3 under 3 and he'll even lose sleep on bad nights to help me soothe the kids back to bed. This guy is a chumbucket",
                  "id": 40,
                  "comments": [
                    {
                      "score": 39,
                      "content": "OK, plankton.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "I work 40+ a week, while pregnant so my husband can stay at home (it’s just what’s better for us). I’d never dream of telling him to go buy clothes from the thrift store or go without a good haircut/pamper when he needs it. I wouldn’t treat myself that way, so why would I do that to him? \n\nAbsolutely agree. He’s a fucking chumbucket.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 166,
                  "content": "Haha this stood out to me too. 36 hour work weeks, must be European. Come over to America where we work over 40+ on average, with 10 days of PTO a year, and then tell me how much you want to quit your job. The entitlement and immaturity of this guy, he’s gotta be in his early 20s or something and just married young.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 89,
                      "content": "10 days?! You Americans get such a raw deal.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "Yeah no the 10 days of PTO isn't at all appealing I'm sorry yous have to deal with this!",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "TIL that 36 hours a week is apparently an embarrassingly small number of hours and not just a normal full time job in other countries",
                  "id": 46,
                  "comments": [
                    {
                      "score": 63,
                      "content": "Unfortunately for Americans, that would generally be considered a part-time job and would likely prevent the employee from accessing any benefits, such as health insurance, PTO, seniority, etc.  since we suck as a country and have our health tied to our jobs, working less than 40 hours per week results in people who not only live below the poverty line but who also have to skip going to the doctor and working while sick because they can’t actually take a day off or pay for medical services.  That is one of the many reasons that Walmart gets so much hate.  They deliberately keep their employees at 39 hours or less per week to avoid having to provide health insurance or other benefits.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 440,
              "content": "if his wife is a stay at home parent, she's working - likely with few breaks!",
              "id": 48,
              "comments": [
                {
                  "score": 288,
                  "content": "[deleted]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 106,
                      "content": "He definitely does not. I’ve been a stay at home parent and worked outside of the home. I currently work in pharmacy, which is very stressful but I’ll tell you one thing - it’s nowhere near as stressful as being a stay at home mom.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Funnily enough, he's almost there. He suggests she get a night job to supplement her spending money. So she'll work as a nanny, cook, and cleaner all day, for no pay, then work a night shift so she can have some money for clothes.",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 77,
                  "content": "Yes, Little kids are really hard work!! That's her contribution too. Otherwise they'd be paying for daycare so there's a real monetary value to staying home with their little one.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 183,
              "content": "The wife is working, just not getting paid.",
              "id": 53,
              "comments": [
                {
                  "score": 15,
                  "content": "Absolutely. That's the crappy thing about being a stay at home parent.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1038,
          "content": "OP is a massive, smelly AH just because of this ☝️\n\nBut also, as a SAHM OP's wife provides round-the-clock care for their daughter... She should start charging him for that service. If he *dOesN'T wAnT to fUnD* her wellbeing, then why should she provide free child care? \n\nOP you sound like a competitive, jealous person, not a partner.\n\n# YTA",
          "id": 55,
          "comments": [
            {
              "score": 190,
              "content": "I really wish OPs wife just kept her inheritance separate and left OPs jealous butt. Or better yet she should have rationed it out as her ‘contributions’ to meet OPs petty behavior.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "And the whole “it doesn’t benefit me at all” comment… like dude what kind of partnership is this?? \n\nYTA massively",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I know Reddit is always DiVoRcE, but seriously I would absolutely divorce this guy. He doesn’t value her contributions, he’s jealous, he’s ungrateful for the home being bought outright, the car, and their retirement. If I were her I would downsize housing and not have to worry about my alleged “husband” resenting me and being ungrateful. YTA OP, truly hope this boils and she leaves you.\n\nEdit:a letter",
              "id": 58,
              "comments": [
                {
                  "score": 14,
                  "content": "I'd love to receive an update from OP's wife saying exactly what you mentioned: *\"I've downsized, kicked OP out and sold his car. I now dry my tears with hundred dollar bills\".*",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yup.\n\nAgreed.\n\nOP - you are not pulling your weight in this marriage at all. Not even a little bit. \n\nYour wife bought a house, cars and funded retirement. What exactly have you brought to the table? \n\nI just see a grown man whining about not wanting to work after his wife paid for the biggest household expenses outright. Dude, grow up!",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "While OP is an absolute AH, it also sounds like he doesn't realize that many couples decide to have one parent stay home because childcare sometimes can cost more than a persons monthly salary or very close to it, that it just winds up being cheaper in the end to not have to pay someone to watch your child. \n\nMy eyes just kept opening wider and wider as I read this. Dude is an absolute pair of clownshoes.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Just going to drop this link: https://www.billthepatriarchy.com\n\nOP = THE AH",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "What a chucklehead. 🤡",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 681,
          "content": "If he wants to keep things separate, maybe he should start paying half a rent to her and pay for the car he drives...",
          "id": 64,
          "comments": [
            {
              "score": 577,
              "content": "Dont forget childcare, housekeeping, personal shopper, private chef, bookkeeper/accountant, etc. \n\nDude, YTA.\n\nEdit: Thank you, kind strangers!! 💖",
              "id": 65,
              "comments": [
                {
                  "score": 126,
                  "content": "Exactly! She should give him an itemized invoice for her hours at the end of each week.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 404,
          "content": "YTA. He wouldn’t have a new car and new house if it wasn’t for his wife buying them. I can’t believe his selfish mindset, especially after his wife so freely shared her money. She treated it as their money, not hers, so in return he should do the same. \n\nIf I were her I would consider kicking him out of MY house, selling the car I bought him, and divorcing his selfish self.",
          "id": 67,
          "comments": [
            {
              "score": 188,
              "content": "Oh, no, I am sure while she was buying those things, he talked abiut \"our money\" the whole time. Her money is his money and his money is his money",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> If I were her I would consider kicking him out of MY house, selling the car I bought him, and divorcing his selfish self.\n\nSadly she already mixed the funds so they're now considered marital assets.  She really needed to insist on a post-nup before she'd share the money.  Now it's too late and he can claim them.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 306,
          "content": "Agreed. Based on this logic (what’s his is his) OP should return the car to his wife and be paying rent to her for the house that she purchased. Solved the problem of spending money. \n\nNot to forget also that full time childcare is unpaid work. But work nonetheless. So basically he also needs to pay half of childcare.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "The further I read this the more whiny the “MY money” sounded. He’s going to retire off HER money. Also, they are married, he’s acting like she’s his roommate or concubine.",
          "id": 71,
          "comments": [
            {
              "score": 12,
              "content": "Right, I'd pull his retirement fund made out of MY money to use on my hobbies and reinvest it to get dividends or myself",
              "id": 72,
              "comments": [
                {
                  "score": 10,
                  "content": "Ha. She should suggest this.  \n\n\n\"Ok that's fine, you don't need to help with spending money. BTW, you may want to make some retirement contributions because I'll be needing to withdraw some money to make this work\"  \n\n\nSee how quick he changes his tune.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "And he's treating her worse!",
              "id": 74,
              "comments": [
                {
                  "score": 7,
                  "content": "Yah if she wanted to make it fair I’d charge him rent and a car payment",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 173,
          "content": "If OP is going to play the \"my money\" game, he needs to add up what half the house cost, the cost of his new car, and half of anything else they both \"benefit from\" paid by the inheritance. He owes his wife that much money, the apparent spending money is now him slowly paying her back.\n\nI hope the house is solely in her name, it's the only way it's safe from OP's jealousy.",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 150,
          "content": "Also she IS working. She’s raising your child and without her doing so you’d be paying a stranger to do it. Think of your child and the benefits to having her mother be her FT carer while she’s so young. YTA OP",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "I know right! I shouldn't fund your gym or sewing but please keep funding my car, home and retirement.",
          "id": 78,
          "comments": [
            {
              "score": 7,
              "content": "Not to mention, she could fund her own gym and sewing if she hadn’t funded his brand new car!",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19352,
      "content": "So your wife bought you a house, two cars, fully funded your retirement, and is raising your kid but you don't think you should pay for things she enjoys?  Maybe she should take back the house and cars.",
      "id": 80,
      "comments": [
        {
          "score": 7053,
          "content": "She could sell OP’s car. It is brand new. That should cover her pocket money for awhile.",
          "id": 81,
          "comments": [
            {
              "score": 3786,
              "content": "Yup and charge him rent while she’s at it. The absolute nerve. What should have been mortgage money is now rent money that he owes. Pay up.",
              "id": 82,
              "comments": [
                {
                  "score": 1275,
                  "content": "I hope she made sure the house was in her name only.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 1124,
                      "content": "Of course she didn't.  She trusted him.",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 136,
                      "content": "God I hope so.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 345,
                  "content": "And charge him for child-care. If they were both working, they'd have to pay daycare. Why not calculate the cost and charge him half the monthly rate?",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "She should just charge him the going rate on daycare for an infant. That's gotta be about $2k a month.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 11,
                      "content": "*half* the going rate. Shes one of the kids parents so she'd owe half the bill.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "He can also pay half the amount he was spending on childcare to her, since she's now providing childcare during the time he's at work.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 279,
              "content": "This is why my immediate thought was ‘this must be a joke’\n\nShe should divorce him and kick him out and see how he likes it when he’s got to pay child support and rent!\n\nI agree they should have discussed the work situation and see if they can both go part time as it looked like she quit as soon as she could but it wasn’t a joint decision but there are other ways around this like OP going fewer hours or a different job. NOT resorting to childish ways of ‘my money is for me’\n\nYTA",
              "id": 90,
              "comments": [
                {
                  "score": 14,
                  "content": "Fewer? He doesn’t even work full time now. And she might have quit, but she’s disabled and I guarantee her money is why he can get away with having a family and only working 36 hours a week—which also means no benefits, so he’s not even providing health insurance or anything for his wife and child. Her money is still making his lifestyle possible.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 7,
                      "content": "TBF, some jobs do offer health insurance at 36 hours per week, but you still do have to pay part of the benefit. Which is probably coming out of his wife's inheritance, along with his car payments.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Right? I know with these type of posts, we'll never get a update, but I always secretly wish we could get an update where he cries about how she's leaving him despite all his empty promises to do better and why couldn't she have told him what the problem was before going straight to divorce blah blah blah\n\nWith this type of attitude, I doubt OP would see the light even if his wife did leave him. He would probably just tell everyone his ex was crazy and only wanted his money. $10 says even if he reads any of these posts, rather than realizing how much of a toddler he's been, he just whines about how everyone is out to get him instead",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 873,
          "content": "I'm also a bit curious what OP considers a minor disability, etc. I can't get over any of it honestly. She has basically used her inheritance (which in many places she could have kept seperate and it would have continued to be 100% hers) to buy a house outright (no mortage), new cars for each, with enough left over for a combine retirement, and somehow his measly 36 hrs a week can't be spent on anything for her. He doesn't even recognize the work she is doing at home. I also wonder what he actually did as a stay at home parent. Home much was she still having to do when she got home. Ugh. All of it ugh. I can only assume this is rage bait.",
          "id": 94,
          "comments": [
            {
              "score": 460,
              "content": "If it interferes with her ability to work, I doubt it's a \"minor disability.\"\n\nAnd I doubt her life is easy or luxurious. It's flipping HARD to care for a child while sick, day in and day out. There's no respite, and you have to put on a brave face to not stress your child. (I'm a disabled mom.)\n\nThe gym membership and hobby equipment are likely aspects of managing her condition - you're supposed to exercise (within reason) and reduce stress when you have chronic illnesses.\n\nOP is imagining his wife is on the couch eating bon bons when the reality is likely far different.",
              "id": 95,
              "comments": [
                {
                  "score": 133,
                  "content": "Disabled mom here too. It’s fucking exhausting!\n\nEdit to add: I usually end up staying up until 2am doing my PT exercises and other self care after my kids go to bed",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I have been disabled myself since I had my kiddo (well started when I was 7 month pregnant so close). Just the way OP says some of other things, gave me the impression is downplaying some of what is said, what wife does etc. \n\nI don't know why, but it is just something with the way it is written. Like her inheritance is somehow not worth as much as whatever he makes working, because she inherited it. That being a stay at home parent is some kind of vacation (not explicitly said but it came across that way to me)?  That clothes and a gym membership is some kind of ridiculous spending, but he can buy those things for himself. \n\nIdk just the way OP talks about this all is bizarre to me. If his crazy rationalization that what he makes working is only for things for him and his kids, I really wish the wife would have just kept all her inheritance to herself and not co-mingled it.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He sounds like he's jealous of the money she came into, albeit at the loss of an important person for her, but he doesn't care about that, no no. YTA big time.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Yep. I have 99th percentile inattentive ADHD. I assure you, it’s not minor. \nBut most people would describe it as such.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Also, if those major expenses are no longer bills, like mortgage, car payment, etc What is he using his money for? He can’t stomach having to buy her a gym membership?  He is super ungrateful and selfish.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I'm wondering about something like neurodivergence.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 127,
          "content": "The AUDACITY of this guy",
          "id": 102,
          "comments": [
            {
              "score": 7,
              "content": "“I work 36 hours a week” babe that’s not even full time 😂 acting like he’s slaving away",
              "id": 103,
              "comments": [
                {
                  "score": 8,
                  "content": "I know right!! Looks like he hasn't replied to any comments, must be that crazy work schedule 🙈 girl just bought them a house, car and retirement fund but she better start pulling her weight!",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "This is why OP YTA",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Even if she hadn't bought him anything, this would be financial abuse. She is caring for their child. She isn't free-loading. She birthed an entire human being, is disabled, and is suffering from PPD. And he's pissy he has to work? Good God, OP.  YTA. YTA. YTA.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "He wants to punish her. She bought him a house and car and funded his retirement, and he wants to punish her by making her wear somebody else's clothes and taking away her hobbies.",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I know how she can get an income. Charge this loser rent.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10120,
      "content": "YTA. Your wife paid for the house you live in & the car you drive but you won’t give her money to buy clothes or get her hair cut. Wow, hypocrite much? FYI, your wife IS working. She is taking care of your daughter & I suspect she is doing all the work to cook & clean & run the household, too. And did I mention that she gave you a house to live in & a car to drive? Don’t be so cheap that you drive off your wife. When she leaves you, she’ll take the rest of her inheritance with her along with your daughter.",
      "id": 109,
      "comments": [
        {
          "score": 1480,
          "content": "Don’t forget the car if she was smart enough to put it in her name. And kick him out the house while taking him for alimony and child support",
          "id": 110,
          "comments": [
            {
              "score": 556,
              "content": "I'm betting she was not that smart, if she's funding her his retirement. Poor woman.",
              "id": 111,
              "comments": [
                {
                  "score": 620,
                  "content": "I don’t think intelligence is the issue. This is probably a side of him she hasn’t seen until they inherited. But who knows.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 237,
                      "content": "Yup she trusted him and he let her down",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "And she’s grieving, ik my mom bought a shitload of stuff in her grief without thinking of the longterm consequence (in our case, it was just a car that turned out to be crappy)",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This. I feel so bad for her already. If OP continues to devalue and resent her for inheriting, those feelings aren’t just going to go away. I hope in the event she ever leaves him that she is able to take everything she paid off. But I highly doubt it since she probably loves her husband, but the other way around, not so much.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "She loves him I doubt she was expecting him to be this way",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 553,
          "content": "Shiii if I had a wife that vot me those nice things and took care my child literally any extra money I had after bills I'd split 50/50 maybe even a little in her favor lol like bruh let her have hobbies and be happy. Also... not to sound shallow but let your woman go to the damn gym everyone will be happier",
          "id": 117,
          "comments": [
            {
              "score": 181,
              "content": "And your wife would probably also be making your doctor's appointments and restocking the snacks in the pantry, too.",
              "id": 118,
              "comments": [
                {
                  "score": 158,
                  "content": "Sure yeah like.... dude if I had a girlfriend/wife that wanted to work? Great no problem. If I had one that wanted to be a stay at home g/f/wife. Sure I would expect the house to be cared for and such but also no problem. Like I had a girlfriend when I was younger that when between jobs she would stay home clean make dinner. It is such a like... stress relief to come home to a clean place and food. Man or Woman who takes care of the house deserves an equal share of the fun money.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 209,
                      "content": "I'm a stay at home mom and my hobby is canning. \n\nMy husband is like, \"I'm going to plant you cucumbers so you can make pickles, buy you some new gear at Christmas, and take our kid to the park so you can have some peace and quiet to do your hobby.\"\n\nBecause it's a small price to pay for everything I do around here, and he wants me to feel appreciated.\n\nPlus, homemade pickles!\n\nOP whines if his wife buys sewing gear? Pfft.\n\nOP should go to the fabric store, today, and buy her some lovely fabric as a surprise. \n\nPlus, sewing is a fantastic life skill. He's got someone right at home to mend things, and they can save a fortune by having her make stuff like pillows and curtains.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "I suspect his version of stay at home parents is her doing almost everything and him being a bum",
          "id": 121,
          "comments": [
            {
              "score": 30,
              "content": "He just wants to stay home and play video games all day - that will be his idea of stay at home dad.\n\nEdit-spelling",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "OP thinks his 40 hrs of work entitles him to 168 hours of hers.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "More needs to be said about this. Being a SAHM is a hard fucking job. When I go to work I literally feel like I’m having a break from my toddler lol.",
          "id": 124,
          "comments": [
            {
              "score": 12,
              "content": "Exactly! I actually started working again to take a break!",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I looked forward to going to work, when my twins were babies/toddlers! It was sooooooo much easier than caring for the kids and house!",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yeah, but he thinks of her inheritance as \"their\" money and the money he earns from his job as \"his\" money. So \"we\" bought a house and cars and got a retirement fund, but \"I\" refuse to pay for your fun. So gross.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Yeah the car and house probably lightened his month expenses anywhere from $1500-2000. Maybe even more This is insane. \n\nAs a stay at home mom, with no disabilities, I find it appalling he won’t give her pocket money. My husband pays my gym membership- he benefits because I feel better about life, he pays for my hobbies because it makes me happy which makes him happy, and a happy healthy mom raises happy healthy kids. And guess what, when my husband gets home from working a 60 hour work week- he helps cook dinner, do bath and bed with our little ones, helps maintains the yard, goes on family outings, helps pick up the house, takes the kids on occasion on his own so I can get a night out with friends (of course I do all these things too, just saying). Being a stay at home mom is a full time job. \n\nOP do you even like your wife? I hope she leaves your ungrateful YTA self.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": ">FYI, your wife IS working.\n\nYup, and I can guarantee she's working more than OP's 36 hours a week.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I hope OP's wife finds this post and it becomes glaringly clear who and what OP is. Hard YTA. I hope that she still has some of her inheritance left that OP can't touch so that she has options.....\n\nOP seems to want to financially abuse his wife because he is jealous that he can't quit his job. The wife has bought the house, paid for the car, takes care of their child, probably does all of the chores/cooking etc, and may still be dealing with her pregnancy related mental challenges and disabilities. OP on the other hand thinks they are doing her all of the favors by working 36 hours a week, not helping at home, and just contributing to his child's basic needs.... (BTW, 36 hours wouldnt technicaly even by considered working a full time job in many places since it isn't even 40 hours.) \n\nOP, you need to do some self reflection, because you will lose your wife if you keep acting like this. If you aren't being a good partner, sounds like she would be better off without you.",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5438,
      "content": "YTA. You are a family and it is your responsibility to care for each other. She’s taking care of your child and you’re expecting her to beg people for free haircuts? Humiliating. It’s not like she blew her inheritance on needless things for herself. She bought you a house and a car. And she is investing it, assumingly for a good future life for you, your daughter, and herself. Be a partner.",
      "id": 131,
      "comments": [
        {
          "score": 2034,
          "content": "That clothing and haircut comment infuriated me, that is so demeaning!",
          "id": 132,
          "comments": [
            {
              "score": 1443,
              "content": "Imagine as a woman, having to turn around to your friends and ask em if they could cut your hair because your husband wont give you money to go to a hair dressers..... even though... it was your grandmothers money that paid for his house and his car.",
              "id": 133,
              "comments": [
                {
                  "score": 976,
                  "content": "Maybe she should sell his car and he can ask his friends for lifts everywhere.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 112,
                      "content": "YES",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "And he can pay for his own retirement, since it isn’t his responsibility to pay for her spending money, it’s not her responsibility to make sure he can retire comfortably.",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 495,
                  "content": "Well I can. I really wish I knew what financial abuse was when I was 20. My grandmother gave me money to pay for a gym membership and a weight loss program after I had my kid because I gained a lot of weight while I was pregnant and feeling really bad about myself and she wanted me to be happy. He took it and spent it on himself and told me to rent VHS workout videos from the library and told me I wasn’t allow to use get Starbucks anymore (for those of you not old enough to remember VHS, a basic latte was like $2, rent was $700 for a nice apartment in a good area, and he made 80k a year to give you an idea). I wasn’t allowed to buy new clothes when I needed them, and I wasn’t allowed to spend money on food I wanted to make for us at the grocery store. I grew up poor and he lied to me about what he was spending money on so I thought we were poor and I had to make due. Which I did! \n\nGood news though, I’m divorced, had fully custody of my kid for ages now, still have the full support of my family, went to college, graduated, have a good job, pay my own bill, and my kid is an adult and loves me and wont talk to their dad. I pay for someone to come to my house to do my hair. \n\nThis guy and my ex husband can go commiserate with each other in a few years about how lonely they are and why they can’t understand why their wives left them. I personally would like to buy tickets in advance and personally pay for this dude’s wife’s popcorn so she and I can watch it together.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 68,
                      "content": "That is awful. Sorry you had to go through that. Glad you saw the light.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This sounds like what I went through. When I was 24(f) I got together with a 38 year old man, he made me hand him every cent I made, I would have to beg to keep some of my paycheck to buy myself something now and then. I could only shop at goodwill, nothing ever fit me, the food I had available to me to eat was trash because it was all we could afford. I often went without electricity, and at one point, did not have hot water for over eight months (including winter). I mostly stayed home to take care of his preteen daughter. \n\nHe meanwhile, was wining and dining every woman who would let him, treating himself to expensive clothes and meals every chance he got, and had a long affair with a married woman at his job, spending all his and my money on things and dates for her. \n\nFinally, he left me homeless and abandoned, and I was able to free myself. Now, three years after him, I am thriving. I'm still broke because I can't make a lot of money, but even broke, I have clothes, and food, and hot water all the time. I'm in trauma therapy for what I went through those six years I was tied to him, and luckily, I made it out without a tattoo on my vulva stating that I was his property.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "And you know if she stopped maintaining her personal appearance he'd complain she was letting herself go.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 515,
          "content": "His post reeks of not being a partner. Have you noticed the amount of words he used to belittle her troubles and achievements? A bit more, pretty bad, a little hard, a bit worse, and my personal favorite - minor disability (might be a medical term, but I doubt it)",
          "id": 141,
          "comments": [
            {
              "score": 185,
              "content": "OP probably wouldn’t call it minor if he suffered from that disability.  How degrading and unsupportive of a spouse (not a partner).",
              "id": 142,
              "comments": [
                {
                  "score": 89,
                  "content": "And the total lack of appreciation for her raising their kid whilst being disabled. Being a SAHP is hard work whatever the circumstances, I can't imagine how difficult it is while disabled, grieving and with an unappreciative partner.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm a disabled stay at home parent. I love my child more than imaginable, but it is GRUELING.\n\nOP is way out of line.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I’m sure OP has the *worst* man colds.",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I definitely noticed that he didn't say a single kind or appreciative word about his wife... he sounds self-centered and petty, like he has no empathy. I feel sad for her and I'm kinda hoping she'll divorce him. I bet he makes her life miserable.\n\nShe must be confused about what is wrong with him. You would think he'd be happy that her inheritance is allowing her to be a stay at home parent and to pay for cars and a house.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "He wants to punish her. \n\nI wonder if her mild disability has something to do with why she didn't realize she was married to such a cruel, bitter, punishing man.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "This is the best answer. \nForget all the business about \"she bought you a car and a house\" - those things were bought for the family, because she is clearly viewing this marriage as a partnership. \nOP responded to her opening a conversation about how to manage/budget the shared finances of that partnership, and he responded by treating it like they were two entirely separate/independent people. \n\nYour family is more than the sum of its parts.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3876,
      "content": "So with her inheritance money she got you a new car but you don’t want pay for her gym membership or sewing? Okayy, give her back the car so she can sell it and use that to fund her hobby. YTA",
      "id": 149,
      "comments": [
        {
          "score": 874,
          "content": "this is actually a pretty reasonable solution i think. it *should* pacify both OP's need to not have her financially dependent on him, and her need to buy hobby stuff. everybody will be happy, so long as he's happy without the new car",
          "id": 150,
          "comments": [
            {
              "score": 557,
              "content": "Just the car? He should be paying her back half the value of their home and not depend on her for their retirement either if he wants to keep their finances strictly separate, but I don't think OP did the actual math about who's spending more on who here, my bet is he's the one who'd be losing out majorly from his nickel and diming..",
              "id": 151,
              "comments": [
                {
                  "score": 248,
                  "content": "Typical rent is 1% of the value.  \n\nSo if the house is $200k then half is $100k.  Car about $30k.  Retirement I'm going to guess $100k.  So he got $230k for himself at least.  \n\nSo he should write a monthly check to her for $2,300 from his own accounts to her.  Every month.  Forever.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I'm not from the US, so I'm not entirely sure what the worth of $2,300 is in terms of living expenses. How much does it cost to feed a family of three decently for a month?",
                      "id": 153,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 328,
          "content": "Give her back the house as well. lol.",
          "id": 154,
          "comments": [
            {
              "score": 238,
              "content": "And the retirement fund ahah, have fun working to fill it back.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "She also bought a house. Presumably he's paying rent to her,  you know, because it's her house.",
          "id": 156,
          "comments": [
            {
              "score": 64,
              "content": "Right, that’s OPs problem with calling it “my money” then ignoring all of her contributions.  Even without an inheritance he should be supporting a SAHM as she is contributing to the partnership, saving costs of childcare, etc.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 53,
          "content": "he literally doesn't see a point in his wife being happy because he doesn't directly benefit from it \n\nwhat a leech",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Nah, he should pay her rent then. Her half of the rent she already has covered. He can pay her his half of the rent for living in her house and she can use that money on herself, if he wants to be so stingy about what’s his. The house isn’t.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Bet if they divorce he's going to be super fucking greedy too.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I think it's more concerning how he thinks about his WIFE'S hobbies. It's like he doesn't see her as wife and partner but a girlfriend. Why should he pay for girlfriends hobby stuff It's not like they're married or anything. He seems to think he pays for his stuff and she pays for hers and lord forbid she needs extra money to pay for her stuff. This thought process is much cause for concern",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3559,
      "content": "YTA \n\nYou're completely out of line. She bought YOU a new car, she paid for the house YOU live in, she birthed YOUR daughter.\n\nLet's start with the clothes thing. Restricting her from buying clothing from anywhere other than a second hand store is a way of making her feel like she's worthless,  so nice job there. \n\nAnd the sewing stuff,  maybe consider she could make clothes, fix clothes, make things she might  choose to sell as a small home business as she raises your daughter? Earning a little cash when she's established and feels confident. I'm sure she's not just filling the house SHE bought with ruffled pillows.\n\nYou do understand that raising a child is a full time job right? Feeding, cleaning, educating, giving them the attention they need. Not to mention tidying the house, cleaning everyone's clothes, cooking etc \n\nDo you go to your daughter when she cried at night? Do night time feeds? Burp/cuddle? Interact with her for more than 30 seconds?\n\n36hours a week, I remember my first part time job.",
      "id": 162,
      "comments": [
        {
          "score": 1056,
          "content": "I'm 61 and I still work nearly 50 hours a week.  Those 36 hours are part time to me too. Shit, I'd love to work 36 hours a week plus knowing my home and car are fully paid for. Jeez!",
          "id": 163,
          "comments": [
            {
              "score": 302,
              "content": "I know right! I think OP needs some perspective on how good they have it.",
              "id": 164,
              "comments": [
                {
                  "score": 9,
                  "content": "How good *he* has it. She foots the entire bill and can’t even get a haircut or clothes out of this AH.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 400,
          "content": "I wouldn’t go to assuming he fully neglects his daughter. \n\nThat being said, it’s clearly not about the clothes and hobbies, it’s about being resentful that he is working. He is forgetting the massive weight she has pulled in housing and retirement, because he doesn’t want to work. He is being wildly passive aggressive about his resentment that she isn’t working, and is hoping this little tantrum will convince her to go back to work. He’s blind to how good he has it, and doesn’t seem to understand what partnership means. \n\nOP, YTA. We all do things we don’t like to do, grow up. You aren’t paying a mortgage or car payments, while not paying for childcare, and you have far more money from your paychecks now because of it, she did her share, and she gets a share of the income.",
          "id": 166,
          "comments": [
            {
              "score": 216,
              "content": "You're right in that, but honestly, the general misogynist vibe I'm getting from the way they write, I wouldn't put it past him.\n\n100% on what you've written about the long term benefits he's forgetting due to the dramatically decreased financial burden thanks to his wife.",
              "id": 167,
              "comments": [
                {
                  "score": 8,
                  "content": "He didn't once mention how much less he has to do around the house because his wife is there full time. My best guess is that she was already a fulltime housekeeper and had a full time job before.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I agree. I am not certain if OP understands what SAHM/SAHD actually revolves around. Considering that one of his hobbies is video games, does he imagine that he would be playing games most of the time while leaving toddler before TV screen?\nApparently wife has some disability which makes it harder for her to work. I imagine that she has post pregnancy symptoms too. So it is completely logical for one with difficulties to stay at home. It seems that OP doesn't care about his wife's well being.\n\nAnother issue - gym membership is considered as a hobby only for her enjoyment. Not taking into account health benefits, would OP be fine if she became overweight? Isn't it pleasant for him to see his wife in shape?\nAlso, if money is tight, he can ask that she bought less expensive clothes. But he never even noted that the budget she spends on clothes is huge...\n\nI am not even talking about inheritance money. Even without such fact, there are too many red flags.\n\nYTA.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "i just know that OP wants her to go back to work so he can be the stay at home parent and effectively contribute absolutely zero since she already covered housing and retirement. literally all he's paying for is groceries and utilities and he's still trying to be a scrub",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He keeps saying he wants to be a stay at home dad. I really don't think he gets just how hard that is. When you do all the work at least. My husband understood how hard it was. The few times he slipped up and said \"it's my day off\" I told him I'd trade him jobs or asked when my day off was and he apologized. Because he knew I wasn't sitting around all day, I had a person (or people in our case) fully dependant on me for all their needs on top of trying to keep up the house. \n\nI wonder if OP does his part of the childcare and housework when he is home. Which is a lot more than a lot of people. Or if he's going to the gym whenever and using his extra money that isn't going to rent, car payments or retirement to live it up while his wife is struggling at home.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’d argue that being a stay at home parent is more difficult than is part time 36 hour a week job. Stay at home parents work 24/7. There are no breaks. Nap time is chore time. You can’t take your eyes of a baby for more than a few seconds. I have a 9 month old and I wake up in the night and go upstairs if she needs something. I wake up when she wakes up. Maybe that’s 5am, maybe 7am, 8am if I’m lucky. \n\nI’m a work from home mom. So I don’t do the cooking and cleaning like this woman probably does, my husband does it. And our money is *our* money.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "He’s jealous of her being at home and doesn’t want to acknowledge that being a SAH parent is a full time (unpaid) job, so is exerting control by restricting her life style choices.\n\nIt’s worse because she likely needs those to manage her disability and mental health issues",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Don't put idea in his head he'll be running a sweat shop out of the house.",
          "id": 174,
          "comments": [
            {
              "score": 7,
              "content": "I'd laugh if I didn't think that would be a possibility.",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2059,
      "content": "INFO: So, would you be upset if by your logic, she takes away the car she bought for you? Because why should she fund your enjoyment?\n\nOr is what you’re saying what’s hers is both of yours but what yours is just yours?",
      "id": 176,
      "comments": [
        {
          "score": 1186,
          "content": "BuT heS wORkiNg 36 HouRs a wEek!",
          "id": 177,
          "comments": [
            {
              "score": 688,
              "content": "Haha, I actually laughed out loud at that line. Like, is that supposed to be a lot???",
              "id": 178,
              "comments": [
                {
                  "score": 307,
                  "content": "I agree people should be able to work for that amount of time and get by, where I’m from 40 h/week is a full time job. So, in that matter he work 90%. But he seems to have forgotten that his wife already contributed more to their finances than he will likely ever be able to do. She’s also sick and she has grief, on top of recently going through pregnancy and birth and she seems to take care of their household alone. And he denies her SMALL treats like a haircut, because her money doesn’t come from an employer. The absolute nerve.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "My husband works in the film industry- he can easily pull 80 hr works weeks in 5 days. I laughed my ass off with this man whining that he has to work 36 hrs a week when he got a free house, car and retirement. \n\nThe audacity of this man wanting his wife to buy thrift store clothing while he drives around in his new car purchased by his wife, and comes home to the home he contributed nothing to. \n\nI really hope this woman put that house and retirement  in her name only, because inheritance is usually separated in divorce decrees. But I doubt it, because she likely trusted him. I feel so bad for her.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "His wife is DEFINITELY working more than 36 hours as the stay at home parent and manager of the household",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "Sounds like he should pay rent, why should she fund his housing?",
          "id": 182,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1787,
      "content": "NTA\n\nOf course you should not have to pay for her hobbies.\nShe can just take that out of the rent you pay to live in her house.",
      "id": 183,
      "comments": [
        {
          "score": 414,
          "content": "Only NTA I agree with",
          "id": 184,
          "comments": [
            {
              "score": 110,
              "content": "Also he thinks her hobbies are bad but his like videogames are still fine to pay for. In terms OP might understand: marriage is a cooperative game, if she loses you lose too, so fucking act like a team player. She shared her inheritance, the least he can do is pull his weight and pay her rent if they have split finances, or just not complain about \"his money\" if they don't have split finances.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 265,
          "content": "And the car payment for the brand new vehicle you drive because of her.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 149,
          "content": "I almost spit out some water when reading this. You know he's not paying rent 🤣.",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 84,
          "content": "Take away his retirement money she funded too.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "Bingo!",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Or out of babysitting pay",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Yep. I’m a SAHM. My husband often says that he can’t afford everything I do. I’m currently 6 months pregnant. \n\nI’m a knitter. I knit for myself and for people I love. You know what he does if I want new yarn? Not this. And if I’d bought him a car, a house, and partially funded his retirement he wouldn’t say a damn word if I used “his money” for my hobbies.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She's gonna be getting $2k+ in rent from this guy lol!\n\nPaying for haircare and clothes would be ***a fraction*** of what he actually owes her.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "If I had awards to give you would get them.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1231,
      "content": "YTA—inheritance is not marital property.  You have a house because she paid for it and I’m guessing she doesn’t charge you rent.  You have a new car because she bought it.  She’s taking care of your child.  She could’ve just kept all that money to herself and spent it on her hobbies.  I hope she didn’t put you on the deed to the house or registration for either of the cars.  Remember you have what you have because of her. Your ungrateful.",
      "id": 194,
      "comments": [
        {
          "score": 211,
          "content": "I had the same thought. I hope she didn’t put him on the house deed or car titles. He certainly doesn’t deserve it.",
          "id": 195,
          "comments": [
            {
              "score": 52,
              "content": "I had the same thought. I hope she didn’t put him on the house deed or car titles. And she invested for your retirement. He certainly doesn’t deserve it.",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Even if she did giving the fact it was bought during traumatic circumstances and she can already prove his financially abusing her a good lawyer may undo it. He used her grieve and no doubt a promise about staying home if she did. She needs to document everything and talk to a good lawyer",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 817,
      "content": "I feel like you should support your disabled, grief stricken homemaker of a wife a lot more. \n\nShe's taking care of your home and child right? Paying for childcare would wipe out her salary most likely.",
      "id": 198,
      "comments": [
        {
          "score": 116,
          "content": "Exactly. I was 21 when I had my first child and my husband and I realized that any money I was going to make at my job would have completely gone to childcare for our baby and it STILL wouldn't have covered the expense. So I quit when he was born and I've been a stay at home mom to all my kids since then......almost 22 years 😳 That's a lot of childcare money saved!",
          "id": 199,
          "comments": [
            {
              "score": 14,
              "content": "Childcare is about the same as rent, these days! Even more if they have to change diapers! Apparently he wants to pay for that?",
              "id": 200,
              "comments": [
                {
                  "score": 23,
                  "content": "Oh no, you see, he wants her to get a part time job with a NIGHT SHIFT. So she can literally work all day and night while he gets his cake and eats it too.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Oh, yeah. Because why should his wife have five minutes where nobody wants something from her…",
                      "id": 202,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": ">She's taking care of your home\n\nCorrection, *her home",
          "id": 203,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}