{
  "post content": "I have a high school friend, Diana, whom recently got her Masters degree. She lived in another city and we barely ever saw each other and she was always “too busy” for long phone calls so we only talked briefly every now and then. \n\nDuring the time she spent on her degrees, I managed to get married and start my own family. \n\nDiana was visiting her family and we met up for lunch. I asked her about her degree, work prospects, etc. (She did her masters in translation or interpreting or something like that) and she said she got the job but will have to move to Brussels. I told her that’s crazy. If she can’t find a job locally, then her degree was a waste of time if she has to move to another country.\nShe said it’s an amazing job opportunity that she couldn’t get anywhere around here (apparently the job is related to EU parliament or whatever, I admit it, I lost her with all the abbreviations she was using). \nShe again said that it’s an amazing opportunity and she’s excited.\nI asked her about the pay and she told me. I said that my husband earns that without a degree so I was right about the Easter of time and money, and she said it’s  starting salary and it’ll grow because the first year I saw pretty much training and being in a junior position.\nI again said that she could’ve gotten a similar job here and wouldn’t have wasted 6 years Andy instead could’ve already work Andy start a family.\nAnd here’s where she was rude, she said that if she was to be as unhappy as I was, she didn’t want a family’s. She threw in my face that apparently I’m always complaining about my husband but I’m criticising her, he’s the best husband in the world.\nI told her she’s ridiculous and mean and she called me an asshole, paid and left the restaurant.\nI to,d my friends about this and they’re split in who’s the asshole here so tell me, Aita for telling her the truth?",
  "id": 1,
  "comments": [
    {
      "score": 68822,
      "content": "Thank fuck she's leaving the country to get away from your jealous ass. YTA",
      "id": 2,
      "comments": [
        {
          "score": 20971,
          "content": "And it's a serious wonder why Diana didn't have time for long phone calls with OP while she was in her masters program.",
          "id": 3,
          "comments": [
            {
              "score": 12302,
              "content": "OP is jealous and bitter, and she clearly wouldn't understand that graduate school can be *intense*. When I was going through grad school I didn't have time for long phone calls and missed many social gatherings, but OP seems to think her friend was just avoiding her?\n\nGirl, you are *not* the main character in everyone else's life story. People have things going on that have nothing to do with you.\n\nEdit: changed some wording, not everyone has as strenuous a graduate school experience as I did",
              "id": 4,
              "comments": [
                {
                  "score": 4847,
                  "content": "It’s not a reach to think that Diana might have been avoiding her — having read the post, I’d avoid OP too.\n\nThey’re very different people with divergent goals, but only Diana seems to understand this while OP does not.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2312,
                      "content": "Right, she was essentially meeting up with her to say goodbye before she left the country. Then she gets hit with the sort of nonsense she's probably been actively avoiding for years. \n\nOP is the sort of petty person who hates their life but won't admit it. You can't complain nonstop about your situation and then pretend you have the moral high ground and insist everyone else do the same as you!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 752,
                      "content": "I got to the end of the second paragraph and was like \"oh, no wonder her friend doesn't communicate much.\"\n\nAnd then I read that the job was in Brussels and started loling because I had a feeling I knew where this was going, but she even topped that by being like \"some EU Parliament thing, I don't know.\" At that point, I officially lost my shit.\n\nOP is not only smugly judgmental but also clearly quite ignorant and lacking in curiosity, which makes that sense of superiority that emanates off of OP all the more annoying.\n\nYTA, OP. Your friend, on the other hand, sounds pretty awesome. I'm sorry you don't see that.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 643,
                      "content": "Oh totally! If I were Diana, I'd absolutely avoid her too!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 587,
                      "content": "Likely OP would call and vent/complain about her husband and kids.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 522,
                      "content": "Sounds like Diana has outgrown OP intellectually.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "So evident from OP's wording: \"I managed to get married and start a family\", like that somehow trumps someone expanding their knowledge and gaining an advanced degree. LOL.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1716,
                  "content": "I’m also thinking htere’s an intellect mismatch between OP and her friend. To not appreciate how fucking cool it is to be an interpreter in Brussels for an org in the EU (whose abbreviations she couldn’t keep straight… this isn’t behind the Iron Curtain 1952) shows OP doesn’t have any reference points for the world outside domestic life.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 713,
                      "content": "I know, right? I'd be ecstatic if I was offered a job at the EU *freaking* Parliament!!!! Last year, I went through two rounds of examinations to work as a UN translator and I failed (they don't tell you why) and I was devastated :(  And here's OP dismissing my dream job, fork her! :/\n\nAlso, I'm a huuuuge acronym nerd :D Like, I have whole Excel files devoted to acronym lists and glossaries.\n\n> OP doesn’t have any reference points for the world outside domestic life.\n\nThis right there. It's something that, IMHO, is the norm in the US and it's sadly prevalent across all levels of society. The feeling that the USA is the greatest and there's no need to learn about other cultures, languages, etc. And also, your point about domestic life: if someone wants to marry and have kids and be a stay-at-home parent and be happy with that, I totally support it (even though it's not at all what I want for myself) if that is what truly makes that person happy. But to bitch about it and dismiss another person's dream because it doesn't align with yours? Yup, that's called Jealousy with a capital J. And it screams \"I'm not at all happy with *the best husband in the world*\".",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Right?!?\n\nOP, YTA and tell your friend to ditch you and I’ll be her new bestie because I would love to hear what her new job entails and be her cheerleader because I’m well aware of how competitive those jobs are!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I'd be so completely stoked for one of my friends if they'd gotten to a high enough level of translating to be able to do a job like that!! This job is a HUGE deal!! And this is the type of field that you go into wanting to live and travel abroad. \nI have a friend from university who has worked incredibly hard over the last two decades to become a journalist with an expertise in Chinese politics. She's was finally able this year to get a job in Taiwan which is fucking awesome and all of us are so excited for her! This is literally her dream job!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1243,
                  "content": "Wait, I'm sorry, but is OP really comparing getting married and having kids to the accomplishments of getting multiple degrees and getting an international job that the person has always wanted? Look, I love my husband and I'm proud of our marriage and family, but I realize that it is far easier to get married and have kids than to complete many years of higher education.\n\nHow sad that OP has to put down a good friend because she's jealous she's only a housewife and parent. Again, no disrespect to those who are sahps, my mom was, but you probably shouldn't use that status to shame an accomplished student and now business person. YTA OP",
                  "id": 16,
                  "comments": [
                    {
                      "score": 286,
                      "content": "As much as I wish I was able to say I'm married with kids, it's basically just finding someone willing to be with you (not necessarily a decent person) and having kids is literally just the result of unprotected sex...\n\nWait what are we saying? OP has totally achieved as much as the friend lmao 🤣 😂 😆",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "I was a stay at home mom AND I have a Master’s degree. There are many paths in life, and OP might want to be less judgmental if she wants to have any friends at all.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 460,
                  "content": "I love the main character line. Gonna try to remember that haha!\n\n\nOP somehow thinks having a family is the only way to go. While Diana has a passion for language, history, and probably politics - and travel.\n\n\nAlso, I don't know why people think that an education is wasteful if they don't make the huge bucks. Some people simply like to learn things for the sake of learning.\n\n\nOP, YTA. And some education wouldn't hurt you at all.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 31,
                      "content": "What she fails to see is that after a masters, even if you start out low pay, the pay increases come faster than no masters. I stayed home with my kids and my husband worked. When my kids went to high school, I earned three degrees. My pay started out low but after only working 10 years, I make what my husband makes and he has worked for 30 years.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I realized a few months ago that my bucket list is all things I want to learn, not places to see, or activities to do. I very much love learning things for the sake of learning.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 225,
                  "content": "Yeah but if you’re not a mother you wouldn’t understand \n\nLol OP is so deluded, I almost hope it’s satire.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Right?!  If it's not satire, I can't even fathom wanting to be around the OP, much less *being * the OP",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 37,
                  "content": "BUT... she managed to get MARRIED!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I'm in a master's program right now for microbiology and immunology. It's intense, but I definitely have time for the people I care about. You know, the ones who love me and are supportive of my goals and dreams in life. I would definitely avoid any calls with someone as judgmental, critical, and condescending as OP is though.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "After reading what OP wrote I think her friend was trying to avoid her.  \n\n\nThis was a last ditch effort, and the friend was not proved wrong.  She's off to Brussels.  That sounds amazing to me.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Also sounds like OP is a housewife (nothing wrong with that) and jealous that her friend is educated and going to explore new worlds.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I certainly wouldn't wanna spend more then 5 minutes on the phone with OP her attitude sounds toxic.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "Especially when OP can’t even be bothered to follow the plot. They’re criticizing decisions that they fully admit they don’t understand.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": ">it's a serious wonder why Diana didn't have time for long phone calls with OP while she was in her masters program.\n\nNo kidding.\n\nOP: Hi, Diana\n\nDiana: Hi, OP. How's it going? I just got an amazing job doing what I love doing and will be travelling to see different parts of the world!\n\nOP: Isn't that the job that pays next to nothing? You're wasting your time and money and could have done something else, instead of getting a degree that's useless because you're not staying in the country to work.\n\nDiana: I need to go. Bye.\n\nOP is YTA. Friends would be supportive if they see someone doing what they love doing.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I also hate how she said in the time she went to school. I built a family..... so what? Building family is literally what everyone does. It may be special to you... but it's not special. FFS you found another person to sleep with you, then didn't use birth control, then didn't split up.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3750,
          "content": "Funniest thing is she’s bragging about how her husband makes more money but never said what she contributes…if OPs husband leaves her she’ll have nothing and have done nothing for her own betterment. Meanwhile the friend gets to live abroad and gets valuable work experience that she could eventually use to move back home if she feels like it. OP is totally an AH for belittling her friend despite having no real accomplishments of her own",
          "id": 32,
          "comments": [
            {
              "score": 1131,
              "content": "but she had kids! LOL 😹",
              "id": 33,
              "comments": [
                {
                  "score": 1122,
                  "content": "Imagine acting like getting married and pregnant is an \"accomplishment\" akin to getting an advanced degree. They're just . . . totally different things? One is about your personal life and the other is your professional life. It's apples and oranges.\n\nOP bagged a somewhat \"successful\" husband and thinks that counts as \"success\". 😅",
                  "id": 34,
                  "comments": [
                    {
                      "score": 557,
                      "content": "> During the time she spent on her degrees, I managed to get married and start my own family. \n\nSuch a hard thing to do.  Only been happening since the dawn of man.\n\nIt's sad this lady's self worth is so low.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "I have 2 kids and wouldn't consider having kids an accomplishment. The accomplishment in that arrives when they reach adulthood and you've raised them to be well-adjusted and empathetic with secure attachments and relatively little childhood trauma. THAT is an accomplishment.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Her successful husband is making the same as a new grad, how successful are they?",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "I mean if he didn’t do college/an advanced degree I’m willing to bet he’s been at his job for a while. And he’s making what an entry level interpreter does. \n\nSo basically he’s not “successful”, he’s average (not a bad thing, but also not particularly brag worthy). OP just had to throw that in because she knows that she doesn’t have any legitimate accomplishments of her own so she has to live through him. \n\nThe sad part is that when her children are grown and gone and it’s just her and him she’s probably going to have absolutely no sense of her own identity and it’s going to lead to marriage or mental health problems.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "\"Managed to have kids\" \n\n🤣",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 703,
              "content": "[removed]",
              "id": 40,
              "comments": [
                {
                  "score": 208,
                  "content": "I mean, some people are very happy and fulfilled doing that. But OP is NOT.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 460,
              "content": "Exactly this. OP is dependent on her husband but has BIG OPINIONS about other people's life achievements. She needs to check herself before she loses all her friends.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2563,
          "content": "OP's so uneducated she doesn't even understand what an interpreter does, but thank god she \"managed to get married\"...",
          "id": 43,
          "comments": [
            {
              "score": 1302,
              "content": "People who say managing to get married is their biggest success don’t realize that’s not the flex they think it is.",
              "id": 44,
              "comments": [
                {
                  "score": 405,
                  "content": "Exactly. I don’t understand how people consider marriage an “accomplishment”. Sure, most people want a partner in life, but accomplishment isn’t the category I’d put that under.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 197,
                      "content": "An accomplishment would be actually finding and maintaining a lifelong healthy and fulfilling relationship, I suppose.  Getting married is sort of like a public declaration that you think you have that, but it doesn't mean you actually do.  Since she is complaining about her husband all the time it doesn't sound like she has that.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Hey now, OP had to work really hard to find a guy who could put up with her. That's why its such an achievement for her!",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 606,
          "content": "OP sounds like someone who’s always complaining about something and needs to bring people down to her level of misery. She can’t let others be happy. She says she has “the best husband” but has also complained about him to this friend",
          "id": 48,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 96,
          "content": "I would move to another continente to be away from her if she was my friend",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Jumping on this to add that if the OP wasn’t such a close minded A about this, then the nicest way to explain this is for her to open her mind to know that not everyone wants the same things in life. I prioritized my career because I wanted something for myself and not have to rely on anyone. I then got married later in life, had kids later in life, and while I may be “older,” I couldn’t have had it any other way. OP’s friend is the same with being excited about her career.  If she doesn’t want to have her own family that is entirely up to HER and guess what she like anyone else can be happy with whatever path she had the power and freedom to CHOOSE.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 28465,
      "content": "YTA! You’re so clearly bitter and jealous of your friend’s success and it’s gross. She’s proud of her accomplishments and excited about this great opportunity (as she should be!) and you took every opportunity to tear her down. \n\nGetting married and starting a family isn’t everyone’s end game and if it is hers, she has plenty of time to do that AND flourish in her career - she’s 26.\n\nYou’re a mean person and a bad friend. Do better.",
      "id": 51,
      "comments": [
        {
          "score": 10123,
          "content": "And she's not moving because she can't find work at home, she's moving because she is talented enough to get a job at the effing EU Parliament.\n\n\nThat's really impressive. OP seemingly having no idea what the EU Parliament is is not so much.",
          "id": 52,
          "comments": [
            {
              "score": 6661,
              "content": "Slow down using abbreviations like EU and OP. You’ll lose her",
              "id": 53,
              "comments": [
                {
                  "score": 1531,
                  "content": "Bet you she knows OMG",
                  "id": 54,
                  "comments": [
                    {
                      "score": 863,
                      "content": "She definitely knows FML",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 299,
              "content": "She can't be bothered learning what the EU Parliament is. All those acronyms will only confuse her while she is trying to learn her Lemans breathing.\n\n(Ps before anyone \"corrects\" me, yes I know, it is sarcasm)",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "This reminds me of the woman who referred to her nieces job at NASA as some “some entry level government job” or something.",
              "id": 57,
              "comments": [
                {
                  "score": 98,
                  "content": "Oh yeah, I remember her thinking her niece was less successful in life because she wasn't married yet, lol. \n\nLike who can't get a job at NASA, amirite? But getting married, now that's something really special for the selected few.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Guess she never understood \"is not rocket science\" and probably thinks \"is not house care\" would convey the level of complexity better.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "This was my first thought - I'm studying to be an interpreter and THIS IS THE FUCKING DREAM!!! It's one of the most prestigious jobs to have and it's not easy to get in!",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Maybe the fact that she couldn't work at home is exactly the reason why she chose this field. OP for some of us living and seeing the world>>>>>>>>>>x 1000 getting married and having kids early",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "OP's post reminds me of another post here a month ago, where the mom played down her adopted daughter's HUGE INTERNSHIP to NASA so she could garner NAH votes for not attending the inception ceremony.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Right!! I did a traineeship for the European Commission, and let me just say - getting a full-time job in an EU institution is extremely impressive. There’s _so many_ extremely competitive tests and interview stages to prove you’re good enough, and even then - you’re essentially competing against some 450 million EU citizens compared to only your country’s population if you got a local job. Plus, for some people (like Diana and myself) we aren’t moving abroad because we _have to_ but because we _want to_ experience a new culture, or challenge ourselves, or advance our careers in ways that wouldn’t be possible at home, or work in a multicultural field… (disclaimer: not to say that wouldn’t be possible by staying in your home country or that one is better than the other, just that for some people the dream is to move abroad)",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1768,
          "content": "She’s only 26?! I missed that. Don’t worry OP. If she chooses I’m sure she’ll “manage” to start a family.",
          "id": 64,
          "comments": [
            {
              "score": 472,
              "content": "Im 28..had to move across the world to use my degree. Also not worried about starting a family. I mean, if I dont manage to get one, atleast I made something of myself? \n\nOP is just jealous and wants the focus about making a family because her friend is single. I would be rich af rn if I get a dollar for everytime someone did the exact damn thing to me.",
              "id": 65,
              "comments": [
                {
                  "score": 24,
                  "content": "Ew, you had to travel the world, experience a new culture, and lead a fulfilling life doing something you’re great at?\n\nWhat a waste. /s",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 334,
              "content": "And she'll do so with the European Union staff benefits & European parental leaves\n\nhttps://epso.europa.eu/en/eu-careers/benefits#tab-Family%20life",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 274,
              "content": "I read that sentence like 10 times. It was obviously written with such contempt and judgment. \n\nLike OP, you know what your friend could say if she were as nasty as you? \"In the time my friend spent having kids, I managed to get a bachelor's degree, a masters degree, and an awesome international job with the EU.\"",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "With free healthcare!",
              "id": 69,
              "comments": [
                {
                  "score": 31,
                  "content": "Also working for the parliament is NICE in terms of wages. You miss out on some advantages other people get but you barely pay taxes so your net income is very high.\n\nAnd if OP and her friend are from the US, you can't really directly compare the salaries. Brussels is one of the more expensive cities in Belgium but cost of living is still reasonable. Our wages are lower because we pay more taxes but the benefits in terms of healthcare really make up for that. On a parliament wage she can have a pretty nice life in Brussels and still save lots of money.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 24,
                      "content": ">And if OP and her friend are from the US, you can't really directly compare the salaries.\n\nThis! I mean, if her starting salary is the same as OP's hubby, who doesn't have a tertiary diploma / degree - And I certainly don't want to look down on person who don't have that (everyone needs to decide that for themselves) -  that degree will make sure that her salary will increase with every opportunity that comes along the way during her career. Working for the EU parlement for just 2years will open doors!\n\nAnd yes the wage taxes are pretty high here in Belgium (especially compared to the USA), but we have a very decent healthcare system, not perfect but one that makes me very grateful to be born here (as a person with a handicap) instead of many other countries (including the US)",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1110,
          "content": "Sounds like OP thinks the only reason for women to go to college is to get an MRS degree.",
          "id": 72,
          "comments": [
            {
              "score": 533,
              "content": "OP sounds like she thinks the only reason women exist is to pop out kids…",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 271,
              "content": "Spot on. And I hate to sound petty, but if the OP had gone to college, she'd have been forced to write in sentences and paragraphs. That was a tough read. I kept wishing *I* had a translator.",
              "id": 74,
              "comments": [
                {
                  "score": 96,
                  "content": "Hey now. She used “whom” (incorrectly). She’s clearly very smrt.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Slow down with the abbreviations. You might confuse OP",
              "id": 76,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 635,
          "content": "Also, getting married and having children is so common.  It doesn't take a special degree or special person to marry someone and have a bunch of babies.   OP has achieved nothing.",
          "id": 77,
          "comments": [
            {
              "score": 118,
              "content": "You don’t get to brag about being married and having kids…well, ever, but if you were going to, you kind of have to wait til you’re like 24 years in to a happy union and your kids have successfully launched *and* actually like you.\n\nThese are early days for OP. Things can still go so far off the rails. There’s nothing brag worthy yet.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "As a mom with a masters degree, can confirm. I used nothing of my education to pop out these kids.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Hey, OP worked hard to barely manage getting her MRS degree.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 290,
          "content": "Getting married and starting a family is also not an accomplishment imo.",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 220,
          "content": "I left Long Island and moved to nyc for college and never came back and people still give me shit like “how’s big city life.” Meanwhile it’s like an hour and a half commute lol",
          "id": 82,
          "comments": [
            {
              "score": 29,
              "content": "Isn’t Long Island almost considered the fifth borough especially if you live closer. Why are they acting like they live in a flyover state?",
              "id": 83,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "“You’re a mean person and a bad friend” is such a succinct description of this person.\n\nOP not everyone wants your lifestyle of having kids so young. In fact a lot of women specifically work to *avoid* your lifestyle. You sound trashy.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": ">she has plenty of time to do that AND flourish in her career - she’s 26.\n\nIf she is staff at an EU institution: in addition to expat allowance, she would get housing allowance, free private healthcare, private school fees paid, etc. Also, 32 days paid holiday plus maternity leave.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I moved to Europe and married a European. Best decision of my life. It’s not without its difficulties with my family living back the States and me being so far away. But this is an incredible experience I wouldn’t change for anything. \n\nI’m married, have a job, live abroad and could have kids if I wanted to. Same thing is in the cards for Diane if that’s what she wants. Clearly OP seems to think you can only have a job or a family in the States. \n\nPeople like OP can’t see beyond their own nose. \n\nYTA",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "I'm always perplexed by what a great \"achievement\" people think it is to have sex and sign some papers saying you're legally bound.",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19998,
      "content": ">During the time she spent on her degrees, I managed to get married and start my own family. \n\nAh, another \"I became a parent and judge my non parent friends to make myself feel better\" post. YTA",
      "id": 88,
      "comments": [
        {
          "score": 7692,
          "content": "It’s the “I managed to…” which kills me. People do this every day. It’s not that hard.",
          "id": 89,
          "comments": [
            {
              "score": 7288,
              "content": "I might catch some hate for this, but I never understood why people think getting pregnant and having a baby is an accomplishment. Literally every species reproduces. It isn't some special talent or skill. I'm sure it's not easy to pop a baby out, but making one doesn't take a whole lot of skill or talent or intelligence.\n\nEdit: YTA, OP.",
              "id": 90,
              "comments": [
                {
                  "score": 2988,
                  "content": "Getting knocked up is usually something people work to avoid and she couldn't even do that right...",
                  "id": 91,
                  "comments": [
                    {
                      "score": 635,
                      "content": "I literally spat my water, that was so savage lmao",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 164,
                      "content": "No seriously, I’ve been saying this for ages. I am currently 15 weeks pregnant and even though I did decide to keep it in the end and am glad now, it’s still super weird for me when people congratulate me for something I not only didn’t have to work for but was actively trying to avoid.",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "I love my family and I'm extremely proud to be a father, but yeah the oldest wasn't exactly grade A family planning.",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1205,
                  "content": "It took me 2.5 years of secondary infertility to have my kid, so I do consider getting pregnant an accomplishment. Does it make me better than anyone else? No!\nDoes it make me better than someone who is seemingly brilliant and driven enough to land a job with the EU Parliament in their 20s? God, no! It makes me feel quite mediocre, actually! Lol",
                  "id": 95,
                  "comments": [
                    {
                      "score": 480,
                      "content": "I recognize your struggle and offer my happiness for you, that is no easy journey and quite an accomplishment indeed!",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 592,
              "content": "From the sounds of it, it was probably hard for the OP since she has such a terrible attitude.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 577,
              "content": "1. LOVE your username lmao \n2. This gave me an Elle Woods, “What, like it’s hard vibe” in the worst way — OP has to know you can accidentally get pregnant. You can’t accidentally get a masters and then get a job w/ the European (continental!) parliament.",
              "id": 98,
              "comments": [
                {
                  "score": 41,
                  "content": "Thank you! And yeah the naivety is astounding. OP seems incredibly sheltered.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Is it naivety or just wilfull ignorance? To barely understand what the EU Parliament is at age 26 is honestly so embarrassing. Middle school kids know what that is! Also, she doesn't even think it's her problem that she had no idea what her friend was talking about; she was blaming her friends for using abbreviations lol.",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "If you can easily do something by accident, it's not an achievement, and I say this as a parent. Managing to be an amazing parent and raise children into happy and fulfilled adults, THAT is an achievement. Just making them is the easy part, assuming OP didn't have some nasty fertility struggles they had to get through.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 531,
          "content": ">During the time she spent on her degrees, I managed to get married and start my own family. \n\nDiana be like: \"During the time OP spent on marriage and children, I managed to complete a prestigious degree and get a job offer with the European Union.\"",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 280,
          "content": "Seriously not that hard to get married or start a family. But an MA is hard work! OP, YTA and your friend has outgrown you. Brussels is an amazing city and I hope she loves it!",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Plus like... they're not mutually exclusive. \n\nI'm married with three kids and I also have a masters degree. Granted... I'm 39, but it's totally normal to do both. Also acting like getting a good paying job without a degree is simple and easy is ridiculous.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10018,
      "content": "YTA.  Moving to another country is an exciting opportunity.  Why are you raining on her parade?  Neither of your life choices are bad ones.  She clapped back at you because you were such an ass to her.  You are not a very good friend.  You don’t need to understand or even like her life choices in order for them to be valid.",
      "id": 105,
      "comments": [
        {
          "score": 1374,
          "content": "Yeah, maybe she doesn't give a rat's ass about having a husband and familly but she didn't shit on her for that reason. SHE was a friend. OP seems incredibly self-centered, jealous and ignorant.",
          "id": 106,
          "comments": [
            {
              "score": 160,
              "content": "And even if she was interested in that there's no saying she might not fall in love with someone in Brussels and start a family there",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "It’s an amazing opportunity, and I would assume if she got her masters in translation then she has a strong interest in travel and other cultures. 100% YTA.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "OP is probably a brexiteer, and thinks moving to Brussels is a terrible affront.",
          "id": 109,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "I would have loved such an opportunity when I was OP's friend's age.  YTA, you were very rude OP.",
          "id": 110,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "And not just any other country, but to Brussels to work for the EU Parliament\n\nThis seems like a dream opportunity for someone like her, which is probably why OP is jealous and bitter",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "This.  I don’t want to crap on OP’s life if this is what she wants to do with it - although I so relate to the friend’s comment about married people constantly complaining about their spouse and kids, yet somehow acting superior.  But OP’s life choices are far from the only options.  And OP is flat wrong about the degree.  What she isn’t grasping is that in some fields you know you will move where the opportunities are.  A good translator can likely work anywhere, but that doesn’t mean the “local job” is a good career move.  OP’s friend has an amazing opportunity that she has worked hard for, and OP was absolutely TA to impose her own values in judging it.\n\nOP, this friendship is over - it happens, people to grow apart and take different directions in life.  But you slammed the door on it by feign unwilling to even try to understand your friend’s goals and stating her education - which is allowing her a highly coveted opportunity she wants - is “useless.”",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7762,
      "content": "YTA calling it \"useless\" is the most ridiculous thing ive ever heard. To work in Brussels as a translator is quite an adventure, and if you choose to get a masters degree in translation, you damn well do it to travel the world. Also, you cant even compare anything youve done to her, youre using your husband as a point to why her job sucks????",
      "id": 113,
      "comments": [
        {
          "score": 3502,
          "content": "Was looking for this comment. Being a translator for the EU Parliament is an extremely ambitious dreamjob for people in that field. Those people are essentially linguestic rockstars, translating highly complicated political information real time",
          "id": 114,
          "comments": [
            {
              "score": 2196,
              "content": "[deleted]",
              "id": 115,
              "comments": [
                {
                  "score": 528,
                  "content": "“Just admit you don't understand the first thing about her life and save the rest to share with the amazing husband you gripe about to your friends.”\n\nLet’s be real. I highly doubt her husband has listened to anything she has ever said…There is no way he could actually pay attention to her mean spirited rants and not run for the door. That’s probably what she complain about to her friends…”It’s like I’m talking to a brick wall.”",
                  "id": 116,
                  "comments": [
                    {
                      "score": 208,
                      "content": "Given OP's evident lack of insight, curiosity, or self-reflection, a brick wall might actually be a remarkably simpatico companion for her.",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 451,
              "content": "Yep was looking for this comment as well. Working in Brussels in these sorts of careers are highly coveted positions and a golden ticket on your resume for years to come. She should be excited - the amount of interesting people and topics she will get to work on and the adventures she will have as a result. I would take that over being a parent in my hometown any day.",
              "id": 118,
              "comments": [
                {
                  "score": 31,
                  "content": "OP is just insanely jealous and trying to convince herself otherwise",
                  "id": 119,
                  "comments": [
                    {
                      "score": 27,
                      "content": "She _should_ be insanely jealous — I certainly am, in a happy-for-a-stranger sort of way — but I honestly can’t tell if she’s smart enough to realize she should be?",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "I saw Brussels and started skimming for something about EU Parliament or NATO. HOLY COW - either one would be a tremendous opportunity and quite hard to get. She must be an exceedingly good linguist. \n\nI don’t know if I would say that OP is jealous, not enough info I think - but at the very least clueless about the world outside her own bubble.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 345,
              "content": "I'm bilingual and I don't even want to translate a normal conversation real time.  Even translating a document sometimes means searching the dictionary. \n\nI don't even want to imagine doing it with political terms. Those guys are amazing.\n\nBut OP apparently does not know EU Parliament is in Brussels.\n\n'Nuff said.",
              "id": 122,
              "comments": [
                {
                  "score": 47,
                  "content": "> apparently the job is related to EU parliament or whatever\n\nFucking lol op is high on her own farts, YTA.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "A friend of mine tried for a job as translator in Brussels. She speaks three Eastern Europe languages as well as French and English. She didn't get it and said going through the hiring process is gruelling.",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Also, if OP and the friend are from the US, the new salary of the friend could be really misleading. US people here ob reddit always seem to say that around 40k a year is not that high of a salary, but at least in Germany, 40k a year, especially as a starting salary is quite good, actually! It always depends were you live, big cities are also expensive here and electricity and heating is costing us a lot lately, but i make about 30k and am currently living a comfortable middle class life right now.... if anyone has a 6 digits yearly salary here, i don't think that's middle class anymore, but people on reddit who have such jobs seem to just live comfortably, not luxuriously, at least that's i'm always reading.... \n\nSo long story short, comparing salaries of two different continents is stupid and if that's the case here, OP is even more TA than she us anyway.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4765,
      "content": "She is moving to Brussels. That’s in Belgium. Moving to Belgium for many people is NOT a negative thing or a waste of a degree. It is seen as a very good thing.\n\nEspecially since she’s working for the EU directly. Sure you can make the same amount as a bricklayer - but she’s going to be fulfilled while you remain jealous and without the best French fries in the world at your finger tips\n\nSo yeah, YTA",
      "id": 126,
      "comments": [
        {
          "score": 908,
          "content": "The French fries alone pay for the degree",
          "id": 127,
          "comments": [
            {
              "score": 392,
              "content": "If you come here and call them french fries you're dead by midnight, just a heads up",
              "id": 128,
              "comments": [
                {
                  "score": 86,
                  "content": "I always wondered why USAians call them French fries when everybody knows they're Belgian. \n\nOMFG now I have a craving for \"moules et frites,\" LOL",
                  "id": 129,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I’ve heard three different reasons, first being they were introduced to American soldiers during WW2 by French speaking Belgian soldiers who the Americans thought were French. Two, the French part comes from the Irish word “to cut” and is just coincidentally similar to the country France. Three, Thomas Jefferson had potatoes cooked “the French way” to make fries, I think this refers to deep frying though I’m not 100% sure",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I am French and I second this haha. I come from the Belgian border, belgian food and beers are basically a part of our northern-French culture. And we all know the best fries are Belgian, that's why we use the same cooking technique.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 499,
          "content": "OP be like, I've had a Belgian waffle before so that's basically the same",
          "id": 132,
          "comments": [
            {
              "score": 145,
              "content": "Omg the chocolate waffles in Antwerp train station in Belgium were so good I ended up eating the entire thing walking to my hostel and then just turning around to do it all again.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "OP: It's so pathetic my friend is all, \"I'm fancy and I need to go to Belgium,\" when our town has a Waffle House. Not to mention an INTERNATIONAL House of Pancakes.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 225,
          "content": "My Belgian soul being happy about internet strangers hyping up our little shithole ❤️",
          "id": 135,
          "comments": [
            {
              "score": 29,
              "content": "Same here haha",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I've visited Brussels twice, it's one of my favorite destinations. I will keep coming back until I have tried every beer that Le Roy d' Espagne has to offer and have shopped in every single chocolaterie ❤️ Not to mention that Belgian fries alone are worth getting on a plane for!",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "[deleted]",
          "id": 138,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3383,
      "content": "YTA - you sound insufferable and judgy af.",
      "id": 139,
      "comments": [
        {
          "score": 464,
          "content": "Insufferable. \n\nThat's the word I was looking for.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 290,
          "content": "Right? And OP is not very bright either, if she got lost after EU. \n\nYTA btw. That sounds like an amazing job opportunity.",
          "id": 141,
          "comments": [
            {
              "score": 61,
              "content": "I think I needed a translator after suffering through OP's mess of autocorrects and weird malapropisms.",
              "id": 142,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2947,
      "content": "YTA and you are really naive to the world.    She studied languages and translation.   She knew when studying this that many of the good jobs would be international.  She wanted this and she worked hard for it.  She doesn’t want to stay at home and work a non-college degree job.   You “managed to get married and have a family”.   Being a Mom is hard work, but getting married and deciding to having kids is not difficult.   She put in her time.   Where you are naive is that you think comparing the pay of a non-college graduate with six years of work vs day one for a Masters degree.    She will get raises and she will make more money.   It is not a guarantee, but statistically she is likely in her lifetime to make 5 to 10 times what your husband makes in his life.   I am not saying everyone has to go to College.  There are great trade jobs and some people are great entrepreneurs.   I am saying that she has put much more work and effort into her career choices.  It is terrible of you to degrade all of her hard effort.",
      "id": 143,
      "comments": [
        {
          "score": 976,
          "content": "I think OP is jealous. Specially with her quip of I managed to start a family while she was getting her degrees. Like one thing has anything to do with the other.",
          "id": 144,
          "comments": [
            {
              "score": 480,
              "content": "Crab bucket mentality could be also a part of it too. Leaving the country, the fact that's she'll be working at high level EU government, that she can afford to do things not having children. This post reeks of jealousy, and the kind you especially see in lower opportunity areas. Good on that girl for doing what she wants to do in her life.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Surely better to move abroad and meet people less xenophobic. She's gonna have opportunities that you will never see with that attitude. Yta.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1988,
      "content": "Girl, you can barely write in your only language while her language degree is giving her the opportunity to go abroad and get paid for it.\n\nThis is one of the most \"buh buh 'Murica!\" posts I have ever heard.\n\nYTA.\n\nETA: I assumed the spelling of \"criticize\" was due to autocorrect because it featured in the same paragraph as a ton of autocorrect errors. I acknowledge OP is probably from a country where the British spelling is used. My comment still stands - OP sounds like they've never ventured 100km out of their backyard and believes their English-speaking country is better than any other country where you have to \"degrade\" yourself by speaking their language.\n\nYes, most people I have met with this attitude are American. And while I have met some other monolingual anglophones with the same or similar mindset, my brain, due to my own biases and generalizations, went \"Murica\". It was meant to reflect the nationalistic, podunk mentality of the post, not be a reflection of every person, American or otherwise. I'm sorry if that offended some people. It wasn't my intention.",
      "id": 147,
      "comments": [
        {
          "score": 507,
          "content": "If English is this persons first language I need them to go spend six more years in school! I’m embarrassed for her.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 230,
          "content": "I'm not sure she's American since she spelled it 'criticise' instead of 'criticize'.",
          "id": 149,
          "comments": [
            {
              "score": 383,
              "content": "I can't imagine she's British - going to Belgium for work isn't considered travelling \"far\".\n\nMaybe South Africa, Australia, or New Zealand? Can't say I know what small town mentalities are like in any of those countries.\n\nBut this post *screams* small town American who has never left their county, much less their state or the country.\n\nETA: Okay, I get it! Some Brits are such nationalistic assholes that the thought of working a few hours away still offends them if it's in another country! lol Thanks for correcting me everyone, I love learning about the icky small minded people everywhere!",
              "id": 150,
              "comments": [
                {
                  "score": 126,
                  "content": "I have no idea where she's from, but I do know we don't spell it 'criticise' in the US. But she sounds so bitter that her (ex) friend is doing anything other than getting married and having kids. Everyone knows it's so much more difficult to \"manage\" to get married and start a family than it is to get a master's degree!",
                  "id": 151,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1811,
      "content": "YTA, and I have a hard time believing you don't know it.  Where did you get the idea that \"must be able to find job without moving\" should be the number one factor people consider when deciding on a career?  You realize there are entire degrees with highly lucrative earning potential predicated on the idea that people might *like* to travel or even relocate permanently, yes?",
      "id": 152,
      "comments": [
        {
          "score": 550,
          "content": "OP is speedrunning poverty by having kids instead of an education...\n\nHer friend will likely get 10 times her revenue (EU related jobs are gold if you are from Belgium or Germany, but I suppose OP is from Eastern Europe).",
          "id": 153,
          "comments": [
            {
              "score": 284,
              "content": "Honestly I thought OP was from like Midwest USA.",
              "id": 154,
              "comments": [
                {
                  "score": 253,
                  "content": "Yeah I thought OP was giving southern US “I married an oil rigger immediately after high school” vibes.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I could see that, though as being from the Midwest I also got “Midwest peaked in high school” vibes.\n\nAm I the only one wondering how many hours hubby has to work to “earn that without a degree” or how dangerous his job is?   I men it’s really not much of a flex of poor hubby has to work 12 hours a day at backbreaking labor 7 days a week to earn that.",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": ".... are we sure she married him **AFTER** high school?",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "[deleted]",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 139,
          "content": "Yes, this. I can’t imagine that her friend took this masters in translation/interpreting with the idea that she wouldn’t be traveling. Seems like the type of career path that, in most cases would involve travel or relocating. OPs argument that relocating is a sign of failure is just asinine.\n\nETA: friends argument that relocating = failure of some sore gives off big I-never-left-my-hometown energy. Yikes.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}