{
  "post content": "I work as a purchasing administrator for a large automotive company. I work out of Kentucky, but I'm responsible for procuring parts for our plants in Tennessee and Missouri. Before finally getting an office job, I worked in our Kentucky plant for 7 years. The entirety of this time was spent on night shift. I was also attending college full time for 4 of those years until I earned my Bachelor's. It wasn't until July of last year that I finally got a dayshift office job.\n\nDuring this time I was still expected to be a husband and father. That was fine. I would mow the grass, take the trash out, and do other odds and ends around the house. I made time for my family and I made time for school.\n\nNow my wife works at the Kentucky plant. Not for the company, but as a contractor. She's outsourced labor. She expects me to clean every nook and cranny of the house while she's at work, cook for the kids, and wake up at 6 AM for my office job. All the while, she now blatantly refuses to get up and help because she's \"too tired from night shift\". Also, she blames me for not cleaning the house. She claims that I don't have a physically demanding job anymore and \"just sit on my ass all day.\" Thus, I should be able to take care of everything in the evening. Even going as far as to say she guarantees my job was never as hard as hers.\n\nI worked the same long hours all night long. I worked building cars; not doing the menial tasks that the outsourced workers do. I went to school.  I got promoted to a job that I was striving toward. I don't know if she resents me for not doing \"manly work\" now or what. She said \"It doesn't matter that you did it for seven years. You're not working nights now.\" I'm also worried of her negative reaction if I voiced these feelings. She wants to quit because of how much she hates it, but we could really use the money. AITA for pushing back on her desire to quit her job? AITA for not being empathetic toward her when she's talking about being \"too tired to do anything\"? I get it. Night shift sucks. I try to feel for her and relate to her in that regard. I don't think she wants that. She wants me to tell her to go ahead and quit, but I won't. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 185,
      "content": "ESH\n\nI absolutely think you worked hard for those 7 years, and in between going to college full-time for 4 years, that's huge. However, this is all depends on your honesty here, mowing the lawns and taking out the trash probably isn't IMO a massive chunk of taking care of the house... \n\nShe probably took on it all mostly, did she? The grocery shopping, the cooking? The laundry? Vacuuming and mopping the house every week? Cleaning all the rooms, keeping the house tidy, on top of that the main childcare? \n\nI'm not saying you did nothing, it's just I'm maybe getting the vibes she held the house down and the childcare for 90% of the time you were doing nightshift and college full-time, which would have been exhausting, but my point is she probably did so much of the taking care of things when you were doing that, she might expect that in return from you now?",
      "id": 2,
      "comments": [
        {
          "score": 54,
          "content": "I agree with the above\n\n\nThe work dynamic has now shifted\n\n\nSo others things are shifting as well as needed",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Not only that, but you have to add something like eight years of aging to them both. That absolutely affects how much energy she may now have; her body simply cannot recover as well from night shifts as his did a near decade ago. Just think how well you were able to pull all-nighters at 20 vs 28.\n\nOP also needs to not dismiss her contract work as \"menial\" (she's still probably doing physical labour, just perhaps more along the lines of moving parts around instead of assembly) and also recognise the fact that they've both simply gotten older and he does need to step up where the house and children are concerned, just like she did when he worked nights.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Sounds like she's echoing what he used to say.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 151,
      "content": ">During this time I was still expected to be a husband and father. That was fine. I would mow the grass, take the trash out, and do other odds and ends around the house.\n\nIn other words, your wife cleaned the whole house and did the cooking while you were on night shift, while you only did odds and ends?  And now that your employment shifts have been reversed, she expects the household responsibilities should also reverse but you refuse?  And so her solution is to quit her job but you also refuse? YTA.",
      "id": 6,
      "comments": [
        {
          "score": 103,
          "content": "The way he said “still expected to be a husband and father” really rubs me the wrong way…",
          "id": 7,
          "comments": [
            {
              "score": 36,
              "content": "Same. Why would it even be a question that you would be a parent and participate in your household while going to school and working?",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Yeah, like… those things don’t stop just because of work.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 46,
      "content": "\"...still expected to be a husband and father\"\n\n*Excuse you?*\n\nYTA, and a big one for your carefully chosen words.  We see right through this show you're putting on.  \n\nAnd so what that you did all that, anyway?  Two people have two different brains and two different circadian rhythms and two different behavior patterns.  Your wife isn't you.  \n\nAnd now, years later, you won't recalibrate over some basic life shit you accomplished years ago, and furthermore can't even mention without martyring yourself **for having to be a spouse and parent at the same time??**\n\nSir please grow up, and fast",
      "id": 10,
      "comments": [
        {
          "score": -1,
          "content": "Oh fuck off with this self-righteous bullshit.  She can't hack the same workload and wants to whine about it.",
          "id": 11,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 44,
      "content": "[deleted]",
      "id": 12,
      "comments": [
        {
          "score": 20,
          "content": "I agree, and this is probably the best worded post.\n\nThe only think I question is his honesty when he said he still had to be a 'Father and Husband\" and help around the house and with the child/children when he was doing nightshifts and college full-time. \n\nThere is a big difference in taking out the trash and mowing the lawn a few times during the week and holding down the household and doing a majority of the work that goes into that, a MASSIVE difference\n\nSo it's hard because only he knows what the truth is and what he did and she did in that time.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 28,
      "content": "I think if you haven't been carrying at least half of the household labor and mental load for YEARS AND YEARS its way past time you started. Congratulate your wife more on her transition back to PAID work, I'd say. Good luck! YTA",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "ESH because it sounds like she did most of the household stuff by a long way while you were doing the night shift and she expects you to return the favour. However, if she hates her job then she should apply for different jobs, not just quit. Though saying that, you don't seem to realise it's an option either. You do know there are places to work other than this one automotive company right?\n\nBoth of you need to stop your competition of who has it harder",
      "id": 15,
      "comments": [
        {
          "score": 2,
          "content": "I’m sure she has the time and energy to job hunt while working this job. /s",
          "id": 16,
          "comments": [
            {
              "score": 6,
              "content": "That's how most people do it.",
              "id": 17,
              "comments": [
                {
                  "score": -3,
                  "content": "Some.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Most. Most people can't afford to be off work for weeks/months while they look for a new job. You're either very young or very privileged not to know that",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 24,
      "content": "Your wife worked the night shift for years taking care of the kids while not being paid for it. Your turn, buddy. YTA",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "INFO where was she working while you were in school?\nETA she’s been working for 2 years and they have 3 children under 5.",
      "id": 21,
      "comments": [
        {
          "score": -19,
          "content": "She started working at a restaurant about two years ago. She worked about 30 hours a week during the day.",
          "id": 22,
          "comments": [
            {
              "score": 10,
              "content": "Then maybe she go back to that. You would be TAH if you insisted she stay at this job.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "INFO: If you work at 6am, who cares for the kids during the day? Who takes them to school, if they’re old enough, and who picks them up? When does your wife sleep, and does she get a string of uninterrupted sleep?",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "YTA. Mowing the lawn is hardly a huge chunk of housework.\n\nShe took it off your back so you could study. But now that you have the same work hours you need to split the housework 50/50.\n\nOr you need to let her quit work to focus on it.",
      "id": 25,
      "comments": [
        {
          "score": 4,
          "content": "But he also took out the trash!! /s",
          "id": 26,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}