{
  "post content": "My BF (34) of 3 years just moved in to my (32F) 3 bedroom home 5 months ago. This home has been in my family for the past 70 years. I have a 5yo son. He has a 13yo daughter. I made sure I moved all of my stuff out of my office and put it in the loft so she could have her own bedroom. I think it was about a month in to him living here that his daughter wanted to move in with us full time- as she doesnt have her own bedroom at her moms. I was completely fine with this. \n\nAnyways, I started running in to a lot of problems not even a week after she moved in full time. She became really...entitled and demanding. Like demanding that my son trade rooms with her because it has a bigger closet and pitched a huge fit when I said no. Or demanding we buy her expensive clothes or makeup because I'm a real estate agent and I \"have loads of money\". Call me crazy but I'm not about to drop $120 on a pair of ripped up jeans or drop $200 on 3 pieces of makeup. Her dad works but his income is significantly less than mine so she really just expected me to be the one who spoils her rotten. Or pushing her plate of food away and saying \"I'm not eating that but you can cook me something else.\" I can deal with her childish tantrums and slamming doors but she has now started to put holes in my walls and my BF makes excuses saying he used to do the same thing and she will grow out of it. She torments my son. If he says anything to her she literally ALWAYS responds with \"Oh you're talking to me? Swap rooms with me and I will think about responding.\" Her dad literally never attempts to correct her behavior and I'm told I'm being too harsh if I do. \n\nThe tip of the mountain for me here was 2 weeks ago there was a foul smell coming from her room so I asked her to clean it because you couldnt see the floor. She said \"Uhm no? It's my room so I dont see why you have any say on how I treat my personal space.\" Her father actually agreed with her. 3 days later the smell had become so bad that I lost it. I told her to clean it or she was moving out. This was AFTER I saw at least 6 used menstrual pads thrown throughout her room as well as half eaten food and moldy drink cups. She starts crying and saying I'm treating her like she is Cinderella and I'm acting like an evil step mom. I told my BF either he handles it or they're both gone. He clearly didnt believe me because he told me that I needed to \"lighten the fuck up\" because his daughter is \"having a rough time transitioning and being away from her mom\". I gave it a week, nothing changed. I went and got an eviction notice drawn up and gave them 30 days to vacate my property and told him hes lucky I'm not suing for damages. He says I'm an AH for throwing away 3 years because I \"cant handle not having my own way\". AITA?",
  "id": 1,
  "comments": [
    {
      "score": 21082,
      "content": "NTA- what?  She’s keeping her used pads?!?  She’s learned entitlement from her dad. He will learn when he has to provide now.",
      "id": 2,
      "comments": [
        {
          "score": 10274,
          "content": "I think she attempted to toss them in her garbage pail but that was completely full so they just ended up all over her floor instead. Its definitely disgusting either way.",
          "id": 3,
          "comments": [
            {
              "score": 5080,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 2360,
                  "content": "I've changed my pad in my room, but after you take them to the garbage can on the bathroom. Is trashy and dangerous to keep biological residues exposed like that.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 307,
                      "content": "Respectfully, why?\n\nEdit- I was actually wondering why u/Potential-Sleeper6501 said that they changed their pad in their room. That seems awkward to me, not to mention the notion of unclean hands/lack of soap and water…",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Same. And she seems like she will end up on hoarders where it’s trash and used pads everywhere. Not the good kind of hoarding. Not saying hoarding is okay but I can reason more with a hoarder that collects loads of stuffed animals or magazines. Hoarding trash is a whole other level.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -11,
                      "content": "Trashy, yes. Dangerous, no.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 421,
                  "content": "Na. I've changed them in my room before. But it's definitely more convenient in the bathroom.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 210,
                      "content": "I did that once when my husband was knocking on the bathroom door urgently which he never does unless he's about to shit himself. So yeah, just grabbed a pad and changed it in my bedroom but I wouldn't do that again without good reason.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 95,
                      "content": "I've dealt w/ menstrual stuff in non-bathroom places, it is inconvenient but it can work if you are careful and have access to at least 1 type of paper product, and ideally a little water & hand sanitizer for after. This is definitely not the situation w/ OP tho haha, this is classic Unhygienic Messy Teenager and while it is common it doesn't have to be tolerated",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 333,
                  "content": "[deleted]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 145,
                      "content": "I can't talk to you when you are like this.  omg",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 313,
                  "content": "I agree. It's trashy, lazy, unsanitary, and messy. Also, you're going to have to go to the bathroom anyways to wash your hands and toss the used pad either way. You wouldn't wipe yourself in your room, why do essentially the same thing and risk getting blood on your floor, bed?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 307,
                      "content": "Because she's probably not washing her hands",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "What if your bathroom doesnt have a bin?",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -13,
                      "content": "Not everyone bleeds like a stuck pig everytime and the whole time they're on their period and calling people trashy is trashy.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "Trashy? Her pads aren't trash. I suppose the kid considers them décor or ambiance. *gag*\n\nActually, I would guess she probably anti-thought she could trash her way into getting her own way and the room she wanted. \"If I weren't so *cramped* in here... blah blah.\" Some people don't logic. Of course she could just be a slob, too.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 93,
                      "content": "TBH the response when she complained about wanting the bigger room should have been \"you can't keep your room tidy as it is, I don't think you could handle a bigger one\".",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "Can't evict her if she's marked the place with her scent.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Yes, last we left off, she was breaking down the wall separating her from the closet in someone else's (the 5y.o.'s) promised land.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "its art!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah, she is 13. This was probably her unsophisticated plan to demonstrate her obvious need for the larger room...",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "Ive changed in my pad in my bedroom before, but then usually throw it away in the bathroom OR in my trash if im about to take my trash out. I dont leave them in my room ever.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "I had to do that as a teen because my family of 6 had a single bathroom, but yeah, it's gross.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Ick - nast comes to mind",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I’ve done it in the bedroom in a pinch, but usually that’s not removing a dirty one, it’s putting a clean one on after a shower bc I forgot to take clean underwear into the bathroom. But I also immediately throw everything g away and wash my hands.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "There are *so* many times I forget to grab a pad or tampon before I go into the bathroom (my FIL gets *disgusted* if he sees *any* trace of feminine products. Once I was bitched out because *he could see the **wrapper** in the fucking **trash**.* ) So I have to store them in my room so I forget a lot before I go downstairs.\n\nEta- but ***no*** I still throw the shit away in the bathroom,, that would be fucking gross keeping that in your room, let alone all over the fucking floor.\n\nImagine that girl getting a boyfriend and inviting them over..\n\nI honestly wonder if that's how her mother's entire house looks.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1216,
              "content": "NTA, her demeanor is downright unacceptable. She demands expensive stuff from you, damages the walls of your house, mocks your 5-year-old and is very stubborn and annoying. She trashes your former office and refuses to clean it, because apparently it's \"her room\". How naive is that?\n\nShe's totally ingrate. You gave up on your office to ensure that she has a viable bedroom and yet she wasn't pleased. She demanded the other room, which currently belongs to your son.  You cook for her and she demands something else because it's not good enough for her. She's out of touch with reality and thinks she deserves everything and will always get her way. Turnes out she was wrong, now she has moved out. \n\nShe sounds unbearable and untenable, you were very patient with her. \n\nIt's sad that you had to break up after two years, but you saved yourself a lot of future misery, fights and damages in her teen years.",
              "id": 29,
              "comments": [
                {
                  "score": 748,
                  "content": "Does anyone else picture this kid’s bio mom snickering when she moved in with OP and Dad?\n“Yessiree, your dad and his rich girlfriend will be happy to buy you everything your little heart desires!” *and your ill mannered self can trash THEIR place for a while*",
                  "id": 30,
                  "comments": [
                    {
                      "score": 131,
                      "content": "Yep. Had I been that mother I would laughed myself sick then celebrated all night long.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 78,
                      "content": "Yes. Like crystal",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "If I was the mother she wouldn't be like that. I'd have straighten her out a long time ago. I have no patience for that shit. A little is understandable bc teenagers but straight up nasty and disrespectful, no ma'am.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "In the tone of the Wicked Witch of the West in the Wizard of Oz.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 250,
                  "content": "[deleted]",
                  "id": 35,
                  "comments": [
                    {
                      "score": 739,
                      "content": "Except in this case, the 13 YO was moving into someone else's home.  The younger one doesn't need to trade rooms for that, ever.  Kids are often very attached to their routines, which would include their space.  \n\nEven beyond that, if 13 YO was having a \"hard time transitioning\" why not go back to her mom's? It was her choice in the first place, if I read that right?\n\nWhat a nightmare!  OP, you dodged a bullet here.  Can you imagine finding all this out after you married the guy or put in even more years of commitment?\n\nNTA",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 221,
                      "content": "Sure, maybe if they were all moving into the house at the same time, you might consider giving the 13 year old the bigger closet. \n\nBut that's not the case here. The 5 year old was already settled into that room long before the 13 year old came around. It's not fair to uproot him because his mom's boyfriend's daughter needs extra space for her hoodies.\n\nAnd ESPECIALLY not for this brat!",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 109,
                      "content": "Young kids have many toys that are much larger than anything a 13-year-old girl regularly uses, so unless he has a playroom, he needs the space more.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 98,
                      "content": "I agree technically but the boy was there first and it's insane to completely alter his life/routine for this selfish snobby bratty teen.\n\nThe holes in the wall make this an absolutely no-brainer NTA. Growing up my father would have murdered me if I did this. This isn't some temporary low-income apartment, it's OP's house.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "As a 14 year old I 100% agree, our house has the thinnest walls and I know a lot better than  to go punching them plus if I did I'd be paying for it, with my money and my rear end",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 47,
                      "content": "Indeed- I consider myself to have been an unusually difficult teenager, and I never put holes in walls or kept my room so dirty that it smelled. That child needs therapy and help from her parents, but it’s not up to OP to put up with that and have her own small child get treated badly in his own house.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I don't think it's abnormal for a teen to struggle with aggression or bouts of anger... The hormonal roller coaster is a powerful ride... And the girl is only 13 and under stress.\n\nI'm not saying it's okay. I'm just saying... She's immature, struggling with major life changes, and apparently not getting the guidance that she obviously needs (her father supporting her bad behavior instead of actually parenting her!)",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "This - I have two sons and they've put holes in the walls exactly zero times in their lives...",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I did it once as a teen.  Because I was carrying a broom, tripped at the end of a staircase, and put the end through the drywall.\n\nDefinitely unintentional but still not something I’d consider a normal occurrence that kids will grow out of.  Somehow I doubt this kids’ holes were accidental.\n\nAnd I apologized profusely to my parents and offered to use babysitting money to pay to fix it.  They were just glad I hadn’t broken my own bones instead of a bit of drywall!",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I'm just here to comment that I disagree that a 13yo girl needs a bigger room than a 5yo, kids that young usually have alot of toys and clothes, I can bet that majority of things in that child closet is toys! She just a brat and is used to getting things her way and that 5yo has been living there with his mother before she even came. She doesn't deserve it,anyways.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 516,
              "content": "You dodged a bullet. At least you figured out early on that he was never going to support your completely reasonable boundaries over his daughter's totally unacceptable behavior. He didn't want to act like a parent but also didn't want you to either.",
              "id": 46,
              "comments": [
                {
                  "score": 75,
                  "content": "Honestly, this. Everyone is going on about the problems that the daughter is causing, but the BF is the source (and potentially/likely her mom). OP is in no position to play Bad Cop to his Good Cop routine, and the fact that he isn't willing to sit down and have a heart-to-heart with his daughter about respect (let alone hygiene) signifies a lack of respect for OP's property, OP's boundaries, and OP herself.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 366,
              "content": "I have raised 5 kids (3 bio kids + 2 stepkids) and we never had holes in our walls, nor did we have used pads left in the bedrooms or on the floors. And I'm pretty lax about cleaning. \n\nThis is a DAD/BOYFRIEND problem, not a teen problem. Your bf should have been the one to set the tone with her, but instead, it seems like he's more interested in coddling and making excuses. She's walking all over him (and you) because he's letting her.\n\nYou made the right call. You need to protect your son at all costs from bullying. Don't plan on this relationship lasting. NTA",
              "id": 48,
              "comments": [
                {
                  "score": 216,
                  "content": "> This is a DAD/BOYFRIEND problem, not a teen problem\n\nThis is exactly what I was thinking.  OP's not throwing away 3 years because 'she wants it her way' (OP's words in her post not above comment).  She's ending this because their expectations and parenting skills are not compatible.   \n\nNTA",
                  "id": 49,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Honestly, what the ex boyfriend is doing doesn't really qualify as \"parenting skills\", but I get what you mean though.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Right I'm raising 5, 3 bio 2 step, never had a hole, and if we did that child would be learning how to do a sheet rock patch to my contractor standards.\n\nStep daughter moved in because mom won't let her act like this and dad encourages it.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 3,
                      "content": "We had a hole in our bedroom wall because our 6 year old son decided to do a jump front flip on our bed and completely botched the landing and rebounded into the wall. \n \nHe got in trouble for it, apologised and learned very clearly about what he did wrong and had to help me with some of the patch up work. I mean ffs, we literally had a trampoline 10m away outside the room and he did that.. The message was made clear and I cannot see him ever doing something like that ever again, or even worse and punching a wall because he cannot control his anger or find an outlet for it.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 183,
              "content": "So upfront I want to be clear that I absolutely believe that you are NTA\n \nBut a lot of this behaviour makes me think of ADHD mixed with receiving bad parenting. I would be extremely surprised if she didn't have *something* undiagnosed\n  \nThe overflowing garbage can is a staple in my house because of my ADHD and its a constant battle with myself. The slamming doors and putting holes in walls, while I never put a hole in the wall, my cousin with ADHD definitely did, there's a level of emotionality that others don't experience and struggle to help teach an ADHD child how to cope especially with without the diagnosis\n  \nThe behaviours towards your son, aren't identical to my experiences with my sisters, but not far off. Holding a grudge like that for an insane amount of time is definitely something I have struggled with. Hell I lost my job in 2017 due to someone making false complaints, and I was in a new position with a new probationary period after being at the company for almost 5 years and I still hold a grudge against her... I am 31 \n\nBut at the end of the day you aren't kicking her out you are kicking him out. He's not stepping up and being her parent. The way you have talked here it's clear to me that you were willing to give her a chance to grow, but couldn't do it yourself without his support. He isn't supporting you. You and your child don't deserve to be exposed to that behaviour with someone backing it up\n \nSo please don't beat yourself up or anything. You need to put you and your kid first. Your BF messed it up. Not you ❤️",
              "id": 53,
              "comments": [
                {
                  "score": 74,
                  "content": "This OP is NTA but the 13 year old isn't really either. She is a child!  This girls parents are total shitheads as she is clearly acting out and needs help and support that she isn't getting.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 35,
                      "content": "I really hope that you didn't believe that I was implying a child could be at fault in this situation at all. I tried to make it clear that am worried about her, but that ultimately her dad is to blame. If I failed to get that across that sucks tbh",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Hmm, she could need help and support AND be TA.\nPersonal responsibility is a upward slope with respect to age, but 13 isn't the bottom.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yes, my biggest problem with a lot of the responses here is that they're focusing on the girl's behavior and just giving passing acknowledgment of the bf being a terrible parent and partner.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I have ADHD and I’ve never done any of that behavior. Also, none of it is a diagnostic criteria for ADHD. Co-occurring does not indicate causation. This girl is just badly raised.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Exactly. I have it too and I don't act like this.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Executive dysfunction, like the overflowing garbage can, is absolutely diagnostic criteria for ADHD\n \n> fails to finish schoolwork, chores\n \nStrong emotional responses, is also something they work through with children and adults with ADHD. I know because it was a part of what my psychologist looked at when I was a kid\n \nSomething that you are forgetting here is that not everyone with ADHD is identical. We have different symptoms that have overlapping underlying conditions. But we aren't identical\n \nSo just because you never struggled with these things doesn't mean someone else with ADHD won't",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "I have ADHD. I currently attend an ADHD Cognitive Behavioural Therapy group with six other ADHDers. Every one of us in the group struggles with executive function, as well as with impulsive emotional reactions.\n\nAceofToons was spot on - there are likely some neurological or psychological issues contributing to the girl's behavior, and ADHD is a likely culprit (though there are others). I hope the kid gets some help and support for the things she's struggling with. Enabling is not the same as supporting, and her dad isn't doing her any favours there.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I thought similar and was going to mention ADHD/ autism as a potential partial explanation for some of the daughters behaviours.\n\nAnd whilst yes, it's important to respect a child's privacy and space, there does come a point where your duties as a home owner may need to overrule .. Going in to do maintenance and ensuring the house is clean and safe for everyone..\n\nThe daughter needs to learn some boundaries..\n\nOP is NTA..",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The ADHD behavior of being an entitled brat who demands expensive clothes and makeup, of course! Right there in the DMS-5, below trouble focusing on tasks.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I *definitely* didn't mention anything about bad parenting *at all*",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Nah. I have ADHD (diagnosed) and I am always cleaning. I usually pretty mellow (as in not a lot bothers me) and joke around a lot. I don't punch holes into wall. Now anyone can hold years long grudges, it has nothing to do with ADHD. What she is describing is definitely bad parenting and maybe other issues. People use ADHD as an excuse to commit murders sometimes. I hate when people use it as an excuse to be a-holes. Sometimes a-holes are just that....a-holes. But the OP isn't the a-hole, it's the ex and the daughter.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "I threw up in my mouth a little bit reading this.  If anything You're too nice. My phone autocorrected the y three times. I give up",
              "id": 66,
              "comments": [
                {
                  "score": 42,
                  "content": "Ah, but thanks to OP's niceness in giving up her office, the live-in BF & the daughter felt comfortable enough to be themselves: they literally and figuratively suck.",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 88,
              "content": "NTA and it's good you didn't let it drag out until she was 15 and COMPLETELY impossible or worse, waited until you married her dad. Be happy you're getting rid of his useless ass now.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Good riddance. He will also raise your son that way so glad you kicked them both out.bye bye. NTA",
              "id": 69,
              "comments": [
                {
                  "score": 9,
                  "content": "More likely he'll raise his daughter to be the golden child and her son to be the scapegoat. The lines have already been drawn.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "NTA but both the kids parents are. There’s no way she learned, or at the least got away with, this behavior from only one parent. Both of them let this happen",
              "id": 71,
              "comments": [
                {
                  "score": 3,
                  "content": "This is pure speculation (but not uncommon in these situation). Her mom might have started being less tolerant of the bs so she was ok with letting her go and the daughter thought the dad would be nicer and the fact that op had a bigger house/money was just a bonus. As I said I'm not sure but I wouldn't be surprised if this was the case.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "OP, I’m disgusting and actually generally agree that teens’ personal space should be their own to dictate.\n\nFor clutter, though. Like, laundry on the floor.\n\nFood or bodily waste are whole other issues though.\n\nI’m 30 and my room looks like a tornado went through it but I’ve never had a used pad in there…",
              "id": 73,
              "comments": [
                {
                  "score": 2,
                  "content": "Maybe, if they're her actual children. The kid isn't even her legal daughter ffs. She's a total freeloader.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I mean I do think most 13 year olds are free loaders. I have a much bigger issue with her dad though. She’s an asshole to OP, but dad is doing wrong by both OP and his daughter.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 190,
          "content": "NTA, but  the menstal pads around he room may and also the daughters attitude may be a sign of something lese deeper going on. \n\nThis is not OP's burden to handle but the fathers",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "> She’s keeping her used pads?!?\n\nThat's a sign of a serious mental illness. Sometimes it's just a lazy, gross entitled person. But much like when someone saves their poop after a bowel movement, it could be a sign of someone who desperately needs medical/mental health treatment.",
          "id": 77,
          "comments": [
            {
              "score": 131,
              "content": "Maybe it's just me but I didn't read it as collecting them to keep. OP also answered someone further up that it looked like she'd attempted to throw them in the bin but it was so full they've just ended up scattered around the room. I can only assume the daughter has just decided to kick them around the room when coming and going instead of picking them up and throwing away.",
              "id": 78,
              "comments": [
                {
                  "score": 37,
                  "content": "Yes, but now they smell. Getting rid of them would be a normal impulse.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 34,
                      "content": "OP has responded that it is in fact just a case of step daughter being lazy, gross and entitled. So, the point is moot.  \n\nHowever, in cases where it's a mental illness, those suffering don't store the poop in an airtight container. They keep in a paper bag or box and don't respond to the normal impulse to get rid of it. I am not going to do any research on it, but my guess is a box full of human waste is going to smell at least as bad as a pile of used pads.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "> it looked like she'd attempted to throw them in the bin but it was so full they've just ended up scattered around the room\n\nYes, you are right. I read that after making my post.",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "i think the girl expected a maid to pick them up since she knows op has money.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This is what I think. To me this screams entitled brat who's doing the exact opposite of what the adult wants as a fuck you. I can't help but wonder if this behaviour is why she moved in with them. Maybe mum was just as fed up as OP and hoped living with OP and her dad would knock some sense into her but given the dad's approach  it seems its backfired massively. It's bugs me that the dad is blaming OP and saying she's thrown away 3 years when in actual fact the dads thrown it all away by being a shitty lackadaisical parent.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Sounds like the bf must feel the same way about op providing for his kid. The poor son must be stressed since op is stressed about the sloppy and bratty teen. Bf doesn’t even care about the other kid’s or op’s feelings.",
          "id": 84,
          "comments": [
            {
              "score": 38,
              "content": "This. The BF doesn't even try to accommodate OP when she's the one hosting them in her house, which is just basic decency. This is maddening.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yes, and in typical disney dad form, he wants to give her 100pct responsibility (financially, providing a home, buying things, cooking special meals) with 0% authority to correct behaviors like any normal parent or reasonable adult would.  NTA.  Good riddance.  If it's like that at 13, imagine at 18 when she hasn't moved out and you can no longer force mental health help.  Dodge a bullet,  Live in peace with your son.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "I mean she is fully acting out, and is obviously desperate for a kind, firm parent.  OP sounds like she's trying, but Dad is fully enabling her (out of guilt, maybe?).  Without therapy and clear, kind, firm boundaries, she's going to spiral out of control.  No 13 year old actually wants a 13 year old in charge.    OP is right to wash her hands of this-- especially since BF is now attacking HER as well.  I feel sorry for the girl, and hope she gets some help.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Yup. OP said it right here\n\n> Her dad literally never attempts to correct her behavior and I'm told I'm being too harsh if I do.\n\nIf dad was actively trying to help and improve her behavior it would be one thing. But the problem really isn't the daughter, it's the boyfriend.",
          "id": 88,
          "comments": [
            {
              "score": 2,
              "content": "If he's going to be hands off in parenting her, he can deal with the consequences. Three guesses for guessing who enabled the attitude that led to her not wanting to live with her mother.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I'm pretty worried about this girl's mental health if she was living in a room with used pads and mold all over.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Not only are you NTA, but I love you for standing up for yourself!! I especially love the part where you had an eviction notice drawn up. 10/10",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This honestly sounds like it may be a mental illness. People don’t just keep used pads around.",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I’m sure whoever shared her room at mom’s house was relieved when she left.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6025,
      "content": "Oh HELL no. He's a shite father for letting his daughter behave that way and then getting angry at you for putting your foot down on her greedy and disgusting behavior? Yeah byeeee.\n\nLike father like daughter.\n\nYou are definitely NTA here. I don't know why you would think otherwise-- so what if she has to share a room with a sibling when she moves back in with her mom? It's not like she's homeless. I mean I feel like maybe she'd benefit from therapy and learning some empathy, but this is so beyond the pale for a parent to deal with, especially when she's allowed to get away with it.\n\nIn addition, this type of behavior is something your son should not be witness to, let alone be around someone so out of control they are putting holes in your home and making at least one room a near biohazard. I'd also be worried how your (now ex) boyfriend would treat your son.\n\nedit words are hard",
      "id": 94,
      "comments": [
        {
          "score": 2210,
          "content": "I’m guessing she moved in because she knew she would have no rules with her dad.",
          "id": 95,
          "comments": [
            {
              "score": 1151,
              "content": "In addition to having her own room and having money, yeah that's probably the case.",
              "id": 96,
              "comments": [
                {
                  "score": 78,
                  "content": "She definitely sees OP as an ATM. Just because someone earns a lot of money doesn't entitle you to spend it.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 27,
                      "content": ">Just because someone earns a lot of money doesn't entitle you to spend it.\n\nPerfectly said.\n\nA friend of mine is an extremely high earner and people are always trying to tell her how to spend her money. It doesn't really seem to bother her when they do it but I don't understand how because it really irritates the life out of me to witness. You never get to dictate how someone else spends their money, especially if what you want them to spend it on is frivolous shit for you",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 430,
              "content": "And I imagine he takes that approach as a way of dealing with co-parenting. He gets to be the likeable, carefree one, while I would guess the mother has had to be the one to push structure and discipline. It's probably his way of dealing a with a fear of losing his daughter in the aftermath of his divorce, but this is in no way an acceptable way to deal with that. It's no wonder the girl is taking advantage of the situation and trying to live with him full time.\n\nEven if you kick him out and never see him again OP, you should make very clear to him that her development into a decent adult human being is getting screwed up, and it's entirely on him, but it's not to late for him to change things up and pull it back. Yes she could probably do with therapy, but he also needs some sort of guidance from a counsellor who's experienced in post-divorce parenting.",
              "id": 99,
              "comments": [
                {
                  "score": 80,
                  "content": "I have a feeling the boyfriend is bad news here. I wonder if this guy, in an attempt to get his daughter to like him more and stay with him, actually offered this behavior to her. Like I wonder if this guy said, hey kid, the girl I am dating makes loads of money and has a big house so you can get whatever you want if you move in with us. And that is why the kid acted entitled and the dad didn’t try to stop her.\n\nEdit: typo",
                  "id": 100,
                  "comments": [
                    {
                      "score": 29,
                      "content": "That part stood out to me too, because at 13 I knew my parents made enough to pay our bills but I certainly never knew exact amounts. Unless OP's home is huge and ostentatious (which it doesn't sound like it is, or there would be a big closet in every bedroom like the daughter wants) it's kind of weird to me that she would assume OP makes tons of money. Some real estate agents do, sure, but it's highly dependent on the area you work in. So I feel like someone - most likely Dad, as you said - must have been really talking up how she could have her own bedroom and more gifts, etc to make her think there's a bottomless bank account there.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "And I reckon she also expected OP to do anything to have a good relationship with her and to win her favor.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Ding ding ding ding!",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 852,
          "content": ">Oh HELL no. He's a shite father for letting his daughter behave that way and then getting angry at you for putting your foot down on her greedy and disgusting behavior? Yeah byeeee.\n\nThis. OP - you are dodging a major bullet kicking them out. You do not need to live with he or his child causing damage to your home or treating you like a piggy bank. \n\nI have daughters a bit older than your step daughter - it would be a cold day in H#11 before I let them treat our home, let alone someone else's home that way. Putting holes in walls out (and I'm not talking about nailing something on a wall), having a room so messy that it stinks to high heaven and leaving used pads laying around is unacceptable. You want to let laundry pile up until you are ready to do it yourself? Fine. But that's it. As for buying her jeans and makeup - she can either earn the money by doing household chores or she can find a neighborhood job like babysitting or pet walking to earn spending money. But you do not owe a child $200 makeup. And, you are NOT throwing the relationship away over her behavior. You are throwing the relationship away over her father's crappy parenting and for not holding her accountable for her actions. He has treated you, your home and your son with tremendous disrespect - that is why you are breaking up with him and rightly so.",
          "id": 104,
          "comments": [
            {
              "score": 84,
              "content": "WOOOHOOOO!!! This is the exact right answer and I hope u/619sh2ubso sees it!",
              "id": 105,
              "comments": [
                {
                  "score": 61,
                  "content": "except for the suggestion about having her babysit-I wouldn't trust her with my pet goldfish.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah, really. Not if she'll be so nasty to a 5yo.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Seconded! This deserves to be top comment u/619sh2ubso",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "She’s not even sharing a room with anyone, she just wants OP’s son’s room because it’s bigger.",
          "id": 109,
          "comments": [
            {
              "score": 154,
              "content": "I meant that she'll have to share a room with her sibling when she moves back in with her mom. And she was demanding OP's son change rooms, at least at first.",
              "id": 110,
              "comments": [
                {
                  "score": 48,
                  "content": "Oh I missed that she has to share at her mom’s",
                  "id": 111,
                  "comments": [
                    {
                      "score": 116,
                      "content": "And yet “she’s having a hard time being away from her mom”. She sure was willing to trade away time with her mom for her own room and trying to squeeze money out of OP.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 162,
          "content": "This. NTA, get them out, your son deserves not to be tormented in his home.",
          "id": 113,
          "comments": [
            {
              "score": 62,
              "content": "Yeah all the other stuff to me actually pales compared to the treatment of the 5-yr-old. That should take priority even over the holes in walls & menstrual pads. Was this girl raised with farm animals? What despicable behavior.",
              "id": 114,
              "comments": [
                {
                  "score": 7,
                  "content": "Farm animals deserve better than this too.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Wtf is even wrong with this dude?\n\n\"his daughter is having a rough time transitioning and being away from her mom\"?!\n\nIt was her own choice to live full time with OP and away from her mother, all for having her own room...",
          "id": 116,
          "comments": [
            {
              "score": 20,
              "content": "It's pretty unfortunate that she has a father like that. I hope the mother is different, but with the daughter's behavior I'm not so sure.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "RIGHT",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "The only one I feel bad for is the daughter, she obviously had bad parenting if this is how she acts.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2584,
      "content": "NTA! This man and his daughter both need to learn that actions have consequences. For the sake of your son and your own well-being, please follow through and make them leave your home. They have both acted entitled and taken advantage of you repeatedly. As a result, they have to go! It is not your responsibility to worry about whether she will have to share a room if she moves back in with her mom. That’s something she (and her father) should have considered before she disrespected you and your home and bullied a 5 year old.",
      "id": 120,
      "comments": [
        {
          "score": 402,
          "content": "Agreed. \n\nI couldn't believe this kid was only 13. Her behaviour is so rotten & vile for someone so young. This is actually really sad.\n\nBut, agreed. NTA OP. Your BF has clearly failed in parenting his daughter, has disrespected your home, and her behaviour is atrocious.... I mean - used sanitary items? That is disgusting. And, not to mention her mistreating your son. \n\nYour BF clearly hasn't stepped in to parent or guide is kid away from the path of being an entitled, rude, spoilt person who mistreats others, so he can hit the road with his kid.....I do hope for the daughter's sake that she gets help to improve her behaviour, because it is rotten to the core, right now. And, that's not normal teenage AHery....",
          "id": 121,
          "comments": [
            {
              "score": 80,
              "content": "I was surprised the kid was as old as 13.",
              "id": 122,
              "comments": [
                {
                  "score": 9,
                  "content": "Me too, until I thought about myself as a 13-16 year-old girl. puberty + having parents who can’t say “no” because they feel guilty about their kids’ destabilized home life is a foolproof recipe for teen shitheadery.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yep, as a fourteen year old girl. Not even just girls either, boys too. I know a dude exactly like this. Extremely entitled and disrespectful to everyone (especially his mom, he punches holes in the wall all the time), which isn’t helped by the fact that he’s really popular in my area and that inflates his ego. We used to be friends at one point, but we aren’t anymore because he’s also incredibly racist and homophobic (which is good, especially since I’m also “popular” and it’s hard to avoid him). \n\nLike the other day in our Spanish 1 class, we were playing a game on our laptops where you had to join in  and he kept disconnecting. Our teacher kept trying to get him to join back in and he yelled at her like, “You know I’m not gonna play the game anyways, so why does it matter, god damn!” Like, okay, mister.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "It’s all on the father. I can’t think of a single logical reason why OP should stick around and wallow in the disrespect, bullying and destruction of a man who refuses to adequately parent his child. He had the audacity to blame OP for having standards about her life as “throwing away three years”, like she had an obligation to lower her living standards and accepting a level of demeaning behaviour just to keep him, not him change his behaviour in any way and parent his child",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1709,
      "content": "NTA\n\nThe girl has some clear issues and it's her parents' job to take care of it. Also, if your boyfriend - her father - is acting so entitled to your money, time and effort and tells you to just do more (so rude!!!), I kinda see where that girl got her behaviour from...",
      "id": 126,
      "comments": [
        {
          "score": 501,
          "content": "Yup, maybe she has undiagnosed depression or some other issue but in that case, the response is medical visits and possibly therapy, **not pretending biohazards are a non issue** and refusing to parent your child.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Yuuuup. I see a clear mental/emotional crisis happening but it's 110% not OP's problem. (EX?) Bf is a horrible parent for not addressing it and helping his daughter and OP is totally in the clear to protect her property and her child and herself from this explosion of teenage breakdown",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Exactly what I was gonna say. I really think the daughter has some undiagnosed mental health issues. But that's not OPs job to take care of, it's the girl's parents. NTA.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I mean, where do you think she got \"you make lots of money so you can afford it\" from?",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1082,
      "content": "NTA\n\nYou gave him an opportunity to parent, and he managed to turn it back on you.  He can take his entitled little beastie that he created and GTFO. Bullying and mistreating your 5yo would have been my breaking point.",
      "id": 131,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1019,
      "content": "NTA \n\nHe’s not parenting her. A parent steps in and protects both children and he’s allowing his daughter to mistreat what would have been a sibling. \n\nThat’s not remotely acceptable let alone the amount of disregard this child has for any authority figure. \n\nShe has anger problems and thinks it’s perfectly acceptable behavior to damage property when she’s upset. She’s not a toddler but she is acting like it. \n\nYou have your sons emotional health to worry about. They are not homeless they have her moms house or other family to turn to.",
      "id": 132,
      "comments": [
        {
          "score": 39,
          "content": "I wouldn’t accept this kind of behaviour from my toddler… I understand they have big emotions and something that emotion is anger. That’s fine, but breaking stuff or being mean isn’t fine.",
          "id": 133,
          "comments": [
            {
              "score": 8,
              "content": "It’s not like I said it’s acceptable but it is a behavior you expect out of a toddler who is still learning time out is a consequence.",
              "id": 134,
              "comments": [
                {
                  "score": 2,
                  "content": "Absolutely.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "So much this. My 4 year old knows the only thing she can punch when she’s angry is a pillow. No excuse for a 13yo to not know this is unacceptable.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 656,
      "content": "Your boyfriend is a terrible parent, you did the right thing.  \nNTA",
      "id": 137,
      "comments": [
        {
          "score": 335,
          "content": "NTA - he’s a terrible boyfriend too",
          "id": 138,
          "comments": [
            {
              "score": 141,
              "content": "> \"cant handle not having my own way\"\n\nTrue, he should be saying that to his daughter not his GF. It's not too much that his partner asks that his daughter not damage her house, bully her child and clean up after herself. \n\nHe sided with the daughter, and so OP ended up having to ~~kick them out~~ take out the trash.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 624,
      "content": "I feel bad for her, honestly. She's 13, going through major upheavals in her life, and acting out because she's been allowed to. I was ready to say everyone sucks, but you can't create healthy boundaries or help this girl if her father won't back you up. NTA",
      "id": 140,
      "comments": [
        {
          "score": 168,
          "content": "Yeah I was also conflicted. The daughters behaviour is teenage-ish. The problem is that dad doesn't want to parent. If dad was working with step mum, I would have said, YTA, but with lack of boundaries and parenting, it's the right call",
          "id": 141,
          "comments": [
            {
              "score": 411,
              "content": ">The daughters behaviour is teenage-ish\n\nI didn't put holes in walls or bully kindergarteners when I was a teen. The daughter is just an entitled spoiled brat who doesn't see the world outside herself, and demanded things from OP like expensive clothes and makeup while refusing to do something as simple as clean her room.\n\nThat's largely due to her father enabling her.",
              "id": 142,
              "comments": [
                {
                  "score": 78,
                  "content": "That’s where the -ish comes in. Yes, it’s on the boundary between teenage behavior and something worse, but she’s just been through major life changes and so it *is* hard for her. But the extent of her behavior wouldn’t have happened if the BF could actually parent.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Bad parenting is just that bad for her development. You don't grow a spoiled brat in a vacuum.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "It's really not that uncommon, and it's not like we're getting a full picture of all family dynamics going on.\n\nParents still gotta parent, though.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">I didn't put holes in walls or bully kindergarteners when I was a teen\n\nThere's lots of normal teenage behaviors that you didn't do. Your person experience is not the definitive one.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 4,
                      "content": "No, I think your parents just failed to raise you. Punching walls and bullying little kids is not normal for teenagers.",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I didn’t do it either. None of my family or my friends or cousins. Why? Because we were patented properly. Nothing about vandalism is normal otherwise it would not be illegal to do. \n\nResorting to this level of verbal abuse towards a 5yo, hole punching walls and demanding attitudes is from a lack of something. A lack of boundaries, for one. Having a lack of something is not normal. \n\nBreaking things when you are 5 in anger is normal because you have not learned the appropriate ways to release anger or deal with issues. This girl is 13. She’s old enough to know that punching and wrecking her home is not okay but she doesn’t know because she was not taught it. Lack of parenting. \n\nIn no way shape or form is OP in the wrong here, even if she were working with her father to correct her behaviour. It’s not her job to fix his kid at her child’s expense.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Call me crazy, but putting holes in walls for any reason other than an accident is not normal teenage behavior.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": ">...spoiled brat who doesn't see the world outside herself\n\nYes, people who are 13 years old generally don't yet have the experiences that inform a perspective based around something other than their own subjectivity. As such, they tend to be a direct product of their familial - and later on, increasingly social - circumstances, over which the adolescent typically has little legitimate influence. \n\nBut what's your excuse? Are you a 13 year old girl whose parents have separated and   \n has (at least some) repressed anxiety over the fact that critical aspects of her life are predominantly out of her control? Or was it a failure to \"see the world outside\" your own (very particular) set of experiences that made you use the following as a point of comparison:\n\n>I didn't put holes in walls or bully kindergarteners when I was a teen.\n\nYour experiences aren't a universal guide to human behavior. The daughter is clearly struggling with something outside the known context given in the post, but either way, \"demanding things... while refusing to do something as simple as clean her room\" seems to fall perfectly in with acting childish or immature. This obviously doesn't make it an okay habit that should go unaddressed, but you have to be pretty damn naive to assume the type of logic that you did.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 5,
                      "content": ">Are you a 13 year old girl whose parents have separated and has (at least some) repressed anxiety over the fact that critical aspects of her life are predominantly out of her control?\n\nNo, but my parents were divorcing around that time I was a teen, and I was dealing with anxiety  to the point I had to take antidepressants. However, if I tried any of the things she did, my parents would have reprimanded me long ago while her dad enables her.\n\nThe point was her situation is not an excuse, whether it's explanation is another argument.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Being BF's 13 yr old daughter automatically makes OP a 'stepmother' and a 'wicked one', no less? How presumptuous of her to assume that.",
              "id": 152,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "If my grandmother had wheels, she'd be a bicycle!\n\nIf dad had been parenting this whole situation would be totally different. Totally irrelevant and definitely NTA",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "She knew what she was doing. Her mom probably set boundaries and enforced rules. So beside the room to herself she knew her dad was a pushover and decided to move in with him.",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "Tbh there’s also another child to consider here, as OPs 5 year old kid lives there. I don’t really see any solution other than kicking them out if the father is absolutely non-supportive",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "I work with 13year olds in a residential program they all know better then to act like this girl. The main chef went on vacation for a week and the person covering for her was terrible at his job, to the point where the kids didn’t eat dinner one night. Yet none of the kids were rude about it, no one demanded staff make them something else. They also don’t throw a fit when told to clean their room, and they are nice to almost everyone most of the time. This girl is acting like a brat,",
          "id": 156,
          "comments": [
            {
              "score": 3,
              "content": "Thank you. I'm always 100% down for supporting teenagers but this isn't that.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "THANK YOU. Now they’re trying to diagnose a slob as having encopresis! Someone else erroneously blamed ADHD. Based on the information presented, she is highly spoiled and enabled and has problems with family functioning, and that’s it. BTW, I’ve worked residential too, and thank you for your service.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "The used pads and mouldy food in her room made me think of mental patients who smear faeces on the walls. Something is very wrong here.  This may be bigger than something OP can or should deal with, especially when the girl's father is so clueless.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Are you fucking insane? Being a teenager has nothing to do with it. It doesn't give you any sort of excuse to act up. Children out there with cancer, losing parents, starving and in poverty. And most of them don't act like that. It's an individual problem. I went through the past 3 years of being a teen with no problem. Some people are just vile.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "She is guilty of providing these people a home with the best of intentions. Nothing more. \n\n&#x200B;\n\nNTA",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP also has a responsibility to her own child as well. No good parent should be expected to tolerate someone moving into their home and tormenting their child.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Nah, clear cut NTA for me\n\nShe had no excuse for how she acted and the father was an enabler. Him saying she's having a hard time without her mom is complete BS. OP did not force her to move in with her, she had a choice, OP was kind enough to give her a room. If she missed mommy so much she could've went back and lived with her.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 347,
      "content": "NTA - don’t leave them alone in the house, they both proved to be uncaring and disrespectful to what is your property, I wouldn’t put it past this shitty duo to not mess up your place anymore. Get cameras, and let em know, anymore damage than what you already know of and you’re definitely suing them.",
      "id": 164,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 282,
      "content": "NTA\n\nShe is actively damaging your property,  treating you & your son shamefully and maintaining her room as a health hazard. Her father is supporting this behavior.  \n\nYou have a right to protect yourself and your property from harm and you have an *affirmative duty* to ensure your son's safety,  physical,  emotional and environmental.",
      "id": 165,
      "comments": [
        {
          "score": 30,
          "content": "This and my NTA vote.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}