{
  "post content": "before i should tell there are some problems with my brain: concentration, writing, fine motor skills, social interactions, etc.\n\nthis resulted in a very rough childhood, particular school. My childhood was that bad, that when i had a pregnancy scare with my first GF I got a vasectomie and had me tested to be 100%. i will not pass on my gene’s, it’s running in the family and it’s getting worse with every generation.\n\ni don’t like to talk about that part of my life, but when my GF and me were talking about kids I told her, this is the first reason i definitely don’t want a kid to go true wat i went true. the second is that i personally believe that there are too much humans on the plannet and we are sucking it dry from it resources in a exponential growing rate. my GF told me she understood, from time to time the kids topic passed and i remembered here at my standpoints.\n\npassed holidays we were invited at my in laws. my GF here sis has 2 kids and the 3th is on the way, in a result the conversation is about kids, than they question me specific, i tell them that kids are not for me, but they keep insisting i so explain my second reason. still they keep insisting, (like i’m said i’m not the best in social interaction) i said strongly there will be no grandkids from me and to drop it.\n\nMy GF start crying, and my mother in law tells me (in a not so nice way) my GF is pregnant. a normal person probably had seen thins coming form a miles away, but not me. I lost it completely… , I was already uncomfortable from being put on the spot but this …\n\nI told them they could all die for my part, that i had a vasectomie, that i was clear from the start that i don’t want kids, and that she can collect her stuf and i don’t want to have anything to do with here. (the house were we live is mine).\n\nI did get tested for the 2nd time and the doctor told me there is no chance i’m the father\n\nwell 10 days later, i feel like shit. my GF is the best thing ever happen to me, all our friends think that i’m a dick, my own mother said that i reacted very poorly.. my GF probably didn’t had the guts to tell me so she asked here mom, and my reaction is proof of that…\n\nso internet i’m I an asshole for how i reacted, ?\n\ni don’t know i’m totally lost.\n\n&#x200B;\n\nedit:\n\ni assume she cheated, i didn't told her about the vasectomie. she never asked and when we started dating she was on the pill, I assumed she still is/was",
  "id": 1,
  "comments": [
    {
      "score": 381,
      "content": "--- previous vote removed ---\n\nTo clarify:\n\n- Girlfriend is pregnant\n\n- You've had a vasectomy and confirmed you can't possibly be the father\n\nIf the above is true, you are clearly not the asshole. Even if you are somehow the father, that is not the way to inform someone you're pregnant, and that family is still TA. You're allowed to not want kids and to be honest when pressed.\n\nEDITED\n\nESH -- I guess saying \"you can all die for all I care\" is over the top. I missed that part and have to amend my previous statement. You certainly owe an apology for your abusive reaction, but she also owes an apology for how she went about this. You are not the asshole for being initially suspicious, hurt, pressured, and feeling ganged up on. But you did take it too far.",
      "id": 2,
      "comments": [
        {
          "score": 108,
          "content": "there will be a paternity test, my doctor said that the chance is very close to  non-existent.\n\nso you don't think think that should have reacted more mature.",
          "id": 3,
          "comments": [
            {
              "score": 232,
              "content": "My husband is infertile on paper. We have two children who are 100% his biologically. We didn't have any interventions nor were they planned. His doctor very clearly told us that infertile is a range and not a certainty. It only takes one live sperm to get someone pregnant and most infertile men still have some live sperm.  However, the first doctor he saw did not explain this and we entered our relationship believing he could not have children (I already had kids). Get the paternity test done and then make a decision on how to move forward. \n\nHowever, not telling her from the beginning that you have had a vasectomy was wrong.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "I’ve heard of cases where someone fathered children after a vasectomy, even if the initial test showed no sperm, but it’s rare. I don’t think you’re TA, they put you on the spot in a very strange way, but why didn’t you tell her about the vasectomy? It seems like a basic part of the convo if you’re having sex with someone.",
              "id": 5,
              "comments": [
                {
                  "score": 8,
                  "content": "My doctor had me take two tests to be sure, because apparently they can be reversed by themselves?",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Well, I wasn't there. There's a lot to be communicated in tone and facial expressions but from the way you've explained it, it sounds like you were just like, \"No, I don't want kids. No, we're not having kids. No, I'm never going to give you a grandchild.\" They were rude for pressing you on it. And I get that maybe she was nervous to tell you, but then she should have asked for a support in a totally different setting and TOLD you, not have someone ASK you and keep pushing it until you're like, \"Jesus fuck, no.\" I don't understand why they would have thought that questioning you repeatedly would make your change your mind?\n\nIf you are the father, then you'll have to figure it out, and it might be. And yeah, gf feels hurt, but this is a kinda weird situation, so everybody ends up hurt in some way or another.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "So he didn't say it was impossible and you lied because?",
              "id": 8,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 69,
          "content": "Vasectomies fail sometimes. He accused her of cheating and told her & her whole family to die???",
          "id": 9,
          "comments": [
            {
              "score": 18,
              "content": "its not that i wish they all died, its in my native language something like you can all drop from the earth for my part, i don't care. \n\nnon the less i did burned the bridge with them i think.",
              "id": 10,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I may have misread the post. Because I missed the part about wanting her family to die. Nah that's over the top sorry my reading comprehension sucks",
              "id": 11,
              "comments": [
                {
                  "score": 28,
                  "content": "Then maybe change your verdict? Cus this guy is YTA 100% for telling her family to die. It’s maybe ESH if she cheated but we can’t be sure of that until the paternity test.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Changed it",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Vasectomies are notoriously unreliable.",
          "id": 14,
          "comments": [
            {
              "score": -6,
              "content": "Uh what?",
              "id": 15,
              "comments": [
                {
                  "score": 0,
                  "content": "Uh that.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 230,
      "content": "ESH.\n\nWhy in the fuck didn't you tell your gf you'd had a vasectomy, that's important relationship information. Regardless of whether or not she cheated, she has a right to make an informed decision about her relationship. Maybe if she'd known she'd have acted differently, or ended the relationship (which would've sucked short term but would've also avoided a lot of drama). \n\nYou're not blameless for this mess, own up to it. \n\nThat being said, your reasons for not wanting kids is valid and it's your right to make that decision. But communication fucking matters in a relationship. I think both you and gf are incredibly immature. 😑",
      "id": 17,
      "comments": [
        {
          "score": 77,
          "content": "> Why in the fuck didn't you tell your gf you'd had a vasectomy, that's important relationship information.\n\nRight?? Obviously the girlfriend is an asshole since she cheated. But wow, OP is an asshole too! And he has been an asshole to her for their entire relationship.\n\nIf I found out my SO let me go on birth control and suffer all of those side effects when it was unnecessary...I'd be tempted to strangle him. That is such a *horrible* thing to do to a partner!",
          "id": 18,
          "comments": [
            {
              "score": 84,
              "content": "We don’t know she cheated, infertility is a range and even a single live sperm can cause pregnancy. He literally told her whole family to die.",
              "id": 19,
              "comments": [
                {
                  "score": 5,
                  "content": "You're right, we don't know she cheated. OP should have waited until a paternity test confirmed it wasn't his before going nuclear. I think OP could reasonably assume it probably wasn't his though, so his reaction (while extreme) was partly understandable.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -53,
                  "content": "[deleted]",
                  "id": 21,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Even men with infertility levels of low sperm can get someone pregnant it’s just rare. All it takes is one, it’s just way way less likely.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 30,
                      "content": "You understand it IS only a single live sperm that causes pregnancy, right? Nothing you said or sourced disputes that.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I have to reply to your last paragraph. Different birth controls can have drastically different side effects in individuals, ranging from no side effects to drastic mood swings and very rarely blood clots. I’m sorry if you’ve had bad experiences with birth control but I think it’s rather presumptive to assume she suffered terrible side effects from her birth control, especially when OP stated she was on birth control before they were sexually actively together.",
              "id": 24,
              "comments": [
                {
                  "score": 4,
                  "content": "I don't think it matters whether or not she suffered side effects (though realistocally, she probably did). She had no choice - by not telling her about the vasectomy, she would not have felt free to go off the pill if she wanted to.\n\nOP withheld critical information and it affected her bodily autonomy. That makes OP an asshole in my eyes.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Him withholding that information is absolutely a dick move, no doubt. \n\nHowever, while side effects are common, they’re not always negative (not getting a period at all could be considered a plus, and many women have clearer skin and bigger breasts from hormonal birth control), and I think it’s quite unreasonable to assume negative reactions. After all, if she had negative side effects on one hormonal pill, she could have worked with her doctor to find one without. Assuming she didn’t is taking away some of her agency in my mind.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "[deleted]",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "If the vasectomy was confirmed successful, then yes, it may be exactly that. If nothing else, it was a conversation they absolutely should have had.\n\nOP's decision to stay silent about his vasectomy means she did not have all the information necessary to decide whether or not to take the pill. OP denied her the ability to make an informed decision about her body regarding birth control. That makes OP an asshole.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Honesty is important, but I think that can take a couple of different forms. Being straightforward and honest that you aren’t having kids, using other kinds of birth control etc is pretty similar. She had all the information to make an informed decision about the relationship: he didn’t want to have kids, and it sounds like she wanted to get pregnant unexpectedly and have him be thrilled about it suddenly? \n\nThat’s not even addressing possible infidelity. She might have acted differently, but I imagine he was fairly clear that cheating is not something he wanted. \n\nIf they’d never had a conversation about kids this might be different, and it also sounds like she was on bc from other comments but he sounds...very detached from that so immaturity is very likely.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -48,
          "content": "honestly i don't know why i didn't told here, if she should have mentioned that she wanted kids i would have told here straight away, or even asked about BC, i didn't try to hide it from her, \n\nwhen we hooked up the first time she told me she was on the pill, and that was it, probably should have told here then.",
          "id": 30,
          "comments": [
            {
              "score": 75,
              "content": "YES DUDE. It's up to BOTH partners to manage their birth control, whether or not it's the time to discuss having children. Putting it all on her is irresponsible, unfair, and selfish.",
              "id": 31,
              "comments": [
                {
                  "score": 28,
                  "content": "especially since BC can have all kinds of unpleasant side effects, and she might have appreciated having the opportunity to go off of it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -9,
                  "content": "He did manage his birth control. He got a medical procedure that assured there was almost no chance of having a baby. He did the thing that these comments ALWAYS say they should do if they’re serious about not having kids.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 127,
      "content": "Esh- In a comment you said your doctor said the odds are “close to non existent” that’s not the same as impossible. It’s possible she didn’t cheat and what you said is an asshole thing to say. If she cheated then obviously she’s an asshole. You’re also an asshole for not telling her you had a vasectomy when you knew she wanted kids. I can see how you could justify how you reacted to the pregnancy but you can’t justify not telling your gf you had a vasectomy",
      "id": 34,
      "comments": [
        {
          "score": 12,
          "content": "He told her he doesn't want kids and she was okay with this or else she probably would have broken up with him. At this point it wasn't necessary to mention the vasectomy.\n\nAnd how I read it, he was told he couldn't have kids, then came the pregancy and afterwards at the next test the doctor told him, the chance wasn't 0.00%\n\nBut yes, he should have told her about the vasectomy but mostly for the reason that she could stop taking the pill as it is harmful.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "i now understand that i should have told about the vasectomy, i do was very clear from the start that i didn't want any kids, i was under the impression that she didn't wanted kids to",
          "id": 36,
          "comments": [
            {
              "score": 47,
              "content": "I’m confused. You said she previously told you she wanted kids. How’d you get the impression she didn’t want any?",
              "id": 37,
              "comments": [
                {
                  "score": 3,
                  "content": "she never said she wanted kids, she did asked me a few times, i told here my reasons and she said something like  \"i to think kids are nothing for us\"\n\nas i'm thinking this through, i should have asked if she wanted kids, is it that obvious from my story she wanted kids?",
                  "id": 38,
                  "comments": [
                    {
                      "score": 29,
                      "content": "she asked you \"a few times\"; that indicates to me she was hoping your answer would be different if she asked again. Also, if someone asks you, you should ask back! The subject is on the table!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 105,
      "content": "YTA. You never told her about your vasectomy?? You told her & her whole family they can die??? Thats absolutely fucking insane, humiliating, and disrespectful. You blew up on her in front of her entire family, and bordered on verbally abusing her & them. \n\nAlso, your doctor said it was unlikely, not impossible, that it was your child, so you probably should have waited for confirmation before, again because i can’t believe this, you told her AND HER ENTIRE FAMILY to die",
      "id": 40,
      "comments": [
        {
          "score": 31,
          "content": "Can’t believe I had to scroll this far for someone to mention that OP told them all to go die - like damn boy.",
          "id": 41,
          "comments": [
            {
              "score": 1,
              "content": "Right?! Jesus.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He told her the whole time he never wanted children, I agree he sucks but not saying the vasectomy was fine as long as he didn’t mislead her",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 34,
      "content": "ESH. You should have told her you had a vasectomy in the first place, so #1 you lied by omission. You didn't ask if she was on birth control, you made an assumption and didn't discuss it at all? Your entire relationship? She and her family are AH for ambushing you like that, she should have told you privately. But your reaction was insane. Were you so mad because you thought she cheated on you? Or because of the accidental pregnancy?",
      "id": 44,
      "comments": [
        {
          "score": 4,
          "content": "Entire relationship? OP never mentions how long they have been together, that I saw. A month? Two? Or years? Makes a difference, imo.",
          "id": 45,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "ESH.\n\nDoctors tell women and men that they're infertile and the chances of them reproducing is unlikely all of the time. These people manage to have \" \"mericale babies\". Unlikely doesn't equal 0% chance.\n\nI personally think you're the asshole for fucking a woman without using a condom when you two never had a discussion about what would happen in the event of a pregnancy. Don't fuck women who aren't 100% on board with abortion.\n\nI think she's the asshole for fucking a dude without a condom without having a discussion about what wiuld happen in the even of a pregnancy. Don't fuck men who don't want children and would most likely want an abortion.\n\nThe good news is, that if your doctor is right, then the child is probably not yours. You'll have to wait for paternity.\n\nAnyways good on you for getting the vasectomy.",
      "id": 46,
      "comments": [
        {
          "score": 4,
          "content": "Why is the condom relevant here? The guy had a vascectomy which is more reliable than a condom.",
          "id": 47,
          "comments": [
            {
              "score": 6,
              "content": "Did you not read what I wrote? Don't fuck people who want children if you don't. In the off chance that they get pregnant and keep the kid. It's a simple solution. You can't complain about your sperm fertilizing an egg when you willing fuck someone who Expresses that they want a child and don't believe in abortion. \n\nIt's common sense.",
              "id": 48,
              "comments": [
                {
                  "score": -4,
                  "content": "Did you read  what I wrote?\n\nI asked about the fixation with Condoms. You indicated that it would be a-ok if they had used a condom. I was asking why that is,",
                  "id": 49,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I answered your question. If you're still confused, then I can't help you.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23,
      "content": "[deleted]",
      "id": 51,
      "comments": [
        {
          "score": 18,
          "content": "Vasectomies do have a significant failure rate; they're not a guarantee the way people think.",
          "id": 52,
          "comments": [
            {
              "score": 2,
              "content": "Vascectomies have a .15% (15 out of a thousand) failure rate, but most of the failures occur during the immediate time after the procedure. Once you get past that it's .005%. Not impossible, but very unlikely.",
              "id": 53,
              "comments": [
                {
                  "score": 6,
                  "content": "0.15% is 1.5 in 1000 or 3 in 2000",
                  "id": 54,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Thanks, I'm running on not a lot of sleep",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "YTA for not telling that you had a vasectomy. And don't tell me it didn't came up. It did came up. Telling that you are not interested is not enough.\n\nYou told her whole family to die. YTA\n\n\n\nIf it is your child. Which could be even if it is a small change, be ready to pay child support for 18 years.",
      "id": 56,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA \n\n>I told them they could all die\n\nYeah that's really bad.  If she cheated, she's an AH, but in your comments your MD says it's unlikely, not impossible. Assuming she didn't cheat, you have tanked any possible relationship with the family of your potential future child. That is a really awful thing to say to people who had no involvement in her getting pregnant. Not to mention she likely may now only speak to you through an attorney.",
      "id": 57,
      "comments": [
        {
          "score": 4,
          "content": "In the comments OP also says that doesn't translate so well from his native language - I think he said \" more like drop off the earth for all I care\" which is a much more reasonable response (I think) to that kind of constant pressure and pushing for a reaction.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "ESH. If y’all were living together it was beyond time to tell her that you had a vasectomy. Not discussing birth control, and yes a vasectomy is birth control, is just immature. Also did you really tell them “they could all die from my part” because that sounds very harsh. Yes they were being dicks by continuing to press the child issue but telling someone to go die is extreme. Your GF is obviously an asshole because you’ve confirmed your not capable of being the father and yet she’s pregnant.\n\nEdit: in a comment you clarified the doctor said it was a very close to zero chance you were the father. If you had any swimmers at all then she could be pregnant with your kid. Until you get a paternity test you can’t know. Really should’ve discussed birth control methods used before her family dinner.",
      "id": 59,
      "comments": [],
      "relation": "Attack"
    }
  ]
}