{
  "post content": "I had a major fight with my wife a few hours ago and I strongly think I’m in the right but she is so angry I almost feel like I’m the one crazy. I’ll provide context. I married my wife 3 years ago but we have been together 6. One important thing to note is she’s extremely clean. I regret not moving in together until we married because while I knew she was clean I didn’t know the full extent. Let this be a lesson to live with your partner before marriage. She is the reason why our house looks like a model home. She hates dishes in the sink while I’m content to let them sit for a couple days. She spends her off days scrubbing bathrooms because in her mind they should be cleaned weekly. She doesn’t let me bring my shoes inside and insists I shower immediately when I get home before laying in bed. There are a million more things but hopefully you have an idea. \n\nThis didn’t start hurting our marriage until we had kids. We have a 2 year old and a 1 year old. I’m a SAHD. I left work when our youngest was born and that is when our disagreement on how clean the home needs to be started to get bad. She expects me to do most of the chores now when it used to be primarily her and I wouldn’t mind if they were reasonable. She wants the children to have a bath everyday and I think every 1-3 days is fine. She wants all of their toys put away by the end of the day and I think there is no point when it will be a mess again. She wants the dishes done daily. She wants all house bedding washed weekly. She wants me to vacuum weekly. She wants me to mop every 3-4 days since in her logic the kids spend a lot of time playing on the floor. They will not be hurt or sick if I mop every 2 weeks. Because I don’t play along with most of her demands she ends up being the one to do most of the housework when she gets home or her rare off days.\n\nShe works 40-80 hours/week so it is a lot but she does it to herself. I feel I do what is reasonable. This all built up to today. She got home and saw I hadn’t yet washed the dishes and there was still grease/food in some of the pans and on the countertop. Also I hadn’t yet brought in the trash cans from the previous two days when they were emptied. She flew off the handle calling me lazy and a slob. She said she would like for me to return to work since in her eyes I’m doing a poor job and use the money to hire a weekly housekeeper and a nanny who “wouldn’t leave the kids in pjs all day.” I got pissed and told her she is crazy and she works herself up over small things and I will not be leaving my kids with a stranger. She packed a bag for herself and our babies and to her mom’s house. I’m furious. Am I the asshole?\n\nEdit: so I’m the asshole. The common belief is I need to help more around the house. I’ll see what I can do and apologize to my wife. Thanks.",
  "id": 1,
  "comments": [
    {
      "score": 22207,
      "content": "You're a stay at home father all of the stuff you listed that she wants is normal things an adult does. Your standards are too low. YTA. Bathe your fucking kids.",
      "id": 2,
      "comments": [
        {
          "score": 6903,
          "content": "Out of all the things listed, bathing the kids made me recoil. \n\nI am not the tidiest of persons. All the others I can give a sort of leeway. To certain degree. \n\nBut not bathing the children??? That would be my priority. \n\nYTA OP.\n\nEdit: A few words.",
          "id": 3,
          "comments": [
            {
              "score": 4210,
              "content": "Older kids can get a bath every other day with no problems.  Infants in diapers and toddlers with poor wiping skills need their private parts washed daily.  Especially little girls who can develop yeast infections and urinary tract infections.",
              "id": 4,
              "comments": [
                {
                  "score": 2217,
                  "content": "I don't get why this is an argument for giving them a full bath. If they're in diapers or barely being potty trained, obviously the parent is responsible for cleaning their private parts really well when they are changed/go to the bathroom. That doesn't mean they need to get in the tub, and in fact the recommendation is for them to \\*not\\* be bathed every day because it's bad for their skin.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1040,
                      "content": "My toddler has eczema and she can’t use soap on her body every day or it makes her SO dry and miserable. We do every other day.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I thought I was losing my mind. I think all of the other things are normal increments but our family doctor specifically told my mother to stop bathing my sister every day because her skin was getting so dry. I get what people are thinking but a full bath isn't necessary every day of you are on top of diapers and making sure you're cleaning them properly when changing diapers. If there is a blow out and you gave a bath yesterday, I don't see the harm in doubling up but consistent daily baths aren't typically good for infants. I was shocked when I read that someone recoiled about this part because it's really the only part I agree with OP on.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It’s actually not ideal to bathe kids every day—their skin is so sensitive. Or at least where we live, which has very dry winters. Maybe it’s regional. We are about twice a week. \n\nBut yeah, YTA. Those cleaning requirements are standard for a lot of homes.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah I don’t bathe my toddler every day. Every other is good enough with his skin issues",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 485,
                  "content": "That’s why I had  holdup moment. The kids are 1 and 2, I think.\n\nEdit: Yeah they are. Unless there is a fast forward button or I misread. \n\nPoor kids. Absolute dingbat of an OP too.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 444,
                  "content": "For the first year it's a bath once or twice a week, more if they had a messy day or what have you but generally speaking\n\nEvery day will dry their skin out and cause rashes or other issues",
                  "id": 12,
                  "comments": [
                    {
                      "score": 568,
                      "content": "The American Pediatric Association would agree, with a pretty serious caveat.  A few time a week IF \" if you wash the diaper area thoroughly during diaper changes\".  Does the OP strike you as someone who throughly washes anything?  His kids are better off if he soaks them in a tub every day.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Eh, every other day is still fine for the 1yo too as long as you use water wipes when you change the diapers regardless of what’s inside.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 916,
              "content": "I had the opposite reaction. Those other things made me recoil, and bathing kids every day is actually against pediatric recommendations due to drying out of the skin. That said, wet washcloth to sensitive areas isn't a bad idea \nhttps://www.mayoclinic.org/healthy-lifestyle/infant-and-toddler-health/in-depth/healthy-baby/art-20044438#:~:text=There's%20no%20need%20to%20give,dry%20out%20your%20baby's%20skin.",
              "id": 15,
              "comments": [
                {
                  "score": 367,
                  "content": "Yes as long as he is changing diapers and wiping them clean during changes and not letting them keep smeared food on their faces, it’s better to not do full baths every day.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 488,
                      "content": "True, but this guy doesn’t do his dishes and thinks leaving his bins on the street two days after garbage day is reasonable. I’d be shocked if his kids are reasonably clean. \n\nI wouldn’t be surprised if his wife is telling him every day and hoping he actually does it every other day 😂",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "[removed]",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "This guy is leaving his kids in their pajamas all day, he’s not washing dishes for days at a time, he’s not mopping the floors, if the trash bins are outside for two days where is the trash going during those two days? I do not trust or believe that he is diligent about cleaning the kids’ bottoms.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 127,
                  "content": "This, especially in the winter when the air is so dry, where I live at least. Both my kids had very dry skin, if not quite to eczema levels, they needed creams from the Drs at times and we were told to absolutely not bath them every day when they were that young.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Exactly! One of my 2.5 year old twins has eczema and is like a lizard with derm prescribed cream. If we bathe more than 2x/week in the winter his skin cracks. And my 8m old looks like he has it too but not nearly as bad. Our dermatologist says not to do more than that unless they’re dirty.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "Yes! Daily bathing is excessive unless the kids are playing in the mud everyday or something.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "This was my thought, too.  My middle child was well in to elementary school before his skin could tolerate daily  baths.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Also my reaction! We wiped down babies everyday, but I've never given baths to daily. Especially my youngest whos skin is prone to eczema.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah, the bath was the one thing I 100% agreed with OP on.  A bath every day is not recommended or necessary at that age.\n\nI have a 3 and 1.5 year olds and I understand the chaos at home with toddlers, but there’s a difference between “not being able to get to it” and “not feeling it needs done at all.” There’s some wiggle room on some of the things OP’s wife wants based on their season of life, but her expectations aren’t absurd for a home.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "Bathing daily that young isn’t recommended.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I mean bringing the trash cans back takes like 30 seconds. I’m single and will let a few dishes linger but the trash cans? Such an easy task",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Young children should not be bathed every day, their skin does not produce enough oils to cope with that yet. Especially using soap. A quick rinse of the genital area with water is good enough.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 837,
          "content": "\"Your standards are too low.\" \nI wish someone had been there to say this to that poor woman before she hitched her wagon to this useless AH.",
          "id": 29,
          "comments": [
            {
              "score": 169,
              "content": "I bet she wishes they lived together first.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "If both parents were working some of this would be excessive. But his FULL TIME JOB is managing the home and he cant make sure the bathrooms are cleaned WEEKLY??",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This dude must have never lived in a place with mice.  Dishes in the sink for multiple days and you will find a mouse in your sink.  That is not an experience you ever, ever want to repeat.",
              "id": 32,
              "comments": [
                {
                  "score": 19,
                  "content": "Dude for real! Every single thing he listed as unreasonable is eminently reasonable basic ass house upkeep. His poor wife. Working two fulltime jobs (hour wise) then has to come home to an obviously filthy house, fight w her lazy husband to do it, gets his righteously lazy bs, then has to do it herself. Ew. See, this is why I’m so glad I married a woman.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 498,
          "content": "*Your standards are too low.*\n\nYup. I would say the wife's standards on some cleaning areas are unusually high (not TOO high, just on the high end of what's reasonable), so I disagree with those saying her preferences are totally normal and everyone does it that way. But OP's standards are way too low, to the point that he can't even tell the difference between which things really just need to be done this way and which are areas where his wife is more particular than average, where it might be fair to negotiate or leave those tasks to her if she feels so strongly. So yes, YTA, OP. Your wife is not objectively right about all of this, but you are pretty completely in the wrong.",
          "id": 34,
          "comments": [
            {
              "score": 114,
              "content": "I was looking for a comment like this! There's no way I'm picking up my kids toys every single night and my kid gets bathed every other day and not every day. But you bet I'm going to make sure the important areas are addressed and seriously, leaving the trash cans out for days after they were emptied? There is no way that should be an accepted standard.\nSeems like some compromise could be made, but overall OP YTA for not taking care of the important things. Also, it pisses me off when my husband leaves our kid in Pjs all day for multiple days in a row. I don't understand why some people don't think thats acceptable.",
              "id": 35,
              "comments": [
                {
                  "score": 18,
                  "content": "This makes me laugh at how our lived experiences so greatly impact what is \"acceptable\".  I would find leaving out toys day after day to be maddening (I take 20 minutes every night after the kids go to bed and put things back), but we regularly wear pajamas all day every day (mostly in the winter) if we aren't going anyplace (so warm and cuddly!) though I do change them daily.  Leaving bins at the road is not objectively \"unacceptable\", though I know many HoAs won't stand for it and I find it kind of \"trashy\" (pun not intended, but akin to having a car on your lawn lol).  But I agree with your agreement of BexclamationPoint - OP just can't seperate the wheat from the chaff, nor have a conversation like a partner and adult.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Honestly, the 2 days of leaving the trashcan at the curb got me. It takes literally two seconds to bring in! I fall somewhere in between OP and his wife in terms of overall cleanliness so I can understand that not everything needs to stay museum level cleanly in order to be liveable. But when your refusal to do the bare minimum affects the rest of your neighbourhood on a regular basis, then yeah, you're an AH. I don't even live in an area where HOA's are a thing, but most cities have laws about not leaving your trashcan out. If he's getting fined for it, then he's double the AH for making the wife pay for his laziness. \n\nThere's got to be a middle ground to this. Under no circumstances does working outside the house make the wife exempt from cleaning, and I definitely don't think a SAHP should have to spend their whole day cleaning, but it sounds like his standards are non-existent. I'd like to know how he's spending his day. Is he actively parenting, or is he playing games all day while the kids destroy the house?",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Toys DO need picked up daily or you end up taking care of NO one from your broken ankle or dislocated knee. Of everything mentioned there it's the worst safety hazard. And dirty dishes are just gross and depressing. In an age where you can minimally stuff them in the dishwasher that's just stubborn laziness. But insisting on bedding washes weekly is a bit much. Wouldn't want to be married to either of them, frankly.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Exactly.  OP YTA because wife's expectations are the mid to higher end of the totally reasonable range.  I'm a single mom and I do the dishes every day.  I pay for someone to do more intensive cleaning every 2 weeks and I sometimes wash kids every other day, depending on their mood, dirt level, skin dryness etc.  I have one standard based on what is feasible for one working parent of 2 toddlers.  I did the level of cleaning you are describing while taking care of 2 kids, working FT and going to grad school as a single mom.  Your standard is basically the minimum level to not be neglect, actively dangerous, etc.  Far below ideal.  Totally unacceptable for a person for whom house + kids is primary responsibility.  Your wife could get a cleaner house and better childcare by just paying for it and outsourcing it. She could do it at the level you are providing on her own / with daycare.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Not only is he TA he's a lousy SAHD and overall that's disgusting... She's listing BASIC stuff! When he said she's a clean freak i expected toothbrush cleaning the bathroom 3× a day. This is BASELINE REQUIREMENTS",
          "id": 40,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Yeah, even the edit where he acknowledges he’s the AH is bullshit. “I need to help more”. Don’t “help”, DO! This is the deal you agreed to.",
          "id": 41,
          "comments": [
            {
              "score": 11,
              "content": "Came here to rage about the edit.\n\n**No OP, you don't need to \"help,\" you need to do your damn job.** \"Helping\" means that it's someone else's responsibility in the first place.  \nIt's not.  \nIt's yours.  \nYou are the SAHP. Your wife is totally fair to want to hire a nanny or maid, who would be \"helping\" **your responsibility.**",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "I was fully expecting this woman to ask him to scrub baseboards with a toothbrush every day but what she is asking is perfectly normal to living.  Floors should get washed every few days, toilets should get scrubbed every week, bedding should get changed weekly, dishes should get put in the dishwasher every day.  What kind of filth did this guy live in when he was alone?",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This might just be a culture shock thing but his level of “cleanliness” is kind of scary to me. \n\nIn my house we do the dishes twice a day, once in the morning after breakfast and once in the evening after dinner. We wash all our pots and pans after cooking. \n\nBathrooms are cleaned weekly unless they’re shared then bi-weekly. It also depends on the cleanliness of the occupants (you clean up after yourself, then you won’t have to clean the bathroom)\n\nShoes are absolutely not allowed inside the house. We have slippers that we wear inside and outside shoes are for outside. Showering before bed is also normal but dependent on how dirty/active you’ve been that day.\n\nI don’t have kids but all my little siblings and cousins bathe at least once a day, but usually twice. Moisturise to avoid dry skin. Their toys are put away whenever they’re not being used, not just at the end of the day.\n\nVacuuming weekly is normal and in houses with floorboards or tiles, mopping is done after every vacuum.\n\nIf I worked all day and came home to a dirty kitchen, toys on the floor and my kids not showered and dressed I would also be extremely upset.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "And dress them he doesn't even seem to do that",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "WTF does he do all day?\n\nAnd he’s content not going back to work?\n\nWild!",
          "id": 46,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I do all the cleaning you do and work full time.  LOL dude you lazy and the AH.",
          "id": 47,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14920,
      "content": "[removed]",
      "id": 48,
      "comments": [
        {
          "score": 6950,
          "content": "I was expecting the wife to be screaming at him over a speck of dust on the baseboards or something. But no. She just doesn’t want to live in filth.",
          "id": 49,
          "comments": [
            {
              "score": 3918,
              "content": "Right? He’s freaking over vacuuming once a week? What the hell? \n\nOP, Your children are infants and sit in poo and urine for most of the day, it literally takes 5 minutes to bathe them. They should be washed daily— your wife is correct.  \n\nIf the house is shoeless and you vacuum weekly you can get away with mopping twice a week. If your kids play on the floor this is important. \n\nOP also look up YouTube videos on creating a cleaning schedule. Many people have divide the focus on different days so that they can keep the house clean.  YTA.",
              "id": 50,
              "comments": [
                {
                  "score": 1025,
                  "content": "The cleaning schedule videos are extremely helpful! OP unless you live a huge house with a dozen rooms, cleaning 1-2 rooms a day during the week, is more than manageable and feels great! I wasn’t the most tidy person, but creating a schedule helped immeasurably, and really makes me love my home now that it’s clean and tidy.\n\nYTA though, for wanting to do everything at your own pace, when your wife’s mental health and your kids’ physical health is at stake. Your wife gets more stressed out because she knows she cannot trust you to do the minimum, and your kids are picking up dirt and dust, affecting their respiratory system, not to mention the skin issues, if you don’t change their bedding every week. Bathing them daily not only is better for them, they feel fresh and clean, it also teaches them good habits. Involve them in tidying up their toys at the end of the day, and wash the dishes as you go. Don’t let them pile up, it gets more difficult to clean, and smelly!",
                  "id": 51,
                  "comments": [
                    {
                      "score": 528,
                      "content": "[removed]",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 244,
                      "content": "Yeah, her cleaning schedule is reasonable. OP, YTA.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 97,
                      "content": "I agree with this! Making a schedule will help it feel less overwhelming for you. \nInvolving the kids in cleaning helps them learn HOW to clean. You can make it a game by setting a timer and trying to beat the clock, or make it a routine by using a “clean up song” so they know when it’s time. There are kids songs about cleaning up, like Super Simple Songs’ Clean Up song. They’ll need help at first, but gradually they can do it on their own. And they definitely need daily baths and clean floors for their health. \n\nSoft YTA because cleanliness isn’t just about personal preference since it also affects health and mood.\n\n[edit for spelling]",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 496,
                  "content": "I hate vacuuming and don't do it ever. That's why I have a Roomba. They also make a mopping one. I'm a lazy slob and telling you to 100% get it together.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 225,
                      "content": "Duuuude, my robot vacuum (not Roomba brand) is my very best friend in the whole world. I have two cats and foster dogs, so lots of hair, and my floors have never been cleaner since I got it!",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Robot vaccums are amazing! Especially when you have kids and pets.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I have shark brand ones and they're called \"Baby Shark\" and \"Firstborn Son\".",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 292,
                  "content": "Funny, this is exactly what every STAH mom does. It's what every go to work husband expects. Why should it be different for him.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I'm a SAHM and I find her expectations overall reasonable, like, yeah, vacuum and mop regularly, bathrooms once a week, etc. I do think it's a bit silly to pick up every bit of clutter when kids are just going to make a mess again. I focus on removing tripping hazards and keeping the place from getting overwhelming. \n\nI don't think it's reasonable for OP to do it all himself  during the week, especially if he's also running errands, making appointments, doing laundry, prepping meals, etc. with young children underfoot. You can only get so much done during nap time.\n\nWe get our cleaning done on weekends - we work as a team, switching off child care and chores until it's done. And for a time we had a cleaning service come once a month to really get in and do deep scrubs, which lightened the load. \n\nBut this isn't about chores.\n\nThe big problem is that each partner - OP and Wife - sees the other as ridiculous and kind of a whiny. Wife sees OP as a lazy slob, instead of as a busy parent doing his best. OP sees Wife as a picky naggy workaholic. \n\nThis marriage is toast if they don't change their mindset.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 263,
                  "content": "> She wants me to vacuum weekly. She wants me to mop every 3-4 days since in her logic the kids spe\n\nHe would think I'm insane... I vacuum like 2-3 a week because of the pets we have. Also my partner has allergies. So, it makes sense to try to pick up the hair more regularly.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 98,
                      "content": "I have one cat, one husband and no children. I vacuum almost every day because there is always hair and crap on the floor (we have hard floors, you can see everything). I am currently on a break from mopping, which usually I do weekly. I can only imagine what the floors would look like if I had a 2 year old and a one year old.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 228,
                  "content": "The only thing I disagree with is bathing the kids daily. It's actually more likely to give them dry skin. And if they have any kind of skin condition, bathing that often can make it much worse.\n\nEvery other day should be fine assuming OP is properly cleaning them at diaper changes.\n\nETA: y'all, when I say bath I mean bathe with soap, shampoo, and water. If you aren't washing your body and/or hair with a cleaning agent of some kind, that is not a bath in my lexicon.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 141,
                      "content": "I also had this thought, but given his belief that doing the dishes every day and vacuuming and cleaning the bathroom once a week is \"extreme\" I feel like even if he is cleaning them properly at diaper changes, they may genuinely be getting grimy from the floors every day...",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 132,
                      "content": "I don't think we can assume that, since he leaves them in pjs all day.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 103,
                      "content": "At that age they don’t need soap or shampoo daily but they do benefit from routine. Even if they just splash in the water, having a nightly bath as part of the wind down time before bed can be really beneficial.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "My doctor recommended daily, but only with water to keep up with the bedtime routine and we do soap 2x a week.  She may want the consistency of the routine and not just the cleanliness of the kids.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "At their ages, these kids are still in nappies. They need at least that area cleaned well once a day. When my kids were in nappies I gave them a bath every day just in warm water, no soap, and that was enough.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 137,
                  "content": "I have kids the same age as OP.  They’re disgusting tornadoes of crumbs, unexplained stickiness, toys, and bits of random paper. I cannot fathom only mopping every two weeks. We have to sweep and vacuum at least every two days, and mopping is twice a week in the whole house. Spot cleaning under the table and in the kitchen happens multiple times a day. \n\nDishes for days? How? We run the dishwasher at least once a day, usually twice. If you stop cleaning for a day, the house is absolutely destroyed. Toys, crumbs, dirty clothes, and bits of food everything.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My kids are teenagers now but when they were little they even managed to get ketchup on the ceiling. The amount of grime we dealt with on a daily basis in a crappy little rental house. Also we don’t have enough dishes to not do them for days and I’m a potter and make all our dishes!",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Toddlers seem to exude sticky jammy crumb mess just by existing its amazing.\n And their ability to undo all tidying you just did directly behind you (I remember this when the house we were renting was on the market and it took 90 seconds to undo the putting away of one room I just about cried)\n\nHow do you make dinner for that day if you've left all the pans from the night before out is my question like I think even if we can't get together on the rest of her requests, the two we can all agree on are at least load a dishwasher which takes 2 minutes and if you can't entertain toddlers with a bucket of cups or Tupperware for 2 minutes on the kitchen floor idk what to say, and actually getting your kids dressed daily unless they're sick.\n\nI'm crap at house keeping and am extremely disordered but even with extreme depression anxiety and executive dysfunction I could manage to do this when my kid was a toddler.\n\nI'm wondering if his wife is the cook? I might have missed that, and if so she's come home wanting to make dinner and has to clean last nights pans before making a start, that would be the straw for me.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "Children don't need baths everyday unless they are very dirty. 1-3 a week is recommended.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "Freaking over vacuuming once a week while he knows how much his kids drop crumbs everywhere",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "omg! you just triggered a thought! if he doesn’t think that need to be bathed that often, do you think he changes their diapers on time? \n\nYTA OP this post generally has my skin crawling! dishes in the sink for 3-4 days? is your nose broken?",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "None of the demands were even remotely unreasonable\n\nThe only one I have wiggle room on is the bath one. Little kids can get away with every other day but my guess is that with OP being there, they should have one every day\n\nEdit to render a verdict: OP, YTA",
              "id": 75,
              "comments": [
                {
                  "score": 30,
                  "content": "A Wet wipe down every night that they don't bath, which should be every other night baring filth emergencies  .",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I mean if there like my kids we do a wash the day away. Which just sitting in the water and pouring water over themselves as they get dirty. They love just rolling in diet",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "I kept waiting for the unreasonable part. I'm still waiting.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "I'm a self-identified slob and I literally keep to the cleaning schedule his wife wants. I have a dog and would be living in a mess of hair and dirt and my own trash if I didn't.",
              "id": 79,
              "comments": [
                {
                  "score": 8,
                  "content": "It was the bins that sat empty at the curb for two days that did it for me.",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Same. My kids are 3.5 and 1 and I’ll admit it’s taken me a while to get there (realized I likely have adhd) but I put together a cleaning routine and by golly it works.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 809,
          "content": "Also reasonable: mopping every few days when you have kids playing on the floor, changing linens weekly, dressing your children. None of this is unusual or \"neat freak\" behavior, OP just doesn't want to.\n\n&#x200B;\n\nYTA OP",
          "id": 82,
          "comments": [
            {
              "score": 314,
              "content": "Right? He made it sound like he was married to Petunia Dursley. All the examples he used seemed reasonable to me.",
              "id": 83,
              "comments": [
                {
                  "score": 252,
                  "content": "I live in a tropical country. If you leave dirty dishes for two days in the sink, you will have literal maggots in them.\n\nLike fuck that.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 54,
                      "content": "I don't live in a tropical country and we would get swarms of fruit flies if we did that. Even if nothing in the sink is fruit!",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 757,
          "content": "Thank you! I was so confused. These are like, baseline housekeeping goals. We aren't teaching toddlers to put their toys away? Wat?\n\nI thought OP's wife was going to be unreasonable but naaaah. Just another AH man not understanding the effort of all the labor we put in **as normal** and feeling overwhelmed. \n\nBut real talk, having two young children to look after IS stressful and time consuming OP. Check out Montessori early child learning videos, because you need to incorporate these duties into the regular rhythm of your day and involve the kids. \n\nA 2 year old can help wipe the table off. A one year old can throw clothes with you into the washing machine (and be fascinated by water and bubbles). Clean sheet day means we build a fort in the morning with the linens and then start washing before lunch. Weekly FORT DAY are you kidding me? You'd be dad of the year. Floor needs mopping? Cool. Give them soapy sponges while you sweep the rest and throw them straight into the bath. Call it double bubble time, idk. Put in the effort into excelling at this crucial precious time in their development and work together as a family--you will thank yourself when they're teenagers.\n\nhttps://www.themontessorinotebook.com/age-appropriate-chores-for-children/\n\nCheck out the \"Fair Play\" game with your wife so you can both examine what the division of labor is now and see where the gaps and tensions can be addressed as a team. And because some days Are Just Those Kind of Days, established a threshold at which these expectations can be waived temporarily. Sick kids, snow days, etc--sometimes we need a hall pass from standards. It happens. But that can't happen *every day*. You can do better.",
          "id": 86,
          "comments": [
            {
              "score": 81,
              "content": "i hope op sees this!! because wow that's some really good advice and imo so many parents could benefit from that sort of thing. wish reddit still had free awards because i'd give you one!!",
              "id": 87,
              "comments": [
                {
                  "score": 72,
                  "content": "That's so kind of you to say. I was worried I was being harsh, because if a dad came here complaining about a SAHM being lazy I think he'd get read to filth--but lots of those instances involve someone recovering from giving birth or still nursing, so that doesn't apply here. If IS hard work and that's worth acknowledging, but this is life with kids.\n\nI think KC Davis' (YouTube and Tiktok) approach to tidying is really reasonable--it's specifically for people who are struggling with an illness, depression, disability, life change, etc. She calls it \"Struggle Care\" and came up with really simple ways to tackle overwhelming tasks. I'd say dealing with young children qualifies for this approach! Hopefully OP sees this.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 6,
                      "content": "absolutely agree with you!! yeah parenting kids without being a SAHP is a very hard job, let alone being a SAHP. i don't know how people do it, to be honest. but if you're being a SAHP, you're doing it knowing it's going to be hard. \n\ni struggle with mental health so i'm actually going to have a look into the channel you mentioned! i'm pretty good with cleaning & tidying because i can't stand things being unhygienic or dusty, but it's always good to have something up my sleeve in case things do get hard. so thank you for that!! :)",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "As soon as my son turned one we started playing the 'put away' game at the end of every day.  He's almost four now and has been 100% in charge of putting all his toys away at the end of the day for the last year -  and he is great at it.  He knows where everything goes and how it's organized.  He also has a toy mop and broom and loves to sweep - and helps me match his socks and fold his own laundry.  Kids can do a lot!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My kid looooooved swiffering when he was 2-3, our floors were immaculate.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This is such a lovely comment! It makes me want to go back to the little kid days and do better.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 427,
          "content": "Yeah, I was actually ready to be on his side, because I thought it was going to be a “ she doesn’t like the way I fold the towels” kind of post, but nope, she has basic and reasonable standards of cleanliness, far more lax than many people I know ( myself included).",
          "id": 93,
          "comments": [
            {
              "score": 94,
              "content": "Yeah, when he said the place looked like a model home I was on his side. And then he started talking about kids and never doing the dishes and wow is he TA.",
              "id": 94,
              "comments": [
                {
                  "score": 8,
                  "content": "Hell, I'm a slob and I clean more than that! OP is worrisome if he thinks that's an extreme amount of cleaning.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "i thought she was a cleanzilla. \n\nbut the examples all seem like proper things to do. \n\nby the 10th \"she's right about that too\" i am on her side.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "Exactly. I can’t even with this guy. If she was asking him to vacuum every day or something like that it would be a little much. And leaving the kids in their PJs all day occasionally is totally cool but it sounds like a regular thing. Do they go to bed in the same PJs they wore all day?\n\nOP - YTA she works EIGHTY hour weeks and you can’t be bothered to clean up from the day? She is right. Go back to work.",
          "id": 97,
          "comments": [
            {
              "score": 213,
              "content": "AND he even stated she cleans when she’s not working…this woman is doing a lot and getting nothing but weaponized incompetence in return",
              "id": 98,
              "comments": [
                {
                  "score": 70,
                  "content": "I feel for her. My sister is married to someone like this. He does work sometimes. But he is self-employed and spends most of his time at the gym. My sister works full time and spends all of her time cleaning or running kids somewhere. \n\nOP needs a serious wake up call or she is going to figure out that life would be easier as a single parent.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I mean he can't be bothered doing the bare minimum levels of cleaning so I kinda have doubts he's doing more than bare minimum keeping the kids alive while she's at work.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I haven't read his comments yet, but it almost sounds like he wanted to be the stay at home parent because he thought it would be a break and he is finding out that it is, in fact, not a break.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "And actually her idea is pretty decent. \n\nI'm physically disabled and my plan (I'm not even in a relationship right now lmao but I've discussed this with partners in the past) is to WFH (all I'm capable of, I do that now) and use a chunk of my funds towards housekeeping since working on a computer is way easier than doing house chores for me, and the rest would go to some agreed upon combo of bills, savings, and/or fun money. So like I'm just exchanging my chore time with work time (since I'm disabled I wasn't gonna be able to do both to begin with). \n\nI see so many couples fight about chores, tbh if people can afford it, getting house cleaning once a week or so if they can afford it would make things so much better. I bet many people would prefer to put a few hours in of overtime and have less chores.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 204,
          "content": "Right? The title makes it seem like she’s neurotic when she’s asking for the basic cleaning every family does",
          "id": 103,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 201,
          "content": "Yeah, I was waiting for OP to regale us with his wife's clean-freak obsessions and then he described her perfectly normal cleaning expectations. \n\nI kinda think this was made up.",
          "id": 104,
          "comments": [
            {
              "score": 35,
              "content": "I think the wife wrote this…",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 196,
          "content": "The thing that really got me was...\n\n&#x200B;\n\n>One important thing to note is she’s extremely clean.\n\nLike, no. She's just normal, regular person clean. \n\nOP is just gross, and content to live in filth.",
          "id": 106,
          "comments": [
            {
              "score": 15,
              "content": "[deleted]",
              "id": 107,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 194,
          "content": "Seriously wtf does he even do every day? His wife should kick him to the curb. He's essentially a squatter.",
          "id": 108,
          "comments": [
            {
              "score": 196,
              "content": "I mean seriously, he can't even bring the bins in after TWO DAYS?! \n\nDude, not one single thing that you listed is anything outside of the realm of just good hygiene or pretty standard cleaning, unless you are, yes, a slob. YTA.",
              "id": 109,
              "comments": [
                {
                  "score": 6,
                  "content": "What exactly is he doing while they're napping?\n\nEven if the kids are on different schedules, you drag the awake one around with you and get them to 'help'. You never win a race of \"who can put the toys in the basket fastest?\" but the kids will love crushing you as they manage one for every ten blocks you do.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Dude should just start wearing his children (2 year old on the back 1 year old in the front) then he can actually vacuum and mop and while the floors are drying go for a quick walk (if weather permits) or go into another room and clean that up. \n\nI’m thankful that all my children are school aged and are gone a full school day so I can get those things done instead of waiting until the weekend to clean the house.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 128,
          "content": "Yeah I was expecting him to start listing examples of actually unreasonable standards… and then every thing he said I was like oh yeah that’s normal. Yes bathrooms do need to be cleaned weekly? No you shouldn’t leave the empty garbage bins on the street for three days? I mean good god man. \n\nI agree him that with kids some things will need to give a little, but with *those* being the things he’s choosing to point out, I can imagine how his wife got to a tipping point.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11813,
      "content": "YTA. Her cleaning habits are fairly average. You’re just a slob.",
      "id": 113,
      "comments": [
        {
          "score": 6173,
          "content": "I came into this thread fully expecting some microscope wielding out of control Marie Kondo on cocaine archetype screeching about fingerprints on the glass door. \n\nInstead I find an absolute slob upset that the bare minimum cleaning humans do is a high bar.",
          "id": 114,
          "comments": [
            {
              "score": 1276,
              "content": ">Marie Kondo on cocaine archetype\n\nI wish Reddit still gave us free awards.",
              "id": 115,
              "comments": [
                {
                  "score": 172,
                  "content": "I gotchu.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Fun fact, even Marie Kondo doesn't keep her house that clean anymore because she can't be bothered.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "Right?! \"She thinks toilets need to be cleaned once a week, lol\". Yes! Yes they do! Bare minimum!",
              "id": 118,
              "comments": [
                {
                  "score": 8,
                  "content": "I do mine every day BECAUSE IT TAKES LESS THAN FOUR MINUTES! Inside and out!",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Same, growing up, my mother had a full time job but she also cleaned EVERYTHING DAILY. And I mean OCD level. Dusted, vacuumed and mopped every room every day (dusting window sills and baseboards too!). \n\nWhen my sister and I each turned 10, we were included in the chore lists. In the summers, we weren’t allowed to go outside until every last thing was done, we each had lists (plural). During the school year, we would come home to lists. First the chores, then the homework (crazy right). We were each assigned a few rooms to clean (I always got the bathroom, sister got the kitchen, so we both had at least one difficult room). And we would clean that room top to bottom DAILY or there would be hell to pay. Also, laundry done every day, folded and put away before our parents got home. (We were latch-key kids). So everyday, parents would both come home from work to a pristine house. \n\nI wish my own house were that clean as an adult, but everything is pretty much a weekly cycle. Every day a different set of tasks. But laundry a couple times a week, and dishes after every meal.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "\"she expects me to vacuum weekly\" sent me.  This is pretty normal, not living in filth type shit.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Last year on here (or hell maybe it was 2021) there was that guy whose wife practically emotionally scarred their kid for spilling milk, then got too depressed to clean for days. This woman is not that.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">Marie Kondo on cocaine archetype\n\nAh, I see you’ve met my grandmother",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "The only thing I thought might be excessive is bed sheets daily. I usually do 1 to 2 times a week. I could be wrong though\n\nEdit: nvm. Just saw they said weekly, not daily",
              "id": 124,
              "comments": [
                {
                  "score": 8,
                  "content": "But didn’t OP write that she wants sheets to be changed weekly?",
                  "id": 125,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You're right. I don't know why I saw daily. Guess I was trying to find one thing that was actually crazy but their cleaning schedule sounds about the same as mine.",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Me too! And instead it's bro over here whining about how he needs to clean a bathroom weekly. Of course it's his wife's house and her kids too, and he does care for kids all day, so she needs to do her part. But he's acting like she's totally unreasonable and he's got it all figured out while wallowing in filth.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That ends up doing all of the work herself.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 440,
          "content": "Right he would freak out if he lived with me. Toilets are cleaned every day, mopping every two days. Slobs have a hard time living with me",
          "id": 129,
          "comments": [
            {
              "score": 642,
              "content": "How do you have time to do literally anything else? Is your entire life just cleaning?",
              "id": 130,
              "comments": [
                {
                  "score": 223,
                  "content": "I do a deep cleaning once a week but it only takes a few minutes to clean a couple of toilets. I do a quick mopping most of the days until the deep cleaning day. Maybe just hit the high areas. I am guilty of leaving dishes sometimes until the morning. I haven’t gotten completely anal yet😂",
                  "id": 131,
                  "comments": [
                    {
                      "score": 230,
                      "content": "Oh and I first sweep, then vacuum the floors before I mop. Then vacuum again. You know, I may have a problem. Typing it out makes me realize how particular I am",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I wish it only took me a few minutes to clean a toilet, I don’t know how you do it so fast. Vacuuming my house is the worst, that’s a 2 hour job for me",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Please help me clean my room!!",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "You mop every 2 days? I think regular clean people would have trouble living with you",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "You clean your toilets EVERYDAY!?  Do you suffer from a cataclysmic bowel disorder!?",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 245,
          "content": "Yeah, seriously. I came here thinking her expectations were going to be something way over the top. This is just a normal schedule for when things should be cleaned, lol. And that's coming from an extremely lazy person.",
          "id": 137,
          "comments": [
            {
              "score": 9,
              "content": "Same! I'm lazy and hate cleaning but his Mrs cleans the same amount that I do and I know I could do more but I hate it. I wonder if she ever went over to his place while they were dating? But I'm guessing he probably lived with his parents cleaning up after him.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "yeah I was expecting that she came home and performed white glove inspections on the baseboards  \n\nbut no she wants the trash taken out, for mold not to be growing in the sink, and for her children not to be playing on a filthy floor\n\nand OP doesn't even want to do the things that can help reduce how often you need to clean!!! if you wear shoes in the house you need to clean the floors more. if you shower before getting in bed, your linens stay fresh longer   \n\nhow he is both against basic cleaning and against basic measures to reduce the amount of cleaning necessary",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Seriously. I'm a fairly half-assed housekeeper SAHM and even my lazy slob ass cleans more often than what OP's wife is requesting.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I was gonna say. She doesn’t want to sleep in dirty sheets and doesn’t like the smell of dirty dishes? That’s totally normal. \n\nI was expecting her to have genuinely unhinged cleaning habits like vacuuming and mopping once or twice a day, cleaning every surfaces everyday etc",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Things he listed seems to be the standard chores stay at home spouses do. If he doesn’t bathe them, clean up their mess, wash dishes, wth does he do?!",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Seriously I consider myself pretty lazy with cleaning but I do everything the wife expects from OP (apart from maybe mopping every 3-4 days, I only do it weekly). Doing the dishes every day, cleaning the bathroom weekly, tidying up daily, vacuuming weekly? That's like... the bare minimum, how is that being \"extremely clean\"?",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Yeah OP, none of her expectations are unreasonable in the least... infact I agree 100% with your wife... get off your phone or Xbox and get to work. Dress your kids every morning, clean the dishes everyday, and stop being lazy... any stay at home parent shouldn't be just relaxing all day. You should be exposing your kids to life, education, and positive habits...\n\nYTA",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "And he wants to mop every 2 weeks?! And bathe his kids every 3-4 days?! Ugh.\n\nI hope his wife is working over time to save up to leave his ass because he brings absolutely nothing to table.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6588,
      "content": "Your standards are too low. I am someone who genuinely has always struggled with keeping my environment clean.\n\nDishes should be done every day\n\nThe house should be vacuumed like every other day not even weekly \n\nMopping every few days is normal\n\nWashing yourself before getting into bed is my preference as well.\n\nWashing sheets weekly is standard \n\nPicking up all the toys and putting them completely away at night is incredibly good for your mental health. \n\nKids are definitely washed every day. Soap is every other day. \n\n\nThe PJ thing tho? There’s definitely one day a week on the weekends where we’re all in pjs all day. Are you doing this EVERY day?\n\nBased on your standards I am actually wondering if maybe you’re depressed or have adhd? I have adhd and I know that doing the BARE MINIMUM isn’t easy. Maybe talk to someone and see if you can work through this\n\nETA: YTA",
      "id": 146,
      "comments": [
        {
          "score": 1226,
          "content": "Yeah there’s a few things here that I think the wife is a little too extreme on, but one thing that stood out was washing bedding weekly. Bedding gets fucking _disgusting_ whether or you sweat or not",
          "id": 147,
          "comments": [
            {
              "score": 382,
              "content": "We have started periodically laundry stripping our sheets and the colour of the water is 🤮 even though we wash and change our sheets regularly. So gross but so satisfying to see.",
              "id": 148,
              "comments": [
                {
                  "score": 217,
                  "content": "A scary amount of fluids and dead skin accumulate on bed sheets. A week is the max.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yeah a lot of people take the “out of sight, out of mind” approach. Their bedding doesn’t _look_ gross, so they assume it’s not",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Changing the sheets once a week is definitely standard. I also vacuum my mattress every month and flip & rotate the mattress 3 times a year.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Get a water softener and ease up on the fabric softener. Provided you are doing your laundry properly those two things is likely what is causing the water to be so dirty.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 7,
                      "content": "We don’t use fabric softener but I do think a water softener would be good to get, our apartment’s water is not the best. Thanks for the idea!",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Laundry stripping? Is that something else then washing?",
                  "id": 154,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Soaking before washing in hot water with a mix of detergent, washing soda, and borax.\n\nhttps://www.today.com/shop/laundry-stripping-t227439",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Welp. This just shows I'm not washing my bedding often enough 😂",
              "id": 156,
              "comments": [
                {
                  "score": 16,
                  "content": "I wouldn't take it that way. 1 week is a little crazy to me",
                  "id": 157,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Especially if they’re all wearing the same clothes all day long and not bathing regularly. Yuck.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 781,
          "content": "I have adhd and many chores I have a really hard time keeping up on. \n\nReading this thread makes me want to deep clean the entire house...maybe I will go and do the dishes in a bit",
          "id": 159,
          "comments": [
            {
              "score": 1113,
              "content": "Do remember that we are literally disabled in this area of life. This post isn't for us. Don't let the rejection sensitivity side effects tell you this post is judging you. It's not. \n\nThere are some things we can do to make it easier for ourselves (like a roomba or a dish washe, or techniques like habit stacking). But honestly somedays, my victory is that I made a real dinner instead of just a protein bar and we're not going to talk about the dishes because I literally couldn't. \n\nWe have to learn when to *work around* the hurdles of adhd, when to push through with sheer will power, and when to give ourselves grace and recognize that I can't get over or around that hurdle today so I'm just going to take a breath today and try again tomorrow. \n\nThe thing for us to remember from this post is that communication with your partner/roommates is soo important. Whether it's \"I know the dishes need to be done, I'm going to do then tonight or tomorrow morning.\" Or, \"Honey I'm really struggling. I know this is one of my chores but can you help me? I'll get you a bottle of wine in appreciation.\" Or, \"You want the house cleaned before this thing happens. What specifically do you want me to do? If you just say \"clean the house\" I might get stuck scrubbing the hallway walls and completely neglect the laundry on the couch.\"\n\nI don't know enough about OP's life to make a judgement call there. I haven't read any of his comments or anything and just from his post I could see it going either way depending on what else is going on in their lives. \n\nBut **TLDR**, the other comments aren't about us and how we survive with our disability. Don't let yourself feel judged, that won't help you over come adhd paralysis and actually clean your dishes. We need dopamine to have enough oomf to get up. We don't need shame. You're ok friend.",
              "id": 160,
              "comments": [
                {
                  "score": 218,
                  "content": "Awww thank you! You made my day!!! I read such posts and think yeah this cleaning routine sounds reasonable. And then I look around and yeah… not gonna happen. The 13 piles of laundry I did this past weekend will be my achievement of the month - and let’s gloss over the fact that it piled up so much. So thanks for your comment, it made me feel so much better. And good point on the communication instead of trying to hide the shortcomings and getting into an even worse spiral.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 23,
                      "content": "There’s a therapist/content creator named KC Davis (DomesticBlisters on TikTok) and she specializes in cleaning for people with ADHD. So compassionate and helpful - highly recommend.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "13 piles of laundry *is* an achievement! I cleaned the wall behind my stove and swept and mopped under the stove while I was at it. That's my big win right now.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "This comment made me actually cry. Thank you, *thank you* for explaining this. I have been reading through comments and feeling like the most disgusting person in the world. I wish I could function like “normal” humans. The overwhelm is *real*. The mess is overwhelming. The knowing I should do the things is overwhelming. The shame is overwhelming. I hope one day I can follow a cleaning schedule this way.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I needed this lol, got hit with a lot of guilt about not cleaning my bathroom or changing my sheets weekly :') Like who the fuck has the ability to do that? How??",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Thank you so much for your comment 💐",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": ">If you just say \"clean the house\" I might get stuck scrubbing the hallway walls and completely neglect the laundry on the couch.\"\n\nstory of my freaking life man.  story of my life. \n\nwas diagnosed when I was 30 and so much stuff made sense after that.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I literally got anxious reading OP’s wife’s cleaning schedule and thought to myself she’s nuts. I still consider myself neat and tidy, but I never knew this connection to ADHD paralysis and so many things about my own behavior are starting to make sense.. I’m just worried my husband thinks I’m making it up and that it’s not a real thing and not just me being sloppy and lazy.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This is barely related to the comment you were answering but it's like 5pm where I am and I haven't eaten today just because I lack the energy/executive function to make a meal and I was really getting down on myself about it. So thank you. This comment just helped me feel better and realised I'm not completely failing just because I haven't been able to eat today.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 5,
                      "content": "If you're still onlkme and still having a bad food day, drink a cup of milk. It's one of the fattier and more calorie rich beverages that most people have around the house. It'll give you something at least. If you don't have milk, maybe you have juice? Or honestly, even ice cream? Just try to get a few calories if you can. I know food can be really hard but we do need it.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Thank you for this post. Like many other people here, both me and my partner struggle with ADHD and occasionally depression. We give each other grace when the dishes pile up. But OP committed to taking care of his children and seems to be getting defensive about failing them, and that is a red flag. And that as a stay at home dad while his wife works as much as she does, and he's calling her \"crazy.\" She needs a divorce and hired help instead, yesterday.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Yes *but*  \npart of living with disability is recognizing your limitations and that we need extra help doing things that are \"normal\" for other people. What gets me about this post is that OP is *insulted* by the suggestion of hiring a nanny/maid. If were in charge of housecleaning? Yes, PLEASE hire a maid! I would be so damn relieved to have that help, because I know that I am limited in what I can manage on my own!\n\nThen OP's edit to say they need to \"help more\" really solidified YTA for me. \"Helping\" implies that it *was someone else's responsibility.* It wasn't. It was his. Failing to communicate with his wife, compromise, make a cleaning schedule, refusing to take his shoes off inside (thus making the floors even dirtier for him to refuse to clean), refusing to change the kids out of the sleep clothes... maybe OP is depressed or has undiagnosed ADHD. Maybe one or both of the kids have serious behavioral issues that really do take up his entire day. But failing to actually communicate, failing seek solutions, then outright rejecting hiring help and saying that his wife \"does it to herself\" makes him TA imo.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "How do you stop feeling intense shame over this?",
                  "id": 173,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Well you caught me on a good self-esteem day. For me, learning more about how my brain works and doesn't work has been really freeing. \n\nLike, most people are able to build habits because they're brain gives them a dopamine hit when they do a thing (do the dishes, go for a run, etc). My brain does not do that. My brain says \"dishes suck. I am starved of dopamine. Why the fuck would I want to do that when I can get dopamine on candy crush?\" And so we're paralyzed on the couch playing candy crush even though we feel all of the shame and guilt and anxiety about the pile of dishes we're staring at. And the shame and guilt makes it worse because it means we're making less dopamine so it's even harder to get up. \n\nSo I feel less shame about the paralysis because I understand now that I'm not being lazy, my brain won't let me move.\n\nI know some people don't like thinking about adhd as a disability, but it feels really freeing to me. Like there's a reason this feels really hard, because we are living life on hard mode. That doesn't mean that I don't still work to overcome it. If I give in and I'm late to work every day I *will* get fired, I *have to* fight to be on time so I can feed my family. But it means that I understand that getting to work on time is harder for me that my NT colleagues so I feel less shame about the struggle. \n\nAll that being said, when I had a big cleaning problem that I was crippled with shame about, I didnt go to my mom or grandma for help. I couldn't bear to admit to them that I was struggling this badly. I turned to my adhd support group. And that was within the last month. So I feel less shame than I did 15 years ago when I didn't understand my brain, but I still struggle",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 333,
              "content": "I have ADHD and although I recognize some of OP is complaining about a very normal cleaning schedule, I can’t exactly come in here and pretend I’ve never let dishes sit for days. But I know I’m not supposed to!",
              "id": 175,
              "comments": [
                {
                  "score": 224,
                  "content": "Yeah I can't pretend I can maintain his wife's standards but I know they aren't unreasonable (ADHD + depression)",
                  "id": 176,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Same, she has very reasonable ideas about what a normal household should look like imo, but for me it's not exactly a given to be able to do all of that. (Also adhd+depression)\nEdit: typos",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "same here.  I was expecting someone like my mom or my ex who would clean bathrooms/bedding/floors every single day.  Sometimes my ex would vacuum twice a day and it was just him, no pets.  \n\nBut reading what OP wrote out that is a scheduled I would like to maintain I just suck at it.  \n\nI mean I dont have kids but not giving them a bath every day?  wtf?",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "but like, SAYS WHO. i don't do my dishes everyday. i don't have a dishwasher. i'll do them every other day-ish. it takes about them same amount of time, even though there are more, and i'm not leaving anything smelly or foul in the sink. i don't get what's so bad about leaving a few dishes in the sink.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 144,
                      "content": "In a house with two adults and two toddlers dishes pile up QUICK",
                      "id": 180,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 88,
                      "content": "My guess is it's on top of all the other stuff. Dishes in the sink aren't the worst but when you have grease on the counter, unwashed kids, filthy bedding, dirty doors, etc it makes all those little things add up.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "When it comes to having a family it means the sink gets full very fast.  We have a filter tap in the kitchen and if the sink is full I can't fill my water bottle or the hot water dispenser and it's a pain to wipe surfaces since I don't have the sink to work from.\n\nETA: Also means not being able to do much in the way of cooking etc and honestly I don't mind evening to morning dishes assuming it's cleared by breakfast time but a full day's dishes also gets kinda gross.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yeah, I'm definitely guilty of not being able to do the bare minimum sometimes (courtesy of mental illnesses) but I know it's not a normal thing to do and I'm trying to actively get better. I also don't have kids or pets to take care of, so my mess doesn't really affect anyone but me.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That's the thing though. I'm not saying I have never left dishes dirty for days - but op acting like leaving dishes for days is fine? That implies something about every other thing he said. Like I don't have a strong opinion on how often the floor is cleaned because some rooms need it more and others less, but I also don't have kids - I am instantly convinced that his floor is filthy because his dish standards are so fucked.\n\nYou might have a decently clean house, even when not fully caught up on it, or at least that's my impression because you have a standard (whether or not you achieve that standard daily).\n\nYTA op.",
                  "id": 184,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Yeah, I saw a few of these tasks and thought, “Yeah, I definitely don’t do that.”\n\nBut I also have a full time job and no kids. I got a dog and suddenly I started sweeping and mopping weekly because I didn’t like the idea of her being on a dirty floor. I imagine I’d jump up a notch for kids.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I have bad avoidant adhd, but I cannot let dishes sit more than 1 day. Must be done by the eod or at least next morning, unless we’re just gone all day. Maybe it’s the way I was raised, but dishes are done as I cook and then after dinner. But this way there’s a little at a time and nbd. \nWith a dishwasher it’s a problem at all. But dirty dishes piling up in the sink, greasy and with food bits, is asking for bugs and germs and smells.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "Picking up toys also helps them build healthy habits. When they are in school, nobody will have to beg or show them how to put them up because they have already been doing it at home.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "His wife's standards are too low because she's still married to this slob.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I have ADHD, am currently un medicated, and a 3.5 month old baby. I do all of the things OP’s wife does/wants OP to do.\n\nI feel like it’s a classic case of men who weren’t raised to understand the actual workload of keeping a household and a family up and running. So much work like cleaning house, bathing children and ensuring they have properly fitting and clean clothing every day is invisible work done by women. Thankfully it’s changing slowly, but I feel like this situation involves a lot of that.\n\nI wonder if the situation were reversed, how OP would feel? Coming home to a dirty house with basic cleaning not done and young children still in the clothes they slept in, unbathed. I guarantee a mother/wife would catch huge shit for that. Plus, I feel so much better when I’m clean and in a fresh set of sweats/shirt, even if I don’t leave the house that day. Why wouldn’t I do the same for my kid? She gets clean footie jammies every morning (since she’s still a baby.) Some days it’s okay, but I hate the feeling of sitting around in my pajamas all day. I like to feel ready for the day, and especially when you’re stuck at home inside, it’s an important distinction (for me anyways) to help me feel like the days aren’t just one long blur. I bet that structure is great for young kids too.\n\nEdit: typo",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "> The house should be vacuumed **like every other day** not even weekly \n\nDude or dudette, don't generalize every home. Depends on size of area, kids or no kids, single or not single.",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I'm getting evaluated for ADHD and my standards are like the husband's. FML.",
          "id": 191,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I think you’re giving him too easy of an out - it’s not that he finds it hard to keep up with the chores, it’s that he doesn’t see it as necessary (and seems to think doing so is insane)",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "My adhd definitely gets in the way of my part of the chores so I have reminders set for the dishwasher and we got a robot vacuum since I didn't make myself vacuum enough. Because even in my execution inadequacy I understand things should be clean, unlike OP, wth.",
          "id": 193,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I have ADHD and I have a lot of problems with keeping our home clean. But even I do more then he does.",
          "id": 194,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5176,
      "content": "Chum, I am an absolute slob, but for a house with kids in it, that schedule is totally reasonable. I shudder to think what the house and children would be like if she wasn't around. YTA.",
      "id": 195,
      "comments": [
        {
          "score": 1178,
          "content": "Also a slob but when my kids were crawling or playing on the floor all the time, my standards changed drastically. I’m back to slob now that they are older but for a time my house was pristine.",
          "id": 196,
          "comments": [
            {
              "score": 442,
              "content": "Yeah, mate. Major red flags that he doesn't feel compelled to do this stuff just by the presence of his precious children, like.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 146,
              "content": "oh and he doesn't want to take his shoes off either  \n\ndo you want your toddlers licking the street? because that's the equivalent of what's happening here",
              "id": 198,
              "comments": [
                {
                  "score": 24,
                  "content": "Oh my god wearing shoes in the house is so gross.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 10,
                      "content": "it really really really is. and like ok I get that it's culturally normative for Americans and like ok, if that's the life you want to live and you want to clean your floors more, go ahead\n\nbut if you have small children crawling around on those floors???? hearing that shit makes my skeleton want to yeet itself from my skin  \n\nI'm sorry that's just disgusting",
                      "id": 200,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 874,
          "content": "\"Extremely clean\" ok go on...\n\n\"Do dishes immediately, weekly bathroom clean vs leaving it for days\"\n\n...\n\nThis guy brought a kid into the world? And is a SAHD no less? Man got a silver tongue to convince his wife he could be a SAHD to begin with.",
          "id": 201,
          "comments": [
            {
              "score": 355,
              "content": "[deleted]",
              "id": 202,
              "comments": [
                {
                  "score": 179,
                  "content": "Yeah I was thinking it was going to be dishes after every meal, washing all towels and sheets daily. But all the things he mentioned are my standards, and I don’t think of my house as super clean",
                  "id": 203,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Same. My cleaning schedule is nearly identical to OP’s wife and my house is by no means pristine. It’s very lived in - always a little clutter, dog hair in the corners, some schmutz on the kitchen counter… It takes a lot of work just to maintain a house - to keep it from slipping into a worse state than it is already, let alone cleaning such that it is nicer than it was before you started.",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "i almost threw up when he said he was fine with dishes being there for 2 DAYS, my mother would kill me if i let it for more than hour",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "I love reading things that remind me of my ex husband and then realizing he's my EX 😍",
          "id": 206,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "Dude I was like \"I live in squalor\" then I read this post and I'm like \"oh ok so I'm a fairly clean person\"",
          "id": 207,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Same, no kids but my parents made me and sister the only cleaners growing up and had to clean 3 times a day (before school, after school, and after dinner) so now I absolutely hate cleaning.  Even I wash my dishes daily, I was expecting this post to be unreasonable but she is absolutely not, especially since you have children.  YTA",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "They are in their PJs all day too it sounds like. Are they even leaving the house?",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3298,
      "content": "Every single thing you listed as her cleanliness standards are very reasonable in my book - they are the same standards I have in my home. If I had children, they would likely be stricter since kids touch everything, put stuff in their mouths, roll around on the floor, etc. In my book, I would consider you a slob. \n\nRight now, you're wife is coming home to a place where she doesn't feel comfortable living in. Regardless of how *you* feel about cleanliness, SHE ISN'T COMFORTABLE IN HER OWN HOME. That, in my opinion, supercedes your disagreement about cleanliness standards. Think of how you would feel in her place.\n\nFrom what I'm reading here, you're a SAHD and you're not keeping up your end of the bargain. If you don't think you should clean that often, then she's right - you should go back to work and hire someone to help keep your house clean. \n\nYTA",
      "id": 210,
      "comments": [
        {
          "score": 932,
          "content": "> Regardless of how you feel about cleanliness, SHE ISN'T COMFORTABLE IN HER OWN HOME.\n\nExcellent point. His wife is telling him something and all he can muster is, \"Well, it's her problem, not mine.\"\n\nHe's weaponised incompetence. It's malicious.",
          "id": 211,
          "comments": [
            {
              "score": 382,
              "content": "This post screamed weaponized incompetence, and to make this even more ridiculous, most stories of people using weaponized incompetence use their career responsibilities as a shield. OP’s wife is the sole breadwinner who works insane hours and ends up having to do all the shit in the house too, because her husband with no job and no sense of cleanliness can’t get up off the couch to bathe his own children. \n\nThis post just infuriates me so much.\n\nedit: As a generic response to some of these replies - nothing OP has written here indicates that he keeps a clean house or cleans his children on a normal basis. Kids play outside and get dirty; it's very normal to clean yourself every day (and honestly obligatory for most adults IMO, even if not washing hair). He didn't clean dishes for the entire day; washing dishes after a meal has never taken me more than 10 mins unless I have to soak it. He doesn't clean the bedding regularly, vacuum regularly, pick up after his small children (which is part of childcare), or take in the trash cans, which takes all of a minute. None of the tasks his wife asks him to do that are mentioned here are arduous or excessively time-consuming. He even left the kids in their pajamas instead of putting them in clean clothes! What \"hard work\" is OP doing all day if he's not regularly cooking, cleaning, or taking care of children, which housewives have been expected to do since the concept of it began?",
              "id": 212,
              "comments": [
                {
                  "score": 119,
                  "content": "Me too.\n\nI was a STAHD for 13 years.  I can't imagine keeping house this poorly.\n\nWeaponized incompetence is correct.\n\nBONUS:  It's horrible when people just don't ducking listen to their SO's.  His wife, who he's supposed to love, is telling him over and over that she's unhappy, and he's ignoring it.  (But he listened to Reddit?!?!)",
                  "id": 213,
                  "comments": [
                    {
                      "score": 62,
                      "content": "> (But he listened to Reddit?!?!)\n\nLol, I dunno. He said, \"I'll see what I can do.\" It's a start, but I'm not sure he realises the gravity of what he (didn't) do. His wife *took the kids*  and is staying with her mother. That's, like, divorce territory.\n\nThe guy's a knob.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "What got me is that he complained that she CHOSE a 40-80hr job because it's fun???",
                  "id": 215,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This gets me too. Why can't he get a job and then evenly balance the chores? She's working overtime and comes home to an uncleaned house and children, which are really the only two areas he needs to worry about on an everyday basis as a SAH parent.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Let’s not forget his failure to model putting toys away for his children. Ugh my ex was a lazy lazy SAHD who eventually called me a strident bitch for telling the kids to put their shoes away every day when they got home from school. Poor guys are young men now and they had to teach themselves how to take care of their stuff properly.",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "AND calls her crazy... I agree with the wife. He should go back to work and hire someone who can take better care of their home and kids.",
              "id": 218,
              "comments": [
                {
                  "score": 30,
                  "content": "And it's particularly galling to hear him say, \"I didn't know what she was like before we got married!\"\n\nSo, what is he trying to say? Does he mean that:\n* He would have cancelled the engagement with her if he realised she was clean? How do you even tell that story? \"She was so tidy! I couldn't take it, so I broke her heart.\"\n\n* He wouldn't have had children with her? Did he not have five minutes between discovering this apparently massive deal-breaker and impregnating her?\n\nPeople leap into procreating without discussing *how* they want to raise their children.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I also think it's quite funny because her standards are really not exceptional. I'm a messier than average woman. I don't think her list is excessive even if it's more frequent than mine, and I think if I had small kids roaming around I'd understand about the floors especially. Where does he think he's gonna find another woman who is happy living in the mess?",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 431,
          "content": "Right. And “she works 40-80 hours a week but she does it to herself” 😳 no my guy, she does it so you can stay home and you can’t even get your fucking arse off the couch to wash your kids every day and keep their environment safe and liveable.",
          "id": 221,
          "comments": [
            {
              "score": 50,
              "content": "Of course she works 80 hour weeks. You’re unreliable and there are children!",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "His poor wife has to come home from a long day at work and immediately has to start doing very simple cleaning tasks that should be done during the day. His kids are 2 and 1 those are messy ages if you let the mess grow you’re gonna have sick and dirty kids",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2307,
      "content": "YTA. I thought she was going to turn out to be a crazy person who wanted to clean the tile grout with a toothbrush twice a week and be able to eat off the floors at a moment’s notice. Doing dishes daily, cleaning the bathrooms weekly and not wearing shoes in the house are perfectly normal standards. Yours haven’t achieved dangerously disgusting, but they are on the slobber, yuckier end of the normal spectrum. I usually think couples with differing standards need to find some reasonable compromise, but you lose points with me for not even trying and for painting your wife as someone whose standards are extreme.",
      "id": 224,
      "comments": [
        {
          "score": 469,
          "content": "Right? Doing dishes and bathing babies/toddlers every day are normal things that most people do if they can. Sure, if things get crazy, sometimes dishes are left a day, but this would be an exception. OP is pretending he doesn't care because he knows his wife cannot relax and will do it when she gets home from work, no matter is she's already had a 10 or 12 hour work day. \n\nYTA - You are only being asked to do a normal, basic, stay-at-home parent routine. Nothing about it is exceptionally picky and you pretending that you don't understand is a blatant attempt to get out of doing the work.",
          "id": 225,
          "comments": [
            {
              "score": 99,
              "content": "You really shouldn’t bathe babies everyday. That is really bad for their skin. If you really want to talk to your doctor first they are more than likely going to talk you down on that. “Tops and tails” everyday and a bath 2-3 times a week is normal and healthy.",
              "id": 226,
              "comments": [
                {
                  "score": 25,
                  "content": "Newborn babies, yes. Toddlers not so much",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I guess this depends on your country. Daily baths for babies is the doctors recommendation for Caribbean.\n\nIn our culture we bathe twice per day, (its humid and hot) but minimum once and we do not struggle with dry skin issues",
                  "id": 228,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Actually bathing daily is known to be bad the skin. It could be harmful for young children especially if they have naturally dry skin. That whole “shower everyday is ideal” thing has also been debunked. Otherwise this OP definitely qualifies as a slob",
              "id": 229,
              "comments": [
                {
                  "score": 9,
                  "content": "But if they're not being bathed every day (or at least rinsed), he needs to wash the sheets way *more* than once a week, not less! Kids are honestly gross. I don't have them, but I used to nanny. We never got to the end of the day with the kid not having dirt, food, etc all over her. Those sheets are going to get gross fast!",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 182,
          "content": "What gets me is that OPs wife has already tried to compromise too, by suggesting OP returns to work in exchange for a cleaner and a nanny. If he’s truly struggling to keep up with housework then that’s a reasonable compromise to suggest. \n\nNot sure what OP is wanting to get from this whole situation but he seems unwilling to adjust to his wife’s reasonable cleaning standards and also unwilling to outsource. His poor wife.",
          "id": 231,
          "comments": [
            {
              "score": 67,
              "content": "> Not sure what OP is wanting to get from this whole situation\n\nA mother, who also supports him financially (apparently).\n\nI bet he complains when his wife says she's too tired to be intimate, too, LOL\n\n\"I'm here all day with the kids, by myself, and we finally get a minute to spend together at the end of the day but you decide you have to do dishes or mop the floor and then you're too tired to have sex!!! What about MEEEEEEE!\"",
              "id": 232,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "He wants to play big bro w some babysitting and light chores and let mom do all the breadwinning and the lion share of cleaning. Wackkkk",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Well if my ex is any indication, the big payoff is to become one of the kids. Mommy do it! Mopping is poopy!",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "> I usually think couples with differing standards need to find some reasonable compromise\n\nNotice how OP blamed not living together before marriage? So what happened to the intervening period between moving in together and having children?",
          "id": 235,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Yeah I agree. Being a stay at home parent is really hard, and it might be unreasonable to expect everything to be 100% pristine at the end of the day. Sometimes there might be a couple dishes in the sink or some toys left around, especially with a 1 and 2 year old. But bathing the kids has to be done, and chores shouldn’t be left alone for days at a time. Vacuuming and mopping the spaces where the kids are playing is a must. There’s a reasonable middle here between their two standards",
          "id": 236,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1656,
      "content": ">She hates dishes in the sink while I’m content to let them sit for a couple days.\n\nBacteria starts growing on dirty dishes within 30 minutes. \n\nYou are disgusting and yes, YTA.\n\nETA: OP updated and commented he needs to \"help\" out more around the house. What needs to do is *take more responsibility* for the house. The wife is working 40-80 hours a week and OP is a SAHD. Saying he needs to \"help\" more means he still thinks of it as her responsibility and he's just helping. \n\nOP doesn't need to be *solely* responsible. The wife is an adult and it's her home and her kids too so yes, she needs to participate but they need to figure out an equitable partnership.",
      "id": 237,
      "comments": [
        {
          "score": 329,
          "content": "Also, they start to get that lovely musty smell when they've sat for more than a day 🤢",
          "id": 238,
          "comments": [
            {
              "score": 71,
              "content": "And even harder to clean with the caked on food!",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "Nearly spit out my tea when I read this part.",
          "id": 240,
          "comments": [
            {
              "score": 9,
              "content": "Good on the OP for accepting he’s the AH, taking responsibility, and apologizing. I’ve never seen that happen on one of these before.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yeah, this was what got me too. How anyone thinks it’s unreasonable for their partner to come home from work and expect YESTERDAY’s dishes to have been cleaned is beyond me.\n\nAnd the trash cans still outside after two days?! Just lazy. This would take him 3 minutes.\n\nSame with the bedding. Let’s see - 2 minutes to strip the bed. A minute to load the washer. A minute to swap into the dryer. 5 minutes to make the bed. Let’s round up to 10 minutes. How is this too difficult?\n\nOP - make a schedule. Use your children’s nap time to take care of your other SAHD responsibilities. Keeping your children alive isn’t the only thing on your to-do list. For example:\n\nDaily: Clean dishes and kitchen countertops; put toys away and generally tidy things out of place; bathe or scrub down kids\n\nWeekly; trash and recycling bins on their assigned days\n\nMonday: Children’s bedding; scrub bathroom 1; mop kitchen floor\n\nTuesday: Children’s clothes laundry; scrub bathroom 2\n\nWednesday: Adult’s bedding; vacuum downstairs; sweep kitchen floor\n\nThursday: Adult’s clothes laundry; vacuum upstairs\n\nFriday: Bath and kitchen towel laundry; mop kitchen floor; one-off monthly tasks (clean out fridge, etc.)\n\nYou could get this done in 90 minutes a day, have a tidy home, teach your children responsibility and duty, and save your marraige. Think of how much your wife is working. Why aren’t you doing this?\n\nYTA",
          "id": 242,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Also, how many dishes do they have that they can’t just continue to have them pile up for days before needing something again???",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "And also incredibly hard to get stuff off as it’s hardened and crusty.",
          "id": 244,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "My mother used to do this when I was growing up. I still remember the horrid smell and how awful it would be when she forced me to do the dishes instead of doing them herself.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Is this true? Like, if It takes me 45 min to eat a plate of food there’s already been bacteria growing on it for 15 min? Is it once the heat source is removed? I’m honestly really intrigued by this.",
          "id": 246,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": ">OP updated and commented he needs to \"help\" out more around the house. What needs to do is take more responsibility for the house.\n\nTook the words right out of my comment box. OP needs to take responsibility and be the lead on any household chores and maintenance. That doesn't mean the wife takes no responsibility, just that OP is the point person, as the one who's home, supposedly raising the kids all day.\n\nKeep your kids' environment healthy FFS. If your wife disappeared tomorrow, all those chores would still have to be done. So do them! Imagine your wife is not involved in household stuff at all. Then do it yourself! I guarantee there will still be chores she will do too.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 864,
      "content": "YTA. \n\nEvery single “crazy” clean thing you mentioned except having shoes in the house is a basic expectation I have and I consider myself fairly messy.\n\nNot bathing your kids daily gets me. The bath EVERY NIGHT after my daughter gets out of it has dirt on the bottom that I have to rinse. Not cleaning your kids is seeing them up for bullying and health problems.\n\nAnd leaving the dishes for a couple of days in the sink is disgusting. Max 12 hours (you can leave it till morning on occasion). \n\nGet your act together.",
      "id": 248,
      "comments": [
        {
          "score": 361,
          "content": "If you bend on the shoes in your house bit you won’t have to mop every 2-3 days. Blows me away that people wear shoes in the house. It makes your house so incredibly dirty.",
          "id": 249,
          "comments": [
            {
              "score": 69,
              "content": "It’s such an American thing I swear no one else wears shoes in the house. I moved to Thailand and people were explaining how it was rude to have shoes on in someone’s house I’m like - same thing in Canada? Isn’t this everywhere? And then I started noticing shoes in sitcoms like ???",
              "id": 250,
              "comments": [
                {
                  "score": 9,
                  "content": "Ireland. People wear shoes in the house in Ireland. I moved over from Canada and I've had people laugh at me when I take off my shoes at the door. And people are always confused when I ask them to take off their shoes in my place.\n\nIt is *wet* here. My shoes are always wet, they are always muddy. I don't want to be cleaning the floors every day!",
                  "id": 251,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I have separate house shoes that I don't wear outside, but I have to wear shoes or my feet kill. I cannot spend more than like 30 min walking around the house barefoot without a lot of arch pain.",
              "id": 252,
              "comments": [
                {
                  "score": 70,
                  "content": "House shoes aren’t shoes shoes, they’re only referring to taking off your outdoor shoes",
                  "id": 253,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I keep a pair of inside Crocs for this reason",
              "id": 254,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It’s insane. Why Americans don’t join the rest of the world and remove their shoes is wack! I grew up shoes off and my house is shoes off. Shoes are nasty and track dirt and bacteria. Hard no. Plus it makes cleaning easier.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I come from a country where wearing shoes at home is absolutely not normal unless someone is coming over to fix something or do other official job. People who live there, guests - shoes off, full stop. I can't imagine wearing shoes at home and that apparently it's the standard in some places. Disgusting lol.",
          "id": 256,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I’ve discovered I may be disgusting.  I have a dishwasher and I live alone, so I don’t go through enough dishes each day to fill it up and not waste water running it.  I rinse dishes/cutlery and pop it in and run it once it’s full… usually 3 days. \n\n…is that really gross?",
          "id": 257,
          "comments": [
            {
              "score": 66,
              "content": "Absolutely not, that's normal. Big difference between dirty dishes in the sink and rinsed dishes waiting for a full machine. You are doing fine, the dishwasher should be full before running it to save money.",
              "id": 258,
              "comments": [
                {
                  "score": 9,
                  "content": "oh thank god",
                  "id": 259,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Totally not. Doing dishes here means letting dirty dishes sit in the sink. If you rinse / put them in the dishwasher until you have a load to wash, you're doing perfectly fine. :)",
              "id": 260,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Did you know that running your dishwasher actually uses less water than handwashing? If you run your dishwasher every night vs handwashing for even a few minutes, you will save around 100 gallons of water a week.",
              "id": 261,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Don’t be tracking outside dirt into the house when you got kids crawling round on the floor, they will be inhaling and possibly putting their face into whatever has been on the pavement outside, that’s bad. Outdoor pollution lands on every surface and that gets tracked into your home on your feet as well. Not to mention if there’s any faeces traces that can make your kids sick, and if they contain toxoplasmosis it can make your kid go blind.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 672,
      "content": "Your bar for cleanliness is so low it may very well be subterranean. Dishes in the sink for days, grease/food stains all over the kitchen, and cleaning the floors every two weeks? You'll soon be spending your days entertaining some tiny little beings. And I do not mean your children. YTA.",
      "id": 263,
      "comments": [
        {
          "score": 125,
          "content": "Lol I don't even have kids or pets and I still vacuum the floor once a week.\n\n2 kids *and* 2 adults and he wants to do 2 weeks!?  🤢",
          "id": 264,
          "comments": [
            {
              "score": 12,
              "content": "2 kids and 2 adults are just the *humans* in the home if OP keeps this up...",
              "id": 265,
              "comments": [
                {
                  "score": 6,
                  "content": "If there are non-insect pets in the house, 100% chance it’s disgusting after 2 weeks",
                  "id": 266,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I have an 8mo and a 10yo and if i don’t vacuum, sweep and spot mop 1-3x a DAY we live in the land of cracker crumbs, bits of cheese and flung raspberries",
              "id": 267,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}