{
  "post content": "This happened last year but since it still gets brought up during arguments every now and then and I just discovered this Subreddit I decided to check what you guys think.\n\nMe and my wife have two children (15F & 11M). My wife is a stay at home mom since the birth of our second child. I (46M) work full time and earn a six figure salary. My job is highly stressful, requires me to travel a lot and mostly sleep in hotels. I only get to come home to my family on every second weekend, on average. Despite working a lot, I am glad to do it so that my family can live a comfortable life.\n\nLast year, I decided to buy my wife a Roomba for Christmas. My wife tends to be the one who vacuums the house so I presumed that she would like this present as it would free her of this chore.\n\nAs she unpacked the present, she was heavily offended and did not hesitate to show it, which made the whole situation quite uncomfortable as my parents and other members of the family were also present. She argued that 'this should not be a present directed at her but at the whole family, as it is the entire family’s responsibility to clean up the house'.\n\nSince I work and am the sole source of income in the family and she is a stay at home mother, I think it is apparent that she should take on responsibilities such as taking care of the kids and maintaining the house. The gift was intended to somewhat relieve her of this burden. I, personally, would have loved to have received a Christmas gift that would have somehow made it possible for me to spend less time working. As cheesy as it sounds, I think that time is one of the most precious gifts and that Roomba would have definitely bought some time for her - time that she could use to do whatever she pleased instead of vacuuming. \n\nUnfortunately, one year later, this still often gets brought up during arguments, often coupled with her crying.\n\nSo, AITA in this situation?\n\nEDIT: I should also add that I would have never gifted my wife a vacuum cleaner or anything along these lines. I saw the Roomba as a robot that would fully take over this task which is why I thought it was a good idea.\n\nEDIT #2: I asked her numerous times before Christmas last year what she would have liked to receive and she repeatedly told me that she does not want anything. I was left to guess and chose the most practical gift that I was certain she could be able to make use of.",
  "id": 1,
  "comments": [
    {
      "score": 9866,
      "content": "YTA: that’s a gift for the household and not her. It shows you primarily regard her as a housekeeper and not a partner. What interests does she have that are not about serving you and the family?",
      "id": 2,
      "comments": [
        {
          "score": 28429,
          "content": "Seriously? I’d be giving my husband daily blowjobs for a month if I got a Roomba for Christmas. It would free up some time for me, possibly terrify the kids into keeping their crap better picked up, *and* fuck with the dogs at the same time. \n\nOP, this is a NAH sign of miscommunication. You saw it as something nice that takes a duty that she generally manages off of her plate. She sees it as proof that you view her as a glorified cleaning lady. \n\nI suspect that the Roomba isn’t the problem. It’s symbolic of whatever other miscommunications are present in your marriage.",
          "id": 3,
          "comments": [
            {
              "score": 7558,
              "content": "You are probably right. We do have a lot of issues in our relationship. This just happens to be one of the main things brought up during arguments which is why I posted it.\n\nBut I totally agree with you about the freeing up time factor, that is exactly what I had in mind when I purchased this present.",
              "id": 4,
              "comments": [
                {
                  "score": 6682,
                  "content": "She probably brings it up because it's the clearest illustration (in her mind at least) that you don't value or understand her. Talk to your wife and then *listen* to your wife.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1669,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 420,
                      "content": "Especially since he constantly had to ask her what she wants. You've been with her for a long while, you have kids together, you have to know some form of interest or hobby or anything that brings her joy.\n\nLike a roomba is a nice gift, but it brings the allusion that all he knows about his wife is that she likes to clean the house. Gotta do more effort than that for Christmas.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "It’s obvious why that happens. He spends 26 weeks away. Unless you have flawless communication and trust that isn’t going to be able to happen with minimal issues.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Reminded me of this -  “Most people do **not listen with the intent to understand**; they **listen with the intent** to **reply**.” —Stephen R. Covey",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1438,
                  "content": "I'm going to be real and it seems like you guys are really beating around the bush around your dissatisfactions in your relationship. Earlier, you mentioned some offhand comment that came off as resentment for being the sole earner in your household and not being at home as much. And it seems that she isn't coming forward and being totally honest about her satisfaction about being a stay at home mom, and ESPECIALLY not being able to use a law degree anymore.\n\nYou two really need to sit down and actually communicate desires and what you want out of this marriage, not only for each other, but your own personal lifestyles as well.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1367,
                      "content": "It's not just that she is a stay at home mom.\n\nShe is a single mom 26 days out 30. He is only home every other weekend.\n\nIf that had been a present for the house yes, that's fine\n\n But a present for her says cleaning is her responsibility. Imagine if she gave you tickets to a.seminar about how to ask for a raise for Christmas. Just reducing you to your job and you being a pay check. That wouldn't feel great, would it?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 571,
                      "content": "Honestly, I can’t imagine what it would be like to see your chosen life partner that little. It’s no wonder their relationship is struggling - not everyone is on board with that!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Oh man I missed whatever comment included the law degree part. Yeah no shit she's pissed. I've had relationships end because it was expected that I'd give up my engineering career to support whatever my SO wanted for his career. And I just was not into that. I went to school for years for a reason. I picked my field of study for a reason.\n\nA good friend of mine just left her career after her second child to be a full time stay at home mom and she's seriously struggling with the entire thing. She's constantly posting things on Facebook that feel like she's trying to convince herself more than others that she's totally happy with this decision. She posted photos from her husband's MBA graduation captioning how she was so proud to play the supportive wife role and allow him to continue on his career journey. And she's constantly talking about how this is God's plan and when she's having doubts she just has to remember this role is just as important.\n\nI'm not saying it's not hard to be a mom. It's one of the reasons I don't want kids. But as I've entered my early 30s and watched women friends continue to leave their careers, careers we talked endlessly about pursuing while in college, it can be sad to see that given up when it's clear that they aren't 100% in for that. I know plenty of women who have wanted to be stay at home mothers from day 1 and that's absolutely awesome. It's when your friend talks about one day becoming a VP at Medtronic and then 8 years after graduating leaving her career to stay home and sell garbage MLM lipstick that it feels less genuine.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 560,
                  "content": "Your \"practical\" gift comment in your edit is also strange. How about for someone who is normally on her feet taking care of the house you give her a gift card for a massage, or a facial, or some lavender scented lotion to relax? Gift giving is not always about being practical.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 189,
                      "content": "It's not that strange, that's just how some people think. I value practical gifts more than any other kind of gift and it's my go-to when gift-giving as well. I'm guessing OP thinks this way too.\n\nBut OP needs to realize that people like us need to empathize with the other person and see things how they see it, even if it seems illogical to us. Marriage between a Thinking person and a Feeling person (by the Myers Briggs standard) is a big learning curve for both parties, and if either party is too inflexible, it's not going to be a fun time.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 460,
                  "content": "Well if you talk to her like you talk about her I can understand why she's mad , I understant you work a very stressfull job but that dosen't give you the right to treat your wife like a servent , you maybe don't realize it bit you kind do , it's not easy to stay at home and take care of everything . You giving her a vaccum it's saing that is the only way you see her , you could of bought the vaccum for her on another day a normal day but on christmas is just ugly .",
                  "id": 16,
                  "comments": [
                    {
                      "score": 261,
                      "content": "Yep, being a single stay at home mom by profession could be more work in reality than you think you have to do with your six figure job. She also can’t just decide to change what she wants to do because she is dependent on your income. Some nannies in certain households may get paid more than you do at your six figure job. If the role was reversed and you were a stay at home dad with all your professional experience and she was a busy legal expert traveling the country and she got you a roomba for Xmas how would you enjoy it? You would probably think to yourself if you wanted that you would get it yourself. That’s not a gift it’s a supply. You might as well get her a garbage disposal for the anniversary because she is the one using the sink most of the time.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 233,
                  "content": "[removed]",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 216,
                  "content": "Was the Roomba the only thing you got her? My dad, sister and I went in on a roomba for my mom one year, but that was one gift of many including some nice jewelry.  If you got her other things it’s an overreaction imo, but if that’s all she got? Well.... that’s not a very fun gift to get.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I mean, if I got one I think it would be fun, but that’s because I like robots and I think my cat’s reaction to it would most likely be pretty funny. But if it’s just gonna be used for cleaning, you’re right, that’s not fun at all.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 212,
                  "content": "Gee, i wonder why you have issues in your relationship?\n\nYou don't seem to understand the connotation here. You don't ever buy your wife a gift so she can do more work around the house. I can't even imagine if i got my Roomba for my wife's xmas present, it wouldn't be good.\n\nedit: i just got to say, you literally said this specific issue keeps coming up. She's apparently communicated this to you for a while now and so you double down and buy her a vacuum to do more work with? It's almost like you want her to think you look at her as your servant. You can't on here for justification and you'll never find it, because your actions are grossly unjust and you are acting in the exact manner your wife apparently has told you that she can't stand. What could possibly be wrong here?",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 176,
                  "content": "[deleted]",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 151,
                  "content": "Do you consistently criticize her for not accomplishing as much as you would like her to? Because if you regularly say “you didn’t get xyz done today” or are visibly annoyed when she doesn’t do “enough” you are a MAJOR asshole who gave her a pretty aggressive, cruel gift. By all means buy it and explain why. Just don’t make it a Christmas gift.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 33,
                      "content": "The guys home like 4 days a month, I doubt he gives a shit how much she gets done in a day lol",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "He would need to actually be home in order to do that",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 147,
                  "content": "It’s literally a cliche: the clueless, unkind husband who buys his wife a vacuum cleaner for Christmas. Like, it’s a *trope* OP. It’s like a common sitcom thing.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2034,
              "content": "Can you please stop perpetuating the idea that women should be paying their husbands in sexual favours for anything nice they do for them? Its freaking annoying.",
              "id": 27,
              "comments": [
                {
                  "score": 1555,
                  "content": "No don't you see she's one of the Cool Girls! Not like those dumb other girls that don't appreciate practicality.\n\nSrs I hate that mentality. I always assume it's either a man pretending to be a woman or a woman who desperately wants attention.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 977,
                      "content": "There’s always one girl who shoots up to say “well *I* wouldn’t do that! I’d give out so many bjs if that happened to me!” and I honestly don’t get it. So what if you wouldn’t react that way? Everyone is different and just because you are a certain way doesn’t mean it negates the validity of anyone else’s feelings.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 469,
                      "content": "Yep, and male redditors eat that shit up with a spoon. It's gross.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": ">I always assume it's either a man pretending to be a woman\n\nI seriously thought they were a dude. Because this sounds like such a joke: \"I’d be giving my husband daily blowjobs for a month if I got a Roomba for Christmas.\" Lmfaooo\n\nI have my doubts that they're actually a woman.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "BlOw JoBs fOR RoOmBas!",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "What’s up with all the colo-rectal surgeons on his thread? Is that just a randomly assigned tag or something?",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 608,
                  "content": "Wait, you mean sex isn't a payment we begrudgingly offer to the men in exchange for goods and services? What are you going to say next, that sex is something women should enjoy, too? Ha! What a farce.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 385,
                  "content": "Yeah, it really feeds into men feeling entitled to sex acts by doing something slightly nice or even basic. Which is why a lot of marriages struggle because the husband thinks he punched the clock and occasionally empties the trash, why doesn’t his wife take a break from raising the kids to buy some sexy lingerie and a bdsm swing to help him remember their steamy romance from two decades ago? \n\nHey, if you do pay basic human decency with sex, cool, but at least don’t act shocked if others don’t.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 346,
                  "content": "I can't believe that garbage comment got so many upvotes just because it mentions daily blowjobs and all the sexually frustrated teenagers in this sub want it to be real, Guess what guys, Most real people don't use sex as some sort of currency in their relationship, Women particularly don't just put up with sex and blow jobs in the hopes of receiving shiny things and vaccum cleaners",
                  "id": 36,
                  "comments": [
                    {
                      "score": 39,
                      "content": "yeah..but some men of Reddit like to believe that there’s some dream woman out there who would suck him off 31 days straight if they got her a 250$ cleaning device so like.... upvotes and golds galore! \n\nIt’s so predictable it’s painful.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 328,
                  "content": "I felt gross reading her comment, honestly. Thanks for pointing it out. Women aren't sexual objects.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 190,
                  "content": "Gotta get those upvotes from horny Reddit dudes somehow.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 157,
                  "content": "It's also gross and piggish. My husband got me a private gift I really wanted, for my sexual pleasure. That is a gift I might give him a little extra sexual attention for.  But, he wouldn't ask me to give him extra BJ's or anything.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 721,
              "content": "But the kids are freaking 15 & 11, they should be helping keep the house clean as well.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 618,
              "content": "C’mon, almost every man learns growing up never to give any sort of home appliance to his wife for Christmas. That’s like Husband 101.",
              "id": 42,
              "comments": [
                {
                  "score": 102,
                  "content": "It was early in our relationship when my husband put a laundry hamper and a few other things he wanted for our house on my “list” for his parents. I gave them a list of books I wanted and didn’t realize then that they don’t like to give books. That was the first and last year my husband used my list for household stuff that he wanted lol!",
                  "id": 43,
                  "comments": [
                    {
                      "score": 182,
                      "content": "They don’t like to give *books*? I can’t imagine the mindset of someone thinking a book isn’t an appropriate gift but a laundry hamper is.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "If your husband wanted them he should have asked for them for himself. And your inlaws should have sucked it up and bought you the books because it's about making the receiver happy, not the giver's feelings! I hope you have a good or at least bearable relationship with them otherwise.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "That's fucking stupid. People should get their spouse what they think they will want regardless of what category that falls into.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 359,
              "content": "> It would free up some time for me, possibly terrify the kids into keeping their crap better picked up, and fuck with the dogs at the same time. \n\n\nIt's still not a present though. That's a household investment for both of you. The total amount of chores of the entire household went down.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 347,
              "content": "blow jobs... for a vacuum?",
              "id": 48,
              "comments": [
                {
                  "score": 172,
                  "content": "[deleted]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 10,
                      "content": "What about blowjobs *from* a vaccum",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 49,
                  "content": "Gotta get upvotes somehow",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 173,
              "content": "I disagree. If you get married and you don’t know that your wife doesn’t like practical gifts, you are a bad partner.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 95,
              "content": "I agree. I don't think this is about the Roomba at all. This is something else and the Roomba brought out the anger from the wife. I think she is hurting because OP is gonna a lot.",
              "id": 53,
              "comments": [
                {
                  "score": 15,
                  "content": "I think she's hurting because it's been a loooooooooooooong time since he told her she was still beautiful, still #1 in his heart, still the one he wants to hug and snuggle, etc.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I agree. She probably feels like nothing more than a housekeeper and babysitter.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "[deleted]",
              "id": 56,
              "comments": [
                {
                  "score": 22,
                  "content": "It honestly makes me sick to see it so heavily upvoted. Reddit fucking sucks man.",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Thank you for helping me regain my sanity. This is so fucking depressing. 26k upvotes for u/ClothDiaperAddicts (lol) who actually says \"I’d be giving my husband daily blowjobs for a month if I got a Roomba for Christmas.\" Ick. I agree that this is an extremely bleak and gross view of marriage. Reddit misogynists will do their thing, I guess. In a healthy marriage you would give blowjobs because you care about your partner's sexual satisfaction, not as a \"reward\" for getting a vacuum. Jesus.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Sis you need help cuz that was the most pick me shit I’ve read in the longest time and I just came off twitter 🤮",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 641,
          "content": "YTA\n\nOP, had you realized it offended her and apologized instead of defending it I feel like it would have been more of a NAH. \n\nRegardless of whether you personally would have enjoyed the gift or not, she didn’t like it and told you it offended her. I see how it comes off to her that you think of her as the housekeeper and not your wife, however, you could have redeemed yourself and apologized. You didn’t which further implied the original thought of her being just a housekeeper.",
          "id": 60,
          "comments": [
            {
              "score": 176,
              "content": "Are you implying that being calm and collected will result in better communication and fewer problems? That’s an absolutely absurd thing to say. /s",
              "id": 61,
              "comments": [
                {
                  "score": 5,
                  "content": "I love the \"/s\" lol can never be to cautious for Reddit.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 83,
          "content": "Idk, I looked at it the opposite way. Like \"here, have this machine that will clean automatically so you don't have to play housekeeper as much and can have more free time to do anything else\". It's not like he got her a mop and a broom, a roomba cleans stuff automatically afaik",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "My parents have a policy against giving practical gifts. My mother grew up very poor and didn't get to have many fun presents, so she understandably feels sensitive about it. On the other hand, my fiance doesn't mind at all. I try not to give her practical gifts either though, just because the chance for resentment is too easy. Honestly, practical gifts are not normally the most thoughtful.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": ">What interests does she have that are not about serving you and the family?\n\nHe doesn't know. He only sees her every two weeks.",
          "id": 65,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I like how some of the replies disagreeing with you say they would love to give their wife a roomba to free up a chore. But none of them say they would physically take over the chore to free up some time for her.",
          "id": 66,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8639,
      "content": "YTA. This is a rookie mistake. Husband thinks \"wife will appreciate a machine to make her work easier,\" wife thinks \"my husband sees me primarily as a housekeeper and not as a romantic partner.\"\n\nIf you want to relieve her of this one burden, that's a nice thought, but don't make it a Christmas gift, make it a contribution to the welfare of the household. That's what your wife meant when she said \"this should not be a present directed at her but at the whole family.\"",
      "id": 67,
      "comments": [
        {
          "score": 5437,
          "content": "This exactly.\n\nAt work, your bosses should supply things needed to get the tasks done.\n\nTo OP...You're absolutely NOT the boss of your wife, but you could consider the two of you joint CEOs of the house. So just as the cleaning supplies are paid for our of the household budget, machines to clean/maintain the home should also.\n\nChristmas, especially if you can afford to, is often seen as an opportunity to give gifts the other person would enjoy, gifts that may be frivolous. Not a Roomba, unless the recipient specifically asks for it.\n\nOP, YTA. Especially since you seem to refuse to see her point.",
          "id": 68,
          "comments": [
            {
              "score": 3524,
              "content": "This seems to be one of the most convincing things I have read here. Thank you for putting it into this perspective, now I can understand better why it hurt her feelings.",
              "id": 69,
              "comments": [
                {
                  "score": 711,
                  "content": "I'm glad I could help you to see a different perspective.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Good job buddy.\n\nYou stared directly into that asshole and the asshole *blinked*.\n\nNow go wash your hands, nobody likes pinkeye.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I love reddit",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 528,
                  "content": "I really think your heart is in the right place. My partner knows I would love a Roomba, because I think robots are adorable, but I would not be happy with something like a steam cleaner as a gift. Even if it made my life easier, it wouldn't be something I would see as a gift. It sounds like she wants you to see her as a person, and she wanted a personal gift. Something she would *want*. Not as a wife or a mother, but just as her.  \n\n\nDoes she have a pinterest? Buy stuff from there.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yeah I feel bad for him because I do get the thinking, but it just depends on the person. I got my wife an automatic Espresso maker, which I think is along the same lines as a roomba, and she absolutely loves it. But someone else might expect jewelry or a weekend trip or just something more personal.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Stick googly eyes on your roomba. Mine has massive glow in the dark ones. Makes it even more adorable!",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "What did you get her this year?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 128,
                      "content": "Socks.",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 107,
                      "content": "OP replied he got her a MacBook",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "A dishwasher",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "I feel like it might be useful to add—she’s still upset and crying about this a year later, so then you take to the internet to see if you’re right? Does it matter if you’re right or not? \n\nYou hurt her feelings, and whether or not the blame can be placed on you does not take away from her being upset. She’s your partner, you should want her happiness over wanting to be right, and the fact that you are still arguing this a year later is concerning. \n\nChalk it up to a miscommunication/misunderstanding, apologize, and think of a thoughtful gift for this year that shows you understand her/her hobbies/her likes and dislikes, and that you value her as a partner. She shouldn’t have to ask for a gift—that’s not the point of Christmas.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "When I was pregnant, my family refused to gift me baby clothes even though I was perfectly fine and happy with it. Their reason was because they wanted to give me a gift for ME (pjs, a fancy new toy, a book,etc) because they didn't want me to feel like I was just a baby vessel. \n\nI can see why she is upset. But you're also NAH. It wasn't intentional on your part. This year, gift her something JUST for her and only her. Like some cute PJs and a laptop.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Do you ever travel to interesting places?  With shopping, sightseeing, and Spas?   Decent evening entertainment?   Maybe in the future you can have your wife accompany you.    She can do her thing during the time you are working.  You two can spend kid free time doing something you enjoyed before kids after you get done for the day.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 257,
              "content": "[deleted]",
              "id": 83,
              "comments": [
                {
                  "score": 160,
                  "content": "Yeah, I mean, I ask my husband for practical stuff for gifts (e.g. a digital meat thermometer) and he's like, \"that's not a gift, just buy it!\"\n\nBut that's like, our dynamic, because we actually talk to each other and shit lol",
                  "id": 84,
                  "comments": [
                    {
                      "score": 10,
                      "content": "This is exactly the problem in my marriage.\n\nI tell her she can buy literally anything she wants, like, I don’t care. If the wanted to buy a house (if we had the money) for the dogs, I’d raise an eyebrow and say something about how goddamn ridiculous that is, but I’d still be like “it’s your money, treat yo self, just remember to leave money for bills” and that would be it.\n\nThat policy makes it extremely difficult to buy eachother presents. We already buy whatever we want all year long...how do you top that?!",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "> But that's like, our dynamic, because we actually talk to each other and shit lol \n\nUnderrated roast",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’m an engineer. If someone got me a fancy, high end scale, compass or drawing set or calculator, I would appreciate those gifts as I would use them often in my daily job. If OPs wife is a stay at home mom, her daily job is to take care of the kids and house. Buying her a fancy cleaning robot is similar to the items I mentioned earlier, only more expensive. (Some people get salesmen fancy pens to use at work, it’s a thing to get people stuff they can use at work) \n\nHe may not have hit the mark for what his wife wants out of a gift, but I don’t see how he’s an asshole for buying her a luxury item as a gift. It would be worse if he usually vacuums the house and he got her a roomba. That’s a self serving gift and is kinda rude",
              "id": 87,
              "comments": [
                {
                  "score": 7,
                  "content": "Additional comments made by OP indicate his wife is an attorney by trade, but is a SAHM due to moving to another country.\n\nThat's not equal to you loving your job and appreciating gifts that relate to your employment.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA. My mom was a stay at home mother. She would have loved a roomba. \n\nShould people not gift cars or other house hold appliances? CEO of a house makes a relationship sound like a business; which they aren't. If you run them like one you will fail. If you think someone is giving you a give in spite or bc you're not doing a good job cleaning you probably have a relationship problem not the type of gift problem. Just got out a 5.5 year relationship and this guys \"fights\" sounds a lot like the ones I use to have.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It would be like if your boss gave you a new office chair for your Christmas bonus.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Imagine being at your holiday work party and your boss steps up to the mic to announce the company-wide bonuses. You’ve worked your ass off all year. You’ve been waiting for this. Finally, some god damn appreciation. “Great work everyone,” he says. “As a reward we’re updating all of your computers to run more efficiently. Expanding the space on the hard drives, and giving you more RAM. Next quarter we’ll be even MORE efficient!” ...And you’re like...uhhh thanks? Shouldn’t that just be a given and not a gift? Plus, most people are still going to work when they’re at work no matter how good their equipment is. They’ll just fill that extra time with other tasks. So I don’t get why people are saying it’s this great gift of relaxation and free time for her. It just meant priorities get rearranged.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 926,
          "content": "Vacuums are literally the stereotype ‘terrible gift to give your SO unless specifically requested’ because it sends the message, ‘congratulations honey, all I know about you is that you keep things clean!’",
          "id": 92,
          "comments": [
            {
              "score": 434,
              "content": "Exactly.\n\nI got a vacuum from my boyfriend, because he ***knew*** ahead of time that I was going to replace mine and I don't like spending money.  So he got me a damn nice Dyson one for Valentines.  It was hilarious because he realized right before he gave it what it looked like and started getting red.  But because ***I wanted a vacuum*** it was fine!  I love that vacuum!\n\nIf I hadn't actually wanted a new vacuum and he got it just because like OP did... that's a different story.",
              "id": 93,
              "comments": [
                {
                  "score": 240,
                  "content": "I had been saying we needed to replace our vacuum for a good two months before Christmas one year. Boyfriend gets me a vacuum, is all excited. Keeps hinting that I'm going to love the big box under the tree. It's what I've been asking for!!!\n\nI unwrapped that bitch, and I'm not proud to say I cried. Yes, I wanted a vacuum. But that's a household expense not a present. He went on and on and on about how I would use it all the time. I dropped $250 on a smart watch for his big gift that year and he got me a $50 vacuum.\n\nHe has since learned that cooking things are a-okay but cleaning supplies are a no-go.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 118,
                      "content": "Eh, I'd not have been happy if it was a $50 vacuum.  Mine got me a $450-500 vacuum cleaner.  Our finances were separate because we weren't married.  It was a splurge gift of something he knew I'd like but not actually want to spend myself.  \n\nIn your situation, he didn't actually spend much and it was something you could easily get yourself.  You were married and had mixed finances.  If it wasn't a damn good vacuum, it's not a good present - and still he should have made sure you'd be ok getting it.\n\nEveryone I knew was offended on my behalf except my mom - which is funny because she's a no nonsense woman that pushes through to be boss.  She was like \"did you want a vacuum?  Then that's a great gift!  Damn it's a fancy Dyson, nice!\"   Even my dad was like \"is he in the dog house?\"",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "My boyfriend got me a new set of pots and pans last year for christmas and he told me the entire time that i was unwrapping the box that he wasn't trying to be sexist and that he didn't expect me to use them for him and that he just wanted me to have new pots and pans since i kept complaining about not having a full set anymore (moving every year since college makes one lose things evidently). i love them and cackled when i saw what was causing him so much anxiety. \n\nPeople, yall just gotta talk to your partners and listen to what they want.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "In our entire relationship my husband has only bought me one gift that made me bad cry and those were sheets for the bed. They were really nice $300+ sheets, but I felt the same way as OP's wife in that it was more of a gift for the household than for me.\n\nEveryone has their fine lines of distinction and OP seriously has to learn to communicate with his wife. \"I'd like the gift\" is such a lazy, sorry excuse.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "One year my ex got me a dildo. \n\nHe truly thought I would love it.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 127,
                  "content": "Same, I asked my parents for a roomba — it’s just one of those gifts that *needs* to be asked for or else you best steer away because it’s just such an absolute cliche bad gift. Right up there with edible underwear. \n\nGifts are a chance to show how well you know someone’s likes and interests. The fact that OP says he literally couldn’t think of anything else that she might like or use is.... enlightening, in the context of how little time they actually spend together.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Exactly. There's nothing wrong with a practical gift as long as the other person indicated they wanted it. It's about the same as noticing the other person was eyeing up a specific bracelet. I already know I'm getting a body pillow. But it's thoughtful to me because I was specifically looking for one in the store and couldn't find one, like, six months ago. It's an \"awww, you remembered\" moment.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "It's a great gift from your parents terrible from your partner IMO.\n\nI joked with my girlfriend about this. We needed a new laundry basket and as we were about to buy one my sister asked what she should get my girlfriend for Christmas, and my girlfriend said a laundry basket. I gave her a hard time about how pissed off she would be at me if I got her a laundry basket.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 63,
                  "content": "I got a Dyson (holy shit, game changer) for my anniversary, because I asked and insisted that's what I wanted and picked out the exact model and color. My husband kept saying he felt weird that that's what he got me, but I would have *never* bought it for myself. If he had randomly gotten me a vacuum I would have been very insulted, though.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Haha, my boyfriend realized literally as I was unwrapping that things could go south.  He's a very practical person.  He usually gifts useful things like pressure washers or tools or vacuums.  \n\nNote - I'm actually the bread winner.  I make about twice what he does.  We split chores pretty evenly.  But he knew I wanted a fancy vacuum and we have split finances since we aren't married.  \n\nI'm completely used to getting practical gifts - and the key is that he spends more than someone would spend on themselves.  When he gets someone a pressure washer it's a damn good pressure washer.  So when he got me a vacuum it was a damn good more than twice what I would have spent vacuum.  \n\nAnd he knows it is something that person actually needs.  So he doesn't just get something he thinks you want.  \n\nMy dad was trying to preemptively calm me down - but I had to explain that I was actually happy and loved it.  Dad was floored.  He was so sure my boyfriend was about to be in trouble.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly! For mother’s day last year, my husband got me a scale that connects to the Fitbit. But I had asked for it, directly. As in, “hey hubby, for mother’s day, I would like this, here is the link”. I will say it was hilarious when people asked what he got me. The look on their faces was priceless. But, if he had just went and bought a scale on his own accord,I would have been quite miffed to say the least.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I had absolutely no idea that vacuums actually worked until I bought a decent one. Completely turned everything upside down!",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Wow, same lol. I wasn’t upset because it‘ was kind of a splurge and I really did want it. It was kind of a mutual anniversary present to both of us.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I enjoy baking and asked for Christmas once for a hand mixer and a Kitchen-Aid. I got both (YAY!) but when presented with the gifts, my husband hesitated and was ALL so uncomfortable because he realized what he was doing. But I WANTED them which makes it different from the OP's situation.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "is it weird to default like items that are consider frivolous even if it is practical? While I understand the \"you are reinforcing that i am but a servant to the house thing\" but If i got a really nice chef knife, or a very high quality cast iron or in your case, a vacuum WAY better than what is needed, i'd be ecstatic about receiving it. \n\nsure it is still an item designed for a chore but it's also very extra.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I think it's just a know-your-audience situation. Some people would prefer a cheap sentimental or romantic gift than a high quality practical item, because they care more about the feeling the gift evokes. Especially true for Christmas I think. Others are fine with practical items and that's fine too, but it's important to know which type your partner is.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "Or worse yet \"All I know about you is that I want you to clean up after me and you're shitty at it, I'm replacing you with a robot\"",
              "id": 110,
              "comments": [
                {
                  "score": 17,
                  "content": "But can't this go both ways? \"I know you are dissatisfied with cleaning up after everyone, so I got you this robot vacuum that does it for you.\"",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Well if you spend all but four days a month at home, it’s not that big a stretch to imagine he doesn’t know a ton about his wife anyway",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "So true.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP is TA for not watching enough TV to know that this is a bad idea.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": "Agreed. And with him being gone so much for work I bet wife would have loved something romantic, quality time just the two of them. Like a weekend stay at a hotel or dinner at a real nice restaurant or a weekend getaway. The kids are 11 and 15, absolutely they should be doing chores too. But to have your husband gone so much and then he’s finally home for family time at Christmas and he gets you a vacuum as a gift.... ouch. I sense wife thinks OP just sees her as a maid and caretaker while he’s gone at work, not a loving partner that he wants to come home to and spend quality time with becasue she misses her.",
          "id": 115,
          "comments": [
            {
              "score": 12,
              "content": "Spend the Roomba money on a cleaning service!  They will also clean the cooktop and scrub the toilet.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This, exactly.   A $30 bubble bath basket set would have been better.",
              "id": 117,
              "comments": [
                {
                  "score": 9,
                  "content": "That’s a great idea! It says “you work hard. Here, relax for a bit”",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Heh. You have to read the room I guess. My mom was a sahm for around 10 years and during that time did most of the inside house work. My father would always buy her a \"fancy\" appliance and a book for christmas and she absolutely loved it. She saw them more as toys she could use in the kitchen than tasks.",
          "id": 119,
          "comments": [
            {
              "score": 17,
              "content": "Many people see cooking as a hobby, or at least as something that can be fun and enjoyable. Vacuuming and cleaning the toilet are not hobbies and not fun!",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I agree with you for sure, but also caution that there may be a generational difference at work here as well.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "[deleted]",
          "id": 122,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Perhaps a better plan would have been getting two gifts, a practical one and another one.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "On the other hand I am always happy about tools ¯\\_(ツ)_/¯",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "> wife will appreciate a machine to make her work easier\n\nWow.  What an asshole thing to think.  This guy truly is a selfish asshole.  Can you believe the gall?  I mean, trying to make someone's life easier?  What a fucking dick!",
          "id": 125,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7588,
      "content": "NTA, ffs can we get some adults in this god damn subreddit. \n\nNo one every complains when a woman buys a man a drill or a wrench set for fixing shit around the house.\n\nShe's an adult, these are adult gifts. It should definitely be coupled with something personal though, and it sounds like it was. She's being a child.\n\nMy wife would be overcome with joy if I eliminated the chore of floor cleaning from our household.",
      "id": 126,
      "comments": [
        {
          "score": 2202,
          "content": "It would hurt my feelings if my husband acted the way OP’s wife did after receiving a gift as nice as a Roomba.  It sounds like all he wanted to do was eliminate a task so she could have some self time.  What’s wrong with people these days?",
          "id": 127,
          "comments": [
            {
              "score": 972,
              "content": "Voices of reason here. I think the gift of more \"free time\" is one of the best things, anything to make life easier.\n\nAnd yeah, this is the kind of reaction that would make me stop giving a fuck and just throw some meaningless jewelry at someone year after year",
              "id": 128,
              "comments": [
                {
                  "score": 462,
                  "content": "To be fair, not everyone like utilitarian gifts. I know personally I love them and I would be super happy with a roomba. But some people really love gifts that have no real useful purpose and has more sentimental value. So while you may see meaningless jewelry she may see it how we see the Roomba",
                  "id": 129,
                  "comments": [
                    {
                      "score": 341,
                      "content": "This is what everyone that says NTA is missing. They’re using their own experiences and opinions and assuming that everyone should feel the same way as they do. The whole “I would love a roomba so everybody else should too” is soooo far beyond close minded I shouldn’t even have to say it.  I would love a roomba too, but I have enough common sense to read my audience and know that not everyone feels the same way as I do.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "And the idea that he should *apologize* for it is so arrogant. I can't imagine being so entitled that someone buys me a several hundred dollars gift and I expect them to *apologize*.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Tbf I think a lot of people prefer sentiment over practicality with their romantic partner. & free time to do what? She only sees her husband once every 2 weeks, she’s probably really lonely & feels like they don’t have much of a relationship & this was just the icing on the cake.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">  I think the gift of more \"free time\" is one of the best things, anything to make life easier.\n\nFree time is only a good gift if you can use it properly. The wife is a stay at home mom with two kids who are at an age where they are becoming self sufficient, her husband is almost never home and she has an unused law degree. Her kids are needing her less and less, but she is still stuck at home (alone). Free time might just be one of the last things she wants. \n\nLike it's not like it's vaccuuming that keeps her from getting a job, or keeps her husband from home.",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 245,
              "content": "I don’t understand all these YTA. Husband genuinely wanted to help free up time for his wife. I’d be upset as the husband if my wife reacted that way especially in front of everyone else",
              "id": 134,
              "comments": [
                {
                  "score": 40,
                  "content": "Basically revolves around whether or not people consider utilitarian gifts acceptable as christmas and probably birthday presents. My dad loves them, doesn't want anything else. My mother thinks it's a travesty that anything christmas related isn't intended as a luxury. They each buy presents for the other appropriately.\n\nESH as far as I can tell. OP for being defensive and not understanding his wife's point of view. Wife for being defensive and not understanding her husband's point of view. \n\nThe real issue in this situation is no one's actually talking to each other, just at each other.",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "It's not like Op bought a great vacuum to make it easier, he bough a roomba to eliminate that chore for his wife so she can have that free time for herself.\n\nThere does seems to be a deeper issue here, but it's not about the gift itself and op's wife should verbilized what is really going on. \n\nNAH.",
              "id": 136,
              "comments": [
                {
                  "score": 14,
                  "content": "So as someone who does a lot of vaccumming...  roombas suck and do not eliminate that chore at all.",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I’m gonna go with “this sounds like a rich family, and she was expecting something to show off to her friends”. A vacuum is not that. \n\nHer fault for saying to get her nothing. Could you imagine her reaction if he actually did what she said?\n\nThis couple needs to work on communication. Which will not be easy given the work schedule situation.",
                  "id": 138,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah. Even if he expects her to do housework. The kids are old enough to go to school. How is it fair that she expects housework to be equal when everyone else has to go to school/work and she gets to stay at home?",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 828,
          "content": "Just like it depends on the woman in this situation, it would also depend on the guy for your analogy. I would never give my partner tools, because he’s doesn’t enjoy stuff like that as a hobby and to him it is just a chore. His dad on the other hand would love that stuff because not only would he use it for the household, he would also use it for his hobbies.\n\nSame thing goes for this situation. It could have been a great gift but after being married to her for 15+ years I think the issue here is that he doesn’t know her well enough to know which type of person she is.",
          "id": 140,
          "comments": [
            {
              "score": 272,
              "content": "Yeah, my fiancé asks for gift cards from Home Depot. He window shops in the power tool aisle regularly. Buying him a tool that he has had his eye on would be a welcome and appreciated gift and I have actually been thinking about surprising him with some socket set he is into.\n\nSomehow I doubt the wife has been lusting after vacuum cleaners or views housekeeping as her hobby or natural interest.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Audience matters. My bf would be offended if I got him tools. He just borrows his dads when he needs to and doesn’t find fixing or building things a fun hobby. He prefers other things",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": ">It could have been a great gift but after being married to her for 15+ years I think the issue here is that he doesn’t know her well enough to know which type of person she is.\n\nExactly this. A roomba would sound great to me because I dislike vacuuming and it's a practical gift. But not everyone likes practical gifts and it's a shame that you can marry someone not knowing what type of gifts they'd like to receive.\n\nAnd I get that not everyone is good at gift giving (I'm admittedly not because it's not my love language), but to not even try and get outside input or really put some effort into guesstimating what they'd actually like? Hmm.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Very true, my bf loves being handy around the house, and would appreciate a quality tool set (or a major upgrade to what he has now) but say for one of my nerdy cousins who loves puzzles, magic and video games, it would be out of place and I don't think he would appreciate it. We both know that's just not his interest and that's okay. \n\n\nIf you passively aggressively bought tools for a man to imply they should get to work around the house, that would still be a TA move lol",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My dad got me a toolbox for Christmas before I went to college. I had no need or want for a toolbox. However, I was able to help a lot of people out in college when they needed tools or if something came up for myself, and was incredibly grateful that I had the tools from Christmas years before.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 267,
          "content": "Adults lol, no fucking way. Hopefully hes smart enough to see the mean age of this sub is 16. Thats a great gift. I wish i had one.\n\nEdit: check out the commercial \"dog house\" is dual bag",
          "id": 146,
          "comments": [
            {
              "score": 207,
              "content": "Dude, I'm a 26yo boy. I would be fucking STOKED on a Roomba. Roomba, fridge, washer/drier, anything that could make my life easier... \n\nBUT it is kinda about the audience. The gift is for somebody else so you need to judge what they would like. It sounds like OP might be a bit disconnected from his wife. If he has spare money I'd schedule a one on one vacation to reconnect with her.",
              "id": 147,
              "comments": [
                {
                  "score": 11,
                  "content": "Yeah I literally asked my mom for a roomba for Christmas last year. Was stoked just to get the off brand.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">Thats a great gift\n\nHow is it a great gift for someone WHO DOESNT WANT IT.",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "16 year old here. We have a roomba, and it’s amazing. We like it so much that we joke around that it’s our second dog.\n\nBut, concerning OP’s wife, gifts do depend on the person. It seems like the two have some marriage issues, so that’s probably why she freaked out.. the two probably need some couple therapy.\n\n I can kind of relate to the wife. My dad is in the army, and although he isn’t gone all the time, he does leave for long periods of time (he’s going to leave for about a year in a few months) and it does lead to a lot of stress and arguments between us. NAH, they just need to get their problems sorted out.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "“It’s a great gift because I **personally** would enjoy it.”\n\nAre you OP’s wife? Didn’t think so. He should know the person he married better than that. And the way he tries to justify it. That’s what makes him TA.",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "I think it demonstrates that he doesn't know his wife very well is the issue. I'm a 26 year old married homeowner and while I would love to have a Roomba if my husband got me one for Christmas it would imply that he didn't put any real thought into what to get me. She doesn't like books? Doesn't have hobbies? Wouldn't enjoy a night away with her husband that she rarely sees? Obviously it's not just about the roomba, that's just representative of their problems. He refuses to admit wrongdoing, their relationship has been neglected, his wife is depressed, and the best thing he could come up with was  fancy vacuum cleaner? After over 15 years together you think he might know his wife well enough to know that household items are not something she'd like as a gift. It's about knowing your partner and what is meaningful to them.",
          "id": 152,
          "comments": [
            {
              "score": 25,
              "content": "That’s where I’m coming from too. I feel like sentimental gifts are good and that practical ones should be given if asked for. He says he asked her what she wanted and she said nothing, I get that. But like I’m sure she would’ve appreciated her favorite chocolate or something anything even",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "> Wouldn't enjoy a night away with her husband that she rarely sees? \n\nThis is it, he's away 26 days of the month, yet found it oh-so-difficult to think up a present, when uhh, just get a weekend getaway for you and your wife to re-connect, it's the most blindingly obvious thing in the world.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "I really think it changes depending on the couple. As a stay at home mom, I'd be pretty excited if my husband got us a Roomba as a gift. It would be a gift for us, not specifically me, but I'd be pretty thrilled about it, especially if he included something personal. At this point with our lives, in an apartment with a baby... we don't need more random junk, we need adult gifts. The money he is spending on my gift is *our* money (meaning mine too), so it's totally cool to buy something for us, the house, something useful. That makes a lot of sense to me. \n\nThat being said, my husband helps out when he comes home and I feel like we share the work when we can. He shows me he loves me every day, I don't need the perfect gift to prove it. I could see how a different situation may warrant a different response, though. It sounds like for OP's family, he's rarely home and his wife does everything household related. If I never saw my husband and he didn't help me at home... I could imagine wanting Christmas gifts to be a little more personal and thoughtful. I'd be already so lonely and burnt out, a cleaning-tool as a gift could really sting. \n\nKnow your audience and your personal situation.",
          "id": 155,
          "comments": [
            {
              "score": 3,
              "content": "I guess one other difference is that the kids are 11 and 15 clearly old enough to vacuum once in a while, so by giving the roomba to the wife he's making her solely responsible.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I would never buy my husband something for fixing things around the house as a gift. I think that is only appropriate if drilling/fixing things is a passion of his. He would shrug and say thank you but it would not bring him joy, which is what presents are for.\n\nWe buy drills and vacuums as household necessities. If the genders were reversed in this post, my reaction would be the same. All the top YTA comments are explaining that she likely doesn’t feel appreciated by him, which is helpful and actionable information to improve his situation and see it from her perspective. These comments seem to be coming from perfectly capable “adults,” thank you very much.\n\nIf her feelings were hurt and she was embarrassed, your comments don’t really help except to suggest she just... change her feelings? Suck it up? Ok. I think that defeats the purpose of the holidays but to each their own.\n\nAlso... Roomba’s do not do all the house cleaning. They’re constantly getting stuck on things and bump into shit constantly so you sort of have to keep a close eye on them. I have one and I still have to clean the floors after. It certainly helps, of course. But it’s not exactly eliminating the task for me. I know that may not be super relevant, but many people (OP included) are acting like he gave her a floor cleaning servant. Not quite.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "If that man was already resentful at being the only one fixing stuff around the house (despite all the other family members repeatedly damaging stuff) and then the wife bought him more diy tools, yeah he might be annoyed.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I don’t think tools are comparable to cleaning supplies. Lots of them men I know tend to do things with tools as a hobby. They’re working on the car with their friends and a beer, they’re building a cabinet, just for fun. No woman is saying “oh yeah me and the girls are getting together later to vacuum and have a glass of wine!” Now if a man is only using tools when someone asks him to do something and he doesn’t enjoy it, then in that situation tools would be a comparable comparison.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "He should know his wife better than that. I would be pretty thrilled with a roomba because it’s a cool piece of technology but if my wife bought it for me to help me clean that would be pretty insulting. \n\nThat’s just a personal thing. Read the room, fella.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I'm an adult, I'm married, just for those of you saying that all of us thinking YTA are single and young. I think that a gift is a really personal thing, yes, your wife would be thrilled with a roomba, but obviously OP's wife is not and that doesn't make her a child. If OP is married and have no idea what a good gift for his partner is, he have problems in his marriage beyond this incident, and his wife oversensitive response and his inability to  empathize with her after the fact, are a huge red mark floating above them. It's not the roomba, it's OP's disregard of her feelings.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4504,
      "content": "My dad got my mom a wheelbarrow for Xmas. She needed one for the barn to care for her horses. They divorced a year later and that even came up in court.\n\nMeanwhile, I got a new washer and dryer  for Valentines Day one year and I couldn’t have been happier. Made my life a lot easier. My mother was horrified.\n\nSo....It’s really an issue of knowing your audience. I would be super excited for a Roomba. Clearly your wife not so much. That it keeps getting brought up is kind of nuts though. \n\nIf she was hurt because she had asked you for something else or wanted something more romantic or sentimental vs practical, you guys could’ve returned the Roomba and you could endeavor to be a better gift giver.  But tears? Recurring argument fodder?  Sounds like you need to read Five Love Languages.  And she maybe needs therapy. \n\nESH",
      "id": 162,
      "comments": [
        {
          "score": 2526,
          "content": "Given that OP \"only gets to come home to his family on every second weekend, on average,\" I'm assuming the problems run deeper, and she's finding it hard to sustain a loving marriage with an absent partner. I'm not criticising him for working hard to support them or having to travel for work, but I am wondering if they need to rethink the current arrangement. He thinks he's allowing them to \"live a comfortable life,\" but she may prefer to have less money and a more present spouse.",
          "id": 163,
          "comments": [
            {
              "score": 783,
              "content": "I would also prefer less money and taking up work myself, if it meant my spouse would be present and be home for the family. I feel like people are looking at her reaction at face value when she's essentially a single mother who is raising these kids herself since OP is constantly traveling for work.\n\nNo judgement on OP for his work, though, because he's the income of the family (assuming she doesn't have her own gig), but maybe this kind of lifestyle is wearing her out and she's losing herself as a person. So her interpretation of the gift was negative. If she isn't the type of person to react this way, then she's been harboring these feelings and it finally burst, and now it's manifesting itself in a different way.",
              "id": 164,
              "comments": [
                {
                  "score": 667,
                  "content": "She has a law degree and gave up her entire career to raise their kids.\n\nThat woman wants to be seen as more than a housekeeper to her partner.\n\nPersonally, If my partner only saw me in such a single faceted way I would become single.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 233,
                      "content": "Dang, law degrees are no joke. I can barely imagine how much it would suck to go through all that schooling and testing to never be able to explore that field.\n\nLaw school never seemed like the kind of thing someone just does, except for the rare person here or there, so she must have been pretty motivated to get into the field.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I Agree with your comment. Maybe a romantic gift to a couple spa retreat would’ve been received by her positively.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You’ve hit the nail on the head. Losing a career to raise kids can make you feel like you’re no longer an individual with a personality seperate from that.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 371,
              "content": "This comment should be at the top. It's not about whether a Roomba is a universally bad gift or not, it's about the context. He's gone all the time, she probably just wants to spend time with him and instead he reinforced that he's happy with the arrangement of being gone all the time. Context, people!",
              "id": 169,
              "comments": [
                {
                  "score": 33,
                  "content": "Plus I mean she’s probably just stressed from being home all the time. People go kind of crazy when they don’t get out of the house enough.\n\nAnd having to parent two kids alone... I mean how long has she been doing that? That sounds tiring.\n\nShe just wanted a thoughtful gift and he basically said “here, maid, use this to clean better” oof.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">People go kind of crazy when they don’t get out of the house enough.\n\nOP seems to have thought that the Roomba would give her more time to get out of the house for herself, but I totally understand why she would have taken it the way she did",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "THIS",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "Plus she gave up using her law degree to marry the guy.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I love how he says, with ZERO hint of self awareness, that he values time more than anything. And then says he’s come every other weekend. Bro, you’re a walking hypocrite",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yeah, OP needs to spend some time with his family. Time to use any PTO and take a few weeks in Hawaii as a family!",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Man I was on the NTA, but after reading this it probably just is miscommunication and not being able to express one's self. I personally would of loved a Roomba, my duties as stay at home mom would be so much easier!!! (I have a Newfoundland dog, they are fluffy af so I gotta vacuum often), but my husband also isn't traveling for work so I can see her wanting something more sentimental or romantic. She is probably just redirecting those emotions into the vacuum when it wasn't necessarily the problem.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yea seriously, I would take less money any day if it meant my spouse was more present.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 466,
          "content": "I disagree with the E.S.H. judgment. Why is she not entitled to tears if she’s hurt. Justifiably so, dude got his wife a vacuum cleaner for Christmas ffs (based on the “knowing your audience” premise).\n\nIt’s recurring argument fodder because he won’t admit he did anything wrong. His initial intention was good and that’s what he’s sticking too. What’s the logic that if you get wronged and the person won’t apologize or own up to anything, well, you gotta drop it now. Of course it keeps popping up cuz it hasn’t been resolved. Had she dropped it, she would be a pushover.\n\nSaying this woman “needs therapy” for having a normal human reaction to your husband obviously not knowing you, and refusing to acknowledge it or owning up to his f*ck up is an asshole move. YTA",
          "id": 178,
          "comments": [
            {
              "score": 7,
              "content": "The thing is, he doesn’t even have to admit doing anything wrong. He just has to apologize for misreading the situation—which isn’t necessarily wrong, just a misstep. He doesn’t even want to do that which based on this being a recurring topic I’m guessing is a common theme in the relationship.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "I agree with you. I first read the post and didn’t think anything was wrong. I like getting useful and practical gifts - I don’t want flowers that will die after two days or an ugly sweater I will never wear. But you are so right - you need to know your audience. Clearly OP’s wife was extremely hurt over it. OP also said further down that she didn’t talk to him for weeks which I think is an over reaction. ESH",
          "id": 180,
          "comments": [
            {
              "score": 4,
              "content": "Also with kids that old they absolutely should be helping around the house. I understand her argument about it being a family gift. It seems like from OPs post that he believes she should do the cleaning because she doesn't work. Maybe the kids took that idea on. Meaning she is shouldering the work of 2 other able bodied people most of the time and occasionally 3.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Definitely seems there's deeper issues here than the damn roomba. Also, why couldn't he just give it as a gift any other time of year (like a month later, as a spontaneous purchase in January)? It may be overblown, but there's a lot of implications/politics put into the meaning of gifts. OP is old enough that he should have thought this through, or given her a \"main\" gift and not the roomba as her true present that year. \n\n\n\nYou're right about reading your audience--I would appreciate some household items, but as a sole Christmas gift? I'd think it was a little impersonal. \n\n\n\nCrying and bringing up in arguments a year later though? OPs wife is also at fault for a different reason--she clearly has deep seated issues, and instead of addressing them head on or even talking to a therapist, keeps using the roomba as ammo. \n\n\nI agree, ESH.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This. Man I would love a damn roomba for Christmas. But, I know not everyone would.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "My dad got my mom a GPS one Christmas. She brings it up to this day, yet she literally can’t leave our town to go anywhere without it. It really is knowing your audience, or it’s a deeper problem that’s presenting as the Roomba",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Totally. I've been given baking sheets, casserole dishes,  a stand mixer, a slow cooker,  pots and pans etc numerous times. Some of my friends are horrified by these gifts from my husband. But... It's what I want. ( Except the slow cooker, I've never understood them or seen a need but I get that he thought I might like it, it just doesn't suit my style of cooking. )\n\nI love this shit. Especially because I by habit always tend to go frugal and buy off brand or cheapie models and he gets me nice good quality stuff. I love it. \n\nTbf I'm also a sahm and I'd be thrilled with a hoover. Jewellery on the other hand is meh. I have plenty. I don't see a need for more. Flowers are silly and I'd rather not be stowed under with enough chocolate to last a year because frankly I will eat it and I'll regret it.  Yet my best friend doesn't consider a birthday or Christmas complete unless she receives these items.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yup, I would be super excited for a roomba here but I also can't blame the wife for not being too happy. One year my mom bought me an electric toothbrush for christmas and I was kinda disappointing. So I get where the wife is coming from. I have no judgement for this one though. Maybe ESH.",
          "id": 186,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I totally agree with you, \"know your audience\" is perfectly put. I remember as a kid my dad bought my mom a beautiful sapphire ring for Christmas. She was so upset, she cried. We didn't have a lot of money and she needed a new washer and dryer. Fortunately my husband and I are comfortable financially, but I still appreciate practical gifts (one year I asked for a wall mounted extension cord in the garage and a new shop vac and I did get both. I was delighted and years later I still use both as I vacuum out our cars fairly regularly). But yeah, I think a lot of women would be appalled at such a gift!! You need to know your spouse! And there should be open communication about expectations.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "> Sounds like you need to read Five Love Languages. And she maybe needs therapy.\n\nOP needs to get some perspective. He is not an asshole for giving a roomba, but he *is* an asshole for thinking money is more important than being present (no pun intended). [Those kids are gonna be fucked when they grow up because one of their parents decided money was more important than spending time with them](https://youtu.be/etundhQa724?t=67).",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1500,
      "content": "NTA. Yikes if this makes you an asshole my mom must hate us cause we (my siblings and I) got her a roomba for Christmas a few years ago. We also got her a really nice Dyson cordless vacuum for her birthday this year. She uses the vacuum constantly and loves it. The roomba goes around twice a week and gets a ton of dog hair. We also get my father power tools, which I would say is in the same line of gifting.\n\nIf you had gifted a nice set of pots and pans would that also be asshole-ish because she uses them to make meals for the whole family? Or when people gift a dog but the whole family gets to appreciate him/her? People gift items all the time that more than one person gets to appreciate. A roomba should theoretically give her more time to relax with her children and take some stress off of her while you’re gone. I see no issue with it.",
      "id": 189,
      "comments": [
        {
          "score": 368,
          "content": "In some people’s eyes it would be rude to give all of those gifts. In my eyes, those people are insane  and ungrateful.",
          "id": 190,
          "comments": [
            {
              "score": 29,
              "content": "[deleted]",
              "id": 191,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "I think it depends on how they view the activity.  Kitchen stuff for example.. awesome for some because cooking is their hobby and they are interested in it! For someone who cooks a lot but it's a chore, the same gift isn't fun anymore.  It ties back to something they need to do but don't enjoy",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I think it might depend on the person. My wife has ASKED for household gifts before, and she enjoyed them, but if she hated housework but never expressed a desire for such a gift, I probably would think giving it to her is a bad idea. Probably also makes a difference if your spouse is a stay at home mom, and all she deals with all day is home upkeep, the last thing she would want as a gift is something to do more housework with.  My wife and I however, are both at home and work 50/50 and split all of the upkeep, and since we both tend to be busy, any household upgrades are pretty much equally enjoyed by us.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Something something, don't look a gift horse in the mouth, something something.",
              "id": 194,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Agreed. Growing up with a dad who raised 6 kids by himself, we didn't always get a lot for Christmas but we did always get something. I would never be ungrateful for any gift given to me because after all it was a gift. But idk maybe that's because I struggled growing up",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The gift should be what the recipient wants. Not what the giver would want. Just because one person would like it, doesn’t mean another person would. We’re all different.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "The point isn't what OP or you or your mom would think about receiving this gift. The point is that OP's wife did not want that kind of a gift and was hurt by it, and that OP apparently doesn't know his wife well enough to know that. And that, even after her explicitly and repeatedly telling him how it hurt her, he still can't accept that her feelings are valid.\n\nThis perspective lacks empathy. You can't tell someone who's hurt that someone else went through the same thing and was not hurt by it, because that's absolutely irrelevant.",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "It depends entirely on the people involved. Especially in a relationship where the SO feels underappreciated, these kinds of gifts can hit a sore spot. OP not realising it would hit a sore spot, or understanding why shows some big communication issues.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "A Roomba coming from your children as a gift at Christmas, is totally different than when its your spouse gifting you a vacuum cleaner as a  Christmas present. This type of gift is a household gift, not a personalized gift solely used by your partner for their enjoyment (unless they specifically asked for it).",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "That’s your mom. It’s a different dynamic. Would you buy your female boss a roomba?",
          "id": 200,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "So because it worked well for YOU, who is in a different relationship to their mother than a husband is, doesn't mean it wasn't off in their relationship - there is obviously a different dynamic at hand",
          "id": 201,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1024,
      "content": "NTA. A Roomba is a great gift. It's not a necessity, it's a fucking luxury.",
      "id": 202,
      "comments": [
        {
          "score": 190,
          "content": "[deleted]",
          "id": 203,
          "comments": [
            {
              "score": 32,
              "content": "OP didn't say his wife asked or event hinted for a Roomba. \n\nJust because you would love a Roomba why would you assume that it would be a great gift for everyone? And why would you completely invalidate the fact that OP's wife's feelings are actually hurt?",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I don’t really enjoy working on things. But if anyone gets me tools or ‘dude’ stuff, I’m thrilled because then I don’t have to buy it. If anyone gets me anything I can use in my life, it’s a good gift. I know everyone is different, but it just seems entitled to be that upset over getting a robot vacuum.",
              "id": 205,
              "comments": [
                {
                  "score": 21,
                  "content": "OP's wife is a stay at home mom and takes care of their two children for more than half of the year alone by herself. She probably doesn't travel much, probably doesn't even get out much given how much OP travels. Maybe she just wanted a more personalized splurge gift that isn't a household appliance. It's not entitlement, it's lack of empathy on OP's part. This is a marriage problem and not a his or her problem.",
                  "id": 206,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I dated/lived with a girl who talked about how much she wanted one for months.  Her dog shed like crazy and she was typically the one vacuuming.  I was pretty young and just getting on my feet, bought a new house, etc so a $500 roomba at the time felt like a great gift...that was a mistake.\n\nWhat she meant was she wanted me to buy a luxury for the house out of sheer goodwill.  Still kinda frustrated that it was the only thing she talked about wanting and wasn't happy with it.  I would have much rather bought her a $200 purse or something honestly.  She was notoriously difficult to shop for too as she had no hobbies or interests other than makeup & reality TV (e.g. Kardashians).  I cut that one off not too long after though.",
              "id": 207,
              "comments": [
                {
                  "score": 3,
                  "content": "Sounds like you saved yourself some trouble.",
                  "id": 208,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "It's a luxery that gives his wife more free time too. OP says his wife is a stay at home wife. Now that she doesn't have to vacuum she has more free time to do what she wants. People are over reacting.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Hell. I know I'm getting older when the thoughts of a nice high quality item that makes chores easier (not fighting with an old vacuum, a steam mop instead of my swiffer, a fucking roomba to vacuum and for the cats to ride on) sounds awesome.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I don’t think this is about the Roomba itself. I would also love one. Either you like the idea of a Roomba or you don’t. His wife’s reaction is less about the gift, and more about his perception of her. \n\nIt sounds like he’s never home due to work and in another thread he mentioned she quit her job as a lawyer to move to another country for *his* job. That’s when she became a SAHM. He’s mentioned in multiple threads they already have issues in their relationship. \n\nBasically, we need an NTR (Not The Roomba) flair. \n\nThe issues surrounding this gift is indicative of deeper problems.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "OP said he makes six figures. I doubt it seemed like a luxury item to her, more just like something she could have easily bought herself if she wanted it. \n\nPractical things are great gifts if you know the person wouldn't buy it for themselves. (I want a skill saw, but can't justify buying one just for fun. But would love one for a gift! My friend who does woodwork doesn't want a skill saw. If he needs one, he'll buy one as a tool for his job.\"",
          "id": 212,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 591,
      "content": "You know this isn't really about the Roomba, right?",
      "id": 213,
      "comments": [
        {
          "score": 143,
          "content": "I feel like a lot the Y-T-A and N-T-A responses are missing this as well. The actual root of the disagreement has nothing to do with a vacuum. It’s interesting to see how few people (including the op) understand what’s going on here",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "What is it about? If you can elaborate.",
          "id": 215,
          "comments": [
            {
              "score": 159,
              "content": "The fact that she only gets to see her husband every other weekend, she probably feels like she doesn't have a husband.",
              "id": 216,
              "comments": [
                {
                  "score": 79,
                  "content": "Yep, and he can't come up with a more personal present? It's like he doesn't know her at all",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "She might think he sees her like a maid and gets her on christmas (where you usually give more personal gift) a tool for her trade.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Exactly. It’s not that a roomba is a bad gift. I get where he is coming from, he thinks he is relieving her of her duties and giving a practical helpful gift. But she’s upset that the first thing her husband thinks when buying her a gift is to help her with cleaning. From her perspective, it’s like he’s thinking “oh what does my wife do all day? I guess she cleans, because what else would she be doing? I’ll just get her something to help with that.” Maybe gifting the roomba to the whole family (even if you know your wife would use it most) would be a good idea because then it implies that it’s everyone’s responsibility to keep the house clean including the kids since they’re older. Then get your wife a bracelet or something.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This is why he’s the asshole",
          "id": 220,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 564,
      "content": "> I think it is apparent that she should take on responsibilities such as taking care of the kids and maintaining the house. \n\nIt is understandable that she'll do most of it, but you can't buy your way out of adult responsibilities. What bugs me also is that you use \"I think she should\", that's something you never discussed about ?\n\nAnd yeah, cleaning stuff / cooking ustensils aren't good choices. They give the vibe your wife is only useful for that. YTA",
      "id": 221,
      "comments": [
        {
          "score": 158,
          "content": "I am a big fan of communication and they are more than allowed to set terms to whatever responsibilities they want around the house in terms of chores. But I'm pretty sure that the unwritten agreement of a single income in a house is that the partner who stays home tends to tasks like that, unless stated or agreed otherwise.",
          "id": 222,
          "comments": [
            {
              "score": 36,
              "content": "I agree with the sentiment that whoever stays home does take on more housework but that shouldn't mean that the other partner doesn't contribute at all to those chores.",
              "id": 223,
              "comments": [
                {
                  "score": 28,
                  "content": "In this specific case, I disagree. If the “working” partner has a high-stress and long hour job that doesn’t leave him with much time at home, he shouldn’t have to do those chores.",
                  "id": 224,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I totally agree! This guy is away from his family for two whole weeks! Who the hell is going to work for two entire weeks and then come home and work even more for two days until he has to go back to work? The people in this thread are ridiculous.",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Oh, so since *she* works at home 24/7 with managing a household and two kids, she *also* shouldn't be burdened with work on her time off...\n\nWait, that can't be right--when does she \"get off work\"?\n\nOh that's right: **fucking never**, bc apparently being responsible for the next generation--hell, just keeping the children alive and well--doesn't merit a fucking break???\n\nDo you *see* the problem with this? Or do you still think a guy who gets to hang out in hotels chilling now and then should also get to chill at home when his wife never does?\n\nFFS...",
                      "id": 226,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Both partners should have equal work loads. If one of them works for 40 hours a week then the stay at home partner needs to do 40 hours of housework. If there's more than 40 hours of housework per week then they can split that. Obviously the ratio will shift depending on the difficulty of each partners work. A newborn child is far more work than a normal low stress 8-5 job for example.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "OP is a special case since he basically doesn't even live at home. But for most single income families, the working partner does still spend more than half their time at home. If you have kids, caring for them is a 24/7 job. Does it seem fair to you that one person works 8 hours a day, five days a week, while their partner should work days, nights and weekends?",
              "id": 228,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yes, but that doesn’t mean she wants gifts only pertaining to her duties.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Right, I mean it does make sense if one person works and the other doesn't, the person who's home all day does most of the housework, especially if the kids are in school. BUT it still shouldn't be a silent expectation, it's an arrangement both people should agree to, and be on the same page about who takes care of what and how things should be done.\n\nBut we don't now what conversations abut who does what, when, and how happened up to this point to establish the household dynamic. The fact is, not a lot of people want Christmas presents that directly relate to their job, primary duties in life, or the things they do for others. They want gifts they can enjoy and will make life a little happier. For some people, that does mean cleaning supplies and appliances, but that's not universal.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": ">you can't buy your way out of adult responsibilities.\n\nYou most definitely can.",
          "id": 231,
          "comments": [
            {
              "score": 9,
              "content": "Yeah that's literally what a roomba is. I paid for a machine that vacuums for me.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "So many families I've seen where one parent works 9-5 and is mad they have to wash some dishes or help with homework, meanwhile the SAH parent  has been up since 6am and only gets a break when the kids go to bed. I agree, assuming that is how so many situations happen like OPs. Let alone, his situation is not the average SAH/working marriage.\n\nHe's there apparently 4 out of 30 days a month, on average. Emotionally, she might as well be a single mom! Yes, being upper class must be nice, but she's responsible for the kids full-time, all of the family (birthdays, holidays, gatherings), cleaning and cooking, managing the home, kids school activities. That's got to be exhausting with no partner. Yeah the kids are old enough now, but she's been at this for 15 years. I'd be burned out.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "So he literally is only home every other weekend else he is working, and you expect him to come home and have to vacuum the house??",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "\"It is apparent\" versus \"we've agreed that.\" His language reveals a lot about the marriage.",
          "id": 235,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 488,
      "content": "I wanted to buy my SO a nice set of kitchen knives but I wasn’t sure if she would have a similar reaction to your wife so I ended up just asking her if it would offend her. She actually liked the idea and offered a suggestion for some knives her mother had that she knew she liked. Generally I would stay away from household stuff like that if it could have like sexist connotations. You probably wouldnt gift her a broom and dustpan would you? This was pretty similar, it just took batteries. I won’t say you’re the AH because I think your heart was in the right place and you genuinely thought you were helping her and getting her a good gift. But to everyone else it was a pretty crappy present. NAH",
      "id": 236,
      "comments": [
        {
          "score": 32,
          "content": "> You probably wouldnt gift her a broom and dustpan would you?\n\nA broom and dust pan requires manual labour\n\nA Roomba requires the press of a button and saves time in her life that she would have otherwise spent vacuuming.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Kitchen knives...another thing to add to my list. My bf knows i love cooking and baking, wish he would realize such gifts would make me happy",
          "id": 238,
          "comments": [
            {
              "score": 3,
              "content": "If u do be highly specific go out and hold and test some knifes yourself or with him...after finally buying myself a good set im so glad I held them before buying them I would have gotten a totally different set based on looks alone.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "IDK, man. A Roomba is pretty pricey. I think it depends on what the value of the gift is and what not. If its a broom and dustpan, yta all day errday. But if its an x9 roomba or some dyson super sucker suck your nut through a sweat gland vacuum 9001, then youre nta, GGWP Bro.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 428,
      "content": "This isn't so much a 'am I the asshole thing' as it is a 'maybe my marriage needs work' thing. You are away from your family waaaaaaaay too much. It's not really the Roomba that's the problem. Personally, I would love a Roomba for Christmas. It's a robot! That cleans! But I'm not a woman stuck home with two kids who barely sees her husband.",
      "id": 241,
      "comments": [
        {
          "score": 123,
          "content": "I am a woman at home with two kids and an SO that travels frequently for work. If my kids were older and there weren't little toys all over the place that the Roomba would eat up, I'd definitely love a Roomba. BUT, unless I specifically asked for it, I wouldn't want it as a gift for me, but a gift for the household. A Christmas gift should be something you *want* in my opinion. If she wanted a Roomba, great gift! Sounds like she didn't. Maybe she even took it as her husband passive aggressively telling her she's not doing a good enough job vacuuming 🤷‍♀️",
          "id": 242,
          "comments": [
            {
              "score": 17,
              "content": "I have young kids and a roomba, mostly it doesn’t suck up any of their toys. Sometimes a sock or something will get stuck in the bristles but it’s no big deal to clean out. I highly recommend it, I don’t spend every evening sweeping up crumbs from the table anymore!",
              "id": 243,
              "comments": [
                {
                  "score": 9,
                  "content": "I'm honestly really terrible about picking up every night and I'd be forced to if we had a Roomba 😂. It might be a necessity for me as my kids get a little older, though. \n\nDoes it handle changes in floor type and transition pieces? Does it do multiple rooms? My house is kind of oddly laid out.",
                  "id": 244,
                  "comments": [
                    {
                      "score": 3,
                      "content": "We have a Eufy (same idea) and it does done with the transition from wood to time, but the transition to the area rug we have is tough. It does a great job on the rug itself, but the edges of the rug are all lined with hair and dirt that needs a manual vacuum.\n\nWe do have a cat, dog, and 11-month old though, so your mileage may vary!",
                      "id": 245,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm a new mom and I would love a roomba, but only because I'm a neat freak and the dog fur drives me absolutely insane. I keep telling people all I want for Christmas is for someone to vacuum my car for me lol.",
              "id": 246,
              "comments": [
                {
                  "score": 13,
                  "content": "I'm a neat freak trapped in a lazy slob's body, unfortunately.",
                  "id": 247,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "It honestly sounds like he picked the practical gift. If there is something my relationship has taught me is that us guys need to not think like guys when it comes to gifts. I 100% agree he should of picked out something more personal, like some sort of FaceTime tablet or tickets for her to join him on some of these business trips.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}