{
  "post content": "I (20M) am a college student in computer engineering. In my university the CE program has a bunch of pre-req classes that everyone has to take so we know most of our batch mates.\n\n&#x200B;\n\nBackground: There are very few women in the program and most students men. One of these women, Lisa is very girly in the way she dresses, like coming to campus dressed like a model, wearing heels. bright pink etc. I did a group project once with her and we became good friends and ended up leasing an apartment together. She is really smart, has a perfect GPA and is good in computer networking and some aspects of computer graphics. I have good skills in networking as well due to some side projects I do.\n\n&#x200B;\n\nI do not get along with some of the other men as when I hang out with them they get quite rowdy and say racist and sexist things that make me uncomfortable. They make fun of my friend and how she dresses behind her back a lot before they knew I was friends with her. Eventually since she was friends with most of the other women in our program, I ended up with a friend group that is mostly women.\n\n&#x200B;\n\nThere was a hackathon recently and I joined after an acquaintance reached out to me. Some team members were one of these rowdy people I disliked but I agreed anyway.\n\n&#x200B;\n\nThe day preceding the hackathon we discussed recruiting one more team member and I mentioned having a friend who is really good and whose abilities would be useful. I kept using the pronoun \"They\" and not she. I asked my friend and she was excited to join and spent the day practicing some things related to graphics shaders which could come in handy. I did not add her to the fb group chat and just had her show up to the event to sign up there.\n\n&#x200B;\n\nWhen I got her to meet the team, the self appointed team lead, was like Oh we decided we just want to be a team of 4, since it would be too hard to coordinate 5 people. My friend was visibly upset but said she doesn't mind leaving since she did not feel like being in a team alone.\n\n&#x200B;\n\nI felt shitty and said I could form a team of 2 with her instead. The others had a surprised Pikachu face when I said that, and asked me if I'm sure.\n\n&#x200B;\n\nThey needed networking skills for their initial idea and had to come up with a new one. We ended up doing something requiring the same skills as their original idea but that was definitely a different idea. However we might not have come up with that if I had not known their idea first.\n\n&#x200B;\n\nIn the end their project was incomplete and we ended up winning first place. 2 of the team members were very mad at me and called me an AH, told me some nasty things about me being a \"simp\", white knight and saying we only won because of her \"pussy pass\" and that I probably did all the work. They said it was misleading of me to not say who the friend was and use the pronoun they instead of she when they knew the person. They claimed it was not about her being a woman just that she sucked.",
  "id": 1,
  "comments": [
    {
      "score": 684,
      "content": "Evidently she didn't suck at all, and you're right to want her on your team. \n\nI do not give a flying what your ex-teammates think or say, they are very obviously AHs. \n\nI would just say though, be careful about pulling something like this without the knowledge of the woman involved. Despite all your excellent intentions, you put her in a situation where she was a 'gotcha' to the team, and she didn't ask for that or agree to that. \n\nYou knew you were hiding her gender from the team, and you should have asked her if she wanted to be involved with that.\n\nYour intentions are great, but be careful you don't patronise someone or put them in a difficult situation because you've decided to 'help' them without their knowledge.",
      "id": 2,
      "comments": [
        {
          "score": 184,
          "content": "That is true. Honestly I did not really do it intentionally to spite them. I have a habit of saying they when referring to women when talking to men especially in the context of school maybe because I am a bit self conscious about being judged for being in their friend group.",
          "id": 3,
          "comments": [
            {
              "score": 129,
              "content": "Fair enough, but you said you also know they make fun of her, and yet you did not mention to them who she was and did not add her to the chat. It really does sound like you were trying to stealth it.\n\nI'm saying, intention or no intention, be mindful of putting her in A Situation.",
              "id": 4,
              "comments": [
                {
                  "score": 53,
                  "content": "Yeah I should have been mindful about that. I did not like these people but I did not really remember them specifically not liking her however they were friends with other people that made fun of how she dresses and some rude jokes that implies she thinks dressing like she does will make profs and TAs favor her.\n\nI did not see it as a big deal as they asked me if I knew anyone who was good.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 28,
                      "content": "It's possible you weren't (consciously, at least) trying to \"gotcha\" them but were instead trying to avoid conflict, you knew that when they found out she was female it would be A Thing but you also thought getting her on the team would be a good idea, so you made small choices along the way to postpone the moment conflict would happen.\n\n\nIf that feels accurate I think it's worth examining that impulse in the future. When you're trying to avoid conflict, is it conflict that will be inevitable? Is there a better time for this conflict to happen than now? When the conflict happens, how will you manage then? Once you've answered that question, can you get an equally good or better outcome managing that conflict now instead?\n\n\nAnd this is 10x more important when someone else would bear the brunt of that conflict.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "I understand, but by using \"they\" like this you are unintentionally erasing the women that are in your program.  Perhaps if your stupid friend group heard \"she/her\" more often, they wouldn't be so...stupid.",
              "id": 7,
              "comments": [
                {
                  "score": 8,
                  "content": "\\^ This. I'm all for neutral language to cut down on biases, but people like the team members need to be specifically told about the \"bimbo\" actually being a smart person. At the very least, it gets their sexism out in the open for others to see.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Popping in to say that the teammates are AHs, but what you did isn't completely ok either. Your friend had to show up and be kicked out, just because you agreed to be on a team with jerks. Ok, so the two of you were able to form a team and win, but what if that wasn't possible? She would've felt awful and it would have been entirely your fault. It's good that you support your friend, but you shouldn't do it by hiding her till the last possible minute. That you didn't add her to the group chat shows that you knew on some level that the others wouldn't allow it.\n\nFor that, I say ESH. I get what you were going for, but the right way would have been to be open about it, and convincing the others of her skills. They might not have agreed, in which case, you could have quit and formed a team with her anyway, **without** her having to be told she was unwanted.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 249,
      "content": "As a woman in tech I’m a bit torn on my judgement here. You’re obviously not the asshole in regards to your male teammates. They are going to have a rude awakening when they try to apply for corporate jobs/internships. I do not envy their future bosses who will have to spend the effort to rid them of these toxic opinions.\n\n\n\nOn the other hand, you treated your roommate pretty shabbily and she did nothing to deserve it. You set her up to be publicly rejected and facing the antagonistic sexism of a group that she thought *she’d been invited to join.* She handled it gracefully, allowing you to swoop in and okay the White Knight who rejects the dastardly former teammates to run off with the fair maiden - which more and more feels like it was your plan. You used your “friend” like a prop in a play and frankly that’s not the kind of ally that any of us needs.\n\n\n\nFinal Judgement: **ESH** except the young woman that you all treated like an NPC instead of a person.",
      "id": 10,
      "comments": [
        {
          "score": 55,
          "content": "I think you have a point. It was not intentional as honestly I did not know these people  well enough to really know that they disliked her that much, I know they associated with some other people who said mean things about her but I thought only one of them sucked personality wise (but I underestimated the extent of it). I did apologize to her for the situation.\n\nI have a habit of using they when talking passively, usually to protect people from being identified.  I think where I do suck, is that sometimes when talking to men I feel awkward giving away that the friends I am talking about are women and I automatically use they to hide that.\n\nI definitely am not patronizing towards her or treat her any differently than a guy friend when we interact with each other, and I like that we have similar interests and we are both more experienced beyond what is taught in school.",
          "id": 11,
          "comments": [
            {
              "score": 52,
              "content": "Hiding the fact your friends with women like that kind of comes across like your ashamed of the fact your friends.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "I appreciate the follow up and retract the comments where I assumed your intention. There’s nothing wrong with using neutral pronouns and those other guys are assholes. In the future, try to give a girl a heads up about what she might be walking into. It gives them the agency to decide how she wants to handle it ahead of time.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "> I have a habit of using they when talking passively, usually to protect people from being identified. I think where I do suck, is that sometimes when talking to men I feel awkward giving away that the friends I am talking about are women and I automatically use they to hide that.\n\nThis is not normal at all. Who feels the need to 'hide' the people they are talking about to 'protect' them? This is you being weird about a girl and it's something you should address because it would have changed literally the entire situation.",
              "id": 14,
              "comments": [
                {
                  "score": 15,
                  "content": "CompSci is filled with sexist garbage, it’s a hard space to navigate. He didn’t create that mess.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's a not-usual-but-still-happens compsci thing. My bestie has a masters in AI and she still refers to everyone in her past school experience and at her job as they to avoid the gross ridicule or targeting of men trying to find their manic pixie dream girl. \n\nShe has a gender neutral name and uses anime pictures as her profile, so sometimes men develop a rapport with her before they know who she is, and you can't always tell if someone's gross or creepy until a woman is brought up, and she has to continue to work with those dudes so she'd rather just avoid opening herself to it as much as possible.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 53,
      "content": "[deleted]",
      "id": 17,
      "comments": [
        {
          "score": 13,
          "content": "I brought that up with them and they claimed something like, if I used she, they would assume it were her as we sit together in class and there are not many other women.\n\nI do not know for sure if they would have disliked another woman, my friend gets made fun of and outcast more because she likes to dress up and they find that amusing. She does stand out and look out of place compared to the others but she is a cool and nerdy person like everyone else.",
          "id": 18,
          "comments": [
            {
              "score": 7,
              "content": "I honestly feel like you deserve more grace here, it's obvious your intentions were good and you're taking criticism well. Comp sci is such a weird social environment and you're soaking that up every single day, of course you're subconsciously doing whatever decreases the social friction in your life. Everyone does that! Now you know that you just need to consider more the experience of the women around you and how your actions affect them. I honestly you just need to bring this up with your friends, kinda debrief the situation, ask them to share their experience, and then ask what more you could be doing to be an ally to them. Everyone wins when you do that, because remember, soft skills are increasingly important in today's tech world. You really need to know how to deal with people, and your professional network will do just as much for you as your hackathon cred, if not more. Keep your friends close, learn how to deal with sexist idiots, and keep building that project portfolio.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 50,
      "content": "Look, NTA, but you NEED to stand up for the women in your life. Stop using \"they\" when you mean \"she\" (although it's a fantastic habit to use \"they\" before you know someone's pronouns, and obviously when that is their pronoun), and stop tolerating sexist behaviour around you. Obviously you have to pick your battles and can't fight every single comment in every single situation, but don't just sit there and let people speak that way about women. Same with the racism. Often, people won't listen to the marginalised group they're being awful to, they'll only listen to people like them. It's shitty and gross, but we need allies like you to help us.",
      "id": 20,
      "comments": [
        {
          "score": 2,
          "content": "Just a nitpick, but in most engineering jobs that I've had, we've been specifically instructed by HR to avoid all gendered pronouns unless told otherwise by the person we are assigning gender to. That is to say, we should always default to they and them except when told by that specific person to do otherwise. So really, OP should ask OP's friend how they want OP to refer to them when talking to others about them.",
          "id": 21,
          "comments": [
            {
              "score": 3,
              "content": "I agree that defaulting to they/them is correct, especially in a professional setting, but in this case it seems like OP very much knows his friend's pronouns and is avoiding them to avoid being associated with a woman by these jerks, and that's simply not good allyship. Going by both the post and OP's comments.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "NTA\n\n>They claimed it was not about her being a woman just that she sucked\n\nBut she got first place on a team of just 2 and they couldn't complete their project. So who sucks?",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 24,
      "content": "NTA. Regardless of what the rest of the group claimed it seems like they either a) don’t respect her as a comp engineer because she’s a woman or b) just don’t like her personally. In either case it’s super rude to publicly boot someone off a team project. Good for you for taking up with her; obviously she doesn’t suck since you guys won.",
      "id": 24,
      "comments": [
        {
          "score": 9,
          "content": "We did good and our project looked polished since she has great skills and did some work with graphics and lighting but I would say that these competitions are judged subjectively and it depends on being lucky as there were other good projects.",
          "id": 25,
          "comments": [
            {
              "score": 14,
              "content": "She subjectively didn’t suck then. If your original team hadn’t sucked by booting her they could’ve won too.",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "> but I would say that these competitions are judged subjectively and it depends on being lucky as there were other good projects.\n\nWhile that is definitely true in my experience as a judge and former organizer for hackathons, it's not biased as lots of people assume it is. Polish and presentation make the biggest difference in final scoring but they don't make up for a failed demo.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "NTA\n\n> 2 of the team members were very mad at me and called me an AH, told me some nasty things about me being a \"simp\", white knight and saying we only won because of her \"pussy pass\" and that I probably did all the work. \n\nThese two team members are the only people being assholes in this story.",
      "id": 28,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "ESH. \n\nThey suck 98%. For very obvious reasons that you seem completely aware of. \n\nBut you suck a little bit too. You knew what their reaction to a female addition would be. Which is why you very consciously used \"they\" instead of she. You may not have known exactly what would happen, but you knew they wouldn't like it and that they are ridiculously sexist. It's a crappy situation to put your roommate into. \n\nCongrats on winning! I'm glad you two ended up winning. Now you know a team of you two can be incredibly strong! :) \n\nBased on your replies to comments similar to this one. I'm pretty sure you've already figured out what you did wrong and won't do it again. Which is awesome and such a nice thing to see on reddit!",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NTA and way good on you for beating those stupid sexists.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "Post is fake imo, another underdog story...",
      "id": 31,
      "comments": [],
      "relation": "No"
    }
  ]
}