{
  "post content": "My daughters (11/10) both have purple hair. They love it this way and have been getting it dyed since they were 6 (with caution). They were invited to a little girl's birthday/Halloween party under the condition they have their hair dyed a natural color. I asked why and the mother insisted their hair would take away from birthday pictures cause they'd draw attention. I asked if my daughters could just not be in the pictures and she said there's no way to guarantee that and to either dye their hair a \"normal\" color or they can't come. I said fine (this was like October 8th maybe the 9th) so I decided to throw a party for my daughters on Halloween since they won't be able to go to that one and invited her classmates (the girl was in a completely separate class). We had the party; cake, bounce house, candy piñata and all that cool jazz. The girls had a blast and I posted a few pictures online.\n\nApparently this was the wrong move cause the little girl's mother saw my post and asked what right I had to steal her daughter's moment from her. Her daughter saw the pictures and was upset she didn't get to come to the party because they didn't have the things we did. Her mother said I was an asshole for one upping her just because my kids couldn't come to their party and that if I really wanted them there I would've just dyed their hair. AITA?\n\nINFO:The invite was on the 8th as was the hair dye request. A week after we RSVPed in the negative. I planned a Halloween party on the same day , October 31st / Halloween.  I did not throw a party on some obscure day that happened to be her birthday for the giggles and the pettys, it was a Halloween party on Halloween.\n\nINFO PT2: That lady is in a completely different tax bracket than me. She had a pony, assorted teas catered and a wagon ride as well. The party I threw was a Frankenstein bounce house my husband had from a few Halloweens ago, a few piñatas from party city and like $120 of candy and about $100 in snacks and some basic carnival games (corn hole,balloon darts, sack race). -for those who where wondering what the difference between the parties were-",
  "id": 1,
  "comments": [
    {
      "score": 7693,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 2501,
          "content": "Yeah. OP technically did nothing wrong & the bday girl's mom was an AH - but this still feels really petty in a dirty kind of way.\n\nOn some level (albeit probably not all) OP clearly threw this party as an FU to the AH mom. And, I'm sure she felt some joy in sticking it to that lady. But, the bday girl was caught in the crossfire of not being able to go to her friends' party and having a less fun event. \n\nEh. This isn't a feel good petty revenge story.",
          "id": 3,
          "comments": [
            {
              "score": 13389,
              "content": "OP had every right to have a party for her girls, who were deliberately excluded from the other party based on how they looked. \n\nAnd why on earth would the other girl's mother show her the pics? Who was she trying to make feel bad?",
              "id": 4,
              "comments": [
                {
                  "score": 1842,
                  "content": "You win.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1401,
                      "content": "Yep, she was trying to use her daughter being upset to guilt trip OP and show that OP was 'in the wrong' and was the 'actual one' being a butt.\n\ntbh I was going to say E S H until I saw that it wasn't on the girls birthday, they were in different classes and the mother was trying to dictate OP's girls hair choice (which would have made the mom an automatic AH anyway).\n\nIm assuming that the little girl wasn't invited to her daughters party because of an age difference (different classes and also the other girl being described as 'little girl' makes me think so).\n\nSo I think the only way she probably would of heard about the party was through her mom seeing as how they probably were also in different age ranges and not just different classes.\n\nimo this makes this even worst because her mom stopped people from going to the party who she wanted to invite just because of their hair colour AND showed her pictures of their party that was 'better' than hers, which she couldn't attend.\n\nIf she was friends with OPs daughters it probably hurt their relationship unfornately.\n\n**Also its a halloween party, what's the difference between dyed spooky hair and a wig/extensions?**\n\nCostumes are SUPPOSED to draw attention, how is she to guarantee that OPs daughters just wouldn't show up with a colourful wig? Or that other guests wouldn't? Was there specifications for other guests as well? What real difference would it make real versus wig?\n\n**Imo I feel like OPs daughters were singled out**, at the very least for their hair colour choice, possibly for the tax bracket difference on top of the hair 'issue'. Possibly worried about them being a 'Bad influence' just because of their hair?\n\n*(also ngl a pony and tea assortment doesn't sound like a halloween party, unless its like some British Victorian vampire stuff, and I feel like the mom may have chosen more of the things with the party than the girl...)*\n\nEdit: u/Kylynara pointed out in [this comment](https://www.reddit.com/r/AmItheAsshole/comments/qlf77y/comment/hj3ykc5/?utm_source=share&utm_medium=web2x&context=3) a very good interpretation of the scenario that kind of did make me think this is ESH territory (I said why in [this comment](https://www.reddit.com/r/AmItheAsshole/comments/qlf77y/comment/hj42p1w/?utm_source=share&utm_medium=web2x&context=3) and I am too lazy to retype stuff)",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 267,
                  "content": "Yeah, 10 and 11 year olds have absolutely no access to or even know about social media",
                  "id": 7,
                  "comments": [
                    {
                      "score": 262,
                      "content": "Wait…. Do ten year olds really use Facebook?? That seems insane to me. I feel old haha. Either way though, I can’t imagine that a lot of ten year olds follow/friend their friend’s parents, right…?",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 133,
                      "content": "Eh I have an 11 year old and I teach 11 year olds. No pity because your one job as a modern parent besides keeping them alive is to keep your kids off social media as long as possible. My kids haven't been anywhere near social media. My 11 year old vaguely knows that tiktok is a thing, but it's not that hard to monitor. They're not that smart yet. \n\nThe crazy thing to me is that people will act like it's impossible to keep 11 year olds off the internet but then also act like 11 year olds can't manage to walk somewhere alone or stay home by themselves.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "also, who says that none of the girls took pictures at the party and were showing them at school?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "/s",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I had a Myspace when I was 10 and I made a Facebook when I was 11.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "10 and 11 year olds probably aren't on Facebook, but to say they don't know about social media is ridiculous. Roblox, tictok, discord, there are several others. They just have 0 interest in Facebook.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I wouldn't bet on this one",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "orrrr all the kids that were invited were talking about it and showed their own pictures from the party?",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -11,
                  "content": "Yes and yes, but, did the OP actually exclude inviting the child who's mother was the asshole? Cuz... well... yeah he had the right but he was basically taking it out on the mother at the expense of the kids. Kinda shitty. Especially if the kids were friends with his kids.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 100,
                      "content": "The child whose mother was an asshole is in a different class. OP specifically said they only invited kids in the girls’ class. So it shouldn’t really have been an issue.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "If OP was doing the party on the same day as the other child's (and it was the other child's bday party as well as Halloween), then it would have been rude \\*to\\* invite her when OP already knew she had an event.  I mean, what is OP going to say?  \"Ditch the birthday party your mother has arranged for you, and come to my party?\"  OP would have been TA for that.\n\nBesides, OP says her girls and the other girls are in different classes, and OP only invited kids from her girls' class.  So while the birthday child was excluded, many of her friends from her own class would have been as well. It wasn't personal.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 828,
              "content": "Disagree - OP taught her girls that no one else gets to tell you how to dress / look or judge you on your appearance, and made sure they didn’t miss out on fun because of a personal choice (the hair) they shouldn’t be judged on. \n\nThey are in different classes, so it’s not as if they stole guests from the other party. It happened to be “better” which, yes, OP could have gone to town to be spiteful, but OP might also just be throwing the coolest party they know how because their girls were bullied by a grownup. \n\nOP is NTA, the birthday girl is also not, only the other parent is the A. Halloween is also a normal day for a party - it’s not like it was a random Saturday and this other girl’s birthday and OP had a party. \n\nAlso, how did the birthday girl SEE THE PHOTOS? Is she friends with OP, a random grownup? Sounds like the mum saw them and showed her daughter, upsetting her.",
              "id": 19,
              "comments": [
                {
                  "score": 229,
                  "content": "I also think a person who has pre tween daughters with purple hair, has a really good chance of really loving Halloween.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 109,
                      "content": "As a 50+yo physician with Blue hair, NTA and other-mother sucks.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I still don't understand why purple hair was an issue at a birthday/HALLOWEEN PARTY.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 664,
              "content": "Petty? OP threw a party for their daughters to make up for them being unfairly excluded from one. OP didn't know what the party had or hadn't - there's no desire to one up anyone, just to do right by the girls. \n\nThat the birthday girl was caught is entirely the making of the other parent. This is a real \"look what you made me do\" situation on the part of bday mom that you're trying to justify here.",
              "id": 23,
              "comments": [
                {
                  "score": 230,
                  "content": "Seriously, who throws a party on halloween weekend, be a birthday party or what, and says no unnatural hair colors.  What on earth",
                  "id": 24,
                  "comments": [
                    {
                      "score": 128,
                      "content": "That birthday girl’s mom had a lot of nerve telling OP to dye her girls’ hair a “natural” color for the party.  F*ck her and the pony she rode in on! NTA",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Someone who lives in Victorian England as this woman clearly does (the catered teas kinda gives it away). I'm just surprised she cared about how the hair colors would show up in pictures since the photos would be black and white.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 558,
              "content": "> OP clearly threw this party as an FU to the AH mom. \n\nShe threw a party so her daughters could attend one since they had been uninvited from another one. If not wanting your kid to be bummed out and excluded is an FU then oh well.",
              "id": 27,
              "comments": [
                {
                  "score": 404,
                  "content": "It's a great lesson in life, to know that you don't have to sit around feeling bad that you're not invited to something, you can make things happen for yourself. \n\nIt doesn't sound like OP tried to sabotage the other party by inviting exactly the same people. \n\nI agree, NTA",
                  "id": 28,
                  "comments": [
                    {
                      "score": 116,
                      "content": "Yup. And that’s lowkey a part of what the other mom is mad about. That her uninviting them after they declined her entitled request didn’t have them all sad and depressed. \n\nShe was thinking and hoping that they would “suffer” for not bowing to her request and that they’d be the sad and jealous ones after hearing about her daughter’s party but they said “ok we won’t come” and went and did their own fun thing.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 82,
                      "content": "The real lesson here is that purple-haired girls have the best parties. OP should give her daughters a box of purple hair dye to give the AH’s daughter as a present. Also generally encourage them to be nice to her, it seems she needs it.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Great point!",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Seriously. I wished I learned that at a young age!",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 316,
              "content": "So OP should’ve let her kids feel bad about being excluded?",
              "id": 33,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 281,
              "content": "OP technically chose to throw a party for her children who were excluded. Her children probably felt horrible when they found out the only way to go, was to change their appearance. \n\nAs a mother, I think OP did an amazing thing by giving her daughters a little party. You are assuming that she was trying to “one up” the other girls mother but how? How would OP know what would be offered at the other party? She didn’t.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "Its not petty. The girls knew about the Halloween party that they were not invited to. Were they ment to just not party on Halloween because this parent decided to exclude her kids?\n\nShe came up with a perfectly reasonable way for her kids to still be able to enjoy their day.\n\n\n>and having a less fun event. \n\nIf you look at OPs edit she had a bangin event, just a different one. She's a kid, she wanted to go to all the parties. But it's definitely her mom's fault her friends weren't at her party and that they even had their own.\n\nThe reason that their hair would distract from pictures is ridiculous, because that's who they are and it's a Halloween party. More likely she just doesn't agree with them having their hair dyed and tried to play my way or the highway and got pissed when OP chose the highway and threw an awesome party.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "I don’t think it was a petty move. I would have done the same to minimize the heartbreak of my children and to make them not feel like they were left out.  My daughter has been left out of things because of one mean mom that pulled strings and it broke my heart to see her hurt like that.  \n\nBut maybe I’m looking at it from my perspective.  In my case it wouldn’t have been for petty revenge. I can’t really speak for OP.  But NTA.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 132,
              "content": "I feel like you saying that on some level it's clearly an F U says more about you and your experiences than it does about Opie.  It gave me warm fuzziness of missing my mom because she would have wanted to stand up for my bodily autonomy, and to have my friends over and be happy instead of seeing me feeling hurt and excluded. She would have done it without a bit of malice. She'd just want me to keep the purple hair I've been dying for 28+ years now.  I'm well aware of the difference in intents because I'm a petty bitch of the revenge is a life well lived sort, and my mom was simply the good-hearted if their party excludes people we will throw a party for the misfits and castoffs. Some years she got a dozen mothers day cards. I Was her only offspring. \n\nMaking up and being insistent about a subtext isn't nice.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "I feel good about it.",
              "id": 38,
              "comments": [
                {
                  "score": 109,
                  "content": "ikr? What gives anyone the right to police who gets to throw parties on Halloween, and who doesn't?",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 119,
          "content": "It seems like an especially stupid rule being that costumes are specifically meant to not look natural and many include wigs. Does that mean the kids couldn’t dress up put in any make up or wear hats because that would also stand out. I agree I feel sorry for the the girl but OPs kids shouldn’t be penalized either because that girls Mom is so weird and controlling.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "Any parent who thinks they can make choices for someone else’s children is weird and needs some form of therapy. NTA.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "NAH I though I had heard it all with Bridezillas, but now 6 year old kids are being asked to special dress and style for a birthday party? Please, let the insanity stop. You didn't steal anything, but provided your daughters with a happy, carefree, no-dress code required time, to make up for being excluded from someone else's \"moment.\". Hopefully, the other mother will learn something about trying to micromanage other parents and their kids.",
          "id": 42,
          "comments": [
            {
              "score": 12,
              "content": "FYI NAH means 'noone's an asshole'. Which would include the other parent. If you think OP is fine and the other parent is an asshole then it's NTA (not the asshole).",
              "id": 43,
              "comments": [
                {
                  "score": 8,
                  "content": "I've been thinking all along that it meant No Assholes Here, lol",
                  "id": 44,
                  "comments": [
                    {
                      "score": 8,
                      "content": "You're right, it is \"No Assholes Here\"",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "So you don't think the other mother is an asshole?",
              "id": 46,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Agreed.  The hair was such a non-issue in the first place, but if \"don't take pictures\" was too big of an ask, there's always editing the pictures later.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "The only AH I see here is that little girl’s mom",
          "id": 48,
          "comments": [
            {
              "score": 13,
              "content": "She played a control game and lost.  \n\nShe had a fancier party.  Her daughter got jealous of the things she didn't have.  A girl down the street from me was like this.  My friend and I would play old school MLP.  The only buildings we had were the nursery (her) and the dance school (me).  This other girl had the stables, a couple other things, THE MANSION...and all she cared about was being jealous of what she didn't have.\n\nThis should have been a good learning opportunity for the bday girl\n  \"Honey, you had a pony, carriage rides, fancy sandwiches...you can't have EVERYTHING at your party.  If you want a bounce house and piñatas we can do that next year.\"  Boom.  Done.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I mean, the one time that purple hair wouldn't stand out would be Halloween, right? If I were OP and wanted to be extra petty, I'd have colored hair spray on hand for all the kids coming to my daughters' party and take a picture of all the kids with brightly colored hair.",
          "id": 50,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": ">Nta I feel bad for the little girl \n\nWith a mom like that, she's condemned to a life of therapy once she gets away.",
          "id": 51,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -12,
          "content": "Unpopular opinion, but its also a dick move to purposely throw a party on the exact same day as the bday party.  That's obviously going to divert guests. If OP had scheduled her party on the 30th, then she would be solidly not an ass and just an all round great mom. Her kids still would have had a blast and had trick or treating to look forward to on the 31st. No hurt feelings all around.\n\nBday girl will suffer enough due to the antics of her batshit mother. There wasn't a good reason to purposely double book the day. The girls are friends so it doesn't seem like the kid takes after her mom and she shouldn't have to suffer. ESH.",
          "id": 52,
          "comments": [
            {
              "score": 933,
              "content": "NTA\nI disagree. Halloween is up for grabs to anyone. Just because it's someone bday doesn't mean someone else can't throw a party. Not only that the bday girl wasn't even in OPs kids class. Maybe the mom will learn not to exclude people because of how they look, but I highly doubt that.",
              "id": 53,
              "comments": [
                {
                  "score": 519,
                  "content": "I agree. If it were a random weekend, it would be weird. But it is a holiday. Makes sense to have the party on the holiday.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 276,
                      "content": "[removed]",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "Not only that, but the birthday kid wouldn’t have even known if her mom hadn’t shown her the pictures!",
                  "id": 56,
                  "comments": [
                    {
                      "score": 81,
                      "content": "yeah. the mom made sure her kid found out--she hurt her own kid on purpose.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "Exactly! I feel like I’m in the twilight zones reading these comments. \n\nNTA In what world was it okay to force hair dye on children for pics? Like this can’t be real. \n\nPurple-haired kids’ mom made the best of a batshit situation if her kids were being excluded for hair color. Party on, kiddos!",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "Agree…if it had been the same class I’d maybe agree but it didn’t sound like overlap of kids…the other girl was upset because her party didn’t have the same fun things.  Didn’t say anything about not having friends at her party.  Also she would have preferred the other party.  Other mom was an idiot for excluding because of hair color! NTa",
                  "id": 59,
                  "comments": [
                    {
                      "score": 26,
                      "content": "OP’s kids invited their classmates, but the birthday girl wasn’t inviting just from her class, since if that had been the case OP’s daughters wouldn’t have been invited even with natural hair. Still doesn’t seem like the girl was abandoned, though. \n\nETA: And I agree it’s not reasonable to expect that nobody else will have a Halloween party, even if it’s someone’s birthday.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "My birthday is on Halloween and I’ve long accepted that it’s a complete free-for-all in terms of planning. No one gets to earmark Halloween, as much as it irks me.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah, the sucky thing about birthdays on Halloween and Christmas is that you really don't get to be mad about people doing other shit on your birthday.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 245,
              "content": "they are in different classes. it happens all the time.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 223,
              "content": "1. The girls are in separate classes and OP only invited kids from her daughter's class\n2. The birthday party was on *Halloween.* One of the most common nights of the year for parties. I went trick-or-treating down only two blocks in the early evening with my small children this year and saw a half dozen Halloween parties with children (either for children or mixed age). You can't hold a party on that day if you don't want other people to also have parties on the same day. It's like throwing a dinner party on Thanksgiving, other people are going to be hosting meals too.",
              "id": 64,
              "comments": [
                {
                  "score": 53,
                  "content": "In the same vein, why should OPs kids be unable to have a halloween party, just because they weren't invited to the birthday one. It sounds like OP even mostly managed to avoid overlap of the guest lists.",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 46,
                  "content": "Agree. It’s my dds (10) birthday today and we did something early Sunday. Another mom asked if it would encroach on our dds day if she held a Halloween party that night. I said of course not, it’s WHY I did dds early in the day… so we just had more festivities than you could shake a stick at last weekend 😊",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "Op didn't have the party the same day.  She reiterated the little girl's was on Oct. 8 or 9 and op held her daughters' party on Halloween.   The mother even complained bc their party didn't have all of the things op provided.",
              "id": 67,
              "comments": [
                {
                  "score": 105,
                  "content": "I think they were invited back on the 8th or 9th. But the birthday party was a Halloween party. I could be misunderstanding.",
                  "id": 68,
                  "comments": [
                    {
                      "score": -3,
                      "content": "I don't think so though since her mother stated the girl was upset that they didn't have the same things at their party; not that it was on the same day.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "The original party was a Halloween/birthday party, so it is reasonable to assume it was on Halloween weekend, if not on the 31st. \n\nOP’s comment is a bit unclear, but I believe that the 8th-9th is when OP made the decision to throw the party, but did not schedule the party on one of those dates.",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "I think OP meant the other mom told her this on October 8/9, and the party was on Halloween",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "[Same day](https://www.reddit.com/r/AmItheAsshole/comments/qlf77y/aita_for_throwing_a_party_for_my_daughters_after/hj2x7hn/) on Halloween itself.",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "They were invited to the Halloween party on the 8th or 9th.  It didn't happen that day. They had the parties on the same day.",
                  "id": 73,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "They were being excluded from another party. They knew it was happening on that day. It wasn't a dick move to cheer them up with their own party.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Slightly different situation - but when I was in college there was a girl who specifically hosted all possible friend events and specifically excluded me because of some stupid ex drama. Everyone knew it was petty but just went along with it not to rock the boat. I finally had enough and said to my supposed friends \"this is wrong and all it would take is one person to say 'this isn't okay' for me to actually be included. That's all it would take.\" Three weeks later of those people held a party to celebrate one of their own achievements - that just happened to be at the same time as the party I was excluded from. I will never forget that kindness.\n\nMom did exactly what she needed to do to support her daughters in this instance. They won't forget. I feel sorry for the birthday girl because it was not her fault, but it is not OP's responsibility to adhere to the slight not to rock the boat.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "I beg to differ, OP is NTA. The other mother excluded her kids over their hair colour and OP didn't want her kids to be upset so she threw their own party for her daughters. The only AH here is the mother who excluded OP's kids over some absurd rule.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": ">but its also a dick move to purposely throw a party on the exact same day as the bday party\n\nno its not, do you think that anybody who ever has to interact with this kid or her mom suddenly cant have a halloween party?\n\ndo you expect OPs kids to just sit at home because they arent invited to her party due to their hair?\n\nthey arent friends, just at the same school",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "I would agree with you if it wasn't Halloween,  but it's a normal \"party day\" so it makes sense",
              "id": 78,
              "comments": [
                {
                  "score": 34,
                  "content": "Yup. Husband's birthday is New Year's Eve. I just say the world is throwing thousands of parties for him ... then we just hide at home with booze and cake.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Disagree. It would be one thing if it was a random day. But lots of people have Halloween parties regardless if someone else is having their birthday party that day. Unfortunately that is a reality of having birthdays during major holidays.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6453,
      "content": "NTA. What a controlling person. Yikes. She tried to punish your kids for their hair colour.",
      "id": 81,
      "comments": [
        {
          "score": 1493,
          "content": "Totally WTF kind of ridiculous gatekeeping is this?? It's for a flippin' birthday party - on *Halloween* no less, when unusual hair colours are more common. I could almost understand if it were for a formal event like a wedding, but even then asking someone to change their hair colour is pretty iffy. But for a child's birthday photos? Has she ever even looked at pictures of herself from childhood - NOTHING ages well over time. There's a reason r/blunderyears exists. \n\nNTA OP - not even a little.",
          "id": 82,
          "comments": [
            {
              "score": 380,
              "content": "You just know the horrible mum was one of those brides who dictated hair colour and other bs to her bridal party and immediate family.",
              "id": 83,
              "comments": [
                {
                  "score": 169,
                  "content": "Or worse - hair length. I’ve heard stories of brides demanding their bridesmaids grow their hair out to be identical lengths/styles, because short hair was “not feminine enough.” So dumb.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 186,
                      "content": "**My best friend was forbidden from going to her (adopted) sister's wedding because she wouldn't grow out her bangs.** \n\nHer sister's argument was she looked \"too Asian.\" My friend IS Asian and just happens to have bangs. \n\nShe ended up not going and cut her sister out. \n\nPeople are assholes.",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 49,
                      "content": "I just read on a sub here yesterday where the bride made her bridesmaids all wear blonde wigs. And apparently they all did without complaining. WTF?",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "There was one about a bridesmaid being told not to wear her glasses too!",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If anyone asked someone to change hair colour, even for a wedding then nah they are still an asshole.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Kids using temp hair dye on Halloween is also super normal anyway. You see those colored hair sprays every year. Did she tell all the other kids they're not allowed to use anything like that if they come or did she just single out OPs kids? How does she know no other kids may decide that dye their hair for the holiday?",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 150,
          "content": "NTA, I’ll bet her daughter has been asking to dye her hair and because of your girls the mom can’t say, “you’re too young to dye your hair.” Mom probably thought she could solve the “problem,” if your girls went back to natural colors for several days (I doubt it’s healthy for hair to dye it multiple times within a day or two so your girls would be non-purple for a bit) her daughter would stop asking.",
          "id": 90,
          "comments": [
            {
              "score": 34,
              "content": ">I doubt it’s healthy for hair to dye it multiple times within a day or two\n\nYou’d be correct. Depending on the purple dye used and their natural color, OP’s girls are probably using a direct pigment dye (very common for fantasy colors,) and may not even need to bleach it first if they have light hair. (That’s how I dye my gray hair pink and purple.) But stripping out the purple and putting a “natural” color over it is a damaging process, and may mean that re-doing the purple would become more difficult, not take the same, and damage their hair. Changing color without damage is a long process of gradually fading the original color until you can cover it with another. (Which is why I stick with pink/purple. If I tried to go green, it would just turn muddy unless I gave it several months for the pink to completely fade, being just gray in the meantime, or worked through the color wheel of pink, purple, blue, then green over six months or so.)",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "Seriously if someone told me to change my kids hair I would tell them to fuck off",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Seriously. I’m the mom of 2 boys. I always have unnaturally colored hair (split red and black right now). My fiancé has teal hair. My boys often have purple (oldest), and blue and pink (youngest) hair. I absolutely would not put up with this bs. Guilt tripping, controlling, attention seeking AH mom can shove it.",
          "id": 93,
          "comments": [
            {
              "score": 3,
              "content": "Love it!",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "My daughter had bright pink hair for a while when she was a teen. I loved it. It looked good, and made it easy to find her in a crowd. I couldn't believe how many of my peers (not even relatives) would ask me how long I was going to \"put up with that\". People are really weird.",
          "id": 95,
          "comments": [
            {
              "score": 7,
              "content": "When I was a teen my mom used to reply that with what teens do these days, if she wants to dye her hair and wear black, that's it, I'm pretty damn lucky. \nShe still doesn't care now that I'm in my thirties and have peacock inspired hair!",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "That’s so cool. It’s harmless self expression. I think it actually encourages them to know they can have control over their own bodies and what they look like.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I dyed my boys' hair blue last year, they were 7 & 5. My hair was purple at the time. When people asked me why they had blue hair, I said it was genetic. 😂",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3086,
      "content": "NTA, what a bizarre request of the mother. If she didn’t throw a fit about your daughters hair Color then they could have been at the party.",
      "id": 99,
      "comments": [
        {
          "score": 373,
          "content": "How about he suggests to the mom that she colours her daughters hair blue or green so she can stand out in her birthday photos?",
          "id": 100,
          "comments": [
            {
              "score": 60,
              "content": "I'm pretty sure the mom doesn't think those colors are appropriate in general",
              "id": 101,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah. Right ones are pink and orange, or nothing.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "[deleted]",
          "id": 103,
          "comments": [
            {
              "score": 8,
              "content": "I thought that too! My malicious compliance would be to dye the hair then wear costume wigs. Giant purple clown wigs would look nice in photos.",
              "id": 104,
              "comments": [
                {
                  "score": 2,
                  "content": "Hahah! I would two",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "That’s the thing. Why can’t kids have purple hair for Halloween?",
              "id": 106,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2372,
      "content": "NTA. Actions have consequences. She decided to be a mean girl to your daughters just because she didn't like their hair. You decided to do something nice for your children since she was excluding them based on their hair color. I find it odd she cared so much about your daughters hair color.  I would think dyed hair would be ok for a Halloween party.",
      "id": 107,
      "comments": [
        {
          "score": 441,
          "content": "I didn’t even register that this was a Halloween party! Very good point, it wouldn’t be out of the ordinary to me regardless of the day, but especially near Halloween? So weird of the mom.",
          "id": 108,
          "comments": [
            {
              "score": 145,
              "content": "The dyed hair wouldn't have matter to me either way. I just found it extra odd that she would have a problem with purple hair at a Halloween party. Well I assumed it was a Halloween party since it was happening Halloween weekend. \n\nI just reread OP's post. It said it was a birthday/Halloween party",
              "id": 109,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "She’s jealous",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "it's a birthday party. Their birthday probably just happens to be on Halloween",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "She was curating the aesthetic for SM, and purple hair does not fit a pony ride tea party look.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1247,
      "content": "Oh my god, NTA. \n\nThis woman wanted your daughters to change their hair color for her daughters birthday party?? What the hell? What an entitled mom and (maybe) kid! You pulled the right move by putting your kids first and offering them and their friends a good time.",
      "id": 113,
      "comments": [
        {
          "score": 187,
          "content": "Right. Its not a Catholic wedding",
          "id": 114,
          "comments": [
            {
              "score": 222,
              "content": "As someone who has been to many a Catholic wedding, including as a member of the bridal party, I had my hair dyed purple every time, lmao this mum is ridiculous, people huh",
              "id": 115,
              "comments": [
                {
                  "score": 28,
                  "content": "Fair. I wrote just wedding at first but it's still an obnoxious demand. No offense I was just trying to think of a very conservative wedding. It is ridiculous",
                  "id": 116,
                  "comments": [
                    {
                      "score": 40,
                      "content": "LOL, the last Catholic wedding I went to, the groom is half Jewish and  the maid of honor was a lesbian (she still is, but she was too),  and one of my friends in the bridal party has purple hair. I'd guess most Muslim weddings would be much more conservative.",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "No! You misunderstood, I meant more, this is so ridiculous even Catholic weddings are chilled, :) sorry lol",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "A priest once complimented my pink hair.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Nice",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Catholic weddings aren’t a big deal lmao they don’t really care \n\nIronically enough tho my school (all girls Catholic) has a requirement for graduation where 1 we have to be wearing a floor length white dress (essentially a wedding gown) and 2 we can’t have our hair dyed a non natural color unless we had it dyed already (so we don’t “stand out” too much)\n\nIt’s so fucking dumb",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That some definite entitlement. And if the friends ask them why they had to dye there hair, who would not feel guilty if one of my friends had to change the color of their hair just to come to my party. I would feel guilty too for that one.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 811,
      "content": "NTA. Most of my kids and friends couldn't have gone to that party either.  They all have at least a streak of bright colored hair.  That is the oddest request for a tween party.  Also why do her kids have any access to your social media posts?  They aren't old enough for most sites",
      "id": 123,
      "comments": [
        {
          "score": 468,
          "content": "If I had to guess, she probably saw them through her mother. I know some kids have social media and I'm not sure about her.",
          "id": 124,
          "comments": [
            {
              "score": 286,
              "content": "If her mother is that controlling and possibly narsistic she may have intentionally showed her own child the photos and said something along the lines of \"see they are having a good time without you all because they wouldn't change their hair color\" but of course thats just speculation from someome with a narsistic upbringing",
              "id": 125,
              "comments": [
                {
                  "score": 20,
                  "content": "This. I can see this happening.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Right? The other mother is trying to control another childs appearance at such a young age. I highly expect she is willing to shame or bully her own daughter in spite to get back at Op (again this is in theory that the other mother is a narcissist) which would make Op NTA",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "\"wow, why would you intentionally upset your daughter by showing her these pictures? What a horrible thing to do. \" is what my petty ass would say back hahah",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 116,
          "content": "My suspicion is that the other little girl has been asking for purple (or other novelty colors) hair and that other mom didn't want OP's kids to \"encourage\" the little girl.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 476,
      "content": "NTA. If she wanted her daughter's moment to be special, she should have let her friends come without being an unreasonable person about some cool colored hair.",
      "id": 130,
      "comments": [
        {
          "score": 227,
          "content": "You know, there are natural shades of red hair that are nearly as attention grabbing as purple.  She might not have liked them any better. \n\n(I (74F) am biased because I have purple hair. It was either purple or gray/white.)",
          "id": 131,
          "comments": [
            {
              "score": 65,
              "content": "You go girl! I'm in my late 40s and I've been bringing my own sunshine with me with my bright yellow hair for years.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Mine alternates between dark red or violet. Because my gray hair definitely doesn't do anything for my complexion. I've made my granddaughters promise to keep me in hair dye when I'm too old to shop on my own (and to help me tweeze when my eyesight fails!)",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "As an almost 40yr old with a mixed flame version of electric blue & bright purple 4in mohawk, I absolutely LOVE this 💜💜💜 \n\nLife is short & the world is is shitty & gray enough as it is, find joy where you can, we can all use a lil more color in our lives 🤩🤩",
              "id": 134,
              "comments": [
                {
                  "score": 2,
                  "content": "I don't think a Mohawk would work for me because I've got an odd ridge and divot in the side of my skull. I just don't think that the world is ready for that.",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "She probably would have complained about freaking Merida running around.",
              "id": 136,
              "comments": [
                {
                  "score": 4,
                  "content": "I mean, come on, freaking Merida would have taken away the attention from the bride and we can't have that!",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "i am 62  and i also have purple hair that would be grey otherwise.   Mine is dark purple and best friend's is bright pink.",
              "id": 138,
              "comments": [
                {
                  "score": 3,
                  "content": "The only reason mine isn't Joico Sapphire or Ruby is because my hair needs at least one more cut before it can handle the bleach wash it needs to grab the color. The past 2 years have not been kind to my body - but once I get my booster maybe I can do more to regain lost ground.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I didn't want anything permanent and decided that Celeb Viral shampoo and conditioner would work best on my dark brown, gray, and white hair. The more gray I get the more purple it looks. If I live long enough to get completely gray I may try other colors. Fuchsia, I think. Or fuchsia to purple since my hair is fairly long.  Or pink to fuchsia to purple. \n\nI tried Keracolor clenditioner but it didn't have the zing of Celeb. I think it might be the lighter anti-brassy-blonde version, not the seriouspurple. Punky Color purple is a bit pinker but otherwise fine. However, I can do the Celeb myself, in the shower. I have a photo from my last haircut. This would be a hair tax, like the requisite cat tax.\n\nI've been thinking about having a violet and brown pit bull as a fashion accessory but suspect my bath-hatiing dog might object. I flinch at the prospect of an escaping dog anointing the white tile floors and pale gray walls.",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My nine year old son has bright fuchsia hair (his choice). Love it. He's gotten so many compliments on it!",
              "id": 141,
              "comments": [
                {
                  "score": 6,
                  "content": "I was in line at Sally's behind a boy about your son's age a couple years ago. He was going fuchsia but was about a dollars short (sales tax, maybe), so I spotted him the buck, wanting to encourage him in his individuality.  The  clerk looked at me questioningly and suggested that getting something else, I forget what, would improve it and I sent him after that, too. Kid seemed a little shocked that an old lady was so supportive. This was before I went purple. \n\nI felt like telling him, \"Old isn't dead, kid,\" but decided he didn't need any more shocks to his world view.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 387,
      "content": "My first instinct is.... NTA I guess but is this what having kids is like?\n\nBut for real.. INFO- did you steal any of the birthday girl's guest list? Cuz that's important.",
      "id": 143,
      "comments": [
        {
          "score": 466,
          "content": "Not that I know of. She had more people there than us",
          "id": 144,
          "comments": [
            {
              "score": 234,
              "content": "So what was her complaint exactly? Your OP said you invited kids from a different classroom. Here you confirm no guests were stollen. Sooooo I don’t understand what the grievance is. That you also had a party?!",
              "id": 145,
              "comments": [
                {
                  "score": 141,
                  "content": "Because that little girl is the only one who deserves a Halloween party /S",
                  "id": 146,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 129,
                  "content": "If I have to guess, she didn't want OP's kids to be happy cause of their hair / was butt hurt that OP defied her.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 70,
                      "content": "That's my thinking. She probably doesn't even care about the party itself, just wanted them to think that unless they conform to what is considered proper then they will be excluded but because op is a great parent they didn't \"learn their lesson.\"",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "> If I have to guess, she didn't want OP's kids to be happy cause of their hair\n\nI'm guessing that her daughter has been asking to dye her hair because she liked the way OP's kids looked, and so the mother thought she could trick them into getting rid of the dye.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "Because that posh mom felt embarrassed not knowing ten year olds are arent interested in tea and ponies when there’s a Halloween themes bouncing castle. I’m sure the girl had a wonderful party but afterwards when they found out OP dared to have a Halloween party herself, they took it as a personal vendetta. It’s like being mad at people who RSVP no to your Christmas birthday party if they then go to their own, totally normal and expected Christmas holiday.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "According to the info in the post I got the idea that when the women's daughter saw the pictures that she was jealous of the activities that OP had available at her party.\n\n\"Her daughter saw the pictures and was upset she didn't get to come to the party because they didn't have the things we did.\"\n\nI'm guessing since the mother complained that OP upstaged her, that her daughter thought OP's party would have been more fun.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "She’s mad because ops party was better",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 115,
          "content": "Why would that matter?  If other kids or their mothers find that woman unpleasant, why should they not have an option?",
          "id": 153,
          "comments": [
            {
              "score": 60,
              "content": "It would matter because if a grown woman throws a party with the express purpose of ruining another child’s party, that would make them an asshole. We know that OP was not planning on throwing this party until she felt jilted by the other parent. If OP also knowingly sent invites to the other party’s guest list, then that would be another clue into her potentially malicious intent. Actions usually don’t make assholes per se; it is the intent behind those actions that matters when determining whether someone is an asshole.",
              "id": 154,
              "comments": [
                {
                  "score": 66,
                  "content": "Imo the intent wasn't ruining another child's party but cheering up the daughters that were excluded, OP focus was solely on her girls not being sad on Halloween.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "If they did it's not on them, they RSVPd then organized their own party. Anyone who was invited to the other party should have already accepted and therefore been unavailable",
          "id": 156,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 245,
      "content": "NTA, that mom sounds too controlling - like a bridezilla of the kid's party.\n\n\nSide note: my daughter (10) would love purple hair but has dark brown hair. Do you have a dye recommendation for me that might work without having to bleach it? I have tried a couple but they don't show on her hair at all.",
      "id": 157,
      "comments": [
        {
          "score": 212,
          "content": "My girls are black/brunettes. I get their hair lightened professionally. I typically use Arctic Fox or Lime Crime on their hair.",
          "id": 158,
          "comments": [
            {
              "score": 60,
              "content": "Thank you for the tip. I might have to go the professional way as well. Her hair is to her butt I would hate to ruin it. I'm sure your girls look adorable.",
              "id": 159,
              "comments": [
                {
                  "score": 67,
                  "content": "Just to add - if she does get it lightened I would absolutely recommend Garnier Hair Food. You can use it as a conditioner, mask, or leave in, and the banana (for dry hair) and papaya (for damaged hair) did wonders for mine after I bleached it.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Omg yes the hair food. Does wonders on my curly hair",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Go to a beauty school if there's one in your area. The colorist will be closely supervised and it will cost a lot less. My daughter had it done many times as a teen.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "If she wants a few streaks of color, I can’t recommend enough getting clip-in hair extensions. You can take them out/ swap colors and you don’t have to worry about the vibrant color fading or growing out.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Make sure you hydrate the hair and use color protect shampoos. As long as the hair is properly hydrated and maintained she will be fine. :). I used to dye, straighten curl you name it to my hair and it used to be like straw. Then I got the proper shampoos and conditioners and I can do all of that but with little damage. My hair is actually commercial shiny now!",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "You could also try Overtone for dark hair before going the bleaching/lightening route. Their purples are really nice. Like Arctic Fox, they’re a semi-permanent color that fades with each wash (they have a maintenance conditioner so it last longer too).",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Wait, are your daughters Black with brown hair? Or do you mean they both have dark hair? \n\nThis party request is so odd I’m wondering… Because if they are Black and  the other mom is white, that would explain a lot. How many posts I have come across I’m with white moms having parties and trying to control/alter a Black child’s hair or appearance.",
              "id": 166,
              "comments": [
                {
                  "score": 46,
                  "content": "My kids are Korean/Hispanic . They have super super dark hair, like almost black. I say black/brunette cause those are the only colors I can think of.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Ah okay. My mistake! It’s just the strangest request I was trying to figure out what outside factors could be at play. For the record you were totally NTA. Good on you for letting your daughters be free to express themselves and for supporting them and modeling for them how to respond to someone trying to control you.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Just say \"have black hair\" lol. \"Are black\" is going to confuse people.",
                      "id": 169,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Don’t they get told off at their school for dying their hair?",
              "id": 170,
              "comments": [
                {
                  "score": 8,
                  "content": "Not that I know of. The only time it matters is dance class and they just have to keep it in a bun.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Not if they go to a public school lol",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Depending on how dark it is, overtone’s purple for browns might work. It’ll be more tinted than bright, but it should impart some color without bleaching. Fair warning - it can bleed, so use a cheap pillowcase that night. Or put in microloop extensions!  I have them in bright violet to add to my pink & blonde hair when I want some variety!",
          "id": 173,
          "comments": [
            {
              "score": 10,
              "content": "if you do use overtone, leave it on for WAY longer than they say. it wont hurt their hair bc its literally conditioner with color in it, but when i went from dirty blonde to purple with it and only left it on the recommended 20 minutes and it came out super patchy. leave it on probably closer to an hour, if not more. also, use HEAVY DUTY gloves, not the ones that come with it because they break easy.",
              "id": 174,
              "comments": [
                {
                  "score": 2,
                  "content": "That’s a good point!  I usually put my color on at lunch and wash it out after work (yay for WFH). I just cover it with a shower cap and let it sit.  Barkeeper’s Friend will clean up any spots in the tub or in the counter as long as you don’t let them sit for hours",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Second this rec! I have the rose pink on my dark brown hair, and I love it.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Thank you so much! The extensions might be better, anyway, she only wants a few chunks here and there.",
              "id": 177,
              "comments": [
                {
                  "score": 9,
                  "content": "I had the micro loop extensions in when I was younger and “testing the waters” on colored hair. They were great. Less upkeep for younger kids too.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I also have mine professionally lightened for some colors but would highly recommend the Arctic Fox brand for color. It's actually a stain & not a dye that shows up amazingly bright & lasts quite a bit without as much fading as other brands & doesnt damage the hair. Even using it on my naturally dark hair without lightening it first the darker colors show up pretty well\n\nI've literally left it in my hair during whole work shifts (10+hours) with no damage to my hair. Longer you leave it in, the more vibrant the color/longer it lasts & saves me from having to touch up the color lol. \n\nDefinitely recommend making sure you have gloves on for application AND especially rinsing though as it will stain skin pretty colors as well!! Didnt quite consider that part my first go round & my tiedye hands were fun 🙃😊",
          "id": 179,
          "comments": [
            {
              "score": 5,
              "content": "I really recommend Manic Panic Dye Away wipes. I used gloves when applying the dye but stupidly didn't think to wear them while washing it out and running my hands through it to rinse it, both my hands were entirely purple, but the wipes left them completely clean. They smell quite a lot, but they work well (also for drips and stuff on the face).",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Weirdly enough hair spray also works really well for removing dye off skin. I use it whenever I get it on my hands/neck. I haven't found a type/brand that hasn't worked, but I tend to use aerosol ones.",
              "id": 181,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "A lot of companies that make semi-permanent color make versions for dark hair. You don't get the same vibrancy as bleaching but you definitely get a color change. Off the top of my head I know Ion, Splat and Loreal Colorista all have dark hair formulations. Punky color also works well on brown hair, and some manic panic colors (the blues and emerald greens work best).",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "for a 10 year old i’d recommend getting it professionally dyed, or at least professionally lightened ! ive got dark brown hair and it won’t take most colors w/o bleach however i would look into overtone ! ive never tried it but if i’m not mistaken they’ve got a purple for dark hair, just make sure to do research before buying it because i know some of the dyes for dark hair don’t work very well which could be very disappointing. if you do go the professional bleach/at home dye route i totally recommend arctic fox and beyond the zone color jams which both should be at sally’s or lime crime and punky colors which i usually see at ulta ! \n-from a dark brunette who has had colorful hair off and on for about 8 years and counting",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "If you don't want to commit to bleaching her whole head, you could start with just bleaching and coloring the bottom bit, so that it shows from underneath and looks cool in braids/when pulled up.  That way, if anything goes wrong, it's only on the bottom part.\n\nDark dyes like midnight blue and dark purple will show up best on dark hair, but won't be as vibrant overall.  Light dyes wont show up at all.\n\nIf you dye it, be sure to use some kind of thick lotion around her hairline to keep it from staining (if it does stain her skin, dont panic; it will only be a few days).  Rinse it out with vinegar at the beginning, and always wash with as cold water as possible to help it last. Washing cold in the sink is best.  Use sulfate-free shampoos and good conditioners.  Olaplex No. 3 treatments are great for bleached hair (but expensive).  Use dark pillowcases and towels; it will rub off a bit.  Most of these semi-permanent dyes, you can put a shower cap and sleep in.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Just a heads up, Never ever use Loreal colorista for purple hair dye. My daughter has dark brown hair. The purple turned green within days and never washed out. She ended up letting it grow out and cutting her hair short. It was awful!",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Pravana Chromasilk Vivids Violet.\n\nI used it on my daughter's hair when she was 10 and I wasn't willing to use bleach. We dyed the bottom half and it turned out really well. (6 years later and we have embraced lightening before bright colors and I have become a pro with bleach.)\n\nHer hair was medium dark brown and we put the pravana on clean, dry hair and left it on for over an hour. It is semi-permanent and doesn't use a developer so there is no danger in leaving in. With her hair, the color never completely vanished. \n\nPossibly consider doing the rinsing outside because dye will go everywhere. I had heard that Pravana bleeds a lot less than something like manic panic. It wasn't that bad, but definitely use a towel over the pillowcase for awhile.\n\nPravana is meant to be used over lightened hair, but it definitely made her hair purple. It was not as noticeable indoors. But in the sun it was stunning.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 143,
      "content": "NTA that mom is way out of line",
      "id": 187,
      "comments": [],
      "relation": "Support"
    }
  ]
}