{
  "post content": "I work a high stress 50-60 hr per week job and am required to travel. I have too sweet children that I love more than anything. They are 4 soon to be 5 and 6. My amdear sweet aunt who could never have children who helped raise me babysit my kids until I am home from work and has always been a tremendous help in my life and still continues to be until this day. She is the kind of woman who would give you her last dime if you needed it. And she has always loved children, babysat when I was a kid had foster kids etc.\n\nWell I have been feeling animosity between her and my mother for years but his week it kind of reached a head.\n\nMy sons birthday and my husband's birthday are one week apart. We are  having the birthday party for him at my moms one house (which she does not live at or have any possessions there and is right next door to my aunts house)  bc there is more room there. Well my folding chairs were up there and I asked my aunt (who was my live in nanny when I was a kid for a number of years) if she could swing up quick and grab 4 of them because my husband's birthday is today and his family and a handful of his friends were coming over. Gave my aunt-who is my dads sister and who helped raise me the key to her house to grab the chairs.\n\nWithin 15 minutes my mom who was at work is texting me.\n\nWho did you give the key to my house ?  Someone was in  ?\n\n I was getting some chairs out dropped the drink thing off\n\nYou ?  \n\nCon. Why?\n\nMy mom ( my gram) went to check it. Said someone was in there wet tracks on the floor. How about you just use the key then we will have no more issues ! \n\n(There were no wet tracks on the floor. The chairs were right inside the front door next to the rug that my aunt wiped her feet on. Did I also mention my aunt is like the cleanest person on the face of the planet ?)\n\nIf people respected other people we would not have this \n\nThen my mom proceeded to text my aunt and told her \n\nThat Emily (thats me) is the only one to be using the key to her house. \n\nWho is the ass hole here? \n\n",
  "id": 1,
  "comments": [
    {
      "score": 2,
      "content": "I'm leaning NAH because there is no real unreasonable malice here. Your mom has the right to dictate who gets to enter her house. You weren't there to disprove whether the floor was dirty or not. Your aunt did what you asked you to do, so you're the person who put them both in this situation. Next time you might wanna check with mom first to see if she's ok with aunt being in her house. Slightly YTA if you wanna claim that your mom is being a jerk because she was surprised and upset that her key was used by someone it wasn't meant to be used by, and trying to discredit her story as a lie based on your impression of how your aunt acts around you.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nI work a high stress 50-60 hr per week job and am required to travel. I have too sweet children that I love more than anything. They are 4 soon to be 5 and 6. My amdear sweet aunt who could never have children who helped raise me babysit my kids until I am home from work and has always been a tremendous help in my life and still continues to be until this day. She is the kind of woman who would give you her last dime if you needed it. And she has always loved children, babysat when I was a kid had foster kids etc.\n\nWell I have been feeling animosity between her and my mother for years but his week it kind of reached a head.\n\nMy sons birthday and my husband's birthday are one week apart. We are  having the birthday party for him at my moms house bc there is a lot of room up there as compared to our house. Well my folding chairs were up there and I asked my aunt if she could swing up quick and grab 4 of them because my husband's birthday is today and his family and a handful of his friends were coming over. Gave my aunt-who is my dads sister and who helped raise me the key to her house to grab the chairs.\n\nWithin 15 minutes my mom who was at work is texting me.\n\nWho did you give the key to my house ?  Someone was in  ?\n\n I was getting some chairs out dropped the drink thing off\n\nYou ?  \n\nCon. Why?\n\nMy mom ( my gram) went to check it. Said someone was in there wet tracks on the floor. How about you just use the key then we will have no more issues ! \n\n(There were no wet tracks on the floor. The chairs were right inside the front door next to the rug that my aunt wiped her feet on. Did I also mention my aunt is like the cleanest person on the face of the planet ?)\n\nIf people respected other people we would not have this \n\nThen my mom proceeded to text my aunt and told her \n\nThat Emily (thats me) is the only one to be using the key to her house. \n\nWho is the ass hole here? \n\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "#[State of the Subreddit](https://www.reddit.com/r/AmItheAsshole/comments/ahr1xg/state_of_the_subreddit/)\n\n\nIf you want your comment to count toward judgement, put one of the following abbreviations at the beginning of your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top comment.\n\n\nJudgement | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH- you didn’t do anything you thought would upset anyone. And your mother has the right to decide who goes in and out of the house... even if she’s being a cry baby",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA.  Your mom clearly has a beef with your aunt (I’m sure she suspected it was her, since she lives next door).  This sound more like a post for r/justnofamily or r/justnomil.  ",
      "id": 6,
      "comments": [],
      "relation": "Support"
    }
  ]
}