{
  "post content": "I (37f) do not permit Alcohol in my house, and I haven't for 15 years. There is a lot of alcoholism in my family and in my late teens/early 20's I was a problem drinker. Fortunately I realised before things became too bad and have not drunk a single alcoholic drink since. I don't object to others around me drinking, I just won't myself and don't want it in my house. All of my family and friends are aware of this and the reasons why.\n\nA group of my friends and I enjoy playing board and card games. We have decided to have a games night once a month, taking turns to host in our homes. The first two were fantastic and we really enjoyed ourselves. Some people were drinking alcohol, and others weren't.\n\nMy turn is coming up, and in making the preparation, I reminded people that I don't allow alcohol in my house, but if they wanted to bring non-alcoholic beer or wine, then that's OK, and I could make up a few different mocktails. I thought that would be a reasonable compromise and that people would be fine with not drinking for a three hour event.\n\nUnfortunately that was not so.\n\nTwo of the group were extremely unhappy with that. They said that whilst they were aware of my house rule, they just thought I meant that I don't have alcohol in my house, and that I wouldn't object to others bringing some. I don't know where they got that idea, because all events in my house they have come too were alcohol free (although I've only really hosted brunches and lunches where people tend not to drink anyway).\n\nThey also said that not permitting them to bring alcohol was inappropriate and showed I was a bad host and a bad friend.\n\nWe did end up in an admittedly petty argument, where they said that I was a hypocrite for not letting them drink, because I was practically an alcoholic at one point, and if I still can't be around alcohol after all these years then I needed help. I responded and said that if they can't go three hours without drinking then it was them that needed help.\n\nWe tried not to get the others involved in the argument, because we didn't want them to feel like they needed to take sides, but the argument ended up going from an in person one, to an argument on our friend group chat. This has of course led to people taking sides, even those friends who are in the group chat but don't attend the games nights. \n\nI'm thinking of withdrawing from the games nights because of all the fighting. I still don't want alcohol in my house, but other people have been saying that I'm in the wrong for not complying with our countries social norm of drinking alcohol at events and parties. Others have said that there is nothing wrong with me having boundaries and that people shouldn't automatically expect to be allowed to drink alcohol at every event. \n\nI don't really know what to think about it, because they are right that where we live has a huge drinking culture and it is more normal than not to drink at evening events.\n\nAITA for not allowing people to drink alcohol in my house?\n\nEdit: it's been mentioned a few times that people don't understand why I won't allow alcohol in my house when I am fine being around people drinking elsewhere, so I thought I should address that.\n\nA lot of my worst memories around drinking happened at home. I'm not even sure I can properly describe the pit of self-loathing and despair I felt when things were at their worst.\n\nI was also at home when I realised I had problems, and I felt so disgusted with myself and then so trapped that I left and stayed with my mother for a whole because I couldn't face going home. Some family friends cleared my house of alcohol for me before I went home.\n\nIt took a long time to feel comfortable in my home again, and when I did, it became my alcohol free sanctuary in a world where drinking is so common. I have this bizarre feeling that my sobriety is somehow linked to my home being alcohol free and am afraid that by allowing alcohol in, I will slip back into the hole I was in before. I also feel I can be around people who are drinking because I know I get to go back to my safe place.",
  "id": 1,
  "comments": [
    {
      "score": 9303,
      "content": "Totally NTA. Your house, your rules. Anyone who doesn't like it can go pound sand. Your friends are AH for bringing up your past issues with alcohol. You've dealt with them and know your limits. If they can't go for a few hours without it, they're the ones with the problem. Stand your ground. I think you need a few new friends.",
      "id": 2,
      "comments": [
        {
          "score": 3297,
          "content": "And if they can't go a few hours playing board games without alcohol, they have a very big problem.",
          "id": 3,
          "comments": [
            {
              "score": 961,
              "content": "Yup. Finding you can't go without it is a sure sign you have a problem",
              "id": 4,
              "comments": [
                {
                  "score": 575,
                  "content": "Assuming that there are 5 people in the group, OP is hosting once in 5 months. So its 3 hrs without drink in 5 months which should be easy to skip considering 8 hrs x 5 days at work require no alcohol. If they want they can go home and drink to their hearts content.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Plus I would totally go for mocktails!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "I don't drink.  The number of times people on my 20s would exclaim with absolutely no sense of an issue in what they were saying, \"You don't drink?! Not even at a party??  How do you have fun?!\"\n\n\nNot one of them ever had a response when I asked if they were able to have fun sans alcohol.\n\n\nLike, I don't care if others drink.  But if you can't hang out for a bit without it...that's an issue.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 55,
                      "content": "> I don't drink.  The number of times people on my 20s would exclaim with absolutely no sense of an issue in what they were saying, \"You don't drink?! Not even at a party??  How do you have fun?!\"\n\nMore than once, it was easier for me to roll my eyes and just take the cup they'd already spent 5 minutes trying to force into my hand, and then give it to a friend who was drinking or dump it out.\n\nThe default \"if you don't drink, something's *wrong* with you\" culture is what causes problems like this in the first place.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "same, never flirted with alcoholism, no family history, just not a fan of alcohol. I drink occasionally but it's as simple as \"I don't like it\". I'd rather have a soda than a beer. tastes better. \n\nand yeah, people either act like you have some kind of disease or they try to overcompensate with the \"Hey that's good for you man!\"-followed by WAY too much reassurance that it's fine. \n\nJust wild.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I would say I have fun watching drunk idiots making fools of themselves while they drink.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Yep—and choosing a drink over a friendship is a sure sign too.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That's like the first sign. When the activities you do are controlled by your ability to use the substance. Like if you don't go to the movies because you can't smoke for hours, it shows dependence. Maybe not physical but at least psychological dependence. For example, if you can't be in a social setting without drinking, that's a bad sign that you are using it maladaptively to cope.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "While this is true, I really doubt that any of these people really \"can't\" go without it. They just want it as part of this event. It takes a deep and generally pretty obvious level of dependence before just a few hours is going to give you any kind of issue to deal with. \n\nI still think their view/argument is *obnoxious* but \"can't go without it\" is likely a red herring.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 20,
                      "content": "But if they are willing to argue to the point of not being friends and ostracizing someone, sounds like an issue to me.. also like.. just pregame the board night how hard is that",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "While I agree they're being obnoxious about it, I probably would politely decline to attend this event if OP were the host. There are plenty of settings where i don't need to drink to have a good time. Sitting around a table playing board games is not one of those settings and I can imagine the people complaining think OP's shindig is going to feel more like youth group than a fun hang with friends.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yes a ridiculous argument to make.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 612,
              "content": "OP is definitely right. OP might be serious about being dry at home but when it comes to issues, not being able to go a games night without a drink is more concerning.",
              "id": 17,
              "comments": [
                {
                  "score": 76,
                  "content": "Might not be about not being able to, maybe these folks want to drink in their free evening when they get together. Still NTA and OP's friends are terrible, but i would definitely skip the event at her house, and i don't even drink as a habit.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 189,
                      "content": "They ~~don't~~ have all the other days of their lives to drink.  If they rotate games night, that's only a very few nights without a drink.    If there are four households involved, that's three nights a year - and some of your friends find that a terrible imposition?   I don't drink myself, and I really don't get what the big deal is, especially since they all presumably have to drive home later.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": "1 evening every 3 months.  ONE evening every THREE MONTHS.\n\nIf you need to skip it for lack of alcohol, you do need help. A lot of it.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 102,
                      "content": "Yes but it sounds like just skipping OP's house from the rotation wasn't considered even though that seems the sensible solution, they just went straight to attacking and judging her. Everyone gets to control what does and doesn't happen in their own home.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "It's 1 in 5 board game nights. OP has very legitimate trauma due to alcohol being in their household. If you can't accommodate that for 6 hours a year, you aren't a good friend.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "The OP is making ever effort to provide alternatives to keep the night social and fun. You would blow off a friend that is making that effort?",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Well, as the saying goes, if you're bored, then you're boring.  It's super strange to me that a person couldn't find enough entertainment in hanging out with friends and playing a few games that they'd skip that if they couldn't also drink.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Bring a flask and drink outside like a smoke break. OP’s ask is a HUGE deal to OP and easily overcome by the guest. \n\nThe mentality of I do what I want to do or I throw a tantrum / take my ball and go home attitude is for children. \n\nOP asked for not inside his house. That is really not even a difficult obstacle unless someone is TRYING to make trouble.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It is not clear to me why you would skip being at your friend's house, having a good time playing and supporting her mindset that plays an important role in her abstinence. Unless one is a raging alcoholic I don't see the problem. Can you elaborate?",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Yea it sounds like they think of this games night as a drinking night for themselves, which is totally fine.... but it's just so absurd that they are giving OP shit for it when they could just suggest skipping OP as a host... just like if they had weekly BBQ nights and one pal didn't have a backyard... they'd just skip that pal as host.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I think not having empathy for your friend in this situation (read the edit) would be a weird thing",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "She's not even asking them to be sober. They could have a beer before heading over and one when they get home. She's just saying to not bring it into her house.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I get it now.  It's not really a games night.  \n\nIt's a games night in the way that \"I'm going over to Bob's to work on the Mustang\" is a thing, but the they've been working on that Mustang for 10 years now, and it's not progressing.  In other words  \"I'm going over to Bob's house for a few beers\".  \n\nYes, games are present.  No, you don't have to drink.  But drinking is really the point of the night, not the games.  But you can't say \"drinking night at Sarah's house this weekend\" without sounding like you have a drinking problem, so you call it \"games night\".  OPs only mistake with thinking it was an actual games night rather than a euphemism.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 230,
              "content": "I’m floored at how many replies you’re getting saying that a sober board game night would be boring. I have never once in my life ever had a board game night with alcohol and they’re so fun",
              "id": 31,
              "comments": [
                {
                  "score": 114,
                  "content": "Plus if they don't like board games, they don't have to go?? It's not a wedding!\n\nI think a knitting circle would be boring _for me_\n So I do this amazing trick: I don't join one!",
                  "id": 32,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Yeah I sort of get the mindset of “eh I don’t like board games but I like to socialize, but I like to drink when I socialize”. But frankly I think asking for one 3ish hour block of no alcohol is not that big of an ask. It would be one thing if OP was demanding no alcohol at any of the get togethers no matter whose house it was at, but in her own home? She has every right to not want alcohol brought in. \n\nAt that point they can either suck it up and pass on the booze for one night or someone else can volunteer to host if they really want to drink that bad",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "A little secret about the knitting circle; it's often more wine than knitting...🫢",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I’ve had plenty of game nights with and without alcohol, both are a blast because I was with friends and enjoying the games together. This group just sounds like the board games are an excuse to drink. If you can’t make it through a board game without needing/ wanting a drink I would be concerned.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I like both. A cocktail or a beer while you play cards or a low competition, nostalgic game is fun. \n\n\nBut if I'm bringing one of my more complicated and competitive board games, I'm playing sober. Root and Seven Wonders are hard enough to understand already, and I'm playing to win.\n\n\nIt's all about the tone of the event. ",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "If someone can't enjoy hobbies without drinking, they have a problem.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I’ve done both. Both are fun!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It's amazing to me how many people literally cannot have fun without alcohol. Isn't that the definition of a substance abuse disorder?",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 195,
              "content": "Half the time I forget my weed and alcohol when I get into a boardgame. That adhd takes over.",
              "id": 40,
              "comments": [
                {
                  "score": 151,
                  "content": "You would make a terrible alcoholic. /s",
                  "id": 41,
                  "comments": [
                    {
                      "score": 140,
                      "content": "Ironically, usually ADHD folks make GREAT alcoholics...\n\nprimarily because small amounts of alcohol cause dopamine to increase (acts as a stimulant), which allows folks with ADHD to focus a bit better...  right up until they end up drinking so much as to make alcohol the classic depressant we all know it to be...\n\nas someone with ADHD, 1/2-2/3 of a beer in an hour gets me in a real zen state where I can get shit done...  more than that and I just don't care anymore, which really \"helps\" with that ADHD rejection sensitivity disorder...\n\nit's like the perfect pathway to alcoholism, because it really does \"help\", if you can keep it under control.  Which no one actually can.\n\n(In this case OP is NTA - if she wants to still be involved in game night, she might suggest not hosting at her place, but \"serve\" as host at someone else's house...  presuming the host supplies food and non-alcoholic beverages, and sets up/cleans up.  She could approach whom ever is her best friend in the group and ask if when it's OP's turn, she can do all the other hosting tasks, just AT her friend's house/apt instead of her own.  Then the other folks can BYOB, OP can still feel like she's holding up her end of the bargain by \"hosting\" the same as everyone else, and while she can distance herself from the members of the group that were rude to her about this (because they all suck), she doesn't have to drop the entire friend group, while she negotiates the process of meeting some new folks who will support her better in the future, because it's hard making friends as an adult, and just saying \"make new friends\" doesn't actually help in the short term.)",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "Lololol I really would. I never had an issue with drinking and usually am sober. People think I'm sober/have issues with drinking when really I just don't like the taste lol. \n\nHard-core stoner tho. I'm basically a chimney.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Oh hell yeah. Once the hyper focus kicks in, forget about it.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Oo no! this explains a lot now! I’m 35 and was diagnosed at 33 a lot of my “personality traits” have turned out to be just me being adhd af lol I’ve literally wondered how I didn’t become a full blown alcoholic",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I literally had a *virtual* board game session this weekend. 5 hours and forgot to feed myself or drink any water, or stretch. If someone can't go that long without booze, they have an alcohol problem. Even a part time job requires that capability. And your friends are way more valuable than that.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Lmao same  I'm a med patient for weed and medically can't drink but I've been lost in a game and symptom hit me and I'm like wtf why am I dizzy and nauseous (neurological disorder) and I'll open my vape bowl and see it's still green and be like oh yeah XD",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "Yup. This. I enjoy a drink or two when I'm socializing. But enjoying drinking alcohol while socializing is miles away from not being able to enjoy an event without alcohol!\n\nParticularly if these people are supposedly friends and know OP's house rules and history. Those are just shitty friends who rely too much on alcohol!",
              "id": 48,
              "comments": [
                {
                  "score": 3,
                  "content": "Can't do the quote thing on my phone but definitely agree with the shitty friends part! I don't drink bc of family issues with alcohol - and far less personally traumatising ones than OP's - and I have plenty of friends who tend to drink whilst socialising, and not once have they ever brought alcohol to my house. It's not even a rule for me, I'm just now scanning my brain and realising they never have, which is very sweet of them but yeah - friends can do this. Good friends care about your choices around big personal things like your relationship with alcohol.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, these are not friends. People who don’t respect your sobriety are not friends. NTA",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "Imagine being so pissed that your friend doesn’t want alcohol at their own home and thus making a fuss about it and/or choosing to not hangout with said friend; ultimately choosing alcohol over spending time with someone you supposedly care about maintaining a relationship with… and then saying that you don’t have a problem…woof\n\nOP’s friends suck",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "They definitely felt *very* called out with this one part\n\n>I responded and said that if they can't go three hours without drinking then it was them that needed help.\n\nDoesn't seem like they're willing to admit it though and tried to gaslight OP into thinking that he's the problem here instead of them, ugh.",
              "id": 52,
              "comments": [
                {
                  "score": 8,
                  "content": "But OP didn't say that until *after* these 'friends' threw OP's recovery in their face, calling them a hypocrite because they were practically an alcoholic at one point.\\*   \nSo they were already feeling strangely called out even before being directly called out.  \n\n\n\\*Which doesn't even make sense to me to because that is why OP doesn't want alcohol in their house...how was that supposed to be some sort of gotcha! moment? These friends are weird.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Or you can just pass the hosting duties on to the next person. Problem solved.  But I will say for those of us that enjoy a drink these are the type of activities that we do it at.",
              "id": 54,
              "comments": [
                {
                  "score": 22,
                  "content": "> those of us that enjoy a drink\n\nThe line between **a drink** and a *binge* drink*ing habit* quickly gets blurred. OP understands this, as someone with a history of suffering from alcohol abusers, which the \"friend\" that attacked him/her over the reasonable house rule qualifies as.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Or you can wait a few hours before satisfying your weekly alcohol addiction while hanging out with friends and drink when you get home? \nWhat's more important for you? A get together with friends or alcohol? Don't say both..you only enjoy those activities because there is alcohol involved..if it would be a bonus it wouldn't be so hard to stay dry a few hours for people you supposedly like. Especially if they have some sort of history.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Exactly. OP has said they can have the nonalcoholic variety, so it isn’t about missing out on the taste. They’re just not liking that the OP has a hard boundary.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I've just been out at a friend's place and there were 8 of us playing silly games and laughing ourselves sick. Not one of us was drinking. It's not that we can't. We just don't need it to have a fun time.",
              "id": 58,
              "comments": [
                {
                  "score": 2,
                  "content": "THIS, right here. Remember when you were a kid, those friends you would laugh with until you pissed yourself? Never needed a drink to do that.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "I agree. Plenty of people in the Southern U.S. still follow no alcohol rules for religious reasons. As do many Muslims in other parts of the country  . Your \" friends\" just want to win an argument. Tell them to pound sand and that it's sad that they cannot have fun without alcohol. It's really  quite do-able. NTA O.P.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "Agreed. Your house, your rules. I am personally fine with folks drinking around me, even in my house, but they need to take their alcohol home, which they do now. // Also, game nights are better when you don't have to herd cats to play games 🙃",
          "id": 61,
          "comments": [
            {
              "score": 37,
              "content": "Drunk driving is the real problem especially for those who cannot seem to go a few hours without alcohol & drive themselves home.",
              "id": 62,
              "comments": [
                {
                  "score": 3,
                  "content": "Why are you assuming everyone at these gatherings always drives to/from them as opposed to getting a lift or a taxi or public transport?",
                  "id": 63,
                  "comments": [
                    {
                      "score": 4,
                      "content": "In my experience, the type of people who get pissy about not drinking for a few hours are generally not responsible drinkers.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Or I have two glasses of wine during a 4-5 hour game night so I'm sober when it's time to drive home.\n\nWhen I drink, that is. I can easily go without drinking at a game night, and normally would prefer not to drink, but a friend likes to serve wine at his, so I agree to a glass about half the time.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Upvote for herding cats.\n\nYeah, I was wondering whether they go to drink or whether they go to socialise and game.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "The fact that they knew you had a troubled past and still wanted you to break your rules really sucks. You’re totally NTA and frankly anyone that can’t just have a fancy soda or tea for two hours needs to examine their issues.",
          "id": 67,
          "comments": [
            {
              "score": 6,
              "content": "Agreed. Lean into it and have fun with the no alcohol thing. There are a lot of good craft root beers, ginger beers, cream sodas, etc. out there that everyone can enjoy on the game nights at OP’s home.",
              "id": 68,
              "comments": [
                {
                  "score": 5,
                  "content": "Right? I’d have everyone bring a 4pack of some sodas and do some taste tests heck, it’s even dry January, so lots of people aren’t drinking right now",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "Really why are they being such pricks? If they cannot abide by your rules then you shouldn’t have game night at your house. I grew up with an alcoholic mother and the trauma it caused and has affected me mentally. Stand your ground. Why should you be the one uncomfortable in your own house? These people are not your friends.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "10\\10, no notes or additions.\n\nNTA",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "it is totally reasonable to not want to risk having drunk people in your house",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Totally agree with “your house your rules”.\n\nIt is incredibly disrespectful of your ‘friends’ to not understand and be supportive of your stance knowing how alcohol has impacted your family.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "this 100% and i also don’t drink NTA",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I Hate that social norm crap.\n\n\nTobacco is a legal dtug, I don't allow it in my flat. It stinks is unhealthy and I don't want my kid affected. \n\n\nI have some friends who smoke. They step out every once in a while \n\n\nWe will get weed legalized here soon. I don't want that in my house. \n\n\nAll three are (legal) drugs. And everyone has to find the way how they want their home to be handled with these drugs. \n\n\nYou have no problem with people drinking. You don't want that at home which is totally fine. \n\n\nWe have games night too, and I love a drink while playing. I usually go with one drink or complete alcohol Free because I have to drive. \n\n\nAnd one time I had alcohol free wine to drink together with a friend who went through chemo and was not allowed any.\n\n\nThe point is, your house your rules. And if you can't have fun on a games night without a drink, there is something wrong. \n\n\nYou are NTA. Keep your boundaries. ",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2774,
      "content": "NTA. \n\nSociety has normalised drinking so much that to not is met with fear, derision, and anger. Non-drinkers are treated worse socially than alcoholics who destroy their relationships. Just because it’s a societal norm, doesn’t mean it’s right. It takes strength to see through it and deal\nwith the defensive reactions. Don’t compromise your (reasonable sounding) boundaries.",
      "id": 76,
      "comments": [
        {
          "score": 796,
          "content": "[deleted]",
          "id": 77,
          "comments": [
            {
              "score": 352,
              "content": "At the first question I'd ask them WHY they drink.  Why do they need alcohol to loosen up? \nWhy can't they enjoy themselves without it? \nWhy is alcohol required for them to have fun...",
              "id": 78,
              "comments": [
                {
                  "score": 173,
                  "content": "[deleted]",
                  "id": 79,
                  "comments": [
                    {
                      "score": 140,
                      "content": "Oh I get it.  But it's just flipping the script on them, not being holier than thou!   Like when Great Aunt Edna asks when she's going to finally be able to attend your wedding and you answer by asking when you'll finally be able to attend her funeral, just to shut her up hahaha. \n\nOkay yeah, maybe I'm not the one to take advice from...carry on.",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I take medication for my ulcerative colitis. Drinking alcohol feels like if someone were to flay the skin off my body with a vegetable peeler and then throw me in a bath of hydrogen peroxide. But like, on the inside. So most of the time I say “i have a chronic illness and I can’t drink on my medication.” Usually people leave it at that. If they pressure me again I will graphically describe what it feels like to vomit out your stomach lining while simultaneously shitting blood. They stop after that. But yeah, “I can’t drink on my medication for my chronic illness or I’ll get super sick.” People are usually very understanding abt that.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "My response in those situations is “I don’t get it — why does it matter so much to you? Why can’t you just drop it and let me do what I want?”",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "To put up with my present company.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I stopped for 15 months (I drink now, but very little). I used to answer with \"People drink to have fun. My life is already a blast. For me, drinking will make me miss some of it. Besides, now I get to WATCH the drunk show, instead of starring in it!\"",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This whole thread is wildly American - I'm a Brit, we drink much more than you guys, so skipping a night is easier. I can & have literally take my child to the pub with me here. It even had a nappy(diaper) change room. Drinking is very normal here - the fact that these people are treating it as something special in their late 30s is wild. But the fact that it's so very normalised means that no one cares if you don't drink, either. Just like if you don't like tea, there might be a few jokes but obviously not everyone likes tea, for whatever reason. This type of situation is an American prohibition legacy, not a \"too much drink\" thing. People in cultures where drinking is truly normalised drink enough that skipping a day isn't a big deal.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 4,
                      "content": "As a fellow Brit, this entire thread has had me feeling like I'm on the crazy pills. If any of my friend expressed such strong opinions on either side of this argument I'd begin to wonder if something else was the matter.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "My go to response is that I'm a control freak and I don't want to. I've never gotten push back for that. That's actually only part of the truth, as paternal fam has had a history of alcoholism and I just don't want to risk it. But that info usually brings the mood down.",
              "id": 87,
              "comments": [
                {
                  "score": 15,
                  "content": "I love this actually. Everyone can laugh at the self-deprecating joke, so no one goes on the defensive, and it's completely plausible, so no one feels like you just need convincing.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I tell people that, at my age, have saved over $25k by *not* drinking booze.  That's a vehicle or a few big vacations or a down payment on a home.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "\"why do you want to know, would you like to quit drinkining?\"  \n\"nah, don't want to ruin your fun with science and research!\"",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "I am another. \n\nDon’t drink, never did. When a child I was frightened and disgusted  by being around  drunk adults. But he social pressure and even disapproval is constant !  The implication is that something is off about me if I decline, no matter my reasons .\n\nI used to smoke weed, but gave it up….however weed people never pressure me to smoke !",
              "id": 91,
              "comments": [
                {
                  "score": 6,
                  "content": "Re: drunk relatives.  Yup, every Christmas was having to deal with drunk uncles and cousins when I was growing up. Le sigh. I remember I got so angry in middle school because of uncles drunk antics that I did a debate for school wanting go reinstate prohibition.  Lol.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "💯 thats where i was. Drunk people always felt awful to be around. And when you grow up everyone is really awful about it",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "As someone who used to drink but is almost completely sober now (I have approx one drink a year), I don’t even play these games anymore. I respond with “Because I don’t.” and refuse to entertain the discussion further. It’s also important to me to show younger coworkers who don’t want to drink (I’m an “elder millennial”) that not drinking at happy hours and other events is perfectly fine and doesn’t need to be excused.",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "When someone asks something I don't want to answer, I usually go with, \"is that important?\" Once they have to stop and think about their reasons for asking the question, they usually let it go.",
              "id": 95,
              "comments": [
                {
                  "score": 2,
                  "content": "This is a fantastic answer, for many questions of this sort!",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Idk if this is a viable option for you or if people would accept it, but my answer to these questions is always \"I just don't like how it makes me feel.\" This is true in my case, I get some kind of weird reaction to small amounts of alcohol that makes my whole upper body hurt in a muscle soreness kind of way, and it's generally not worth it to try and push through that until I've had enough alcohol to get numb. And it's probably not UNtrue, even if what you're talking about is a grief or anxiety reaction. I also add \"I prefer a weed high to being drunk,\" so you could try that if it's culturally acceptable and legal where you are (and true for you).\n\nThe most negative response I've ever gotten is kind of a nonplussed \"oh. What do you mean?\" or \"Do you mean you don't like the taste?\" And then I can explain my weird body reaction (leaving out that it will get numb if I drink enough, lest they try to pressure me to drink fast) and that's enough of a distraction that they don't push anymore. \n\nTo be clear, I really fucking hate that we have to swap tips about how to get people to shut the fuck up about whether we use a mind-altering substance. But just in case anyone reading this could use said tip, here's one.",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "I rarely drink myself. I can count the times I had any on 1 hand. I wouldn't really care if I never drank again. It sucks that people try to weasel others to drink like there is something wrong if you don't drink.",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I have almost exactly the same backstory.\n\nFor what it's worth, I've found that these socially-mandated trips to a bar have become much easier (maybe even fun sometimes?) since I realised that water wasn't my only option.  (Which, being a non-drinker who generally avoids bars, is \\*absolutely\\* not something I was aware of early in my career!)\n\nThese days, my drink of choice is a tonic and lime.  It's just as non-alcoholic as water, but nobody's ever questioned my choice the way they do for water or soft drinks.  FWIW",
              "id": 99,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I have never drank alcohol. I get these questions a lot. Makes me slightly thankful that I ended up with non-alcoholic fatty liver disease, so now I can just say I have liver disease and that shuts them up pretty quick.",
              "id": 100,
              "comments": [
                {
                  "score": 4,
                  "content": "Oh the stories I can tell.  Like trying to slip me a drink at a work function. \n\n\nI'm sorry you have that health concern. I hope the treatment is working to halt the progression.   \n\n\nA little evil voice in my head is telling me I should fake a liver disease just to see the response.  But knowing my coworkers they would run to HR to make sure I'm getting reasonable accommodations. (Ironic, right?)",
                  "id": 101,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's insane. That's basically assault.\n\nIt's controlled by diet mostly. Just gives me an easy out when people try to peer pressure me. You'll be glad to know I don't need accommodations.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I almost never drink. Haven’t for about 25 years. I never had a drinking problem, and I enjoyed wine and a few mixed drinks, but once I had kids and we were working, juggling life, it made me tired to drink. So I stopped.\n\nThankfully only rarely am I with one of the “come on” crew. How very strange to think it is worth commenting on if someone turns down a drink, and even more inappropriate to question WHU they don’t drink.\n\nMy friends and family know my “sleepy” reason, but I may be the AH, because I have lied to strangers. I’ve said addiction runs in the family, claimed I was pregnant, or was on medications and alcohol could kill me..",
              "id": 103,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 134,
          "content": "This!!!!! You should see the \"AITA for not allowing alcohol at my wedding\" posts. They're FULL of YTA votes because of some bs like \"everyone drinks at weddings\" and \"it's a party, of they're going ro be mad\" and \"not everyone like social events and drink to be comfortable\" whoch is INSANE to me because literally no matter the reason behind not having alcohol at an event, even a huge one like a wedding, is a totally reasonable boundary to have. If people can't go a few hours with alcohol/get angry when it's not provided, maybe they should look inward. OP is 1000% NTA",
          "id": 104,
          "comments": [
            {
              "score": 97,
              "content": "LOL at how ridiculous some people are. Awhile ago I got invited to a wedding and showed up at the reception looking forward to an ice cold beer. I didn't realize that it was a dry reception. You know what I did? I spent about 30 seconds looking around just to make sure there wasn't a bar somewhere, then I got the fuck over it and had fun for the rest of the night with my friends.\n\nI love a good drink but I'm perfectly fine going without one.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Those posts are the worst two, bc they refuse to understand weddings aren't parties. If you can't handle a long reception without getting drunk, okay, don't stay at it that long. Say your congratulations, and you can leave. Don't rant about how you didn't want to go to the ceremony, which is the actual priceless event.",
              "id": 106,
              "comments": [
                {
                  "score": 2,
                  "content": "It's totally fine to choose not to drink, but...weddings with receptions are absolutely parties. That's kinda the whole point, otherwise you'd just do it at City Hall on a Tuesday afternoon with a Justice of the Peace.",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Only time it’s slightly rude to throw a dry wedding is if guests aren’t warned in advance. If guests don’t know the wedding is dry, they might spend money to avoid drinking and driving like Ubering to the venue or renting a hotel room. Besides that one exception, dry events should be perfectly acceptable. ",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "This, I’ve started to not drink and luckily I’ve got good friends who are fine with. \n\nOP NTA\n\nI bet if the OP said no drugs in the house, they’d more than likely be okay with that.",
          "id": 109,
          "comments": [
            {
              "score": 3,
              "content": "Alcohol i a drug so \"no drugs\" implies no alcohol",
              "id": 110,
              "comments": [
                {
                  "score": 3,
                  "content": "I get what you’re saying but that’s not what I meant",
                  "id": 111,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I know, I'm just making my own point: people treat alcohol like some fancy water but it is an actual drug and works exactly like one and its use has the same consequences as one.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Agree. A relative recently recognized her severe drinking problem. However, she has linked drinking so strongly with acceptable social behavior that she has replaced her drinking by constantly pushing alcohol on my son and telling him he needs a drink so he looks more social.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Non-drinkers are treated worse than alcoholics that destroy their relationships?\n\nReally? You know that’s utter bullshit, stop throwing out lies. That’s quite the persecution complex you’ve got going there",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I have a great friend group where not drinking is very normal and never mocked. We respect each other's boundaries when visiting their homes. So I never feel pressured to drink as honestly, I'd rather not. I enjoy drinking and my goofy side multiplies by 10 when I'm drunk so I feel like the star of the party. But it's not worth it. Even then ever since getting my drivers license I have a great excuse not to drink. \n\nAround the New Year, I attended a party at my new workplace. Let's just say the town where I work loves to drink. You just don't fit in if you're not according to their norms, and drinking is very important to them. The CEO of the company constantly offered me drinks and rejection fell on deaf ears most of the time, unless I was very persistent. I love my new workplace, and I don't mind drinking with them, but they should respect my tempo and my limits.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly. I bet if OP said \"no smoking cigarettes in my home\", no one would bat an eye, and yet when it's alcohol, it's suddenly a problem.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This! And thank you for saying it! I felt like me and my close family are the only ones that recognize this. We are in a realm we see how often DUIs occur (not to mention so many other problems). To us it’s sickening how prevalent drinking culture is acceptable to the point that those who don’t indulge are the outcasts (regardless of the reason they don’t)",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "So true. I drink alcohol but drink so little and infrequently that people who don't know me think that I don't drink at all. But as an infrequent drinker that has to drive myself home, it usually doesn't make sense to have any. I hate beer, and mixed drinks are potentially too strong to drive after, and the wine selection may not meet my preferences. But I just can't relate to being unable to socialize without a drink. The times I get to have more than one drink in an evening probably occur once a year. And I'm ok with that. Soda or juice are just fine. The reaction to turning down beer is funny. That is apparently the gateway alcohol, so you immediately get asked if you drink at all for rejecting it. And I was a regular attendee of happy hours for YEARS.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Absolutely NTA. I do love that mocktails and NA drinks have been very popular in the US as of late. Hopefully alcohol will slowly become less of a norm.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1359,
      "content": "NTA. I would say that no one is TA but their reactions put them firmly in that territory.\n\nTBH no drinking makes that kind of a gathering a no-go for a lot of people. If having a few drinks is part of the fun for them then it’s best that you just don’t host. Or be the host at someone else’s house—you’re still in charge of snacks and cleanup, just not at your place.",
      "id": 120,
      "comments": [
        {
          "score": 1158,
          "content": "I will definitely bring up the idea of not hosting at my house and being involved in the hosting responsibilities at someone else's. That is probably the best way to get past this. Thank you",
          "id": 121,
          "comments": [
            {
              "score": 170,
              "content": "Agree with this. I’m sober since 2019 and would avoid this convo entirely by hosting elsewhere. Me being me it would also be due to some unfortunate outside source. Gassy dog, terrible neighbors, malfunctioning fridge lol ",
              "id": 122,
              "comments": [
                {
                  "score": 3,
                  "content": "My dog gassing out others is the best part of hosting though. Let my friends share in my misery haha",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "I was going to comment this suggestion. As ridiculous as it is that you can't host because they refuse to not drink for a few hours (what do they do at work ffs?) If one of the game night friends understands your position they may be open to physically hosting the event while you take on the other aspects.\n\nI don't know if I'd want to go to so much effort for people that wouldn't respect my boundaries in my home for a few hours every so often despite having done so in the past in other scenarios. But I do love my pals so maybe I would? Idk 🤷🏻‍♀️",
              "id": 124,
              "comments": [
                {
                  "score": 146,
                  "content": "Is them wanting to drink for fun on their days off really anymore ridiculous than her request that they don’t?\n\nI don’t think so. She don’t want alcohol in her house, totally fine because it’s her house, and they want to drink alcohol and get loose, totally fine because it’s their life.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Expect it's one night a month every few months... It's not like she's hosting it every weekend and therefore expecting them not to drink on that night every weekend... Are you really going to disrespect someone's boundary and get super upset over something so infrequent? I didn't drink around most of my pregnant friends with no arguments when I saw them a few times a month for nine months, it's not that hard? Although, I suppose maybe I'm lucky that I enjoy my friends company more than I enjoy alcohol.\n\nRegardless, OP is fine with people drinking around them but doesn't want it in their home, they're not having a go at people having a wine in a restaurant when they're there it's not the same it's a completely fine boundary to set...",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Their reaction puts them firmly in the asshole territory. OP can have a booze free house, challenging that isn't proper. Opting out is okay, but that isn't what happened. Nor did they ever suggest altering venues, just demanding booze in a no-booze venue.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Bro.  This is someone who has a history with alcoholism.  It’s called having respect at someone’s home.  I can’t believe anyone would even defend these people.  If they don’t want to go, they can stay home.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Except what is not fine is them throwing mud at her personal history.  They are not just saying 'ok lets play somewhere else',",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "To be clear I think the friends are being assholes about this because it’s such a serious mental health thing for OP.\n\nBut it’s always weirdly hilarious how this comes up **any** time an alcohol free event is brought up on Reddit.\n\nAnyone who was disappointed or upset about it at all is suddenly some raging alcoholic.\n\nYou know, as opposed to (maybe more than a bit rude) people who just *want* to drink while at a happy relaxing event.\n\nI enjoy a cup of coffee with every breakfast. \n\nI’d be a little annoyed if it wasn’t available at a breakfast meeting or anything else where it was supposed to be a nice relaxing breakfast.\n\nI don’t **need** it. I almost certainly wouldn’t say anything but still. \n\nI’ve been to sober weddings too. That’s a bit of a bummer and I only say something to my spouse but I’d raise my eyebrows pretty high if someone’s response to hearing me say that was, “What, you can’t go five hours without alcohol? You’ve got a real problem!”",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 94,
                  "content": ">they refuse to not drink for a few hours (what do they do at work ffs?)\n\nI agree with your point overall, but this is such a silly part of the comment. People often drink to relax from the stressful nature of work. Not because they have an inability to stop drinking for a few hours.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 60,
                      "content": "Yeah this subreddit is like twilight zone \"iF yOu CaNnOt SuRvIvE fEw HoUrS wItHoUt It...\" seriously... like if it's a friday or saturday thing I can easily see people want to have a beer or two without immediately being branded as alcoholics.\n\nI feel like people nowadays can only deal in absolutes. Either you are anti booze and don't drink a single drop, or you are according to the internet alcoholic who cannot survive without alcohol even if you want one beer while having fun with friends. smh",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Well, most of us work at work. And have families to manage while not at work. And have other obligations that it would be really weird to drink at. (Hey! Can I have a glass of wine during this utility district meeting? That’s cool, right? Okay, how about some wine while at the gym? No? That’s fair.) But downtime with my friends is typically a pretty safe place to drink. Not everyone who wants to combine our limited social time with an adult beverage is an alcoholic. OP’s friends were undoubtedly uncool, but it doesn’t make them alcoholics to engage in a practice they typically engage in during similar events. OP doesn’t have to have alcohol in her home, but shouldn’t expect others to change their preferences because of it. She should find another way to contribute to hosting duties. (Option: Hey girl, how about your house this time and I’ll bring the snacks?)",
                  "id": 133,
                  "comments": [
                    {
                      "score": 3,
                      "content": "OP's house is explicitly not a safe place to drink. If that means they need to opt-out okay, but no one gets to violate OP's home, bc that endangers OP's safety. It is the violation of that reasonable boundary/accommodation that makes them assholes, and can often be a symptom of an alcohol problem.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "And their boundary is that they are adults and want to decide on their own what they like to drink. Both boundaries clash here.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 22,
                      "content": "There are grey areas in life and this is one of them. Why would you make someone uncomfortable in their own home because you don't feel comfortable in yourself to not drink?",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Um. No. You seem confused about what boundaries are. When you set a boundary you are refusing something, limiting something. It's built into the word. Boundaries are set to limit actions that may harm you. Limiting the amount alcohol in ones home. Limiting the amount of personal information you share with someone. Limiting what kind of physical intimacy you will engage in. \n\n\nRefusing to be told \"no\", as is \"no, you cannot bring alcohol here\", is not a boundary. It is the definition of violating a boundary. \n\n\nIt's not even, say, \"limiting the number of alcohol-free places you go\" (note the lack, and even inversion of harm reduction in that so-called boundary), as the friends don't want to not come; they want to come and drink. ",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "100%.\n\nI wouldn’t put up with this.  Friends who can’t respect boundaries are NOT true friends and deserve to be thrown in the bin.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "If they pay me my hourly rate at game night, I'll stay sober. Same as work.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Respectfully though, if you can tolerate that compromise, what really is the issue? Your fine to host at another house but draw a line and alcohol being at your house. Respect your house, your rules but I don’t get it.",
              "id": 140,
              "comments": [
                {
                  "score": 133,
                  "content": "A lot of my darkest memories, when I was at my worst, happened in my home. I would be drinking from the moment I got home from work until the moment I went to bed. It was like a pit of self hatred and despair. I also came to the realisation that I had an issue when I was at home.\n\nWhen I had that light bulb moment, I felt so trapped and afraid of being in my house. I ended up staying at my mother's for a while, and some family friends cleared my house of all alcohol. Despite living alone, I was hiding bottles everywhere. It took five house for them to find everything, and they ended up with one and a half bin bags of bottles and cans. \n\nIt took a fair while for me to learn to be comfortable in my own house again because I had such negative associations with my house. Eventually, I began to see it differently. Having it completely alcohol free was a large part of what helped, and it got to the point where I could relatively easily handle being around people who drinking, because I had my alcohol free sanctuary at home.\n\nI still have this extreme fear that bringing or allowing alcohol in my house will send me straight back to the person I was then. I have seen other people with similar issues relapse after years of sobriety. I am afraid that I will end up slipping, but I have this weird conviction that as long as my house is alcohol free, I will be able to stay sober.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 63,
                      "content": "It’s great that you were able to come to such a nuanced self evaluation. You deserve your home to be a safe space.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "Thanks for sharing this with us, OP, truly.  \n\nI know it means little from some internet stranger, but congrats on how far you've brought yourself and good thoughts to you to keep you going for the future.\n\n 👍🤞",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Dude I get it. I was exactly like you, and my husband was still finding hidden alcohol weeks into my stay at rehab. I couldn't tell him where all of it was because I was drunk when I hid it all, I just knew where my Greatest Hits spots were.\n\nI didn't expect the sheer panic that hit me when I came home for the first time after my first full month sober. It was the most intense, visceral feeling of dread. All of my memories in that apartment involved drinking. The mere thought of being left alone was enough to turn my stomach. \n\nWhen our lease was ending my husband considered signing another to save the hassle and cost of moving. As laissez-faire as I usually am when it comes to that sort of thing, I said with full conviction that we were getting the fuck out of there. I'm not big on \"vibes\" but that apartment just has bad juju for me. \n\nThese days we don't keep booze in the house aside from a bunch of expensive whiskey/bourbon (blech, never my thing) and the occasional six pack, but those are never for me. I've personally come to the realization that I CAN have just one or two, but only socially. A drink at dinner is fine, as long as I'm not picking stuff up on the way home. As long as it isn't IN my home. \n\nMy addiction is still there, waiting. It still tells me just about every day to go get a drink. It's fine, we're fine, we're doing good, one night won't hurt, it's right there, it's so easy, he'll never know. But I know. I know if I give in I'm gonna feel like shit. I'll have let myself down.\n\nI don't count days, I don't go to meetings, sobriety isn't my identity, and I don't feel like a failure if I have that drink or two. But I know what I'm capable of. \n\nStick to your boundaries. When they say \"but you used to drink a ton\" as if you're a hypocrite just say that it's BECAUSE of how much you used to drink.\n\nIf you don't care that they drink just host elsewhere.\n\nAlso, congratulations. Staying sober is very, very hard when you've gotten to that point before.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It's totally understandable, \"alcohol is normal\" and \"it's normal to have alcohol in my house\" are 2 huge differences, I don't often buy junk food because when it's there I devour it. I don't get bothered by others eating it because I don't have the ability to reject temptations constantly, sure I'll not eat the kit kat today, or today... well might as well... \n\nPersonally I think its a case of slipping from \"friends can bring alcohol, someone left there alcohol, there's alcohol in my fridge\" continued. \n\n\nStick to your guns. However what I personally would suggest is looking at a local boardgame bar/pub/cafe that you could host at!",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Hosting at somebody else's house is similar to going out with friends to dinner and them having drinks at the table. You can expect there to be alcohol there, but you can also not worry about it staying around you or bringing it home. However, at home, that's your sanctuary, and bringing in things that cause distress ruins it being a sanctuary. Think of it like smoking pot or cigarettes, you may be okay being around it, or even at somebody's home where they smoke indoors, however that doesn't mean you want it in your home. Excluding the smell portion of it, alcohol is a drug, and many simply don't want drugs in their house. On top of that, what happens if one of the party goers leaves their extra cans/bottles? That's a habit I've noticed at every party I've hosted, booze left for the host due to forgetfulness or a \"good will gesture\". OP seems to have a strong handle on themselves, but imagine they run into a drink left at their home on a really bad day, bad day just got worse because now they have to fight the urge that is always there with addiction, or it could even cause a relapse.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I think if you're the host, there's also this psychological issue of you're trapped, you can't lea e if it gets to be too much, that isn't there if you are a guest somewhere else.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This was my point in my comment before reading yours! Seeing alcohol in my safe space would kind of taint the space for me. I never want to have the association of alcohol in a place that I want to feel secure and safe. My home is for happy memories and the life I’ve built post active addiction.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "> Hosting at somebody else's house is similar to going out with friends to dinner and them having drinks at the table\n\nSimilar only for the guests, but not for the host. OP is the host. Following the analogy: the host sets venue rules, not guests.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "For a lot of people, their house is their safe space. They don't want something triggering in their house, even if they can normally tolerate it. The smell might linger, op would probably have to do cleaning related to it.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This is a good example because I have a ridiculously keen/sensitive sense of smell and there are food items I just _cannot_ have in my house because of it, it makes me feel trapped and deeply uncomfortable in my own space.\n\nIf I hosted a dinner party and a friend claimed they _really wanted_ to bring one of the things I can't deal with I'd say sorry, no can do but I'm happy for you to host instead then.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "OP is NTA. Everyone else who is demanding to drink in his house absolutely is an AH. Sure, the suggested alternatives work, and OP is fine being around other people who are drinking. However, the idea of forcing alcohol into the home of someone who explicitly has said they had a problem drinking in the past and would like to avoid it, expecting them to break a boundary they have set to cope with addiction and trauma, just so you can be comfortable is absolutely an AH move.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It genuinely makes me wonder if people actually like the “hobby” they’re partaking in (ie. playing board games) or if it’s just an excuse to drink. I don’t drink either and I love board games and tbh with the games my friends and I play I can’t imagine being inebriated while strategizing on how I’m going to win…",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This is the best answer I’ve seen so far. The friends’ reactions are overly dramatic but I can also understand the friends’ POV if their nights out are limited (by small children, getting babysitters, etc). I think too many responses here are jumping to “why can’t they go 3 hours without drinking” - what if that’s their 3-hour night out this month?",
          "id": 154,
          "comments": [
            {
              "score": 3,
              "content": "AGREED. \n\nNo one appreciates having their ability to decide how to spend their time being restricted. What made the friends AH’s in this situation was the attacks on OP as a person.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I don't agree,  maybe for associates but not for friends.  You don't need alcohol to be around your friends.  You are comfortable around your friends,  you don't need anything to \"loosin\" you up. This is game night for a few close friends. These ppl know each other. That's why it sucks that they are not being supportive. If my friend was recovering from alcohol i would all I could to help. I am a social drinker ( only drink at social activities) but I'm a ho.e body so I only socialize maybe twice a month max. My oldest sister is my bestfriend but also a recovering alcoholic. When we go places together I don't drink so she doesn't feel like the only non drinker and so if someone tries to peer pressure her/us I defend us. Like no thank you , you have natural highs we won't be drinking tonight but thanx for asking. Because ppl try to get you to drink not knowing it could mess up your life.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 890,
      "content": "NTA. I wouldn’t want to attend a dry game night either, but arguing in a group chat about bringing booze into the home of someone in recovery is not the way this should have played out. Why didn’t someone else just offer to host? Seems like common sense if the alternative is alienating a friend from a hangout.",
      "id": 157,
      "comments": [
        {
          "score": 391,
          "content": "I think both sides have been so caught up in what we thought was the right thing, that we haven't properly looked to a solution. Having someone else host is definitely an option I will bring up. Thank you",
          "id": 158,
          "comments": [
            {
              "score": 126,
              "content": "There is only one right thing: The home decides these things. That goes back to the dawn of humanity.",
              "id": 159,
              "comments": [
                {
                  "score": 21,
                  "content": "great idea! let me ask my house who’s right real quick! /s",
                  "id": 160,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Your walls are talking? Either Casper is a really cool fellow, or your home needs a no drugs rule lolol",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Whoa! That’s a very serious game night.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Exactly my thought\nYou're perfectly within your rights to have boundaries in regard to booze but the others should have respected that by offering to host at theirs rather than try and force you to comply\n\nNTA",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP you are fine to have that rule in your house, but it's not really a reasonable rule for your friends, so just not hosting would be the ideal.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "Why wouldn’t you want to attend a dry game night? (That sounds like kind of an aggressive question, but I’m honestly just curious.)",
          "id": 165,
          "comments": [
            {
              "score": 134,
              "content": "Many people like to have something like alcohol to help them loosen up in a social setting like game night, particularly if an RPG is being played. It can be common for introverts or it’d be incredibly uncomfortable for them (source: many of my introvert nerd friends and hubby)",
              "id": 166,
              "comments": [
                {
                  "score": 76,
                  "content": "And some introverts like myself would definitely stay away from alcohol in social settings because it makes people loopy and unpredictable.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 17,
                      "content": "[deleted]",
                      "id": 168,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Everyone is so different. I’m the same way as you, I don’t really like to drink in crowds because it makes everything unpredictable to me and I get crazy anxiety the next day.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I’m an introvert and don’t drink. If they’re your friends there should be a comfort level and introversion is about energy. I train people for a living and after I’m done my energy has been depleted and I need alone time to charge up. I share that because people tend to get introversion and extroversion mixed up thinking it’s abojt being able to speak in front of people, or being out in crowds. It’s about energy.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I think about this quite a lot. I am extremely introverted, and for me one of the biggest energy drainers when I’m around other people is my brain always being “on”. It’s like running an app that depletes the battery really quickly. In those situations, having a few drinks slows down the mental processing- it’s a bit like activating battery-saving mode. So, I’m able to socialise for longer than when I’m completely sober. (I’ve probably explained that really badly; it makes perfect sense in my head but hard to put into words!)",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I get that.\n\nFor a game night there’s many people, lots of opinions and loudness and a lot of having to be fully present. My husband for example knows that’s going to be really taxing for him, having a few drinks really extends his social battery. I’m not saying it’s healthy, it’s just what helps him step into it and be present/outgoing for the whole night.\n\nHas he played game night without drinking? Of course he has. But it’s no where near as fun and he’s usually tapped out after an hour.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I feel that",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "this is me 100%. im very shy and quiet, but get a few drinks in me and im introducing myself to everyone i see. its definitely nice to have a little liquid courage to allow me to actually talk to people.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Disclaimer: I'm in Ireland and we don't have the best culture around attitude \n\nI run conventions and other gaming events and people have a lot of differing opinions on this. I'm currently running a monthly larp and the venue I found for it doesn't serve alcohol.  I've had people express happiness about that, saying they appreciate feeling no pressure to drink.\n\nAdmittedly larpers are a different breed of gamers. We often do weekend long events, or attend larps early in the day. If they *needed* alcohol to feel comfortable roleplaying it'd get unhealthy fast.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "I for one work nights most of the week. If I get the chance to catch up with friends I'd love a cold beer to go along with it. Doesn't mean getting shitfaced and if someone was hosting and they didn't want any grog around I'd comply sure.",
              "id": 176,
              "comments": [
                {
                  "score": 4,
                  "content": "I get that",
                  "id": 177,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 53,
              "content": "Some games are better with alcohol.  \nTimeline is a blast if you have nerdy friends who are drunk. Lots of screaming over the ridiculous facts you learn along the way. Monopoly Deal becomes a bloodbath no matter what you do, but alcohol makes people loose and happy. When I first started DnD, I needed to be at least a little tipsy to feel comfy with the immersive improv.   \nI'd never fault anyone for staying sober, though. As the occasional DD, it's fun to watch the drunk shenanigans unfold and there's no need to actively partake.",
              "id": 178,
              "comments": [
                {
                  "score": 22,
                  "content": "Moood, drunk nerdy gatherings are great",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Social lubricant. I enjoy an adult drink on an adult night out.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Honestly having a yummy craft beer or nice glass of wine with friends is just really nice, in a similar way to having good food together. It’s relaxing and part of the sort of ritual of the event/game night, I totally get people being annoyed that something they look forward to would be off limits. Their reactions are wayyyy over the top but I would understand some mild annoyance. \n\nI would just suggest that OP doesn’t host, considering that drinks are clearly part of the regular event.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Same. Work hard during the week I’m gonna blow off some steam with a few beers\n\nNot to say I’ll get plastered but a few beers is perfectly fine on a weekend",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I rarely drink, only on occasions, so when there's an occasion, drinks are part of it for me. \n\nSome people like to comment it with 'if you can't go 3 hours without alcohol, you have a drinking problem' blah blah blah, but it's actually the opposite. I won't be 'catching up' on the alcohol I 'missed' during the meeting, I don't *have* to drink, I like it, like I like to dress nicely when I go out. \n\nI wouldn't argue with OP, her house her rules, but I probably wouldn't come either if she was just a colleague, because I don't like to give up things I enjoy for people that I'm not close with.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "To be honest I probably wouldn’t because I find games a little bit boring. Quiz games are great but board games and games where you have to wait for your turn are kind of boring. \n\nGenerally though I don’t think it’s too much to ask not to drink for one night, but OP is 37 and I’m assuming their friends are a similar age, which means they might have kids and don’t actually get a lot of time off/opportunity for a drink. \nIf that was the case for me if I can’t do something I want on the one night I do get off, I’d be pissed if someone told me what I can and cannot do, even if I respect their right to have this boundary.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agreed.\n\nOP certainly has the right to ban alcohol in her home.\n\nAt the same time, people like to have a few drinks and relax and it's been a thing at every other hosts house.  So it is weird to not drink at one specific hosts house.\n\nI think OP should probably just stick to hosting events where people don't expect to drink.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I can't imagine being one of the friends pushing back. Just make an excuse and don't show up. I love not showing up for stuff, give me the smallest reason and I'm not there",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 373,
      "content": "NTA\n\nYou have a right to set the norms for your home, regardless of societal norms. I expect people to take their shoes off when they enter my house, regardless of what they do in others' homes. I have been asked to pray before a meal, regardless of my beliefs, so will respect it with a quiet moment while the others pray. When you enter someone's home, you respect their expectations. If you can't do that, you should stay away. If your friends come to your home, they should respect your choices. I wouldn't leave the game group, but that is your call. If people want to drink, they should offer to host in your place.",
      "id": 187,
      "comments": [
        {
          "score": 54,
          "content": "Fair enough. But it's totally OK to not want to visit a household where I don't like the rules/ expectations.\n\n\nWhile OP can set her boundaries and those need to be respected, if the group decides they don't like them and they won't come to her house (and because she can't contribute she's not invited anymore) that's the consequences she needs to accept. Good friends won't go that far imo, but they also wouldn't try to weaponize her past against her to force compliance. \n\n\nIt's ok to not drink. It's ok to want to drink (unless it becomes harmful to other's or yourself). Yes alcohol can be dangerous, doesnt mean I need to belittle people who like to have one or two beer when they meet friends, especially if it's once a month. (We have no knowledge of their drinking habit, could be the only time they get out and have a drink).",
          "id": 188,
          "comments": [
            {
              "score": 137,
              "content": ">Fair enough. But it's totally OK to not want to visit a household where I don't like the rules/ expectations.\n\nThat's true, but that's not what the other party was arguing. They insisted that they should get to do what they want ANYWAY. It would be like berating the above commenter and insisting on keeping their shoes on.",
              "id": 189,
              "comments": [
                {
                  "score": 28,
                  "content": "I think the argument from the other side was that op goes to other games nights when there is alcohol but now it’s at his place he wants to restrict.  Op just needs to not host if it’s normally a time for some people to drink and he doesn’t want it in his house.",
                  "id": 190,
                  "comments": [
                    {
                      "score": 9,
                      "content": "The friends are idiots if they can’t tell the difference between someone existing around alcohol in the world and a recovered alcoholic not allowing alcohol in their own home. The idea that they can never host if they don’t relent and serve alcohol is patently absurd.  \n\nNo one is required to go if they don’t want to, but his friends are being horrendous.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah, I think the solution where they \"host\" at someone else's house may be the best one",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "These “friends” are the ones who belittled OP for their past drinking habits. OP is not claiming to be better than anyone for not drinking, they just don’t want alcohol in their home.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 292,
      "content": "NTA. \n\nAs others have said, it’s your house and your rules. The way I see it, there’s a couple of options moving forwards that probably need a discussion involving the whole game group coming to some sort of consensus about what kind of board game group it is. \n\n1. If alcohol is a requisite part of the board game nights, then your house isn’t appropriate for hosting them and should probably be skipped from the roster. \n2. If alcohol is *not* a requisite part of the board game nights, then your house can be included in the roster and the people for whom that would ruin the night can just skip it if it’s that big of a deal. \n\nHonestly, I’m not going to morally load wanting to drink while playing board games, because having or not having alcohol can change the whole vibe of the night depending on the type of games that you play. What I *will* morally load is your friends trying to use the fact that you’re a recovering alcoholic as leverage to try and force you to let them drink. That’s awful behaviour and raises a whole bunch of questions about those “friends” that are separate to the question you asked.",
      "id": 194,
      "comments": [
        {
          "score": 75,
          "content": "Thank you. I think we have all got so caught up in arguing our own point that we haven't properly tried to find a solution. I think that after things started getting petty, we just ran with it. I'll definitely bring up the options you have suggested.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 163,
      "content": "NTA. \n\n\nIt's your house and your rules apply to anyone visiting. \n\n\nI also am sober. I lost an uncle to alcoholism 3 years ago and realized shortly after that while my drinking wasn't THAT bad, it wasn't something I should continue doing. While I don't take issue with going places/attending events with alcohol, I don't allow it in my house. If people can't be respectful of that, they don't need to come over. ",
      "id": 196,
      "comments": [
        {
          "score": 73,
          "content": "I'm sorry to hear about your uncle. My family is in the process of losing my father to alcoholic liver disease. He is drinking even more than he did before, which is hard to see.",
          "id": 197,
          "comments": [
            {
              "score": 21,
              "content": "Sorry to hear this. I lost my mom to alcoholic cirrhosis. I don’t know you but my heart truly aches for what you’re experiencing, and for your dad",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Oh OP I am so sorry. It makes your sobriety even more of an achievement because you overcame so many of the norms around you in order to get there. Internet mom hug here! ",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 153,
      "content": "So, mild YTA  \n\n\nIt's not a problem that you have a firm rule about no alcohol in your house. But, if you're aware that people bring their own alcohol and drink at these events, and you're fine with being involved with the events when it's hosted elsewhere, you should NOT offer to host and then expect everyone else to change the way they spend their evenings due to your rules.  \n\n\nThis shouldn't have even been a conversation. You made yourself the AH by not thinking the situation through, thinking that it would be fine to offer to host but also expect to fundamentally change the character of an ongoing gathering. That was extremely impolite of you. And pushing the \"IF YOU CAN'T GO X TIME WITHOUT A DRINK YOU HAVE A PROBLEM\" was VERY rude indeed. People wanting to do certain things to have a good time is not equal to them having a problem if you're denying them the chance to relax and socialize the way they expect to at these kinds of events.  \n\n\nSo as others are saying, either host at your house the way that it's been hosted, or don't host at your place and help others with the hosting, but don't push at folks and deny them what they consider to be fun and relaxing just because of problems you've had in the past. You put everyone in a position where they had to choose and you shouldn't have done that.  \n\n\nLearn to read the room. Don't ever try to change the expectations for an ongoing gathering if you're offering to host. It was really inconsiderate of you to turn it into an issue instead of figuring out in advance that you shouldn't mess with the status quo.",
      "id": 200,
      "comments": [
        {
          "score": 115,
          "content": "> And pushing the \"IF YOU CAN'T GO X TIME WITHOUT A DRINK YOU HAVE A PROBLEM\" was VERY rude indeed.\n\nLet's just ignore the part where these \"friends\" said he needs help if he can't tolerate someone else drinking around him for a few hours (which is clearly untrue as OP does it every other game night), and used OP's literal prior alcohol problem as justification to let them drink. \"You used to drink too much, you can't tell me I can't!\" is such a delusional thing to say.\n\nThis is a games night where some people drink, some don't. This isn't a weekly wine-tasting or beer&pool party that OP's suddenly trying to make teetotal. You're wrong, and your comment is so ridiculous.",
          "id": 201,
          "comments": [
            {
              "score": 15,
              "content": ">beer&pool party\n\nI personally wouldn't attribute a pool party being equal to a wine-tasting, I'd put it in the same category as a games night",
              "id": 202,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 108,
          "content": "OP only mentioned the “if you can’t go X without a drink” thing after people brought up their past drinking habits & suggested that if they can’t have alcohol in their house then they have an issue.",
          "id": 203,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 74,
          "content": "People who make this big of a deal about one of their friends not drinking are part of the reason I was so afraid to stop. We really lose so much of our social & support circle when we suddenly aren’t fun in the (inebriated) ways they want us to be. \n\nOP, you deserve friends who want to come hang with you for the company whether they can drink or not because you’re just as valuable a member of the friend group as anyone else. \n\nAnd you don’t have to change the ways you keep yourself SAFE to deserve that.",
          "id": 204,
          "comments": [
            {
              "score": 57,
              "content": "The fact that non-drinkers face more social backslash than actual acoholics that destroy their families and their kids' childhood just triggers me to a point I can't even explain",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "To be fair the big deal was made of everyone being prohibited from drinking. I didn’t see anything about anyone caring whether OP drank or not. ",
              "id": 206,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Yeah, OP trying to change the norm/vibe of an established event just because they want to host is ignorant/clueless at best and rude at worst. \n\nJust don’t host. If game night was the once a month I got to relax and have a craft beer or two I’d also be a bit pissy that I could no longer look forward to that because OP felt compelled to host.\n\nThe friends are over the top and rude, but OP frankly IS a poor host by trying to change the character of an event and expecting everyone to be fine with it. Everyone is rude here.",
          "id": 207,
          "comments": [
            {
              "score": 22,
              "content": "Exactly. It's not about \"I can't go X amount without a drink.\" \n\nIt's more like - if I **only** get to drink with these friends on game night and now I have to give that up when OP hosts, I probably wouldn't show up every time either, depending on how the week went. \n\nIf OP can manage being around it when other people host, why can't OP manage being around it for a few hours hosting at home? I don't understand the difference besides the location. *\"I don't want it in my home.\"* Can OP please explain why this distinction is so important? Cuz unless there's a very reasonable explanation besides alcohol being the problem (which it isn't if you can be around it at other hostings), I'm leaning toward YTA.\n\nIt doesn't mean you always allow alcohol for guests, but if this is the established norm in the group at other locations, you shouldn't be hosting if you have a problem with it in *your* home.",
              "id": 208,
              "comments": [
                {
                  "score": 12,
                  "content": "> I don't understand the difference besides the location.\n\nThat is the exact difference. \n\nYou decide what happens in your home. The other people decided alcohol was fine in their homes, and that's their choice. OP has decided that alcohol is not fine in their home, and that's their choice.",
                  "id": 209,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Then OP shouldn’t host. That’s simple and also a choice.",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It is somewhat quirky seems like a compromise could have been reached where everyone dumps their liquor or takes home at the end of the night. Ultimately this arose out of a misunderstanding, so nah so far but as the argument rages on we’re drifting into. E s h territory. OP could nip this in the bud by simply apologizing for the confusion and stating he thought he was clear about his house being alacohol feee but apparently not. It’s a nice apology/non apology where you take responsibility for the miscommunication but nothing else. ",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "I do agree. \n\nI think it’s more of a case of NAH though. \n\nYou have a boundary and that’s ok. You don’t want alcohol in your house. It’s also not on your friends to cut themselves off as they have enjoyed casual drinking at other persons houses. \n\nProbably the best thing is to not host in future. \n\nIt can be a peaceful resolution. \n\n(In saying that, those who do want to have a drink or two will probably not want to go to your home in future so prepare for that).",
          "id": 212,
          "comments": [
            {
              "score": 2,
              "content": "More ESH.",
              "id": 213,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "This. It should have been a conversation before you offered to host as it's a group event that seems to be consistent at all gatherings in everything but the location",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I agree with you as well, I think she knew where this was going. Mild YTA \n\nDONT HOST",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "You know, I really didn't expect to agree with a YTA take, but this is very reasonably argued, so now I can at least see where the other side is coming from. I think they're behaving worse, but it's a valid point.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "OP shouldn't be excluded from having friends over for an event simply because they don't want alcohol in the house. Especially when they suffered alcholism - and addiction is well known to be a lifelong struggle, so having a go at someone for keeping their own boundaries that help them in their struggle is really not OK.\n\nSure the nature of the event will be different at OPs house. But that is not a problem - the problem is the response to that change. These aren't klds - they are adults who are nearly 40 and OPs friends are being quite inconsiderate and acting like children. The non-conflict solution would have been to suggest not hosting at OPs house if they really wanted to drink, rather than trying to force OP to change their house rules.\n\nI think OP just found out who their real friends are. A hint: it's people who respect your house rules, your health, and who suggest reasonable compromlses if they disagree with you. Real friends don't act like you're a pariah because you don't want people drinking in their home, and especially don't twist the knife on your struggle with addiction. Those AH should be the ones in therapy to flgure out why they responded with such anger and lack of care to their friend in this situation.",
          "id": 217,
          "comments": [
            {
              "score": 12,
              "content": "whether or not they should be excluded from hosting is up to the people attending. why you think anyone should feel a moral obligation to attend an event they deem unfun is beyond me.",
              "id": 218,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I don’t think OP will be excluded. They can have friends over for other events but for this particular one the friends like to have a drink.",
              "id": 219,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This.  I’m shocked I had to go so far to get to a reply that started with honest communication",
          "id": 220,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 147,
      "content": "NTA, but \"I responded and said that if they can't go three hours without drinking then it was them that needed help\" is a ridiculous take. Wanting to enjoy a few drinks at a game night doesn't mean they can't go a few hours without drinking. They're not drinking alcohol 24/7 other than at your house are they? The game nights might be the only time they drink.",
      "id": 221,
      "comments": [
        {
          "score": 107,
          "content": "Was looking for this comment. Similar to a dry wedding reception, NTA when it's properly communicated and you don't get butt hurt when attendance takes a hit. But the \"if they can't go X hours without a drink\" argument is so desperately silly.",
          "id": 222,
          "comments": [
            {
              "score": 40,
              "content": "I do agree that everything got petty and ridiculous. I would have been fine with them opting to skip it, I just wasn't happy that they were trying to get me to allow them to bring alcohol into my house. Everything kind of went to hell after that, and especially when others got involved. The three of us need to sit down and talk this though and try and resolve things.",
              "id": 223,
              "comments": [
                {
                  "score": 49,
                  "content": "Yeah, it does sound like they pushed beyond a limited, reasonable discussion between friends and got quite disrespectful.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "They might find it weird that you don't allow it because at other meetings they drank and you had no problem with it. That kind of proves to them that you can handle being around alcohol just fine.",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "why wouldn’t you skip hosting instead of asking them to skip the game night? that makes a lot less sense…",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "\nNTA but Why don't you guys just hold game night at the pub or a maybe a boardgame café (if you've got one that serves alcohol) so no one had to host? That's what we used to do - not because of the alcohol, but it means no one has to host! Also, I'm assuming you & your friends are American because of the weird reactions to alcohol in this thread. Here, everyone would likely have had a nice cuppa during game night & then gotten wasted at the pub/club afterwards.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": ">\"I responded and said that if they can't go three hours without drinking then it was them that needed help\" is a ridiculous take.\n\nIt's a classic line from people that have an alcohol problem projecting their issues onto people that don't. A lot of recovering alcoholics believe that anyone who drinks has an issue because they fundamentally can't comprehend that other people can drink safely and for reasons like mild social lubrication or even just taste.",
          "id": 228,
          "comments": [
            {
              "score": 14,
              "content": "I don't drink just because I don't like it (no history of alcoholism in me or my family) and I still think that if you would turn down an event with friends/family just because there's no funny juice involved, you like booze more than the people you're allegedly close with",
              "id": 229,
              "comments": [
                {
                  "score": 17,
                  "content": "Exactly.  There is a world of difference between \"I prefer my games night with a drink\" and \"I will absolutely not come because I can't enjoy games night without a drink\" and there are a shocking amount of people who fall in the latter camp here.  Like do y'all actually like your friends?",
                  "id": 230,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I know of some people who only game with others because they found a group who all like Kingdom Death, and not because they like each other. It is odd.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I don't drink, but you bring up a good question. No, sometimes we don't like our friends. We just hang out with them because there's no one else to fill that void in our life. We just typically don't tell people that because it's rude and could hurt their feelings, so it's not a sociopathic thing or anything like that, that's just how it is.",
                      "id": 232,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I don't drink but I still think the friends are ridiculous and this is a fair point OP made, if not how I'd phrase it. OP friends are saying they can't hang out for three hours without a drink at a close friend's house who was gracious enough to host them? The friends would rather torpedo the entire relationship by weaponizing OP's past against them? IMO that sounds like someone who has a problem, but even if they don't have a problem they were such raging assholes that OPs jab was fair.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "I mean OP only said that after these people took a jab at their past & said if they can’t have alc in their home then they have a problem. I think it was a warranted reply given the previous comments.",
          "id": 234,
          "comments": [
            {
              "score": 28,
              "content": "Yeah people are taking this as his actual opinion rather than what it is: a proportionate clapback to a really disrespectful jab; no less at his previous alcohol issues that he's obviously been very disciplined to work through. I could not imagine using that against a friend.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "The whole conversation by that point had become really petty and childish. Things were definitely said on both sides that were inappropriate and reactionary. I fully admit that I shouldn't have said what I did and was probably being over sensitive after they brought up my past issues.\n\nI think the three of us need a sit-down conversation about solutions to the issue rather than trying to push our own take on it. Thank you",
          "id": 236,
          "comments": [
            {
              "score": 17,
              "content": "The only solution is they don't drink in your house. Of they don't like it then they can find something else to do.  \n\n\nIt's completely unreasonable of them to even be bothered by this.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "OP you still deserved more respect from your friends than you initially recieves.  Their reaction to what, IMHO, is a very reasonable request is wild. Especially assuming that these friends are in your age group as well. That's entirely too grown for them to be acting like that.",
              "id": 238,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "yeah, i always hated this argument too. i enjoy drinking at social events and on weekend nights. i hangout with my friends all the time without drinking, so i can clearly go 3 hours without alcohol, but at a gathering like this i would enjoy drinking. i would still attend, just be a little upset about the no drinking thing. but if i REALLY wanted to drink i would just drink beforehand instead of making a fuss about it",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Hard agree. I'm a social drinker who drinks twice a week. Tuesdays at  game night and Fridays with friends at a local bar to unwind. I rarely touch it when I'm alone, and I would be a little annoyed if game night went dry. It's not I can't not drink for 3 hours, but I prefer to drink during this period of time.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I think the 'friends' in this scenario are a great example of that take exactly. They are so upset by the idea of not being able to drink for a few hours at a game night that they fly straight to disrespecting OP's sobriety, house rules, and indignation? That certainly seems to me like a good time to reevaluate your relationship with alcohol. ",
          "id": 241,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "If a game night once a month is the only time you drink, and letting your sober friend have the pleasure of hosting a sober game night ONCE in a month every 3-5 months is simply just too much for you, then maybe you shouldn't have sober friends. Personally, if you cannot find joy and happiness at an event with friends without the aid of drink or drug, then you have some issues you need to work out in therapy. Imagine being THAT kind of friend. Whew. OP should be able to host and expect their friends to come have fun. I would seriously re-evaluate my friend group atp. OP is NTA, but the friends are.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "You’re purposefully leaving out the crucial bit, that the only reason they said that is because their friends made the absurd argument that because they don’t want alcohol in their house, they have a problem. It was a tit-for-tat answer to an aggressive and rude comment towards them. In my opinion, their “friends” deserved that response.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "Imma be an outlier YTA\n\nMainly because drinking has been normalized in these gaming nights and suddenly not allowing it in the gaming night seems like a power trip vibe. Definitely it is your house so do you, but you probably should not have volunteered to host,  I do not drink. I get no enjoyment from it. Like I will have a glass of wine with dinner when I go on vacation to a country that specialized in wine (i.e the one time I went to Italy or to France) but in all honesty  it's just kind of being a bad host,  no one is forcing you to drink and if it was such a problem you would not have gone to previous game nights",
      "id": 244,
      "comments": [
        {
          "score": 42,
          "content": "I understand what you are saying. Part of the reason I won't have alcohol in my house is that I have such bad memories of drinking in my house when I was at my worst, I'm afraid that if I allow alcohol in I'll start drinking again. It's not the same when I am at other people's houses, though. I don't feel that same fear elsewhere. \n\nI don't know if that makes sense to other people. \n\nI remember the darkness I felt at the time and the panic and fear when I had that realisation that I had a problem. I walked out of my house and couldn't go back for a while. I stayed at my mother's for several days whilst some family friends searched for and got rid of every bottle of alcohol I had. \n\nDespite being sober for so long, I still am terrified that I'll slip. It has gotten worse recently because my family is in the process of losing my father to alcoholic liver disease.\n\nI am going to suggest a sit-down conversation with the other two people to see if we can get past this. If they agree, I'm going to try and explain more about why I just can't have it in my house. I will definitely suggest that we skip me hosting, and I can help someone else when it's their turn.",
          "id": 245,
          "comments": [
            {
              "score": 143,
              "content": "It sounds like you honestly should not host and should not have offered. Changing the nature of an established event and expecting everyone to be fine and dandy with it and still attend IS being a poor host, ergo you should not have volunteered to host at all. \n\nIt’s totally your prerogative to not have alcohol in your home, totally understandable considering what you’ve written. But it’s not fair to volunteer to host an event that isn’t normally dry and then try to brute force everyone into enjoying it.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Don’t host then, easy",
              "id": 247,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "It makes perfect sense, OP. You are working very hard to stay sober and you know your triggers. It's like I know my triggers that could lead to overstimulation and a panic attack, so I do my best to avoid those. You're not on a power trip at all. You are protecting yourself and your home.\n\nI am so sorry about your dad. I hope you and your friends can come to a solution. If they respect you, they will also respect the rules of your home and the journey they have traveled. To me, friendship is more important than having a drink.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Why even host? Do you have fun at game nights not at your places? It seems like you are making the group dynamic a lot less fun so you can have control of the situatiob",
              "id": 249,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Can you not just say it’s okay to bring it but anything you bring you need to take with you, nothing to be left behind. Otherwise I think the right thing to do is skip your house in the rotation.",
              "id": 250,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You shouldn’t have offered to host. \n\nYou should have asked someone else to host it and offer to buy the food at their place. \n\nOffering to host a regular event, but only if you get to change the event, is a shitty thing to do.",
              "id": 251,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "You have a lot of trauma around this. Active, ongoing/unfolding trauma with your dad. That makes sense, and I think you all need to find some compromise (another house, maybe, as suggested). \n\nThe assumptions your friends had about the meaning of an alcohol free house, given you are normally around them, drinking makes sense, though. Like, it would be most people's basic assumption. \n\nHowever, you really shouldn't compromise around this by letting alcohol in your house. You're actively grieving your father, who is currently dying from this. There needs to be space for that.\n\nAnother option might be to put off your hosting until warm weather,  and play outside, if you have an outside space.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I totally get what you’re saying about associating a certain place with a certain behavior. I’ve been going through exposure therapy and it’s been very helpful to challenge these thoughts. You are sober because you’ve done the work, and at the end of the day whether the alcohol is in your house or someone else’s house it is a challenge to resist. Exposure therapy is very hard. It’s easier to just avoid situations that could potentially be triggering than trust that you have done the work necessary to resist that behavior no matter what. I’m not saying this to say you’re the asshole in this situation, I think it’s totally understandable to not want to put yourself in a position where you could potentially relapse. I’m saying this to give you the confidence that no matter what situation you are in, you are strong enough to not allow yourself to return to bad habits. That being said, good friends would understand if you are not ready to challenge yourself in that way yet. Give yourself grace and good luck, you are doing better than you think",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Thank you for sharing this. I was curious about why you felt so strongly about having no alcohol in your house. It really shouldn't matter, and you shouldn't have to explain,  but for me, it changed my judgement.\nNTJ. It's your home and you can have whatever rules you want. Your home is also your safe space and it's ok that you need that boundary to maintain it. Sometimes our fears don't make much sense. But, your fear isn't too unrealistic either. It IS possible that if your friends brought over some fifths or a couple cases of beer and then forgot them, you would be tempted to have a drink. And that can be a slippery slope.\nI really hope you and your friends can reach a compromise and continue to enjoy your game nights.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Well, lot of vegetarians neither cook meat nor allow it in their house, but since they cannot control what others do in their house, they are ok to be part of the gathering while others are eating meat. If a vegetarian hosts a party and tells no meat allowed, that wouldn’t make them an AH. If people have problems with boundaries they can volunteer to host at their own place. Guilt tripping OP about her boundaries is the AH move IMO.\nNo Good friend would push you to do something for their own selfish desires.",
          "id": 255,
          "comments": [
            {
              "score": 4,
              "content": "Offering to host a regular event, but only if you get to change the established norms, is a shitty thing to do. \n\nIt applies in your vegetarian example too. \n\nThe correct play is to offer to pay for the food or whatever and hold it at another friends house if you feel very strongly about what comes in your home.",
              "id": 256,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}