{
  "post content": "I love her, we’re not about to split up (sorry Reddit!) but I am annoyed about this and think it’s her fault, she thinks it’s mine.\n\nMy GF usually wears trainers throughout the day.  Her feet get hot and sweaty and when she comes home she takes off her shoes and socks and leaves them wherever they fall. \n\nI’m not that tidy myself and don’t really mind the shoes but sweaty socks everywhere is not very nice.  I find them all over the place. I keep asking her to put them in the laundry basket and she will that time and then forget the next time.  So I ask her and she rolls her eyes and moves them. \n\nToday, I was speed vacuuming prior to my mum coming over and a sock under the chair sucked into the hose, which I definitely did not need.  Getting it out covered me and the floor in dust.  I was annoyed and had what she called a temper tantrum and threw the now dusty sock at my gf who happened to be painting her nails. She knocked her nail polish over and it spilt on the table.  Great!\n\nLuckily she reacted fairly quick and cleaned it up before there was too much damage, though there is a stain.  Her manicure was a mess as well.\n\nThen my mum arrived.  We tried to bury it while we had company, not sure if Mum noticed. \n\nHad a big row when she left and are blaming each other.  Hopefully we’ll be ok tomorrow but in the meantime AITA?",
  "id": 1,
  "comments": [
    {
      "score": 30,
      "content": "ESH.  Asking your partner to do something as basic as putting their stinky socks in a laundry hamper shouldn’t need to happen in the first place.  It certainly shouldn’t be a constant problem.  She’s not a toddler, she can clear up her own dirty laundry.\n\nBut you did throw a temper tantrum, and made a mess you didn’t need to that damaged the table and cost her a bottle of nail polish.  You’re not a toddler either.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Fair enough! Maybe we both are!",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "NTA - does she know that the smell from sweat is caused by bacteria ? How would she like it if you left stinky hockey or roller derby gear around?",
      "id": 4,
      "comments": [
        {
          "score": 4,
          "content": "I’ve just googled roller derby. Not heard of it before but looks dangerous!",
          "id": 5,
          "comments": [
            {
              "score": 5,
              "content": "The modern derby isn't near as dangerous as the original - but we do get bruises, lol",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA \n\nOh, the perils of living with someone!\n\nIf she knew that your mom was coming over, wtf was she doing her nails for? She could have helped you vacuum and clean up but she chose not to. She continues to leave her socks on the floor so this one's on her. \n\nStop reminding her. Simply take a broom and sweep them into a pile. With gloves on, bag them and put them out in the garage or somewhere. When she runs out of socks, she'll have to go get the bag and deal with it. Just be sure you don't leave your stuff out to annoy her! LOL",
      "id": 7,
      "comments": [
        {
          "score": 3,
          "content": "Tbh my mum has nice nails, I expect it was that",
          "id": 8,
          "comments": [
            {
              "score": -1,
              "content": "So shallow. Sorry.",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "YTA. \n\nYou need to check where you're vacuuming to make sure its dust and not something valuable or something that would cut the bag. You can blame her for being a slob but the temper tantrum was on you.",
      "id": 10,
      "comments": [
        {
          "score": -2,
          "content": "She used the words temper tantrum.  I would have called it cathartic release or something 😉",
          "id": 11,
          "comments": [
            {
              "score": 8,
              "content": "No, throwing shit is what babies do.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA.  She is a bit of an AH for leaving the socks out (gross!) but throwing something at someone (even a sock!) in anger is absolutely not acceptable behavior.  You were way out of line and you should apologize sincerely and assure her that you will never have a tantrum again.  Have a separate conversation about the socks.",
      "id": 13,
      "comments": [
        {
          "score": -1,
          "content": "Ok.  But we’ve  had many many conversations about the socks. If I’m voted TA I’m going to have to give up and live in a stinking house with festering socks in every corner!",
          "id": 14,
          "comments": [
            {
              "score": 8,
              "content": "So it's either just give up or throw temper tantrums?  Maybe you need to read some books on relationships and communication.",
              "id": 15,
              "comments": [
                {
                  "score": -1,
                  "content": "Sorry, that was a bit of a tongue in cheek reaction to your comment. Thought that was a bit over the top tbh.  Edit -spelling",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. Throwing a sock is far away from throwing dishes or even slamming doors. It's natural your temper boiled when you're in stress, trying to clean up, and there's the 1000th sock on the floor when you've repeatedly told her to clean after herself. It's unfortunate coincidence her nail polish tripped. Surely you two can talk this through after good night sleep, get over it, and then you can come up with creative ways to deal with her socks. Maybe she remembers them better if they wait for her on her pillow or something! Or when she truly runs out of socks.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "YTA who throws a sock? Honestly?! 😁",
      "id": 18,
      "comments": [
        {
          "score": 3,
          "content": "Well…",
          "id": 19,
          "comments": [
            {
              "score": 6,
              "content": "Sorry,  it was a movie reference. It seems like you threw the sock with all the dust deliberately to ruin her nails. That's why I have you the AH title.",
              "id": 20,
              "comments": [
                {
                  "score": 3,
                  "content": "No, I really didn’t think that far ahead about ruining her nails.  I was just frustrated in the moment. I can see why you’d make that judgement though if you thought that was my intention. If she thought that, I’d be sleeping in the road tonight!",
                  "id": 21,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Lol did it see what she was doing or only after the throw?",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Going with YTA, it sucks that she didn’t put in more effort but throwing a tantrum and throwing a dusty sock at your gf is a little excessive.",
      "id": 23,
      "comments": [
        {
          "score": 7,
          "content": "Her sock….",
          "id": 24,
          "comments": [
            {
              "score": 4,
              "content": "Exactly",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH Her for not putting her socks in the laundry basket and you for throwing the sock.",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. Your girlfriend not being able to throw stinky socks in a hamper is soo gross and inconsiderate. How old is she? Now you throwing the sock at her was rude as well. If you both can’t live under the same roof with respect for each other maybe you guys should live separate or grow up and start respecting each other more. Simple.",
      "id": 27,
      "comments": [
        {
          "score": -1,
          "content": "There’s always one on Reddit. We aren’t going to separate!",
          "id": 28,
          "comments": [
            {
              "score": 6,
              "content": "When did I said you guys should break up? Some people are together and live in separate houses. But of course you skip the part where I said LEARN TO RESPECT EACH OTHER’S SPACE as the alternative. Simple.",
              "id": 29,
              "comments": [
                {
                  "score": 0,
                  "content": "Ok.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}