{
  "post content": "My mom was a great mother. I had a really good childhood, especially considering how young she was and that my dad is a piece of shit. I really appreciate how she shielded me from all of that. \n\nMy mom is married to my former boss, and while it sucks for me, I do believe she did her duty as a mother and deserves to be happy. I used to work for \"Brandon\". This was one of those jobs where networking was everything, you really needed the boss to like you, and you had to present a certain image. i will admit I tried way too hard and to put it lightly, Brandon did not like me. He was a condescending ass, and my mom was aware as I vented to her about work. He wasn't outright abusive, but did laugh at me a lot and make a few comments that weren't cool. \n\nMy mom and Brandon met at our wedding. Now I don't believe in love at first sight, but they definitely had something there, and my first instinct was eww, but they got serious really fast and I have to say he makes her really happy, and she has never seemed truly happy before. I hate being around him, wish this never happened, but I am happy for them. My wife thinks my mom is a bad mother for putting herself first.\n\nRecently my five year old son asked why we don't see my mom as much as my in laws (about once a month vs once or twice a week) My wife said that while my in laws were the best parents, my mom was a bad mom because she married Brandon who had not been nice to me, and we don't spend much time with her because she was selfish. \n\nI was furious and told my son that was not true. I said we don't spend time together because my mom has a busier life, and because MIL doesn't work so they sometimes go over during the day. I said that it was wrong of my wife to say that, and my mom was a great mom. \n\nMy wife told our son I was wrong and a good mom would not have married someone like that. I snapped and told my son not to listen to his mother, and she just doesn't like my mom. I said that women with adult kids should put themselves first and maybe it isn't healthy how much we see MIL, but my mom is a great person and I won't hear anything more about it.\n\nwhen my son went to play, my wife confronted me and said I undermined her and was acting like a mama's boy. she said I should not have raised my voice (didn't yell, but did raise it) and that I shouldn't be confusing our son when what my mom did was objectively not ok",
  "id": 1,
  "comments": [
    {
      "score": 6365,
      "content": "Esh. Next time you two children want to fight through a third party instead of talking to each other *like fucking adults*, try using the dog instead of your impressionable kid as the prop.\n\nBoth of you suck. Grow the fuck up.",
      "id": 2,
      "comments": [
        {
          "score": 1346,
          "content": "My parents did this all the time - putting me and my brother in the middle of their arguments - and it’s a fantastic way to screw your kids up.",
          "id": 3,
          "comments": [
            {
              "score": 281,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 77,
                  "content": "CHUCKLEFUCKS!!!!🤣🤣🤣🤣",
                  "id": 5,
                  "comments": [
                    {
                      "score": 17,
                      "content": "This is one of my husband’s insults of choice- note the commenter above is not my husband 😂 !",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Fucklechucks.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 73,
                  "content": "OMG that is my new word of that day!",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Yeah, my parents were generally great parents, but they did this a lot and my therapy bill is pretty hefty.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Chucklefuck is such an all purpose word, like twatwaffle or douchecanoe.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1,
                      "content": "So if you are ever in really really really impolite company (and don't mind getting super dirty looks) I have said the c word muffin before 🤫 just once.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 115,
              "content": "Me too. A lot at the dinner table. \"Tell your mother she's a horrible person\" \"tell your father he's an asshole\" I still get anxiety eating at a dinner table. I only did it until my sons were teenagers and I could explain. We eat at the bar in the kitchen now instead. Now we do it on special occasions. \nAlso, my brother and I used to HATE each other because they used us against each other as well as themselves. Growing up in a house where you can't trust anyone isn't ok. It took me years of therapy and a lot of mistakes to change that for my kids.",
              "id": 12,
              "comments": [
                {
                  "score": 16,
                  "content": "That's just awful. Sorry, you went through that and especially during dinner. How the hell can anyone eat. People are just nasty to one another and sadly they don't think about the effects their selfish behavior is having on their kids. It's the reason I left my partner when my son was 1. I don't want him growing up and thinking it was normal for a man to abuse a woman he supposedly loves.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thank you. I'm glad you got out. For yourself and your kid. I left my partner for the same reasons when mine were 4 and 6 months. He was a good partner for a while but he started going to a radicalized church. I didn't want my kids to think that's normal. \n\nMy mom has apologized. Like really apologized, years ago. I'm 40 now and we have a much better relationship. My dad, unfortunately thinks that's \"just what happens when you're going through a divorce\". So he and I don't speak. Fot that and a LOT of other things. \n\n\n I've known many people who civilly divorce and co-parent better than they did together. But that takes 2 kind and willing parents.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": ">it’s a fantastic way to screw your kids up.\n\nCan testify.  Only it was just me - my siblings were somehow exempt.  But it screwed me up pretty badly.\n\nESH - your wife is a real piece of work for what she said but both of you suck for using your child to fight.",
              "id": 15,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Yeah, so did mine. Well mostly my mother. She tried to make us take sides, and even vent to us about their relationship when my dad wasn't around.",
              "id": 16,
              "comments": [
                {
                  "score": 39,
                  "content": "My mom did the same. I was pretty much my mom’s marriage counsellor, and if my dad was mad at my mom after a fight we were lumped in with her and he wouldn’t speak to anyone for days. Parents need to think more about the impact this stuff has to their kids.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yup. Same. I got tired of defending one parent in front of the other when they would tell me how bad the other parent sucked. Parents were divorced, & finally I was in my teens & told them both, separately, to knock it off. \n\nMe: Yes, Dad is an alcoholic asshole. Yes, Mum is a promiscuous “free spirit” that puts men above her children. But you’re still my parents & I love you & this shit has got to stop.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This exactly. I've experienced this also and it fucking messes you up.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Unfortunately, as a fellow member of the Child-needs-therapy-due-to-parents Club, I can relate only too well.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "\"So what do *yooooouuuuu* think of what Daddy did? Do you think he should have done that?\" \n\nIf I agree with Mom, I hurt my dad. If I agree with Dad, Mom will find a reason to hit me with the belt later\". \n\nYup, fantastic way to screw a kid up and give them anxiety when yelling starts that a beating may be forthcoming. \n\nESH except that poor kid.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "What does that do to a kid?",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 298,
          "content": "I agree in theory but it would not have been ok for him to leave his son with the impression that his mom was a bad mom if she wasn’t. There were absolutely better ways to correct this but wife backed him into a corner.",
          "id": 23,
          "comments": [
            {
              "score": 225,
              "content": "You cut the conversation short right away, sort it out just between adults, then apologize to the kid later and explain things in a healthier way. \n\n\"I'm sorry you had to hear Mom talk about Grandma this way. Mom doesn't agree with some choices Grandma made, but it's nothing that concerns you and you should not feel responsible for any of it. Grandma loves you very much, and I am very glad to be her son. Do you want to tell me how that conversation with mom earlier made you feel/ do you want to ask me questions about this?\"",
              "id": 24,
              "comments": [
                {
                  "score": 152,
                  "content": "I can appreciate what you’re saying but in the moment I doubt that I would have done that. I like to think I’m a good parent and, thankfully, I don’t think my husband would ever pull this passive aggressive BS but I absolutely would have defended my mom in the moment. Maybe that makes me immature but I wouldn’t have let that stand. There’s a reason you chastise and course correct in the moment because children’s memories aren’t that long. I agree on cutting the convo short but I would’ve corrected what my child heard right then and there.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 80,
                      "content": "I agree with you. It’s very easy to write out what one should say after the fact or when you aren’t there. I would also immediately defended my mom. I guess I am also a bit immature.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I agree, some of the scripts that get written as what you should've said read as first drafts from bad novels. In real life we have emotions that usually lead us when we're in uncomfortable situations. Hearing his dad correct something his mum said that wasn't true wasn't going to harm him, what will is the fact his mum wouldn't let it go.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "My parents always did that — if one said something the other had a strong reaction to, it was an immediate “can I talk to you in private” instead of “no, kids, see mom is wrong because…”\n\nThen they hashed it out and came back to us kids as a united front. I don’t think it makes you immature not to do that, but I do think it’s something anyone can practice. It’s way healthier than what OP and his wife did, which was basically using the kid as the rope in an angry game of tug of war.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Defending your mom, yes, but pulling your child into it like this? Honestly I think most people would feel uncomfortable having such a conversation with a kid, arguing to try and convince him of the correct thing to think about his own grandmother.....",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -20,
                  "content": "Lmao please stay away from any kids you know.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Absolutely.  In my book you do not put down the child’s grandmother to the child",
              "id": 31,
              "comments": [
                {
                  "score": 4,
                  "content": "Hard agree. I am functionally no contact with my husband’s mother and I have never talked down about her to or within earshot (like not even in the same house) of my kids. My daughters (2 & unborn lol) will likely never even know her and my bonus baby (9) is starting to realize she’s a few berries short a fruit salad but I do not talk badly about her. She, however, will badmouth me to him and I keep a neutral tone and tell him that when people hurt inside sometimes they hurt other people. That we both love him and it’s ok if we can’t be friends etc…what this woman did (and for such a dumb reason) is so beyond inappropriate and I don’t think OP was wrong for shutting it down.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Exactly.  I don’t even care who’s right or wrong with regards to the actual argument.  You put your kid in the middle of your fight?   You suck.  Both of you.  Period.  I was that kid.  Trust me, he’s going to hate you both when he grows up, and probably long before then.",
          "id": 33,
          "comments": [
            {
              "score": 16,
              "content": "Thank you. I see a lot of comments about who is wrong and who is right. It doesn’t freaking matter who’s right and who’s wrong. Don’t put your kids in the middle when you fight. If you don’t understand this you shouldn’t be a parent.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "This.  Both OP and the wife are AWFUL here.",
          "id": 35,
          "comments": [
            {
              "score": 58,
              "content": "The wife is the awful one poisoning the kids mind against his gran.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "THIS. Your poor child. He's all of 5 years old. SMH.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It's like this Studio C sketch, but no happy ending. https://youtu.be/sVPaf7aBmqw",
          "id": 38,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "No, leave the poor dog alone!",
          "id": 39,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "You're right but how do you deal with it once wife had insulted mother to 5 year old? I wouldn't want 5 year old repeating what was said, you can't ignore it. \n Maybe op should have said; I think we need to talk further - to wife. And I love my mother very much it would be nice if we did see her more often, shall we speak to her to arrange something - to 5 year old",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "what? he can’t just let his kid think his grandmother is a bad person, he had to correct it\n\nget off your high horse",
          "id": 41,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Now about the issue the mother marrying that person. I am a bit conflicted if a person was treating my kid like that If I would ever like him. I mean it is a bit bad. If we disregard the \"fight in front of the kid\" issue and comment on mom's actions..... I don't really find that action especially flattering. A toxic boss that insults my kid, and me (in me 45-50) fall in love at first site? Nope from me. I think OP has a filter in many things about his mother, his wife is probably right but still the convo should be between adults first and reach to a common response to the kid.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1761,
      "content": "ESH. No one is a winner here. \n\nyou're both shitty for putting your child in the middle of an argument between you and your wife. Neither of you were actually talking to your son, you were indirectly being jerks to each other about an issue it seems unresolved between the two of you. \n\nKeep your son out of this. It's only going to cause him a lot of issues in the future. \n\nDiscuss your issues like adults, don't use your son as a passive aggressive tool.",
      "id": 43,
      "comments": [
        {
          "score": 99,
          "content": "YUP.  Both of you were WAY out of line for having the argument with your son as a prop rather than just between yourselves. Do you clearly not see how damaging this can be for your little boy?",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "I find it ironic that they were fighting over if his mom was a bad mom or not while they were both being bad parents and using their son as a tool.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "OP didn't put the child in the middle of argument. The wife openly dissed OP's mom and tried to make OP lie down like a mat while she spewed unkind comments. \"Don't call my mom selfish for having her own life\" is not using the children as a tool. They just had the misfortune to witness their own mother's spite. She could have chosen to stop at any point.",
          "id": 46,
          "comments": [
            {
              "score": 8,
              "content": "This. She made a nasty comment and OP said no. Then she turned around and went *back to the kid*. OP's wife forced the situation, it's not OP's fault",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 672,
      "content": "ESH but the kid.\n\nWhy are you two using the kid as a family therapist to voice feelings and opinions of your mom?\n\nIf you aren't seeing mom as much because of her husband that really isn't your 5 year old's business. It's ok not to answer that question fully.  Kids have diarrhea of the mouth and there is no reason to use him as an excuse to \"accidentally\" have him spout off the next time he sees his grandmother. Exactly what's he supposed to call your tormenter you don't say.  You also haven't said whether or not your former boss now stepfather was man enough to own his behavior and apologize. Need a little more data.\n\nI disagree with you that an adult parent has carte blanche to pursue a relationship with someone that tormented you.  You did give a subtle nod of approval for this guy by inviting him to your wedding. I think you made the right decision to avoid them as much as possible and bear in mind the tormenter could care less he's hurting your mom's relationships.  \n\nYou don't mention whether or not your mom has come up for air long enough to realize your absence. If she has, my guess is instead of being honest that you don't want any kind of relationship with him you're saying how busy you are. \n\nWife needs to close her mouth regarding your Mom. The future is unknown and there's no reason to poison your son's thoughts.\n\nEdited to say since your SF clearly loathes you and your wife it's unhealthy to spend ANY time in his proximity.  SF hates being sucked up to but he went to your wedding. Tells you he has a sixth sense about golddiggers and your obsessed with your mom's money? He's toxic AF. If Mom is insistent on him being present any time you see her she's drank the Kool aid. If she'll come to your house without him then you two might be able to have more frequent visitation. Your stance of \"I'm glad Mom is happy\" is mature and isolates the both of you. Your approach would be healthier had she chosen someone that isn't toxic. Mom blaming you for sucking up too much is her deflecting that she chose a man over her established family.  No, I don't respect that. I have no problem saying I don't respect it as I have made the same error and then corrected it.",
      "id": 48,
      "comments": [
        {
          "score": 35,
          "content": "Correct answer",
          "id": 49,
          "comments": [
            {
              "score": 92,
              "content": "Had to edit it after he gave more information. The toxicity of the SF is spreading.",
              "id": 50,
              "comments": [
                {
                  "score": 40,
                  "content": "There are many layers to the OPs post. I’ve seen something like this play out in real life. Minus the evil Stepfather.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 72,
                      "content": "I married an evil SF. I blame myself for not walking away when red flags appeared. Terminated the marriage when my daughter told me he was trying to persuade my 20 year old daughter that she should take my 12 year old son because son \" misses her and he'd be so happy to be closer to her\" behind my back. Adios MF.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "This is a very good answer. ESH, except your kid, and that includes your mom and SF.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 511,
      "content": "ESH\nsort yourselves out and have your petty ass arguments away from your child.\n\nThese feelings about your mother are something you both should have discussed long before the child raised the question\nThis was an entirely predicable and avoidable scenario and it should have been allowed to happen.",
      "id": 54,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 221,
      "content": "This is hard to judge… your wife should have NEVER said your mom was a bad mom to the child. She just dragged adult problems in front of a child who would interpret this as grandma is a bad person, untrustworthy, and not someone safe to be around. \n\nIt made sense that you jumped in to defend your mom, but you escalated it in front of the kid. \n\nSo I am going to have to go with ESH. You and your wife need to privately discuss how you are going talk about your mom in your home.",
      "id": 55,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 169,
      "content": "[deleted]",
      "id": 56,
      "comments": [
        {
          "score": 38,
          "content": "I see some of her faults. I just don't think this is a fault and I am so grateful that she put herself first and didn't throw away her future happiness for her adult son who isn't going to prioritize her and her grandchild. I left the nest and built a new family, and feel strongly that she deserved a new family of her own, and not a lonely life waiting to visit me, just because this dude wasn't nice to me",
          "id": 57,
          "comments": [
            {
              "score": 86,
              "content": "But you still think your wife should have a good relationship with your mother? You are saying that you're okay with your mother choosing her sex life over you, but why are you saying your wife also has to be okay with that?",
              "id": 58,
              "comments": [
                {
                  "score": 30,
                  "content": "No, I've never expected them to have a good relationship, cordial if they are around each other, but if my wife chose not to be around each other that is her choice. I mean I can't take this seriously if you think a marriage is about nothing more than sex, so whatever",
                  "id": 59,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Did Brandon at least start treating you better after he married your mother or did he continue to be an a-hole to his(now), stepson?",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "Wow, you just shit on anyone that doesn't suck off Mommy Dearest. No wonder you take so much shit from Brandon, the one person that can stand the nightmare besides you. Have fun with that, but keep your kid out of it.",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I don’t think she needs to have a good relationship with his mother in general, but I do think it’s wrong of her to not be okay with this in particular. She isn’t sympathizing with his pain and standing up for someone who can’t/won’t stand up for themselves, she’s saying he’s wrong for feeling the way he does. That’s not loving or kind or even neutral, it’s pity and a sense of superiority, and it’s gross.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "ESH both of you should have never fought like that in front of your kid but I will say that the whole dynamic between you and your mom (and then her getting married to your boss) sounds toxic. \n\nThe whole situation feels like there’s more that you haven’t shared but it doesn’t really matter to me. I did notice that you staunchly defended your mom but were very quick to raise your voice and throw your wife under the bus and undermine HER in front of her own son too. \n\nI think you and your wife need to work on your communication skills and marriage because it doesn’t sound like you respect your wife as much as your mother.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "...A new family with someone who was bullying you.\nI have a feeling that you're a pushover when it comes to your mother, and this was the last straw for your wife. Go and move back to mommy if you miss her so much.",
              "id": 64,
              "comments": [
                {
                  "score": 8,
                  "content": "It’s like you don’t get the issue. I don’t want to move back I just don’t think the rest of her life needs to be ruined because she had a kid. No one deserves to be alone like that",
                  "id": 65,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Seems like you feel guilty for \"ruining her life\" and because of that you will forgive anything she does. Maybe you feel like you deserve her getting married to a guy that bullyied you and still mistreats you and your wife.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "You and your wife are both AHs for putting your kid in the middle of an argument to be petty with each other. ESH",
      "id": 67,
      "comments": [
        {
          "score": -2,
          "content": "[deleted]",
          "id": 68,
          "comments": [
            {
              "score": 5,
              "content": "He decided to fight using his kid when he could have left the kid out of it. They both suck.",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 91,
      "content": "NTA \n\nShe started a petty fight for no reason. She didn't have to shit on your mom/your son's grandma and bring him into \"family drama.\"",
      "id": 70,
      "comments": [
        {
          "score": 83,
          "content": "The people saying everyone are wrong, he didn't start it and letting it go to argue later would have left the thought with the kid that what mom said was true, he absolutely had to correct it IN THE MOMENT, otherwise it would linger. I will day maybe he could have done it a bit more tactfully but letting it go to argue later wasn't the move.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "THIS!  SO MUCH!  NTA, OP.  Absolutely, NTA.  \nYour wife does not get to unilaterally decide to poison your kids towards your Mom.  Those claiming the situation is such that you are in denial and she is standing up for you have an opinion.  This is not a cut-and-dry case of \"your Mom is evil\" and, as such, your wife needs to respect you enough to discuss with you before bringing it up to your kids.  And then, on top of that, she has the gall to call you out for undermining her.  Absolutely not!  \nI fully agree you should not argue in front of your children, so don't start sh\\*t in front of your children, OP's wife.  She's TA and this fully falls on her.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You need to read OP's responses about his mom and Brandon.\n\nTheir child needs to be left out of these arguments, but wow, there is some real crazy bullsh*t going on. OP left out some important details in his post 😳",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 84,
      "content": "NTA I think your wife is the AH here, but I also think she’s offended on your behalf which is a nice thing. \n\nI don’t think you and your wife should have argued about this in front of your child, but the way you have presented things it seems that you were reasonable - actually my mom works more, etc., and your wife should have stopped there. I don’t think you were undermining her and I also think it’s inappropriate for her to tell your child his grandparent was a bad parent, since you all have a relationship so it creates unhealthy resentment with your son and his grandmother. I also think you’re right that your mother has the right to live her own life, although I can’t imagine marrying someone who actively dislikes my son, even if he were an adult, and I can see your wife’s point on that. \n\nHowever, I think you’re a little bit AH for saying that it’s unhealthy how much time you spend with your MIL. There is no such thing - some families and in some cultures grandparents even live with their children and grandchildren. It’s all about what works with your family. If you think your family is genuinely negatively affected by how much time you spend with your MIL then have that conversation, either way bringing it up in an argument is only going to upset your wife and make her feel like you’re attacking her relationship with her mother and, as you’ve just experienced, it makes you unhappy and prolongs arguments and hurt feelings.",
      "id": 74,
      "comments": [
        {
          "score": 59,
          "content": "This is a decent response. If OP's mom married someone whom she knew didn't like him , especially after being fully aware before the relationship,  it makes it pretty clear what she cares about. Op's wife could of handled better for sure, but, lashing out at her family doesn't fix the the dynamic. Truth isn't always pretty and sometimes doesn't need to be said at all. Wife made an asshole move, everyone WTA from there.",
          "id": 75,
          "comments": [
            {
              "score": 24,
              "content": "I can’t even judge the wife for being upset at OP’s blindness. \n\nNot marrying your child’s tormentor, especially one who had a position of power over him, seems like a relatively low bar for “good person”?",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -10,
              "content": "God forbid an adult woman with a grown ass and married child not spend the rest of her life making every decision with “how will this affect my grown ass, married child who no longer lives with me”. The wold would completely end.",
              "id": 77,
              "comments": [
                {
                  "score": 25,
                  "content": "As a parent and now grandparent, no way do I invite someone into my life that doesn't like my kids or grandkids. Having personal experience with that, it doesn't make for happy Christmas's. Who the hell goes willingly into a situation where neither party like each other, worse yet, who forces their kids into that situation? \n\nNahhhh, it's hard to hear words when actions are screaming so loud. It's all in what you care about. You want be alone? That's a good starter for the recipe and signal that there's trouble in paradise.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Yup, yup, yup. OP needs a little better perspective on his mom. There is no way I would even go out on a date w/ anyone who treated someone I loved that way. How is that not a complete turn off?\n\nWife is definately the AH for dragging the kid into it, but I get her frustration.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Is it a nice thing to be offended on someone’s behalf? Or is it condescending? I’ve heard it described both ways, and I can see some truth in both.",
          "id": 80,
          "comments": [
            {
              "score": 11,
              "content": "Really good question! Maybe it’s because I am a woman with a lot of close female relationships, I’m used to getting offended on other’s behalf and vice versa, I don’t find it condescending at all, although I can find the way people behave when they’re offended on someone’s behalf can be condescending. Like - ‘I’m angry for and with you’ is different to ‘I’m getting angry on your behalf because I think you’re too pathetic to deal with it yourself.’",
              "id": 81,
              "comments": [
                {
                  "score": 2,
                  "content": "I must be in the opposite boat. I’ve had people jump to my defense at times when I wasn’t even bothered by other people’s actions. Even when I had slurs thrown at me, which weren’t a huge deal to me, my friends didn’t even let me have a chance to deal with it on my own terms or on my own behalf. The distinction you made is spot on, I think. “Angry with” vs “angry for”.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I don’t think it’s just on OP’s behalf- in comments OP has said that this Brandon guy has also folded the wife into his insults. I think the wife has just clocked the guy as an ass and is upset the MIL seems to be fine with the way he treats her family.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 67,
      "content": "I can't get past wondering why the fuck your boss, who you didn't like and who didn't like you, was at your wedding? You really did try way too hard. Yta.",
      "id": 84,
      "comments": [
        {
          "score": -21,
          "content": "because that was part of the industry.",
          "id": 85,
          "comments": [
            {
              "score": 56,
              "content": "Your wedding was not part of any industry unless you chose to make it so.",
              "id": 86,
              "comments": [
                {
                  "score": -24,
                  "content": "Ok and your point is? This is the career I chose, we knew the lifestyle we were getting into, and we made a choice. You dont have to like it, but it is the norm in that industry",
                  "id": 87,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Its not the norm in weddings is my point. But if you saw your wedding as an opportunity to further your career rather than a celebration of your marriage with the people you love, that's your call. Didn't work too well though did it?",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 39,
                      "content": "In what industry is it the norm to invite your boss to your wedding? Especially a boss that clearly doesn't like you and bullies you?",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}