{
  "post content": "brand new account and throwaway for you guys. \n\nSo Tuesday of last week I made my now ex-boyfriend dinner. He's a paleo junkie and I really wanted to impress him so I skipped class to slice fennel with a razor blade in order to garnish the strip steak I made for him. Yeah I really, really (really) loved him. I decided it would be easier to cook the steak in his kitchen so I went over to his place early (I have a code and open invite). I walked in to find half eaten Dominoes pizza on the counter (remember I sliced fennel with a razor blade because he's so \"dedicated\" to paleo) and noises coming from the bedroom. \n\nI walked in and he was absolutely plowing a good looking girl with a spectacular body. Fuck me for not eating pizza to impress him. I stood there in shock. She saw me over his shoulder first and started tapping furiously for him to get off. He turned around and hit me with the oh so classic \"this isn't what it looks like!\" \n\nI was speechless and had no idea what to do but I saw her clothes hanging over his desk chair. Because apparently I'm a petty b!tch, the only thing I could think was I wanted her to have leave his apartment without pants. I don't know, it made sense at the time. \n\nHe came after me begging me not to overreact, I didn't say a word and took off to my car. In the days since he's gone from begging me to \"be reasonable,\" to begging me not to break up with him and promising he'll never do it again.\n\nThe thing is, I love these jeans. Yes as a trophy of me being petty and at least ruining something of hers like she had he tag teamed to ruin my heart and self esteem. But they are also a super expensive brand, they look really good on me and I like wearing them. \n\nSo EX has gone from begging me to get back together with him to saying that me keeping the jeans is causing him \"real problems.\" I don't give a slight shit about his problems but I sort of feel bad about keeping this girl's clothes. \n\nSo I'm asking...I know I'm petty...but am I an asshole?\n\nEdit: the plot thickens, I just woke up to following text:\n\n\"hi, Alyssa. This is the weirdest text I've ever written. I'm Madison and I was the girl in Aiden's room last week. I'm so, so, so sorry, I don't know how to say it other than that. The look on your face will haunt me for the rest of my life. Please believe me when I say I didn't know he had a girlfriend. I would have never been there had I known. You have every reason not to care, but this last year has been so hard for me, my dad died of pancreatic cancer in December and I'm struggling so hard and find myself making bad choice after bad choice which I how came to be in Aiden's room. The pants you have are the ones I bought the day before my dad died, he gave me \"permission\" to go treat myself and it's the last time I ever heard him call me by his pet name as in \"pumpkin, please don't be afraid to get you want, buy your jeans.\" It would mean the world to me if you returned them to me. I know you've been hurt and I feel for you and I think Aiden is pure scum, all I want from him is getting my pants back. Please find it in your heart to return them to him or contact me directly. Thank you so much, Madison.\"\n\nSo I guess I have to give them back...I'm in tears here.\n\nEdit 2: just woke Aiden up at 5:45 (on Org Chem test day too...fuck him) with \"what's Madison's last name?\" He tried to give me the \"who's Madison?\" at first but then told him she texted me. He tried to talk me out of it but then relented so he could go back to sleep. So I looked her up on Facebook and it's pretty bare but she does have a \"instamodel\" sister who has all sorts of sad posts with like her holding her dads hand while has IV and then a somewhat touching insta memorial to her dad...so I'm thinking the text is not a lie.\n\nEdit3: I just texted back and forth with her, we’re meeting at Starbucks at 9.\n\n\nEdit4: (Wednesday evening—had tried to do a new post but mods suggested I just edit the op...so this is a cut and paste. Hope it makes sense I’m just starting on my second bottle of skinny girl so hope this makes sense) So wow, that first post got a ton of heat and I'm so thankful, really for the chance to get some input but also because a lot of you are very, very funny and I appreciated the laughs. I don't know what the overall verdict was but I'm ok to think I was being an asshole in keeping the jeans.\n\nSo like many of you saw, the girl (Madison) texted me overnight telling me about why the jeans were important to her and asking if I would give them back. We texted back and forth a few times this morning and agreed we'd meet at the Starbucks by campus so I could return them. I got there and instantly recognized her and she got up and gave me a hug which I thought was very sweet (I'm a hugger too) and she had bought me like three different varieties of venti drinks to make sure she got one I liked (or as she admitted later, she was so nervous she didn't know what to do) which I also thought was very cool. I wasn't sure whether or not I even really wanted to talk with her but the coffee was enough entre to get me to sit down. I handed her the jeans and she was very thankful and again explained the story about her dad and teared up. Lots of people told me not to believe her but if she's lying, she's a sociopath because I could tell she was really upset by it. I did my best to comfort her which I hope was well received.\n\nSo as we got past that the only things I wanted to know were: how long had she known Aiden, did she know about me being his girlfriend and was she hoping to continue seeing him. She said they met when he and some friends went to her restaurant maybe a month ago and had been texting back and forth ever since, she said last Tuesday was the first time they'd met in person and she said she swore to god she didn't know he had a girlfriend. She said after I showed up Tuesday she was so disgusted she got dressed in her spare clothes (fat lot of good it did me to steal her jeans if my plan was to embarrass her) and left and didn't even process that her special jeans were gone until about a day later when she stared bugging him to get them back but she had no interest in seeing him. She said she was so frustrated with him stonewalling her had stopped by to get my number directly but he wouldn't even do that so she got it from his neighbor who happened to hear them arguing...she'd had my number since Sunday but was too nervous to text until yesterday.\n\nLots more happened and I can expand more in the comments but I think i'm running out of room...anyways so our plan is she is not going to tell him that I gave her the jeans back and start to demand he pay for them or buy her a new pair. When he does, she'll just give me the money or the jeans and then we'll give him the old...\"thanks for the jeans but us adults already worked it out...toodles.\" Yes we are deceiving him but we both agree he deserves it.\nLike I said lots more details but running into the 3000 character limit so I can say more if anyone is interested. Thank you for being so invested in my life. I've felt pretty rejected since this all went down and will have a hole in my heart for a long time...the kindness of internet strangers really, really helped for a few hours",
  "id": 1,
  "comments": [
    {
      "score": 7308,
      "content": "I wanna say NTA cause fuck him honestly and his problems. I guess I'll play devil's advocate, did the girl know about you? Maybe he was playing you both.",
      "id": 2,
      "comments": [
        {
          "score": 4502,
          "content": "Yup. Maybe this poor girl got played and had no idea that this dude had a girlfriend already. In that situation she got screwed over by the guy, had the embarrassment of being walked in on during sex, and maybe the icing on the cake is that she lost her favorite pair of jeans now too. \n\nThe other chick isn't the bad guy here, the boyfriend is.",
          "id": 3,
          "comments": [
            {
              "score": 1205,
              "content": "Keep in mind she could just be a homewrecker though, we don’t know",
              "id": 4,
              "comments": [
                {
                  "score": 688,
                  "content": "She could be, but even if she is does that make it right to steal from her? Nobody is going to gain anything from this kind of petty revenge. Better to take the high road.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1066,
                      "content": "Um she gained an amazing pair of jeans. Hopefully she also aet his steak and knocked they pizza over on the way out.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 145,
                      "content": "This is kind of the problem with this sub. Most of the people here are firm \"eye for an eye\" types. As soon as you are wronged, your response is suddenly no longer your responsibility, and you're perfectly entitled to \"punish\" other people for their trangressions against you with something as bad or worse, apparently.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "This should be the top post.  Your boyfriend sleeping around on you doesn't give you a right to steal from others.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 113,
                  "content": "I can't stand the idea that \"homewrecker\" is an acceptable thing to claim exist in our society. Even if there are people who *enjoy* breaking up couples by sleeping with their partners, it still takes two to tango.\n\n  \nTo me this is the equivalent of saying a woman is responsible for being raped due to her wearing skimpy clothes at a party. \n\n&#x200B;\n\nThe only person who should always be at fault assuming consensual sex, is the one who is cheating on their partner.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 223,
                      "content": "It is absurd to compare someone who knowingly sleeps with taken men/women to someone who has been raped.  \n\nJust take a step back from that.\n\nI agree the person who is cheating is the most responsible, but being ok with being the other person is also morally wrong.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 138,
                      "content": "I have to disagree, in your comparison the woman is non consenting and a victim. If you knowingly sleep with someone in a relationship, you may not be as scummy, but you’re definitely scummy",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 40,
                      "content": "> To me this is the equivalent of saying a woman is responsible for being raped due to her wearing skimpy clothes at a party.\n> \n> \n\nHow the fuck is that even *close* to being related?",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "That's absurd. Of course the cheater is the one mostly to blame but that doesn't mean that someone, who sleeps with a person they know is taken is not an asshole. They know that they are causing pain to someone else when there a plenty of fish in the sea.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Still the main issue is the ex. He's the one who made and broke a commitment to OP. Maybe he said it was an open relationship - who knows.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I don’t think there’s such a thing as a home wrecker... the person who cheats is the one who cheated.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 3,
                      "content": "The cheater is the home wrecker.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Home wreckers have no power unless someone in the relationship isn’t loyal.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "No such thing. Your home can't be wrecked if you don't let it be. Wouldn't matter who she was if he was committed",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "The homewrecker would still be the boyfriend. HE is the one who cheated.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Even if she knew he had a boyfriend, if she didn't know the girl, she isn't the one cheating.  She isn't the bad guy here, he is.  Stealing her shit changes nothing",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Even if she knew, she's not the homewrecker. He is.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "She didn't wreck anything. He did.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 131,
              "content": "Then he can replace the pants as an A-hole tax.",
              "id": 23,
              "comments": [
                {
                  "score": 51,
                  "content": "Paleo diets are expensive. You think he’s got that kinda dough just laying around, half eaten?",
                  "id": 24,
                  "comments": [
                    {
                      "score": 2,
                      "content": "XD Take my upvote.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "And if he doesn't? The girl is still the party losing out here.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "If she didn't know about OP then the ex needs to replace her pants. Make the ex pay somehow",
              "id": 27,
              "comments": [
                {
                  "score": 19,
                  "content": "and you think this scummy ex would do that? The girl who maybe completly innocent and is at leat not at fault for the destroyed relationship got punished and thats ok??? 50 to 100 bucks can be quite a lot to some people",
                  "id": 28,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Expensive brand...these are probably $200+.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "How is that going to work? Make the ex pay when she isn't with him anymore? She couldn't even *make* him not sleep with another girl while they were together so good luck with that. \n\n\nShe should just return the poor girls jeans and take something from her ex if she is still looking for petty revenge.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "The ex should buy the pants for OP honestly. The other woman gets her pants back, OP gets a new pair of pants that she loves, and the ex pays for his wrongdoings. I'm mostly joking here but like... In a perfect world?\n\nOr maybe OP and the other woman should play Sisterhood of the traveling pants. Split custody!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Hey the now-ex-boyfriend can replace her Jean's. The fucking douche bag.",
              "id": 32,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah he is such a nice guy he surely will replace the jeans \\^\\^",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The guy saying he's having \"real problems\" as a result of her keeping the jeans tells me she's still involved with him. Sounds like she knew exactly what she signed up for.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Not the way I saw that, the fact that when she saw her she was tapping him on the shoulder instead of saying ‘who the fuck are you and why are you in his house’ says to me she knew full well",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "boyfriend should replace the jeans. case closed",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "This is a good point.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "So what if she knew the girl? It's just wrong to steal shit from other people. I don't know how much jeans cost in the USA but I looked at Levi's jeans price in the USA and they go up to 150USD. That's a lot! \n\nLet's say you walked in on them, got pissed and wanted the girl to have to walk home and thus took all the money from her wallet. That would be fucking wrong, this is wrong. \n\nPlus OP is clearly keeping them because they are a nice \"super expensive pair\", that's straight up theft. \n\nGetting revenge by stealing stuff is wrong.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Pfffff make him but another pair",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Agreed! I'm also afraid that the wrong person might be punished here. So I'd say ESH?",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "If she was blindsided I wanna know where her “who the hell is that bitch?”  response went.  Tapping him on the shoulder sounds more like “oh shit we are caught” to me.",
          "id": 41,
          "comments": [
            {
              "score": 4,
              "content": "> Tapping him on the shoulder sounds more like “oh shit we are caught” to me.\n\nOr... \"Oh my god, Aiden, there's a girl in the doorway and she looks pissed, I think you'd better stop\"",
              "id": 42,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'd say she's TA even if the other girl knew about her. What happened to her was horrible but that doesn't make her above the law. Theft is theft no matter the circumstances",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Why would it matter if the other woman knew about him cheating? It still wouldn’t justify OP stealing her property.",
          "id": 44,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "So are you saying NTA, or playing devils advocate?",
          "id": 45,
          "comments": [
            {
              "score": 2,
              "content": "Yes.\n\n(Kidding kidding) I wanted to hear some other opinions first, and after seeing them I've switched to ESH (if she doesn't returns the item). The boyfriend is an asshole no doubt. OP's edit says the girl didnt know about OP, so I think she should give the jeans back, but I dont blame her for initially taking them.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6995,
      "content": "ESH. She wasn’t the person that was supposed to be loyal.  She might not even know about you. \n\nJust because your bf got in her pants doesn’t mean you should try as well.",
      "id": 47,
      "comments": [
        {
          "score": 706,
          "content": "Haha😄",
          "id": 48,
          "comments": [
            {
              "score": 7,
              "content": "Your username is what I want to say. (The first part at least.)",
              "id": 49,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 452,
          "content": "ESH seconded - no way of knowing what the other girl knew, the boyfriend is TA here, and I really don't see how stealing belongings from someone evens the score in this situation? It sounds like you'd be happy with any excuse to justify the theft, which isn't cool. Give the jeans back!\n\n\\*edited for spelling.",
          "id": 50,
          "comments": [
            {
              "score": 61,
              "content": "Seconded, and \"evening the score\" is not really the goal here, is it? \"Evening the score\" is being TA in most situations, I'd guess. (Except sports.)",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 233,
          "content": "Ahaaaaa okay that was witty.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "Agreed. I’m not a fan of saying everyone saying NTA because frankly stealing a really expensive pair of jeans is a dick move no matter who they belonged to. So my vote is ESH.\n\nAlso I don’t blame her for making that choice. But it’s still assholey.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": ">Just because your bf got in her pants doesn’t mean you should try as well.\n\nThough to be fair, OP clearly thinks this girl is pretty hot and has good taste in jeans.  I don't think we should ban OP if that is the way she wants to go.\n\nFor the record, have to go with the ESH crowd.  Obviously some suck more than others but it is the classic two (Or 3) wrongs don't make a right situation.  But just to be clear, that rating is for keeping them.  Storming out with them in an emotional state is probably forgivable",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "It was apparently easy for both to achieve.",
          "id": 55,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Yes. I am so over the jilted man or woman taking it out on the other person,  when they should be taking it out on the cheater.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "ESH, but her ex boyfriend is 98% of the suck, and op is 2%.",
          "id": 57,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3107,
      "content": "YTA. Punish your ex boyfriend for cheating, not the girl who likely had no idea about you.",
      "id": 58,
      "comments": [
        {
          "score": 963,
          "content": "This 👆 I don’t understand why people think stealing from someone you don’t know is ok. Just because he cheated on you means that the girl who probably didn’t even know you existed deserves punishment?\nIt honestly baffles me seeing people approve this type of thing.",
          "id": 59,
          "comments": [
            {
              "score": 203,
              "content": "Because some things in life are just funny and we can’t be so serious about them.",
              "id": 60,
              "comments": [
                {
                  "score": 79,
                  "content": "Still theft, still illegal and, in case it goes that far, totally deserving of a theft investigation by the police",
                  "id": 61,
                  "comments": [
                    {
                      "score": 94,
                      "content": "Over a pair of jeans? Naw. If cops do come to OPs house she just says  “I don’t have the jeans and no you can’t come in without a warrant officer.” And no judge is gonna sign a warrant over a he said she said theft of a pair of pants. If that was the case anyone could come to the police station and say this person stole xyz from me and the police would go to their house and just take it without any evidence proving that it even belonged to the person reporting the theft. OP is not at risk of anything and fuck that girl and fuck that dude. Life is too short to not indulge occasionally in a little well deserved revenge.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Yea, but theft isn’t one of those things.",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 49,
              "content": "Although I dont think she should steal the pants either, I think the girl likely knew about her based on her reaction to seeing her.",
              "id": 64,
              "comments": [
                {
                  "score": 10,
                  "content": "Her reaction sounds pretty calm. If anything it makes it more likely that she didn't know. If you are over at someone's place and a third person walks in on you, then you are probably going to assume it's a flatmate or family member or whatever. If you knew it was that person's so you'd freak out a lot more.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It wouldn’t matter if the other woman knew about him cheating, because it still wouldn’t justify OP stealing her property.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It’s a very weird mentality.\n\n“I’m a victim, and I can’t cope with it, so I must go and victimize someone else because I’m entitled to because I’m a victim.”",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "Accomplish both goals by making grade A ass pay for the damn things",
          "id": 68,
          "comments": [
            {
              "score": 38,
              "content": "That’s what I’m saying! Like, it’s “making his life hard”? Good! I hope your life gets harder dumbass! Pay for the jeans!",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "I agree. It infuriates me that others on this thread are applauding this thievery.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Exactly. Op wants to make this other woman leave the guys place with no pants but she could have been just as played.",
          "id": 71,
          "comments": [
            {
              "score": 111,
              "content": "I think that if she didn't know about her, her reaction should have been more of a \"Who the hell is that???\"\n\nNot a: Tap tap tap \"Oh shit, look...\" kind of thing.\n\n&#x200B;\n\nEdit: For fuck sake people, it's just an opinion of a possible thought process. It's not like I'm up on a courtroom stand passing judgment. Sheesh.",
              "id": 72,
              "comments": [
                {
                  "score": 72,
                  "content": "Eh, that’s possible but there’s no reason to assume so. \nEither way, stealing her pants to punish her and not the guy who’s actually cheated is really petty and unfair. \n\nWhat’s ops goal? Hopefully this girl will have to walk home pantsless?",
                  "id": 73,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I feel the same way why was the girl the one to get the back hand of this. It should’ve been the guy who cheated on here not girl who up to this point OP has never met.It does baffle me how people are supporting this type of thing.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 35,
                  "content": "I mainly thought of it like her realizing  like “uh oh I really don’t hope this is what it looks like it is” type of moment then “uh oh we got caught cheating” sort of thing. It really is up to interpretation or not and I’m just being stupid both a very possible knowing me.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 49,
                      "content": "I honestly don't know WHAT my reaction in that situation would be. I don't think we should judge a shocked reaction as people don't behave like we think they will in weird circumstances.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Mine wouldn’t have been - I’m a freezer and know it for sure because I have had a stranger walk in the house and it’s exactly what I did. Just freeze and evaluate.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Or the girl wasn't stupid and could pick up on simple context clues?",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Maybe she was tapping him to say someone has walked into the room since they were in a compromised position. A tap isn’t necessarily guilty. \n\nI am very confused why OP ever tried the jeans. Sure in her impulse she took them for whatever reason. But who goes home and thinks of let’s try on this unwashed pair of jeans last worn by a stranger who my boyfriend is fucking?",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I agree. \n\nI also never understand it when two people get into a fight over the person that one (or even both) are in a relationship with. It's that third persons responsibility to be faithful, if that is an expected part of the relationship.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I. e. Two wrongs dont make a right. \n\nMost people would feel justified but be better and don't be an asshole because someone else did and you feel you deserve \"your chance\". That's a shitty attitude to carry through life.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Don’t punish anybody. Leave him and move on.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Tbf, does anyone even know how to process their feelings especially seeing an affair right in front of them. Idk about everyone else but I don't think I can contain how I would feel if that happens to me. I'd probably be so enraged that I wanna kill them both , not that I would but it's that kind of feeling of being hurt by an affair. At that moment I probably can't process if that person knows that I am her boyfriend, all I know is I hate them both at that moment. Hell, even if he know that I am her bf, I would probably hate him still. Being cheated on fucking sucks and it's one of the worst feeling. \n\n\nStealing a pants is such minor action especially with the scope of things. It's hard for me to say she's the asshole coz I think for her not wanting to murder the girl after seeing that, is already considered not an asshole. She fucking walked in to a sight of them mid sex, I can't even begin to imagine how that feels. Good thing she's a good gal and returned the pants",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It’s more of an ESH, the bf was definitely an AHole because he cheated on his partner, but OP was also an AHole for taking the pants of somebody else. She may or may not have known OP even existed",
          "id": 84,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2011,
      "content": "NTA. Girl, KEEP THOSE PANTS. Let them cause that A real problems. \n\nINFO: Do you know if she knew about you?\n\nIf yes, you should have stole her shoes, too.\n\nEDIT: just so it’s clear, I asked if she knew because if the other girl was unaware of OP because if that was the case I also think she should give the pants back.",
      "id": 85,
      "comments": [
        {
          "score": 2064,
          "content": "I honestly can't say because I didn't recognize her, but we've been together almost 2 years. My picture was his lock screen on his phone, I basically lived in his apartment half the time and had stuff everywhere. \n\nit's possible she didn't know but for that to be the case he was really good at erasing all evidence of me.",
          "id": 86,
          "comments": [
            {
              "score": 1335,
              "content": "I think she would have reacted differently if she hadn't known there was some risk of you coming in. Tapping him to get his attention? I think she knew about you.",
              "id": 87,
              "comments": [
                {
                  "score": 524,
                  "content": "I don’t think so. She could’ve thought that someone had just walked in on the two of them. No one’s ever walked in on me sleeping with anyone, but that would probably be my reaction to it.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 338,
                      "content": "I mean I would be like WHAT THE FUCK!?!?",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "Exactly. Honesty I don’t know what my boyfriends lock screen is so it’s entirely possible he was hiding it. I have no idea what I would do if some stranger was standing in his doorway watching us bone",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "I mean - I have almost been walked in on (we had locked the door but in the moment I forgot we had locked the door) and tapping my bf to stop was NOT my reaction. I practically threw him off and scrambled to get some clothes, but each to their own I guess?",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I'm sure OP had a look of \"What the holy fuck are you doing banging another girl?\" and not a look of \"Hey man, there's extra fries in the kitchen!\" so that would have likely given away that it's not just some roommate walking in on them.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 137,
                  "content": "That's a big assumption you have there. Everyone reacts differently to situations. IMO, OP stole something that doesn't belong to her out of spite and is therefore, TA. Punish the guy, fine, but to my eyes, the other girl is an innocent party here until we hear otherwise.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yep from the other girls perspective maybe she's just having a bad day and hooked up with an average guy because  he treated her to dominos only to have her favorite expensive jeans stolen by a random girl who walked in on her fucking.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Not sure actually. If she knew the guy had a girlfriend she probably would have reacted much more dramatically to a girl walking in. Tapping someone on the shoulder is what you do when you want to get someones attention, not when you want them to stop. She could have thought it was a roomate or friend",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "This ^ that's what I was thinking too.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "On the contrary I think that the fact that she didn't freak out shows that she probably did not know. Because if you don't know who the person is you are probably going to think it's a flat mate or a sister or something, and while embarrassing that's not something to freak out over.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 277,
              "content": "NTA. Considering her reaction was tapping him instead of a resounding \"Who the fuck is that?\" means she probably knew about you",
              "id": 98,
              "comments": [
                {
                  "score": 156,
                  "content": "If I was at my house and someone I didn’t recognize walked in I’d def be like “who the fuck are you?” But I think if you’re at someone else’s house and someone walks in the immediate reaction would be to assume it’s someone else who lives there that you don’t know, hence tapping on back not screaming",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "maybe she thought it could be a roomate, friend, family member and then it would be a serious matter since they walked in on then having sex, hence the tap to get the attention. Have in mind for all we know it could have been a one night stand or the first time she was at his house.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 188,
              "content": "She knew. She tapped him to get off, she didn’t scream “who is this strange woman in your house?”. Keep the jeans, fuck his problem. My guess is he is still seeing her or trying hard to, and needs those jeans back.",
              "id": 101,
              "comments": [
                {
                  "score": 109,
                  "content": "That is not evidence at all.",
                  "id": 102,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Pretty big assumption, for all we know its her first time in his house and thought OP could be a roomate or something",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "That makes no sense. She would have no idea if it was a \"strange woman\" in *someone else's* house. For all she knew (at first glance), it was his friend or sister or something. If you were at someone's house and another person walked in, would you turn to your host and say \"who the fuck is that??\" Obviously not.",
                  "id": 104,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Give back the pants. Stealing isn't cool, and for all you know she didn't know about him having a girlfriend, making her a 'victim' as well\n\nOn top of that, the girl could go to the police for theft. I've had legal problems because of doing petty shit like this in a more immature period in my life, and believe me: **the legal trouble is not worth it**. It may seem to you like \" it's just a pair of jeans\", but the police will take it seriously once a complaint is filed (to clarify: I've been taken to court over an angry *mail* I sent). I take it from you story you're still in college. Keep in mind that you will have a hard time finding a job with zero work experience, and theft on your criminal record",
              "id": 105,
              "comments": [
                {
                  "score": 23,
                  "content": "This is a good point for the OP. I’m surprised myself by your story.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": ">(to clarify: I've been taken to court over an angry mail I sent)\n\nYup. The US Postal Service is not to be trifled with. But yeah, too many people think that theft (or any petty crime) is perfectly justified because their partner cheated.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "YTA YTA YTA! The question you have asked us is are you the asshole for keeping this girls jeans because you want them. We can all understand acting out of sorts and doing weird shit when you are in shock so OK we can give you taking the jeans in the heat of the moment BUT!!! You are now willingly stealing something that belongs to someone else simply because you want this name brand item and they look good on you.. no! You are not automatically owed anything because your partner cheated other than his apologies. This is not you being petty - this is you saying \"I'm keeping your property because it's expensive and it looks good on me! Plus you did a bad thing so you dont deserve it - I've been good so they are mine now!\" - That is insanely spoiled & entitled and leads me to believe you wanted validation and to receive lots of pats on the back for your revenge.\n\nGive them back and have it out with your ex or admit that you are an entitled asshole.",
              "id": 108,
              "comments": [
                {
                  "score": 21,
                  "content": "Seconded YTA, so not cool to steal that girls pants, I’ve been cheated on in the past but I never ducking stole anything just out of anger and pettiness and the fact that those jeans look good on you shouldn’t make a difference. THEY’RE NOT YOURS, GIVE THEM BACK ! \nAlso it’s like you blame that girl instead of blaming the guy. That girl doesn’t know you, she wasn’t in a relationship with you yet you’re punishing her. Your EX was the one who was meant to love you and care for you not her. It’s twisted to want to punish her when he’s the one who fucked up !",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "Could be wrong but only looks like you respond to a rare person who agrees with you if that’s not a sign of YTA idk what is",
              "id": 110,
              "comments": [
                {
                  "score": 35,
                  "content": "I noticed that. Seems like OP is here for validation not judgement.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 21,
                      "content": "It was pretty clear from her post that that’a what she was interested in, even juxtaposing that the other woman (who might be ignorant) has a hit body with OP having given up pizza for the ex demonstrates an attempt to gain sympathy (which is unnecessary given that she walked in on her bf fucking someone, that’ll already be freely given).",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Give the girls her pants back and buy yourself the same",
              "id": 113,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Either way, it's his fault, not hers. She owed you nothing, and now you're a thief. Return the girl's pants.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "That's not for you to think about, nor is it for the other girl. Your ex knew full well what was going on and he acted with full knowledge, and he hurt you. I don't care much about the pants, I'm sure it's honestly no big deal, but if you just want to vent to someone you can pm. I don't have much relationship advice, but I like to think I'm a good listener.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Well, you’ve been with him almost two years and live with him half the time and you still didn’t know he was getting some on the side. \n\nDo the right thing and return the pants.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 82,
          "content": "lol, just let him know if he wants the pants back he’s gotta buy you a pair exactly the same. He cheated on you and the least he could do is get you a pair of expensive jeans.",
          "id": 117,
          "comments": [
            {
              "score": 8,
              "content": "“if he wants the pants back”?  wtf?  those aren’t his pants, using the other girl’s who might have been ignorant of OP and COMPLETELY INNOCENT is so shitty, not to mention what she’s already been through.  i can’t believe the advice people here are giving.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "How is this upvoted so high? I get revenge is sweet and all, but it's still an asshole move to steal the girls pants, whether she was aware of the OP or not.",
          "id": 119,
          "comments": [
            {
              "score": 3,
              "content": "Because a lot of people on this sub are assholes...",
              "id": 120,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "It's still theft. And it's not the girl's fault.",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "The innocent girl lost 50 to 100 bucks and you think thats ok? Seriously wtf?",
          "id": 122,
          "comments": [
            {
              "score": 12,
              "content": "Jeans from a \"super expensive brand\" cost more than that, probably more around 200-300",
              "id": 123,
              "comments": [
                {
                  "score": 3,
                  "content": "I only buy cheap so was underestimating how expensive it can get thank you TIL",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "if she didn’t know about her then don’t keep them",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Firstly yes OP is one of the assholes here. As ESH. \n\nSecondly, I can't be the only that cringes when sentences start with \"Girl,....\"",
          "id": 126,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1395,
      "content": "YTA This girl didn’t cheat on you. You don’t even know that she knew you exist. \n\nYou don’t get to steal her shit because you want to take out your anger at your boyfriend on the girl he had sex with.\n\nIt’s theft. And it’s not just petty. It’s kind of sad. You really want to be known as the girl so obsessed with her ex that she needed a trophy from the time he cheated on her?",
      "id": 127,
      "comments": [
        {
          "score": 545,
          "content": "I disagree. In my early 20’s I fucked a guy who had a girlfriend and I had no idea she existed until I learned she broke up with him after she found out. If she had walked in on us mid-act I 100% would have understood that emotional response.\n\nIt’s not like she’s a petty ex watching through his window and freaking out when he brings another girl home. They were in a committed relationship for 2 years and she walked in on him screwing another girl. Expecting her to be fully rational in that moment and even this soon after the moment is ridiculous.\n\nDude needs to shell out the money for new jeans because he’s the real asshole here and the woman, if innocent of knowing, has a crazy story. The real emotional damage dealt was to the OP.",
          "id": 128,
          "comments": [
            {
              "score": 150,
              "content": "[deleted]",
              "id": 129,
              "comments": [
                {
                  "score": 233,
                  "content": ">If you can’t think rationally when you really need to\n\nYou cannot expect people to act a certain way in the face of emotional distress.\n\nLook at grief and mourning, people deal with it in completely different ways, it's not anyone's place to tell anyone they are wrong for how they do it.\n\nWell done you for being a paragon on rationality and morality, but I'm afraid it's not the case for most. She's not an asshole because she took the jeans, She's an asshole for keeping them.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I agree with your logic. Was boutta call you out for condoning it until I saw the end of your post. Good judgement call all around.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I’m pretty sure most states allow for emotional distress defense to get a non guilty verdict. Now, clearly stealing pants is a civil thing so it wouldn’t matter in this case but people have shot others dead and used the defense to get off on charges. So yes, you can use it to defend immoral actions. Once emotions get involved, it’s hard to stay rational in a lot of high tension situations, no matter how many times you’ve thought the situation through rationally in your head.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I love people on reddit they are always so perfect and have impeccable morals. They have never done anything bad or stupid in their lives. \nIt’s such bullshit. Everybody makes mistakes and they do stupid things. If you say you don’t then you are lying to yourself.",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "I get the emotional response in that moment, but OP has had time and space to think about the situation since. I don’t see why someone would want to hold on to something that belongs to the woman that your significant other cheated with. Theft aside, it’s holding on to a memory of betrayal. It’s Using the fit and brand as a justification for an irrational thought response in order to hold onto it. Perhaps OP feels like the woman hurt her, not only because she slept with her significant other, but because she looked really good and ate pizza with him while OP refrained from pizza in order to live up to certain expectations, putting time and effort into supporting her SOs diet while he not only slept with another woman but ate pizza with her. She loved him, so naturally, she resented her in that moment and acted irrationally. It was human. \n\nHowever, now, OP needs to look within herself and ask why she kept the jeans. Why is it so important to keep them? Is she resentful towards the woman and feels a sense of power taking something she loves away..just like the woman did with OPs man? Does she feel insecure and the jeans provide her with a sense of security considering they belonged to the woman he cheated with? \n\nIdk enough details to say anything about the woman. Even if she knew about OP, it took 2 to tango and OPs resentment and anger should be directed towards her ex. \n\nRegardless, I hope you work through things OP. Im sorry you had to experience that and especially firsthand. I’m sure the jeans look great on you, but I think you should be the bigger person and give them back. You won’t lose anything but the physical item representing the betrayal you experienced. Perhaps in letting go of that, you will be able to accept the situation and allow yourself to heal and move forward.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "She’s not an asshole for taking the jeans, she’s an asshole for keeping the jeans as a trophy and coming here looking for validation.  It’s past time for her to return the stolen property.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I understand her emotional response. I wouldn't judge her for taking the jeans, or at least not a lot. It's an overreaction, it's not the right thing, but in a emotional situation like this, it's not too bad.\n\nNot giving it back though? Yep, judgment incoming.\n\nEdit: Also, police, possibly.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Again.  Theft is bad.  Even when you are sad or mad.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": ">Expecting her to be fully rational in that moment and even this soon after the moment is ridiculous.\n\nExactly. Everyones acting like she's some horrible person who regularly steals candy from babies.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Seriously. Pretty sure this thread is full of thieves.",
          "id": 139,
          "comments": [
            {
              "score": 29,
              "content": "My time on reddit has taught me that at least half of people will happily steal if they can either A. get away with it or B. Come up with some shitty justification to excuse themselves",
              "id": 140,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I find it super weird she’s wearing the pants... Like doesn’t that remind you of the owner who was with your bf?? Why would you want her clothing even if it does look good.",
          "id": 141,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 142,
              "comments": [
                {
                  "score": 2,
                  "content": "The whole post sounds fake as hell tbh. Read how she describes walking in on them; that is such a male gaze",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Exactly. Imagine meeting someone who heard about this story not from the OP - she’s the crazy one who was vindictive and immature. The girl might not have even known. Better to be safe than sorry. Take the high road, OP. It’s always brighter in the end.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">the girl so obsessed with her ex that she needed a trophy\n\nwell, she was going to razor cut fennel for him",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "If my memory serves me right, my criminal justice professors called these neutralizers. Essentially you make up an excuse to justify your illegal or immoral actions.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 635,
      "content": "YTA, he’s the bitch who cheated on you not her.\n\nHe’s an asshole too obv.",
      "id": 147,
      "comments": [
        {
          "score": 114,
          "content": "[deleted]",
          "id": 148,
          "comments": [
            {
              "score": 227,
              "content": "I don’t think that the woman who had her jeans stolen is necessarily the asshole, not enough info to call that imo.",
              "id": 149,
              "comments": [
                {
                  "score": 67,
                  "content": "[deleted]",
                  "id": 150,
                  "comments": [
                    {
                      "score": 8,
                      "content": "The question is if she's TA for keeping the stolen jeans, which yes she is, so YTA. Honestly, the rest of the details are pretty irrelevant and are just there to justify to OP that she can keep something she stole.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "But doesn't YTA mean that noone of the other people is an asshole?",
                  "id": 152,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 526,
      "content": "YTA - why would bring cheated on entitle you to steal someone's expensive jeans?",
      "id": 153,
      "comments": [
        {
          "score": 166,
          "content": "Because circlejerking for cheater's assholery is a commonality here.",
          "id": 154,
          "comments": [
            {
              "score": 7,
              "content": "Yep, especially if the victim is a woman",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "You mean that being a huge jerk to someone as retaliation doesnt solve anything and isnt justice served???",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 490,
      "content": "YTA- Your boyfriend is an asshole. The other girl could have got played, but I think there might have been signs that you had been there... so i am not going to vote on her with no evidence.  But you? You are an asshole for stealing from her. And to all you others in this thread, let's do it this way ... what if OP had grabbed the other girl's PURSE/wallet and walked out because she wanted to be \"petty\"? If you say \"you go, girl!\", the you are ALSO an asshole. \"But, she didn't steal a purse!\" Duh. She still took something that wasn't hers. The other girl can still call the goddamn police on you. You want to give your POS boyfriend the satisfaction of seeing you get arrested?\nYou are a thief.  You stole something that wasn't yours from someone who couldn't fight back. \nDump that POS boyfriend (sorry that happened to you, BTW. That sucks). But give the jeans back and move on.",
      "id": 157,
      "comments": [
        {
          "score": 110,
          "content": "Finally a reasonable person",
          "id": 158,
          "comments": [
            {
              "score": 125,
              "content": "[deleted]",
              "id": 159,
              "comments": [
                {
                  "score": 90,
                  "content": "A lot of these \"you go girl\" comments are disgusting. Really goes to show that a lot of people's moral compasses really only apply to themselves. \n\nEVEN IF this girl boned OP's boyfriend knowing that she existed, it does not justify OP stealing from her (especially since the jeans are expensive). I can understand doing something rash in the heat of the moment, but choosing to keep the jeans out of some twisted sense of retribution is pretty fucked up. Someone wronging you emotionally =/= their property being up for grabs for the people they've wronged. \n\nI guarantee every single person in this thread has hurt at least 1 person in their lives. I highly doubt they'd all be OK if that person stole something expensive of theirs as \"payback\".",
                  "id": 160,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I have no idea how expensive those pants are, but depending on the amount, it could be felony theft.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "[deleted]",
          "id": 162,
          "comments": [
            {
              "score": 2,
              "content": "Twist: her keys were in the jeans :/  \n\nSo the boyfriend has to buy another pair of jeans AND a car.  \n\nI'm glad to see the edit and that OP is giving the jeans back",
              "id": 163,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I agree with this, and from the girl's text \"bad decisions\" could mean in the door and straight to the bedroom. Emotional turmoil can lead to the need to numb the pain in very stupid ways. \n\nThink about how much of a scumbag the boyfriend is. He saw someone going through the loss of her father and thought, \"I bet I could hit that before my GF gets home.\"\n\nYou obviously dodged a bullet here OP, I'm just sorry you wasted 2 years dodging it.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yup. Be the bigger person and give back the jeans.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 184,
      "content": "YTA\n\nWHAT IS WRONG WITH ALL THESE PEOPLE REPLYING NTA??\n\nYou dont steal people's crap, period. You dont know if they cheated did it maliciously. You dont know this chick. \n\nBesides, you admitted to taking them out of anger, but keeping them because you like them. That means you have no reason to keep them other than regular thief reasons. Which makes you a regular thief. \n\nIt's not fair to steal other peoples crap, perhaps justified, but that still makes you the asshole.",
      "id": 166,
      "comments": [
        {
          "score": 18,
          "content": "Yeah whatever happemed to two wrongs don't make a right?",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I say she's wrong to take the jeans, even if the other girl knew full well they were dating. But doesn't make OP an asshole for taking the jeans (although \"I look so good in them tho\" is a bit of a red flag). OP is only an asshole if she decides to keep them for herself.\n\n(Also I think you're confusing the bot because your comment contains two conflicting answers.)",
          "id": 168,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 175,
      "content": " INFO.\n\nYou probably don't know, but did she know you two were together?\n\nIf she did then you're NTA at all. Justifiable trophy IMO.\n\nIf she didn't and she thought she was just hooking up then NAH other than your boyfriend and you might want to give it back.",
      "id": 169,
      "comments": [
        {
          "score": 86,
          "content": "She mentioned in a reply she'd been seeing him for two years and had lots of her personal items all over the apartment. If you come into an apartment you think belongs to a single man, and see feminine products or clothes dotted around you'd have to be stupid not to add it up. Also she mentioned OP's picture is his phone lock screen. I think the girl knew or was willfully ignorant.",
          "id": 170,
          "comments": [
            {
              "score": 20,
              "content": "Some people are swingers or some such\nSo it's certainly possible...\n\nBut you're definitely getting into mental gymnastics to try and justify the possibility at that point.",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "\"Hey...there's some girls stuff here, whats that about?\" \"Oh, my sister lives out of town but just got a job here, so she stays here sometimes while shes trying to move\"",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "INFO agreed, definitely. This girl could just be a victim as well. If that's the case I would suggest OP return the jeans directly to the other girl. Who knows, they may even bond over how much of a prick this dude is.",
          "id": 173,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "There is no justifiable trophy. This is theft. They are not her jeans and revenge like this is just sad.  \n\nIts really pathetic. \"Where did you get those jeans\" \"I stole them from the woman who slept with my man and now I wear this constant reminder of betrayal and proof that I'm a crazy ex as if it's cute\"",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I going against the norm here but I'd still say esh even if the other girl did know about op. Being cheated on sucks but it doesn't entitle you to commit literal theft.",
          "id": 175,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}