{
  "post content": "This is messy. I40m have been married to my wife Cindy off and on. We had a child together who is now 17. We had a rocky part in our marriage and split for a few years, where I met a woman Stacy. We were together for a while, having twins together, ages 12. Stacy and I split up, bc she ended up being unfaithful. 2 years later I had reconciled with Cindy, we got my twins every weekend due to our work schedules.\n\nThis past weekend my oldest daughter went into early labor. It was also my weekend with my twins. \nI had told Stacy on the way to the hospital that I would not be able to have them this weekend due to this. I had put my phone on silent and away, due to a lot going on. When I returned to my phone I had abunch of text from Stacy saying how I needed to go home and be with my twins, and how Cindy could handle this situation. I told her absolutely not, that I wasn’t missing the birth of my grandchild. \n\nShe then responded angrily saying how I was picking my oldest daughter over my youngest and how wrong that was since they can only see me on the weekends anyways. I tried texting and calling multiple times throughout the weekend, getting no responses. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 12324,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 8682,
          "content": "***\"Your weekend means that you need to arrange childcare if needed.\"***\n\nInstead he put his phone to silent and is now whining why he's getting the same treatment back.",
          "id": 3,
          "comments": [
            {
              "score": 5858,
              "content": "I normally would agree, but this was a teenager going into early labour. Not exactly predictable, and not something I would want her going through without support. I suppose it depends on whether he spoke to his ex, or if he texted her or left a message before putting his phone on silent. I do think it's an unfortunate situation. If she had an urgent important plan, it makes her being upset more understandable, but I don't know that I would have done differently.",
              "id": 4,
              "comments": [
                {
                  "score": 3725,
                  "content": "OP has been asked multiple times what arrangements he had made prior to cover for situations like this. If his eldest went into labour during any weekend, who had he arranged to watch his kids. He hasn't replied. It sounds like he had made no plans or arrangements. He simply messaged or vouce mailed his ex snd put his phone on silent. This is my issue here. Because this situation wasn't a surprise. OP had months to make arrangements, but his only solution ended up texting his ex and not having an actual conversation with her.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1945,
                      "content": "His plan was that his ex would drop her plans to watch the kids in his weekend.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 151,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": ">went into early labor.\n\nEarly labor is always a surprise.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly. Because the default parent will & has always figured the inconveniences out for him…",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It was a surprise, it was weeks early and apparently the first weekend he has ever missed despite working 12 hour shifts in the week. You saw he didn't answer about the original plan (which is completely irrelevant since it had to be put quickly into emergency mode) but managed to miss some pretty salient points.\n\nIs this the usual Reddit thing where it is dad missing custody so we all lynch him, coz it seems an actual child in premature labour requesting her parents in the delivery room would be absolutely forgiven if it were a mum posting this up, in which case we could expect \"don't they understand birth is a medical situation\" and \"you were being there for your child, it was one weekend and an emergency\" but nope, coz it's dad there is an assumption that his plan was always to drop the other parent in it.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I do agree with you that OP needs to plan better but I think ESH because Stacy tried to pick a fight about choosing favorites.  She wasn't mad because she was unable to watch the kids or because of practical reasons.\n\nHis daughter was in the hospital and it was an emergency, it's not like he took her on vacation and bailed on the other kids.  It doesn't excuse OP from his responsibility but she could have used a little understanding that emergencies happen.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 265,
                  "content": "Yeah this sounds like there is unnecessary animosity between them, and they are finding ways to lash out. ESH\n\nThere is no reason for that situation to turn in to a fight. It's a very reasonable excuse to dip out of child care that week, and any shared care arrangement should be flexible enough to allow for unexpected events. If she's needlessly being difficult to prove a point then that's super annoying and a dick move. A baby comes when a baby comes and if his teenaged daughter wants him there to support, then he should definitely go. \n\nAll the same he's had 9 months to figure out what to do if the baby arrives on his days with the twins, and he didn't. Instead he turned his phone off and became uncontactable, which could have backfired badly for the kids. Children aren't your personal vedeta machines. Do better.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 163,
                      "content": "> it's a very reasonable excuse to dip out of child care that week.\n\nIt isn't. You don't get to dip out of parental responsibility because of something that happened. In this situation, a parent still has the responsibility to make arrangements for this children. Parenthood isn't a part-time job.\n\nWhat OP has shown is that he considers parenthood something that he gets to pick to do when he considers it convenient for him.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 104,
                  "content": "Yeah, me too. He knew the younger ones were safe with mum, older one was having a medical emergency. NTA. His younger ones will need him in an emergency at some point, and I'd hope he'd do the same for them .",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "He sent her a message, but didn't wait to hear from her before putting the phone on silent. That is a big mess up on his part, when child care is involved you wait for confirmation before putting the phone on silent.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "they are his kids... what would he have done if he had them all the time? it was his responsibility",
                  "id": 16,
                  "comments": [
                    {
                      "score": 97,
                      "content": "Something else...but that wasn't the case. They were with their mum and he was dealing with a medical emergency.\n\nHe's absolutely NTA and his ex is trying to weaponise the kids. He's also helped her when an emergency came up. \n\nhttps://reddit.com/r/AmItheAsshole/s/dOYMdkLIA6\n\nUnequivocally NTA.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I would *like* to think that if he had the twins full-time, he would’ve well organised something prior",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "What are you talking about there is literally months to plan. The pregnancy didn’t show up yesterday.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 46,
                      "content": "It didn't show up yesterday but the labor happened weeks early. Pregnancy can be just as unpredictable as any other Medical ailment.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yes but emergency labor can sometimes be death. I should know I nearly died with my premature child. It is a surprise when they are premature",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "The child came early.  He might have had a plan for around the due date but babies come when they want to.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "That is true. If I had a step daughter in labor I would expect my husband to go be with her. OP, what's up with Stacey? Did she really need a cocktail so bad she wanted you to abandon your daughter during birth?! That's what it sounds like.\n\nMaybe I'm wrong or missing something (everyone is voting opposite of what I will), but it seems to be the right response to silence your phone and focus on your daughter.\n\nMaybe someone can edify me as to why I'm wrong.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 21,
                      "content": "The way he wrote it he has the kids every weekend due to work schedules. It's likely Stacey has to work and has no backup plan for the kids. We don't know what she had planned or not. He didn't communicate with her. \n\nIf your stepdaughter was in labor and you had other kids you and your husband would've made a plan in advance on how to handle your current kids. \n\nIt's very much giving I only parent my kids when it's convenient vibe.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "He shut off his phone, before getting any kind of response from Stacey. That's where he screwed up. Even if Stacey has acted up prior to this event, OP should take the high road because it's not about them it's about the kids. The twins could've been picked up and dropped off at his place since it was his responsibility to do so. That makes OP TA.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "You're right! Stacy is being unreasonable. Where OP messed up is not saying ahead of time, like months ago, hey when Teen goes into labor will you keep the twins if it's your weekend. It's something that should be said to be considerate since he had so much notice, even if he didn't know the exact date. And then putting his phone on silent without waiting for a response- it might have meant the twins weren't picked up from school or practice, if mom was stuck at work. Or it might have made no difference. Either way, confirmation was needed before he did that, or at least a sooner check in. There's no reason dad couldn't have stepped out for a second to actually call the twins' mom. \n\nOverall I agree with you that being with the Teen was the right call, and ESH because they don't have a decent co parenting relationship",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "People are making assumptions that when OP says 'early labor' he means a few days early, not scary dangerous early.  Some people have never had the fear of losing their teen/daughter/DIL to birthing complications, or losing their premie grandchild because the child came too early.  \n\nIt makes sense, if OP is afraid of his daughter dying, that he would turn off his phone.  Or if the unit she was in had a rule that phones needed to be off.  I can think of dozens of ways that make this a NTA situation.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "Who said having the kids meant he wouldn’t be supporting his oldest?",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "When you’re a parent and are preparing to give birth to another baby you make plans and arrangements, who will take care of your children in the case of an early labor. You think of any contingencies and prepare for them. \nWhy is this case any different? Because the OP is used to relying on his ex taking care of the kids 90% of the time, unless it’s his “fun weekend”? \n\nIn either case, these aren’t little kids, they’re 12. OP should have taken them to his home and left them there to play videogames while he’s at the hospital. Come dinner time have them DoorDash themselves food. \n\nNot sure why these 12 year olds are being treated like they’re 2.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "He still handled it awfully. And no parent should ever ignore their phone.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 204,
              "content": "So people can't even put their phone on silent if they are literally supporting someone giving birth in an emergency situation?\n\nThis was a medical emergency of his teenage daughter. How is he supposed to \"arrange\" for an... emergency?",
              "id": 31,
              "comments": [
                {
                  "score": 99,
                  "content": "He had months to prepare. He should've had childcare arranged in case of an emergency like this. Not just shoot a text to his ex and then put his phone to silent, not even hearing if she was free.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 281,
                      "content": "They have shared custody. When SHE ends up sick, HE would step up when she'd have custody. Because that's what parents who share custody do. They may not be romantic partners any more but they are decent to each other and SHOULD BE each other's first support network when it comes to their shared kids.\n\nTelling her ex that \"he was prioritizing his oldest kid\" when kid literally GIVES BIRTH is absolutely ridiculous. He was prioritizing the kid in a medical emergency. As he should!\n\nIn an emergency you expect others in your social support network to step the fuck up, and not throw a hissy fit and be passive-aggressive like the ex-wife.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 133,
                      "content": "In real life not everyone has contingency plans at all times for every eventuality. Labour can happen unexpectedly and scupper even the most well laid plans, what was OP supposed to do exactly, have a babysitter on retainer every weekend for the duration of his eldest daughters pregnancy on the off chance that she gave birth at an unexpected time? That’s just not realistic.\n\nShit happens sometimes. A medical emergency popping up and inconveniencing his ex’s plans is annoying for her I’m sure, but this isn’t like he got a two for one coupon on thick crust pizza and decided to ditch the kids for a night in alone, his eldest daughter who is still a minor went into labour. \n\nYeah turning his phone on silent was unwise, but not everyone has perfect clarity and purpose during emergencies- his number one priority was to be with his underage daughter going through quite possibly the most potentially dangerous and major event of her life. His twelve year old kids will be fine, it’s one messed up weekend because of an emergency, not parental neglect.\n\nBut also with coparenting situations… the other parent *is* the emergency plan. His daughters staying with their mom for two more days that week means they are safe and sound, they weren’t left on a dirt road somewhere. Maybe Stacy’s weekend plans got messed up but I’m sorry, her minor inconvenience is a small issue compared to OP’s 17 year old child giving birth. Stacy and the girls will be just fine, it’s a major overreaction to say he’s an asshole for rightly prioritising the health and safety of his eldest daughter in a one off major emergency.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": ">This past weekend my oldest daughter went into early labor.\n\n\nShit happens. Since you're an expert, how early was it? Was the proposed babysitter free on all weekends during all the months prior to his daughter being full term? How soon could the proposed babysitter be there, since, you know, a baby was actively emerging from his other (17 year old) child?",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 62,
                      "content": "Op daughter went into labour early? Did you not read it? shit happens can’t stop a baby being born cos it’s the wrong weekend 😂😂😂😂😂",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Most 12 year olds do not need childcare. Heck when I was 12 people in my neighborhood hired me to be *their* childcare.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "… you can't control when someone goes into labor. I'm a babysitter. Someone cannot put have me on stand by for 9 months in case their kids goes not early labor. This is an emergency, OP not getting the twins makes sense.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Normally I would agree, however when one child is having a baby vs one wanting to have parental time, it doesn’t take a rocket scientist to determine where OP should be. Second mama can get over it, he will be there when their children have babies too.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "His daughter went into labor early. How can that be planned? NTA.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He was in the delivery room. I don't know if you have kids but you absolutely cannot be on your phone in the delivery room.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1662,
          "content": "Oh come the fuck on - it's a real emergency. A 17 year old child went in labor and he did what a good dad does. The twins will get over not seeing their dad for 1 weekend for a truly real medical EMERGENCY. \n\nThe kids are also 12 not 2 that the ex would have rearrange her whole weekend. He also tried to contact her after the emergency was over and she was being petty. That's not putting her kids first - that's being childish. \n\nNTA",
          "id": 42,
          "comments": [
            {
              "score": 496,
              "content": "I'm with you on this one. People ought to be accommodating *if the situation warrants* and this, I think, does. I'm sure twelve-year-old kids could understand this -- unless their mom is so bitter that she frames it as dad rejecting them. Dad, apologize to the twins and their mom, then take the kids to meet their new nibling. NTA",
              "id": 43,
              "comments": [
                {
                  "score": 140,
                  "content": "Parents can be such arseholes. Of course you accommodate where you can - especially if it's a rare occurrence and involves an unforeseen medical event. As the mother , I'd have explained the situation so the twins don't feel abandonment...instead it sounds like she's doubled down and made them feel crappy in the process. What goal does that really achieve except upsetting two kids? People can go into labour at any point, you can't plan for it, it's just a known possibility. His ex has had twins so she'd know. \n\nI wouldn't want my kids there anyway - it's a hectic time and not the place for children until after the dust has settled.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "How do you think people who aren't divorced handle the birth of the second child?\n\nThey arrange for babysitters to stand by for when the moment is there.",
              "id": 45,
              "comments": [
                {
                  "score": 221,
                  "content": "In what world do 12 YOs need a babysitter?? A lot of people start BEING the babysitter at 12. I mean seriously. They aren’t babies and if they’re not disabled, childcare shouldn’t be an issue in this scenario at all.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 91,
                      "content": "Finally someone is saying this. If they were a few years younger, then OP would have been the AH for just ditching them. But 12yos can stay at home alone.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 123,
                  "content": "Uhhh, who are these babysitters available to be on constant standby in the event a pregnant woman goes into labor unexpectedly? \n\n12 year olds don’t need constant supervision and they definitely don’t need “babysitters” (barring special circumstances like disabilities or special medical needs).",
                  "id": 48,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And like in what world is putting the kids w a babysitter all of his weekend a better alternative than just staying with mom? it was an emergency, not that he didn't feel like it.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "They are also 12..not 2. They need babysitting?",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Absolutely correct. NTA",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Why couldn't the twins go to the hospital? They're 12. Not 2.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 381,
          "content": "Do you... understand this was a *medical emergency*?\n\nSharing custody in a GOOD way means that in an emergency, the parent who wouldn't have custody will fill in.\n\nOP did that when his ex-wife was sick, too!\n\n\\> Your weekend means that you need to arrange childcare if needed.\n\nNo. Not in an emergency you don't. In an emergency you expect others in your social support network to step the fuck up, and not throw a hissy fit and be passive-aggressive like the ex-wife.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "So an actual life or death emergency, sprung early without warning, doesn’t constitute an extenuating circumstance?",
          "id": 54,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 181,
          "content": "It’s an emergency,it’s not like it’s happening every month.\n\nIf his daughter was in the hospital for a different reason,then he should have let her there alone?\n\nShe is underage.geez",
          "id": 55,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 155,
          "content": "You'd rather he put the kids in childcare rather than staying with their mother whilst he does the good father thing and be with his other child birthing his grandchild?  That's wild.  Yes he should have had a plan in action but the daughter may have gone into labour early and it took them by surprise.  Yes he should have had the conversation rather than text.",
          "id": 56,
          "comments": [
            {
              "score": 52,
              "content": "How do we know she didn’t have to work? Or have things to do herself?\n\nThat’s the point. He doesn’t get to just make her rearrange her schedule because he decides to ignore his phone.",
              "id": 57,
              "comments": [
                {
                  "score": 52,
                  "content": "But he said in the comments that he had covered  for her when she was called into work a few times. She could have understood and wished his daughter a safe delivery.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "[removed]",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "The kids are 12, they can watch themselves.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "Unfortunately if this guy is in the US, that is not what it means. If you are the non custodial parent, you have the OPPORTUNITY to see your kids but you are in no way required to take them or arrange childcare if you can't. However, a teen going into labor is a very rare medical emergency so I'm going to say NAH.",
          "id": 61,
          "comments": [
            {
              "score": 48,
              "content": "Actually, in the US it is referred to as parenting time now. \n\nAnd yes, it is that parent’s responsibility to ensure their child is cared for. \n\nI mean, you can be like this guy and just ignore your responsibilities, but that doesn’t make it any less his responsibility.",
              "id": 62,
              "comments": [
                {
                  "score": 3,
                  "content": "Actually, not everywhere is it referred to as parenting time.  My state still uses custody.  Maybe don't correct people who don't need corrected.",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 125,
          "content": "We found Stacy",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 76,
          "content": "Early labour is not something you can exactly plan for.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "This is the most self absorbed & inconsiderate opinion I think I've ever read! If you can't be flexible in the case of an un-planned teenage pregnancy experiencing premature labor because \"It's not my weekend!\" then you need your head checked! \"Oh my God! I might have to rearrange my weekend schedule. What a life-changing inconvenience for me\" \n\nTry a Fucking firm grip on reality for a change.",
          "id": 66,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6837,
      "content": "[removed]",
      "id": 67,
      "comments": [
        {
          "score": 2461,
          "content": "Right??? This is wild. \n\nThere was a similar post from a mother’s POV recently and everyone was saying NTA. So many hypocrites on reddit. Add on to this that the daughter giving birth is still a child herself and went into early labor. \n\nAnyway OP NTA. It was an emergency. Sure, you could have handled it a bit better, but it is what it is. Congrats on becoming a grandpa!",
          "id": 68,
          "comments": [
            {
              "score": 525,
              "content": "The problem is he's already a weekend dad. Plus, he informed the ex wife he wouldn't be taking the twins, didn't have a discussion about it. Then also dared not even wait for a reply and put his phone on silent. Those are all the actions of a selfish entitled person.",
              "id": 69,
              "comments": [
                {
                  "score": 1308,
                  "content": "Or, hear me out here, they're the actions of a man who just had his 17-year-old daughter go into premature labor and chose to make sure she, her child and his current partner were all okay while at the hospital because birth is dangerous enough without being early.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 227,
                  "content": "So I'm sure of the area in which these people live but having worked in labour ward we request that all phones be switched to do not disturb while in the room with a labouring person. \nHe may have just had to follow protocol.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 171,
                      "content": "even if it isn't part of the established protocol - having your phone loudly ring in a hospital where people need to rest in recover is just rude IMO.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "A lot of hospitals have policies for phones being on silent so as not to disturb patients, and to not confuse staff with a medical alarm going off. So putting it on silent I understand. But I think he should have made a contingency plan asking his ex if she would be happy to keep the twins if his eldest went into labour on a weekend.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Those are the actions of a man trying to take care of his child going into premature labor. That is an ACTUAL emergency. She or the baby could actually die…how is that selfish? Have you ever found last second childcare super easy? The alternative is having two kids wander around a hospital barely supervised. Yeah he did the right thing.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah so selfish he's covered for the ex before https://reddit.com/r/AmItheAsshole/s/dOYMdkLIA6",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If he knew he wanted to attend the birth without the twins if the kid came on the weekend he should have started talking about it with his ex awhile ago. There was always a 2/7 chance the baby was going to come on the weekend.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "I think people are calling YTA not for stepping up for his 17 year old daughter, but how he went about it.\n\nNot what he did, *the way he did it*.\n\nIt's hard to believe he didn't have a discussion with his ex about the possibility of a short notice cancellation if his daughter gives birth. That's adulting to me!",
          "id": 77,
          "comments": [
            {
              "score": 94,
              "content": "Yep, communication is what was needed here.",
              "id": 78,
              "comments": [
                {
                  "score": 15,
                  "content": "That wasn't her complaint, though...\n\nShe was mad that he would dare putting his daughter giving birth ahead of the boys for one weekend.",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "But her argument was he chose the older child over the younger ones. Not the lack of communication.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "As someone who has given birth 3 times I know births can be early. If I was his ex I’d expect this could have been a possibility and not been a huge jerk about another woman (and a teenage woman at that) giving birth. But then that’s just me.",
              "id": 81,
              "comments": [
                {
                  "score": 20,
                  "content": "Same, I don’t see why a conversation is needed about what would happen when she went into labor, or any other emergency situation. I think it should be obvious and expected. Besides that, she isn’t complaining about the inconvenience, she’s only complaining that OP prioritized his daughter in an emergency medical situation. And of course he did. I nearly died during early labor with my first child. We don’t know what complications his daughter had throughout. He didn’t need to be arguing on the phone with his ex wife. These comments are ridiculous.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I agree. I have no issue with his decision to leave the kids with their mom- realistically it was absolutely the best option. The problem is that OP had a pregnant teenager and never discussed what would happen when she inevitably went into early labor. Adolescent girls almost always do.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 211,
          "content": "[deleted]",
          "id": 84,
          "comments": [
            {
              "score": 13,
              "content": "Exactly - it's how small children think of their parents: if any problem arises, ask mom/dad! They always know what to do and are in control of the situation.\n\nWell, children, good parents know how to project absolute confidence so that you don't fear the world. If you grow up you'll learn that much of that is fake and they make it up on the go.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 116,
          "content": "As someone in a blended family, I 100% agree with this. 2 kids were safely with a parent, with no concerns for their well being. 1 was in the midst of an emergency. Priority is obvious here.  NTA.",
          "id": 86,
          "comments": [
            {
              "score": 4,
              "content": "Same! My younger brother who has a different father would NEVER be hurt or feel jilted if our mother ran to my help during labor. He’s a young teen and not that much older than her twins. If he gets it, they can too. Stacy doesn’t sound like a supportive coparent.\n\n\nThis could be due to how they ended their relationship, who the hell knows but how is that fair? She needs to move on",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "You mean a 17 year old wanted their dad in the delivery room! Nfw!",
          "id": 88,
          "comments": [
            {
              "score": 5,
              "content": "I was 20 and my mom and dad were both with me for the entire delivery because I wanted them *both* there. My mil was pissed because she wanted to be there but there was a 3 visitor limit and I wanted my parents and my husband. My dad has always supported and comforted me and this was no different, I can definitely see a 17 year old wanting their dad to be with them when going through something so painful and scary.",
              "id": 89,
              "comments": [
                {
                  "score": 6,
                  "content": "My dad was always my safe space. I wish more than anything he'd have been able to be there for the birth of my daughter. It was terrified and I was 20 years older than this guys daughter. He definitely made the right choice.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "People get so bent out of shape when we don’t adhere to typical gender roles or toxic stereotypes. Men can be caretakers too.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "I’m amazed the top comment is someone saying YTA. This was an emergency. Definitely NTA",
          "id": 92,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "The people saying YTA are like my ex husband, *we have to go by the pa-pers*, while I'm in the hospital with pneumonia. Not everything is black and white, and they are not perfect, I'm sure one day something will come up on her end and she will have to do the same thing.",
          "id": 93,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "If my ex had called me in the same situation, I would have suggested maybe we flip flop weekends so the kids get to see them and they get to be there for their grandchild's birth.  Not that my ex and I were great at working things between us out but we were usually really good at working for what was right for the kids and worked for us too.",
          "id": 94,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Yep! This sub seems to think giving birth and the postpartum period is a walk in the park and birthing women or recent postpartum women deserve absolutely no special treatment. Obviously in any medical crisis people lose the ability to rationally think and *plan* which also seems to be forgotten here.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I agree with you. I’m thinking fortunately the twins were with someone else already. What happens if the teen has a problem during the labor, what if the grandchild dies or the mom? There are so many bad things that can happen not only during term birth, but especially pre-term. \n\nHe even thought about calling her during this emergency. Why should he have to stay on the phone to calm the ex down. I would thank the ex for having the kids that weekend and once everything is good, go get the twins for a few extra days, if she is ok with that.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4227,
      "content": "[removed]",
      "id": 97,
      "comments": [
        {
          "score": 1602,
          "content": "To me the issue comes with OP simply sending a text to his ex and then putting his phone on silent. What if Stacy had plans she couldn't cancel? OP totally sucks as a co-parent, sending a message and then stopping all possible contact there.",
          "id": 98,
          "comments": [
            {
              "score": 558,
              "content": "Yeah. That def deserves a phone call, at least lol.\n\nAnd not silent immediately after one text.\n\nUnless you're on those terms. Which they obv aren't.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 295,
              "content": "This. Of course emergencies happen but that doesn't mean you simply ignore the fact that you have other kids to care for. What if this was a nuclear family? You rush to the hospital and forget you have other children at home? No, you'd also make sure those kids are taken care of. This is what's lacking here. Of course he's not the asshole for prioritizing his daughter here, she needed that care. But that doesn't mean he gets to dump his other kids with no notice nor arrangements, they're his responsibility too.",
              "id": 100,
              "comments": [
                {
                  "score": 62,
                  "content": "To be fair, in case of a nuclear family one parent would have gone with 17F and the other one would have stayed home with the other kids likely. Therefore I don't think it makes him the asshole to leave the twins with their mother. Communication could have gone better, but 17F went into *early* labour. So you can't even blame OP for not having a contingency plan. \n\nWhat seals the deal for me is that the twins' mom wasn't annoyed about having the kids, but about them coming second to the older daughter - which, in an emergency like this, is warranted. Imo OP is NTA.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I mean he is married. His wife could have gone to the hospital with his 17 year old, right? It's not like he was helpless.",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I disagree. With a nuclear family, especially considering the twins are 12 years old, I’d expect the whole family would go to the hospital and the twins would simply hang out in a waiting room during the birth. I was 12 and my siblings were even younger when my grandparents were in a severe car wreck. We became very familiar with the ICU waiting room that summer.",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "Or prior discussion. \n\nSure the labor was early, but the kid has been pregnant so its not a total suprise. A simple, \"hey, kid A is pregnant and could deliver at any point, if that happens on a weekend when I am supposed to have the twins would it be ok to swap around weekends\", would have prevented all of this.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "They're 12.  She can leave them money for pizza and makings for sandwiches.  Assuming mom is not going out of town for the entire weekend, a 12yo, let alone a pair of them, can fend for themselves for the length of a workday without incident assuming there are no developmental issues that OP didn't inform us of.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": ">What if Stacy had plans she couldn't cancel?\n\nThat happens in emergencies. You figure it out, she had the time to do that because she was not the one currently experiencing an emergency. I'm sure it was inconvenient for her, emergencies are often inconvenient for the people around you, but her reaction is awful. \n\nThe appropriate response is \"Absolutely, I got them, you go be with your daughter and I hope she and baby are okay, update me when you can.\" \n\nNot \"oh my god how dare you put your child's safety above spending time with your other kids, how dare you not have a prolonged discussion about childcare while rushing to the hospital, how dare you inconvenience me with your potentially very unwell child and grandchild\" \n\nPart of being a parent is accepting that emergencies happen and you might occasionally have to drop everything to look after your kids because of it, whether because they are having the emergency or because whoever was supposed to care for them is. When it's someone else's kid on the line you just have to be glad your kids are the safe ones.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It's silence here too if I was being told I was favoring one kid *who was having a medical event* over two kids who were looked after and safe. Her response was a f'n guilt trip, not \"I can't rearrange my plans.\"",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I doubt Stacy's plans are more uncancellable than a premature birth.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Were these hypothetical plans easier or harder to cancel than childbirth?",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 220,
          "content": "how dare he not to plan his daughter premature birth ahead",
          "id": 110,
          "comments": [
            {
              "score": 211,
              "content": "[deleted]",
              "id": 111,
              "comments": [
                {
                  "score": 21,
                  "content": "If his daughter, instead of being pregnant and having an early delivery, was in a car crash on Friday shortly before he was supposed to take the twins and had to rush to the hospital instead, what would the mother of the twins do?\n\nSure it'd be great if they'd sat down and discussed every possible emergency situation and how to handle it. But at the end of the day, they're her kids too and the father is currently unavailable to take them, so she gets to spend the weekend with her kids. Tough shit, that's life.\n\nAnd that's not even mentioning the fact that she's not mad about the overall situation or lack of communication during the situation, she's specifically mad that he's \"prioritizing\" his daughter over the twins. Because of a single missed weekend due to a legitimate medical emergency with his daughter. And he's repeatedly covered for her when she was unable to watch them at times she was supposed to be doing so.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I think most people would agree that it would have been *better* if he's had a contingency plan up front, and if he hadn't put his phone on silent (although many hospitals require that). However, I still think the emergency and stressful nature of the event means you cut some slack.\n\nStacy could have also asked him his contingency plans at any point in those previous months, if her weekends are so important to her. Again, it would be better if he had, but if you're primarily caring about your kids doing well, maybe you don't play such games. \n\nAdd in that she turned it into \"favouring one kids over others\" rather than, \"hey, plan better, that sucked!\" makes her less sympathetic.",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Not planning ahead, assuming there hasn’t been a plan and Stacy didn’t just pitch a fit because she was disrupted from Plan A, is a mistake, but it doesn’t make a person an A.H. Even going silent was perhaps thoughtless (but may have been a requirement in the L&D part of the hospital), but not worthy of the A title. This was early labor for a young first time mom. I don’t see anything saying HOW early, but that can be a true crisis. \n\nAs a divorced parent, I got used to my ex (lived 3 hours away) canceling on me last minute or even calling me to say I had to pick my kiddo up early (he’s on the autism spectrum and my ex didn’t handle their summer schedules x weeks too well. He never made it past three.  Never mind I lived with my boy day in and day out and never demanded that my EX come help out). So I think Stacy is damn lucky if he’s never missed a visit.  before.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think given circumstances, any reasonable human being would be understanding of the lack of organisation. We are all making assumptions the ex wife didn't know about the pregnant daughter which is a load of shit. \n\nWhenever any family member has an emergency to attend, the other people usually have to pick up the pieces and support them. That's how life works. \n\nThe 12 year olds are old enough to look after themselves. I'd they aren't, there is another parent capable of making plans for them given the information she had received. \n\nI really don't get how you can be mad at someone for dealing with a family emergency when he knows his kids are safe and have another adult capable of caring for them or making other plans. \n\nI think the mergency takes precedent in every single situation. \n\nHope the boys don't have an emergency he has to attend. He might not be able to because he had other obligations with his family. \n\nI can't follow your logic at all. Maybe a call is better. But when you are dealing with something like this you are usually panicked and not thinking straight. A text message is justified. He is nta",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 125,
              "content": "I mean... yeah? Why didn't he plan it? It's not that rare and everyone who's expecting should be prepared to premature birth, like duh",
              "id": 116,
              "comments": [
                {
                  "score": 90,
                  "content": "It's like these people are expecting him to have childcare on standby or something, who even offers that??",
                  "id": 117,
                  "comments": [
                    {
                      "score": 110,
                      "content": "Yeah do any of those people have any IDEA about the reality of how complicated organizing childcare is if you don't have grandparents and aunties/uncles in the background in the same town who are able to jump in at a minute's notice?? Not everyone has that!\n\nThe primary emergency childcare is ALWAYS the other custodial parent! She had way better possibilities to arrange alternative childcare on this specific weekend than he did. It's called stepping up in an emergency, and it's what good co-parents do for each other.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "you think you can‘t manage three children and three adults other than sending a text, then ghosting?",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Where is everyone saying the issue was that his ex had plans? I reread this like 8 times and the issue is that she felt as though he was prioritizing his oldest daughter over his twins because he only has weekends with them and he was being pulled away from them due to this… it’s not about planning, it seems to me she was upset he was supposedly not choosing to spend time with his youngest daughters? But of course his priority should be with his oldest for this, right? And he did say he tried to reach out the rest of the weekend so it’s not like he disappeared for 72 hours without a word.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 98,
          "content": "I don‘t see how these people are unhinged - dropping a text and then making yourself unavailable is not „flexibility in an emergency“. I also don‘t understand why it is such an either/or. the twins are 12, so fetch them and leave them alone for a few hours, that‘s not such a wild thing to do. They should be able to understand what an emergency is and be able to be manage alone for a few hours. Therefore, I think it‘s YTA, because he just switched off from his responsibility, and that wasn‘t necessary and was wrong to do.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "You need to remove your \"Y TA\" from the text or spell it Y. TA for the bot not to count your vote as such. And include your actual vote in the text",
          "id": 122,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "I am honestly shocked by all the YTA votes. The 17 year old went into early labor. How was OP supposed to plan for that?",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "The audacity of people saying that OP should have  arranged a babysitter. Wow.",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "OP HAS taken the twins when the mom needed it",
          "id": 125,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4111,
      "content": "Stacy’s plan … op’s oldest child having an early labour…\n\nWhatever stacy has planned … op’s oldest child having an early labour …\n\nStacy might have made whatever plans for the weekend!!! Oh no … op’s oldest child had an early labour though… \n\nThat is NOT equal. If Stacy can’t understand how important the birth of your first grandchild is …? Did Stacy not even care for your oldest daughter? She had an early labour! \n\nNTA. Stacy should be more understanding. Easy for all these people to say that you’re an asshole when you were the one who had to go through the stress of worrying that your eldest daughter can have a healthy delivery. \n\nIf OP chose the twins the title of this post would be ‘AITA that I abandoned my eldest daughter and the birth of my first grandchild?’",
      "id": 126,
      "comments": [
        {
          "score": 1767,
          "content": "Exactly and OP has indicated in the comments he has taken the kids from Stacy when she’s called in sick. You know, last minute, it was *her* time with the kids, she didn’t prearrange childcare in the event of an emergency. This sub is ridiculous sometimes.",
          "id": 127,
          "comments": [
            {
              "score": 710,
              "content": "I swear people have NO idea how hard arranging childcare as co-parents is. Not everyone has grandparents or aunties available in the same town who can jump in last minute. Your primary emergency childcare IS your co-parent!",
              "id": 128,
              "comments": [
                {
                  "score": 22,
                  "content": "And in many custody agreements, co parents get FIRST right of refusal if something comes up and the primary parent for that day can't care for the child(ren).",
                  "id": 129,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Right of first refusal means they have the right to say yes....or no. You as a coparent are still supposed to have plans beyond your coparent. You should have a list of at least 5 people you can call if your coparent can't take them.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I swear when the top comment on posts like this is YTA with ridiculous reasoning, I just think wow either everyone is a troll, or the world is that cooked. So I’m glad the next few comments were all NTA with reasons why like?? People can be NTA while still having made a silly choice like silencing his phone. Jesus 😂",
              "id": 131,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Plot twist: Stacy is the on call emergency OB GYN this weekend.   \n\nYou still sure Stacy’s plans are completely unimportant compared to Dads?",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2913,
      "content": "NTA\n\nIgnore these people op, labor is an emergency, especially premature, especially at 17, especially if you're in the US. We have awful mortality and complication rates. \n\nYour child undergoing a painful, scary, life threatening procedure that could maim, kill, and mentally destroy her was something that absolutely took priority over a regular weekend with your younger children. \n\nMake it up to your twins later by taking them somewhere extra fun next weekend and explain how dangerous and scary childbirth could be and how you would drop everything to be at their sides in the same situation. \n\nAs for their mom, having your ex have an emergency and being unable to take the kids during their time is an expected part of the co-parenting process. I'm not sure what plans she could've had, but frankly, emergencies take precedence.\n\nA copy of my comment elsewhere, just with a vote for the bot.",
      "id": 133,
      "comments": [
        {
          "score": 164,
          "content": "I agree. Nta. So many things can go wrong during LA or and they are selfish for not seeing that. If the labor is coming early something could be wrong. I say you have nothing to worry about.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2094,
      "content": "NTA. I don't understand all this y t a votes. How on earth was he meant to have something arranged when this was an emergency situation 🤦‍♀️ too many butt hurt on this sub",
      "id": 135,
      "comments": [
        {
          "score": 690,
          "content": "Exactly and OP has indicated in the comments he has taken the kids from Stacy when she’s called in sick. You know, last minute, it was *her* time with the kids, she didn’t prearrange childcare in the event of an emergency. This sub is ridiculous sometimes.",
          "id": 136,
          "comments": [
            {
              "score": 190,
              "content": "Yes I saw that comment too! The double standard here is crazy",
              "id": 137,
              "comments": [
                {
                  "score": 69,
                  "content": "Welcome to reddit.\n\nDouble standards are practically mandatory.",
                  "id": 138,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "When she called in sick and was now off for the entire day, just not feeling well. The kids were already exposed\nand she passed them off to another household and exposed another 2 workplaces. \n\nI don’t know any parents who get to take the day off from being a parent because they called out of work…and these are 12 year olds. So, if dad wasn’t working, it means he was supposed to be sleeping. I used to work 12 hour shifts, night shift and not getting any sleep is brutal.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "Right. It’s so sickening how people say he should have planned for an emergency he couldn’t have seen coming!",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Complete agreed, NTA. I think people are bringing up an unfair “mental load” argument in this case considering it was an emergency, and also that this wasn’t what his ex-wife was complaining about. \n\nOP wanting to make sure his oldest child and first grandchild are safe, supported, and healthy in a medical emergency isn’t “choosing sides” between his kids. Ex-wife probably has some insecurity now that OP is back with Cindy and that’s something she needs to work through. \n\nIf we reversed the situation and one of the twins needed emergency surgery, I bet Stacy would feel differently. \n\nGotta have grace and compassion for unexpected, and especially scary, life situations. \n\nSide note that I hope mom and baby are happy and healthy.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree! NTA",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1424,
      "content": "Holy shit Y T A  people, come back to reality.\n\n***NTA***\n\nYou don't walk away from your kid giving birth. \n\nYour ex was out of line and shows absolutely no compassion or empathy for your family.\n\nMissing ONE weekend with your twins is not going to cause them to feel unloved or neglected. I'm sure they will understand the need to be at the hospital with your older child while she was giving birth to their new nibling.",
      "id": 143,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 603,
      "content": "NTA\n\nI can see why so many people are getting worked up about time management and childcare. This however, does not translate directly to this situation. If your daughter goes into labor, you need to be there with her if you can be.\n\nThere is no ideal option for the twins, there aren't many possibilities for a time-centered emergency. Childcare isn't that easy to find on that short of notice, for those of you who might not know. \n\nShowing up at the hospital is not choosing between your kids, it is being a good parent and a good grandparent. (Congratulations btw)\n\nHopefully this situation will settle down with a little bit of time.",
      "id": 144,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 489,
      "content": "INFO- why can you only see your twins on weekends? Do you and Stacy typically cover for one another when unavailable? Had you warned Stacy that you’d like her to take the twins when your oldest was delivering your grandchild? Is there a reason you didn’t take your twins and arrange childcare?",
      "id": 145,
      "comments": [
        {
          "score": 1260,
          "content": "1) I work 12 hour shifts Monday thru Friday. I’ve never missed a weekend before this, but I have covered for Stacy when she’s been called in. I hadn’t warned Stacy about anything because this was early unexpected labor and I didn’t get a chance to call until we were on the way to the hospital.",
          "id": 146,
          "comments": [
            {
              "score": 899,
              "content": "So, being that I was that 17yo girl pregnant and alone with only my parents, I'll side with NTA, not at all!! Having my dad there made it tolerable, and I honestly couldn't have done it without him as my mom tortured me every day of my pregnancy.. My dad was the only one who had my back then and now!! NTA good for you for choosing your daughter at that moment!!",
              "id": 147,
              "comments": [
                {
                  "score": 133,
                  "content": "I'm glad you know your Dad has your back",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Same. I was 17 the first time I gave birth and it would have been awful if my mom wouldn’t had been there with me.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 346,
              "content": "Please don't listen to the Y-T-As. Those people think you should have a fairy godparent ready at all times in case of unexpected emergencies. You did everything right! NTA!",
              "id": 150,
              "comments": [
                {
                  "score": 90,
                  "content": "Yeah those people don't understand you can't just call up childcare on Doordash.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "[removed]",
              "id": 152,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 379,
      "content": "NTA.The birth of a human is one of the situations that can definitely be defined as an ‘emergency’.\n\nThis is a one off situation. Your twenty? year old (practically a child herself) kid is having your first grandchild…! Of course you aren’t going to be wrangling 12y olds in the midst of that. BUT… can you pick them up for hte second half of the weekend and they spend some time with their new niece/nephew?\n\nAssure the twins’ mother you’ll do the same for them when they have their first child - drop everything and look after them on that day too.\n\nBTW… Congratulations Grandpop!",
      "id": 153,
      "comments": [
        {
          "score": 353,
          "content": "my oldest daughter is 17, a lot of people are assuming she’s older even tho I put her age in the post.",
          "id": 154,
          "comments": [
            {
              "score": 106,
              "content": "I had to read your post twice to ascertain her age, I read it as you and your wife being 17 when she was born",
              "id": 155,
              "comments": [
                {
                  "score": 118,
                  "content": "I fixed it!",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "That’s how it read to me.   \n\n\nI originally said about her being 17 and a kid… and then thought ‘hang on’ and re read, and thought ‘Hrm math says..20ish’.   \nI don’t think 17 or 20 makes a huge difference. This is a kid who needs support. A young adult, or late teen.",
                  "id": 157,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 73,
          "content": "And thank you",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}