{
  "post content": "I feel like an a**hole, but I wanted to post this anyway as I’m hoping other people can bring me to my senses.\n\nI live in Texas and this week we got hit with major winter weather.  Texas rarely sees snow and when it does, it’s barely an inch.  Last night, however, was BAD.  Snow and ice blanketed EVERYTHING.  Weather stations are saying that the last time Texas saw this kind of weather was in 1989.\n\nI work at a resort restaurant and my boss was insistent I came to work yesterday despite knowing the weather would get bad and I’d likely be trapped.  My dad dropped me off as he didn’t trust me to drive on the ice so I was stranded.  The resort offered a free room, but I’d have to work the next day in return, which was my day off.  I was frustrated but got over it, until today when I learned I’d have to stay AGAIN because the roads are too slick.  Meanwhile, my boss got his days off.\n\nI’m just a bit frustrated and to let off steam, I’ve been ranting to my parents about everything.  They got angry and told me that “this is an emergency” and that at least my resort has power and heating while they’ve lost theirs a few times.  I was told to get over it and accept that yes, I’ll lose both my days off, but at least I’m safe.  A big part of me knows their right but I still find myself ranting about it anyway, even though I know nothing will come of it.  And what would I even do at home anyway?  Play video games?  I’d be more productive here, right?\n\nI know I’m likely the bad one here and I’m ready to accept that.  I have the tendencies to focus more on negatives than positives and I thought maybe some outsiders could slap some sense into me and help me see something that I can’t.  I know I’m safe, but I’m just frustrated. \n\nHave at it y’all.",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "NAH. Everyone's situation sucks. Yeah, probably their's is objectively worse, but that doesn't make your situation good by any measure. Less sucky is still sucky. They have rolling black outs, but also presumably blankets, choice of food, theur hobbies. and clean underwear. You have access to power but need to work three days in a row without any of your stuff.",
      "id": 2,
      "comments": [
        {
          "score": 4,
          "content": "Thank you for understanding.  I was actually warned beforehand that this might happen so I came prepared with clothes and toiletries.  I didn’t expect it would get THIS bad though and force me to stay for two days instead of just one.      But a lesson I took from this is to be a bit more careful and considerate of weather like this.  It’s supposed to get better enough to drive tomorrow but on Wednesday, it’s going to drop again and possibly snow again.  If that’s the case, I’m going to be smart like my co-workers and call in because I don’t want to risk the same situation happening again.",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "One thing to think about - you know the situation now. If its going to happen again, you can be better prepared. As others have pointed out, its not like being at home would be so great anyway. Being the employee that's there in a pinch is a great way to work up to raises, promotions, and excellent references. And that last one is big. You sound young - establishing yourself now as a team player, hard worker, someone who shows up can really help down the line. You don't know where you will be in 10, 25 years *or where your managers will be*. You could be 8 jobs later and have your history help you out.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH. I agree with the top commenter, this sucks for everyone. :(",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "Your assessment is correct.  YTA.  You are safe, warm, and likely fed.  Stop complaining and when you get home thank your father for driving you to work and listen to their experience of the storm.  Say something nice to your boss about letting you stay at the resort. (Edit formatting error)",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. It sucks for everyone. I can understand them getting frustrated listening to you complain, but I don't think you're in the wrong for complaining about being stranded at work.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH, you're allowed to be frustrated",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "The mildest of ESH here.\n\nIt’s like the circle of grief - you can vent about this, but not to them. Likewise, as your parents, they should have understood it was just mindless venting, asked you to find someone else to vent about this particular thing at this particular time, and you respect the request.\n\nBut everyone was stressed out, so I feel this should be a “learn and move on” situation, myself.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "This resort is shady af. They made you come in, knowing you'd be stranded. Then offered you a place to stay where they stranded you only *if* you work for free the next day? That can't be legal.\n\nI'd be reporting them to the Better Business Bureau if I were you...",
      "id": 10,
      "comments": [
        {
          "score": 2,
          "content": "This is what I was thinking! I grew up in the UK and I’m sure that if I got stranded working at a hotel because they insisted I came in to work the room would be free as long as there were rooms to be had. I’m shocked that they would insist you gave up your right to a day off. I mean it’s not like if it got to the point of you staying that they would be able to rent the room out anyway.  NTA",
          "id": 11,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "To be honest, they kind of had a point.  Our restaurant is the main one in the resort so we couldn’t really close it and leave the guests without food.  Plus no one would want to drive to work in the weather we have, so it makes sense they would ask the employees they housed to work, regardless of their day off because who else would they have?  It’s frustrating, but I guess it’s best to use the tools you have when they’re there.  \n\nMy boss’s boss assured me I’d get extra time off to make up for it anyway.  \n\nBut my boss is who I’m more frustrated with.  He knew about how far away I lived, the weather, and that I’d likely be stranded, but still told me I needed to come in.  No hesitation or choice.  When I found out the next day that he had actually chosen to go home in the middle of the storm rather than stay with us, it bugged me a lot.  I at least hope that all the workers who were stranded are honored when all is said and done.  Just a thank you so we know that what we did meant a lot.  This is something new for a lot of us.  Snow doesn’t come like this often.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I feel that I’m being insensitive towards my parents by complaining about my situation rather than accepting it and moving on.  I know that they’ve had issues with their power and heating while my workplace has only had several second blackouts every few minutes that don’t last for long.  I think I might be unintentionally shaming my parents for not coming to pick me up.  I’m hoping outsiders can slap some sense into my stubborn self.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI feel like an a**hole, but I wanted to post this anyway as I’m hoping other people can bring me to my senses.\n\nI live in Texas and this week we got hit with major winter weather.  Texas rarely sees snow and when it does, it’s barely an inch.  Last night, however, was BAD.  Snow and ice blanketed EVERYTHING.  Weather stations are saying that the last time Texas saw this kind of weather was in 1989.\n\nI work at a resort restaurant and my boss was insistent I came to work yesterday despite knowing the weather would get bad and I’d likely be trapped.  My dad dropped me off as he didn’t trust me to drive on the ice so I was stranded.  The resort offered a free room, but I’d have to work the next day in return, which was my day off.  I was frustrated but got over it, until today when I learned I’d have to stay AGAIN because the roads are too slick.  Meanwhile, my boss got his days off.\n\nI’m just a bit frustrated and to let off steam, I’ve been ranting to my parents about everything.  They got angry and told me that “this is an emergency” and that at least my resort has power and heating while they’ve lost theirs a few times.  I was told to get over it and accept that yes, I’ll lose both my days off, but at least I’m safe.  A big part of me knows their right but I still find myself ranting about it anyway, even though I know nothing will come of it.  And what would I even do at home anyway?  Play video games?  I’d be more productive here, right?\n\nI know I’m likely the bad one here and I’m ready to accept that.  I have the tendencies to focus more on negatives than positives and I thought maybe some outsiders could slap some sense into me and help me see something that I can’t.  I know I’m safe, but I’m just frustrated. \n\nHave at it y’all.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "YTA. You likely wouldn't be doing much of anything at home. Most of what I've heard from Texas has been a constant state of on and off blackouts. My parents are in Southern Texas right now and were without power in 20 degree weather for 12 hours. You wouldn't be playing video games unless they're on your phone or a Switch, and you wouldn't be doing that once your batteries died.",
      "id": 15,
      "comments": [],
      "relation": "No"
    }
  ]
}