{
  "post content": "Disclaimer: English is not my first language so expect some grammatical error.\n\nI, 24F, is in a relationship with my boyfriend 29M. We are in a healthy relationship and I know the existence of his daughter from his ex. I still accepted him and love him unconditionally despite all of that. By the way, I’m still in college finishing my second college diploma, single and has a part time job. Given that, I promise to compromise with him since I know he is giving financial support to his daughter for her daily needs like formula milk, diapers and emergencies. I keep understanding his situation despite all of that because I love both them. On the side note, his cheating ex left her daughter and my boyfriend during the 4-month of the child leaving my boyfriend heartbroken and nothing. My boyfriend’s family raised his daughter with no trace from the girl for the first 2 years. My boyfriend even persuaded his ex before to get back together for the sake of their family which the ex refused. Over the past few years, my boyfriend was in a relationship already with some females and this ex kept bugging and begging him to get back together which my boyfriend declined. Last year, the girl decided to take their daughter and ask money from my boyfriend for his financial support to the child. At first, I don’t care how much money he gives since I’m the one providing for us two. But I noticed from the past few months that the ex was asking more than twice than the supposed “financial support”. They didn’t have a written agreement about this and it’s too expensive to hire a lawyer from my country. We don’t have much paternal rights or courts to support this claim. Apparently, this ex has vices too like smoking and drinking. On top of that, she doesn’t have work and we don’t know why. I was so mad about this and told him to stop sending money to his ex and just send groceries. I even offered to pay for the child’s insurance in case of emergencies which the girl refuses since “it will not help them”. From this day onwards, the ex blocked my boyfriend together with his family and refuses to communicate nor give my boyfriend his visiting rights to the child. So, I am the a$$hole for banning my boyfriend from sending money to his daughter?\n\nEDIT: it’s been a while since I haven’t read what you guys thought. Anyway, I forgot to mention that the baby mama has been in a relationship too with a single dad of 3 kids. They have been compromising my boyfriend’s child and keep asking money from my boyfriend.\n\nUPDATE: Ever since we have stopped giving her money for 1 month, she left their child again with my boyfriend because she can’t afford to pay for anything now. We may suck for y’all but we don’t think she deserves any money from us. Again, we are not from United States and we don’t have financial agreement about this and she stopped my boyfriend’s visiting rights for 3-4 months. We asked his daughter what happened during her stay at her mom’s place and she keeps telling us that her mom will spank her anytime and showed us a lot of bruises. The child was brought by the baby mama’s sister in my boyfriend’s house. We have no contact with the mom because she doesn’t want to give her address. It maybe a messed up situation but I’m thankful for all your thoughts.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I am an asshole for banning my boyfriend from sending financial support to his daughter through his ex and now, he is suffering because he chose me over his daughter.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 2 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again/)*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO: Why is a 3 year old still drinking formula?",
      "id": 3,
      "comments": [
        {
          "score": 1,
          "content": "Same thoughts. But that’s what the baby mama is asking for. Each week she will have an excuse to ask money from my boyfriend.",
          "id": 4,
          "comments": [
            {
              "score": 1,
              "content": "Because she’s RAISING HIS CHILD ALONE.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Why would a good man let his ex take his daughter after she abandoned her for two years?\n\nAnd why would you date a man like that?\n\nESH",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "Because in my country, children below 7 years old should be in a sole custody of the mother.",
          "id": 7,
          "comments": [
            {
              "score": 1,
              "content": "That may be true, but a father should still be financially supporting their child.",
              "id": 8,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "[deleted]",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "Yes we can see that",
              "id": 10,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Stoped reading at “I love him dispite the existence of his daughter and ex”. YTA",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "Ya that’s one big condition for “unconditional” love. \n\nAnd when he gets her pregnant and moves on to the next woman she’s gonna freak out when he won’t help support that child also.",
          "id": 12,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Info: does your bf have his own source of income?",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "He has his full time job and warehouse supervisor.",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "Ok then.  As long as he is contributing from his income, you have no say over how much he should or can give to his ex.\n\nYTA",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA.   100%.   Your behaviour is legendary evil step parent shit.    Do you kick puppies and drown kittens too?  \n   \n   Seriously, you want to stop a parent from contributing to their child's general stability and wellbeing and you have to ask AITA?    YES.  YTA 1 000 000 000 times over.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Did you even read the whole stuff? I said that we are willing to provide but instead of money, we will give groceries and pay for the child’s health insurance. Either way that’s where the money will go for right? But instead the baby mama declined our offer since “it will not help both of them”.",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "If she is taking care of her daughter, your boyfriend has to pay child support. That‘s not rice, bananas and flour but actual money. Why would you have a say in what she gets from the money? If your bf feels like she is an unfit parent, he should get CPS involved. However, I do not see how any of this is your business.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "  Yeah I read it and I call bullshit on your my poor bf and me story. .    \n   \n  What you're doing is controlling how the child support gets spent.  If she's unfit, get custody for the kids sake.  \n  \n  Buying someone's groceries, please. You wanna go through the pantry to make sure she doesn't have too much of something you disapprove of or more tins of soup than you think is necessary.  How else will you know what to provide?  \n  \n  Paying for health insurance, how about helping out a roof over the child's head?  School stuff for when they're old enough?  Daycare so mum can go work?  \n  \n  How bout your bf just pays some money to raise his kid.  Cause guess what, kids take a fk tonne more than any child support assessment allows for. \n  \n  Surprise!  Kids need feeding every day, not just once a month when child support arrives.  They need clothes and haircuts and go to birthday parties and need shoes because the little beggars grow like grass in spring they need schooling and excursions and take lessons and need tutors and have illnesses and disabilities that require treatment the need medication and things your precious insurance won't pay for. \n  \n  Your words paint a picture of you that ain't pretty.  You want to control your bfs child support and degrade this child's mother from the outset.   \n  \n  As for where the money will go, nope none of your business. You are the current gf.  Your opinion means jack shit.  He's the dad for LIFE.  Put yourself in the kids shoes, or the mums for one minute.  You ever met the mum, or just heard about her. How would You like to be treated in her shoes?  Would You like to be able to spend child support as you saw fit for your child?",
              "id": 19,
              "comments": [
                {
                  "score": 1,
                  "content": "She is a foreigner in a underdeveloped country. All I’m saying is that the Norm there is probably different then what you and I are used to. OP also posted that in her country the mother is granted parental rights for children under 7. While I don’t think it’s OPs business what her BF spends his money on and BF should be supporting his child. ESH",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "She probably gets food stamps. She needs money for heat and a house for the baby",
              "id": 21,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "She has formula milk at 3 years old??? And females?? I'm a man, but even me cringed at this word. He sounds like a bum honestly. And you sound equally bad. Nothing of this sounds like a healthy relationship.",
      "id": 22,
      "comments": [
        {
          "score": 1,
          "content": "He’s been in relationships after they broke up. Is he not allowed to move on after?",
          "id": 23,
          "comments": [
            {
              "score": 1,
              "content": "That's not what i was talking about.",
              "id": 24,
              "comments": [
                {
                  "score": 1,
                  "content": "I’m talking about the “females”. And the formula milk is the concern of the baby mama. Who are we to question her?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I cringed at you using the word, not at him being in other relationships. \n\n>And the formula milk is the concern of the baby mama. Who are we to question her?\n\nWell, your bf is ... idk, the FATHER?? At 3yo, a child should eat normal food, not milk formula.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "INFO - you're a bit hard to understand.  Are you saying that YOU are paying for him to send money to his daughter or is he using his own money?",
      "id": 27,
      "comments": [
        {
          "score": 1,
          "content": "He is using his money. He has a full time job and he’s been supporting his daughter monetary. What I mean by “providing for us” is when he is short of budget or funds, I offer to buy groceries. We live separately and I’m only paying for my phone bill and rent.",
          "id": 28,
          "comments": [
            {
              "score": 1,
              "content": "Then YTA.  It's his kid and his money, this is truly none of your business.  You aren't even living together.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Yea, YTA. That child was your boyfriends responsibility before you two got together, is still your boyfriends responsibility while youre together, and will continue to be your boyfriends responsibility no matter what. Shouldnt you be happy to know that youre with someone that cares about their kid?? Lets think about it this way, OP, if his ex does smoke and drink, shes spending money on those things regardless of whether he is sending money or not. She isnt going to stop just because he does, but she will have less money to support the child with. By “banning” your boyfriend from sending money you have also taken away his ability to see his child and you are taking away that a father away from a child. Also, did you even ask why shes requesting more child support or did you just get mad and tell him to stop?",
      "id": 30,
      "comments": [
        {
          "score": 1,
          "content": "We offered to buy groceries and health insurance instead of money. Either way that’s where the money will go right? But the baby mama declined our offered since “they will not benefit from it”.",
          "id": 31,
          "comments": [
            {
              "score": 1,
              "content": "You do realize that a toddler needs MUCH MORE than groceries and health insurance, right?",
              "id": 32,
              "comments": [
                {
                  "score": 1,
                  "content": "No because she’s an ignorant child.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "He should be covering the child’s insurance anyway seeing he’s the father. Also I’m sure your boyfriend knows this money isn’t for his child he just doesn’t care because like you said he tried convincing her to get back with him. YTA but I’m sorry because it seems like you’re getting played",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "ESH.\n\nI cannot believe you all are in your 20's. You all suck and only thinking about your own damn selves.\n\nAnd sounds like you're trying to convince yourself that everything is good in the relation more than anything else.",
      "id": 35,
      "comments": [
        {
          "score": 1,
          "content": "My boyfriend did regret his 20s and it sucks that everything is too late now. As long as he his doing his duties and responsibilities, I have no problem about that. I am single and have no responsibility in life. I love him more than anything else and I think that’s what matter the most not just our age.",
          "id": 36,
          "comments": [
            {
              "score": 1,
              "content": "He ain't doing nothing. \n\nHe let his ex take his child after raising her for the first two years of her life. \n\nHe's dating a woman who doesn't want him to give to support his child. \n\nHis kid is 3 and I'm pretty sure he hasn't been saving to get a lawyer to get a court order and make sure to have the right to see his daughter.\n\nYou are so immature, it's scary to imagine that two out of the three of you are in charge of raising a child.",
              "id": 37,
              "comments": [
                {
                  "score": 1,
                  "content": "He didn't raise her the first two years. He foisted his responsibility off onto his mommy and daddy. The post says his parents raised her while he did......nothing?????\n\nQuite frankly. That child is deserving of support and he is legally compelled to pay. He failed his child by passing her off not once but twice and never pursuing physical custody but leaving it to his parents to do his hard work for him and then his ex. They are both bad parents. Where were they for TWO FUCKING YEARS? And the new girlfriend has no place in any of this and is waaaaay overstepping boundries. Not her place. At all. Not her kid. She makes no decisions financial or otherwise about it.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Sounds like she is the one paying...not him.  That should stop.  He needs to pay",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Facts. ESH except for SO's daughter.",
          "id": 40,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}