{
  "post content": " My cousin is very famous. Yes, you have heard of him, and no, I won't tell you who he is. We'll call him Terry.\n\nWhen we have family functions (mainly for holidays), Terry likes for them to be only family so he can \"be himself\" and get drunk and pass out on the couch and share Hollywood gossip with us, otherwise he feels like he is being interviewed and having everyone talk to him or want a picture and he has to \"be in promo mode.\"  He said it's because he was tired of having to meet strangers and not be able to let loose and there were some issues of these partners taking pics of him or spreading gossip.\n\nI hated this at first because I would be dating some chick and she would want to get to meet him and it's awkward to tell them they can't come to family events and they get mad that they never get to meet him (my tinder has a pic of me with Terry). But I get it so I was fine with it. Until this year.\n\nI began dating this chick in August. I couldnt bring her to Thanksgiving, fine. But when I walk in, I see another cousin, \"Danielle\", has brought her boyfriend \"Steve\" EVEN THOUGH they've been together for less than a year!!! They got together over New Years and engaged on Halloween. \n\nTerry was fine with this because he's met Steve before (old family friend) even though I've been told that no exceptions are allowed to his rule. Thanksgiving sucked because the whole time I was mad that I once again wasn't allowed to bring my gf.\n\nMy gf consoled me after and I realized that she is my soulmate. Two weeks ago, I proposed and we got engaged.\n\nXmas was at my aunt's. Im a believer in \"ask for forgiveness, not permission\" so I brought my fiancée because she had nowhere else to go and I wanted her to meet my family. We walk into the house and all hell breaks loose. \n\nEveryone was asking who she was and scolding me about the rules, and Terry flipped out. He was already buzzed (and looked 20 pounds heavier than he usually presents himself) and started yelling at me for doing this to him. He didn't seem excited at all about my engagement or willing to introduce himself to her.\n\nOur grandma was telling Terry to get over it and asking to see the ring and saying she wish she had gotten my fiancé a gift, so grandma was on my side. But Terry was still arguing with me and said I shouldn't be allowed at any more events, and he ended up calling an Uber Black and leaving before we even ate. \n\nTo top it all off, my uncle (who has never even liked Terry) got upset because apparently Terry was his Secret Santa so he didn't get a gift, so my uncle started blaming me for ruining Christmas.\n\nI get they are mad but it was clear there was an exception for fiancées and I'm embarrassed that my family was so rude to her when I just didn't want her to be alone on Christmas.\n\nAm I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 7233,
      "content": "YTA.\n\nYou could have ask. You could also not use your famous cousin as a pic on Tinder.\n\n&#x200B;\n\nEdit : went from E S H to Y T A based on new informations.",
      "id": 2,
      "comments": [
        {
          "score": 4986,
          "content": ">twice before. once when i was 19 and an idiot so that didnt work out. then again later on and i thought she was the one but it ended when she sent a story about my cousin to tmz to make a quick buck... hence terry's rule\n\nIt gets worse when you realize that one of the girls he was previously engaged to sent in a story about his cousin to TMZ..",
          "id": 3,
          "comments": [
            {
              "score": 2134,
              "content": "OP has since edited to remove this info. Typical AH",
              "id": 4,
              "comments": [
                {
                  "score": 555,
                  "content": "It's in a comment that he made",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 143,
                  "content": "Hadn't seen that definitely makes this a yta",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 94,
                  "content": "Yep, because OP is, infact, the problem.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1569,
              "content": "So the rule was made FOR op basically. I get that it's not technically OP's fault, it was the girl he brought, but I kinda get why Terry'd be extra upset that op showed up with a girl he doesn't know.\n\nI'm leaning YTA",
              "id": 8,
              "comments": [
                {
                  "score": 690,
                  "content": "I think that it is technically OP's fault and the girl's. OP posted a pic of him with his cousin on his dating app profile, because way more girls match with him when they see that pic. More girls are matching with him bc they want to meet the cousin. Its not surprising that most of the girls that are huge fans would post a pic of the cousin/invade his privacy in some way. \n\nI just want to add, that obviously this isn't to say that only girls don't respect other people's privacy. there are loads of guys who don't either (like OP for instance)",
                  "id": 9,
                  "comments": [
                    {
                      "score": 225,
                      "content": "Not just the profile photo and the TMZ violation (what a scummy \"media organization\").  It's also being \"easier to ask for forgiveness\" *and* for wrongly inferring and still asserting a loophole for fiancees in a rule that was made *because* of *OP's* ex-fiancee!\n\nIt's hard to think of Terry as TA knowing the context.\n\nThe comment: https://www.reddit.com/r/AmItheAsshole/comments/kksczv/comment/gh4j693?context=1",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "ah, that changes things entirely, then.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 424,
              "content": "i was going to say that OP is probably the ENTIRE reason for Terry's rule, seeing as he uses pictures with him to get dates and obviously those dates are going to want to meet terry and fangirl and shit and no one wants to deal with that at family gatherings. little did i know he doesn't just bring around fangirls, he brings around scum looking to make a buck off his cousin and literally this is the entire fucking reason why he has the rule. it KINDA sucks of terry to allow one fiancé but not another but it's HIS rule and he knew the cousin's fiancé as an old family friend so he knew the guy was cool AND he didn't even know OP was engaged!!!! so OP was mad his fiancé couldn't come and another could, knowing that no one in the family knew of their status change. so honestly I'm gonna go with YTA for OP because Terry literally has these rules solely for OP and his bullshitery  \n\n\nEDIT: Terry if you happen upon this thread somehow, it's time to demand to the family that OP not be invited at all to gatherings so you can relax and not worry. you deserve the peace of mind",
              "id": 12,
              "comments": [
                {
                  "score": 116,
                  "content": ">it KINDA sucks of terry to allow one fiancé but not another\n\nExcept that he already knows this Steve guy and presumably trusts him.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 39,
                      "content": "you probably should have read the rest of my sentence",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 387,
              "content": "AND his new \"chick\" that he's been dating for only a few months is an Instagram influencer who are of course known for valuing privacy above all else...",
              "id": 15,
              "comments": [
                {
                  "score": 265,
                  "content": "The 'chick' thing made me lean into YTA territory because 'chick'? Really? Is this 1973? I just feel like OP has a lack of respect for people in general. Using a photo with his cousin in it seems awfully manipulative too.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 122,
                      "content": "This is his third engagement. Clearly he's not mature enough to take relationships seriously.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "exactly what i said. Yta for calling girls chicks... all the info i need sorry if that makes me ta",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Hey man, that chick is his soulmate /s",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "ah I didn't see that comment..wow",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "I was almost ready to say Terry would just have to accept a certain amount of reasonable accommodation for serious partners of family members, but this info goes a long way toward explaining his reaction.  Honestly, I never really thought about this side of being famous.  It really is basically a prison, isn't it?",
              "id": 21,
              "comments": [
                {
                  "score": 149,
                  "content": ">It really is basically a prison, isn't it?\n\nTerry's own cousin uses a picture of them together to bait \"chicks\" on Tinder. Op brought one \"fiance\" to a family gathering who then sold a story to TMZ. Now he brings a second one who \"only asked a few times\" for a picture with Terry. Clearly op is both the asshole and the problem here.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 42,
                      "content": "OP probably proposes to every chick he dates.\n\nYikes.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "It truly can be a prison - you've got all the money you'd ever need (presumably) but you can't do anything cool with it because you need to have security around you, or if you're *really* famous, people will just swarm all around you and ruin the experience anyway. \n\nI think that some celebrities must be happy about having to wear masks right now - a mask with a hat with a brim allows them a little anonymity that they didn't previously have.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Bet Terry’s paying for everyone too",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "Yikes. Between that comment, the tinder profile where he uses his famous cousin to hook up, and the \"asking forgiveness instead of permission\" bit, I'm actually thinking OP is TA here. He should've at least tried to schedule a meeting between Terry and his fiancée ahead of time like Danielle did.",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 274,
          "content": "Put then how would OP bait the hook for his next mark... I mean girlfriend?\n\n/s",
          "id": 27,
          "comments": [
            {
              "score": 56,
              "content": "You mean chick.",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 258,
          "content": "Haha, I agree! The tinder pic was so lame!!! That would not impress me and I think you should be weary of dating people that will be impressed by that.\n\nOther than that, she will be his wife so I don't think Terry can say she can't be there any more.",
          "id": 29,
          "comments": [
            {
              "score": 582,
              "content": "Will she? He's known her for less than six months, and he's had two previous broken engagements before this, one of which involved the fiancee selling Terry info to tabloids. His 'revelation' that he loved her came directly from him feeling angry he couldn't bring her to Thanksgiving. He refers to her as 'this chick'.\n\nI'm not sure the auspices are in favor here.",
              "id": 30,
              "comments": [
                {
                  "score": 142,
                  "content": "Sounds like a typical hollyweird family. \n\n\nGetting engaged after 2 months of dating to piss off your famous cousin. I honestly think OP has some jealousy issues",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 53,
                  "content": "That's fair! I skimmed over the 2 broken engagements. Yikes. This doesn't look very good.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 16,
                      "content": "OP buried it in the comments so it was intentional that you didn’t realize lol",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "It sounds rather like he proposed just so that she would be his fiancee at Christmas so that he could get around the rule.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Oh yeah, gonna take a wild guess and say OP isn't gonna marry this \"chick\" and will have yet another new fiancee in a few months.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 50,
              "content": "I know this one has gotten common, but pretty sure you mean wary.  Wary = cautious.  Weary = tired.",
              "id": 36,
              "comments": [
                {
                  "score": 3,
                  "content": "In this instance, it should very much be both.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Good catch! I'd be tired and cautious of dating someone like that 😊 But I did mean cautious.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "I once matched with someone who had a photo of him with Alice Cooper (bumped into him in the street in Melbourne when Alice was touring) and I thought that was absolutely awesome! Dude was an absolute douche canoe, but I can't fault the photo choice!",
              "id": 39,
              "comments": [
                {
                  "score": 2,
                  "content": "Ha! When I was a young teen I took a photo of my (older) sister with some weird guy she was fan girling over on chapel st. Apparently I was eye rolling and being a general brat and declined my own photo... only as an adult did I realize it was Alice Cooper - apparently he was super chill about it and found the whole thing pretty funny",
                  "id": 40,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Hahaha that's awesome! When I was a kid and I hadn't heard any of his songs, only his name, my older sister had a poster of him. The first words out of my mouth were \"Alice Cooper looks like a MAN!!!\" Coz you know, Alice is a girl's name and all......",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "This. It’s Scott’s Tots cringey.",
          "id": 42,
          "comments": [
            {
              "score": 4,
              "content": "Not Scott’s Tots 😂",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "OP uses his cousins pictures to lure women into relationships with him",
          "id": 44,
          "comments": [
            {
              "score": 181,
              "content": "You can tell how much he respects women when he refers to them as chicks.",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "It's telling that he wants to bring them to meet Terry, not meet his family.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 235,
          "content": "I agree, but really think it should be YTA. Maybe Terry would be TA if OP had asked and Terry attempted to enforce the rules—in that case, it would be Terry’s issue, so if he’s uncomfortable he should stay home. But OP didn’t even give him the chance to do that. And I bet dollars to donuts OP didn’t warn him because the whole point was to get his fiancé to meet Terry—he’d have to be unbelievably dense to sincerely think the same rules that apply to an old family friend apply to a girl he still occasionally refers to as “this chick.”\n\nWith all that going on, I’d be pissed too, especially with the context of OP’s past relationships and this whole “let’s get engaged so you can meet Terry” vibe he’s got going on.",
          "id": 47,
          "comments": [
            {
              "score": 39,
              "content": "Terry is in no way an asshole here. Op said in a comment he previously brought a fiance who sold a story about Terry to TMZ. Op is the reason the rule exists in the first place. And Terry already knew and trusted Steve, so it's a completely different situation. Op was pulling a fast one and it backfired.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "When I used to go on dating apps, so many guys would have pictures of celebrities or reality stars and personally it was such a huge turnoff. I figured it was the same kind of situation like OP's in that they wanted more right swipes than a quality person to talk to. Dont even get me started on people who only use group photos for their pictures lol.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "I almost want to say AH just for the ask for forgiveness crap. That’s a justification people make for acting like assholes because it works, and when it doesn’t work they double down.",
          "id": 50,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "Agreed. \n\nI was originally imagining Terry Crews, but I cant imagine him acting like that...",
          "id": 51,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "You are in no way indicating why everyone sucks here. \n\nThis should be a YTA vote.",
          "id": 52,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3327,
      "content": "YTA - the two situations weren't the same.  Your cousin knew the other person unlike your GF.\n\nGetting engaged that quickly is also shady af.\n\nIf you don't like the rules don't go.  Spend the Xmas with your new fiance.\n\nYour wrecked Christmas because of a tantrum and games.  And your cousin knows not to trust your judgement because you sell your link to him - you don't add to his privacy,  you resent you can't use it to your benefit. \n\nGive a serious apology.   You were bang out of order.",
      "id": 53,
      "comments": [
        {
          "score": 732,
          "content": "Getting engaged that quickly and then not telling the family about it at all (most of them didn’t even know who she was?) makes it seem like the point of the engagement was to get back at family",
          "id": 54,
          "comments": [
            {
              "score": 669,
              "content": "Calling his fiancée \"this chick\" isn't a good look, either.",
              "id": 55,
              "comments": [
                {
                  "score": 178,
                  "content": "I cringed so hard when I saw OP write that",
                  "id": 56,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Same",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 233,
              "content": "My money says OP \"got engaged\" because he figured he could call double standards if \"this chick\" were his fiancé, since the cousin got to bring their fiancé. Seems he has no issue calling off engagements.",
              "id": 58,
              "comments": [
                {
                  "score": 49,
                  "content": "Ding ding ding. We have a winner. \"I can't bring my girlfriend so I'll just make her my fiance and no one will object when I bring her\".",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Agreed",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "> not telling the family about it\n\nThat's the really fucked thing, also how shitty must she feel?",
              "id": 61,
              "comments": [
                {
                  "score": 2,
                  "content": "Right? No one is thinking bout how embarrassed that poor girl is, especially if she's not a fangirl.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -319,
          "content": "Um, no. No one should have to leave their fiance on Christmas because your celebrity relative dictates all the rules for everyone else and all the family gatherings. Sounds like a Kardashian given how spoiled and entitled this person is.",
          "id": 63,
          "comments": [
            {
              "score": 414,
              "content": "This dude's ex sold a story about Terry to TMZ. He thought that girl was \"the one\" until she did that.\n\nAnd now he's proposed to his girlfriend of a few months cause she's the one.\n\nTerry sounds like an unreasonable dick. But it sounds like he was given a good reason to be an unreasonable dick.",
              "id": 64,
              "comments": [
                {
                  "score": 109,
                  "content": "Well d****, I missed that part! Ok, I can kind of see it now.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": "I don't think Terry is unreasonable. OP was basically on family event probation. He isn't trustworthy, getting an unknown fiancee after only some months doesn't change that.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 120,
              "content": "He didn't have to leave his fiancee on Christmas. He just had to not bring her to that particular gathering. He could have spent the day with just the 2 of them, or with other people, or they could have hosted their own gathering.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "OP here literally uses a picture of Terry on his Tinder profile.",
              "id": 68,
              "comments": [
                {
                  "score": 29,
                  "content": "Why does he even have a tinder if he has a fiancee?",
                  "id": 69,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I was giving him the benefit of the doubt and assuming it was down now, but apparently this is the third fiancee he's had and the second one literally went to TMZ, so....",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "he’s been engaged twice before, and one of those engagements broke because she sold a story about terry to TMZ\n\nand he only realized she was “the one” after consoling him for throwing his tantrum after not being able to exploit his cousins star power and no one else in the family had even met her\n\nand he calls her “this chick” which...wow. \n\nTerry is a little entitled yeah but the rule exists for OP and he should stop being invited to stuff",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2231,
      "content": "[deleted]",
      "id": 72,
      "comments": [
        {
          "score": 2954,
          "content": "And, according to his comments on this thread, this is his *third* time being engaged. As it turns out, his last fiancée sold a story to TMZ about Terry, which is the whole reason why this \"only family at family gatherings\" rule exists in the first place. Just some very relevant information OP forgot to mention in his post.",
          "id": 73,
          "comments": [
            {
              "score": 343,
              "content": "Also, he has his famous cousin in his Tinder pic with him. He knows what sort of crowd he's going to attract with that.",
              "id": 74,
              "comments": [
                {
                  "score": 88,
                  "content": "Note that the whole tinder profile part is in the present (\"my profile HAS a picture with him\").",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 81,
              "content": "Well, when you use a pic of you with your famous relative on a dating site, I'd assume there is a risk of attracting people who just contact you to eventually get in contact with celebrity relative.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "The only last info I need is whether OP keeps proposing with the same ring.",
              "id": 77,
              "comments": [
                {
                  "score": 3,
                  "content": "OMG I didn't even think about this--THREE proposals already. And the dude's clearly still young. Imagine planning your THIRD proposal and it's to a person you've only known for a few months. Zero thought given to breaking this streak.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "straight people get engaged as like a fun treat to themselves, it's usually not serious",
              "id": 79,
              "comments": [
                {
                  "score": 6,
                  "content": "I was just about to say: \"Hey now! Is that fair?\" But then several of my straight friends who have been engaged multiple times came to mind, and I'm like \"Yeah, that's fair.\" I guess us gays are a bit more discerning. ;)\n\nEdit: Happy Cake Day!!",
                  "id": 80,
                  "comments": [
                    {
                      "score": 3,
                      "content": "thank you!\n\nyeah most straight people i know have gone through an engagement or two before getting married. it's honestly kind of exhausting. i personally just got married earlier this month but i was engaged for almost three years and we've been together for 7 so it wasn't like a fast thing",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 772,
          "content": "Didn't you read? She's his *soulmate!*\n\n/s",
          "id": 82,
          "comments": [
            {
              "score": 434,
              "content": "Because she was sad about not meeting his famous cousin at Thanksgiving.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 352,
              "content": "Soulmate number three",
              "id": 84,
              "comments": [
                {
                  "score": 145,
                  "content": "By April we'll meet soulmate #4",
                  "id": 85,
                  "comments": [
                    {
                      "score": 210,
                      "content": "A little bit of Monica in my life\nA little bit of Erica by my side...\n\nSOULMATE NUMBER FIVE",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "Who ever said we can only have one soulmate? Gotta catch them all!!",
                  "id": 87,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think op is mistaking soulmates for pokemon",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Does that mean we can only have six at a time then?",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 141,
              "content": "Whom he refers to as a *chick*. Gross.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 504,
          "content": "And still refers to her as “this chick”. Maybe it’s cultural, but I don’t know anybody who refers to their “soulmate” like that. Read as disrespectful/dismissive to me.",
          "id": 91,
          "comments": [
            {
              "score": 190,
              "content": "It might be the Californian in me but referring to your \"soulmate\" as \"this chick\" means she's just some random girl he barely cares to talk about.",
              "id": 92,
              "comments": [
                {
                  "score": 50,
                  "content": "It’s probably the Midwestern in me but “this chick” usually how we offensively refer to a woman or describe a random woman. Never a friend or gf.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 39,
                      "content": "I’m Californian, I’d say it isn’t necessarily offensive but it tends to be kinda derisive/dismissive.  Eg, “I was waiting in line, and this chick just tries to cut right in front of me”.",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Your definition has the same meaning everywhere.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I was thinking the exact same thing.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I could imagine myself being so crass about someone I care about, only if the connection was so strong it was obviously an understatement. Like calling my bf that I live with and talk about marriage with my “roommate”",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 94,
          "content": "Yeah that is weird",
          "id": 98,
          "comments": [
            {
              "score": 440,
              "content": "Plus he says that the picture of him and Terry “is my tinder photo”. Not was, is.",
              "id": 99,
              "comments": [
                {
                  "score": 235,
                  "content": "And he “started dating this chick in August”. If my fiancé talked about me like that he’d be at the curb.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Then again group photos isn't shocking. Mainly because this person is famous \"Oh they must've met at some place\". You wouldn't think \"oh yeah related\"",
                  "id": 101,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Quick fact - if the girl doesn't cringe or laugh at your photo with a celebrity on tinder/dating app... then the girl is hoping to meet them through you.\n\nEdit: switched words to what I meant",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 72,
                      "content": "Yes but to have a tinder when you are engaged?",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Knowing this dude - he probably like - just uses it as a chat opener. \"Yea that's me and my FamousCousin\"",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "They only go with OP because of his cousin, seems pretty obvious...",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -31,
          "content": "I knew I wanted to spend the rest of my life with my wife at that point. Hell I have a friend that didn’t even want to wait that long.",
          "id": 106,
          "comments": [
            {
              "score": 68,
              "content": "I never get that . You still can spend your life with them . You don’t have to get engaged the second you realise you really like someone lol",
              "id": 107,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah my friend doesn’t want to get engaged or married right now either, possibly ever, but he knew that he wanted to spend his life with her that soon. Lifetime commitments don’t need to come with a ring. I’m just saying that sometimes people know that quickly.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Look I’m 13 years in and neither of us plan on proposing any time soon/ever :P but I did move in with my partner after only dating for a couple of months. I don’t really judge people for shotgun engagements, giving someone a ring is literally less effort and commitment than signing a lease together and combing all your shit, haha.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Wow.... my brain read that as your age being 13 and I was concerned for a minute lol",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "The part that's making me raise my eyebrows there isn't the fast engagement, but how he criticized another family member for getting engaged and bringing the fiance to Thanksgiving, and that couple had been together 11 months.  Pretty hypocritical, imo",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -33,
          "content": "I think this situation is weird af \nbut idk how much I can judged because me and my now husband met on tinder, got engaged after 4 months, and married the following year, a total of 1 1/2 years together before the wedding😅",
          "id": 112,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1712,
      "content": "YTA for this - “ Im a believer in \"ask for forgiveness, not permission\"\n\nThat’s an obnoxious way to be.\n\nYou could have spent Christmas just you and your GF, then she wouldn’t have been lonely and you wouldn’t have broken the established rule for family gatherings. There wasn’t an exception for fiancés, there was an exception for Steve.\n\nWhat you do if you want your family to meet your fiancée is you set up your own engagement party. You don’t turn family Christmas into your personal celebration.\n\nIt’s somewhat shady you use a picture of you with your famous cousin on a dating app. Clearly you are using him to attract girlfriends for yourself.",
      "id": 113,
      "comments": [
        {
          "score": 86,
          "content": "Yep. And apparently he is not forgiven here.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "I’d suggest that the very inclusion of this comment indicates OP was well aware it was an A move. You don’t ask for forgiveness for something that is not a transgression.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -103,
          "content": "I dont think that asking for forgiveness instead of permission is necessarily an obnoxious way to be, it depends on context.  In this instance, it was def obnoxious.  Agree on the shady part, just drop the somewhat.",
          "id": 116,
          "comments": [
            {
              "score": 22,
              "content": "Are you not asking for permission due to:  \n\n\nA) You're relying on that others will cave at their own expense so you can get what you want because at that very moment it's easier to roll with it than standing firm  \nor  \nB) You're at your wits end in an awful situation where you're constantly being cornered/groomed/gaslit to appease others at the expense of your wellbeing  \n\n\nThere is absolutely context that can make an \"ask for forgiveness\" situation acceptable, but most of the time it's just used to forcefully get your way and bulldoze over the people in your life",
              "id": 117,
              "comments": [
                {
                  "score": -1,
                  "content": "I've only used it /felt it apply in a professional setting where I was operating slightly outside my responsibilities but was receiving no answers and had to make a decision.  I guess to some degree it could be considered boundary stomping, but I cannot imagine applying the term to interpersonal communication.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes, exactly. I use it in bureaucratic situations, the kind where if you ask you are basically asking the person to take the fall if a higher-up objects. The kind of thing people probably won't object to because it doesn't matter enough to bother so long as you don't put them on the spot. I wish I could think of a good example at the mo. It's been quite awhile.  \n\n\nBut it's for red tape, not for relationships of any kind, including coworkers. Certainly never to spring on your collected family, that's beyond awful.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1252,
      "content": "YTA. The whole reason Terry has this rule is apparently because your ex fiance sold a story about him to TMZ. You already got him burned once and obviously still do not give a fuck. It honestly sounds like you got engaged just to try to bypass the rule, so good luck with **that**",
      "id": 120,
      "comments": [
        {
          "score": 355,
          "content": "Kinda sounds like OP is using his famous cousin to get attention from women. Definitely an asshole move. Celebrities get almost no privacy. I would be mad if I couldn’t be myself around my family because my cousin wants to impress a girl.",
          "id": 121,
          "comments": [
            {
              "score": 2,
              "content": "Came here to say this. Sounds like OP is upset that he can’t use his uncle to get more ‘chicks’.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I was definitely going to point this out. I imagine it gets hard to convince people you have a super famous relative without proving it by bringing them face to face. Photos can be manipulated. So, if he hooks women who are only interested in him because of said famous person, keeping them for any length of time is probably difficult once they realize they will never meet that famous person. Especially because they didn’t get introduced at Thanksgiving. I imagine he also makes it clear on his Tinder that he’s related to this person on his fucking profile, probably listed in the photo caption and his info. Maybe him getting engaged was less because she’s his “soulmate” and more because she wanted to walk because she thought he was lying about shit, so he saw the other engaged couple, and jumped at that excuse to get them face to face, thereby keeping her on the hook. The famous person has every fucking right to be upset. That’s without even taking the TMZ story his ex sold into account. Until OP stops using his cousin for whatever he clout he fucking can, then OP can fucking come to holidays alone. You don’t blatantly use your family like that. It’s like a dude stealing a baby niece or nephew, or a puppy for a day solely to hit on or pick up women. It’s pathetic and sleazy all at the same time. Also, he shouldn’t be surprised when all the women he pulled in strictly because he’s related to a celebrity leave him for the next best thing. They obviously aren’t doing it for him.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "New plan: Terry implements a no OP rule for his parties and everyone else can use their grownup discretion for guests.",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": "[deleted]",
          "id": 125,
          "comments": [
            {
              "score": 8,
              "content": "Of course",
              "id": 126,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 964,
      "content": "YTA. It sounds like this was the first meeting of a fiancè you have been with for very few months.\n\nTrying to compare to the other cousins relationship is pointless, you said it yourself, they have met Terry a few times.\n\nBasically you use his profile pic on Tinder, then wonder why he doesn't want fan girls trying to meet him at family functions...... \n\nYou would rather ask for forgiveness than permission, so decided not to discuss at all?\n\nAt what point would you not be TA?",
      "id": 127,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 887,
      "content": "YTA.\n\nIt is never acceptable to bring someone to a party without informing the host in advance. If you wanted to spring your fiancee on everyone, then the socially-acceptable thing to do would have been to host your own engagement party. Not fuck with everyone's Christmas.\n\nOn top of that, you use Terry's pic to lure \"chicks\" on Tinder and then ruin real Terry's Christmas by ambushing him with one of the \"chicks\" you lured? Gross. No wonder Terry wasn't comfortable.\n\nOn top of THAT, you're too dense to realize that there is no \"fiancee exception\". The other fiance is an old friend of Terry's. So **obviously** that's a different situation.\n\nTake Terry off your Tinder and apologize to your family. You should be ashamed of yourself... but something tells me that you aren't emotionally intelligent enough to be.",
      "id": 128,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 499,
      "content": "YTA\n\n1. You knew it was a rule. Even if they made an exception for Steve (who at Thanksgiving was fiance, not BF, per your timeline) you gave a clear reason why...he was already an old family friend and had met Terry before. Your fiance does not meet that criteria but you brought her anyway.\n\n2. Your fiance may not be a \"fangirl\" in your opinion, but she's asked for pics with Terry before. According to you, you know Terry doesn't want to deal with that at family functions.\n\n3. Your family didn't even know you were engaged and you put them on the spot. And considering this isn't your first engagement and you knew they would be skeptical/less than pleased, you had to have known it wouldn't go over well.\n\n4. By your own admission you use a pic of you with Terry to get matches on Tinder. That's exactly the kind of stuff he doesn't want happening. You're using him solely for your own benefit and I wouldn't be surprised if he doesn't want to have further contact with you after this stunt.\n\nYou could've avoided all the drama and kept your fiance from being alone at Christmas simply by celebrating on your own. But you instead chose to do the one thing you knew was off the table and were the one that put your fiance in that awkward spot. And honestly, it kind of sounds like you were doing it as a payback \"one up\" on your cousin for Thanksgiving.\n\nETA: considering it was one of your previous fiancees who sold info on Terry/was the cause of the rule, you're an even bigger AH than previously thought...both for buying dates with your connection to him, and for bringing your uninvited new fiance to the party. That was a VERY relevant piece of info to leave out.",
      "id": 129,
      "comments": [
        {
          "score": 53,
          "content": "I dont think Terry is the AH here. His uncle sure is though. For terry, his status as a celeb is his livelihood. His job. And for his job, he has present himself well. So only with family he can let loose. Be himself. And from the history, OP has already once affected him. So it's not wrong for Terry to be upset and every one to discriminate OP. I mean, OP has already pulled this kinda stunt before. He should've rather talked with them about introducing his fiance, \"this chick\" and then brought her.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 376,
      "content": "Oh, dude, I was so ready to say you're absolutely not the AH and Jerry needs to get over himself and go kick rocks. \n\nUntil you shared a bit of very relevant information that you conveniently left out of your post. That being: you've been engaged twice before, and one of your previous fiancées sold a story to TMZ about Jerry \"to make a quick buck,\" and this is the whole reason why he has made this rule about having family--and ***only*** family--at family gatherings. \n\nYTA. Absolutely.",
      "id": 131,
      "comments": [
        {
          "score": 75,
          "content": "Same. I was ready to say NTA, but reading the comments, it looks like the whole reason this Family Only rule was made was because of OP.\n\nPoor Gerry. He just wants to get drunk and have fun.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 316,
      "content": "YTA - I'm a believer of ask for forgivness instead of permission. That only means, I do what I wont and don't give two shits about you. Forgive me and be a doormat or be pissed and I call you petty.",
      "id": 133,
      "comments": [],
      "relation": "Attack"
    }
  ]
}