{
  "post content": "I 33M recently got hired at a large company in the south where me and my wife moved months ago.\n\nMy wife was excited for my new job and talked about preparing a surprise for me which got me excited but I didn't what it was til she showed up at my workplace 2 days ago with a meal she said she prepared specifically for me since it's my favorite. Apparently this was her surprise. I was little upset she brought it to my workplace. My co workers who are vicious and brutally honest and sarcastic got involved and kept teasing me about the meal. one of them \"Austin\" joked about how \"mommy\" is so supportive by bringing food to my workplace. I felt like shit as he and other co workers kept laughing at me.\n\nI went to work the next day and Austin\nkept making jokes about me saying shit like \"is mommy going to bring lunch today as well?\" And \"When is mommy coming to change your diaper?\" And some other shit. one of them who's someone I don't know well said \"oh you guys I can still smell the meal (my name's) mom brought yesterday. She's such great cook bless her heart!\" And the goddamned giggles kept on.\n\nI felt so awful I went home and just blew up at my wife telling her she flatout fucking embarrassed me and just torpedoed any goddamned prestige and respect I had among my co workers. I told her what Austin and others have been doing and asked if she was happy for giving him emmo to come at me like that. She argued that she was just trying to do something nice for me and didn't care about what people might say but I was a selfish jerk who only cares about what others think rather than how she felt by my constant berating over a meal she put effort money and time to make and bring to me. The argument escalated after I suggested that she could've waited til I got home to surprise me with this goddamned meal instead of showing up while I was working which made me seem unprofessional. she said she came during lunch break but I was still working during lunch break. She said at this point I clearly find it easier to blame her than stand up for myself against those childish bullies. I said I didn't appreciate what she said but she replied that I should be grateful she cared enough to bring me a home cooked meal then thanked me for showing her it's not worth wasting anymore of her time cooking for me after this. I told her to stop blaming me for something she caused and asked her to admit that maybe she should've consulted me before bringing the meal over so I could avoid being the goddamned butt of every joke my co workers told. I don't even know how long this is going to last. She told me to man up and either report them or quit then. I was floored by what she said I had to walk out becuase I couldn't take anymore of this and felt like she wasn't listening to how her behavior caused me an issue at work.\n\nEdit to say that I in no way don't appreciate my wife's effort but the only problem I have is that she didn't tell me beforehand about wether it was okay to bring the meal over to my workplace. I really prefered that she waited til I got home or we could've gone out later to eat. I agree that the main problem I have is my co workers but I lashed out because I felt overwhelmed with their hurtful remarks that offended my wife as well.",
  "id": 1,
  "comments": [
    {
      "score": 64726,
      "content": "YTA. Your wife is an absolute sweetheart. Your colleagues are bullying you, and bullying your wife in return isn't going to fix anything.",
      "id": 2,
      "comments": [
        {
          "score": 9653,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 29178,
              "content": "My first thought was OP sounds like a pre-teen embarrassed by their mom. He needs to grow the fuck up. OP,  YTA, and I hope your wife never does anything thoughtful for you ever again, because you obviously don't deserve it.",
              "id": 4,
              "comments": [
                {
                  "score": 19611,
                  "content": "If someone made fun of me for my partner bringing me a home cooked hot lunch, I'd just throw it back at them.  \"I'm sorry my wife loves me so much and does nice things for me. don't take out your lonelinessand bitterness on me, no lunch.\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 11379,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1873,
                      "content": "Exactly. My colleagues once overheard me saying \"love you\" at the end of a call to my husband and started taking the mickey - \"OooooOOOoo\" etc. I just looked at them and asked why they don't tell their wives that they love them and they went quiet. OP is letting them get to him, I'm pretty sure it wouldn't take much to shut down and if it did that's what HR is for...",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 989,
                      "content": "This! \\^ This!!! This is how a grown man would handle being razzed by his co-workers. It could have been a bonding moment for everyone to have a lighthearted laugh. Instead, Crybaby showed his bullies which buttons to push, and then went home to bully his wife, who, one would hope, never makes him another homemade meal again.\n\nYTA, bigtime!\n\nOne more thing: If I were the wife in u/chaos_almighty's scenario, I would probably bake up some treats for hubby to take to share with his office mates, just to assure everyone that there are no hard feelings. That would feel like a win-win-win to me.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 608,
                      "content": "And then I would proceed to eat the meal in front of them like it was the best thing ever made and my wife is a better chef than Gordon Ramsey. Lick my fingers obnoxiously and burp and then keep talking about how delicious my food was and can't wait until she makes me lunch again and wonder what she'll make next.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 380,
                      "content": "\"im sorry you couldnt satisfy a woman long enough to marry one\"",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 377,
                      "content": "I work in a thick skinned, male dominated field and if this type of conversation happened would probably go straight to, \"your mom brought me dinner last night\". Turns the attack right back on them while not giving any sign of sensitivity",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 260,
                      "content": "Could've also gone with... \"No, not today, I'm gonna save my hunger for tonight when I eat out *your* momma's *salad*\"",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 134,
                      "content": "YTA. Big time.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 46,
                      "content": "Im petty enough to also cast doubt to the bully and suggest I am pretty sure that I saw the bully’s wife exiting a motel room with the guy’s immediate boss.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Instead he fucking *what*? Blows up on his wife!? What an absolute childish little twerp. I would be over the moon if anyone went out of their way to not only bring me home cooked food to my office, but home cooked food that they know is my favorite. I hope OPs wife is reading this and finds someone who can appreciate her.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 342,
                  "content": "yeah, it's just really hard to imagine grown men saying these things, but I don't know, maybe in some places or something",
                  "id": 16,
                  "comments": [
                    {
                      "score": 456,
                      "content": "Grown men can be very immature. Did you not witness the immaturity of the last US President?",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 259,
                      "content": "This kind of talk is (unfortunately) par for the course in blue collar work in the south. The new guy always gets hazed with this kind of bullying, and the only way to win is to laugh it off and give the bullies shit back until they learn to back off.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 271,
                  "content": "Goddammit, I hope his goddamn wife doesn't do a goddamn nice thing for this goddamned a-hole again...",
                  "id": 19,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I hope OP's wife divorces him and finds someone who appreciates her meals!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 187,
                  "content": "If I was the wife, i would never cook for him ever again.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Seriously. Not even dinner. From now on if he wants a home-cooked meal, he can make it himself. I wouldn't so much as turn the kettle on if he wanted a cup of tea.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "And I would get SOOOOOOOOO good at cooking for myself and making the house smell amazing as I walk by with my plate to my room and shut the door for privacy while drawing up divorce papers.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "When that sweetheart of a woman becomes his ex wife over OP showing his ass he's going to miss all that delicious home cooked food. Hope \"Austin\" was worth it.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I had to check OP's age again. He's 33?! Dude, grow the heck up. If the argument between you and your wife happened exactly as you wrote it (which I suspect it did because you probably thought you wrote this in a way to make yourself look like not the AH), then everything she said is 100% accurate. It isn't her fault your coworkers are rude and that you apparently have really thin skin. YTA, hugely, and you need to apologize to her ASAP. Like, yesterday.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 554,
              "content": "I hope so too. This was a plot in an episode of “How I Met Your Mother”, but that ended up with the guy realising he was being a jerk to his wife, apologising to her, and ignoring his infantile coworkers. Something OP should seriously consider doing, if this isn’t fake. \n\nYTA, and so are the children - I mean - coworkers.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 375,
              "content": "I don’t think it’s fake because of the way it’s written like a stream of consciousness when the conflict starts heating up. Not fool proof of course— just seemed like it was coming from someone’s memory.\n\nYTA OP.\n\nApologize to your wife. You owe her a delicious meal, too. \n\nAddress the bullies. And reconsider whether it’s worth working with them at all.",
              "id": 27,
              "comments": [
                {
                  "score": 8,
                  "content": "Instead he posted an update saying ‘i think the problem is my coworkers’. Can’t say I’m surprised.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Which is wild.\n\nShe thought she’d be surprising him by doing something that’s pretty conventional. She didn’t hop out of a fucking cake — she brought you a home cooked meal to your workplace. Like spouses sometimes do.\n\nShe couldn’t have possibly accounted for a grown man being bullied by other grown men.\n\n\nLet alone that the former grown man would validate the shit talking bullies by turning his wife’s sweet gesture into a slight.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I'm getting strong \"fake\" vibes from this post, too. It very conveniently fully presents both points of view. Like, how oblivious do you have to be to write \"She said at this point I clearly find it easier to blame her than stand up for myself against those childish bullies.\" and like... have absolutely no self-reflection in response to that comment at all?",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "The overuse of the word *godamned* makes me believe this was indeed written by an 11 year old.",
              "id": 31,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I live in the south, and around here everyone would probably be jealous of OP that he got a nice big homecooked meal. His coworkers are the biggest AHs.",
              "id": 32,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2648,
          "content": "Yeah.  Hey OP? Can I ask your wife out on a date since you hate her so much? She sounds awesome.",
          "id": 33,
          "comments": [
            {
              "score": 1079,
              "content": "I’m second in line please, my husband and I are also interested in OP’s wife and we will do the dishes",
              "id": 34,
              "comments": [
                {
                  "score": 657,
                  "content": "I too, choose this guy’s wife.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 405,
                      "content": "I will also take a ticket for this fool's wife. Does she know she has a whole supportive polycule forming on reddit?",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I understood this reference 😁",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "We would also take her in a heartbeat!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "I wanted to ask her out too. She sounds phenomenal",
              "id": 39,
              "comments": [
                {
                  "score": 237,
                  "content": "This, and I'll cook for her. Screw this guy.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Nah, I’m def not screwing OP. If he didn’t have a snappy comeback for the work guys, he‘s not interesting enough to screw.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 125,
              "content": "I will bring this woman into my workplace and introduce her to every single one of my coworkers and bosses… “here is MY AWESOME WIFE and she made me my favorite meal from scratch to bring me for lunch today, isn’t she AWESOME?! I am so lucky to have a wife who will go out of her way for me like this!”",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Yeah, OP, let me know if your wife ever wants to give women a try because I would appreciate her a hell of a lot more than OP",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I would like to be adopted a second time by this guys wife and only his wife.",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I too would accept OPs wife into my family and show her the appreciation she deserves. I’ll even cook for her half the week.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I'm a straight, married woman and I'd still totally take her out on a date! She sounds awesome!",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "What the heck, my wife says she and I should throw our hat into the ring too!",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Me and my husband's girlfriend would also like to date OP's wife. Keeper.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Straight up, i hope the wife divorces him and tells him to go marry austin or whatever his name is",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1221,
          "content": "Right! OP had NO respect from his coworkers to begin with, and he had the audacity to lash out at his wife and suggest she is the reason for it. \n\nOP, if you’re working with the kind of toxic AHs who will rip into you relentlessly because you have a loving partner, then frankly I’d be asking myself how much I really want to work there long-term.",
          "id": 50,
          "comments": [
            {
              "score": 458,
              "content": "He's not guying right, he's supposed to be ripping on them back.",
              "id": 51,
              "comments": [
                {
                  "score": 872,
                  "content": "The correct response: \"Yeah, sucks to be me with my awesome wife making delicious meals for me all the time. U mad, bro?\" /Smirk\n\nOP's seeming belief that, if his wife hadn't visited him at work, these shitty children he works with would hold him in the highest regards and treat him with respect is ridiculous. They'd just pick some other random detail of his life or appearance to bully him over. If it wasn't this, it would be his brand of shoes, or his favorite movie, or a weird turn of phrase he used in passing.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 379,
                      "content": "Op YTA! Majorly. I hope this is fake. As a southern wife, my husband is always over the moon if I bring him lunch, send one with him or heck even order him takeout as a surprise. His coworkers are always jealous or really happy Bc I tend to send extra for him to share. This has been true at every company he has worked at. Your coworkers are morons. My mama did the same thing for my dad and most of the men he worked with joked about stealing her away. How dare you treat your sweet wife that way. You know there are plenty of people out there who would cherish the effort and thoughtfulness she exhibited. You keep acting foolish and she will figure that out real quick.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Literally. They jumped on that opportunity bc it was offered to them -- but if it weren't there, they'd just prowl around until they find one. YTA, OP. While I understand how it feels to get bullied, you have to realise the fault lies on the bullies. Your wife did this out of kindness. Maybe you don't like surprises -- that's okay! But don't lash out at her like any of this is her fault. It's the coworkers' fault, and none else.\n\nApologise to your wife. She's a treasure.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 419,
                  "content": "Yeah I can't understand why he's not replying in kind. \n\n\n\"Is mummy bringing your dinner today?\" - \"Yeah I fucking hope so, if your lunch is anything to go by\".\n\n\"Is mummy changing your nappy?\" - \"She better, because I already have to put up with your shit!\"",
                  "id": 55,
                  "comments": [
                    {
                      "score": 178,
                      "content": "Ohh or for the second one, \n\n\"Me and my wife aren't into that and like whatever floats your boat but that's not really appropriate to talk about in a workplace\"",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "Right!!  \"Aww, you're just jealous because you have no one to suck your dick at night and bring you food in the morning!\"\n\nEdit: grammer",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "The best response to the razzing would have been a simple “at least my wife loves me”",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "yeah if he had just fired back \"actually your wife is bringing me lunch today\" this would be over",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yep - \"It's the smell of the love of a good woman. I know you're not familiar with that.\"",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Exactly! I'm a chick and I would be like \"awww austin are you tired of eating lean cuisines, must suck to be single and alone! If you play nice maybe I'll see if we can pack you something so you're not so hungry and angry!\"",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That is actually common in the in male dominated, blue-collar jobs. It is an ice-breaker. It is hazing. Can the guy fit in? Will he get offended easily? Can we trust the new guy not to go crying to the boss if he gets a hangnail. \n\nThe answer he is giving them is no.\nNo, he won't fit in.\nNo, they can't trust him.\nYep, he will go running to the boss over a hangnail.\n\nHe has a limited time to fit in and he may have already lost that time.\n\nIf they found out he blew up on his wife for bringing him a meal they will actively hate him.\n\nI am from the south and have worked in male dominated fields for years. The guys talk a lot of shit but usually- I said usually- these types are the first ones to beat the shit out of a guy for harrassing a single lady at a bar.\n\nHe will never fit in at that job because he didn't defend his wife and they notice that shit.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 714,
          "content": "So many people reading this jealous because nobody will ever care enough about them to bring them a home cooked meal at work. \n\nPerhaps if had been an.actual parent bringing food, but a wife caring that much? All the people bullying OP are jealous and are going home to mutter insults at their wives. So many bitter men in this story and one lovely woman.\n\nOP shpuld just have asked them why their partners weren't bringing them meals.",
          "id": 63,
          "comments": [
            {
              "score": 297,
              "content": "Their partners are not bringing meals because they live alone in moms basement and their ‘partner’ is another 30yo man on their gaming platform that’s been cat fishing them from a foreign country. 🤷‍♀️",
              "id": 64,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "I remember my father being so proud his colleagues were jealous because my mother was cooking him lunch everyday. I remember my mother being upset because some of the wives of those colleagues were telling her she ruins everything for them and she shouldn’t do that anymore.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "i'm from the south, if my momma showed up to my work with homemade food for me my coworkers would be sooooo jealous lbh.",
              "id": 66,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "For a few years I was living in the city but working in a facility about an hour away. One day I left my packed lunch at home. My SO had the day off, noticed I'd forgotten it, and took the two-hour round trip to drop it off for me. My coworkers never stopped talking about how lucky I was to have such a wonderful partner. *That's* a normal response to witnessing an act of kindness between spouses.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 378,
          "content": "Not only are YTA-you’re a massive one at that. You should be ashamed and beg your wife for forgiveness. Your co-workers are also TA, how old are any of you and how are they remaining professional? I’d report to HR. You are beyond belief.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 350,
          "content": "Honestly, should have just hit the coworkers with a \"No one loves you enough to bring you your favorite food for lunch? I'm sad for you\" and they woulda shut up right quick. \n\n8 year old me told a bunch of kids \"I'm sorry your mom doesn't love you enough to give you a nickname\" when they tried to make fun of my mom letting it slip while she was volunteering at school one day.. \n\nYOU'RE AN ADULT. Why do you care about what some playground bullies masquerading as men have to say? Just because they aren't acting like adults doesn't give you the excuse to blow up on your wife like a child. All these \"men\" are guaranteeing is that your wife never does a nice thing for you again and/or giving her the start of a list of why she needs a divorce. Don't forget, these things start small and build up over time.\n\nApologize to your wife and the next time they say something about your wife bringing you lunch just respond with \"I'm sorry my wife loves me?\"/ask them to explain the joke, act real confused, and go about your business. \"Those who matter, don't mind and those who mind don't matter\" and all that.",
          "id": 69,
          "comments": [
            {
              "score": 12,
              "content": "8 year old you is a savage...\n\nI'm jealous.",
              "id": 70,
              "comments": [
                {
                  "score": 8,
                  "content": "If it makes you feel any better, I'm jealous of 8 year old me as well.\n\nI have a bad habit of biting my tongue as an adult.12 year old me got into some fights cause of my sharp tongue...",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah, OP should have just flipped shit right back at them.",
              "id": 72,
              "comments": [
                {
                  "score": 12,
                  "content": "For real. I just can't wrap my head around him not thinking he's the asshole for yelling at his wife for being a good loving and caring partner? Like I don't like having a lot/too much attention, but I'd prob cry from happiness if my boyfriend were to bring me ANYTHING to work even if it was in front of the entire warehouse. I thought that would be something to be proud of like \"Wow. My SO really loves me\" but apparently not.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "Now both, his wife and coworkers, won’t have respect for him lmao",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "Geez anyone that would act like OP’s coworkers are definitely TA. One of my coworker’s wife used to bring him food occasionally and I’d get so jealous because it smelled amazing. He actually asked her to bring an extra portion for me. Definitely something I miss from working in the office.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Ways you could have replied…\n\n“Gosh Austin, should we be concerned that you seem confused about the difference in the roles of your mother and your wife?”\n\n“There goes Austin again, imagine being *this* jealous that my wife visibly cares for me that he’s still going days later.”\n\n“I’m sorry to hear you don’t have anyone to love and care for you at home. It must be miserable never getting a home cooked meal.”\n\n“Did you want me to ask my wife to make extra for you next time so you don’t feel left out?” \n\nHow OP decided to respond: \n\n“How could you bring me a lovely meal on my lunch break this is all your fault.”\n\nYour wife is 100% right. YTA.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "100%! He is YTA  I would fucking kill for someone to cook me a meal, let alone something I like, let alone my favorite made exactly the way I like, let alone bring it to work for me and surprise me with it.\n\nHis co-workers are jealous af and op is too ignorant and entitled to understand the dynamic and deflect their bullying. \n\nHis poor wife.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 25575,
      "content": "YTA\n\nMaybe you should stop blaming your wife for your inability to stand up for yourself.",
      "id": 78,
      "comments": [
        {
          "score": 5094,
          "content": "I was thinking the same thing, his wife is 100% right",
          "id": 79,
          "comments": [
            {
              "score": 2016,
              "content": "Instead of hitting them back with something to throw them off their game and shutting that shit down, he let them get under his skin.\n\nThen went home and bullied his wife.. the only one that actually matters.\n\nYTA OP.. and a huge tool",
              "id": 80,
              "comments": [
                {
                  "score": 34,
                  "content": "Exactly, this dude also has probably never worked in this type of environment before either, most places I’ve worked at, (I live in the south) all the guys frequently give each other a hard time, it’s a part of the work culture. You just have to roll with it and give it back as good as you get it. \n\n\nOP could just be from somewhere this kind of stuff doesn’t usually happen, but I’m pretty sure guys give each other shit at jobs all over the world, usually all in good fun. Course even if they are just straight up being bullies he should be standing up for himself and his wife. \n\n\nYTA big time here OP. Get a grip and stand up for yourself, and while you’re at it you should apologize to your wife and cook HER something, while also thanking her for pointing out that you should stick up for yourself.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Yeah I don’t understand why he didn’t pop back instantly.  Those kind of guys back down quick.  It’s just finding something to give the new guy grief.  And blaming her just wow.  It’s like he’s a kid.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "How unappreciative and hateful do you need to be to get angry at someone going above and beyond to please you?",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Yea I found a hard time believing this all was real as I read it. I mean, he didn’t make a single good argument for himself and quoted many of her dead-on points. Or is he really just this stupid that he thought he could quote her perfect behavior and argument and we’d still take his side? Yeesh",
              "id": 84,
              "comments": [
                {
                  "score": 6,
                  "content": "It's possible that he's oblivious, my ex would do some really shitty things and not understand why i was upset. \n\nIt is weird that he was self aware enough to post about it though.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Have you ever met a man in his natural habitat? Like at least half of them are oblivious and have to be gently led to the point. I’ve gotten so fed up with it I just give my husband a look and go to another room bc I’m tired of having 2 children when I only gave birth to 1.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1169,
          "content": "Exactly, the only person he blames is the person who is not at fault whatsoever. It’s not her fault his coworkers are assholes and it’s not her fault  that he can’t keep up with the workplace banter.",
          "id": 87,
          "comments": [
            {
              "score": 27,
              "content": ">It’s not her fault his coworkers are assholes and it’s not her fault  that he can’t keep up with the workplace banter.\n\nThis is not banter, it's bullying. OP is being bullied at his job, and might not be able to afford to quit. That's a sucky situation.\n\nHis wife vis certainly not to blame, and OP *did* act like an asshole towards her. But we should still recognize that OP is also being victimized here, and it's quite common for bullying victims to lash out at the wrong people.",
              "id": 88,
              "comments": [
                {
                  "score": 20,
                  "content": "I like to joke around with my coworkers, I get some shots at them and they give me some as well. Also enjoy self deprecating humor as well as I think it lets others laugh at you and show there's no real malice behind any of the jokes. The \"jokes\" his coworkers are bullying him with aren't even funny, definitely not enough to warrant carrying them over into the next day. I think these are pretty easy jokes to lob back at them, they are definitely assholes especially if they barely know OP but OP needs to get thicker skin.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 17,
                      "content": ">The \"jokes\" his coworkers are bullying him with aren't even funny, definitely not enough to warrant carrying them over into the next day.\n\nYeah, when they talk about his \"mommy\" or his \"diaper\", it's clear that these are not jokes. These are attempts at humiliation.\n\nI like to have a somewhat informal and joking relationship with my coworkers, and to some extent my boss too. But any joke must start from a place of *respect*. It must first be clear that you're trying to have fun together with the person you're joking with, and not just have fun at their expense.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1015,
          "content": "Seriously, I bet all OP would have to say is, \"I'm so lucky I have a wife that loves me enough to bring me an amazing lunch. This meal is perfectly seasoned so you can keep all that salt to yourself.\" And then gone for the hard ignore. They would have left him alone pretty quickly, but he let them get under his skin. Now his wife is getting all the backlash.",
          "id": 91,
          "comments": [
            {
              "score": 499,
              "content": "Not only that, but his reaction is exactly what the bullying coworkers wanted. Now they know how easy it is to mess with him because they're jerks and he'll lash out on the wrong person. OP I'm sure they'll make fun of you for your divorce when it comes to that, too",
              "id": 92,
              "comments": [
                {
                  "score": 27,
                  "content": "Yep, OP you fucked up when you reacted to their banter. THAT is what will keep them going because they know they can fluster you so easily. This is 100% your fault.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Watch them start making fun of him for being mean to his wife, too. \"First you get your wife mom to make you lunch next you clown on her! Awww!\" Whatever gives them a reaction. And by OPs post, that is all too easy to accomplish",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 703,
          "content": "Yep.  My coworkers made fun of me briefly for bringing in my own food as they always go out or order in.  I just said it sucked that they didn’t know how to cook but I could always send them a few websites that might help.  They never bothered me about it again.\n\nThey did, however, ask me for some recipes over the years and I was more than happy to pass a few good ones on.",
          "id": 95,
          "comments": [
            {
              "score": 36,
              "content": "I feel like there should be seminars to teach people to smack-talk-back when they recieve friendly ribbing instead of going straight to \"I'm being bullied\".\n\nThere is a difference between friendly banter to test a person's wit and constantly being on someone's case. Unfortunately people that are really bad at making comebacks rarely recognize the difference so to them everyone who tests their wit is a bully. However if we taught them to respond properly in kind they'd get to enjoy this typically very funny dimension of human interaction.",
              "id": 96,
              "comments": [
                {
                  "score": 27,
                  "content": "I think some people just don’t like it and don’t know how to respond.  My sister is incredibly sensitive and while me and my brother can rib each other with no hard feelings, we have to be careful with her because she end up crying.  Maybe he’s just not the type of person who likes messing around, and if that’s the case he needs to either find a different job or tell them he doesn’t like it.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I am one of those people who can’t make quick comebacks, which has to do with me being somewhere on the autism spectrum. So, this ability may not be present in some people. How would you go about it then?",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "OPS wife literally said this to him and it's in the post lol. This guy sucks and should listen to his wife instead of posting on reddit",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "It's such an easy thing to counter as well. \n\n\" Where's your home cooked meal?\"\n\n \" At least I'm getting laid.\" \n\n\" At least someone loves me.\"\n\nYou should be fucking proud your girlfriend is that thoughtful and loving, not embarrassed, OP. You got some growing up to do.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Or at least report it to HR… there’s a proper way to address inappropriate behavior at work and OP clearly did not do this",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yup.  Here's how the conversation should have went\"\n\n\"is mommy going to bring lunch today as well?\"\n\n\"Maybe, I guess you aren't used to seeing someone who's wife actually likes them.\"\n\nYTA",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20883,
      "content": "“She said at this point I clearly find it easier to blame her than stand up for myself against those childish bullies”\n\nYTA and your wife is absolutely correct here.",
      "id": 103,
      "comments": [
        {
          "score": 2724,
          "content": "Yep, the woman sounds amazing and OP should listen and learn from her and also do something amazing to apologize because she sounds like an absolute gem.",
          "id": 104,
          "comments": [
            {
              "score": 621,
              "content": "I agree, a huge apology is needed here, she went out of her way to do something lovely for him and in turn was treated terribly for it.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "OP should either cook her a nice meal of his own or take her to a good restaurant. Really pamper her, all of this coupled with a sincere apology and acknowledgment of her being right about the workplace. If (and only if) she has accepted his apology, he should make himself really vulnerable and tell all about how the bullying affects him, how he took it out on her because his own sense of powerlessness. Then he should ask her sincerely for advice, since he realises it’s valuable and could really help him. Perhaps making it up to her by treating her with the love she showed and allowing her to help him in the most meaningful way possible might help mend the damage done.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1461,
          "content": "Imagine sabotaging your relationship with your loving spouse because you care what some shitty bullies think of you.",
          "id": 107,
          "comments": [
            {
              "score": 325,
              "content": "Agree, these bullies would have just found something else to tease him about regardless.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Imagine not having the spine to defend yourself in a situation like this. Those twats are obviously jealous. One: \"Oh no, poor me, having a wonderful wife who cooks delicious food for me. When was the last time someone cooked for you, Mr. Takeouteveryday?\" would probably have been enough.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "\"But Austin is so cool and i want him to like meeeee!\" - Op probably",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 566,
          "content": "I was honestly excited to hear more arguments from her because she made some really good points",
          "id": 111,
          "comments": [
            {
              "score": 389,
              "content": "Yeah, she sounds like she has a really good head on her shoulders. Which is bad news for OP, since sensible people like this are unlikely to put up with unreasonable shit for long.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "If you simply demonstrated to your co-workers that you were unfazed by their insults they would lose interest quickly. \n\nInstead, just say how much you love your wife and how awesome it is that she loves you enough to spend time and effort preparing and delivering delicious food.  If they think that's stupid then they are idiots and you shouldn't care what they think of you anyway.",
          "id": 113,
          "comments": [
            {
              "score": 10,
              "content": "Op is acting super childish and completely playing into the bullies hands.\n\n\nAnd then he yells at his wife? Because people said stupid stuff, and he took it badly instead of laughing at how stupid they are.\n\n\nOp is YTA 100 times over, and still doesn't seem to have learned his lesson bassed on the edit, it's amazing how some people can be this dense.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Or just calmly and politely thank the wife and ask her not to bring lunch again as it made you feel awkward. Like there was a polite NTA way to end this scenario.",
          "id": 115,
          "comments": [
            {
              "score": 14,
              "content": "But then he couldn’t take out feeling lower than others by berating someone he considers lower than him.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "The fact that he can write this verbatim and not *see* that he’s the asshole before finishing this post, I’m calling troll. Nobody is that oblivious.",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Seriously, what a weenie. A simple “sorry my wife loves me” and a shrug would shut them down. They saw he got embarrassed and now they can run with it. That poor woman.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah why the hell is OP sweating losing the prestige and respect of these losers? Did none of them progress beyond high school?",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10945,
      "content": "YTA for siding with coworkers over your wife who you married, live with and presumably love.  Those coworkers are immature and I cannot for the life of me fathom why their opinion of you matters more than that of your spouse.",
      "id": 120,
      "comments": [
        {
          "score": 2797,
          "content": "[deleted]",
          "id": 121,
          "comments": [
            {
              "score": 937,
              "content": "Right? Like this man won't appreciate her hard work? I would be ecstatic to receive a homemade meal at work. Op what's your wife's number if you don't appreciate her we will",
              "id": 122,
              "comments": [
                {
                  "score": 290,
                  "content": "I would literally be a part of a 15,000 member harem for OP's wife because of how kind she sounds. I'm a broke student and someone bringing me food would not only help me get fed but the love that went into it would keep me going mentally for the rest of the week, most likely.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Would also love to join OP’s wife’s harem 🙋‍♀️",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I don't understand his work culture either.  If my coworkers partner made a homemade meal I think I'd be amazingly jealous and impressed!",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 641,
              "content": "I’m a straight gal but i’ll take OP’s wife if he doesnt appreciate her",
              "id": 126,
              "comments": [
                {
                  "score": 36,
                  "content": "I’m a lesbian and will gladly take OP’s wife",
                  "id": 127,
                  "comments": [
                    {
                      "score": 24,
                      "content": "You can have dibs and i’ll make homemade lunch for you both",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "Uh yeah same",
                  "id": 129,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Me three.  OP is a massive dick.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I'm a happily married woman, but my husband and I will both take OP's wife. Who wouldn't love a hand delivered homemade lunch? We'll treat her right!",
                  "id": 131,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Sounds like we just formed lunch club. First rule is you tell everyone about lunch club",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 245,
              "content": "Right? I'd take his wife for a week just to cook HER a solid week of homemade food just to make up for her raging A-hole of a hubby.",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "Right? How hard would it have been to say “I really appreciate she took the time out of her day to make and bring me food” - but nah, his poor wittle ego is hurt!",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I can’t think of any job I’ve ever worked at where people wouldn’t be jealous of this.",
              "id": 135,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "She is now Reddit’s wife. We are taking her away from OP and treating her right.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 583,
          "content": "\"she's not my mom, she's my partner. She loves and supports me, sorry you don't know what that's like.\"",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "Childish,  asshole coworkers at that.",
          "id": 138,
          "comments": [
            {
              "score": 219,
              "content": "And clearly jealous they don't have someone bringing them home cooked meals to work. Maybe someone would want to do nice things for them if they weren't such giant assholes.",
              "id": 139,
              "comments": [
                {
                  "score": 103,
                  "content": "It's okay at this rate I think Op's wife might be available soon. I'm thinking that the bully would appreciate her more than he does.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Is this what it’s like working at a “large company” in the south? I couldn’t imagine living in such a shithole.",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Somehow OP managed to figure out how to be an even bigger asshole then Austin.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Exactly! And what would have happened if OP and his wife decided to talk about it beforehand and he agreed to let her bring a home cooked meal to his workplace? The coworkers probably would have behaved the same anyways from the sound of it. Big YTA",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Agreed. OP's wife said it best:\n\n_\"She said at this point I clearly find it easier to blame her than stand up for myself against those childish bullies.\"_\n\nYour coworkers are pathetic and childish. And, you sound so eager to please these immature work place bullies that you are creating an issue at home. \n\nHow about telling these grown men who are actively working to demean you and your wife off instead of insulting your wife.\n\nEdit: Also, no one is going to think less of you professionally for having a loved one bring you lunch. But, they will think less of you and your coworkers for this immature workplace banter.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8647,
      "content": "YTA instead of standing up to a bunch of work bullies who are insulting you wife and bullying you. You take it out on your wife because it's easier than being a man and standing up the the real problems.\n\nWhy not mock them \" at least my wife cares about my wellbeing\", \"are we jealous boys, because my wife took time out of her day to try and make me happy\". No instead you attack your wife. \n\nYou should say sorry to her and then stand up to those bullies",
      "id": 145,
      "comments": [
        {
          "score": 2593,
          "content": "OP, \"why is that funny?\"  Put it on repeat. \n\nYou also need to grow up. No one, ever would be allowed to talk about my husband like that. He is here for me, long after many jobs have come and gone. \n\nDo you even want to be married? \n\nYTA.",
          "id": 146,
          "comments": [
            {
              "score": 1390,
              "content": ">Do you even want to be married?\n\nDepends on what the bros think",
              "id": 147,
              "comments": [
                {
                  "score": 286,
                  "content": "I suspect you're right.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Yeah, like we really need Austin's input here.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Fellas is it gay to be married?",
                  "id": 150,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This made me straight up laugh with my entire chest 😭😭😭",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I think he wants to marry his bros.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "THIS IS SO ACCURATE FUURRIOGGOFFTYI",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 207,
          "content": "Right? I'd be pissed as OPs wife for not being stood up for!!",
          "id": 154,
          "comments": [
            {
              "score": 116,
              "content": "Don't worry, his workplace will be a shit job for him now. They were jealous and hazed him. He didn't stand up for his wife so he lost ALL their respect. Seen it happen before.",
              "id": 155,
              "comments": [
                {
                  "score": 34,
                  "content": "Good point. I wouldn't respect someone who didn't stand up for their partner. Not being able to handle teasing is one thing, but this guy couldn't even say one nice thing about his wife in either defence or as a fact.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "Reminds me of those 12- year olds bullying a kid online because he said 'I love you' when his mom went to his room to wish him goodnight.\n\n'Uuuuuh, You love your mom!''what? you don't love your mom? That's sad!'\n\nGo with that OP! Someone is taking her time of day to bring you a homemade meal? She's a sweetheart for doing so. That is her way of saying she loves and cares about you. Appreciate it!",
          "id": 157,
          "comments": [
            {
              "score": 16,
              "content": "Omg this reminded me of when a kid teased me for saying \"I love you\" to my grandfather and using our form of the word grandfather. I was maybe 10-12 years old, and having a hard time with bullies in school, but didn't even hesitate to say something like \"..that's our word for grandfather, and of course I love him, don't you love yours?\" I can't remember 100% of my words, but I 100% remember the look of embarrassment on his face and him saying \"sorry\".\n\nIf people have a hard time standing up for themselves or others, maybe don't think of it as standing up to anyone but just stating a fact: \"of course I love them!\" Or \"they really make me feel special\".  The only time one may need to use caution and not say that is in a dangerous hate situation and their life depends on keeping quiet about it.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Glad someone else brought up dishing it back!",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "SERIOUSLY, when did we get so lost in capitalism that coworkers are more important than our loved ones?",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I work morning shifts at a cafe as a barista and my partner works in a blue collar job with plenty of dickheads. I bring him new coffee to try when I get off my shift. He’s changed jobs multiple times, but never once has he ever let the “mommy” comments get to him — because in “manly” fields like that, those comments are bound to happen in abundance. He just says that his coworkers probably wish they had someone who cared enough to bring them something too, and never once has lashed out at me for doing it. I really truly feel for OP’s wife. I can’t imagine how she must be feeling.",
          "id": 161,
          "comments": [
            {
              "score": 11,
              "content": "“Manly jobs” my step dad manages his own contracting company for the last like 10/13 years. And works with guys who make dick jokes and stuff 24/7. My mom stops by and they all make a joke and shuts them down remaining then that she also pays their bills(joint account) \nThey tend to shut up after that lol.",
              "id": 162,
              "comments": [
                {
                  "score": 9,
                  "content": "Men and their fragile egos back at it again lmao\n\nNo but seriously, it’s the ones who don’t appreciate or respect their wives or girlfriends that are making the “jokes” 100% of the time smh",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Fr!!!! I don’t understand how op didn’t throw it back at them. It’s so clear that they are jealous and op had the perfect gotcha moment. \n\nOp needs to shine his spine already.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Totally off point, but your response reminds me of that Simpsons episode when Barts bullies make fun of him for his jammies.\n\n“Nice PJs Simpson, did your mommy buy em’ for ya?”\n\n“Of course she did. Who else would?”\n\n“Alright Simpson, you win this round”",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Your coworkers started with poking jabs and realized you were spineless and so used that to continue to make fun of you. NOT because your loving caring wife dropped off a meal to you. If they say something again, stand up for your wife and show them you are not ashamed but PROUD to having fucking loving wife that cares about you! My god… is this even real?",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "You’re right! These guys are clearly jealous. I don’t understand why OP didn’t recognize that immediately. Your suggested comebacks are exactly what my husband would’ve come back with and not given it another worry.",
          "id": 167,
          "comments": [
            {
              "score": 10,
              "content": "Yeah, id just be mildly sarcastic. ''yes how awful my wife made me food because she cares''",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6557,
      "content": "YTA. Good God. Psa: your coworkers would have have found something else to give you shit about, don't kid yourself about that.\n\nYour wife went above and beyond to treat you with respect and love and you trashed it because you want to fit in with a bunch of dicks???\n\nEdit to add: your own edit shows you STILL don't get it, you still think your wife caused this 'problem' and no you DON'T appreciate her actions.  Pro tip: the problem here is how you think you need approval and prestige and I don't know, some sort of holy man-bro-points with these jackasses instead of a good work ethic and solid performance?? I get wanting to be accepted and part of a team but damn. That kind of team doesn't usually get real far and you're willing to unleash on your wife over something that petty?  A decent person owns their shit, and makes it right.",
      "id": 169,
      "comments": [
        {
          "score": 1295,
          "content": "Right?! Holy crap OP is a huge AH. Your coworkers are completely immature and also total AHs to be making fun of you. THEY are the ones being completely unprofessional and I wouldn’t be surprised if they were acting this way because they’re inwardly jealous. \n\nAlso your wife is 100% right. She is being supportive and you are blaming her for your inability to stand up for yourself and your wife. Just wow, I feel horrible for her that you think this way and lashed out at her for doing something nice for you.",
          "id": 170,
          "comments": [
            {
              "score": 28,
              "content": "One probably made a comment out of being jealous and this guy obviously reacted to it, so they kept at it. In that kind of a situation you really shouldn’t let on your insecure about something because they’ll exploit it",
              "id": 171,
              "comments": [
                {
                  "score": 13,
                  "content": "I don’t know what kind of unprofessional goddamned environment this is where grown men act like preschoolers and everyone is just expected to take it but I suspect either he’s new so he is the only one who STILL takes it instead of going to HR about these shits or everyone else in the office hates all of them and they’re all salesmen or some other kind of weird fucking bro alpha dick contest department in an otherwise normal company.\n\nI guess they could be day traders or something where thats kind of expected, but then why can’t OP handle it?",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This honestly sounds like something my co workers in a high stress job would say... and I would shit talk them right back about how they wish they had my wife.... or some dumb \"and if im extra good she lets me stay up past bed time\" what a fuckin baby!",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "His wife deserves better. She sounds like a wonderful woman.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "This. OP, you are a raging AH.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 237,
          "content": "I do hope that OP's wife doesn't cook for him at all for at least few months now! I agree that he's shown zero respect to her committment and dedication just to fit in with some \"alpha males\". He could've talked with her about it in a calm and reasonable manner and ask nicely to give him heads up next time, but instead he chose to willingly snap at her.\n\nYTA OP - honestly this kind of behaviour is a massive red flag for your wife! If you have anger issues please consider therapy, don't take it out on your wife but instead learn to control yourself and stand up to idiots.",
          "id": 176,
          "comments": [
            {
              "score": 16,
              "content": "I know I wouldn't. I'd probably buy him some groceries like instant ramen and the cheapest frozen tv dinners I could find, tell him to get some counseling and leave for a while. Wherever I went you can get your ass I'd be cooking up a storm and posting the meals alllllll over social media. I see a post in the future: AITA for leaving my husband to make gourmet meals for family & friends while leaving instant noodles for him to eat?",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> I do hope that OP's wife doesn't cook for him at all for at least few months now!\n\nYeah, I'd be done. But luckily my husband is courteous, appreciative and way too mature to give a shit if a coworker tried to tease him over something so stupid. That, and his coworkers aren't a bunch of schoolyard bullies, they're actual adults.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "This! Like does OP not realize this is clearly a toxic workplace? And these people 100% would have bullied OP about something eventually 🤷‍♀️\n\nAnyway, please take this award, 10/10 accurate comment!",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Tbh he would have gotten a heck ton of prestige if he would have shown he got a spine. Now they know they can push him around till the end of the world",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "The funny thing is his reaction is why he will never fit in now.",
          "id": 181,
          "comments": [
            {
              "score": 5,
              "content": "His edit shows he still doesn't get it, he's still blaming HER.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3541,
      "content": "She didn't come over to your desk during working hours and wrap her arms around you and drown you in kisses in front of co-workers. She didn't bang on the manager's door to tell him he/she did a good job by hiring you. She didn't ring the company phone line to introduce herself to the secretary. THAT'S embarrassing.\n\nShe brought you a goddam meal that she made to celebrate your win. Imagine having someone so unappreciative as you for a partner. I feel for her.\n\nYTA.",
      "id": 183,
      "comments": [
        {
          "score": 1014,
          "content": "AND she was thoughtful enough to bring it on his lunch break so she wouldn’t get him in trouble. YTA",
          "id": 184,
          "comments": [
            {
              "score": 105,
              "content": "I’d love to know if he ate it despite his “embarrassment”.",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "AND it was his favourite meal according to the text. YTA",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 407,
          "content": "His favourite meal at that.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": "[deleted]",
          "id": 188,
          "comments": [
            {
              "score": 26,
              "content": "Heck even a teenager would be thankful. I remember when I worked at a grocery store this kid name Nate got a new girlfriend who would come into the store with a new homemade hot meal for him when he worked weekends. Dude was like 17 and everyone was jealous, he was always so happy to eat spaghetti while we ate lunchables.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Reading the OP, I was uncomfortable because I'm that wife who brings her husband lunch or surprises him with coffee if I'm in the area of his office. My client canceled today and a huge block of time opened up today (1000-1600) so I popped by to say hi to my husband. He loves this stuff. I'm typically mostly aware of his schedule on any given day so I'm good at gauging when it wouldn't be disruptive, and being that he was high in the ranks and a department commander in law enforcement, there were many times we had actual plans which got interrupted and I just quietly made my way out. So reading the OP, I'm thinking, do people think this is stupid? Yikes. I was relieved to see all the YTA comments. Whew!\n\nOP: my husband would NEVER EVER stand for anyone under any circumstance speak negatively of me. If people dared to make fun of him, he'd shrug it off because THEIR OPINIONS DON'T MATTER. Who the fuck cares what some idiots think? I cannot imagine people would dare to make fun of anything because of my husband's general badassery, so just manning up and commanding respect through your character and how you present yourself could've shut this down.  \n\nIt doesn't bode well for your marriage that you match your wife's kindness and generosity with such immature vitriol and illogical reactiveness. Even in elementary school our daughters knew how to manage bullying; I taught them to do what they aren't expecting. They're expecting to hurt your feelings? Laugh along with them, turn the joke into something neutral, but never be unkind to others, including the bully. The few times my girls had classmates tease them over something, my girls shut it down in short order--they didn't ignore it, because we know that 'just ignore them' doesn't work, but they proactively and positively turned the situation around (not to say they weren't hurt--they were--but the bullies don't need to know that). \n\nYour wife sounds delightful and from just what you've written, she's very intelligent and perceptive. YTA 1000%",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "\"*She didn't come over to your desk during working hours and wrap her arms around you and drown you in kisses in front of co-workers.*\"\n\n\nNgl I don't even see any problem with that part. If my SO did that I'd love it and I'd tell me jealous co-worker to fuck off.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "He's acting like she spoon fed it to him and cleaned his face with her spit and a hankie afterwards.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3294,
      "content": "[deleted]",
      "id": 193,
      "comments": [
        {
          "score": 1163,
          "content": "[deleted]",
          "id": 194,
          "comments": [
            {
              "score": 600,
              "content": "Either that or they were expecting him to not make it personal and join in on the laugh. “You fools are just jealous my wife is amazing.  OMFG this is soooo delicious I feel sooo bad for all of you that you’re stuck eating rubbish.” Fight back with words instead of internalizing it and taking it out on your wife because you’re too insecure to stand up for yourself.",
              "id": 195,
              "comments": [
                {
                  "score": 128,
                  "content": "I can't stand that kind of interaction pattern. Any time joking/ribbing takes on an aggressive/demeaning/mean tone, I'm out. Jokes should make you smile.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 46,
                      "content": "At the very least, they should be funny.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Yeah, it’s really only ok when everyone involved knows each other well enough to know everyone is joking. But it could be the work culture, and if that’s the case it’s potentially toxic, but the jokers in this case may not have the emotional enlightenment to realize that the person they’re making fun of is taking it seriously.",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 92,
              "content": "If they had any respect for him they would have never mocked him and his wife. Apparently, they already knew that he doesn't have the balls to defend her and himself.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Of course YTA and it sounds like OP never had any prestige with his coworkers.",
              "id": 200,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 190,
          "content": "I laughed at prestige. Like “oh I’m sorry, I didn’t know you worked at the office of Call of Duty”",
          "id": 201,
          "comments": [
            {
              "score": 17,
              "content": "Exactly!! He’s talking about prestige and respect from coworkers who sound like a bunch of immature high schoolers.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Prestige Worldwide",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Right? I’ve seen men brag about how much their wives love them and make a special lunch with a note. I had a manager playfully punch me cuz he was blushing because he saved all the notes from his wife’s lunches. The fact that this guy can even get embarrassed instead of feeling lucky says so much about him. And him not standing up for himself and shaming his wife instead makes perfect sense as to why he’s not respected. YTA",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2314,
      "content": "YTA. Your new coworkers seem to have the right impression about you, honestly.\n\nWould you blame mommy if you were getting bullied in school growing up? Your logic is just as immature as their lame remarks.",
      "id": 205,
      "comments": [
        {
          "score": 197,
          "content": "In school a kid would be excused for blaming mummy for being embarrassed and bullied because it’s ok for a kid to be immature.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Honestly if they found out he went home and berated his wife over this it would likely be way worse at work. Finding out how much it bothered him would likely be a big joke among these people from the way it sounds.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "> Would you blame mommy if you were getting bullied in school growing up?\n\nI def think OP would. If he's this spineless as a 33-year-old man, imagine what he must have been like as a kid. At least if he were a child this would be understandable, but as an adult? Yikes.",
          "id": 208,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Agreed, there is only one mature adult in this relationship, and that would be wifey.\n\nYTA, OP!",
          "id": 209,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2011,
      "content": "**YTA.** Austin & the other coworkers are such childish assholes they probably don't have a partner to bring them their favorite home cooked meal. \n\nI'm from the South and I could tell you a few things you could use to shut them up, but I can't post them because I would probably get banned because they are not the kind of thing you post in a public forum.",
      "id": 210,
      "comments": [
        {
          "score": 185,
          "content": "I’m very curious about these insults lol",
          "id": 211,
          "comments": [
            {
              "score": 220,
              "content": "They are not technically insults, but things that bro-dudes like Austin would get a kick out of and most likely shut down the \"mommy\" BS. Grew up in the South with single dad, two brothers and lots of uncles that were not always discrete with then talked. Probably didn't help that I eavesdropped a lot!",
              "id": 212,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 94,
              "content": "Riight!  I love Southern insults.  Bless their hearts…",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "I’m curious too would love to hear ‘em!  :D",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I'm curious...is the south still kinda like where they expect the wife to be a pure housewife? Why would it go against specific southern values to have the wife bring homemade food?",
          "id": 215,
          "comments": [
            {
              "score": 22,
              "content": "Not the part of the South I live in. My partner and I both work and contribute equally to household chores, etc. There are still some really small communities and \"old timers\" that hold onto the idea that the wife is a homemaker and the man makes the money, but it's not nearly as prevalent as it was.",
              "id": 216,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}