{
  "post content": "Okay, so this happened last night and I'm still angry about it but my wife says I'm out of line.\n\nLast night we went out to eat for my dad's 60 birthday. There were 6 of us and we went to one of those Japanese steakhouses with the hibachi table. Those tables seat 8 people, and it was pretty busy so we assumed another couple would be joining us. We end up at a table with a seemingly nice older couple. We make some small talk and all order our food.\n\nWhen the chef comes out and starts to cook, my dad notices the chef is cutting the fat off of the steak and throwing it away. My dad nicely asked if he could just cook up the fat for him instead of throwing it away. (My dad LOVES the fat more than the steak itself). The chef cheerfully agrees and starts gathering the fat from all of the steaks to cook in a separate pile for him.\n\nThe women sitting at our table told the chef \"I don't want him to have the fat from my steak!\".\n\nThe chef was apologetic and said he didn't know she wanted the fat too and he will split it between them. The women assured him she didn't want any of the fat, she just didn't want him to have something that was hers.\n\nThis is when I spoke up and asked her why this was an issue. She replied saying that it was her fat and she could do what she pleased with it.\n\nI told her it was pretty selfish to throw it away just so someone else couldn't have it. She furthered her argument by saying that she didn't want his hands all over her food, which made even less sense because it wouldn't be touching her plate at all.\n\nWe went back and forth a little bit before I gave up and told the chef to throw her portion away and just give my dad the rest, not before I called her out again for being selfish though.\n\nThis all ruined the entire evening for my family and for theirs. My wife is blaming me because I shouldn't have tried to take another person's food. Which I understand, to an extent. But she was just wasting it for the sake of not letting my dad have it. So, AITA for calling this woman out and wanting her to give my dad the fat from her steak?\n\nEDIT: I know my title says I yelled at her, but I just used \"yelling\" more as a catch all for confronting her. My tone was super seasy going and chill the whole time. But my choice of words weren't the nicest.\n\nAlso, my dad was on my side and not embarrassed or anything if that helps. He is battling stage IV colorectal cancer right now and he said this stupid argument made his week. No blaming dad, please. He did nothing wrong and didn't ask for anyone elses fat, just his own\n\nI'm honestly surprised by how polarizing these opinions are. But I'll come to the consesus that we all suck here (but I'll stick to my guns and say mostly her)",
  "id": 1,
  "comments": [
    {
      "score": 3814,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 1123,
          "content": "I should have. I mainly just wanted to know why it mattered to her at all, because it shouldn't be affecting her. But I should have let it go.",
          "id": 3,
          "comments": [
            {
              "score": 1222,
              "content": "NTA. I'm sorry your dad had to deal with 2 kinds of cancer that day.",
              "id": 4,
              "comments": [
                {
                  "score": 175,
                  "content": "Possibly a little too soon. But I Upboated",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "I didn't know this sub was full of assholes commenting on how other people are assholes, but comments like these give me a kick at the end of the day.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 174,
              "content": "I don't believe you should have let it go at all. Assholes in the wild should be confronted. If this woman had been confronted more often and earlier in her life she probably wouldn't be the way she is now.\n\nedit: because would and wouldn't mean different things",
              "id": 7,
              "comments": [
                {
                  "score": 112,
                  "content": "but what if it's at the expense of the comfort of those around you? I probably wouldn't have been able to contain myself initially but you just gotta let some things go. wasn't worth it after the first confrontation",
                  "id": 8,
                  "comments": [
                    {
                      "score": 28,
                      "content": "At a certain point you probably shouldn't waste your effort, definitely agree with you there. But I'm all about that initial callout at the least.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Dude said the confrontation ruined the whole evening. Is his Dad not getting the fat from literally one steak worth ruining the evening? Once he decides to take it further, he shares the blame in that along with the woman.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah, exactly. Like, the lady was weird for not wanting to give it up but OP and OP's Dad sound equally weird. \n\nThey all sound like toddlers.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It probably made the atmosphere... tense. They're at a habatchi sitting around the same table.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "She should be confronted for not giving someone something for free? That’s stupid. \n\nI agree she’s petty and has some weird hang ups but if she doesn’t want to give someone her food that she paid for, who fucking cares?\n\nTo paraphrase this sub:\n\nHer food, her choice.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Maybe I misunderstand it, but the fat would have been thrown away? It is not as if she had the fat on her plate and OP's dad wanted it.\n\nThe fat would have ended up in the trashbin. When she protested, it actually did.  With all the amount of waste we produce, I find this .... not ideal.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "It is a about a fucking piece of fucking fat.\n\nI think you need to be confronted about childish behavior.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "This is very Larry David of you and I love it",
              "id": 16,
              "comments": [
                {
                  "score": 34,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 7,
                      "content": "> why this woman had a problem with giving a sickly older man her actual garbage.\n\nSHe might just have some weird issue about someone \"taking\" some of the food she paid for. Like if you told the waiter you didn't want the soup that came with your entree and another customer asked to the waiter to have it. \n\nAlso, I am one of those people that hates watching people eat fat. It just grosses me out to no extent. \n\nIn this situation I don't think the dad did anything wrong, and I think the woman should have let it go, but I think OP was the person who is actually the biggest asshole because he decided to spend the dinner starting an argument with a stranger rather than just enjoy their dinner.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "\"giving a sickly older man her actual garbage\"!! \n\nThis isn't a great comparison, but it's the best I can come up with:\nWhere I live you can collect cans and bottles, take them to a place and receive ~5c per item. \nI'm part of a FB group for my town and sooo many people complain about catching people going through their recycling bins (when they're already out on the street, ready for collection).\nLike, you were about to throw it away. Why do you care? \nI live in an apartment, so I have a huge communal garbage bins. I know what days a particular dude comes to collect cans and bottles, so I make sure to leave them in a milk crate next to the dumpster so he doesn't have to sort through it.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I think the lady is more LD. I could see him arguing over this.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Obviously, I don't know for sure why she would object, but I can offer a possibility.  \n\n\nI know people who like to eat the fat off of cuts of meat. I find it incredibly gross. It's a texture thing, and just the thought of someone eating it actually turns my stomach a bit. It's not rational, but the revulsion is mostly out of my control.  \n\n\nIf she has a similar revulsion, knowing that someone was eating the fat off \\_her\\_ steak might trigger a similar reaction, because it would be harder for her to just not think about. Again, not saying it's rational, and I think her \"It's mine, therefore I want it thrown away\" rationalization is pretty weird.  \n\n\nI honestly don't know whether to go ESH or NAH. Though, I'll note that I definitely don't think your Dad did anything wrong by asking. It's fair to just not want to see something wasted.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Pro tip: someone acting irrationally rarely, if ever, will have a rational explanation for their actions.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "NTA, good for you for telling setting her straight. If the chef is discarding the fat before her serves the streak then it’s not hers anyway.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Asking her why has no benefit and only serves to cause a scene",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You will never get anywhere arguing with crazy.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "As I see all the time on this sub: She paid for it so she can do what she wants with it without having to explain why.",
              "id": 26,
              "comments": [
                {
                  "score": 3,
                  "content": "If the fat is not served, it becomes waste. Waste is property of the business. It was never on the old hag's plate I don't see her having any claim of ownership over it.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "NTA When my Dad was diagnosed with stage IV lung cancer I got incredibly confrontational about everything no matter how petty. I chalked it up to I was pissed with his bad luck and I wasnt about to let people take advantage of their privilege. When I sassed someone and someone else tried to tell me I \"shouldnt do that\", I always said it was out of love and wanting to teach people to be better; but I almost always come off like a huge bitch (it never really went away I have just learned to tone it back when it truly is not worth it (but damn it if my dad wanted some steak fat you bet your ass I would have actually fought someone to get it for him))",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 93,
          "content": "I think this woman must have never been to a benihana in her life. Because she thought the chef would be literally taking the food from her plate. Definitely the prettiest argument I've ever heard\n\nEdit. Leaving it cause it's funny but I meant pettiest lol",
          "id": 30,
          "comments": [
            {
              "score": 17,
              "content": "What a pretty argument, right? So many beautiful colours.",
              "id": 31,
              "comments": [
                {
                  "score": 9,
                  "content": "🤦",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 74,
          "content": "Agreed. Even though she was rude, you technically didn't have any right to the fat to her streak. You should have let it go and let your dad eat the fat on his steak instead of asking for hers.",
          "id": 33,
          "comments": [
            {
              "score": 65,
              "content": "I dont understand this argument because technically at a hibachi restaurant all the food the chefs cook are everyone's? All the food is cooked together, it's not like you get a whole steak, they cut the steak up and then give it to who ordered steak, probably getting pieces from either steak. Also when you throw something away doesn't that technically make it not yours any more",
              "id": 34,
              "comments": [
                {
                  "score": 19,
                  "content": "I get your point and OP is NTA but my experience at these restaurants is that everyone who orders steak gets their own individual steak, cooked to their preference. People can be very picky about that. I’ve def seen chicken and shrimp all cooked together though. It may vary from place to place so I’m not saying you’re wrong, I’m just sharing my experience.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That has been my experience too, but I guess it could vary.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Yeah the food isn't yours until it's on your plate. Until then the restaurant does what they like with it. They'll divide a large piece of meat for two peoples dinners, for example. Normally you don't see that process.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "But if the fat isn’t part of the food she’s actually buying, that they are serving is it really hers? Since they aren’t actually selling the fat, isn’t it the restaurants and theirs to as they please with?",
              "id": 38,
              "comments": [
                {
                  "score": 38,
                  "content": "Who fucking cares though? Let the weird lady withhold the fat that may or may not be hers. It sounds like the Dad still got the fat from his steak AND other steaks, which is more than he would have gotten if the chef had never cut the fat off his steak in the first place. How much fat does one person need?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yes agree",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I second this ruling and reason. ESH",
          "id": 42,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3313,
      "content": "I'm gonna go against the grain and say NAH just a bunch of real weirdos. Just a really weird situation of weird people. Steak fat? Other people's food? Throwing it away? Public confrontations with strangers at a restaurant? Are any of you even from Earth?",
      "id": 43,
      "comments": [
        {
          "score": 1273,
          "content": "[deleted]",
          "id": 44,
          "comments": [
            {
              "score": 177,
              "content": "Uhhh...I can confirm that even people in Arkansas aren’t this weird.",
              "id": 45,
              "comments": [
                {
                  "score": 171,
                  "content": "As an Arkansan who has asked the family to fork over their fat at many social gatherings, I resent this statement.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Sure, but I’ve never seen any of my friends or family members deny their unwanted pieces of fat to someone else purely because they didn’t want that person to have it and would rather see it go to waste. That’s by far the weirder part of this story to me.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I resemble that remark",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 2,
                      "content": "They arent from here homie. This is something that would happen in Memphis or Atlanta.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "> Uhhh...I can confirm that even people in Arkansas aren’t this weird.\n\n\n\nI am a native of Florida and yes, yes I can confirm that people are this weird.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Y’all ever worked in retail? Weird people are all around you.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "As a non-Arkansas living in Arkansas, the people here are definitely that weird.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 123,
              "content": "> Yea... no just cut all that fat up and serve it to me like it’s cow onion rings... disgusting.\n\nMy mom comes from a poor farm family. Damn straight her side eats the fat.",
              "id": 54,
              "comments": [
                {
                  "score": 84,
                  "content": "everyone should, its fucking delicious.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Thank you! It's my favorite 100%. Why do you think people pay $40 for a ribeye?!",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "I think people fuck up and confuse heavy connective tissue and fat, eat gristle, and think they dislike fat",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "it's so gross. weird taste, weirder texture. trim the fat.\n\nand also if somebody *wants* my steak fat when i'm eating they can *have* it.",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Some of us want to eat healthier.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I love steak fat, not sure if its related to growing up (and being, but manager's special clearance steak is perfectly good if you eat it within a day or two, or freeze it.) poor or not but its tasty.\n\nPlus, and I have no idea if these are related, but getting regular fatty steak (like, making one medium steak into three meals or so) makes my depression easier to deal with. Its probably the iron, not the fat but anything for those sweet, sweet serotonin boosts.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "[deleted]",
              "id": 61,
              "comments": [
                {
                  "score": 18,
                  "content": "I mean, you aren’t wrong though.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Wasting food is disgusting",
              "id": 63,
              "comments": [
                {
                  "score": 52,
                  "content": "Steak fat can only subjectively be called food",
                  "id": 64,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Fat is definitely food, and I'd hate to live in a world without it. Plus who cares what other people enjoy?",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "I mean, fat has a ton of calories. It's definitely food. Not something I like at all, but I'm not so privileged that I would tell people they can't eat it.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "wrong",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It's actually objectively food! Did you confuse the two words?",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "You are objectively incorrect.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Have you never had a NY strip or a ribeye? Fuck even a top sirloin is gonna have fat on it. it's part of the steak and adds to the flavor.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Hey hey hey, grilled steak fat is fucking delicious. If it has no cartilage, that is. Fat has the most flavor.",
              "id": 71,
              "comments": [
                {
                  "score": 9,
                  "content": "Cartilage is also delicious. Love, an Asian person",
                  "id": 72,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It is, but my teeth just cannot rip through it.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "love me a good braised beef soup with cartilage in the meat that melts in your mouth. just had it for dinner last night and it's all I can think about mmmmmmmm",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It’s 2am and this comment made me 😂. I understand that emoji now.",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "This feels like a particularly weird episode of Seinfeld",
              "id": 76,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "This is some California shit. Doesn’t even sound super weird to me.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "I’m fucking crying laughing",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 185,
          "content": "You know, youre 100% right. We are all really fucking weird. Not Arkansas though! Pittsburgh actually",
          "id": 79,
          "comments": [
            {
              "score": 74,
              "content": "Well, that does explain quite a bit actually!",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Yinz gon’ eat ‘at?",
              "id": 81,
              "comments": [
                {
                  "score": 6,
                  "content": "im fucking dying as somebody who has a friend from pittsburgh",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Of course you’re from Pittsburgh.  \n\n\nSource: am also from Pittsburgh.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Do they put fries on the hibachi put there too?",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That lady sounds like a reaal jagoff ;)",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "No way! Which steakhouse if I can ask? I've been wanting to try one around there and don't have anyone to get opinions from.",
              "id": 86,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 91,
          "content": "This!!! The first properly sane thing I read on this thread! Thank you good sir.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "[deleted]",
          "id": 88,
          "comments": [
            {
              "score": 25,
              "content": "Curb Your Enthusiasm",
              "id": 89,
              "comments": [
                {
                  "score": 3,
                  "content": "Take the fuckin pie!!",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "LOL thank you, this is so \"first world problems\" that it's hilarious",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I imagined it as Arthur Dent at the Restaurant at the End of the Universe.",
          "id": 92,
          "comments": [
            {
              "score": 17,
              "content": "I think a cow serving itself as dinner is less weird than this situation",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "This comment made me laugh so hard I choked. 😂",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Haha my favorite answer. Except I’d just change it to ESH but same reasoning.",
          "id": 95,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Sounds like a fight from a cartoon",
          "id": 96,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Hahaha when i was reading it I wasnt thinking who was the asshole here but I was thinking that this is such a weird group of people. I would really want to see a picture of OP's family.",
          "id": 97,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 860,
      "content": "ESH.\n\nYou both were assholes. \n\nI don’t understand why she didn’t want your father to have it, but it was her right to say no since it was her meal that she paid for. Just because you didn’t like the outcome doesn’t give you the right to yell at a stranger and ruin everyone’s evening.\n\nManners, sir. You don’t have to agree but you can behave civilized and be polite to others.",
      "id": 98,
      "comments": [
        {
          "score": 245,
          "content": "Just because it was “her right” doesn’t mean she can’t be criticized for being an asshole. It’s technically my right to walk out on the street & tell the next person I see that they’re hideously ugly, but it’s their right to tell me off in return.  She got what she deserved for being an irrational selfish weirdo.",
          "id": 99,
          "comments": [
            {
              "score": 215,
              "content": "No one is saying that woman isn't an asshole, but everyone here is an asshole (ESH) or, at minimum, weird as fuck. \n\nWanting a separate plate of steak fat is pretty weird. Preferring to throw out steak fat so someone else at your table can't eat it is weird. Arguing over this is weird. Was her steak fat really going to make a major difference to the dad? Why didn't she want him to have the steak fat? Why did this bother OP so much? Why not order more steak if the steak fat is that important to him and his father? Are these people from this planet? So many questions remain unanswered.",
              "id": 100,
              "comments": [
                {
                  "score": 119,
                  "content": "I don't really think the fact that it was steak fat really matters much. \n\n\"I'm going to throw away this food\"\n\n\"oh, I'll eat it\"\n\n\"no, I want to throw it away. I get to decide because it's MINE\" \n\n\"...but...why?\"\n\n\"to keep your filthy hands off of it\"\n\njust...what? that person is insane. it's totally reasonable to be like \"what the fuck?\" in response to that level of insanity.\n\nI'm a meat eater but... also the morality of killing an animal to throw away some of it when someone else is right there, wanting to use/eat it.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 33,
                      "content": "[deleted]",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Exactly! That's what pisses me off the most.... An animal had to die for you to eat it and that is just the most entitled and selfish thing to do. Fuck her. People are so wasteful and don't give a shit about anything but themselves. I would have snapped on her.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "I don't think that loving steak fat is weird. Maybe it's not \"standard\", but him and the lady aren't on the same level at all. Wasting food over allowing someone else to have what you don't want however is pretty selfish.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": ">wanting steak fat is weird. \n\nYes because you said so.\n\nThey probably didn't order more steak because they simply can't eat that much.",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Do you know what sub you're on? OP was weird for arguing, the dad was weird for wanting fat on a serperate plate. However the women was the asshole for refusing to let them have it, especially if she's just throwing it away.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Ikr, gotta love the “it’s legal so it’s moral” arguments on this sub.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "No, it’s her steak, leave her alone.  This is bordering on begging for other people’s doggie bags.\n\nMaybe she’s just annoyed by their entitlement.",
              "id": 108,
              "comments": [
                {
                  "score": 36,
                  "content": "I don't think it's entitled to ask for something no one else wants. This kind of restaurant is a shared experience and I think it's totally reasonable to ask. It's unreasonable to say no, but it's also unreasonable to yell at her for saying no. I'm taken aback by her refusal, but I'd just shrug, say okay, and think to myself that she's a cow. So ESH.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 23,
                      "content": "> I don't think it's entitled to ask for something no one else wants\n\nNeither the dad or the chef did ask the others, though.  The chef sucked for not asking and it would have been the polite thing to do for the dad to ask the others if they minded instead of just taking other people’s fat.\n\nI probably wouldn’t care but the dad’s entitlement and the son’s outrage really rub me the wrong way.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": ">it’s her steak, leave her alone.  \n\nOP did though as their request didn't change anything about her dish, it would've been served to her without fat either way",
                  "id": 111,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Both the dad and the chef should have asked the others.  Maybe other people like fried fat too.  \n\nIt’s the fact that the dad/son felt he was entitled to it that probably upset her.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "> Just because it was “her right” doesn’t mean she can’t be criticized for being an asshole.\n\nThe person you're replying to literally said:\n\n> You both were assholes.",
              "id": 113,
              "comments": [
                {
                  "score": 3,
                  "content": "People are having serious reading comprehension problems in this thread. There will be a comment calling them both out and then a bunch of people like \"So why does she just get a pass?!\"",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Making a scene about something as petty as withholding steak fat is an asshole move. Answering asshole with asshole still makes you an asshole",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My guess is that she thought it was gross that he was eating just the fat but didn't want to shame the man for it so did all she had control over, giving him less. That way she didn't have to think about it as much.",
          "id": 116,
          "comments": [
            {
              "score": 1,
              "content": "I'm surprised more people aren't talking about this angle. I feel like I'd react better than her but if somebody asked for the fat from my steak I'd definitely be caught off guard and weirded out. I wouldn't exactly be thrilled to watch some dude sitting next to me scarf down the fat from the entire table's steaks.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "How was it her meal that she paid for? That part wasn't being served to her. When you buy food at a restaurant, you are entitled to everything they serve you, not the parts they don't serve you.\n\nIt's like if a restaurant served broccoli and removed the stems, and each individual stem was the legal property of whomever the top part of that stem was served to. It's absurd; that wasn't hers. This whole thing is bizarre, but everyone saying it was her steak fat has some weird concept of ownership.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "In this sub, if you don’t act like a doormat you’re labelled an “asshole”.",
          "id": 119,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 567,
      "content": "ESH\n\nshe's weird, you made a mountain out of a molehill. \n\nnext time, repeat after me, \"weird flex but okay\"\n\nand you move on",
      "id": 120,
      "comments": [
        {
          "score": 106,
          "content": "Nothing takes the wind out of someone who hasn’t heard it before’s sails like “weird flex but okay”",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Highly underrated comment.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 348,
      "content": "NTA.\n\nI expected this to go in another direction when I read the title, but once the fat was removed from the steak, the only thing that prevented it from being trash is the fact that your dad wanted to eat it. I think the woman in this story is petty to an extreme degree and is the asshole here.",
      "id": 123,
      "comments": [
        {
          "score": 208,
          "content": "[deleted]",
          "id": 124,
          "comments": [
            {
              "score": 93,
              "content": "With you 100%. People are giving the dad shit because he's \"weird\" for liking fat. Who cares, it doesn't affect you and it wouldn't have affected the lady either because it just went in the trash!",
              "id": 125,
              "comments": [
                {
                  "score": 43,
                  "content": "[deleted]",
                  "id": 126,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yeah exactly. If someone doesn’t want a part of their dish they usually just serve it out to the others. How self centered do you have to be to say “no one gets mine.”",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Probably terrible cooks themselves so they only have had unrendered unseasoned fat.\n\nNta. Nta. Nta.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "People that picky always have shit taste in food. If you tell me you don't like fat I automatically know you can't cook for shit.",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Unfortunately we live in a time where food is wasted left right and centre. It's so sad",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "I agree. She sucks and I’m glad you told her",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 191,
      "content": "YTA, one I can see her point because that sounds revolting, but why on eart would you escalate something this stupid? It’s her steak leave it alone.",
      "id": 132,
      "comments": [
        {
          "score": 133,
          "content": "[removed]",
          "id": 133,
          "comments": [
            {
              "score": 24,
              "content": "OP or the Woman? Because as I see it, OP isn't entitled to someone else's food no matter if they throw it away because its their food. YTA",
              "id": 134,
              "comments": [
                {
                  "score": 192,
                  "content": "Wasting food just because you want to be right is a dick move. NTA",
                  "id": 135,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Consider this: ESH",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "[deleted]",
                  "id": 137,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Especially at this kind of restaurant. Don't they generally cook strips of meat individually and divvy them up to the people at the table? It's usually not as simple as \"his steak, her steak\"",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 55,
                  "content": "How out of touch do you have to be to not recognise wasting food as something awful. \n\nIt really is a horrible thing to do and that woman needs to be called out on her shit",
                  "id": 139,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">How out of touch do you have to be to not recognise wasting food as something awful.\n\nEating steak itself isn't very sustainable. Neither is driving to a restaurant to eat. Tossing out what is by OP's own description, a  small portion of fat, is the least wasteful part of that meal.",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "It was trash, not \"her food\"",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Dude was cutting it off as he was cooking it. It wasn't *her* food it. Its not like she was being served and then the chef came over and trimmed the steak in front of her. \n\nAlso in my experience, hibachi chefs cook everything at the same time so whos to say who's is who's until its on the plate in front of you.\n\nSure, homie didn't really need to make a big deal. But also the old bitty didn't really need to make it a big deal either. \n\nESH but the old bitty sucked first.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It's not her food tho.. It hasn't touched her plate yet.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_1._be_civil)\n\nPlease [review our rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index) before posting again.\n\n[Message the mods](https://www.reddit.com/message/compose/?to=/r/amitheasshole&subject=/r/AmItheAsshole&message=Please+link+to+post+or+comment+for+context+[we+cannot+review+without+this+info]:%0D%0DDescribe+your+question+in+detail:) if you have any questions or concerns. Please do not reply to this comment with an explanation, argument or apology and instead use modmail.",
              "id": 144,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "You're right I shouldn't have, but from my point of view it was something stupid for her to even speak up about because it didn't affect her one bit.",
          "id": 145,
          "comments": [
            {
              "score": 149,
              "content": "It's not exactly brilliant for your dad to eat a hibachi table's worth of steak fat, in addition to his meal, unless he's actively trying for coronary disease. You fighting with a complete stranger to the same end is even stranger.",
              "id": 146,
              "comments": [
                {
                  "score": 58,
                  "content": "To be fair, I think only 3 or 4 people ordered steak, so it wasn't completely absurd. Definitely nothing I would eat, but he's battling stage IV colorectal cancer right now so I let him eat what he wants",
                  "id": 147,
                  "comments": [
                    {
                      "score": 97,
                      "content": "I think I might get sick watching someone eat 3 steaks worth of fat",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Fat does not cause coronary disease and he’s got stage IV cancer 🙄",
                  "id": 149,
                  "comments": [
                    {
                      "score": 63,
                      "content": "Excess fatty foods can definitely cause coronary disease. Fat gets transported in cholesterol, high cholesterol leads to plaques, plaques lead to heart attacks.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "Lol, what?!  Animal fat doesn’t cause coronary disease?  What does in your world?\n\nAlso, what do you think led to the colorectal cancer?",
                      "id": 151,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "High cholesterol is a major cause of coronary disease and cancer wasn't mentioned in the OP.\n\n\"You have cancer, by all means spike your cholesterol with beef fat for your best chance of beating this disease\" said no doctor ever.",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Maybe she didn't want to watch someone at her table eat fat? That sounds pretty gross and just the thought of that is a bit stomach churning.",
              "id": 153,
              "comments": [
                {
                  "score": 35,
                  "content": "Don't fucking look then.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 16,
                      "content": "She wanted to not look *and* not participate. \n\nDad was doing something some find disgusting and the woman was under no obligation to assist him in continuing the behavior.\n\nIf I don’t want to see it, I’m not going to contribute to it.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Well, it was going to happen regardless, so that is a moot point.",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "After cooking at a hibachi steakhouse, that fat will look like a brownish white cube of something.  Meanwhile, the squash will also look like a brownish white cube of something.  If someone else eating either causes you to get sick, then you have a problem.",
                  "id": 157,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "You don't know that. Perhaps she found it to be REALLY disgusting and unappetizing, but she didn't want to say that out loud. So she did some damagecontrol instead. Who knows, perhaps she went home patting herself on the back for keeping that to herself, despite the fat-eaters offsprings attempt to bait her.\n\nOr she's an asshole.\n\nPoint is, her reacting warrants a \"really?\" (said in a \"are you kidding me?\" way) and a headshake. Escalating is asshole behaviour, and ruins the evening for almost everyone.",
              "id": 158,
              "comments": [
                {
                  "score": 3,
                  "content": "ESH. It is assholeish behavior because of the setting of the situation but in OP's shoes I'd feel a bit ticked cause of her reasoning. Some people have pointed out that she might feel disgusted by the dad eating the fat but her taking away her portion wasn't gonna stop him from eating the fat he was already going to get.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Yeah it was a stupid thing for her to speak up about but it was just as stupid for you to escalate it and make an awkward scene. For whatever reason (even if that reason doesn’t make sense to you), she DID feel affected by it. So you should have just thought to yourself “Wtf, that was weird” and moved past your mild annoyance. Plus, your dad was already getting the fat from other people’s steaks so it’s not like he was getting shafted in the situation.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It also didn't affect you one bit. It affected your dad who probably didn't care. I'm sorry but you're the one who ruined the evening by deciding to have a public confrontation at dinner, not the woman being weird and a bit selfish.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Even though you are technically right, it does not mean that you need everyone to know how right you are.  Sometimes you just need to let things go.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No you weren't completely in the right. Fuck that lady. And fuck anyone who says otherwise.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I just think it’s weird because I like the fat left on my steak, but I’d be like “oh can you leave the fat on for mine, please?” I wouldn’t try to claim the entire table’s extra portions of fat, much less make a scene about it lol.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I don’t think you understand where they went to go eat. The chef cooks in front of you. Everyone’s meal is already prepared together, then he splits it. In no way, shape, or form would the father have touched or infected the steak that would be going to her plate.\n\nImagine him cooking in the back & putting the fat aside, then bringing out her steak without the fat on it & his steak with the removed fat on a separate dish. Same shit.\n\nHow is this revolting?? No one else is touching her steak except the chef & her.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Honestly anyone who doesn’t think this woman is a bitch is probably also a bitch. Who the fuck would say no to that request who wasn’t borderline mental? That’s probably her only excuse for saying no. Genuine illness or a victim of some sort of abuse. To throw something away in someone’s face...jesus",
          "id": 166,
          "comments": [
            {
              "score": 3,
              "content": "Exactly. Some people here are so dumb. Just selfish entitled picks. Who only care about themselves. Probably litter and don't recycle.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "He doesn't actually have to touch anything frok on her plate",
          "id": 168,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I don't see her point at all.  She didn't want that part of the food and it's hibachi, it all gets cooked together anyways...  and what's revolting?",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 175,
      "content": "This can't be real. \nINFO How could 1 steak worth of fat not be enough?",
      "id": 170,
      "comments": [
        {
          "score": 60,
          "content": "They were all sirloin I believe so there wasn't very much fat on one steak.",
          "id": 171,
          "comments": [
            {
              "score": 206,
              "content": "Dude. This is weird, I hope you know that.",
              "id": 172,
              "comments": [
                {
                  "score": 120,
                  "content": "Oh it is 1000% weird and I will never deny that haha. But, thats my dad and I stick by him",
                  "id": 173,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Ignore these idiots.",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Its not weird at all. What the hell is wrong with reddit today lol? Everyone is judging based on their diet. Asking some dumbass why they are acting like a moron isnt enough to push you to any asshole status.",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -4,
                      "content": "...by ruining his night out with your pettiness, got it.",
                      "id": 176,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Doesn't matter what you think. That is beside the point.",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I’m not a steak eater. Can someone explain what the hell “steak fat” is?",
          "id": 178,
          "comments": [
            {
              "score": 2,
              "content": "The fat, gristle, non protein bits.",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 153,
      "content": "ESH. Ok, I totally get where you're coming from. That lady was a bitch, I don't deny that. \n\nBut come on dude. It wasn't worth starting a fight over it. I'm sure your dad would have preferred to have slightly less fat and a calm, enjoyable evening. This is one of those cases where you're right, but you chose a terrible hill to die on.",
      "id": 180,
      "comments": [
        {
          "score": 42,
          "content": "You're definitely right there. I shouldn't have escalated it. I honestly just wanted to know why it was an issue to her. It turned into more of a principle thing for me that she'd rather something go in the trash than go to another person",
          "id": 181,
          "comments": [
            {
              "score": 82,
              "content": "Escalating fights for \"principle\" is a dumb thing to do.   Argue when it's about something important, not just because you know you're right and they're wrong.",
              "id": 182,
              "comments": [
                {
                  "score": 8,
                  "content": "Principle is what's important to me. I believe you should only argue if it's about the principle of the matter.\n\n If you make a genuine mistake and cause me bodily harm I will hold no grudge. But if you deleiberately cause me a minor inconvenience I will, because all that matters to me is why you did something. This lady would rather continue throwing food in the trash than let somebody else enjoy it",
                  "id": 183,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Dude, I did not sign on to your kink.   When I'm eating out, I do not want to be witness to a third party's arguing on principle.  I want to have a civilized go-along get-along experience.",
                      "id": 184,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Lady was selfish and he called her out on it.   Since his dad agreed there's no harm to him I'd say go for it.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 20,
                      "content": "There was a harm to everybody else at the table, who was trying to have a pleasant, quiet meal.",
                      "id": 186,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Yeah. OPs principles are for one self, not for others.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "> Argue when it's about something important, not just because you know you're right and they're wrong.\n\nAlso argue when you know you will win easily, even if it's not all that important.  At least, do that unless pragmatism is against your principles (not being sarcastic, I know philosophy majors/minors who either hold that principle or argue from it somewhat regularly).",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "She should have just kept her big ol mouth shut.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "But it’s not even a principle, it’s her food to do with what she wants.",
              "id": 190,
              "comments": [
                {
                  "score": 29,
                  "content": "This attitude is terrible and super assholish. If you are literally willing to throw something away, and somebody else offers to take it, and enjoy it, and make use of it. You denying them that is just straight up petty and shitty behaviour. Just because it’s « your right » doesn’t make you right.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I mean, she's an asshole and I would never do it, but I can kind of see her point of view. Here she is out to a nice dinner and all the sudden this weirdo (and maybe she doesn't know it's his birthday or that he has cancer, right), so anyway this weirdo is wanting a plate full of steak fat to eat in front of her and maybe it grossed her out. Nothing she can do about that but then he also wanted her steak fat and she's already grossed out and the thought of some guy near her eating her steak fat is grossing her out even more so she's like no he can't have my steak fat! Then this other guy is like, give him your steak fat! And she's like, no it's my steak fat and he can't have it! And he's like, it's extra steak fat, bitch, now give it to him! And she's like no it's my steak fat and you can't make me!\n\nSo you see really they're all crazy.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "[removed]",
                  "id": 193,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_1._be_civil)\n\nPlease [review our rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index) before posting again.\n\n[Message the mods](https://www.reddit.com/message/compose/?to=/r/amitheasshole&subject=/r/AmItheAsshole&message=Please+link+to+post+or+comment+for+context+[we+cannot+review+without+this+info]:%0D%0DDescribe+your+question+in+detail:) if you have any questions or concerns. Please do not reply to this comment with an explanation, argument or apology and instead use modmail.",
                      "id": 194,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Your night sounds like an episode of Curb Your Enthusiasm. Larry David wouldn't have been able to let it go either.",
              "id": 195,
              "comments": [
                {
                  "score": 3,
                  "content": "I was thinking exactly that, and was wondering (since I'm coming to the thread late) if I'd see a comment saying that.\n\nIn fact I'm not entirely unsure that Larry David made the post himself as a writing exercise.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I'm wondering how many people on this sub think Larry David is knight in shining armor who unjustly suffers for his principles. Lol.",
                      "id": 197,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "[deleted]",
              "id": 198,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Yep, I have the same principle as you so I totally get where you're coming from. But a birthday dinner is just not a good time to start scrutinizing strangers' principles.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "NTA\n\nFrom it seems, not inky was it going to get thrown away anyways, the chef was more than happy to cook it up and serve it to him. Seems this lady was the real ass for simply depriving someone of something that caused her no real harm",
      "id": 200,
      "comments": [
        {
          "score": 41,
          "content": "That's pretty much exactly as I saw it. In my mind, it didn't affect her one single bit, so I didn't see a reason why she had an issue with it",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah I consider it to still be in food prep at that point, if the dad asked for extra fat at a regular steakhouse (Which would be kinda weird) and they take it from another person steak, its not hurting her to have it go to him.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 55,
      "content": "NTA - that lady’s behaviour was bizarre. \n\nTo be honest I suspect half the conflict was trying to understand her position. And when you confirmed there was no logic, it suggested her position was entirely out of spite.\n\nThat’d make me kind of irritable. What an eccentric woman. I wonder if she has a butler at home and her lifestyle is “just so”. \n\nOn the flip side I suppose If you were a perfect politician maybe you’d have recognized the value in dropping the subject earlier for the sake of the evening, but a regular person would be in uncharted territory there so I cut you slack.\n\nI also tend to stick up for family on their birthdays even more than other days.",
      "id": 203,
      "comments": [],
      "relation": "Support"
    }
  ]
}