{
  "post content": "Okay, I normally never post but I would truly like to know if I am in the wrong here.\n\nWe are on vacation in Austria for a whole week (for those who do not know, they speak German there. I however do not...). We did some super fun activities including rafting and sledding (on those iron rails, super fun!), but in the end I mostly looked forward to going to a Stift (Abbey, or Monastery or however you want to translate this). \n\nI really love to learn so I was truly looking forward to this. The best part of my holiday always is going to Cathedrals, Castles or, in this case, an Abbey. I like to see those things and learn about these monuments, so I truly looked forward to going to the Abbey. I looked it up beforehand, there was a tour and I convinced my family to go!   \n\nWell, today we went. And when we got there, we were in that tour with two Frenchmen and a German. The tour guide asked us what language we would like the tour to be, and I asked it to be in English. She (the tour guide) speaks (as i know of) proper English, German, and French. The Frenchmen asked it to be in French, the German asked it to be in German (all logically...). She said she would not like to do the tour in three languages, but it wouldn’t have been a problem if she would have had to do it. It would just take a little longer. \n\nSo then my mom really quickly caved in and said only German and French is fine. My mother is sufficient in fluent, but not a sufficient interpreter. So that’s that... The tour was only done in German and in French...\n\nThe thing I loved to do the most on holiday was for me a big disappointment because I was not able to understand a word in German. I really tried my best because I’d have really loved to know what she said but it was just not possible for me to understand what she said. \n\nI became quite mad by the fact that I was not able to hear the tour, which I looked forward for quite some time (didn’t do anything bad, I was just visibly mad). I said this to my mom, but she said that she’s done all that she’s can and that the tour guide really can’t do it in three languages. I did not ask the tour guide again because my mom would have became mad if I did.\n\nDuring the tour, my mother told me to get over myself and that there was nothing she could have done to make sure the tour would also have been in English. \n\nI disagreed and became mad at my mom because this was the ONE thing I truly cared about this whole holiday, because to tell you all the truth - haven’t told this to anyone because it seems ungrateful for this vacation - I’d just as much would have loved to stay home this week EXCEPT for the abbey. \n\nSo, was I the A-hole for getting mad the tour was not in a (for me) understandable language? And for getting mad after my mom telling me to get over myself?\n\nEdit: ‘I said this ... if I did’\nI think the original post is still in the comments.\n\nMy mom knows I do not understand German\n\nOkay, I’ll be going to sleep now. I’ll reply in the morning if my WiFi is working (it’s a bit wobbly here where I am staying.\n\nGood night!",
  "id": 1,
  "comments": [
    {
      "score": 13,
      "content": "NAH.  It would have been extremely difficult for the tour guide to do it in three languages.  Rather, it was the fault of the tour that didn't address the potential issue in advance.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "That was my original reason (together with my mom getting mad if I did) of not standing up for myself. I should have just done that!",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA - the point of the tour is to learn about the sites which you can’t do if you can’t understand them  - that’s why there are tour guides who speak different languages. The real asshole here is the tour company who didn’t properly schedule groups based on language or have those little radios available that gives the tour in different languages. I also think the tour guide is a bit of an asshole - while I understand it would make their job more difficult, that’s not your fault",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "I think they had some language-specific tours but they were thrown out of the window due to corona. Now it was just in the language of whoever showed up...",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "ESH - You should have spoken up that it's important for you, you haven't, your fault. \n\nThe guide is an ass for being this ignorant. All of his job is explaining the sights to tourists and he was too lazy to do so. He wouldn't have asked if he wasn't lazy. \n\nThis shouldn't even happen, there should be language specific tours. This is the first time I've heard of this. \n\nAnd lastly, your mom should know you don't speak german and that you are interested in this. That's also not cool.",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "I do realise I should have just told the guide about it... I just did not want to be rude... \n\nLanguage-specific tours were a thing (I guess) but due to corona there are only two tours per day... So no specific language tours were possible.",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "As far as I can tell the tour guides didn't know you would only understand English, you said it was your preference but then your mum answered for both of you that German is fine. So the tour guide took her word and isn't to blame. The issue is between you and your mum. In which case NTA. May I suggest before tours buying a book about the sites. I have had to go on tours when it was in a language I didn't speak. It was about seeing the sites and then researching them on my own.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "Ah. That might be it.\nMaybe doing my own research beforehand would have been a good idea. I just saw the word ‘English’ as languages listed and I stopped looking for information.\n\nOtherwise the tour guide would not have anything to tell me ;)",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "Yta\n\nIt's an over reaction by you and you still got to see the sites, if it truely mattered you should have spoken up when it was happening.\n\nYou should be mad at your mom though.",
      "id": 10,
      "comments": [
        {
          "score": 2,
          "content": "I did speak up! - I will edit that in as I forgot - but not to the guide as my mom forbid me to do so as it would have been considered rude (she was already giving the tour in two completely different languages)",
          "id": 11,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH Your mom shouldn‘t have asked for the tour in a language that you don‘t understand, and you should have spoken up about it if it bothered you that much. Also maybe you can find the info or even a virtual tour online, so maybe try that instead of being mad.\n\nOn a completely unrelated subject, which Stift did you got to?",
      "id": 12,
      "comments": [
        {
          "score": 3,
          "content": "Yes. I should have spoken up. I think (as been told by another comment) the tour guide did not know I was not able to speak German. \n\nI went to the Stams Stift in Tirol. Truly beautiful! Would have loved to learn more about it! ;)",
          "id": 13,
          "comments": [
            {
              "score": 2,
              "content": "No way, that‘s like 20 minutes away from where my mom grew up!",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA pretty lame of the tour company to not be accommodating. You’re paying for the tour that’s now pointless because you can’t understand it. It’s not entitled to want to understand something you’ve specifically paid for. Your mom sucks for making it acceptable for her and not you.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Your mom's right.",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay, I normally never post but I would truly like to know if I am in the wrong here.\n\nWe are on vacation in Austria for a whole week (for those who do not know, they speak German there. I however do not...). We did some super fun activities including rafting and sledding (on those iron rails, super fun!), but in the end I mostly looked forward to going to a Stift (Abbey, or Monastery or however you want to translate this). \n\nI really love to learn so I was truly looking forward to this. The best part of my holiday always is going to Cathedrals, Castles or, in this case, an Abbey. I like to see those things and learn about these monuments, so I truly looked forward to going to the Abbey. I looked it up beforehand, there was a tour and I convinced my family to go!   \n\nWell, today we went. And when we got there, we were in that tour with two Frenchmen and a German. The tour guide asked us what language we would like the tour to be, and I asked it to be in English. She (the tour guide) speaks (as i know of) proper English, German, and French. The Frenchmen asked it to be in French, the German asked it to be in German (all logically...). She said she would not like to do the tour in three languages, but it wouldn’t have been a problem if she would have had to do it. It would just take a little longer. \n\nSo then my mom really quickly caved in and said only German and French is fine. My mother is sufficient in fluent, but not a sufficient interpreter. So that’s that...\n\nThe thing I loved to do the most on holiday was for me a big disappointment because I was not able to understand a word in German. I really tried my best because I’d have really loved to know what she said but it was just not possible for me to understand what she said. \n\nI became quite mad by the fact that I was not able to hear the tour, which I looked forward for quite some time (didn’t do anything bad, I was just visibly mad) and when my mother told me to get over myself and that there was nothing she could have done to make sure the tour would also have been in English. \n\nI disagreed and became mad at my mom because this was the ONE thing I truly cared about this whole holiday, because to tell you all the truth - haven’t told this to anyone because it seems ungrateful for this vacation - I’d just as much would have loved to stay home this week EXCEPT for the abbey. \n\nSo, was I the A-hole for getting mad the tour was not in a (for me) understandable language? And for getting mad after my mom telling me to get over myself?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    }
  ]
}