{
  "post content": "I (28M) am an only child. When I was 12 my parents divorced when my dad found out my mom cheated on him. This was devastating to my dad. My parents were best friends and started dating when they were 17. I played sports and my dad was my coach so I had a much closer relationship to him then my mom. I was suppose to spend one week at my moms then the next week at my dads. But I would usually just lock myself in my room at my moms. Usually my dad would drop me off and I would get on my bike and ride the couple miles back to his house. My mom would ask me things and I would literally pretend like she didn’t exist. It got so bad that lawyers got involved thinking my dad was turning me against my mom. My dad encouraged me to spend time with my mom, but I couldn’t. My mom tried putting us in therapy but I would just sit there till the time was up not saying a word to her. Eventually my mom broke down and let me just live with my dad. \n\nI haven’t spoken a word to my mom in 15 years. She would show up to my games alone. Sometimes I would ask my dad to tell her to leave. Sometimes I didn’t even notice she was there. She would try talking to me after and I would walk right past her. I cut her whole family off besides a few of my cousins that were around my age. She showed up to my high school graduation and I asked a couple teachers to remove her and they did. She never dated anyone else to my knowledge and was still attempting to reconcile with my dad a few years before he passed. Calling it the “biggest mistake of her life” and begging my dad to forgive her. When my dad passed a couple years ago she tried to show up to the funeral and I met her outside to ask her to leave. My fiancé Rachel was with me when I did this and my mom cried upon learning we were engaged (Rachel introduced herself as my fiancé). Saying she couldn’t believe I hated her still this many years later. \n\nSo last week I received a letter from my mom with a large check inside. In the letter she said she couldn’t live knowing she wouldn’t be invited to her only child’s wedding. That her whole family is hurt that I cut them off. And that she had been keeping tabs on me all these years through my cousins updates out of respect for me, but couldn’t handle not being at the wedding. I ripped the check up and sent it back to the return address. She shouldn’t have even known my address as I keep her blocked on all social media. I called up my cousins who admitted that since I was 14 they have been providing my mom with updates on me. Prom pics, college updates, engagement photos and they sent her my address. I was so mad that I told them they wouldn’t be invited to the wedding anymore because I don’t want my mom getting access to it. Rachel is saying I’m going too far now and uninviting my cousins along with freezing out my moms whole family because of her actions is an AH move. AITA?\n\nEdit: the cheating was with a teammates dad. This was highly embarrassing for me and caused me to have to move towns. Caused me to loose friends.",
  "id": 1,
  "comments": [
    {
      "score": 28059,
      "content": "I'm going to go out on a limb and say YTA.  Acting out as a 12 years old is to be expected.  Deciding not to ever forgive your mom is totally your right (though it was 16 years ago, and you, while affected, were not really the aggrieved party).\n\nThe fact that you are still throwing tantrums like a 12 year old, at the age of 28, makes you the AH.\n\nedit: I'd even go so far as to say your fiancée should consider this a pretty serious red flag.  The fact that you can act with such hatred and spite over something that happened over 16 years ago, and only peripherally involved you, to me shows a pretty serious character flaw.  At the very least, she should be concerned about what it would take for you direct that anger at her, and what form that anger would take.",
      "id": 2,
      "comments": [
        {
          "score": 10744,
          "content": "For the edit: That's exactly what I thought ...\nBeing engaged to someone so unforgiving and showing so little empathy, even to their own mother would scare the shit out of me... I would advise her to run...",
          "id": 3,
          "comments": [
            {
              "score": 3503,
              "content": "My thoughts exactly! I would be petrified to marry someone who was so unforgiving. Fiancé needs to run away from this relationship fast and OP needs professional help to heal these open wounds",
              "id": 4,
              "comments": [
                {
                  "score": 1866,
                  "content": "I wouldn't be scared for the marriage- I mean, I certainly wouldn't be planning to cheat- but the boy definitely needs therapy to actually process the loss of half his family as a child.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2126,
                      "content": "I think the thing the person is trying to say is that this grudge level of hatred is so strong that the fiancee might not even need to CHEAT to incur that level of anger. He could start projecting normal human interaction onto her as cheating behaviour, or god forbid she's SA'd will he be rational enough to see it for what it is or lash out? etc.\n\nIt's still worth being scared for the marriage tbh.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 830,
                      "content": "I have to say of all the posts about bad moms out there this is the most ridiculous, OP is talking about how his life was ruined at 12 years old….am 22 and I don’t even remember being 12…..to each his own but I’ll just say this….the first to cast stones is usually the most hypocritical …..everyone makes mistakes, I absolutely condemn cheating however I also know that letting hate fester only hurts you.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I would say he needs therapy for more than that as he's the one who decided to cut them off. As if they were part of what happened.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 775,
              "content": "OP not only cut all ties to his mom and years later still has this hatred for her, so much that they cut all ties with mom’s family who did nothing wrong. I would seriously run because if they ever fight she will have to like beg for forgiveness for every little thing",
              "id": 9,
              "comments": [
                {
                  "score": 5,
                  "content": "Every real little thing and every imaginary little thing he comes up with. Poor fiancé is going to be jumping through some incredible hoops. Probably why she’s trying to get OP to go to therapy now.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Nothing wrong? He established his boundaries and they ignored them because they felt  HIS boundaries were unfair to his mother. The mother who made a conscious decision to destroy her family. The mother who chose another man over her husband and son. But it's okay, because now she's sorry? Actions have consequences. Look at it this way, if a man hit his wife and she leaves him, but his family keeps telling him where she's at, people would have no problem seeing the family's betrayal. But because what the Mother did was emotional and not physical people keep downplaying it. Cheating and affairs are traumatic. Not just for the spouse but the children too. He decided he didn't want to be around the type of person his mother is and nobody wants to respect that. Good for him for cutting them off. He doesn't need that guilting or manipulation in his life.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "It reminds me of a reddit post I saw a long time ago. A kids Dad cheated and he ostracized him for like 20 years. For 10 years the Dad tried to remedy it and stay in touch, even the Mom was saying to forgive him. After 10 years the Dad kinda gave up, and moved on. Then he got cancer and had a couple months left to live. The kid (now in mid 30s) gave him a chance to reconcile and found out his Dad grew up a lot. They had a lot in common, his new wife (the step mom) was amazing, and he enjoyed spending time with his Dad. He spend basically every day until his dad died with him, watching sports and hanging out. Then said if he could do anything to go back and give him the chance to reconcile earlier he would. It was a really sad story. I am kinda butchering it because I am give the TLDR for something i read 5 years ago but the message is what matters.  Holding onto hate doesn't help anyone and only hurts you and the people around you. \n\nOP should take notes from that guys experience. Imagine how different you were just 5 years ago, this was 16 years ago. Your mom is a completely different person. Don't wait till her death bed to find out she might have been worth giving a second chance. YTA",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "100% right. It would be a huge red flag for me as well. All the attempts she did and he even noticed that, and not being able to even try and attempt a conversation is awful!",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2961,
          "content": "Yup I’m gonna have to climb out onto that limb beside you and say YTA. Two things jump out at me here. One, that OP was even madder at his mom than his father was over her cheating.  This much is clear from his father encouraging him to spend time with his mom in spite of everything. Two, that even OP’s fiancé is telling him he’s going too far in his hatred for his mother in uninviting cousins and freezing out his mom’s whole side of the family. \n\nLook, OP, I feel sorry for you and what you went through. No one says you ever have to forgive your mother for what she did. But you’re taking it out on her entire family, and that’s just wrong. Listen to your fiancé… she sees how unhealthy holding onto such hatred for your mother is for you. \n\nWhatever you decide to do, best of luck to you. But don’t throw away your relationship with some cousins you felt close enough to that you invited them to your wedding 15 years after the divorce. That would make you TA to yourself more than anything.",
          "id": 14,
          "comments": [
            {
              "score": 2584,
              "content": "I've given this a lot of thought, and I feel like a lot of the votes in favor of him being the AH here are a bit misguided/empathizing with the wrong person. I will say, I do agree with the fact that he needs therapy, and that amount of cortisol (which is what will happen from this level of anger) isn't healthy. But all that said, I don't blame him for that.\n\nI get feeling sorry for the mother who so obviously feels bad about what she's done. Really, I do. But I don't think his actions are indicative of a lack of empathy for his mother so much as unresolved hurt from the domino effect her actions had on him. In fact, I think it's pretty clear this is the result of trauma. Like, apathy is the opposite of empathy, really. But he so clearly still cares, or he wouldn't be so angry.\n\nPeople are defending the fact that it wasn't his business, and that she's allowed to have flaws. And yes, she is. But there is a consequence/outcome for every single thing we do, sometimes positive, sometimes negative. She made her bed, and found out it was broken in more than one place. It sucks, but this is the consequence for her actions.\n\n& for the record, to all the people who say it isn't his business--it absolutely IS his business. He's obviously been traumatized by this series of events--trauma explains the ability to hold onto such anger for such a long time. Children aren't stupid--it's pretty clear they can pick up on stuff from family members. The best intending parents will do everything in their power not to let it impact the kids, but sometimes it's just inevitable.\n\nEven if his father was hurt more, in theory, by his mother's actions--clearly there have been side effects that have occurred outside of that one instance. Bullying is no joke, and it's no surprise that he holds her responsible as the reason it happened. I mean... had she not cheated, then the circumstances might have been different. Also, just because his father took the brunt of the initial pain, doesn't mean he didn't also experience his own horrible pain. Since when is it a competition? No two people have the same threshold for the same types of pain. We're all different.\n\nRegarding the cousins and his mother--\n\nEven in the absence of specific instructions not to keep his mother updated on him with his sometimes public, sometimes private information... I feel like they are paying a price for their own actions, too. You wouldn't have to tell me not to give updates to someone who hurt you and you decided to go no contact with. It's blatant disregard for his **very clearly implied** boundaries, and it's betrayal. You're basically saying you feel worse for the aggressor than the victim, if you're willing to prioritize the aggressor's wants over the victims. Even if it doesn't seem fair, that was NOT their call to make. I'm really not sure how people are justifying this.\n\nThey got involved--in the mother's favor, and now people are like surprised pikachu face that there are consequences for that.\n\nFinally, I really don't think people are being fair here regarding how he's treating his mother. He has made his choice. She has time and time again not respected it. She needed to write him a letter that expresses how sorry she is, that if the OP is ever willing to reconcile she is willing and ready and then let the ball be in his court. Then, she needed to leave him the f alone. Why is everyone glossing over this? Even if she has good intentions, she's still dismissing someone she hurt in favor of what feels best for her. She tried to bribe him with money. Hello?\n\n&#x200B;\n\nIf I were being generous, I'd say NAH because I don't think, despite everything I said, that there were any *intended* AH here. But truthfully, I don't think it's much of a stretch to say that blatantly disregarding OP's wants in favor of the mother is a bit of an AH thing to do by his cousins, and an AH move by his mother not to respect his choice, no matter how sorry she is. Ultimately, what would make OP the AH is if he was the instigator. But he isn't. He is reactionary.",
              "id": 15,
              "comments": [
                {
                  "score": 592,
                  "content": "This, and personally I am feeling that there is a lot that hasn't been said here, going nuclear is usually not the default for something like this. \n\n*There is far more going on than what OP has stated here*",
                  "id": 16,
                  "comments": [
                    {
                      "score": 85,
                      "content": "I agree, the fact OP had to move towns is very telling.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah. On a surface read, OP's reactions seem really extreme. But...all other examples my brain is tossing up that involve people acting like this involve abuse. I don't *see* abuse in the letter, and idk maybe it's not there. But we don't know it's not. (\"Having experienced abuse\" and \"being able to understand and articulate what happened\" are two different things.) And for sure the cousins don't, and if there *was* abuse or some other really solid, understandable reason for OP wanting to cut his mother out of his life, then the cousins passing along info like OP's address is *really bad*. OP has the right to want to avoid his mother: not want her at his graduation, at his wedding, not want her to know his address, etc. The cousins passing along info in spite of that, that's a major violation, it really is.  \n\n\nIt strikes me as extremely unlikely that OP is acting this way because he's just never considered that maybe he's hurting his mother's feelings.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 503,
                  "content": "Thank you for saying this. I've been reading comment after comment calling OP the AH and I just don't see it. NTA, OP you get to choose your boundaries.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 193,
                  "content": "Yeah, I can really relate to this. My father cheated when I was a teenager and walked out (left all his belongings and everything) and never came back to the house. We lived in a small town so pretty quickly a lot of people knew. Then he started showing up to my events, sports games, etc. and I repeatedly told him not to because I needed time and space and it was a huge distraction emotionally and mentally. And like OP's mom, he never backed off, no matter how many times I asked or ignored him or told him I needed space. And you know what? I did not feel loved at all, I felt like what I wanted and needed didn't matter, because it really was more about him doing what he felt was \"right.\" People in his side of the family constantly told me I needed to get over it, forgive, and value that \"you only get one father,\" but that didn't make any of that happen and didn't lessen all the messed up things that *I knew* but other family didn't. Kids need to feel like their wants and needs are valued and I don't see where that ever happened for OP. I get the sense that OP's hurt is more than just \"this messed up parts of my life\" and more \"I had needs and wants and they didn't matter to all these people. I had all these feelings and they didn't matter to people. My mom did this, it messed up my life, it hurt, and after all that, it's more about what she wants than what I want.\" It seems like the frustration of constantly having that need for time and space violated, ignored, and dismissed is the root of OP's anger. Does therapy seem necessary? Absolutely. But there's a huge dismal happening in so many comments and I can't blame OP for being upset that people have constantly decided that this isn't an acceptable boundary, or even wasn't an acceptable temporary boundary and that it's perfectly okay to share all kinds of personal information against consent.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Right? People are like \"oh she's trying and you're blocking her out.\"\n\nComing to things you are specifically not invited to or wanted at is more like stalking than trying. There are better ways.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "Finally someone that has my view on it.  People who think his mom cheating wasn’t his business, need to understand how broken families affect children.  His family is absolutely his business. It sucks for mom that after all these years OP hasn’t mellowed on it but maybe he will once he has kids, she just needs to wait and deal with it.  OP had to deal with the fallout of her actions, she needs to as well.  \n\nAs for the cousins, actions have consequences.  If someone told u a secret and u blabbed all around and this person don’t want u around, you shouldn’t be shocked.\n\nNTA",
                  "id": 22,
                  "comments": [
                    {
                      "score": 67,
                      "content": "What’s crazy is OP IS the perfect example of how it IS his business. It’s so bizarre to see ppl say it’s not his business when his behavior is *so clearly a trauma response* to how “the business” affects him. \n\nAnd boundaries exists for a reason. Ppl are just so horrifically entitled and like to function along the lines of “I’ll do it now, and ask for forgiveness later” that when ppl like OP enforce those boundaries they’re always shocked I tell ya! Even tho she should have known better considering how OP hasn’t wavered an inch in regards to his mother. \n\nAnd yes the AITA sub can be very whiplashy day to dsy. Any other time it would be “No one is entitled to be a part of OPs life” and “No one’s entitled to be invited to OP’s wedding” but somehow in this circumstance OP is the AH for not wanting to be around ppl who betray him … \n\nNTA.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "I think cousins giving out personal details like an address without permission is an AH move. I'd even feel uncomfortable if my cousins gave my address to someone I'm friendly with if they hadn't cleared it with me first.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "This needs to be the top comment",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "This. All of this. Especially the cousin's bit. Because, OP didn't say that he wanted to cut them out too. He said that they are uninvited to his very personal, very private life, since he is clearly wanting to restrict access to that life from people that he does NOT trust, ie.. His mother. He's been perfectly clear about that so, the cousin's invitation being revoked is the consequences of THEIR own actions being outed by his mother before the wedding actually happened.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I wish this were the top comment. I completely agree w you.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "This post definitely needs more upvotes. I really is the perfect response.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Thank you for your post.  I want to emphasize one thing that you didn't explicitly state.  And that's *why* it was so traumatic for OP.\n\nMom killed their family.\n\nHe had 12 years growing up in a single household, with two loving parents.  But - and this was almost certainly an ABRUPT shift - suddenly mom and dad are broken.  Suddenly someone's moving out and getting their own place.  Suddenly, the kitchen table will not have the same people sitting around it anymore.  Or ever again.\n\nIn pediatrics, we EXPECT parental divorce to be traumatic.  Not as traumatic, perhaps, as a parent dying or going to jail, but it's still a usually permanent schism through the very heart of the only world the kid has ever known.\n\nI agree that OP is punishing his mother far more than most children of adulterers blame their parents, when it results in divorce.  No one can deny that!  But he has a *reason* to.  His life was never the same again (not to mention he actually had to move on top of that, so goodbye rest of your support network).\n\nSometimes, a mistake causes damage you cannot fix, no matter how badly you want to.  That's reality.  It really sucks when you wish more than anything you could take it back, but it is life.\n\nNone of this means I don't empathize with mom.  I'm actually empathizing with her MORE than with OP right now!  My blood is actually running cold this minute at imagining being in a similar situation, where I do something unforgiveable and my husband leaves me forever, and I know that by my own actions I will never have him back.  Thank goodness that's fictional.  My heart breaks for mom, who very obviously has repented, but she can only ask for forgiveness - not demand it.  We can empathize with both sides here, and acknowledge the tragedy, without casting blame for the fact the damage was permanent.\n\nIt also doesn't mean therapy isn't a good step.  /u/lightbright123, you got a raw deal here, and I'm sorry.  NTA because your cousins were definitely out of line for their actions, but that's  whole 'nother kettle of fish that I don't really want to get into.  What I do want to say - it sounds like you may not yet have been guided in fully processing the trauma.  Very, very few people would be able to deal with something that horrible on their own, but if you didn't engage with your therapy, that's essentially what you did.  It's also not a bad idea, as you take the exciting first step to building your own family (congratulations!!!), to explore how your beliefs about family may have been altered by the divorce.  You DO have a responsibility to make sure that your suffering and anger do not afflict your wife or future children.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I actually really heavily empathize with the mother, too. It reminded me that I could fuck up and do something that could end communication with important people forever.\n\nBut even so, I don't think that means that the OP is in the wrong. Objectively speaking, I think people just haven't respected his boundaries and needs. And he isn't initiating retribution, he's simply reacting to someone who hasn't taken the hint. And while it hurts my heart for her, she is in the wrong for not respecting his decision. \n\nAnd yes, thank you for saying this. I think the trauma was also heavily compounded by the bullying he got, on top of the divorce at a young age. I also think that it will be his responsibility to go to therapy, so that he doesn't negatively impact other people (like his fiance or future children) because of how this trauma has impacted him.\n\n&#x200B;\n\nStill, I just logically think that he's NTA here.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1242,
              "content": "Yeah a child has zero clue what goes on in their parents relationship. \n\nThey didn’t work for numerous reasons. One being an affair. \n\nHe has had 16 years to process this. He is still punishing his mother for one act!",
              "id": 31,
              "comments": [
                {
                  "score": 731,
                  "content": "[deleted]",
                  "id": 32,
                  "comments": [
                    {
                      "score": 778,
                      "content": "Parents were best friends. Dating since kids. She claims it was “her biggest mistake” inferring it was a one time thing! Or at least one person thing. \n\nMost adults can see how two kids getting married and dating no one else will result in one cheating. \n\nIt’s why parents push kids to wait until they’re older. \n\nI think OP needs some help moving past something that is not that uncommon. It may have been traumatic. But his reaction 16 years later is quite extreme. To cut anyone in an entire family that communicates with her",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 534,
                      "content": "They were adults, had an adult relationship. He was a child who was effected by her decision. She didn’t cheat on her son. I can’t possibly know what went on in his parent relationship, and as a child, neither could he. I would have some concerns Re:marrying someone who held onto a child’s grudge for over a decade.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 295,
                  "content": "Apparently she was boning the dad of one of his teammates while his dad was coaching the team, and everyone in town found out about it, so he got bullied so hard that he had to move. It also sounds like she never actually lamented the damage she did to him or his dad, just the consequences she suffered from the fallout.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 157,
                      "content": "It’s kind of hard to know what exactly she feels about it if he refuses to acknowledge her.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "\"But she didn't do anything to hurt her son\". I swear this post brought out the dumbest people in this subreddit. Let's just completely ignore how all of her actions, some of them which were repeated multiple times, continuously hurt OP and damaged him.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2123,
          "content": "I'm a bit confused here.\n\nI have come across so many relationship posts and aita posts about people wanting to go NC and being backed up and this one isn't?\n\nHe has made it abundantly clear than he doesn't want his mother to be part of his life, something she has repeatedly violated well into his adult life.\n\nThe few members of that side of the family he trusted have again also broken that trust.\n\nShort of somehow managing to file a restraining order (not sure that's legally possible) what else is he meant to do to get this across?\n\nEdit:\nSome people also seem to have missed out on some of his comments:\n\nThe mother was engaged in an Affair (more than a one time thing) with someone else to the point that most of the town new.\n\nHe was then bullied so badly that he had to move schools.\n\nHis cousins gave out his home address.\nWhile they weren't told not to, they would have to be pretty stupid not to get from the context of her not having it that he didn't want his mother to have the address.",
          "id": 38,
          "comments": [
            {
              "score": 949,
              "content": "I was wondering if anyone else saw this. He cut off his mother's side of the family because they were and still are all trying to push them together and he doesn't want that.\n\nI say NTA.",
              "id": 39,
              "comments": [
                {
                  "score": 391,
                  "content": "I swear I thought I was in some parallel universe in these comments! Like, do none of these people read OP's comments before spouting off?!\n\nThey'd see that OP **was** living his best life without his mom in it... except for all the times his cousins rattled him out to mommy and she kept trying to reinsert herself into his life without his permission. I totally understand why OP would be pissed with his cousins for trying to force a relationship with his mom.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 68,
                      "content": "I have to wonder how many of the people criticizing OP are just cheaters themselves and can't imagine that their actions could cause someone else that much pain.\n\nThey're not defending OP's mom, they're defending themselves.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": ">I swear I thought I was in some parallel universe in these comments! Like, do none of these people read OP's comments before spouting off?!\n\nThis is Reddit, come on now",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Yes! I also vote NTA. Someone commented about how he was *only at the periphery of the issue*. Huh!? Get the f#ck outta here. His mom's actions had direct implications on him too. He's free to not forgive her but just because he doesn't want her in his life doesn't make him an asshole with red-flags up the wazoo. \n\nIt's his choice to NOT maintain contact with his mother's side of the family. Them trying to force interactions and his cousins spewing details about his personal life to his mom, whom he clearly has no interest in letting these things known shows their lack of respect for him and his privacy.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "oh i didn't even see tht part, just assumed that was the reason he went as far as cutting off the family too. Even more NTA.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yeah I just don’t get why OP is being treated so badly here. People are saying that his fiancé should leave him over this. \n\nAnytime Reddit doesn’t like something, it’s always a completely absurd overreaction—your partner should leave you, your job should fire you and/or you should be hung in the town square after being tarred and feathered.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Precisely. OP is NTA. I don't understand why reddit is always okay with going NC, but suddenly now, OP is an AH for not wanting any contact. So what if OP was a child when it happened? I've had people who bullied me in school that I still don't talk to now. Just because it happened when I was younger doesn't mean I didn't have the capacity then to discern who I wanted in my life",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "OMG THIS.\n\nUsually the most upvoted comment is the one pointing out that when a person has an affair they aren't just betraying the spouse but the whole family. And if the kids cut you off so be it.\n\nOP had a pretty clear boundary. My Mum cheated with my friends Mum & that affected me I do not want her in my life.\n\n\nHis cousins knew this. Not only did they give the Mum OP's address but they've been giving her access to his intimate moments via photos for 14 years?? \n\nI understand OP's anger & his desire not to have them at the wedding so they can't show his Mum the pictures. \n\nI do agree that OP clearly could benefit from some therapy because this recent betrayal is a lot. He's already planning a wedding without his Dad there, his Mum now knows where he lives & may show up at any minute & his cousins have been betraying him for 14 years.\n\nThat's a lot to deal with. And now Reddit is being inconsistent. The sub that praises people having boundaries & punishing cheaters for betraying their families now thinks OP shouldn't be angry because his parents marriage didn't affect him (????)\n\nWhat is going on",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "The top comment on here is utterly bonkers. People are basically saying 'so what that they betrayed your trust and fed someone info on you, get the fuck over it'.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Ok thank you because I am perplexed at these comments. I agree, this is OP going NC and I think it’s valid. NTA",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I agree with this. NTA \nOPs bitterness is damaging to his own well being and he is T A for allowing himself to be poisoned here & should get therapy to process. I do not feel forgiveness and making amends is necessary rather for personal peace and well being.\n\nI'm saying that I feel the lack of respect for his boundaries is very unfair. Any other post the OP Is supported for removing people from their lives and enforcing boundaries for themselves. His mother is not entitled to his personal information and I am surprised people aren't more upset that his address and photos have been shared behind his back.\nI am a wee bit shook by all this.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "The cousins giving out OP's home address is such a profound violation of trust. I wouldn't want them anywhere NEAR me or my wedding.\n\nBut again, people are fine with NC when it's the father. But for some reason we have to forgive our mothers and not doing so makes us hateful?? Makes absolutely no sense.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It feels like a lot of the y/t/a posts glossed over that fact that when trying to force herself into social situations with op didn't work she decided to get personal information about him from family members like some kind of creepy stalker.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I find it interesting that people also consider op not wanting a relationship with his mother and not being able to forgive his mother as a red flag in the relationship. I think having one parent cheating on the other and the way it impacted op when it happened I think it's understandable for op to not want any contact with their mother. Even years later their mother isn't owed forgiveness and op has a right to feel how they feel and not want to be nc with their mom. \n\nIt also seems like everyone on his mother's side including cousins know that op doesn't want a relationship with his mother. The cousins giving the address without even asking op is breaking op's trust and them not asking op probably means they knew they shouldn't have given it out.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I see all these people also saying that it only \"peripherally involves him\"...\n\nWhen you are a child and your parent cheats, breaks up your family, and causes you to be bullied to the point you have to move, it more than peripherally involves him. This kind of thing can be completely damaging to a child and he has every right to not want her in his life. He made it clear and she keeps disrespecting his boundaries. How is he supposed to act? Someone said he is throwing a temper tantrum. He's having emotions. He is allowed to be mad at the person who betrayed and broke his family, and he is not obligated to tolerate her and his cousin's disrespect towards his boundaries.",
              "id": 54,
              "comments": [
                {
                  "score": 6,
                  "content": "He apparently had to move towns because she cheated kinda publicly so even more impact",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 859,
          "content": "I've been in a similar sort of situation.\n\nI'm 14 years in to NC.\n\nIf any of my family members shared my info with that woman I'd go NC with them to.\n\nWhy is she entitled to OP's info. He has made the choice to cut her out. You don't need a reason to go NC. This isn't about empathy of lack of.\nIt's a total lack of feeling.",
          "id": 56,
          "comments": [
            {
              "score": 427,
              "content": "Exactly.  Why are people in this thread so accepting of people pissing all over OP going NC?  \n\nHe's mom picked a night (or multiple nights) of fun over her family.   Why would OP want someone like that in his life?  Why would OP want people that give his info out to them in his life?",
              "id": 57,
              "comments": [
                {
                  "score": 291,
                  "content": "Ya, they keep calling it a \"mistake\" that anyone could make. You don't just accidentally hop on teammate's dad's dick.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 45,
                      "content": "And multiple times, apparently. Not just a \"Whoopsie\" one time mistake.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "> Why are people in this thread so accepting of people pissing all over OP going NC?\n\nBecause they're the people that would pass information too violating someone's boundaries passing information because they can't comprehend family being shitty.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "I’m just here to remind everyone that white pages exists for people located in the US and you can find most peoples home addresses there. You can have it removed through an online request form.",
              "id": 61,
              "comments": [
                {
                  "score": 5,
                  "content": "US Only\n\nPiggybacking, putting a home into a trust. Having an open restraining order against someone, OR working in LEO and sometimes any FIRE/EMT occupations can grant you \"restricted\" county registration. \n\nIt's tragic the hoops you have to go through for privacy but there's ways.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "exactly. I'm honestly on OP's side here",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yea it's pretty clear that most people here have not had to cut ties with toxic family. I tried to stay in contact with my mom's family after I went NC with her but they did not respect boundaries about sharing information with my mother so guess what. I don't talk to them either. \n\nI am NC with my bio mom for a vastly different reason than OP, but I did also go through a period of low contact with my dad after I found out his infidelity was the reason for my parent's divorce. I was 13 at the time and full of angst anyways lol. But I was very mad at him and we didn't have a good relationship for many years after, although it's great now. My point being... Even if I can't 100% identify with OPs situation, it is not my or anyone's place to tell them how to feel. I would suggest OP get therapy for themselves though, as they seem to be holding on to a lot of hurt and that can do so much damage to themselves and their other relationships.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 824,
          "content": "Tantrums? I'm really confused.\n\nIt sounds like he set a boundary with his mother. She ruined his family, hurt his father in unforgiveable ways, and he didn't want her in his life. That's his right.\n\nHatred and spite? How about accountability. It doesn't matter how long it happened... 16 years, who cares. She destroyed his family and hurt his father. That never changes. Some things, ESPECIALLY CHEATING AND DESTROYING A FAMILY, cannot be forgiven. \n\nSaying that his fiancée should consider this a red flag? That's completely off base.\n\nIt's like you've never heard of NC.\n\nShe isn't owed forgiveness, and not giving it to his mom doesn't make him an AH.",
          "id": 65,
          "comments": [
            {
              "score": 406,
              "content": "And if the parents roles were reversed I bet everyone would be saying the opposite, and agreeing that he should cut his dad out of his life. He has every right not to forgive someone who ruined is family.",
              "id": 66,
              "comments": [
                {
                  "score": 320,
                  "content": "Definitely. I feel like I’m in bizzaro world reading these YTA comments",
                  "id": 67,
                  "comments": [
                    {
                      "score": 137,
                      "content": "Right!? I mean his whole life got messed up because of her \"little mistake\" and if he reacted so badly to it, they most likely already had a bad relationship and this was just the \"I'm done\" moment for him, and even if he didn't tell the cousins not to share information, from how he treats his mother should have been a dead giveaway that meant the NC with mom.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "Like, people commenting that the fiancé should run because of something outside of their relation, but they are defending the mother that destroyed OP family, made him lose his friends, move to a new town and see his father hurt.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "It's just sad.  I tagged OP just so he could see mine and a few other comments and know that at least SOME of us were really empathizing with him.",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "It's like ppl don't understand what no fucking contact means",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Also, who knows? Maybe after some time or distance from her he might actually see his way to reconciling--*but she's determined that he will never ever actually have that*.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": ">Tantrums? I'm really confused.\n\n9000+ people who read this post do not know the reality of attempting to live your life in spite of irreparable Bad Family Stuff and I do not know whether to be happy for them that they personally cannot imagine these dynamics or furious that they won't even try. Mostly leaning towards the second thing though.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Right? I feel like I'm taking crazy pills with these Y. T. A. comments. The amount of people who have sub-zero morals and/or self respect in this thread astounds me. Def NTA.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 714,
          "content": "I have some insight into this, although not personally. Both sets of my grandparents got divorced when my parents were young due to cheating. My mom’s dad and my dad’s dad both cheated on their wives and then married their affair partners. My dad’s dad even had a child with his new wife. Both of my parents were devastated, as they were young teenagers when it happened. \n\nI grew up knowing and loving all four sets of my grandparents. I obviously didn’t know the reason I had so many grandparents as a kid, but when I got older my parents told me. My mother said, and I quote “They made horrible mistakes and they hurt us, but can you imagine them with anyone else?” And I can’t. All of my grandparents and their spouses deeply loved and cared for one another.\n\nI know cheating sucks. And I know why Reddit hates it so much. But I can’t justify OP hating someone so much when I am the product of a family that learned to forgive. I had a wonderful childhood. My parents and aunts and uncles do not regret giving their children the luxury of bonus grandparents. \n\nI’m not saying OP needs to forgive his mother, I’m not even saying he needs to invite her to his wedding. But I can’t help but feel so so sorry for this woman and feel that his response is disproportionate to the crime committed. I hope you get therapy, OP, to heal the hurt in you <3",
          "id": 75,
          "comments": [
            {
              "score": 553,
              "content": "You’re talking about male infidelity, which society has tacitly endorsed since the dawn of time. Female infidelity is considered by most to be MUCH worse, to the extent that men used to regularly get a free pass for murdering unfaithful wives. \n\nNot that I believe they’re any different, just pointing out that most people castigating the mom are doing so mainly because of her gender, so you saying “well I watched my family heal from all the men cheating!” isn’t going to change their minds.",
              "id": 76,
              "comments": [
                {
                  "score": 91,
                  "content": "Actually, the poster is talking about both. Both the dad's mom, and the mom's dad cheated.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 534,
          "content": "“Only peripherally involved” him? His mother’s actions only destroyed his family, that’s all.",
          "id": 78,
          "comments": [
            {
              "score": 9,
              "content": "Not to mention she slept with a team mates dad and basically destroyed his life at school to the point that he was bullied so badly he had to move.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 374,
          "content": ">only peripherally involved you\n\nI mean in all fairness his mom sleeping with his friends dad caused him to be bullied so hard he had to change schools. So it's not really fair to say he wasn't involved. Her actions had severe consequences on him. Childhood bullying is no joke",
          "id": 80,
          "comments": [
            {
              "score": 42,
              "content": "Is this in his comments??",
              "id": 81,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Even short of that, it's bizarre to claim that the break-up of his family \\*did not involve him\\*.  It involved him directly?  Do people not understand what it does to a kid to have his stable home life destroyed, AND to be put in a position where his parents are at odds and he has to \\*choose one\\*?  Those are terrible things to do to a kid.  Of COURSE it directly involved him.\n\nAnd while it doesn't exactly work this way, it would be understandable \\*from his perspective\\* if he felt like her decision to cheat, which she would have known could destroy the family if (when) discovered, meant that her desire to have sex with this other guy was more important to her than her desire not to jeopardize her child's stable family.  She chose sex with some other guy, over her child's well-being.    (As I said - it's not quite as cut and dried as that; but it's also not NOT a factor.)",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 228,
          "content": "I'm guessing your parents aren't divorced bc it doesn't \"only peripherally involve you\". Your life is turned upside down. And my parents had a miserable marriage that divorce was a light at the end of the tunnel for my mom and I. Plus they split up when I was only 5. OP was 12. He had 12 years of a family torn apart. Look, I'm not saying he's handling it in the best way possible, but don't you dare try to belittle the absolute hell that divorce is on a child.",
          "id": 83,
          "comments": [
            {
              "score": 21,
              "content": "OP is definitely NTA.\n\nLike, when I was 4 my parents got into a huge argument where my dad accused my mom of cheating on him (even though my birth date aligns with his birthday 9 months previous). He burned all my baby pictures and hit her with a bat. She drove me and my sister away that night to her parent's house. We slept in the car on the way there with very little food. Dad showed up less than a month later with his highschool sweetheart who was supposed to be living in California. He was cheating on my mom, projected on her violently, and then only showed up to rub his affair partner in her face. Leading to my mom's suicide. He even brought his girlfriend (recently upgraded to fiancee) to my mom's funeral. HE HAD HER BURIED ON VALENTINE'S DAY. \n\nHe didn't even try to come back for my sister and me until I was almost done with first grade. I'm 30 and this all still haunts me. I wasn't wanted by my step mother and she abused my sister enough to give her PTSD, then convinced my father to kick her out at 13. Then she turned to me to shit on until I went NC as soon as I moved out. My dad pretended nothing was wrong with how I was raised. The last message he sent me on the year I went NC was \"I don't know why you think we don't care about you.\" I don't have any childhood pictures of me to look back on. I don't have good childhood memories, I don't want anything to do with any part of that family except my older stepsister because she was a target for her mom's abuse too and never lets her mom near her son and is as Low Contact as she can be. I love everyone I let in to my life and will never forgive my father for anything he and his second wife have done.\n\nIt all started with a parent cheating. I've been to therapy over the years and it is okay to not forgive pain inflicted upon me by others. It doesn't affect my relationships with my friends and I've done everything in my life trying to make the world better than I found it. My living family members besides my stepsister can die without me caring or going to funerals. That doesn't make me or you or anyone an asshole for having strong boundaries against involving someone who caused profound amounts of pain to us.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Umm... what? He gets to feel however he wants about this! He chose to cut off his mom after she broke the family, which I find better than constantly mistreating her as other people would do. He gets to put whatever boundary he wants, and he gets to expect others to respect it.\n\nHow is this a red flag? \"If you cheat I'll never forgive you!\" Is a very basic sentiment. He was a part of the family, so how was he only peripherally involved?? Her actions changed his whole life!\n\nAlso, I would also uninvited the cousin if I found out they were going against a direct request!",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14002,
      "content": "Uh.... Go to therapy and unpack this shit, this is a pathological level of hatred unless your mom literally told you to your face she regretted ever having you with your dad and kicked your dog as part of the divorce. I don't think people have to \"let go of anger and forgive\" every single slight, but.... you weren't even the one cheated on and it sounds like she tried to do everything right by you?",
      "id": 86,
      "comments": [
        {
          "score": 4587,
          "content": "See, I am the first person to advocate NC if you have to, because some parents aren't much more than DNA donors, and some are worse than that. But OP is taking this so personally, for over fifteen years, and letting the anger drive their familial relationships away. That's very sad.",
          "id": 87,
          "comments": [
            {
              "score": 2186,
              "content": "I've been reading through the replies and struggling with it for this reason.  I'm NC from my family, but it feels like there's either tons of info missing or their attitude is unfounded.  If my parents had ever reached out in a sincere way (like showing up to events or writing a letter) then I would give them a chance (after making sure that I'm not hallucinating the whole thing).",
              "id": 88,
              "comments": [
                {
                  "score": 1087,
                  "content": "I doubt OP would have excluded any details that would have helped justify his position.\n\nHe clearly has a lot of resentment.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 582,
                      "content": "I’m having a hard time believing that there wasn’t parental alienation going on here on the part of OP’s father. The level of resentment and hatred is just too intense and deep seated for me to believe that.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 454,
                  "content": "Yeah, OP said he hasn't spoken a word to her in 15 years.  So... doing the math... he was 13.\n\nI have no doubt that it was hard for him.  But the extent to which he's held on to this doesn't quite match the severity of what happened.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 701,
                      "content": "I also love the fact that people in the comments are like \"he set a boundary and she repeatedly crossed it\".\n\nHe was a pre-teen. If people would completely cut contact with every 13-year-old that ever says 'don't ever talk to me again', half the world's population would be NC with their parents. It's just ridiculous.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 279,
                  "content": "Yeah that's what gets me. It's a one-sided account insofar as it's his own subjective view of it, but even THEN what comes across is a very sad mother desperately trying to reconnect with her child. It's so different from most of these posts where it's like \"my parents physically abused me and refused to talk to me for five years, and now they want back in because they have a grandchild\" or whatever. She's been making the effort. For god's sakes, he had his mother ejected from his games. I get it, but it just feels so harsh and I feel horrible for her.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 6,
                      "content": "The mom made her bed when she opened up for legs whoring herself around.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Same. I’m also NC with a parent of mine but if my dad showed effort like this I would still be in contact with him. Problem was that he never did, ever, in my life.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Their attitude is what you get when you spend a lot of time in a subreddit with a scorched earth policy that says \"go NC\" for basically any minor slight. Notice this thread isn't even about if he's the asshole for how he reacted to his mom - it's about if he's the asshole for how he reacted to the rest of his family TELLING her things. He already has decided it is reasonable to make other people REMOVE HIS MOTHER from things simply because she existed there.",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If I was OP's fiance I would be rethinking the marriage. His reaction is so extreme that I would be worried about conflict resolution in the marriage. Like maybe some that's not cheating would cause a similar reaction.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1015,
          "content": "OP says in other comments that he had to change schools and make new friends. It sounds like there was some bullying related to rumors mom hooked up with another teammate’s dad. It also deeply hurt someone OP cares about.\n\nTherapy sounds like a good idea. Giving out someone’s personal identifying information without their knowledge or consent is unethical. Setting a boundary with the cousins because they seem untrustworthy isn’t unethical.",
          "id": 98,
          "comments": [
            {
              "score": 645,
              "content": "Her mom also denied the affair. Imagine defending your family from the rumors only to find out it's true. I'd feel like a joke tbh. He has to deal with all that and uproot his whole life and people keeps saying the affair has nothing to do with OP?",
              "id": 99,
              "comments": [
                {
                  "score": 354,
                  "content": "Oh wow that's messed up. OP still needs to go to therapy to let go of all this hatred and baggage Inside him, but tbh I don't blame him for not wanting any contact with his mother. Her actions destroyed his family, hurt his father, he had to change towns, and she lied to him. Her cheating did affect him too and completely destroyed his faith and love for her so I don't understand the \"what she did isn't your business/didn't affect you\" comments under the post. At this point all this animosity and hatred is just destroying him. Just cut her off and entirely let go of what happened.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 264,
                      "content": "> Just cut her off and entirely let go of what happened.\n\nErr... I can't help but feel like that's exactly what TC tried to do?\n\nMaybe I'm taking crazy pills, but isn't that what this thread is about? TC went NC with his mom. Mom keeps trying to reach out anyways. TC freezes out most of Mom's family to avoid having to see Mom at family events. TC remains close to a few cousins who are no doubt aware of the situation, said cousins then act contrary to TC's wishes by enabling Mom. TC freezes out the cousins.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 139,
                      "content": "Seems like he's tried to cut her off but she's not accepting it and is constantly trying to subvert his wishes/decisions. But yes, OP really needs therapy to work through this",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah I don't get the YTA comments saying, his mother wronged his father so why is he so upset?  Like hello, she destroyed his family and everything in his life as he knew it!",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "In the internet age, it is much easier to find someone's address, especially if they are living locally to the other person.",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I know two people who had this happen about 30 years ago.  Their mother made it very difficult for them in our little community.  Especially at school.  It is fascinating to see the two very divergent paths they took to adulthood.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I think this reaction, while perhaps excessive, isn’t unexpected for the circumstances.\n\nAs a kid, OP’s life was uprooted because of what mom did. Had to move, lost friends… the affair was with the father of one of OP’s teammates, that must have placed OP in the middle of a lot of it (not between OP’s parents, but between the families involved). If they had to change schools, it must have been pretty significant. So, they exerted control the only way they could — by distancing mom… and mom didn’t give OP space, didn’t let OP make any of the decisions. She kept on showing up, pressuring OP to forgive her. I’m sure she thought she was doing the right thing, but in not giving OP time, she prevented OP from feeling they had any agency at all; the only thing they could control was whether or not they spoke, and even that she tried to push OP to do on her timeline. Adolescence is a time kids really need to be getting *more* agency, I don’t doubt it was especially challenging developmentally to instead lose agency. \n\nAnd now they found out that even what agency they thought they had wasn’t real. These cousins — the only maternal family they thought they could trust — were sharing information with their mom the whole time. It would be one thing if their father had said “She’s your mother, she should have this information,” but their cousins were some of the only people they trusted, and weren’t the right people to make that decision.\n\nIdk, if I were in OP’s shoes I suspect I would uninvite the cousins too. It’s not about whether OP’s reaction was proportionate back then, it’s that OP’s trust was repeatedly violated and they don’t want to have to worry about that during their wedding. \n\nI’m also baffled by people saying mom didn’t cheat on OP; indirectly, she did. In cheating on her husband she was also betraying her family more broadly. She wasn’t acting in OP’s best interests, which is a parent’s primary job. Her actions affected everything in OP’s life. I would argue that OP was more of a victim of her actions than their father was. I agree that OP should get into therapy, I agree that aspects of their responses have been disproportionate, but I definitely wouldn’t pretend that OP’s father was the only real victim of the affair. While mom was off having an affair, she was actively deciding that having some fun on the side was more important than OP’s needs. \n\n(And disclaimer in advance since mine seems to be an unpopular opinion: no, I’ve never been cheated on, done the cheating, or had a parent cheat. And no, I don’t work with any sort of divorce-related anything. I’m not projecting, I’m just thinking about this from a developmental psychology perspective and baffled by how people can treat OP like they were a barely-affected bystander.)",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10502,
      "content": "I don’t think AITA is the right place for this. Please consider going to therapy, it sounds you have a lot of pain bottled up. Wishing you all the best.",
      "id": 107,
      "comments": [
        {
          "score": 1558,
          "content": "For real, this is pretty heavy given the amount of ppl answering this while watching tv, slacking off at work in the restroom or slamming back a slice of pizza. OP, I’m glad you’re checking in and reflecting on whether YTA but you should also be checking in with people way more qualified than all of us. Do it for your fiancé (and potential future family).",
          "id": 108,
          "comments": [
            {
              "score": 154,
              "content": "Um, I’ll let you know I’m on the *treadmill*, tyvm!",
              "id": 109,
              "comments": [
                {
                  "score": 52,
                  "content": "I’m picturing you sitting on a bench that straddles the treadmill belt and running one foot over the belt moving on the slowest speed. The best way to be on the treadmill",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "> slacking off at work in the restroom \n\nwe aren't slacking off.  we're pooping on the company dime.",
              "id": 111,
              "comments": [
                {
                  "score": 15,
                  "content": "Boss makes a dollar, I make a dime.  That's why I poop on company time.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 333,
          "content": "The best answer, hands down\n\nThis is a muddled mess of varying shades of gray, each of which I have my own thoughts about, but at this point OP, regardless of what anybody here thinks, you've got some shit you seriously need to work through, and that's just as true whether you forgive your mom, your cousins, either, both, or none \n\nOne you've sorted your own shit out a bit, then you could revisit the issue with a bit of clarity (which I think deep down you realize that you don't have)\n\nUntil then, however, no answer is going to give you the answers you're looking for",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "This is the right response imo. I have some serious dysfunction in my family as well, and have gone NC with family members before for periods of time, and the situation described here is honestly so weird to me. I would say it’s obsessive and abnormal.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Yeah, stories like this one make me think that this sub should have a ARP rating (Above Reddit's Paygrade).",
          "id": 115,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "This. I am not rating this one. Op needs help. I hope he can get it.",
          "id": 116,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5840,
      "content": "Maybe unpopular opinion but YTA - why are you punishing your mom so severely? She made an awful mistake years ago, a mistake many parents do. They have a right to their own lives and moral failings. \n\nHonestly I would encourage you to explore why you feel this hatred for your mom that seems disproportionate. Punishing your cousins for showing compassion does seem like going too far.",
      "id": 117,
      "comments": [
        {
          "score": 2874,
          "content": "(Removed)\n\nEdit: OP said in comments that the cousins weren’t asked not to share, OP is TA for uninviting them too",
          "id": 118,
          "comments": [
            {
              "score": 1620,
              "content": "OP states that he has made no previous request to specifically keep information from her. So his cousins didn't overstep intentionally, but he's going to freeze everyone out anyway.",
              "id": 119,
              "comments": [
                {
                  "score": 1526,
                  "content": "The more I read, the more I start to think that OP's change of schools was because he found a spider in the house and burned it down.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Lol I would give you an award if I could. Underrated comment right there.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Not giving out your address isn't something you normally have to ask -- it's generally assumed that people won't give your address to someone they know you don't want to communicate with.   So kind of a stretch to say that it's OP's fault because he didn't ask the cousins specifically not to give out his address to his mother.",
              "id": 122,
              "comments": [
                {
                  "score": 22,
                  "content": "I can't believe that people are actually trying to argue that it's fine because OP ~didn't tell them~. Normally this sub is so good about telling people to respect the boundaries of others but on this post that's gone out the window.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Oh BS, they shouldn't have had to be specifically told not to share. They knew OP's relationship with their mom, they knew damn well they OP did not want any information shared with their mom about their life in general, especially the wedding she wasn't invited to.\n\nEven if you think OP is TA for their hatred towards their mother, the cousins still betrayed OP's trust for like 14 years. Uninviting them to the wedding and then going no contact with them upon learning about that betrayal is a totally appropriate reaction.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 646,
          "content": "Like, he doesn't have to forgive his mom or anything, but this is disproportionate.",
          "id": 125,
          "comments": [
            {
              "score": 38,
              "content": "Exactly. My mom cheated on my dad and it was horrible. I totally empathize with OP. But it’s been 13 years and I’ve moved on. \n\nMy mom made a horrible mistake. She had an affair with her ex boyfriend and then married 6 months after the divorce. My brother and I moved states with her because he didn’t want to go through a big custody battle. (My mom didn’t intend on fighting, I don’t think. He was just hurt and tired.)\n\nI know for a fact she feels like shit about all of it. She’s worked very hard to demonstrate she cares about me and recognizes her poor judgment. She’s cried and cried over the years. \n\nI don’t know if I’d say I’ve forgiven her, but I love her and I am able to see her for the full, complex person she is. We have a decent relationship and I’m glad. Rather than forgive her, I choose to accept her. And I can accept her without forgiving her. \n\nOP, if you see this, consider therapy. Divorces can really traumatize kids. I think a lot of your anger could rooted in unprocessed trauma. That’s exactly how I was for many years and getting to work through it with a therapist was healing. \n\nI fully believed I was fine. I went to therapy for something unrelated (or so I thought) and that’s how I realized I’d pushed down a lot of hurt over the years that was festering.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 238,
          "content": "I agree. My dad was a chronic alcoholic and treated both me and my mum like complete shit for years. Emotionally abusive, manipulative and completely hammered most of the time.\nShe divorced him and I had to go stay with him every other weekend until I moved away to go to uni.\n\nHe died a few years back, but despite my misgivings about his behaviour I would never think to have treated him with such contempt. This needs therapy.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3868,
      "content": "I honestly don’t know what to put apart from if having an affair was literally the only thing your mum did and she was cut off from everything I feel for her immensely. How someone parents is not measured by their relationship with this spouse.\nThis is so complex and upsetting.\n*Goes to make cup of tea.*",
      "id": 128,
      "comments": [
        {
          "score": 515,
          "content": "This has given me the major sads.",
          "id": 129,
          "comments": [
            {
              "score": 1139,
              "content": "Yeah, me too. I really feel for his mom. She fucked up for sure, but OP doesn’t know what that marriage was like. He doesn’t know anything about it. And she’s spent the rest of her life suffering. Jesus, convicted murderers do less time.",
              "id": 130,
              "comments": [
                {
                  "score": 461,
                  "content": "OP is still acting like a 12 year old child. His parents are human, too.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 322,
                      "content": "And his dad was trying to reconcile with her and he thinks he has a right to kick her out of the funeral. Disgusting",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah my heart is pretty much broken for all parties :(",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 172,
          "content": "[deleted]",
          "id": 134,
          "comments": [
            {
              "score": 226,
              "content": "But was she a bad mother, she was clearly a bad partner.",
              "id": 135,
              "comments": [
                {
                  "score": 558,
                  "content": "She doesn’t sound like a bad mother from my reading. She tried to build a relationship, she tried therapy and she saw that this wasn’t what her child wanted and she let him go, despite it clearly breaking her heart. She respected his boundaries enough to not contact him and whilst some may see error in cousins sharing info, I can hardly blame her for wanting to know her child’s life is going okay",
                  "id": 136,
                  "comments": [
                    {
                      "score": 296,
                      "content": "I agree nothing in the OP post makes her sound like a bad mother. Crap wife yes, bad mother no.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "What do you mean she wasn't a bad mother. She cheated forcing the breakdown of their family.",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "She fucked the dad of another kid who played on the same sports team as OP. Yeah, she was a bad mother.\n\nGood moms don't do that shit.",
                  "id": 139,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Taken from someone who had a different but similarly complex situation; the way the offending parent treats their spouse factors into what you think of them as their child.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 140,
          "content": "You're right that her relationship with OP's dad doesn't reflect how she is as a parent, but the fact of the matter is, cheating doesn't just impact the spouse. It also deeply affects the kids. So yeah, the mom did consciously make a choice that she knew would negatively impact OP should her cheating come to light. Her cheating *does* reflect her parenting toward him, bc she just displayed to OP that she's willing to cause harm to their family (OP included) just for sex.",
          "id": 141,
          "comments": [
            {
              "score": 24,
              "content": "I agree completely on this, people will sometimes act like parents' relationship and their relationship with their child are completely separate, they're not. Breaking up your family for sex is a really shitty thing to do. I'd say the funeral thing was a bit cruel, but the rest is just him not wanting contact with the parent that broke up their family for sex",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "Lol. \"The only thing she has was an affair\" - what's wrong with you people? She tore apart her family because she couldn't keep her pants and and be faithful to her partner.\n\nThey ended up leaving town because everyone knew what she had done. Of course she deserves to face the repercussions.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Cheating on one parent while living with the kid affects the kid greatly.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3581,
      "content": "Honestly, I think keeping up this much anger for so many years is hurting you just as much as it is your mom. YTA for what you are doing to yourself. This doesn’t honor your dad, btw.",
      "id": 145,
      "comments": [
        {
          "score": 1075,
          "content": ">This doesn’t honor your dad, btw.\n\nThis is insanely insightful. Reading all these comments that are questioning OPs hatred, it really feels like this is also a piece of a very complicated puzzle.",
          "id": 146,
          "comments": [
            {
              "score": 36,
              "content": "I think sometimes when you hate something for so long from so young, it can just grow to be a part of you. OP hated his mother for a very long time, and it just becomes a part of his decisions and life. Maybe he never ever talks about his family while all of his friends does, and never ever invites his friends to his home because questions could be raised, \"Where are all the family photos?\" \n\nAnd then he blames his self-caged life on the actions of his mother. I don't blame him, but he should find a way to unpack it himself if he can't access a therapist.\n\nIt looks like OP just tried to go no-contact and avoid everything to do with his mom, but nooooo, she pops up everywhere like a weed.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "Yeah, I agree. I also understand OP's stance in that OP probably felt betrayed and probably blamed mom for the collapse of the family. \n\nI'm not saying OP needs to forgive and forget, but for his own sake, he should let the anger go.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "The funeral part made me so sad. He had no right to kick her out. OP *KNEW* his father wanted him to reconcile his relationship with his mother. Hell, the parents had already reconciled. He disrespected his father’s wishes at his funeral. And they were so young when they got married. They had a LONG history together. Kicking her out was unbelievably cruel and vindictive. He didn’t have to speak to her at the funeral, that’s his choice. But revoking her chance to say goodbye to his dad— he had no right.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2669,
      "content": "You don't have to invite them to the wedding if you don't want, but if your fiancee is telling you you're going too far, *maybe* *hear her out?*\n\n~~NTA i guess, but~~ I don't like it.\n\nFuck it. YTA. Shoulda just committed to it in the first place. Disproportionate response to the cousins.",
      "id": 150,
      "comments": [
        {
          "score": 548,
          "content": "Disproportionate response to his mother, too!",
          "id": 151,
          "comments": [
            {
              "score": 604,
              "content": "The one that got me was shutting her out of the funeral. I understand people want to go NC but that was just cruel. She spent years trying to make up for what she did and wasn't even allowed to mourn a person she obviously cared about. There's a big difference between not wanting a person in your life, and being sadistic about the hills you choose to die on.\n\nEdit: Jesus christ, stop commenting “she wouldn’t have cheated if she cared.” This post is days old and I’ve seen all the other ones, thanks. If you genuinely think of human beings as so black and white that their emotions are either complete devotion or complete disdain, and people never hurt those they care about, I don’t think you’re emotionally developed enough to be commenting in this sub. He fucking DIED and you seriously think she didn’t care at all because she cheated on him? I’m not defending cheating because I have the bare minimum of basic human empathy that does not completely vanish when someone makes one fucked up choice.",
              "id": 152,
              "comments": [
                {
                  "score": 587,
                  "content": "I feel like I’m in the minority in this thread but I feel OP is deeply vicious and spiteful. He’s a grown adult being absolutely vile to another human for a mistake made decades ago.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Normally this would be the case, but in r/AITA, it's always open season against cheaters.\n\n\"Aita for leaving my gf hogtied and stranded in the middle of the desert after i found out she cheated?\"\n\n\"NTA, she should have thought about that before she cheated.\"",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "Agreed. His fiancee should be having second thoughts right about now. I can't imagine going through a divorce/custody battle with this man.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1997,
      "content": "Oof this is a tough one to judge on the exact question you’re asking. I’m not seeing that you asked your cousins not to talk to her, so I’m feeling YTA here. You certainly have the right to be angry at your mother, but holding such an intense grudge for *this long* over her cheating on your father once just doesn’t sit right. This is something you need to actually deal with. \n\nHonestly your mother doesn’t sound like that bad of a person - yes she made a horrible mistake but she’s spent *15 years* passionately trying to have some form of a relationship with you while doing everything she can to respect your boundaries. And you gave her nothing for that. If there’s more that your mother did wrong, I’d understand, but it’s just not there.",
      "id": 156,
      "comments": [
        {
          "score": 535,
          "content": "This - I've been trying to word it correctly and this is it. I just can't imagine holding on to this much hatred for a person. I strongly believe in second chances, that people should be given the chance to redeem themselves.",
          "id": 157,
          "comments": [
            {
              "score": 254,
              "content": "Normally I’m all for the whole idea of not giving someone more leeway than they deserve just because they’re family. But in this case…I just don’t think her mistake is worth the level of grudge here. \n\nI can see why the cousins would sympathize with OP’s mother and give her some info over the years.",
              "id": 158,
              "comments": [
                {
                  "score": 130,
                  "content": "I think you could argue \"some info\" going one-way, but there's no way they should be giving anyone's *address* out without permission.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Yeah I’d be incredibly upset if my address was handed out without my consent, especially to people I cut out.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "I agree, but I do wish they had tried to help child OP with individual therapy rather than family therapy.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "The only reason I see for holding this much anger is if she was also a horrible mother, but from what OP told us she wasn't. She did everything she could to be there for him still and tried everything to mend the relationship and when she saw that wasnt going to work she gave up custody. She still tried to be part of his life even after that. \n\nHell OP treated her so badly as a kid lawyers got invloved thinking his dad orchestrated all of this hatred, yet OP still sees nothing wrong with that. OP needs therapy or something this much anger and hatred over 15 years isn't healthy for anyone.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "What about giving out the address, though?   If the cousins gave one-way updates, OP would never have known and you could argue he isn't hurt.  But giving OP's address to someone they know OP doesn't want to communicate with?  \n\nHow can OP trust that the cousins won't also give out the location of the wedding?  Do you want to wonder if mother's going to turn up there?",
          "id": 163,
          "comments": [
            {
              "score": 54,
              "content": "Seconding on the address issue. I personally wouldn't be okay with the one-way updates either, but I acknowledge that's due to my own issues making it a creepy factor! \n\nI also get physically nauseated at cheating, even reading stories about it just rubs me the wrong way, so I'm fine with the NC, though I do think OP should speak with someone since he is holding such strong resentment. That way there aren't any 80/20s in his relationship's future. (80/20 is a term my therapist uses to describe when new, small issues are bringing up old, unworked on feelings. 80% old and 20% new).\n\nI'm leaning towards an NTA but it's close to E-S-H just because OP didn't put any work in (based on his strong emotion on this) to resolve it for himself!",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "And this is the question OP is asking, which makes him NTA. Hell most of the stuff in his post (minus kicking the mother out of his dad’s funeral when he knew they reconciled which I feel he is 100 Percent YTA on) I would lean NAH to NTA on.\n\nOne of the top posts for AITA is a post where OP went complete no contact with their parents and most of the family yet their fiancée (who knew why there was no contact with OP’s family) was speaking to them behind and back to try and get them back together because she grew up with a “perfect family” and wanted them to be that too. The forum OVERWHELMINGLY declared OP NTA and asked them if they could really marry someone who would do that, which OP eventually stated they broke off the engagement.\n\nI wonder how many of those same people here would call that OP a AH for having their boundaries broken.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Everyone that said YTA totally ignored this point. You don't get to decide that someone should forgive their family, especially when family is going behind your back and giving your address to people that you don't want to have it. \n\nI don't know that I've ever disagreed with almost an entire comment section like this before.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I agree with what your saying about his mom but his cousins knew he wasn’t talking to his mom. If you were no contact with someone, would you need to tell people not to give out your address? Even if you weren’t no contact with someone, they shouldn’t give out your address or photos without your permission. Talking to his mom in regular conversations isn’t an issue. The other stuff very out of line.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 874,
      "content": "I'm not sure what your mom did to you, so I don't feel I can pass judgment, but this whole thing sounds awful. Your mom made a mistake and violated your father's trust when you were a kid and you've excommunicated her for 15 years? \n\nINFO: Did something else happen to cause you to shut her out entirely?\n\nIt sounds like she desperately wants to be part of your life. A parent never stops loving their child. She probably thinks about you everyday. Would you ever consider attempting reconciliation?",
      "id": 168,
      "comments": [
        {
          "score": 436,
          "content": "That's what I want to know, what did she do to HIM.   \nShe's desperately tried to be there as a mother and he keeps shutting her down.   \nMy parents got divorced when I was really young too, but even then I understood that was between them and had nothing to do with me.   \nWhat did she do to him to warrant this much punishment. Even murderers have been let out of prison with less time served.",
          "id": 169,
          "comments": [
            {
              "score": 684,
              "content": "He explained in another comment that there were rumors around his school prior to him finding out. People were saying his mom slept with his teammates dad so he confronted his mom about it and she lied. He was defending her for a while but once the truth came out he lost friends, that the truth spread around the whole town, and had to move schools and to a whole new town to escape everything. Seems like he may have been bullied in response to the truth coming out which honestly does directly affect him.",
              "id": 170,
              "comments": [
                {
                  "score": 673,
                  "content": "Also, I notice a trend in OP's story. It seems like OP was never given the CHOICE to have space from mom. She just kept pushing and trying with no regard to OP's feelings. Boundaries being repeatedly violated is absolutely a reason to cut someone off permanently. I can't help but wonder if they would have a relationship today if OP's mom had listened and given some space after everything happened. Instead of ignoring OP's boundaries and needs for space.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 369,
                      "content": "This sub ALWAYS calls people the asshole if they ignore someone else's boundaries. Hell, I've seen people told that they'll be the asshole if they just *write a letter*! Yet OP's mom did all that and more and people are cooing over her as though she's some innocent baby. The cousins repeatedly fed info on him to his mother without his consent or knowledge but OP is in the wrong according to people here. Ugh. \n\nI'm so mad about this whole thing, lol. First triggering post of 2022, I guess!",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Thank you for this comment! That’s exactly how I feel— op never got to be away from mum and it sounds to me mum kept injecting her presence in op’s life— I guess to op she no longer was his mum when she lied, he couldn’t trust her anymore because she lied and hurt him deeply. I mean, if I were op, I’d even wonder if she’d be cheating if I weren’t on the team. It’s more complicated than people think and definitely cringing on all the comments saying op should give mum a chance",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 207,
                  "content": "I was going to say he was in the wrong until I read this. It changes things for me. Sleeping with anyone disrespects the spouse, but to sleep with your child's friend's parent IS a disrespect and embarassment to your child, at least in my opinion.\n\nI can't imagine life on that team or with those teammates was easy for him after. I bet he was terribly embarassed and should have had therapy to address the situation. \n\nI get the feeling OP's mom might not have wanted to talk this out with him and just kept pushing.\n\nI feel for EVERYONE in this situation. I can't imagine the guilt mom must feel and OP clearly should have been in therapy long ago WITH his mom.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 24,
                      "content": "He was put in therapy with his mom via the post, but he didn't want to talk with her, understandably imo. I think he should have had therapy alone to process.",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I wouldn’t associate with the friend anymore either. It would suck, but they would just be the daily reminder of what happened.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "OP, NTA. She made her choices, and she takes her consequences.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 376,
              "content": "She broke his heart. Does there need to be anything else? \n\nYou don't have to forgive someone.",
              "id": 178,
              "comments": [
                {
                  "score": 385,
                  "content": "This!  \n\nI dislike the whole, ‘oh but they didn’t cheat on you’ narrative. Okay, so no, they didn’t. But they lied to you. Abused your trust. Deliberately and selfishly ruined your immediate family. Hurt the people you most care about. Chose to spend their free time either planning to see their affair partner or actually spending time with them, instead of spending time with their child. \n\nPeople hugely underestimate how much affairs tear apart entire families, and I think a lot of that underestimation is to smooth the surface, brush it under the carpet and make themselves feel better. Regardless of their relation, you can acknowledge that sometimes people do shitty things and - surprise here! - you can choose not to associate with those people.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 134,
                      "content": "I thought I might be the only one to think like this.\n\nAnd you put it better than I could. Thank you. And have my updoot.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "It really bothers me that people are thinking that it apparently only affects the mother and father.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "It's just sad to see how normalized divorce is, that they don't think about the fact that the child is the literal spawn of both the father and mother, it's a product of both. Seriously, are they really suggesting that the cheating only affected his father? Especially given the circumstances?\n\nSo, you go ahead and fuck up your marriage, embarrass your child in front of his friends, and then just expect him to bend over. His father is his coach, so I imagine he spends a great deal of his time with his father, probably more than most of us ever have. \n\nEverybody knows the bond that sports create, especially between father and son, so you go and sleep with your son's teammate's father? \n\nCan you imagine the period between finding out about it and them moving, if his mother kept showing up to his games, the environment that it must have created? How was he not going to walk past her? Did she really expect him to side with her in front of everyone? \n\nI mean, I don't want to pass any judgement, but at some point, you have to see it from that perspective, I think it's a valid one.\n\nAnd that's just one part of it. Now this child's life has literally been uprooted, and has to go perpetually back and forth between mom and dad, as a collateral of this tug of war just because it didn't work out between them. \n\nI just think that children are often treated as collateral when it comes to divorces, and people tend to underestimate the effect that separation can have on their lives. Honestly, I think it's a huge deal and it lends to the following debate:\n\nWhich is more important?\n\nThe child's right to have a functional family? Or the parents' right to find their happiness regardless of the circumstances?\n\n&#x200B;\n\nIt's like that scene in Pulp Fiction, Vincent says \"well, you play with matches, you get burned\", then Jules says \"you don't think he overreacted?\" \n\n*\"Antoine probably didn't expect Marsellus to react the way he did, but, he had to expect a reaction\"*\n\nI think it's hard to say if OP overreacted or not, because it's a difficult situation by nature, and everyone reacts to it differently, but I also think it sounds condescending to minimize the impact that it actually had on OP by pretending nothing happened and carrying on when everyone around you knows what happened.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "That’s so cruel for people to say he wasn’t the one being cheated on — it hurts in a different what his mum did as her son.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "It’s really bizarre seeing so many people asking what she did to him and how she only made one mistake. I think he has an unhealthy grudge but he doesn’t need to forgive her.  I also understand why he is so upset with his cousins.  He cut off her entire family but they thought he’d be ok with them giving his mom updates and giving him his address?  Ridiculous",
                  "id": 184,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Ngl I kind of agree with someone else saying that it's because it's his mother and because OP is a guy. \n\nIf this was a girl posting about how her dad repeatedly tried to do this I have a feeling the judgments would be very different.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "[deleted]",
              "id": 186,
              "comments": [
                {
                  "score": 67,
                  "content": "[removed]",
                  "id": 187,
                  "comments": [
                    {
                      "score": 41,
                      "content": "We get posts in here all the time of adults in moms position and their almost always labeled the asshole and told to back off.. but here that is unacceptable?",
                      "id": 188,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Its not even a grudge imo. He just does not want to be around her, and SHE is the one repeatedly showing up to his events and trying to push her way into his life. All he does he ask her to be removed. If his family would stop trying to interfere, he would probably have had space and time to think about things, maybe even change his mind after some years had passed. But his family is making it impossible.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Okay I understand what your saying but when a spouse chooses to cheat they’re directly affecting the child because of the risk it poses to the family. She knew the risk of cheating and still did it. OP does have some issues though, he doesn’t have to forgive her but man i can fee the resentment in some of his comments",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "> That's what I want to know, what did she do to HIM.\n\nBesides harassing him for a decade after he turned 18, you mean?",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "Cheating is not a mistake it's a choice",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "She ruined their family. Not happy in the marriage get a divorce. Don't fuck his teammates dad.",
          "id": 193,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 848,
      "content": "My mom also cheated on my dad, with multiple men. I did te same things you did and honestly she kind of deserved it. But even though we had the same thing happen you are still 100% the asshole. \n\nYou see, you never grew up, you never learned, you never tried, you never healed. It's fucking hard healing from something like that but you just never tried and now you are filled with so much hate and disgust that this isn't healthy. I'm not gonna say \"make amends you only have one parent\" but do heal for yourself. If you both decide to have a relationship and try keep moving forward go ahead, but you gotta first fix your relationship here before you commit to one for maybe your whole life.\n\nFrom one broken individual to another, you need to do better for you.",
      "id": 194,
      "comments": [
        {
          "score": 218,
          "content": "Did you ever reach back out? Why did you cut her off?",
          "id": 195,
          "comments": [
            {
              "score": 309,
              "content": "Well it was hard, since everyone blamed me for the separation. So for like a year I cut her off. She left the house and I didn't want nothing to do. I did the same as op, ignore her, don't reach out and make her leave my events. I was hurt and didn't know how to cope with the hate from everyone and knowing I don't have a famiy.\n\nBut I did reach out when my sister got really sick, my mom couldn't even react or eat. So I reached out and helped her eat, get well and even thought I'm still hurt by everyone and everything I learned to cope. I might never be 100% ok with what she did or be 100% ok mentally. But I learned, I accepted and now I have a relationship.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 213,
              "content": "Not giving a judgement, just here to support what u/FerCasorla is saying. My mum cheated on my dad and was generally shitty at times, but I've never harboured this kind of abject hatred for her. I feel really sorry for your mum to be honest. You went absolutely nuclear on her, and while no one can tell you that you have to repair the relationship, I think you need to do some work to figure out WHY you reacted that way. I think cheating is an awful and immoral thing to do, but I'd be wary of someone's emotional maturity if they continued to react this way.",
              "id": 197,
              "comments": [
                {
                  "score": 19,
                  "content": "Why? He set a NC condition. He's not out there actively torturing his mom. He's not raging around the house.\n\nHe asked his mom not to show up to his games. She didn't listen. His mom put them in GROUP therapy to try to fix his relationship with his mom (you really think OP is going to open up to a therapist IN FRONT OF HIS MOM about how he felt after defending his mom for months and finding out his mom lied and she really did cheat). \n\nMaye if OP had a year of NC, like this poster did, their relationship would have recovered. Instead, the family kept trying to push them together. OP is finally done.\n\nMaybe this is bad for OP's mental health, but OP is the judge of that - not you and not his mom.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Same here, but opposite parent. I've never harbored any resentment because my mom made it clear from the get go that this was between her and my dad. She actively encouraged us to see him as often as possible.  We went together to therapy as a family so that my sibling and I could process the end of their relationship. The way I saw and still do see it was that  if my mom, the person who knew him best and who was betrayed by him, is telling me that he is still worthy as a father then I'm going to believe her. \n\nI also wonder how OP's dad would have felt about him excluding her from the funeral. It sounds like they developed a cordial relationship and were still in contact. Theyd been together since the were teenagers, as had my parents.  I'm 45 now, they're both in their sixties and speak fondly of each other. I'm glad that my mom didn't allow me to blow up my relationship with my dad's entire family.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Honestly though, I think OP needs time. To breathe, to be on his own, to just have some time off but I don’t see that his mother is giving him that. She keeps showing up and he can’t even trust his cousins to not give his private details out. I don’t know what their relationship would look like if she’d given him space but I have a feeling he won’t feel like he’s walking on eggshells if she did.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}