{
  "post content": "Throw away\n\nI (34m) have a wife (32f) and we have two children 4f and 7m. I work as a manager at a care home and my wife owns a bakery with her mum. My wife cooks all the time because she is much better at cooking than I am, I cook sometimes. She is the one who takes care of the house, kids, and chores.\n\nYesterday when I came back from work dinner was ready so I plated it up for everyone while my wife was washing her hands (my kids like their food cut up) I was cutting their chickens into pieces and it looked a bit pink I told my wife to look at it and she said “it’s a little pink but it’s fine”. I told her I’m not letting them eat this if it’s pink, she told me to stop being a baby and it won’t kill them. I kept telling her it’s pink in the middle they shouldn’t eat that they can get food poisoning and that’s it’s dangerous for them. She told me “if you don’t want them eating it then you can cook their dinner”. \n\nI made them cheese and ham toasties, also made her one but she didn’t eat it. She told me she isn’t talking to me if I think her cooking is horrible. I don’t think it’s horrible I just didn’t want our kids eating that. I told her to stop thinking she was right. So AITA?",
  "id": 1,
  "comments": [
    {
      "score": 31643,
      "content": "I NFO : why didn't you just put the chicken back in the oven ?!\n\nIn the meantime, YTA. Pink chicken is not dangerous if the internal temp was high enough. Also, instead of just saying \"oh honey, I am worried the chicken is a little pink, can we cook it just a little more just to be safe ?\", you went all the way \"I am not serving that to the kids!!!!\" and made a new meal altogether.\n\nEdit just for people that don't know how to cook : Chicken has to reach a temp of 165 degrees. It might still look pinkish but [it's totally fine to eat](https://www.thekitchn.com/chicken-still-pink-after-cooki-157168)\n\nAlso, the chances of getting salmonella from undercook chicken is pretty slim. The real risk is cross contamination, not undercooking.",
      "id": 2,
      "comments": [
        {
          "score": 9970,
          "content": "Color is not a good indicator of whether the chicken has reached 165°F. You can have pink chicken that has reached the proper temp and is safe-- and it's actually much tastier and juicier that way. Would make sense for a professional chef like OP's wife to be able to cook chicken optimally. But even if it was, still YTA for the reaction. If you're that worried and untrusting, nuke it for a minute.",
          "id": 3,
          "comments": [
            {
              "score": 5035,
              "content": "OP's wife is not a professional chef, she owns a bakery. Which means she probably bakes things like pastries or bread, not grilled chicken sandwiches. \n\nAlso it doesn't sound like OP's wife was sure that it had reached 165 despite being pink, it sounds like she was just lackadaisical about it and figured it was probably ok.",
              "id": 4,
              "comments": [
                {
                  "score": 6515,
                  "content": "Maybe the primary cook in the house who also cooks for a living didn't feel like justifying OP's condescending remarks. \n\n\nMost people absolutely obliterate chicken when they cook it. They think the only way chicken is done is if it's dry and white as a retro dog turd. \n\n\nPlease go to your local bakery and tell the chefs there that they don't know how to cook chicken and get banned for life.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5542,
                      "content": "“It’s a bit pink in the middle” isn’t a condescending remark.\n\nOP’s wife being a baker isn’t relevant in the slightest, cooking chicken isn’t related to her profession at all.\n\nNTA Op, it’s perfectly fine to take potential food poisoning seriously.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 278,
                      "content": "My husband, oof. I'm like \"can't you see its not juicy anymore? \".\n\nEven this kids just drown it in hot sauce. \n\nYTA op if it was just some pink a minute in the microwave would have saved you this argument. Instead you wasted your wife's food.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 243,
                      "content": "So so true. I didn’t realize that ALL chicken wasn’t dry and tough until I married my husband and he cooked me chicken.  Apparently turkey can be cooked without drying the hell out of it as well. Who knew? Husband used to be a sous chef and enjoys cooking. \n\nOP is TA for the way he spoke to his wife about it.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "“Retro dog turd” 💀",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "Oh man you just gave me flashbacks to my grandmother's cooking. My mother and I jokingly referred to her chickens as chicken Vesuvio for they must have been cooked in Mt Vesuvius.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I spat my coffee all over the place at ‘retro dog turf’ Lmao!!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Agreed. The guy flat out says he doesn't cook nearly as often as she does, and he's going overboard to prove some point that he knows more than her? Personally, he'd be cooking for the next month if he did this to me. Clearly, she can take one whole chore of her plate now. She deserves it.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My GF is a red seal chef and I am EXTREMELY careful about what I say about her cooking for exactly this reason. I may be an idiot when it comes to cooking but at least I can recognize that and defer to her judgement. I also realize I’m very lucky to be eating top quality restaurant food at home so really. Who am I to say this chicken looks pink or that’s a weird way to cook bacon? Just stfu and enjoy XD",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": ">Most people absolutely obliterate chicken when they cook it. They think the only way chicken is done is if it's dry and white as a retro dog turd.\n\nTotally off topic, but this made me laugh. Also made me remember the first time my husband cooked for me. It was the driest, blandest chicken I have ever had (he cooked it in the oven with no seasoning or any marinate whatsoever). He was so proud to serve it to me I just smiled and ate it but was dying inside. When we started living together I told him that and we both looked for better ways to cook chicken (because I can also admit that I am not the best cook lol).",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Omg this. I basically never order chicken when at a restaurant because they usually deliver something that could patch up holes in one’s shoes. But seriously, everyone just needs to own a decent instant read cooking thermometer. I got my latest one online for around 25 dollars.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 435,
                  "content": "As a baker myself plenty of baking is savory and includes meats in many pastries. I’m positive wife knows how to cook chicken to correct temp if she is a professional baker.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 251,
                      "content": "Yeah people act like baking is all sweets. When like chicken pot pie, sausage rolls , and various other cultures all have baked savory dishes",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It is also completely stupid to say a baker is not a chef. Given that baking is about the most difficult cooking you can do, to me it's the equivalent of telling someone they are not a doctor, because they are just a surgeon.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 213,
                  "content": "She doesn't sound lackadaisical at all she sounds experienced. \n\nWhen it comes to technical cooking skills, baking is always more specific than cooking. So while she isn't a \"professional chef\" per se her ability to judge cook time, temp, doneness and so forth at a glance more than likely is on par with or exceeds that of most chefs.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 202,
                      "content": "[deleted]",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 183,
                  "content": "If she is a baker she is as good as a professional cook. Bakery requires much more precision than cooking. As a former professional chef I can almost guarantee she knew what she was doing.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Food service worker (cake decorator, pastry chef, etc) over 10 years, yes, I agree. People seem to think baking is easier than cooking. It is not by any means.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 167,
                  "content": "I'm sorry are you saying a baker doesn't understand temperatures and when food is done?",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 148,
                  "content": "I wouldn't say lackadaisical just much more experienced. If shes the one that almost always cooks over the course of 10ish years that's thousands more meals cooked.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "> Which means she probably bakes things like pastries or bread,\n\nJust so you know, professional bakers are also chefs, and also must be trained in food safety.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 109,
                  "content": "[removed]",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 93,
                  "content": "You learn about all that to be certified by your state to be able to serve food. As a baker, she’d absolutely have that certification & would be very familiar with all the temperatures & what’s safe /unsafe for food, not just bakery items. They don’t have a special test just for bakery people, lol",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "She probably still has to be food safety certified (at least in the US she would be) which means she understands how to safely cook chicken. Also many bakeries include savory items like meat pies/pastries or chicken salad sandwiches. I'm sure she's competent enough not to poison her children. Chicken can be a little pink and safe to eat.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1281,
              "content": ">She is the one who takes care of the house, kids, and chores.\n\nI thinking a guy who would write this would also not say something like what you suggested.\n\nOP, why does your wife take care of, um, everything?\n\n&#x200B;\n\nEdit: forgot a word.",
              "id": 29,
              "comments": [
                {
                  "score": 1094,
                  "content": ">OP, why does your wife take of, um, everything?\n\nWow, so you're just gonna ignore how he PLATED the meal and CUT IT UP all by himself and gave his wife some \"me time\" to wash her hands?!  /s",
                  "id": 30,
                  "comments": [
                    {
                      "score": 298,
                      "content": "That's practically a vacation right there!",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "He deserves a damn reward! Here you go:\n\nYTA",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "But she’s the one who cut it up!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Where can I find me a prize like him? What a catch(!)",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 84,
                  "content": "I was bothered by this as a stay at home dad. My wife is the one who makes the big bucks so she works and I’m at home so yes I do take care of all that because I can and I like it \n\n But holy hell if both are working why is one doing all that extra work only? Ahhhhhhhh!!!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Right. I was basically screaming inside after reading this.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "This is what I was wondering. OP, why does your wife do everything? Then you come in like the hero making a glorified grilled cheese sandwich?",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "and...\n\n>  we have two children 4f and 7m.\n\nIt would appear she has successfully kept them alive thusfar.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Notice OP also said “I have a wife”. Not “I’m married.” Is she one of his belongings? I have a wife, a house, a dog. I know we say we “have 2 kids”, but “I have a wife” just doesn’t sound respectful.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 463,
              "content": "Does OP not have a meat thermometer? If it had just come out of the oven, probe that shit. My mother is a fantastic intuitive cook, but if something looks potentially dodgy, she whips out the thermometer. I use it a lot more because I am *not* a fantastic cook.",
              "id": 40,
              "comments": [
                {
                  "score": 198,
                  "content": "Exactly this, my dad's a professional chef, I'm a reasonably good cook as a result (nowhere near perfect but cook could before I could walk kinda thing) we both rely on the thermometer! Chicken can be confusing, it can look really pink where its been by the bone but be cooked through, just always check it, easy!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "My little instant read thermometer is my best friend in the kitchen. I used to obliterate chicken",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Just make sure it's not a rectal thermometer. That's will really make anything taste shitty.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "If he's cut up even one plate of chicken, then the food would have cooled considerably at that point, so testing it right then, unlikely to be at 70 degrees Celsius(as recommended by UK Food safety guidelines.)",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "Agreed!   I’m thinking  he’s more TA bc he said wife takes care of children, chores and cooking.  So what does he do???   \nI recently baked chicken in the oven, temp was 165 but it looked bloody, like the juices on the pan weren’t just a little pink but some red as well.  I put it back in oven, I was too scared to eat it. LoL",
              "id": 45,
              "comments": [
                {
                  "score": 14,
                  "content": "You would have been fine. Anything bad was killed 10+ degrees earlier.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "He did cut up the chicken. Lol.\n\n I thought the wife was a stay at home mom at first but re read it and they own a bakery. That's gotta be demanding work.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "You actually don't need chicken to be internally 165. 155 is usually good enough. 165 kills off most bacteria in 3 seconds whereas at 155 it kills it off in like 30 seconds. So if you let it sit / it's been cooking awhile it's fine to eat at a lower internal temp.",
              "id": 48,
              "comments": [
                {
                  "score": 128,
                  "content": "I cook my chicken in a sousvide at 150. But I leave it in there for like 4 hours. It can sometimes be slightly pink but there's no chance of any bacteria or parasites at that point. 165 kills instantly. But even 130 kills everything if it stays at that temperature for a long time.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 101,
                      "content": "My friend once hosted a dinner party because he wanted to show off his new sous vide. He made chicken and we were all whispering to each other, \"Are you \\*sure\\* we can eat that? Are you going to eat it? You eat it first, and then I will.\"\n\nDamn good chicken, though.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I like my salmon to what most would consider \"undercooked\" and the sous vide is a life saver.  112 degrees for about an hour and then a high-temp sear on the skin makes the salmon buttery-soft with a nice skin crunch.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is correct! I do want to add some more detail though. 165 degrees F will kill salmonella instantly, whereas chicken at 155 needs 48 seconds and 150 about three minutes. If you pull a chicken breast off a pan at 150, it’ll raise to about 153 for three minutes and then begin to cool. [Source](https://www.seriouseats.com/the-food-lab-complete-guide-to-sous-vide-chicken-breast/#)",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "165 is instant death for bacteria.\n\n150 for 10 minutes is also death for bacteria.\n\nI smoke turkey breasts to a minimum of 150 + 10 minutes.  If it gets hotter than that, great. It's tender and juicy and I have yet to make anyone sick - including myself.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Especially if they were eating chicken thighs instead of breasts.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "There was a host of articles a few years back about just this.\n\nHere's a website that gives and overview of why pink can be OK (or not) [Pink Chicken](https://bourbono.com/can-cooked-chicken-be-pink/#:~:text=The%20pink%20color%20in%20cooked%20chicken%20often%20happens,5%20top%20reasons%20why%20cooked%20chicken%20is%20pink)",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'd say it's a damn good indicator if it reached 165, unless it's either right up by the bone and won't ever look done because of the little myoglobin left. But definitely not a good indication of safety. Chicken absolutely doesn't have to be cooked to 165. Try actually doing that on chicken breast, it's not good. Chicken can be safe cooked to much lower temps. Even if you're just grilling it you really only need to go to 155 to be safe. But do that shit sous vide and you don't even need to go over 145.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 515,
          "content": "Heck, I got to the end and said \"Just nuke it!\" I mean, it's cut into chunks so 2 minutes on high ought to take care of it.",
          "id": 57,
          "comments": [
            {
              "score": 204,
              "content": "Two minutes on high would destroy that chicken.  It's a bit pink, not raw in the middle.  It needs maybe 30-45 seconds.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 111,
              "content": "Eugh rubber",
              "id": 59,
              "comments": [
                {
                  "score": 86,
                  "content": "2 minutes is long, a few seconds won't make it rubbery. You're just boosting the temperature, it's already \"cooked.\"",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Yep I would have just microwaved it",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Bruh, you cook a whole ass chicken breast from raw for 2 minutes on high in a microwave and it's going to be damn near fully cooked through.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "You mistyped 30 seconds, more than enough to temp an already cooked and warm piece of meat.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 513,
          "content": "I work in a restaurant kitchen.  We would never serve pink chicken, and without a thermometer, you can’t tell the internal temperature.  I would have put it back in the oven.",
          "id": 64,
          "comments": [
            {
              "score": 599,
              "content": "Having managed commerical kitchens before one of which being in a hospital I can confidently assert that the \"never serve pink chicken\" adage isn't so much about safety as it is about perception. \n\nServsafe and NSF standards just specify temps, not color. But people, like many of the commentors here, aren't aware of the subtleties of pink chicken or pork and can raise holy hell and damage the reputation of an establishment about \"unsafe food\" that was in reality perfectly fine.",
              "id": 65,
              "comments": [
                {
                  "score": 25,
                  "content": "My local BBQ joint has a sign explaining that smoked chicken is in fact pink, in some places. I had to ask if people actually complained. Apparently: yes. Enough people don't know about smoking meat and are concerned when they see any pink. Even though the wrong pink is really the wrong texture; smoked-meat pink is entirely different in texture.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Not just chicken. Even with steak (that I usually get medium rare), my friends always warn me that I could die because its too pink and they find it disgusting.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Lol your friends are extra special.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "When I stopped cooking pork like my mom, it made such a huge difference. I didn't know about chicken though, when I do whole chickens I wet brine them and then spatchcock them so even if they are over they are super moist still.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That's because the safe temperature for pork was lowered from 165f to 145f. But the word never got out and a lot of knowledge is passed on rather than routinely verified.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "That's because most houses don't have thermometers. So the safe way for a home cook to tell is the colour.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Why? Everyone person I know has a meat thermometer. They cost like $5",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 216,
              "content": "You wouldn't, because like all the commenters here, tons of people don't know what is or isn't safe. You're not cooking to serve the best food, you're cooking to serve food that won't get sent back.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "Agreed. Better safe than sorry if you are the worrying kind. I get that. \n\nThat's not what OP did. He made a whole new meal.",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "The likely reason behind that is public perception and avoiding having dishes returned to the kitchen, not food safety.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Then you must have some really high end suppliers. \"Pinking\" around the bones often isn't a function of temp or undercooking, but is due to the young age and rapid growth of most commercially available chickens. Basically the bones are more porous, which means during cooking various heme-type compounds are forced out of the marrow and into the meat. These stay pink/red well past the doneness point of chicken; I've had deep fried hotwings that showed pinking, even though they were absolutely blasted. If you're serving bone-in chicken, unless you are cutting and checking literally every single piece prior to service, you've probably served some pinked pieces. \n\nhttps://pdfs.semanticscholar.org/6914/35422cd2b2d6c0cfbbd03195ebd6cc60d7eb.pdf",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 425,
          "content": "YTA for wasting perfectly good food. Just cook it more. Its pretty simple. Or get a food thermometer & check that its cooked to the correct temperature.",
          "id": 77,
          "comments": [
            {
              "score": 13,
              "content": "Also, help your wife with the housework FFS or defer to her every choice in those matters. It is unfair to do all the housework and then have some non-working party come in with their kibbutz.",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Came here to say \"Just get a food thermometer if youre paranoid\", thanks for this comment.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 358,
          "content": "Also, he \"cooks sometimes\" but she takes care of the house, the kids, and the rest of the dinners WHILE ALSO running a bakery? OP sounds lazy af.",
          "id": 80,
          "comments": [
            {
              "score": 98,
              "content": "Yeah what tf does he do? Go to work and sometimes cook? Christ on a bike help her out man",
              "id": 81,
              "comments": [
                {
                  "score": 34,
                  "content": "At least he made the kids some toasties 🙄 what a supportive husband and father!",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Well, he obviously is there to tell her how she’s doing it wrong. A vital role in household management! /s",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "His poor wife.",
              "id": 84,
              "comments": [
                {
                  "score": 9,
                  "content": "\"I told her to stop thinking she was right\"\n\nThat's such an awful comment because she WAS right. I wonder how often he says shit like that to her in front of their kids.",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 342,
          "content": "What I want to know is how come she does all the cooking, house, kids, and chores.  Sound like you’re not pulling your weight.",
          "id": 86,
          "comments": [
            {
              "score": 145,
              "content": "\"She's a better cook\"\n\nUh idk dude, if you can read, you can cook. It's not hard to make homemade Mac and cheese or sloppy joes for your kids. Meatloaf. Pasta dishes. \n\nHow are these men surviving so long with being so allergic to cooking?",
              "id": 87,
              "comments": [
                {
                  "score": 23,
                  "content": "As someone who does not like cooking at all because I am a lazy eater (as in, I don't want to spend time preparing it, I just wanna eat!), I have found ways to cook that are healthy(ish) and relatively easy. It's not hard!",
                  "id": 88,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Homemade mac and cheese- super easy. I found a spinach manicotti recipe that doesn't require precooking the shells- easy and the girls could help stuffing the shells. Vegan lentil sloppy joes- very easy. A one-pot enchilada orzo that is tasty and easy to clean up. \n\nThe amount of absolute laziness and entitlement to allow your wife to do all the cooking \"because she's better at it\" is unbelievable. I don't like cooking, but why he can't take the meals while his wife is doing everything else is beyond me.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "She's a better cook so why isn't he doing any of the other stuff? My grandad always did all the cooking and my grandma did more of the cleaning to balance it out, she didn't go welp guess you'd better to all the dusting and hoovering and childcare too!",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeh I hate that line. You think I came out of the womb knowing how to fking cook!? I spent the time to practice and learn - it takes 1-3 months for a skill useful for 40-60 years of your life. Stop making excuses and train yourself, lazy cop outs.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Tbf, she does own a bakery. I know baking and cooking aren’t the same thing, but I’d be willing to guess she is definitely the better cook. I would of course be picking up the slack for other chores to compensate if I was in a similar situation.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I’m not surprised she’s better. But if she’s already spending all day baking, she likely wants a break. He spends all day caring for people, does he want to take care of elderly people every night in his free time? Clearly not since he doesn’t even take care of his own kids…",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's the weaponized incompetence",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Yeah, what?? Why did I have to scroll so far down for this? This woman co-owns a bakery (usually super long hours beginning before dawn), AND takes care of 90% of the domestic labor?? Unacceptable.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I love all the people arguing about whether not the chicken is safe, whether or not a professional baker's cooking expertise can extend to poultry, etc.\n\nIf she's pissed off at him over this, *it's not because of this.* It's not the chicken. It's almost certainly something else that's bothering her. Could be her husband and the distribution of household work, as you mentioned. Could be something entirely external. Could be the marriage is falling apart at the seams.\n\nBut it's definitely not *this.*",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 299,
          "content": "Do you own a meat thermometer?  Check the temp, for pity's sake.  Don't eyeball it.  ( But your wife probably already checked the temp.)",
          "id": 97,
          "comments": [
            {
              "score": 231,
              "content": "I once cooked pork that reached 10 over the desired temp in the middle, was juicy, a tiny bit pink, and my dad threw it back on until it was d r y bc \"pink is inedible\" like i literally googled it-",
              "id": 98,
              "comments": [
                {
                  "score": 102,
                  "content": "Yeah, I hate when that happens. Lean pork is exactly like chicken that way; overcook it for one damn second and it's like eating chalk.\n\nI'm all about the meat thermometer, and if the color doesn't agree, I go with what the temp says.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 87,
                      "content": "Bacteria isn't checking the color to decide if it's time to die, lol.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "People, especially those 40+, were really trained hard on \"pink is dangerous/inedible\". It's super frustrating, considering how much better it tastes.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It's only since 2011 that the USDA has lowered their safety temp for whole cuts of pork from 160 to 145 F. So yeah people over 40 lived the majority of their life cooking pork to a higher temp since that was what the government said to do. Can't really blame them. Poultry is still 165F. buy a thermometer and never have to guess again. \n\nhttps://www.cidrap.umn.edu/foodborne-disease/usda-145-degrees-safe-temp-pork",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "I’m a bit like your dad (I’m sorry!) I’m so paranoid about pink pork chops and chicken, that even a little pink is nope for me. But that’s my food insecurity and aversion coming into play (and being fed bad food). I’m sorry it was dry though :(",
                  "id": 103,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My boyfriend is like this too. I tell him I took the temp and it’s safe, but mentally he cant get past it. He doesn’t prevent other people from eating it though and he doesn’t make a big deal about it. He owns his own insecurity about it. Sounds like you do too.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Even when you know the temp??",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I once made bbq rub and sauce from scratch, peeled expensive, perfect Gulf shrimp, wrapped them in bacon and made kabobs for a couple who were hosting me. The guy made a big deal out of what a great griller he was, so he takes the bacon-wrapped, rubbed shrimp and get them on the grill. \n\nOVER AN HOUR LATER I scraped the poor charcoal pieces off and drowned them in bbq sauce to choke them down. During the entire incineration process he kept saying that it was pork AND seafood, and you really want to make sure those are well done.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh my god i feel so bad for you that sounds so delicuous what the fick 😭😭",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "And the FDA is fucking conservative about those numbers",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "I think she would have said she had checked the temp if she had.",
              "id": 109,
              "comments": [
                {
                  "score": 150,
                  "content": "I am constantly amazed at how shitty people are at communicating clearly.\n\nIt would not surprise me at all if she had a thermometer in earlier, but OP's questioning of her cooking skills made her react defensively instead of just saying \"I took the temp earlier, it's fine.\"\n\nSome times people just want to be trusted, and start pointless fights when someone questions them.  It makes no sense to me.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "“Believe me, it’s fine” takes less time to say to your husband, who doesn’t really cook or do anything around the house, than going into the safety recommendations for chicken. OP is TA",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 185,
          "content": "The 165 degree thing is also the temperature to kill things *instantly.* In reality, things are safe a bit lower than that just because of the time they spend at that temperature.",
          "id": 112,
          "comments": [
            {
              "score": 75,
              "content": "Yes, there's an entire time x temp chart from the FDA for various foods and by the time you get to 165 in chicken, the the lower temp x time has probably already killed all the bacteria in it.  \n\nI think 155 kills everything in 30 seconds or so, so your chicken just needs to sit at that temp for 30 seconds, and in reality you can take it off the stove because conductive heat transfer is going to raise the internal temp a few more degrees too before the center cools down.",
              "id": 113,
              "comments": [
                {
                  "score": 7,
                  "content": "155 is 55s I believe",
                  "id": 114,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Thanks.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "*sous vide has entered the chat*",
              "id": 116,
              "comments": [
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 119,
          "content": "TIL that sometimes pink chicken is safe. I never knew this and now feel like a moron!",
          "id": 118,
          "comments": [
            {
              "score": 151,
              "content": "It can be, you just don't take chances if you don't have a meat thermometer.\n\nOver a million people a year get salmonellosis in the US, and like 400+ people a year die from it (just in the US). It's one of the most common causes of bacterial diahrrea globally.",
              "id": 119,
              "comments": [
                {
                  "score": 64,
                  "content": "Very few of those cases are from the actual chicken itself being undercooked. Most cases are from cross-contamination.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Cross-contamination, for those who don't know, is usually from having raw chicken on the same surface that uncooked food like a salad or garnishes will go onto.  This surface can be your hands, a cutting board, a chicken marinade, etc...  Anywhere that has touched raw chicken or any meat, clean thoroughly before anything else touches it, including hands.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yup this. People need to learn more about actual food safety and how cross contamination happens. I guarantee everyone bitching about pink chicken keeps cooked meat and raw meat in the same area of their fridge lol.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The vast majority of those cases are cooked foods touching raw chicken. Not undercooked chicken being sold. I worked in a kitchen and it was perfectly fine to eat slightly pink meat. Using the same knife that you cut the chicken raw with and then used later or putting it on the same cuttingboard is what gives you a reason to change your pants.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Seriously, get a Sous vide. Game changer for chicken.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 111,
          "content": "And 165 is just the official FDA line which leans towards unnecessarily extreme caution.\n\nSafe temps are not only a factor of temperature but time as well.\n\nA piece of chicken can be safe to eat as low as 140-145 as long as it has been held at those temps for long enough.\n\nThis is one of the principles behind the sous vide process that has become increasingly popular in recent years.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22774,
      "content": "Can I just...\n\n>I work as a manager at a care home and my wife owns a bakery with her mum.\n\nOk, so two working parents, got it.\n\n>My wife cooks all the time because she is much better at cooking than I am, I cook sometimes.\n\nDang, it's so unfair how women are just genetically better at cooking than men are. Women don't have to go through the tedious process of learning how to cook like men do, how nice for them.\n\n>She is the one who takes care of the house, kids, and chores.\n\nSo she runs a business, a household, takes care of the kids, and does all the chores. What do you do?\n\nOh, complain about pink chicken and be extra about making the kids a whole new meal instead of putting the chicken in the microwave for 45 seconds.\n\nYTA\n\nEdit: For everyone saying what I wrote was sexist, it is a statistical fact that women are responsible for 75% of unpaid domestic labor worldwide. \n\nEveryone is assuming that OP's wife likes cooking more and that's why she does it, and that would be another conversation. (And loving baking =/= loving working all day in a bakery and then coming home to the responsibility of preparing and cooking a meal.) But that's not what OP said, and I'm taking OP at his word. \n\nHe said that his wife is better at cooking, and that's why she does the majority of it. Just because she's better at a task doesn't mean it's fair for her to hold the responsibility for it. Just like it wouldn't be fair for her to be responsible for all of the chores, child raising, household management, etc. if she happened to be better at them than he is. You all are absolutely right; cooking isn't gendered, and neither are the rest of those responsibilities. And that's why OP should practice and build his skillset instead of justifying the uneven division of household labor by saying, \"She's better at it.\"",
      "id": 126,
      "comments": [
        {
          "score": 7829,
          "content": "My appreciation for people who take the time to create these beautiful comment treatises with quotes from the original post and beautiful snarky responses for each terrible piece is truly infinite 😁! You have made my morning a bit brighter 😀",
          "id": 127,
          "comments": [
            {
              "score": 835,
              "content": "Thank you! It's my superpower!",
              "id": 128,
              "comments": [
                {
                  "score": 685,
                  "content": "Ungaslighting the world. One comment at a time",
                  "id": 129,
                  "comments": [
                    {
                      "score": 283,
                      "content": "Holy yuck! Gaslighting isn’t real you’re crazy.",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "Yea, this post wreaks of misogyny... great job pointing it out.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1172,
          "content": "And can I just add to your excellent breakdown, what part of the chicken? Breast, yeah I can kind of see the concern (not enough to make a song and dance about it, just cook it longer), but thigh? Sometimes that IS pink even when cooked perfectly. \n\nDifferent parts of the chook aren't always perfectly white when cooked.",
          "id": 132,
          "comments": [
            {
              "score": 320,
              "content": "I think the filet (at least the boneless part) or something, as OP was cutting it (who tf cuts a wing??)\n\nBut can I ask why on earth the 7yo isn't cutting his own chicken?? 4 is maybe a bit young (idk, maybe not) but 7 is definitly old enough to cut his own food.",
              "id": 133,
              "comments": [
                {
                  "score": 203,
                  "content": "What is daddy going to claim he's doing if the kids cut their own food?",
                  "id": 134,
                  "comments": [
                    {
                      "score": 104,
                      "content": "A Real Dad™ will chew up his children's food and spit it into their mouths like a baby bird.",
                      "id": 135,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "It’s funny, in Dutch we have a famous commercial with a kid that goes “who’s that man that always comes and cuts the meat on sundays?” The implication being of course that their father is so absent the kid hardly knows him.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Was thinking the same. As if he only added it to show \"see I am doing something\". All he showed is he's doing something he should not be doing tough",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 129,
                  "content": "Yeah what the hell! Even 4 is reasonable, but with supervision. Chicken shouldn't be hard to cut through with a kid friendly knife...if it is, that's a different issue.\n\nIf you're giving a 4yo a steak, sure, they probably need it cut up. But supervision should be fine for the little one, and 7yo should have it down pat by now.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Ok you don't cut a wing, but chicken thighs are \"dark meat\" and big enough to be cut.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Drumsticks are also dark meat!",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I wasn’t allowed to cut my own food until I moved out",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Yes, you're totally right. I didn't want to get into it because everyone has their own preferences as far as done-ness of meat, (my mom would frequently nuke chicken for being too pink) and cooking the chicken more couldn't have hurt. But yeah, I've definitely had drumsticks/wings/thighs with a little bit of pink even when I verified that they were at a safe temperature all the way through.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Funny how many people don’t realize the dark meat and light meat option applies to birds other than Turkeys.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 956,
          "content": "I was already raising a brow at “she cooks all the time bc she’s sooo much better at it” but when I got to the “she also takes care of the house, kids and chores” part, I was like damn, is she also soo much better at doing all those things? probably, since she doesn’t get a choice! sheesh, weaponized incompetence at its finest. how long until people finally stop getting away with this shit?",
          "id": 144,
          "comments": [
            {
              "score": 594,
              "content": "Weaponized incompetence yet somehow ALSO thinks he knows more than wife, who makes most of the meals, when food is done.\n\n\"I do nothing, but I know if I did it that I'd do it more right than you!\"",
              "id": 145,
              "comments": [
                {
                  "score": 107,
                  "content": "\"There are few people in England, I suppose, who have more true enjoyment of music than myself, or a better natural taste. \n\n\"If I had ever learnt, I should have been a great proficient.\" - Lady Catherine de Bourgh, Pride and Prejudice",
                  "id": 146,
                  "comments": [
                    {
                      "score": 9,
                      "content": "As Lizzie said to Darcy, she doesn't play the piano as well as she should wish to, but she figured it's her own fault for not taking the trouble of practicing!",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "😆 love that book",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Reminds me of a comment I read on here once that went something like\n\n“I’m a 21M, it’s easy to lose baby weight”",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 69,
              "content": "My wife and I (both F) are similar in that I do all the cooking because I'm good at it... But she insists on doing all the dishes because we are a team and she appreciated my good cooking. Dude sounds like an ass.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You do not even have to be great at cooking either. Not every meal has to be an amusement park. You can make a completely serviceable meal that tastes decent enough with very little skill.",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 360,
          "content": "Seriously - she's also presumably in a kitchen a lot of her day because of the bakery, so no way she really wants to spend more time in the kitchen to feed them. OP, YTA, and work on an equitable split of home responsibilities.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "I have no awards, so please accept this *chefs kiss* that I have for this comment.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Especially when that whole new meal is just melting some cheese on toast.",
          "id": 154,
          "comments": [
            {
              "score": 30,
              "content": "AND ham!!!",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I have to imagine that this is the extent of what OP brings to the table on the rare occasion that they cook.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "I’m so happy that my partner does all the cooking in this house! That said, I would never make a new meal for the kids after he’s put the effort in to prepare something and if he said it was fine I’d totally trust him because I know he wouldn’t put us in harm’s way.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "[removed]",
          "id": 158,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 48,
          "content": "He also cuts up the kids food.  7 yo",
          "id": 159,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "What pisses me off the most about it, is that I work in a kitchen, and if my husband/bf asks me to cook most of the time at home, I would tell him fuck no. \n\nI spend more than 40 hours in a kitchen, I don't want to then go home and be in another kitchen. Give me a break. I might be the better cook, but who cares, I don't mind eating simpler made stuff.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8479,
      "content": "You are both probably technically right but there are other issues at play. Some cuts of chicken can be a little pink. And the likelihood of catching salmonella from undercooked chicken is really really small compared to say….cross contamination. \n\nBut my question is why didn’t you just cook it a bit longer? offer to help?\n\n\nAnd why for god’s sake is she the one who “takes care of the kids house and chores” if she is working. This has very little to do with chicken and a lot to do with pent up hostility and resentment. Very well earned resentment.",
      "id": 161,
      "comments": [
        {
          "score": 2149,
          "content": "Even if the chicken was cut up and heating it the ove was impractical. You could just toss the cut up chicken on a skillet for a few minutes to finish it. Making a whole new meal was absurd.",
          "id": 162,
          "comments": [
            {
              "score": 474,
              "content": "Oooh, doesn't that sound nice. I actually like a bit of grill/char on my chicken",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 380,
              "content": "Shit even microwaving it a minute would cook those pieces the rest of the way.",
              "id": 164,
              "comments": [
                {
                  "score": 9,
                  "content": "Lmao that’s what my parents would always do when I was younger (and was paranoid I was somehow going to accidentally poison myself)! \n\nV chewy, 2/10, probably why I don’t like red meat…but I never got food poisoning!",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is what I would have done. Easy to cook it a little more.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 805,
          "content": "I would be so pissed if a meal I worked hard on making was thrown out just because it was slightly undercooked. This ain’t Gordon Ramsay. Undercooking things sometimes is normal, just throw it back in the air fryer/ oven/ skillet for a couple minutes and everything’s good to go. Easy. 🤦‍♀️",
          "id": 167,
          "comments": [
            {
              "score": 202,
              "content": "even gordon ramsey would accept slightly pink chicken if it were the proper temperature and texture 😂",
              "id": 168,
              "comments": [
                {
                  "score": 14,
                  "content": "Gordon actually likes undercooked chicken, it's more tender and juicy, and the UK doesn't have issues with salmonella like the US",
                  "id": 169,
                  "comments": [
                    {
                      "score": 10,
                      "content": "The UK absolutely does have issues like the USA does with salmonella. The only reason that it is perceived as a major issue in the USA is because of two things:\n\n1. The USDA shuts down any facility for a deep clean where it is even detected even if it's not contaminated any food\n\n2. We power wash our eggs to remove chicken poop as it doesn't ship well which removes a natural protective coating from them which makes them more susceptible to contamination later in the processing steps",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "[deleted]",
              "id": 171,
              "comments": [
                {
                  "score": 4,
                  "content": "hey! don't diss grilled cheese like that man. there are zero cases where I wouldn't prefer grilled cheese over chicken breast. on the other hand, thighs or wings? yeah I'm probably choosing the chicken. but grilled cheese is still fire.",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 259,
          "content": "in a nutshell, \"The pink chicken is not the issue here!!!\"",
          "id": 173,
          "comments": [
            {
              "score": 22,
              "content": "Thé Iranian yoghurt isn’t the issue here!",
              "id": 174,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "I can almost 100% predict what happened. Husband sat around while she did everything after both of them worked a long day. Then he came in and told her what he did was wrong and worded it like she would intentionally give their children food poisoning. She got irritated and went “fuck it, you do it.” \n\nYTA",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "🙌",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Seriously. If I was working, dealing with the kids, cleaning house etc all day, and hubby complains about my cooking and just tosses it to make a plain sandwich, I’d be offended too. She probably would have been fine if he just nuked it for a minute.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "> You are both probably technically right but there are other issues at play. Some cuts of chicken can be a little pink. And the likelihood of catching salmonella from undercooked chicken is really really small compared to say….cross contamination.\n\n>But my question is why didn’t you just cook it a bit longer? offer to help?\n\n>And why for god’s sake is she the one who “takes care of the kids house and chores” if she is working. This has very little to do with chicken and a lot to do with pent up hostility and resentment. Very well earned resentment.\n\nOP, I think what they’re trying to say is… YTA.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Even if she weren’t working outside the home there’s no excuse for all of that to fall on one person.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Could be the lighting, too. My thanksgiving Turkey looked pink at the table under the chandelier, took it back in the kitchen, not even a little pink. ¯\\_(ツ)_/¯ Live and learn.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5998,
      "content": "Yta. \nNot for the pink chicken but because you let your wife do the chores, cooking , and child rearing.\nThat’s why your concerns were not taken well. She’s tired lol. Step up.",
      "id": 181,
      "comments": [
        {
          "score": 853,
          "content": "Yes this! I can sort of understand being a bit worried about pink chicken if you're not an experienced cook...but say it nicely...and step up, what do you do exactly?",
          "id": 182,
          "comments": [
            {
              "score": 562,
              "content": "[deleted]",
              "id": 183,
              "comments": [
                {
                  "score": 86,
                  "content": "Could've used the cheese toastie skillet to cook the chicken instead... shame",
                  "id": 184,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Sandwiches are probably all he can handle, he's just not as CaPaBle as she is in the kitchen. And if he didn't throw it out, how would she know he was really upset 🙄",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 220,
              "content": "Right, imagine him sitting there, telling her the chicken is pink, like someone sending back a dish in a restaurant. No wonder she was annoyed.",
              "id": 186,
              "comments": [
                {
                  "score": 12,
                  "content": "Oh I completely agree don't get me wrong, lived with someone like this in our family for 20 odd years, pink chicken was always a point of contention for me until I learned to cook so that's why I said it like that...but 100% with you, this guy needs to grow up",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I guarantee it's something like, \"Well I work!\" without any self-awareness that he's working but so is his wife, but for some magical reason, she's expected to work, take care of kids, manage the household, and do everything else.\n\nIf she's \"better\" at cooking, it's because he's weaponized his incompetence and just lets her handle it because god forbid he try to improve or do better.",
              "id": 188,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "Haha! I agree, he only decides to “parent” when he’s criticizing her. Good job “dad”.",
          "id": 189,
          "comments": [
            {
              "score": 7,
              "content": "I think I saw Mrs OP on [Tiktok](https://www.tiktok.com/@ilovefarideh/video/7174486074473942278) (YTA to be clear)",
              "id": 190,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "But he made ham and cheese toasties. He even made one for her!! Does he get no credit?? /s",
          "id": 191,
          "comments": [
            {
              "score": 95,
              "content": "Making an easy unhealthy meal for the kids to prove a point. No points for daddy.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "While also running a bakery. But it’s normal in our society that childcare, meals and household stuff falls entirely on the woman, even when both parents work. And that’s why OP mentions it like it’s nbd",
          "id": 193,
          "comments": [
            {
              "score": 18,
              "content": "She’s better at it! And god knows you don’t get better at cooking just by practicing cooking! ….wait….",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Bro, running a bakery is easy, you only get up at like 3am every day to start making bread. /s",
              "id": 195,
              "comments": [
                {
                  "score": 12,
                  "content": "Literally someone upthread \"she just makes cookies and scones\". The invalidation is real!",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Very clear OP was trying to make some sort of point by cooking a whole new meal and not just cooking the chicken a little longer.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Like what does OP do?  Look pretty?",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yesss … the nerve of this guy he himself said she does EVERYTHING and what does he do complain ? . He needs to do exactly that STEP UP being a parent, cooking , and doing things around the home so overall he needs to get it together and step up he is a major AH.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3421,
      "content": "YTA for massively overcomplicating this. If something isn't cooked enough (and chicken under some circumstances can be pink and safe I think, but I'm old school and find that unappetizing) put. it. back. in. the. oven.",
      "id": 200,
      "comments": [
        {
          "score": 1337,
          "content": "BuT My wiFE iS The bEtTer CoOK",
          "id": 201,
          "comments": [
            {
              "score": 528,
              "content": "And does all the chores and childcare. While running a business which involves.....food preparation.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 178,
              "content": "yet he still decided to cook an entirely new meal to prove a point that what he cooked was “better & safer” for the kids to eat than what she made",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "And even though she is a better cook I am still in a position to tell her how to do the things that she is better than me at.",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "He also told her to stop thinking she was right! Problem solved.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 593,
          "content": "> put. it. back. in. the. oven.\n\nOP probably doesn't know how, because he can't cook.  Just like he doesn't know that chicken that is \"a bit pink\" as he described can be fully cooked.",
          "id": 206,
          "comments": [
            {
              "score": 146,
              "content": "[deleted]",
              "id": 207,
              "comments": [
                {
                  "score": 132,
                  "content": "She's a skilled cook who is *very* familiar with the concept of food poisoning and knows how to prevent it, because she literally owns a business in which she prepares food for people!  She checked the chicken and said it was fine, and that should have been the end of it.  \n\nI think there's a lot more going on here than OP being worried about chicken that is \"a bit pink\" which is normal especially with the dark meat.  This reads like he was trying to pick a fight with her for some other reason, and this was what he chose to fight over.",
                  "id": 208,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "A lot of people here actually have specific “toastie makers” which is basically where you butter bread on both sides, put one slice in, put the filling in and then the top bread and then just close the toastie maker until it’s done (think like a George foreman grill, put it in, close and wait)",
                  "id": 209,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Maybe they have a panini press. Honestly sounds like the highest level of cooking this man could achieve.",
                  "id": 210,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "90% sure they have a toastie machine which you just put sandwiches in and leave on till it's done. British people don't really make toasties in pans",
                  "id": 211,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "The fact that ham and cheese toastie is OP's goto makes me think they know very little about cooking. Let alone the fact that chicken being pink or not isn't a great indicator whether the chicken is done.",
                  "id": 212,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I've known people who were uncertain or scared of the oven (?) so I just taught them a couple times then made them use it. \"I already showed you how, you did it yesterday.\"\n\nJust learn. I'm pretty sure this shit's on wikihow and the back of most oven food packaging.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2533,
      "content": "As others asked….why not just cook the chicken a littler longer instead of making an entirely new meal??\n\nThe chicken wasn’t ruined maybe just needed another minute of cooking.",
      "id": 214,
      "comments": [
        {
          "score": 831,
          "content": "OP probably doesn't know how to just cook the chicken a little longer.",
          "id": 215,
          "comments": [
            {
              "score": 508,
              "content": "He is a man after all. There’s no way he can understand the complicated process of turning the oven on, putting the food in and setting a timer for a minute or two. That’s just too complicated. He needs his wife to be able to do that because she’s not a man and so those steps are significantly less difficult. Edit: /s",
              "id": 216,
              "comments": [
                {
                  "score": 95,
                  "content": "Well, his post seems to indicate that he did not understand that, so I guess yes.",
                  "id": 217,
                  "comments": [
                    {
                      "score": 60,
                      "content": "The other thing I kind of read it as is when she says  \n\n\n>“if you don’t want them eating it then you can cook their dinner”\n\nAnd he took it personally lol",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Also, it's a well-known fact that we men are genetically incapable of looking up how to do complicated things like \"cooking\", \"cleaning\", and \"looking after our offspring for once in a goddamn while\" on the internet if we're not familiar with the highly technical intricacies. Much better to leave it all to our exhausted female partners. /s",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "> turning the oven on ...\n\nPlate in microwave. +30 seconds button. Wait. Done.",
                  "id": 220,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 72,
              "content": "Honestly I think OP was going put of his way to make a point. He did manage to point out he is a massive AH.",
              "id": 221,
              "comments": [
                {
                  "score": 11,
                  "content": "He did admit in additional info he got cocky at the end.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Something tells me OP's wife is tired of his shit. I was tired of his shit by the end of his post. OP sounds insufferable for someone who doesn't help out at all around the house.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1663,
      "content": "YTA for, “I cook sometimes. She is the one who takes care of the house, kids, and chores.”  \n\nAs for the chicken, you could have cooked it a bit longer or microwaved it if you were worried about it.",
      "id": 224,
      "comments": [
        {
          "score": 71,
          "content": "Had to scroll a good ways to find this good take.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "\"I told her to stop thinking she is right\" pissed me off",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1319,
      "content": "Dude. Put it in the microwave for 30 seconds. Stop being such a drama queen.",
      "id": 227,
      "comments": [
        {
          "score": 88,
          "content": "Totally could have played it off by saying “oh looks like the food got pretty cold while I was cutting it up, I’ll pop it in the microwave to reheat” and avoided this whole thing. The whole thing could have also been avoided if he’d step up a bit :)",
          "id": 228,
          "comments": [
            {
              "score": 7,
              "content": "People get comfortable and complacent and forget to be diplomatic and kind not just out in the world, but in their own families and relationships. Arguably that’s where it should matter most.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 897,
      "content": "Did you bother to check the temperature of the meat?\n\nChicken  can sometimes be a bit pink, even when safely cooked.  You don't want to overcook it and serve dry, unpleasant food.\n\nYTA, and invest in a food thermometer.",
      "id": 230,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 894,
      "content": "[removed]",
      "id": 231,
      "comments": [
        {
          "score": 426,
          "content": "So he could hold it over her, probably. Manipulation at its finest.",
          "id": 232,
          "comments": [
            {
              "score": 38,
              "content": "It would explain why she works in/owns a bakery, does all the household chores, and provides childcare all while op twiddles his thumbs. He just expects *his woman* to do all the work.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 139,
          "content": "Or use a thermometer to check temp. Chicken can be cooked to the right temp and still be a tiny bit pink. And depending on the cut sometimes it's a pink that won't go away regardless of how cooked it is (like marrow spots on bone in chicken).",
          "id": 234,
          "comments": [
            {
              "score": 28,
              "content": "I HAVE to use a meat thermometer. I have a perpetual fear of undercooking my chicken and start to imagine pink that isn't even there. I won't trust my chicken unless I've temp checked it.",
              "id": 235,
              "comments": [
                {
                  "score": 16,
                  "content": "I'm red-green colorblind so I use a meat thermometer for safety. Ironically, the rest of my family gets sketched out by my chicken because they judge by color alone and overcook their chicken.",
                  "id": 236,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}