{
  "post content": "When Smoke came to us, he was skinny and had mats. He had been shot with a bb gun in the leg and had a raging bladder infection. We took him to the vet for wound care and antibiotics. Put him on a prescription diet. Nursed him back to health for a month, and all the while, I was putting up posts on NextDoor and Facebook, and anywhere else I could think of to help find his people. He wasn't microchipped. Nobody came forward. So, after 45 days, we took him to get microchipped and claimed him as our own. We have loved this boy for a year now. He's family. He's especially bonded with my son, who has autism and hangs out with him when the anxiety gets bad. \n\nLast night, a woman and a little girl came to our door to ask if we took in a grey cat because they saw him in the window. They said he got out when they moved here to AZ from Texas a year ago and have been looking for him everywhere. I brought him out so they could see him and immediately, they said he was theirs. But- they said he was 8 years old. My vet aged him at 2. They said he had missing teeth. He does not. They showed me a picture of their cat and it kinda looks like him, but the face is slightly different. They called him Demon, but he doesn't even respond to that. I have my doubts that he's even their cat, but I don't know if I'm deluding myself because I don't want to give him up. They said they don't want to take him away if we love him. We do, very much. But I also don't want to be the a-hole that takes a little girl's cat away either. \n\nHelp me, friends. What is the right course of action here?",
  "id": 1,
  "comments": [
    {
      "score": 58,
      "content": "Their information doesn't match your cat. Tell them you'll keep an eye out for their furry friend, but your guy doesn't match Demon's description as he's too young and has his teeth. \n\nNAH.",
      "id": 2,
      "comments": [
        {
          "score": 24,
          "content": "This is pretty much exactly what I said as well! The lady that came with the girl had an answer for everything. 😒 Still though, I don't think he's theirs!",
          "id": 3,
          "comments": [
            {
              "score": 14,
              "content": "Yeah, it sounds like they are desperate to find their cat and/or they are trying to scam you out of your cat.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 29,
      "content": ">They said he had missing teeth. He does not.\n\nTeeth are pretty conclusive. If it was just the age difference, I might say the vet was just off by a few years, but your cat didn't grow new teeth. It's not their cat, they just want to believe it is because the alternative, that their cat is probably gone forever and may even be dead, is too heartbreaking to consider. If it makes them feel better to believe it's their cat, but they're willing to let you keep him, just let them believe that. You'd only have to convince them it's not their cat if they demanded him back.",
      "id": 5,
      "comments": [
        {
          "score": 20,
          "content": "The teeth are definitely conclusive, but no vet would mistake an 8-year-old cat for a two-year-old cat.",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "I don't know, I volunteered at an animal shelter for a couple years and the age estimates from the vets are not that specific. Like the cat we got from there was \"3+ years old\". If they were able to narrow it down more, you'd think they would do so.",
              "id": 7,
              "comments": [
                {
                  "score": 8,
                  "content": "Yes, but two years and eight years would be easy for a vet to tell apart. There are developmental markers that make it clear.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 12,
                      "content": "He's also pretty much doubled in size since we took him in. If he was an adult cat and not a juvenile, I don't think he would have grown so long and tall.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NAH he is not there cat there is a huge difference between am 8 year old cat and a two year old the vet would not be that off",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NAH. \n\nThis doesn't sound like the same cat. If it were just the age difference, I could see the vet being incorrect but teeth? The cat wouldn't have regrown new teeth. I understand them continuing to look for their kitty and hoping you'd taken their baby in and they'd found him, but this is pretty clearly not the same cat. I'd just tell them that of course you'll keep an eye out for their kitty, maybe take the mom's number or something, but that your cat isn't missing any teeth and is only two years old so unfortunately it's not their missing cat.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "Show them the vet records if you can. With anything about his estimated age and show that he is not missing any teeth. You’re NTA. It’s not their cat.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA - the age is wrong, and the dental work confirms it. He’s not their cat so you’re good to keep him.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "DO NOT give him up, do not let him out to risk him to be taken. Even if he was theirs and he's clearly not, after this length of time he is your property. Cats don't regrow adult teeth and the vet can age a cat fairly accurately so there's that. \n\nDon't let them near him. It's too late but I would have lied from the get go and said he was from a litter I personally saw born. \n\nI would have been heartbroken if my cat got lost but you better believe I would have papered the neighborhood with flyers and contacted every shelter and vet on a weekly basis so the minute she showed up they'd know she was mine. They did not or you would have known.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA\n\nIt is not the same cat. Just because a cat looks similar doesn't make it Demon. I would tell them that there is no proof (missing teeth and age) so unfortunately you will not be giving them the cat.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. You told them that your cat is only two and healthy with all of his teeth intact, so that they can realize that smoke isn't demon, right?  If they still don't get it, ask them to speak with your veterinarian about smoke.  I'm sure that when they hear it from the professional that the cat is only two they will realize they are wrong.",
      "id": 16,
      "comments": [
        {
          "score": 4,
          "content": "I would not start giving out private info like who the vet is.",
          "id": 17,
          "comments": [
            {
              "score": 2,
              "content": "Agreed. You don't engage. After the discussion they've had already it's 'he is my cat, not yours. Good luck and goodbye'. Close the door and don't let him out to be stolen. They are not being reasonable and can't be trusted.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - Keep the cat he’s yours and keep him inside as I’d be concerned they would try and take him.\n\nTheir description doesn’t match, he’s not their cat. Don’t have any guilt, you tried to find his original owners and you’ve taken care of him.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}