{
  "post content": "This is an ongoing issue going on in my home. I 33F am currently pregnant with my first child. I live in a two bedroom home with my husband and step-daughter (23F). Step-daughter and I get along fine no big issues but we also are not super close.\n\nNow that the baby is coming we need more space unfortunately we can't afford a new home. I brought up to my husband asking Step-daughter to move out. My reasoning is that we really need her room for the new baby and she is an adult with a full time job so it is time for her to be on her own anyway.\n\nMy husband agreed and we brought it up to her at dinner one night. We told her we would help with her first 2 months rent. I told her it would be fun her and I could go shopping and I will help her decorate her new apartment. We tried to be as gentle as we could but she was very quiet. \n\nPrivately she told my husband that even though she as a full time job she cannot afford to live on her own. My husband told her she did not need to move out so now we are scrambling trying to find space for new baby.\n\nThe other day I was home alone with Step- daughter and tried to talk to her about it again. I offered  to help her find a roommate and she snapped on me. She snapped on me and told me to just leave her alone and locked herself in her room.\n\nWhen my husband got home from work he was mad at me and told me to leave her alone and not bring it up anymore. Things have been awkward and uncomfortable since making my pregnancy very stressful. \n\nShe is 23 old enough to be on her own she has a job and we are willing to help her. We need space for our baby I do not see how I am in the wrong here.",
  "id": 1,
  "comments": [
    {
      "score": 37049,
      "content": "Info: So you and your husband can’t afford another place to live but you expect her to ?",
      "id": 2,
      "comments": [
        {
          "score": 15514,
          "content": "Exactly,  I was just about to post that if the two adults can't afford 3 bedrooms,  how do they think the young adult probably just starting her career can afford 1.",
          "id": 3,
          "comments": [
            {
              "score": 6907,
              "content": "Exactly and we don’t even know what kind of job she’s has. She could be working minimum wage or be a server in the us making 2.25 plush tips a hour. It’s hard to live on your own now.",
              "id": 4,
              "comments": [
                {
                  "score": 4353,
                  "content": "My partner and I make above minimum wage and still are struggling with a one bedroom I can't imagine doing it alone",
                  "id": 5,
                  "comments": [
                    {
                      "score": 880,
                      "content": "Same - live in a HCOL city and we already moved farther out to try and save some money.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "Idk what it's like where OP lives but I know where I am in Australia it's also about FINDING somewhere to live. We're in a housing crisis which is seeing people with high salaries that are able to afford the rent, still sleeping in their cars.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Yup. My daughter and her boyfriend both work full time and where we live, it would be near impossible for them to afford their own place.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "The only reason I’m able to get by is because I sacrificed my desire to have kids. I work a full time job and a part time job at night. Shit is crazy expensive in my state.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I'm in a poly relationship with three working adults and even then not all months are easy financially",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "My daughter lived with me in a tiny 2-bedroom house.  She worked, paid her own bills, and went to school before she got a fairly crappy job in retail.  When she was 30 she had scrimped and saved enough to put a down payment on a house, her thoughts being she wouldn't be at the mercy of rent increases.  And while this was true, she learned real quick the cost of home ownership.  A friend of hers moved in with his son (3 bedroom house), this is how she's able to make ends meet.  Never for a single moment did I consider asking her for \"rent\" or making snide comments on how she was old enough to move out.  She's my child and working damned hard to be a responsible adult.  YTA, OP,  for this shitty power play.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1210,
                  "content": "I also don’t understand how OP and her husband cannot afford a bigger place but can somehow afford their mortgage + 2 months of rent for an apartment for the step daughter?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1642,
                      "content": "Probably because two months of rent stops after two months, whereas a more expensive house is a permanent increase to their mortgage payment.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This comment sounds like a teenager who asks for a new car and doesn't understand how their parents can't afford it even though they have jobs. Honestly maybe this sub needs flair with every commenters age.\n\n\nA mortgage on a bigger house could mean an extra *tens of thousands* downpayment. That means you need that money already sitting in the bank saved up, *plus* more savings as a buffer so you don't deplete your savings.  Or if they rent, rent on an apartment could be an extra 500-1000 per month, plus moving costs, plus moving costs again if they downsize after the stepdaughter moves out.\n\n\n\n2 months rent on a small place for someone else is maybe 3k, one single time.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Long term higher mortgage is more expensive than 2 months of rent for someone, it’s a one off expense. Plus moving has lots of added costs. \n\n\nNot saying OP is right to push her step daughter to move out but paying a higher mortgage or rent and the cost of moving is a lot more for a lot longer than giving someone 2 months of rent.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Because there is a big difference between a down payment on a home and 2 months rent? Not having an extra 30k, and not wanting to needlessly upgrade and increase their monthly expenses is quite reasonable. Girl is 23 - she should be moving out at some damn point soon, and isn't contributing?\n\n\n I'm baffled by a 23 year old living with parents, working full time, not having any living expenses, and pulling the \"I have no money\" shit. Ol daddy needs to help kiddo figure out bills and reality. Crazy.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Obviously market dependent, but having moved to a new house during the pandemic, I noticed that the price difference between a 2 bedroom and 3 bedroom house was substantial. Even at comparable square footage, age, and neighborhood, having 3 bedrooms (even if that 3rd \"bedroom\" didn't legally qualify as one) made the price jump. I could pay for years of rent before the cost became comparable.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "We just sold a house and bought another. The fees and taxes alone were around $45k by the time we paid agent commissions, stamp duty, bank fees and conveyancing. That’s before the increase in our mortgage. Getting established in a rental is a lot cheaper.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 618,
                  "content": "I'm an engineer making a decent chunk of change and I can't even afford an apartment, unless I want to pay 1k for a studio apartment with a couch bed, no oven and a single stovetop burner.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 51,
                      "content": "[deleted]",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "And it’ll be above a bowling alley and below another bowling alley",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "Same, production engineer and dept head at my company. \n\nI’m living with my mom for the first time in ten yrs hoping to save enough to buy a very small house in a year or so.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "It also depends where you live. Where I live now I had a two bedroom townhome for 1k a month.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I'm close to OP's step-daughters age. While I'm still in school, I have friends who now have full time jobs but live with their parents as they can't afford to live on their own.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My best friend is 25, works pretty much full time, and just got her own apartment. And still has to split rent with her brother and SIL (who moved in w her) because she *still* can’t afford to live alone. Working full time should be able to get you an apartment, but it doesn’t anymore which is such BS",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 873,
              "content": "That and they can't afford to get a place with three bedrooms, but will have the money to cover a couple of months rent and decorations? 🤔 if anything they should be putting that kind of money towards the baby? I don't have kids, but diapers and clothes and formula and Doctor's appointments and daycare, I can only imagine how much that is going to add up. Plus doesn't the baby sleep in a crib in the parents bedroom for at least the first year? Take that year, make a budget, make some goals, and start saving to find something that can help all three (well, four) of them.",
              "id": 26,
              "comments": [
                {
                  "score": 471,
                  "content": "I agree with you but just want to point out that babies sleeping in the same room as their parents is more “normal” but not everyone does that. There are tons of benefits of baby sleeping in the same room but it depends on personal preferences, I guess. \n\nPersonally, I couldn’t room share (as much as I wanted to) bc my bedroom is TINY and my SO, dog, and newborn would constantly wake each other up all night. After a month of trying and everyone (except the dog) being super sleep deprived, I moved baby into their own nursery and everyone slept better. Now I know I’m not the norm, but sometimes babies sleep in their own room sooner than you might expect.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 18,
                      "content": "That sounds rough. You had to do what was best for everyone and I'm glad it worked out for the better. Like I said I don't have kids, so I don't really know how it goes, just based on what I've seen and people I know with kids... Plus I've read a lot comments on this thread mentioning at least 6 months. Maybe the baby being with OP and her husband might not work out, but unfortunately the baby getting a room of its own comes at the expense of the room of someone who can't afford to get their own place. She's 23, I bet if the housing crisis and inflation wasn't impacting everything right now the SD might've been out years ago.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "We did the same thing. Babies are surprisingly noisy when they sleep 🤣 (and I snore without my CPAP machine) . Thankfully technology helped and we had a camera in the nursery.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Babies really are such individuals right from the jump.  I co-slept with my 2 eldest but my youngest just could NOT stay asleep if she was in the same room with me.  She's all for it at age 4 though!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "We had a similar issue. Dad's snoring woke the baby up so many times throughout the night!\n\nSo we set up the crib and a daybed in the second room, and baby and I slept in there, snore-free.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">AAP recommends that parents sleep in the same room – but not in the same bed as a baby, preferably for at least the first six months.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "> That and they can't afford to get a place with three bedrooms, but will have the money to cover a couple of months rent and decorations?\n\nthis seems perfectly reasonable to me? 5k vs how much for a down payment on a new house?",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My read of OP's post is that them offering to pay 2mo rent plus decorations is not that they have the money to throw at it, but are willing to sacrifice some on their end to help the daughter with the mess that is moving out. As a good will gesture.\n\nI get times are hard out there for sure. at 23, I still had a roommate and lived in the part of town that was affordable on my full time job. Wasn't the best location and having my own spot would have been preferred, but I did what I could with what i had.\n\nWe don't know the daughters full situation. It could be she has gainful employment and just doesn't want to give up the free rent, or it can be that she makes min wage in a really expensive city, or somewhere in between.\n\nOne thing I do know is that lots of people that move out for the first time expect to have all the luxuries of home (space, big screen tv with all channels, own washer/drier, etc...) and don't realize that you gotta live within your means and work your way up to what your parents had.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "The help is one time money vs. the ongoing expense of a larger house.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Come on. She can live with a bunch of other 20+ year olds just like every other 20+ (and even 30+) year old in high-rent areas. I live in the Boston area, and literally EVERYONE in this age group lives with roommates.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "If a 23 year old non-student is staying with them, shouldn’t it be whether or not THREE adults can afford 3 bedrooms?\n\nShe should be paying SOMETHING, even if she can’t afford a third (or fourth) of rent, utilities and groceries.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "There are studios and roommates, which aren’t unusual arrangements for someone in their 20s.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "And they’re having a whole ass baby on top of that…..",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm also noticing a lack of age on OPs husband. OP is 33, stepdaughter is 23, and husband is....apparently old enough to make unilateral decisions",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2018,
          "content": "it wouldn’t be a horrible idea to make sure your properly prepared and responsible before bringing another child in the world. \n\nwhether she’s 23 and has a FT job or not, most people live paycheck to paycheck and cannot afford that to live on their own",
          "id": 41,
          "comments": [
            {
              "score": 1511,
              "content": "[deleted]",
              "id": 42,
              "comments": [
                {
                  "score": 765,
                  "content": "Exactly this! Seems reasonable to ask an adult to move out. It is expensive, and they offered to help with rent for a period of time and finding a roommate.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 553,
                      "content": "[deleted]",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Honestly I don't get why it's so shocking that she might have to have... GASP... a roommate!\n\nSure, it sucks that an adult working full time *needs* a roommate to be able to afford rent, but complaining that it's not fair isn't going to change that.\n\nI lived with a roommate from ages 19-24 and then my partner moved in so it's still a rent sharing situation. If he hadn't moved in I probably would have just found another roommate because shit's expensive. It's really not a big deal. \n\nI'm obviously very different from this girl but at 23 I would have chosen living with a roommate over living with parents and a new baby any day.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I don’t know where all these redditors lived, but I live in a housing crisis and I still managed with roommates.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 308,
                  "content": "it’s more than being able to afford or not though. if you can only afford a two bedroom apt and state in the same sentence you’re broke, why are you bringing a baby in the mix? that’s not responsible and it isn’t the 23 year olds fault. \n\nit is generous to volunteer to help for the first two months rent (let’s not forget that’s all she offered minus shopping) but living alone in 2023 long term is not something most people can do.",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "Exactly. Moving and finding a 3 bedroom to house the 23 year old seems a little extreme. Maybe give her a year to start saving but she can’t live at home indefinitely either",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "It would be reasonable if OP and her husband were on the same page. They're clearly not. It's also reasonable that OP's husband doesn't want to stop helping out his daughter just because she's now an adult.   \nThe issue isn't really what's reasonable and what's not, it's that they have different priorities and preferences within the realm of reasonable choices.   \nTherefore, it's reasonable to say they probably should have talked those issues out more thoughoughly beforehand.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Where did OP say that step daughter lives there for free or doesn't contribute? \n\nIn fact, OP is rather mum on that, never said step daughter does or doesn't pay rent. She also doesn't say that step daughter has a well paying job only that she works full time.\n\nShe said very specifically that she wants step daughters room not that step daughter has been a burden in anyway. \n\nIt's interesting that OP said nothing about Step-daughter's contributions or lack of contributions, so that's either not an issue in her decision or would sway opinion to the step daughter.",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 440,
              "content": "Me and my husband both work full time and love from check to check. It’s hard to live on your own now.",
              "id": 51,
              "comments": [
                {
                  "score": 141,
                  "content": "my boyfriend and i too. we both work FT 40-45 hours a week and we are about to move in together because we cannot pay to live alone on our salaries. no one can live on their own comfortably with the way prices are increasing",
                  "id": 52,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yep same boat here. I told her I wasn't ready to move in yet because i REALLY REALLY like living alone, and i REALLY REALLY like the area i live in, but i live paycheck to paycheck and barely scrape by and so does she. I fell ill and missed 5 days of work from last thursday to today and it's looking like im not going to be able to pay rent this month, let alone the bills, and im wondering if cohabitation is going to be much sooner than expected now.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 356,
              "content": ">it wouldn’t be a horrible idea to make sure your properly prepared and responsible before bringing another child in the world\n\nIt would be a horrible idea to base your decision on having children on the preparedness and responsibility of a 23 year old.",
              "id": 54,
              "comments": [
                {
                  "score": 306,
                  "content": "you can’t just kick out one of your family members because you’re bringing another one into the world. talk about future abandonment issues. OP acts like her kicking out the step daughter is the only option to make space for their baby.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 511,
                      "content": "\"I was abandoned at 23 and forced to get roommates and move out of my father's house, they then subsidized me until I could get my feet under me. I'm traumatized.\"",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 264,
                      "content": "She is 23 years old.  Abandonment issues?",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "What? She’s a grown ass woman??? Some 23 year old are mothers ffs..what in the basement dwelling twitch streamer is going on in here??",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "JFC… Abandonment issues because someone is forced to move in with flatmates at the age of 23 is just such an incredible reach.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": ">future abandonment issues\n\nOh brother stop the infantilization",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "What fucking FUTURE abandonment issues??? Do you understand that you are talking about an ADULT?",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1024,
          "content": "This isn't a fair take.  The parents would need to upgrade to a 3 bedroom house whereas the daughter could rent an apartment.  She's 23 with a full-time job AND being offered full rent assistance to allow her to make adjustments to her spending habits and start squirreling some away.\n\nWe don't know the specifics of their finances, but maybe OP can extend the length of the rent assistance past two months.  Two months full-paid rent plus two more months of 50% rent.  Either way, the request is reasonable.  \n\nThe 23 year old running to her room and slamming the door like she's twelve is probably indicative of other issues not readily apparent.",
          "id": 62,
          "comments": [
            {
              "score": 1944,
              "content": "I mean, I'd be annoyed with step-mommy dearest who's only 10 years older than me trying to shove me out of the house to make room for the new baby, probably with the dad being in his 50's and starting a new family. So slamming the door in her face, is imo justified.\n\nThis comment is getting a lot of traction, but I'm now turning off notifications. Clocking out from work and time to enjoy my evening.",
              "id": 63,
              "comments": [
                {
                  "score": 682,
                  "content": "This!!! Wish I could upvote 10 times. OP didn't think this through when she started dating and married a man whose daughter still lived at home. Sounds like a conversation that needed to be had BEFORE wedding bells",
                  "id": 64,
                  "comments": [
                    {
                      "score": 389,
                      "content": "Agreed. But daddy was thinking with his other head and stepmommy wants her new life to start, without her husbands \"past\" around.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I mean, we don’t know how normal living at home at that age is where the OP lives. At that age all of my friends and I rented with roommates. Living at home wasn’t the norm. My guess is the OP and her husband didn’t talk this out ahead of time (which is bad on both of their parts) and they both assumed they were on the same page.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Tbh I get both sides because as their daughter I'd 100% feel tossed aside as soon as a new baby comes in and moving out *is* super expensive. But at the same time, upgrading to a 3 bedroom house when step-daughter is at an age where she might be moving out soon would be a very costly upgrade..",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OP stated she locked herself in her room. it’s very presumptuous to assume she “ran to her room and slammed the door” you’re changing the story to paint her in a light that is not favourable. \nits her bedroom, her sanctuary. if she is upset (having emotions isn’t childish, it’s human) and wants to be alone she is entitled to seek refuge in her bedroom? in her home?",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "So how much does the stepdaughter make? You don’t know, do you? And yet you can authoritatively say that she can afford to rent an apartment. And the “full rent assistance” is for two months. What does she do after that?",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "A full-time job at federal minimum wage is $290 a week. Like WTF planet are you living on where you think 2 months is enough time to \"adjust her spending habits\" so she can survive on less than $1200/month? This isn't a case of needing to cut out Starbucks and avocado toast... please, please share your wisdom as to how to budget this for one person to make it work?\n\n(McDonald's actually tried to show its employees a budget to prove they could live off their wages. Their brochure massively understated expenses, neglected to provide for heating and, no kidding, still included a second job.)",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 451,
          "content": "why not tell her it won’t work in a 2 bed and she either has to get her own place or you guys can get a 3 bed and she has to pay a part of the rent/contribute another way",
          "id": 71,
          "comments": [
            {
              "score": 108,
              "content": "This is what I came here to say. Rent a bigger three bedroom place. It’s a win win for everyone. The daughter can help pay for part of that rent. She’s also going to be around to help with babysitting when the young mom and old dad want to go out on dates.",
              "id": 72,
              "comments": [
                {
                  "score": 34,
                  "content": "You’re telling them to sell their home and rent instead? Are you serious?",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Not a good option if they own the 2 bedroom.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "So they should sell their house and waste money on rent for the grown up daughter’s comfort??",
              "id": 75,
              "comments": [
                {
                  "score": 18,
                  "content": "If its one they own you’re 100% right. I just assumed it was also rented.",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "They might own their current home.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 447,
          "content": "Why did you add the “info” when you weren’t requesting new info and just reiterating what has already been said. Also, not being able to afford a new home to buy is not remotely the same as renting with a roommate.",
          "id": 78,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 431,
          "content": "Huh? There’s a huge difference between selling your home and buying a larger home for a whole family vs being able to afford rent on an apartment for a single person. \n\nFact is she is 5 years into adulthood, works full time, while living for free in her parents home.\n\nThem needing her room for a new baby is reasonable to ask her to sort out new living accommodations. Be that with roommates or on her own. They even offered her two months free rent to make the transition easier. \n\nShe’s far too grown to feel entitled to have them continue to put a roof over her head when it’s actively creating a problem for them.",
          "id": 79,
          "comments": [
            {
              "score": 706,
              "content": "[deleted]",
              "id": 80,
              "comments": [
                {
                  "score": 302,
                  "content": "Yeah, the entitlement and cluelessness in this thread is agitating to read. Also, the amount of people failing to understand the cost difference between buying/selling homes and renting is just... Oof.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yeah I made a comment above how wild it is to see so many people think it’s rational to ask this pregnant woman to just up and buy a new house and move to accommodate an adult not wanting a roommate.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 187,
                  "content": "Yeah this entire thread is a shining example of who is actually giving advice on this subreddit: teenagers",
                  "id": 83,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Alternatively, it's a shining example of a very distinctly American middle class view of these things.\n\nVirtually every other region on the planet is more accustomed to multi generational homes where the children live at \"home\" with their parents and grandparents until they marry and get their own home to start their family.\n\nEurope, Asia, Africa, Central and South America....multi generational homes are the norm, not the exception.\n\nGood Ole American rugged individualism on display here.",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "It truly boggles the mind. If daughter has been working full-time and isn’t paying rent, what is she spending her money on? Why doesn’t she want to leave? I was in the thick of the ‘08 financial crisis at her age, in a city with double digit employment. All of us worked whatever jobs we could, drank the specials at happy hours, found cheap shit to do. We were all living paycheck to paycheck (I remember having $13 one week to spend on food and everything else after bills until my next check came) and we had a ball. So many of these young people now seem afraid to launch, where we weren’t as scared of taking risks and failing. I really feel sorry for them.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 17,
                      "content": "So there was an article about this recently. I think npr.org. Basically the live at homes/pay no rent are supporting the luxury economy and driving up entertainment demand.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "[deleted]",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yes! Thank you for this...I am so baffled by these comments and many of them scolding her for getting pregnant or having a baby when they \"still have a 23 year old at home!\"  Seriously?!!! wth?!",
                  "id": 88,
                  "comments": [
                    {
                      "score": 15,
                      "content": "It’s mind-boggling. “If you can’t afford a 3-bedroom, you can’t afford a child,” “You aren’t allowed to have a child if it means your adult ‘kid’ needs to find her own place,” etc. Absolutely ridiculous.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My first question on all of this was - it is fair that she.mifht not be able to afford rent but are they looking into why can't she afford to live by herself as an adult and why isn't that being looked into? Is this something they need to help her learn how to manage finances? should they be helping her find a new job? This is possibly a NAH with poor wages to blame but just sweeping it under the rug helps no one.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yes thank you, I thought I was going crazy. I don’t believe in kicking your kids out at 18 but with the current circumstances I don’t think it’s insane to ask for her to help if she can’t afford to move out. I hated having a roommate but I did it because that’s the only way sometimes. I feel for them both, but come on.",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Thank you, I was confused by all the upvotes on this comment.. like it's her house and step daughter is grown with a full time job. Why is it so unreasonable to want her to find her own place to live? Especially when she's offering to help her.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'm glad I found this thread in the post. I'm sure the YTA are going to overwhelm the NTA but I'm glad I found some other NTA.",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 413,
          "content": "Are you comparing them *buying* a 3bd house to her potentially *renting* a *1bd* apartment? That makes no sense.",
          "id": 94,
          "comments": [
            {
              "score": 240,
              "content": "Most peoples mortgages are cheaper than monthly rent. My 1br is 1800",
              "id": 95,
              "comments": [
                {
                  "score": 118,
                  "content": "That could be true. \n \nBut in addition to the mortgage - which many non-home owners conveniently forget to factor in when comparing against, say, an all-inclusive apartment - you've also got to pay for:\n \n* property taxes\n* insurance / higher insurance than renters insurance\n* maintenance when things break\n* heat, electricity and water\n \nThere's an extra ~$400+/month and that's excluding any maintenance.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 27,
                      "content": "This is true. Mortgage on my 2 bedroom rowhouse is only $1350, but I just had to drop $12,000 on a new roof and appliances.",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Most people don't get all inclusive apartments these days. Rents are sky high and utilities aren't necessarily any better for renters.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I mean, my mortgage and utility rates are below $1800 and I have 3 bedrooms and two bath. In addition, my mortgage rates aren't going to go UP randomly at the whim of a company, or individual, who wishes to make more money. The interest rates might change my mortgage, but at this point I'm hearing of people's rents going up by 50% and that simply doesn't happen with a mortgage (and most places include property taxes on the mortgage so...). \n\nEven with maintenance, I can just *fix* things. I don't have to wait, I don't have to call people. I can just Do it.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Taxes and insurance are part of my mortgage payments and it’s still at least 1K cheaper than a comparable house for rent",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "I do have to pay for my own heat/water/electricity but its a helluva lot cheaper in a small space than a whole house for sure.",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Yes but you have to have 3 times the cost of rent in income to even qualify to rent an apartment.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Thats true, but on the other hand, I was looking into a 30 year mortage and one of the calculators suggested it would mean $850 a month.  We already pay heat, electric and water on top of rent. That wouldnt go up to to much. So if Rent is $2400 a month and now its a mortage at $850 a month and you put $1000 away a month for maintence/ property taxes it still leaves $550 more a month to help live on. So Depending on WHERE you live and how ridiculous the rent is, it can still be better to buy. (By the way around my area a one bedroom starts at $2100, so the range for apartment is around $2100 to $2600)",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "There's no telling what their mortgage looks like. And with interest rates around 5% right now, selling and buying bigger is a really good way to take a huge step backwards.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "depending on the market you’re in, it makes perfect sense. a mortgage on a 3bd house can be around the same per month as renting a 1bd apartment.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 323,
          "content": "[deleted]",
          "id": 106,
          "comments": [
            {
              "score": 334,
              "content": ">What they can’t afford to get a place with a 3rd bedroom where the daughter gets to live for free.\n\nBut she didn't propose that, OP went straight to kicking her out.\n\nOP is offering help for her to find a her new roommate, but she hasn't said anything about going to a bigger house where step daughter would pay her fair share of rent.\n\nIt seems OP is more eager to see her step daughter out of her house than to actually finding a compromise.",
              "id": 107,
              "comments": [
                {
                  "score": 326,
                  "content": "and when stepdaughter wants to move out, OP and husband are stuck in a 3 bedroom they can't afford\n\nNTA",
                  "id": 108,
                  "comments": [
                    {
                      "score": 140,
                      "content": "[deleted]",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 183,
                  "content": "[deleted]",
                  "id": 110,
                  "comments": [
                    {
                      "score": 17,
                      "content": "and fees! It would cost me £20 k ish to move just in legal fees, surveys and taxes. So while I can afford a bigger mortgage, it's not that simple. And if you can't qualify for that mortgage... you're stuck.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "5% is generous, it's closer to 6.5% in my area 🥺",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "You are talking too much sense. Pleasr tone it down a bit!!!",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 85,
                  "content": "Buying a bigger house that requires a renter to be feasible isn't exactly an option. It's not unreasonable to expect the adult daughter to move out anyway within couple of years (paying rent and being woken at night by new born will drive most out fast). At that point they would need to either get another renter, or move again.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I’ve had many friends over the years who have adult children. It’s perfectly normal for biological parents to be excited about their adult kids moving out. Stepparents expressing that same excitement are accused of hating the step kids or wanting to erase the past. That’s not rational to hold a stepparent to a higher standard when it comes time for step kids to fly the coop. \n\nI understand where the stepdaughter is coming from too, because housing is very expensive now. I was able to easily move out on my own at 18, but times are different. That being said, I think it’s fair to start this discussion with the stepdaughter so she can start planning to become independent. I don’t see it getting any easier in the future unless she’s got some solid plans to increase her income and save. \n\nThe dad is encouraging childish blowups and walking on eggshells to avoid upsetting his daughter with adult discussions about gaining her independence. He’s the ass for agreeing with his wife, then not following through. This doesn’t have to end with packing her shit out on the curb, the three adults could discuss a plan, but the stepdaughter is not participating in that. The dad should lovingly offer advice and help her make a roadmap-instead he’s choosing to encourage her entitlement and immaturity.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "That's a stupid idea. Then the parents get stuck with a 3BD that cannot afford and will then need to move again.  Moving is expensive, even if it's across town. They would have to pay first, last, security deposit and who knows what else.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Are we sure they are renting?  They might own the house and the mortgage is based on what the price was when they bought it - but house prices have gone up so much trying to buy a larger house would be much more expensive.\n\nIf it is a house maybe they could add on an extension or a granny flat in the back yard instead? Daughter could pay rent and in the long run it would increase the value of the house?  It's all speculation until the OP comes back and offers more details.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Buying a new house is a much bigger life change than renting a place. And to buy a new home to house an adult who most likely will not live there for the rest of her life is a really odd rationale... The logic to consider buying a new house here is really weird especially when most adults eventually get their own place.",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Then have her pay rent",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 244,
          "content": "This doesn’t matter. She is living for free in their home. They have every right to ask her to find a new place, or help pay rent for them to afford a bigger place.",
          "id": 120,
          "comments": [
            {
              "score": 117,
              "content": "Yes but Dad is not asking.",
              "id": 121,
              "comments": [
                {
                  "score": 146,
                  "content": "Yes, dad scapegoated stepmom by presenting a United front up until the point his daughter didn’t like it.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 12,
                      "content": "He didn’t scapegoat mom. They talked all together.  \n\nShe went behind his back and cornered the step daughter when he wasn’t home.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "OP doesn't say she is living rent free.",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "I must have missed where OP said she was living rent free.",
              "id": 125,
              "comments": [
                {
                  "score": 16,
                  "content": "People are projecting so many assumptions on the step-daughter. They’re painting her out to be some spoiled child who spends all her money on shoes and avocado toast and doesn’t save any money and is planning on “mooching” for life when… we have no fucking idea what’s actually going on. We don’t know if the step-daughter has a mental health issue or if her job pays well or what rent is like in the area or what the relationship is like between her and OP (aside from just “not close”) or whether this is the home the step-daughter grew up in and that OP moved into upon marrying the dad… like, damn, people, there’s no reason to shit on this girl based on this tiny amount of info. Calling her coddled and a burden is fucking harsh.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Exactly my point, we don’t know if her mother is in the picture or if she is deceased, meaning that her father is her only living parent and we don’t know how long OP and husband have been married, this all could have been pushed on S/D in very limited amount of time, we have no idea how stable her financial situation actually is, whether she’s actually still in a probationary period in her job or what, if she is concerned about finances and how living independently will impact her then i think that’s a very legitimate concern to have, especially with the current cost of living, people on here are acting as if live comes with a fucking manual and that by our 20’s we are programmed to having our shit together when the reality is we don’t.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I wanna know how much Stepmom is contributing  to bills and mortgage. I imagine she's  not working and just enjoying a free ride on the husband's back and just married into his property and wealth.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "shes just continuing to live in her home. seems like it's OP who's living for free in dad and daughters home",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "It's wasn't written by Op if the daughter is contributing to the household or not, nor does it say Op is helping. Why did you assume that she's living rent free in her home ? We don't even know if OP moved in to that house or if they all moved their together ,etc. There's a lot  of missing information.",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "It sounds like they can afford a place, a 2BR place. \n\nJust not a 3BR place and a perpetual adult dependent.",
          "id": 131,
          "comments": [
            {
              "score": 12,
              "content": "Some people say perpetual adult dependent, others say family unit or just family. It's nice to have, and live with, family -- to be with people who understand you and love you and have your back. It's nice.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16551,
      "content": "YTA.\n\nYou're barely a decade older than your step-daughter, leave her parenting to her actual parent.\n\nSecondly, yes she's behaving badly towards you; you're trying to kick her out of her home.\n\nThirdly, have you any idea of the economic fuckery going on in the world today? Completely unsurprising that a full-time (presumably entry-level for a 20something) job cannot cover expenses.\n\nEdit: Grammar",
      "id": 133,
      "comments": [
        {
          "score": 7187,
          "content": "Also, what the fuck is up with these men getting with women half their age, like holy fuck, dating someone 10 years older than your daughter is disgusting.\n\nEdit: Oo, man, found all the people with daddy issues on reddit. Look, if you want to date some dude that could have been your dad when you're 20, then by all means I'm sure he won't complain, but personally I just think it's gross, that's my opinion.",
          "id": 134,
          "comments": [
            {
              "score": 2152,
              "content": "I am so fucking tired of the age gaps in aita and relationship advice posts.Young women should probably stop procreating with men 10+ years older.",
              "id": 135,
              "comments": [
                {
                  "score": 6238,
                  "content": "Old men should stop chasing young girls.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 776,
                      "content": "EXACTLY this is the core problem we see so often on these posts",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 656,
                      "content": "Exactly but Reddit is full of men (and women) defending it by saying “well they’re both ~legal~ so it’s fine,” like lol why is that where you draw the line…? Does that mean you’d go lower if you could? Or they say “well you’re obviously jealous” as if older women haven’t literally also been in these situations as young women and know what they’re talking about when they say it’s borderline predatory. I’m honestly so sick of it. It’s gross.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 189,
                      "content": "Apparently that's a controversial comment to make.\n\nIt really shouldn't be, but here we are I guess.",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 54,
                      "content": "THIS is the issue. Men thinking they’re still the same as when they were young, so it’s “not creepy”, when in fact it’s extra creepy.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Old men should stop GROOMING girls. \n\nFixed it for ya! \n\nBecause nothing that comes out of Andrew Tates mouth is new. It's the same stuff men having been doing to primary underaged women since always. \n\nThe difference is, we can call them out now! Without your husband beating you for it later, either. (Not everyone, even now, unfortunately. )",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "The media should stop romanticizing  pedophilia. Schoolgirls everywhere all the time. Ew. I had to give up most Anime a decade ago. Some don't do that and I love them for it but it's just... And otakus just... And all the fan service. Like cut it out. I wanna hear a story not wind up on a list.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "We are all looking at you Leonardo DiCaprio! 48 dating a 19 year old..",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "this the one people don’t want to hear.",
                      "id": 144,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 806,
              "content": "A 33 year old with a 41-45 year old is not disgusting. 33 is more than old enough to have a fully developed brain and she can decide she wants to be with him if she wants. There's not much of a \"experience/maturity difference\" between those ages.",
              "id": 145,
              "comments": [
                {
                  "score": 589,
                  "content": "I dislike huge age gaps in relationships because they’re usually predatory or there is power unbalance. However I totally agree with you here. A 30 yo is fully capable of having a healthy relationship with someone 10 years older, their life experience is pretty similar.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 368,
                      "content": "People on this sub love to jump to conclusions when there's an age gap. \"disgusting\", seriously? She's 33 years old!",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I totally agree that at 33 the issue is not the age gap between her and her husband. I think the point the comment is making is that given the *lack* of a gap between her and her husbands daughter. It is going to be difficult for the daughter to be receptive to her pushing this agenda.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "AGREED I was 30 when I met my husband who was 43. we both already had kids. It was  and is a non issue. None of my family or friends or his have ever had any concern. Reddit is dumb.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "That's assuming he was an adult when his daughter was born. Teenage pregnancy could have him as uncomfortably young as 38, which no one would bat an eye at with 33.",
                  "id": 150,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 336,
              "content": "Did OP say that her husband was 66? Man ppl out here clutching their pearls and acting like this is a Decaprio situation. Dad coulda had daughter early. I swear, even reasonable age gaps trigger ppl in this sub so much. \n\nEven if dad is in 50s, it's not like OP is an impressionable 19 year old. She's a truly consenting 33 year old woman, and was probably in her late 20s when they started seeing each other.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "That implies that OP had no choice in the matter. She's a grown woman who can make up her own mind and that includes in who she dates and enters into a relationship with. \n\nOr are you saying that women are incapable of claiming any responsibility for their actions? (Sarcasm in that last comment just in case anyone takes it seriously)",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "She never even said his age! Everyone is just straight making assumptions. Also, SHE'S 33! Unless they got together a decade ago this isn't weird.",
              "id": 153,
              "comments": [
                {
                  "score": 15,
                  "content": "This is kinda where I am too. Unless op deleted/edited some info everyone is assuming that the husband is in his late 50’s to 60’s.",
                  "id": 154,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Normally I'd agree, but we also don't actually know OP's husband's age. He could've had her really young. Like if he was 18 then he's 41 now which I feel like at their age isn't a huge deal? Then again I'm 19 so what do I know.",
              "id": 155,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "As a guy dating a woman 20 years older than him, i can say that there can be life stage issues and inequities in these relationships, but it really is not as diminutive and fetishized as you think. I love somebody very special to me, who is a beautiful person and very smart, and she cares FAR more for my work ethic and mental acuity than being a young dick.",
              "id": 156,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I get that large age gaps lead to even larger problems but I am not sure of this here. We arnt told the fathers age but let's assume he was youngish at 23 when he had his now 23 year old daughter making him 46. Let's say he was with step mom 4 years. He would be 42 dating a 29. This passes the age/2 + 7 rule of thumb. I mean he could be older but a 23 year old having a 33 year old step mom isnt that outrageous.",
              "id": 157,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "How do you know she’s half his age? If his daughter was born when he was 18 then he’d only be 41 which would mean only an 8 year age gap with op.",
              "id": 158,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "The husband could be like 40 people have kids pretty young",
              "id": 159,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 774,
          "content": "Its ok, the stepdaughter can afford to move out if she marries a man with a daughter  close to her age/s",
          "id": 160,
          "comments": [
            {
              "score": 921,
              "content": "It’s the circle of wife",
              "id": 161,
              "comments": [
                {
                  "score": 58,
                  "content": "And it moves us allllll…..into a two bedroom house 🤣",
                  "id": 162,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Through despair we eloped",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Underrated comment 🤣",
                  "id": 164,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I appreciate it!",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This made me laugh way harder than it should have.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Take my gold and my respect.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Possibly the most underrated comment on the internet. 😂",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "AITA needs a sugarbaby with adult stepkids tag\n\nmy adult stepkid who is barely younger than me, won't do everything I say\n\nlol",
              "id": 169,
              "comments": [
                {
                  "score": 8,
                  "content": "Or “i do t want my stepkids living with me so i make up reasons to kick them out”… ok maybe it is a pittle too long, but man aitas today… stepmoms kicking stepkids out of the house month or smth?",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "Yes, that's the issue.\n\nOP and SO talk to SD.\n\nSD goes quiet and responds privately to SO.\n\nOP tries to re-address with SD privately. \n\nSD gets upset and brings it to SO.\n\nOP- you are not recognized as an authority in SD's life. You'll never be close if you keep trying to be.\n\nEta YTA",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Not to mention the median cost of home ownership in the US is $1672 a month (mortgage, insurance, property taxes, utilities, and HOA fees)\nThe median rent for a 1 bedroom is $1876 or a studio of $1690\nBoth cost MORE than the mortgage\nThis cost is just rent which doesn't typically include utilities and if it does it's usually only 1 utility like garbage \nI make almost $5 a month over my states minimum wage and over 2.5 times the federal minimum wage, my take home every month is only around $2k a month. I would not qualify to rent an apartment on my own. The last apartment my partner and I moved into charged us an additional $450 deposit because I alone did not make 3 times the rent every month and had been at my current job for only 5 months instead of 6, it did not matter that there was 2 of us moving into the apartment and my partner made more than the required 3x rent by themself as well as having been at their job for over 6 years.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8026,
      "content": "YTA.   It is hard for young adults these days.  Unless they marry an older guy with  $$$.  Your baby can stay in the room with you for the first months.   You are being unrealistic about decorating a new place.  Leave the discussions with her to your husband.",
      "id": 173,
      "comments": [
        {
          "score": 1989,
          "content": "Well technically OP is a young adult too…",
          "id": 174,
          "comments": [
            {
              "score": 2197,
              "content": "Who presumably married an older guy with money.",
              "id": 175,
              "comments": [
                {
                  "score": 2379,
                  "content": "Not that much money if they can't afford a three bedroom place.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 343,
                      "content": "But I’m SURE he just hit a rough patch (that’s last ~6 years) in his usually highly lucrative field and has been unemployed but looking so hard for work! 😂",
                      "id": 177,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 208,
                  "content": "Without- he can’t afford to house his 2 kids",
                  "id": 178,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "Wth, she's 33 and we don't even know how old her husband is. He could be like 45 or something. All of you are weird as hell. Unless they've been together for like a decade there's nothing predatory about this, and considering they can't afford a three-bedroom, he probably doesn't have much money either.",
                  "id": 179,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "The older guy part is correct, not sure about the money",
                  "id": 180,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 550,
              "content": "Oh curious, is a 33 yr old a “young adult?” \n\nI thought that term was only for early-mid 20s folks..",
              "id": 181,
              "comments": [
                {
                  "score": 480,
                  "content": "Who knows anymore. So far in these comments OP is too young and a gold digger but the daughter isnt old enough to live on her own.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 430,
                      "content": "If OP is a gold digger, she’s terrible at it.",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "Looool came here to say this. This comment section is *wild*",
                      "id": 184,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "OP is a young adult being preyed on!!!!!!",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 157,
                  "content": "Yay I’m a young adult again, somebody needs to tell my body. But yeah that’s just an adult, 25 and under is what I’d consider a young adult.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Right?? 😂 I'm turning 33 this year, I feel like a dinosaur",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "This is reddit. When it comes to individual freedom, adulthood starts at 17, when it comes to personal responsibility, adulthood starts at 26.",
                  "id": 188,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "2 more years and her pregnancy would be considered geriatric. I am so confused by this entire comment section.",
                  "id": 189,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Well lol people in their 30’s now are worse off that people in their 20’s back in the day so maybe at least when it comes to financial stuff.",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "NTA but husband should make it known that in 6 months she will be sharing a room. 2 bedroom house with 4 people means 2 per room.",
          "id": 191,
          "comments": [
            {
              "score": 27,
              "content": ". Current medical advice is to room-share with parents for the first year to reduce chance of SIDS.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "So what happens after the first few months??",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "I mean yea it’s hard for us out here, but let’s say the new baby does stay in their room for the first few months. Would OP still be T A if she asked for SD to move out on an timeline that incorporates the few months after birth?",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "> Your baby can stay in the room with you for the first months.\n\nAnd then what? The two year old and 25 year old share a room? \n\nWhat's the long-term solve here?",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Baby can stay in the room with her “technically” the first 6 months maybe even a year before they really should Have their own space.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "For a few months?  And then what?\n\nWhen is it going to be ok to ask the adult to leave their house?",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5848,
      "content": "\"Oi, time for you to fuck off, off you pop, your replacement will be here soon and despite the fact that for the first 6 months they don't need an entire room, you need to go now even though there's a cost of living crisis etc. Don't care and I'll keep raising it with you.\"\n\n&nbsp;\n\nYou know that she's not super close with you for a reason, don't you, and that you're also replacing her - even if you're not, it does look that way, even to an adult?\n\n&nbsp;\n\nYou made a decision to have a child despite not being in the financial situation to house that child without turfing someone else out to make room. She's going to absolutely loathe you if you push this you understand? And she'll likely be fine with her father ... until he potentially also realises it was a shitty move and based on you bringing a life into the world you couldn't fully fund or house?\n\n&nbsp;\n\nShe told her dad privately because she doesn't like you, or trust you, and you only further cemented that by bringing it up. The smarmy \"But we'll help you decorate and help with some rent!\" doesn't really help when, after two months, her wages don't enable her to keep the place. But by that point you won't give a shit, right, because *new baby* and you got your way?\n\n&nbsp;\n\nYTA. You can either accept that and push and push and alienate her, deprive the baby of an older sister and ultiamtely alienate the father or, just an idea, find a bigger place where she can continue to live with you WHILST paying a rent so it's affordable. Or maybe plan your family better next time before getting pregnant and THEN thinking \"Oh shit, where's it going to stay, whoops, looks like your kids on the bounce!\"\n\n&nbsp;\n\nThe average age to leave home isn't 18 now or even 25. Most young people cannot afford to leave home and don't particularly want to live with strangers weirdly. And no, I'm older than you, but apparently not quite so callous. Then again I've only got my own child to think about, I don't have to try and justify being shitty to someone elses and feigning compassion and caring.",
      "id": 198,
      "comments": [
        {
          "score": 1402,
          "content": "I hope daddy has locked in some inheritance for the daughter because step mum will be hoarding everything for herself and her own little precious.",
          "id": 199,
          "comments": [
            {
              "score": 978,
              "content": "The daddy who already can’t afford to house both of his children has locked in some inheritance? Seems unlikely.",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 391,
          "content": "I’m 25 making $50k and I can’t even get approved for a studio",
          "id": 201,
          "comments": [
            {
              "score": 50,
              "content": "I had enough money saved to put down on a house at 24. Just before the market decided to fuck us even more. But couldn't seem to get approved for a the houses I wanted (which were 50k at the time in 2014 and are now almost 300k..) yet, since 2014, I've paid around 1k in rent every month. Its mad.",
              "id": 202,
              "comments": [
                {
                  "score": 33,
                  "content": "The houseing crisis is freaking real. Looking online around me, and by around I mean within an hour commute for my husbands work as I work from home, and the $250,000 houses all need full new kitchens (Ilike the tile floors are broken and or missing and there is no sink or fridge) and the shag rugs in the living room need to be ripped up and replaced. If you want something thats NOT a fixerupper, they start at $380,000.   \nWhat I would give to be paying $1000 in rent. We are paying over $2000, and our floor is warped. Our bed is breaking because the floors are not flat the living roomis sinking little by little.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "I'm 33, almost a decade into my career, and made 55k last year. I can barely afford a studio.",
              "id": 204,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 47,
          "content": "They do have room to house the baby even if the stepdaughter stays though; their own room.",
          "id": 205,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "THIS exactly! When I (52f) married my husband (48m) 23 years ago, I had two boys already and we had a 3 bedroom house. We were both at the beginning of our careers, not making a ton of money. We knew we wanted to have kids together but we waited several years. In that time my husband bonded with my boys and became closer to them than I could have imagined. He loved them like he would his own children, even though they were with their dad half the time, but he left discipline and big decisions about their life up to me and their father. Of course we listened to any opinion he might have had.\n\nWe had our first child together when I was in my mid- 30’s and our last one 17 months later. By that time, we were more stable, everyone had plenty of room and my husband had established trust with my kids. When the two other kids were born, we were just a bigger family. \n\nAnd one last thing, I don’t care if my kids are 23 or 53, life is hard people! If any of my kids ever need to come back home to get on their feet financially, emotionally, physically or mentally, our door will always be open and they’ll always have a place to lay their head. We all need a little help sometimes, especially with the world and economy the way it is right now. And if you can’t get it from your parents (or step-parents) then I hope you’ve been lucky enough to create your own non-biological family you can count on.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I'm 34 years old,  with a solid career (paramedic/firefighter), and I still have to live with my parents happily and because they insisted because the cost of living just shot up and I could not afford a decent place,  in a good area,  for my son and I. Thank you for saying that about the average age.  In this society and day and age,  it's hard to survive on one income, and we need to help each other,  not boot them to the curb. OP I know I replied to another comment but if you read this you are MAJORLY the AH",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I bet you the daughter DOES pay rent. That's why they can afford a new baby and she doesn't have enough savings to survive. You can bet that OP would have commented about her being able to survive if she just cut back on avocado toast and clothes!\n\nThis is just about getting evidence of an ex out of the house because anyone smart would; see her as family because she is, realise that the COL crisis means that it's better to live at home, that her daughter would gain an older sister and that an extra pair of hands the first year is beyond helpful. Husband at work and you need to breastfeed and the dishes piled up?\n\nI'm so glad my dad adores me. I pay utilities and rent. The people in here acting like having a loving parent reflects on me are well, odd. Most people here live at home until they get a partner. Why pay a landlord when you can help family and vice versa?",
          "id": 208,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3192,
      "content": "NAH I think everyone is actually coming from an understandable place but...\n\nYou're ten years older than your step-daughter.\n\nSounds like dad is TA here.",
      "id": 209,
      "comments": [
        {
          "score": 1413,
          "content": "I would like to know how old the Dad is. Curious that OP left that out …",
          "id": 210,
          "comments": [
            {
              "score": 866,
              "content": "Considering that step daughter is 23, he is at least 41, unless he had his daughter before he turned 18.",
              "id": 211,
              "comments": [
                {
                  "score": 793,
                  "content": "And what is weird about a 41 year old being with a 33 year old?? I swear people on Reddit see literally any age difference and lose their minds. Yesterday I saw someone refer to a 34 year old woman as a \"child bride\". My lord.",
                  "id": 212,
                  "comments": [
                    {
                      "score": 226,
                      "content": "Did I say there was anything wrong with the age gap? Did the person I responded to, who simply asked how old dad was and found it odd that the age of him was never mentioned, but just those of OP and the step daughter? You are the only one bringing up the age gap and assuming there is an issue here. I was merely answering a question with an approximate age of dad.\n\nSomeone has been triggered by the Leonardo DiCaprio and his 19 year old girlfriend memes going around and it shows.",
                      "id": 213,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "What are you even getting worked up about, we don’t even know this man’s age 😂",
                      "id": 214,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "I'm scrolling through these comments and seeing the naive opinion of children.\n\n33-year-old woman marries a man a few years older than her and Reddits responses \" OMG creepy! Grooming!\"\n\nIt's so misogynistic in how it denies an adult woman her own agency.",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I'm sure there are many, many happily married age gap couples in the world. \n\nBut they are not the people posting on Reddit.",
                      "id": 216,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "That's exactly what I was thinking, as well.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 530,
          "content": "For all we know the dad had his daughter young and he's like 40ish.\n\nThere's nothing wrong with an age gap of 33 to 40.",
          "id": 218,
          "comments": [
            {
              "score": 472,
              "content": "Age gaps trigger this forum like nothing else.",
              "id": 219,
              "comments": [
                {
                  "score": 104,
                  "content": "Definitely,  if there's an age gap then the default response is YTA. Make you wonder how much of an age gap if acceptable.  Personally i like the 1/2 your age plus 7 rule.",
                  "id": 220,
                  "comments": [
                    {
                      "score": 97,
                      "content": "As long as the two people are adults, the age gap is none of my business.  When anyone writes in with a question, they want the answer to, if there is an age gap, the comments always ignore the question and go right to berating them about the age gap.  There are lots of things in life I would not do, but I'm certainly not going to judge others for doing them.\n\nI'm 66, so by your formula, I could be with someone who is 40.  I guarantee you that age gap would trigger this forum.",
                      "id": 221,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "My mom is 7 years older than my dad, and is 8 years younger than my stepdad. I should tell her that a bunch of people on the internet think she’s an asshole lmao.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Don’t forget to tell her that she was “predatory” and “grooming” and that her behavior and relationship are “problematic”.",
                      "id": 223,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 104,
              "content": "This subreddit is obsessed with ages in relationships.",
              "id": 224,
              "comments": [
                {
                  "score": 154,
                  "content": "With good reason, signed a victim of child rape and grooming",
                  "id": 225,
                  "comments": [
                    {
                      "score": 58,
                      "content": "That's awful. But if you are going to go with the idea that a 30 year old woman can be groomed then you are basically saying that women aren't able to make their own choices and that's sexist.",
                      "id": 226,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "This has got to be the weirdest comment on Reddit. \n\nWhat is the correlation between age gap and child molestation?",
                      "id": 227,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 37,
                      "content": "I’m a survivor of all that as well. This isn’t that. A 33 year old with someone in their 40s or even early 50s is not a big deal and nobody’s business. Going overboard just detracts from the seriousness and trauma of actual victims and makes people not care.",
                      "id": 228,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "Y’all are so weird. This a 33 yr old women we’re talking about she can marry whoever tf she wants",
          "id": 229,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Maybe he had her when he was young? The dad can be in his late thirties or early forties",
          "id": 230,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "OP is not 20 years old.  She's 33, it's totally reasonable that 33 year-old can have a healthy relationship with a 43yo.",
          "id": 231,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2954,
      "content": "If she contributes some rent and groceries, would you be able to afford a 3br? More cost effective than two places, and she wouldn't feel so pushed out.",
      "id": 232,
      "comments": [
        {
          "score": 562,
          "content": "But will they qualify for the mortgage? You're not wrong about it making a difference for being able to pay the bills, but I know a lot of banks are pretty strict about what you can count as income and how you can prove it when you apply.",
          "id": 233,
          "comments": [
            {
              "score": 375,
              "content": "Is it weird that I didn't even think about them owning the place? I just assumed they're renters... Ugh, that's where we are now, isn't it.",
              "id": 234,
              "comments": [
                {
                  "score": 49,
                  "content": "The worst part is that it doesn't even really put them in a significantly better position being homeowners because the market is so vastly different than it was even 5 years ago. Chances are that the mortgage they have or had for their current home was at least $100k different than what it would be to qualify for even the same home now, let alone a bigger one. Equity would help, but I wouldn't be surprised if even with the sale of their home, they couldn't get a mortgage for the remaining balance towards a bigger house in a neighborhood with good schools and all that. It's pretty depressing, really.",
                  "id": 235,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Even if they are renting. \n\nShe is 23 and there is soon to be a baby in a quite little home. Say they get a slightly bigger appartement which the step daughter helps to pay rent for. Step daughter finds out living with a screaming baby in an appartement sucks and would rather have roommates that didn't cry at 3am. She finds some roommates and move in with people her own age. OP is now has an appartement she can't afford and is looking to go through a second (probably expensive) move in maybe a year. First time pregnant, second time with an infant. \n\nA 23 year old more than likely has half a foot out the door already, OP can't plan her life economy around her.",
                  "id": 236,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 190,
          "content": "She will eventually want a life of her own, so it would be a burden to them later on to have a home they can’t afford.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "That's still not a sustainable long-term solution for a temporary problem, though. Even if they could afford buying a bigger house with her help, her living with them is at least hopefully not permanent for the rest of their lives, so they'd lose that contribution from her within a few years.",
          "id": 238,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "Then she moves out in a few years when she wants to live on her own leaving her parents with a house they can't afford \n\nBaby bird need to leave the nest.",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Then in a couple years she moves out on her own and OP and her husband are then on the hook for the bigger house.\n\nPlus, you can't just put 'Adult daughter will help with money' on a mortgage application.",
          "id": 240,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2529,
      "content": "YTA. Why didn’t you plan for this before you decided to have a baby in a home that doesn’t have space for a baby?",
      "id": 241,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1629,
      "content": "NAH even tho you raw dogged it without the room available for the result.  Sounds like you married an older man without the accompanying bank account, with no real assets brought to the marriage by you, even at your age, so I feel sorry for your short-sightedness.  You'll be fine with the infant in your room for the next 2 years.  I don't know if you noticed, but a lot of kids are staying home with their parents much longer because they can't afford to live.  I told my son-in-law who lives with me rent free, people can afford a car payment, or housing payment, but not both in this market.  One or both are gonna give somewhere.  You're VERY short-sighted.  I gave my judgment, but I'm totally team SD.",
      "id": 242,
      "comments": [
        {
          "score": 225,
          "content": "Just to clarify, short-sightedness in this context means marrying a man who owns a house but doesn’t have an opportunity to go and buy a bigger one?\n\nSounds really wild to me. In my country a lot of people are in 30+ year mortgage to buy a one bedroom flat (not house even). A guy with his own flat is considered a good catch.\n\nAmazing how standards vary around the world.",
          "id": 243,
          "comments": [
            {
              "score": 260,
              "content": "Short sighted as in \n\n>raw dogged it without the room available for the result\n\nShe conceived a baby even without checking if the step daughter can move out. It's dumb. Now she's scrambling to find space for the baby halfway through a totally preventable pregnancy.",
              "id": 244,
              "comments": [
                {
                  "score": 184,
                  "content": ">She conceived a baby even without checking if the step daughter can move out.\n\nThats probably the dumbest shit Ive ever read.",
                  "id": 245,
                  "comments": [
                    {
                      "score": 154,
                      "content": "I know 😂 like, sorry, are they supposed to wait for her to move out to have a baby? What is the appropriate age to move out, if 23 is too young?",
                      "id": 246,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "I’m flabbergasted by the fact that everyone seems to be on the 23 year old’s side here. She’s an adult. She should be able to afford rent somewhere, even if it’s shitty and with roommates. That’s what adulthood is. Expecting a 33 year old to wait an adult moves out of her house. until she’s classified as a high-risk pregnancy is *insane.* \n\nWhy should she put her life on hold for a non-rent paying adult?",
                      "id": 247,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "> She conceived a baby even without checking if the step daughter can move out. It's dumb\n\nWhat? Seriously?? I think it is reasonable to assume that someone in their 20s will move out when the space gets limited in the house. It is dumb for a 23 year old to assume that they can live indefinitely in their parent's house even after the said parent got re-married. I'm actually surprised that the step-daughter didn't herself decide to move out after OP got pregnant",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Their lives shouldn't have to revolve around the stepdaughter and what the SD wants.",
                  "id": 249,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Or a massive amount he pays in alimony",
          "id": 250,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1001,
      "content": "INFO: do you know how much she makes, and how much is a rental in your area?\n\nbecause 2 months of \"help\" could be not nearly enough for her to scrap by, and you seem eager to just kick her out instead of finding a compromise.\n\n\nEdit: OP seems to be avoiding the thread, hasn't responded to any of the comments, which just makes me think this is more about kicking her step daughter than to actually have a place for the new baby.\n\nso I'm gonna say YTA, and I want to add that I just *can't* with the USA's mentality that kicking a family member out as soon as they are able to vote (no matter how much they will struggle) is completely acceptable and encouraged.\n\nEdit 2: ooh I can’t believe I managed to piss off some americans to the point they feel the need to comment “hey not all americans” 🤣 I love it",
      "id": 251,
      "comments": [
        {
          "score": 361,
          "content": "She has a step daughter who’s ten years younger than she is. The husband’s age is carefully left out. I wonder why she’s eager to kick her out.",
          "id": 252,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 62,
          "content": "It's kinda nutty to me how America leans very heavily into the whole \"you're an adult, time to get out!\" thing, and I'm just up north! I considered moving to the city with my aunt when I graduated highschool, to start work and get used to living away from home, and my parents practically begged me to stay because it would be that much easier on me; I feel like I should also mention that my dad is Mr. You're-an-adult-and-need-to-learn-how-to-take-care-of-yourself-now-because-life-is-hard and he was the one who came to me first and said it was a bad idea to move out yet",
          "id": 253,
          "comments": [
            {
              "score": 41,
              "content": "Almost all minority families in America don't do the whole \"you're an adult now, see ya later\" thing either. It's more of a trope than a reality here I think, but it pops up on this subreddit more than real life.",
              "id": 254,
              "comments": [
                {
                  "score": 7,
                  "content": "That could very well be the case too, it's just something I hear about often, and when I compare what I hear about to my province I'm just kinda floored. I hope you're right that it's not a majority thing and just overblown",
                  "id": 255,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It’s not. But any stereotype that can be used against Americans is pretty heavily upvoted anymore.",
                      "id": 256,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "It is a normal part of the culture and we are raised with it. I was shocked when talking to a student from Greece when I was at university and she explained that it was expected to live at home until you marry. Turns out the US is the outlier. I had no idea. \n\nNow that I’m older I realize that is one of the things preventing families from building wealth. The families that can let a kid stay at home saving money to pay off debt/buy a house set them up for success",
          "id": 257,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "100% this!!! Caring for your child does not end when they turn 18. I’m so grateful to have been at home for a couple years after college instead of with 5 months struggling mentally, emotionally, and financially",
          "id": 258,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Honestly, as an American and a parent, it makes me kind of happy to think that I might get a little more time with my kids than the standard 18 years here. Of course I wouldn’t want them to be at home forever, in a “mine and only mine” helicopter parent way but if the world then is the way it is now, my door is always open. I also do hope the economy isn’t like it is today when the time comes and that my kids would be able survive on their own, should they so choose.",
          "id": 259,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 978,
      "content": "YTA.  Rental prices have increased extraordinarily, some places are worse then others- is the area high cost of living? It's wasn't your place to have the one to talk to her. You should have spoken to your husband and he should have been the one to have a one on one chat again.\n\nIt kind of sounds like you're driving her out of her family and are more interested in raising a family of 3 instead of being a family of 4.\n\nMay not be your intention, but from how you worded things it's pretty obvious that your unborn child is already more important to you than your stepdaughter.\n\nI feel bad for the stepdaughter in all of this.",
      "id": 260,
      "comments": [],
      "relation": "Attack"
    }
  ]
}