{
  "post content": "Ok for info I have a friend Ill refer to her as M she has BPD (Borderline Personality Disorder) so she has huge mood swings. Her, her husband ( my childhood friend) and I were all talking on the phone about hanging out and what we would do over the weekend. Suddenly she begins to shift as she does and starts having depressive thoughts and begin to talk about killing herself in a semi- joking sorta way. To which I respond \"don't do that M, what about your cat who will look after and love your cat if you do\" M then replies \"my husband will take care of the cat\" then I say \"how can you be sure of that M?\" She then says \"because if he doesn't I will haunt him\" I then reply with \"M you can't haunt him ghost aren't real\". Then my friend then yells at me to \"cut out that atheist bull crap\" and just as the theological argument was about to start as I could tell in the tone of M's voice as well as her going just \"because you can't prove they aren't real doesn't make you right\" to which I made up an excuse to get off the phone. so now I'm sitting here annoyed and frustrated because I feel like augments and situations like these are all to common and because of M's mental illness I'm always at a disadvantage and end up being the \"Bad Guy\" So I need to know am I the A-hole or better yet what to do in the future in situations like this? \n\nfor info I'm a Atheist and my friend is Agnostic",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "NAH, she has a mental disorder, but she was being a bit confrontational, and you have a right to feel frustrated.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NAH - You're allowed to feel however you do.  It's your actions that matter.  BPD is particularly difficult to deal with, so I don't think anyone would blame you for getting frustrated sometimes.  Seems to me you handled this situation just fine.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH, you have every right to be frustrated, but  she doesn’t have control over the mood swings. If you’re close with her and able to detect it, maybe try to ride it out and be careful not to escalate things until it passes.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk for info I have a friend Ill refer to her as M she has BPD (Borderline Personality Disorder) so she has huge mood swings. Her, her husband ( my childhood friend) and I were all talking on the phone about hanging out and what we would do over the weekend. Suddenly she begins to shift as she does and starts having depressive thoughts and begin to talk about killing herself in a semi- joking sorta way. To which I respond \"don't do that M, what about your cat who will look after and love your cat if you do\" M then replies \"my husband will take care of the cat\" then I say \"how can you be sure of that M?\" She then says \"because if he doesn't I will haunt him\" I then reply with \"M you can't haunt him ghost aren't real\". Then my friend then yells at me to \"cut out that atheist bull crap\" and just as the theological argument was about to start as I could tell in the tone of M's voice as well as her going just \"because you can't prove they aren't real doesn't make you right\" to which I made up an excuse to get off the phone. so now I'm sitting here annoyed and frustrated because I feel like augments and situations like these are all to common and because of M's mental illness I'm always at a disadvantage and end up being the \"Bad Guy\" So I need to know am I the A-hole or better yet what to do in the future in situations like this? \n\nfor info I'm a Atheist and my friend is Agnostic\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH - it's kind of a two to tango situation really. Just a clash of views",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH - I think you handled it well by excusing yourself from the phone conversation.  Her emotions were triggered from your opposing views - so I’d suggest if you are aware of a conversation topic that may trigger her to avoid it. Unfortunately this sensitivity is common for people with BPD. I have BPD so I speak from experience. \n\nAlso, this may not be the case for everyone but statements like “don’t you want to stay alive for X” - may cause the person to feel guilt and have a negative reaction / more depressed from that question.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    }
  ]
}