{
  "post content": "so i've had this friend for years, online as she lives in cali but travels for work. we used to talk a lot when we were younger and then it slowed down but now, for the most part, our longest conversations happen when she is bored or lonely or looking for some sort of validation. the other night we started talking while she was out at a bar and eventually she asked me if i would essentially validate her and make her feel better about herself (she thinks she is overweight) and i might get something for it. Of course i agree and we keep chatting and it kinda gets side tracked as we talk about a bunch of other things, all while i still manage to complement the fuck out of her and build her up. at one point she made the point to say \"we're basically in like a loooooong distance poly-emotional relationship\" (she's actually in a poly relationship with someone else) and also say how great i am for always being there for her no matter if she talks to me for hours on end or just once a month and how she appreciates me. after a few hours of talking and me staying up way past my usual bed time to keep her company, she falls asleep on me, which is nbd. but the next morning she read any messages i had left her and then just doesn't reply, no thanks for keeping me company or hey i appreciate that, she just goes right back to not replying. \nAITA for being annoyed even tho she explained the night before that that is basically just how she is? im just sick of building people up only to be ignored when they dont need the confidence boost for the time being\n\nEDIT: i also would feel like the A-hole if right after she was like \"im so glad youre always here for me even if i dont reply all the time\" and then i come back with \"yeah im mad you're not as good of a friend as i want you to be\" if that makes sense",
  "id": 1,
  "comments": [
    {
      "score": 2,
      "content": "NAH. I don’t think you’re an asshole because your needs aren’t being met, but I don’t think she’s purposefully being an asshole either. \n\nDo you reach out to her when you need her, or only wait for her to message you? Long distance friendships are a two way street. If you want to talk more, you could reach out more often! If she actively never answers your messages, then you’re NTA.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "i reach out more than she does. like she will snap me pictures every so often of her day or the places she is traveling to and ill try to start convos but usually they just get left on read with no reply. she will reply for a few messages sometimes but the long conversations really only happen when she is lonely",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "I think you might just have to accept her for the way she is, or discontinue the friendship.  I’m kind of like her - I have a hard time keeping up long distance conversations because I honestly don’t have an interesting life so unless something major (usually bad tbh) happens, I don’t have much to say. It wouldn’t hurt to let her know you’d like her to be better about replying because it makes you feel sad/angry/lonely/etc when you message and she doesn’t answer. If she doesn’t change after saying that though, I don’t think pushing the issue will help",
              "id": 4,
              "comments": [
                {
                  "score": 1,
                  "content": "yeah i think im gonna bring it up next chance i get. i think i might have been more ok with the usual no replies after her comment about how she knows she does it, but what truly irked me was that i was up till 7am to keep her company, she fell asleep on me and then the next morning didnt reply to anything i had left her or even thank me for being there for her. i think our next point of conversation after that night was the following night i asked her if a steak she posted a pic of had bacon on it and she said yes. that was it",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nso i've had this friend for years, online as she lives in cali but travels for work. we used to talk a lot when we were younger and then it slowed down but now, for the most part, our longest conversations happen when she is bored or lonely or looking for some sort of validation. the other night we started talking while she was out at a bar and eventually she asked me if i would essentially validate her and make her feel better about herself (she thinks she is overweight) and i might get something for it. Of course i agree and we keep chatting and it kinda gets side tracked as we talk about a bunch of other things, all while i still manage to complement the fuck out of her and build her up. at one point she made the point to say \"we're basically in like a loooooong distance poly-emotional relationship\" (she's actually in a poly relationship with someone else) and also say how great i am for always being there for her no matter if she talks to me for hours on end or just once a month and how she appreciates me. after a few hours of talking and me staying up way past my usual bed time to keep her company, she falls asleep on me, which is nbd. but the next morning she read any messages i had left her and then just doesn't reply, no thanks for keeping me company or hey i appreciate that, she just goes right back to not replying. \nAITA for being annoyed even tho she explained the night before that that is basically just how she is? im just sick of building people up only to be ignored when they dont need the confidence boost for the time being\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, put one of the following abbreviations at the beginning of your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO Have you told her that the relationship seems one sided, and that you don't feel like your needs have been met?",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "not yet. i honestly feel like an asshole being like \"i dont like your reply patterns and i want you to be a better friend to me\"\ni feel like she'd just be like \"ok then we can just not talk if youd like\"",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "You shouldn't assume that she would react badly. Maybe she doesn't know how one sided things have been? And if she does react badly, then ask yourself what are you getting out of this relationship?",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA.\n\nFriendships should be mutually beneficial. If she becomes an annoyance just drop her.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA, but it does get to a point where being used is on you for knowingly allowing it. quit being there for her whenever she decides she needs something from you. focus on friends who are mutually interested in you. ",
      "id": 12,
      "comments": [],
      "relation": "Support"
    }
  ]
}