{
  "post content": "I’ve known my boyfriend for a pretty long time, and we finally started dating early this year. I really like being with him, and the feeling seems to be mutual. He’s very affectionate and makes me feel loved. We talk about our future plans a lot. He also has a daughter, who I met once & she apparently “loved me,” and we’ve met each other’s parents so I think things have been getting somewhat serious.\n\nLast night, he invited me to a show at a bar where some of his friend’s bands were playing. I didn’t really want to go because I was super tired (in hindsight I should’ve stayed the fuck home and avoided this whole situation...) but I agreed anyway because I wanted to spend time with him. I’m extremely introverted while he has some outgoing tendencies, so I let him socialize with his friends and do his thing while I sat at the bar. No big deal, I've done this plenty of times. Doesn't bother me, and it seems to work for us.\n\nAfter about two hours, the bands finished playing and it was getting late (about 11:30) and we needed to head back to my apartment because we both had work in the morning. I asked him if we could leave, but he kept insisting he wasn’t done socializing and needed to say goodbyes. I stood outside in the rain in a dry area and waited for him. After ten minutes, I started texting him saying “LET’S GOOO!!!” and called him so he’d get a move on.\n\nWhen started driving home, he fucking. lost. it. He started screaming about how I’m trying to control him, how I’m \"Hitler\", how I’m a narcissist and will never be successful in my career or amount to anything. He even said some misogynist shit about women being psychos. I tried to calm him down, because I’ve NEVER had a partner yell at me like that before and it was scary. He wouldn’t change his tone and rationally discuss why he was upset with me. He wasn’t willing to work towards a solution and understand each other’s perspectives. Instead, I was the fucking worst person in the world because I wanted to go home after sitting by myself for two hours while he caught up with friends. In retaliation, I called him a deadbeat dad (he only sees his kid a few times a month) and that his only redeeming quality is that he is attractive. I knew these were low blows, but I felt like I was being attacked and didn’t know what the hell to do because he wouldn't cooperate with me. Obviously, it didn’t go over well.\n\nThis is where it gets really messy. After we arrived at my house, I locked him outside and told him to go away. He refused to leave until I gave him back his overnight bag. So I emptied out the contents, and dramatically threw them out the window. So his clothes were scattered around the parking lot, now wet from the rain.\n\nIn the morning, I received a text from him that said “well that sucked but I refuse to be around that behavior” and he blocked me on social media.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 76,
      "content": "ESH\n\nJust to be clear, your actions are toxic and qualify as abusive. You need to get out of this relationship and really do some soul searching about who you are.\n\nTo be clear. His actions are also abusive and toxic. Generally, the person in a relationship throwing about accusations of narcissism is the actual narcissist.",
      "id": 2,
      "comments": [
        {
          "score": 11,
          "content": ">Generally, the person in a relationship throwing about accusations of narcissism is the actual narcissist.\n\nThis is a special and nuanced red flag. Anyone who retroactively accuses their ex of narcissism without some kind of concrete diagnosis/action/comorbidity does *generally* come off as the asshole. I wouldn't say the accusers are *generally* narcissists, but I wouldn't say they aren't either. I would say that those who accuse of narcissism typically do not have any deescalation, resolution, or disengagement  skills.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23,
      "content": "ESH, that's childish behavior from both of you.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 19,
      "content": "ESH. Holy shit you both had the worst possible reactions to each other. Both of you reached to extreme measures to hurt each other. I think it's for the best you broke up.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 16,
      "content": "ESH, but you really upped the ante.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "ESH. His behaviour was bang out of order and so was yours. Sounds like a good thing it's over",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "i don't think this is the right place for this, but I'll just say ESH, because duh",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "What do you think would be the right place? r/relationships ? because I can post it there if so.",
          "id": 9,
          "comments": [
            {
              "score": 14,
              "content": "r/nostupidquestions?\n\nr/awfuleverything?\n\nJust stick a fork in this relationship. It’s done. Both of y’all need to grow TF up.",
              "id": 10,
              "comments": [
                {
                  "score": 4,
                  "content": "Nothing else needs to be said.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Yep.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "ESH. Neither of you should be seeing anyone",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "ESH - you are well rid of this person. He behaved horribly and you had every right to be scared. Responding in kind, however, means you suck too. Not as much, however. You don't say who was driving, but he was either screaming at you while you were, or screaming while he himself was and that's so so so dangerous either way. The misogyny and the cruelty over a relatively minor disagreement is the biggest of red flags.\n\nStill, you should check in with yourself about why you responded in kind in terms of the insults and the destruction of property. You never put him in danger, but that wasn't okay. \n\nI'm glad you locked him out of the house though. He didn't sound safe to be around. Do not take this man back.",
      "id": 14,
      "comments": [
        {
          "score": 7,
          "content": "Thanks for taking the time to write all of this out, I feel like everyone is just saying ESH without elaborating. I agree with the judgement, but I feel like what you wrote is really what OP needs to see. The screaming in the car, no matter who was driving, was really dangerous. OP reacted in a way that, while not dangerous, still wasn't okay.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I've read this comment a few times, and it really resonates with me. Thank you.",
          "id": 16,
          "comments": [
            {
              "score": 0,
              "content": "for clarification, he was driving.",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "ESH - You both need to grow up.",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "ESH 100%. It's sounds like you definitely should have stayed home. I absolutely understand why you would be irritated considering you sat at the bar alone for 2 or so hours...but I understand why he would be irritated too considering he invited you out and it was his event and NOBODY likes being rushed. All that being said, he shouldn't have yelled at you and you shouldn't have thrown low blows or his clothes! ESH for sure. Forget him and move on!",
      "id": 19,
      "comments": [],
      "relation": "No"
    }
  ]
}