{
  "post content": "Edit: Okay I reread through what everyone is saying, and you guys are right. If this would've happened to me I would want someone to help me, no matter if they're garbage people. So when I get off of work I'm going to head straight to the police department. I'm not going to go through the nasty neighbors.\n\n\n\n\nI'm new to Reddit but I'm going to make this post as very short as possible.\n\nMy neighbor and their children are horrible people. They listen to music until 4 in the morning, they start fights with everyone and their kids play baseball in the middle of the street( we have a baseball field 2 blocks away) when we tell them to play in the field they always say \" ok boomer\" \" shut up little b**ch\" like that supposed to hurt my feelings or something. You tell their parents and they do nothing about it.  This is just the short version of what they do to everyone and the police don't do anything about it.\n\n\nAnyways long story short their house got robbed last night ( luckily they weren't home) and my camera ( I put them up in case the kids broke anything from playing baseball and their parent will pay for it) caught everything. The police were knocking on everyone's door ( to see what happen) and we pretend like we weren't home lol. Once they left I replay what happen and low and behold I caught 3 men breaking into their house. I'm debating on whether or not to say anything because I can't stand these people at all.\n\nSo Reddit WIBTA?\n\nTLDR: neighbors and their kids suck/terrible human beings, their house gets robbed, my cameras caught it all, wibta for not taking it to the police?",
  "id": 1,
  "comments": [
    {
      "score": 887,
      "content": "ESH. Obviously your neighbors suck. But it's not about them! It's about the super nice, quiet, respectful neighbor on the next street who will be the next victim. You're putting other people - including yourself - in danger in order to avoid possibly helping the people you hate.",
      "id": 2,
      "comments": [
        {
          "score": 83,
          "content": "Makes me wonder if those guys purposely targeted that house cause people have issues with them. It could’ve just been random too.",
          "id": 3,
          "comments": [
            {
              "score": 39,
              "content": "Unlikely if you are doing that much prep work that you know the dynamics of the neighborhood relations you would have just picked the house that wasn’t next to security cameras",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 452,
      "content": "YTA doesn't matter how much of an asshole they are (which they are) you don't withhold information of a crime. And if they broke into their house, odds are they are going to break into others. So you will hold some responsibility for not helping the police catch them.\n\nThe behaviour of the kids is a completely different issue and should be treated as such.",
      "id": 5,
      "comments": [
        {
          "score": 45,
          "content": "The point about there being future victims was my first thought",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "The break-in you prevent may be your own",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 237,
      "content": "You WBTA for potentially putting not them, but others at risk. Yes, they suck. But if not caught the robbers could come back to another neighbor's house. Or worst case scenairo, yours. There are better ways of getting revenge, but not like this.",
      "id": 8,
      "comments": [
        {
          "score": -121,
          "content": "I know, I just hate these people lol.",
          "id": 9,
          "comments": [
            {
              "score": 104,
              "content": "Don't lower yourself to their level be the better person",
              "id": 10,
              "comments": [
                {
                  "score": 13,
                  "content": "Imo OP is wayy below their level. Hating someone so much that he refuses to help the police and revels in their misfortune is low.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "If it makes you feel better, it isn't as if they are going to get their stuff back if they catch the criminals. It's all sold by now.\n\nYou are only helping their future victims.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Stop being petty and do the right thing. YTA",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "I would, too, but you have to be practical - criminals put everyone in the neighborhood in danger, including you. Tell the cops you \"didn't want to get involved\" at first but have changed your mind. Then say something like, \"when you're over there, can you ask them to please keep it down and warn the kids to stay out of the street?\" They're never gonna get their stuff back regardless, it's not like handing the cops a tape is going to make things perfect for them.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "People are downvoting you like your feelings aren't valid. Well, I just want to tell you I hate your neighbours too, and I haven't even met them. It's okay to feel that way.\n\nSounds like you're going to do the right thing and show the police the video, so you can carry on ranting about the neighbours on the Internet as much as you want, I reckon. God knows there's nothing else you can do about it.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Time to get over it.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And I hate people who cap off every sentence with lol (it's insufferable). But such is life.\n\nI have trashy neighbors but I'd want the bad guys caught to protect a decent person who may be victimized. But that's just me.",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 67,
      "content": "YWBTA; what if these people come back and rob your house because they weren't caught due to you withholding evidence?",
      "id": 18,
      "comments": [
        {
          "score": -28,
          "content": "Yeah, I know. I just wish these people were more kinder to everyone",
          "id": 19,
          "comments": [
            {
              "score": -38,
              "content": "The best thing you can do is continue to be kind to them regardless of how they treat you. The high road isn’t always the easy road. And definitely show the footage to the police.",
              "id": 20,
              "comments": [
                {
                  "score": 36,
                  "content": "That’s absolute bullshit. Being kind to someone who is treating you badly just emboldens them to continue.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "That is the worst advise to anyone about anything ever.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I disagree. There’s waaay worse advice out there. 🙂",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I agree with you mate. Shortly after a guy is rude to you get a container of candy and give it to them with the sweetest voice and smile. Then as the guy begins to turn away make your smile absolutely maniacal. As the guy turns back in a double take switch back to the sweet smile and look confused. Make the mofo think he’s going nuts. Then do some of the pettiest crud. Stuff that looks innocent. Make a chair on their front porch a centimeter taller increase that slowly over time.\n\n😏",
                  "id": 24,
                  "comments": [
                    {
                      "score": 2,
                      "content": "So the neighbors are basically The Twits",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 64,
      "content": "I don't think you're an asshole but from a community safety perspective it may be best to say something. I mean those guys might come back and hit your house next. I wouldn't think of it as helping the neighbors, rather protecting yourselves and others down the line.",
      "id": 26,
      "comments": [
        {
          "score": 16,
          "content": "Agree if they are serial thief’s they will come back to the neighborhood if they were successful last time so for your sake and the rest of the community I would turn it in",
          "id": 27,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 55,
      "content": "YTA - your house or other neighbors will be targeted as some point too when the criminals realize no one cares to report police issues.  Take it to the police to protect the rest of the neighbors and yourself.  Do not allow criminals to go free just because you dislike the victims.",
      "id": 28,
      "comments": [
        {
          "score": -51,
          "content": "That's the thing, I would show it for other neighbors, these neighbors are horrible.",
          "id": 29,
          "comments": [
            {
              "score": 28,
              "content": "But you won't get the other neighbours thefts on video. You got *this* one. \nIf you don't report it because of your ego and selfishness and one of your other neighbours that you like gets robbed, it's on you, itll be your fault for not having reported it. \n\nSurely you're not that selfish.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "So you are happy to risk them coming back and robbing you and your nice neighbours? If I were your nice neighbour that would turn me against you really quick",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 34,
      "content": "ESH - the neighbors such and don't deserve your respect, obviously, but catching people who are robbing houses in your neighborhood could prevent theft from other neighbors or even from yourself. Knowingly having evidence that could help the investigation and withholding it is not only an AH thing to do, but if asked directly and you don't give them the footage could be considered illegal (IANAL).",
      "id": 32,
      "comments": [
        {
          "score": 4,
          "content": "That's what I'm contemplating because these neighbors are horrible people. Like worse than worst",
          "id": 33,
          "comments": [
            {
              "score": 29,
              "content": "You know, they probably aren't worse than the people who robbed them.\n\nJust a thought.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Look at it this way: You're not doing it as a favor to the neighbors, but as a community-minded citizen who wants to make sure more burglaries don't occur in your neighborhood.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "There may be a silver lining. The robbers may be people the neighbors know and are involved with in a sketchy way. The cops may end up dealing with your nightmare neighbors too. We had a horrible neighbor and he ended up being robbed by his meth head \"friends\" worked out cuz the cops found his meth and the property he'd stolen as well. Ha ha. They lost their house and the neighborhood was back to it's lovely state.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You know if the burglars saw your cameras they might think you also have something to protect! And, you could be next! Turn in the footage, be the good neighbor and hopefully these burglars will be caught. \nNTA...YET.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "YTA.  Doing what's right doesn't matter when it's easy, doing what's right when it's difficult is what shows your values are.  \"Two wrongs don't make a right\" and all that.  Just do take the high road and when they're being little shits take solace in the fact you are a better person than them.",
      "id": 38,
      "comments": [
        {
          "score": -27,
          "content": "If you live with someone so horrible, would you still be able to do the right thing?",
          "id": 39,
          "comments": [
            {
              "score": 29,
              "content": "Show the cops the video but not for your awful neighbours. Do it for yourself. Your house could be next. Do it for the other nice neighbours who may be next on the burglar's list",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I think what you're not understanding here is, yes. Yes, they'd still do the right thing. Even if it's hard, you do the right thing. It's called integrity.\n\nEta: I mean I totally understand why you don't like them. I wouldn't either. But I'd still share the video. I wouldn't want to be next and I wouldn't want it to happen to anyone else.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yep, let me adapt an adapted quote:\n\nFirst they came for the horrible people in the neighbourhood and I did not speak out as I was not a horrible person, next they came for the old dear down the road and I did not speak out as I was not an old dear, then they came for me, and there was no one left to show the camera footage",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 25,
      "content": "YTA\n\nFirst and foremost, the street is public property and they kids can play baseball there. Second the police may not be able to do anything about the noise because they can't act on a noise complaint unless the sound reaches a certain threshold, and as for the 'picking fights', I would like more info??\n\nAlso imo not showing the footage that could help solve a crime is an accessory to that crime or even tampering with evidence, which is a legit crime. You also lied to the police.\n\nYou have an obligation to show that footage, shitty people or not. \n\nAlso FYI, if not caught you don't know if that robber would strike one of your GOOD neighbors, or even yourself next.\n\nDon't be a shitty neighbor yourself and give the footage up.",
      "id": 43,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 15,
      "content": "YTA - it’s not about helping the neighbours, it’s about stopping criminals. Get over yourself.",
      "id": 44,
      "comments": [],
      "relation": "Attack"
    }
  ]
}