{
  "post content": "Me (24f) works 12 hr shifts\nGf (28f)\n\nMy gf and I got into an argument when we got home from her picking me up from work.\n\nI ended up being about 15 minutes late getting out of work. A mgr asked me and a coworker to clean up about an hour before end of shift. It took longer than expected. When I realized (about 8 minutes late) I txtd her and apologized. She txtd me smth about not being able to say no and being walked all over. Clearly she was upset.\n\nWhen I got in the car I didn't bring it up but I could tell she was irritated. We end up talking about it and she says the same thing in the txt. I tried to explain that it wasn't me being taken advantage of but didn't really go anywhere.\n\nThen she brings up smth I had txtd her earlier. I had asked if she wntd to \"go CC shopping\". CC means custom content and she didn't know that so she thought I was talking about actually going somewhere. We cleared that up in txt but she asked what it was in the car. She was still upset, had attitude and it was starting to bother me. She was saying I give her only half the story. This was because I didn't explain CC in the first txt.\n\nShe later apologized (in the car) by saying \"I'm sorry I'm being a dick but you only give me half the story\"\n\nWhen we got home I cried in the shower. When I got out she asked what was wrong and I told her she was being an asshole to me in the car. It became a big argument after. I told her I was upset with how she spoke to me and that her apology sucked. She said I give her attitude and blow up on her over 1 thing all the time but today 3 things irritate her (there was stupid incident over a blanket in the car too) and she can't have attitude? Also said \"I can't have an off day?\"\n\nShe also mentioned that I didn't tell her what time my mgr had asked me to clean and she thought it was a few minutes before my shift ended and not an hour.\n\nI understand being upset I was late getting out but the other stuff just seemed so dumb.\n\nShe isn't talking to be right now.\n\nTldr:  AITA for being upset that my gf had attitude with me the whole drive home for being late getting out of work and not explaining what CC means?",
  "id": 1,
  "comments": [
    {
      "score": 11,
      "content": "It sounds like you have a communication problem. You need to tell a longer story with more details when you talk. She needs to ask questions before jumping to conclusions.  NAH, imo",
      "id": 2,
      "comments": [
        {
          "score": 4,
          "content": "Thanks for the advice.  I'll have to work on remembering to give more details",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "Judging by this \n„ She said I give her attitude and blow up on her over 1 thing all the time but today“\n\nESH \n\nI guess you should learn to communicate better",
      "id": 4,
      "comments": [
        {
          "score": 0,
          "content": "I definitely need to work on it",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "nta, i forgot this was your girlfriend and thought it was your mother by the end.",
      "id": 7,
      "comments": [
        {
          "score": -1,
          "content": "Just a quick question what do you mean by that? I'm just curious and over the internet I can't tell if you are serious or not lol",
          "id": 8,
          "comments": [
            {
              "score": 1,
              "content": "The commenter means like you girlfriend is treating you like a child.",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH you both had off days. Don't sweat the small stuff and be kind to each other.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. I was a few minutes late in getting out of work once and my ex just drove home and left me there. I was so embarrassed in front of the person I was training up, who offered me a ride home. Anyone who berates their partner for being minutes later in getting off work is an AH.",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "She didn't really berate me but kept saying that I let people walk over me and can't say no. She also said she was upset because she doesn't like that people are taking advantage of my kindness",
          "id": 12,
          "comments": [
            {
              "score": 2,
              "content": "How is this taking advantage though? You were getting paid, right? Most jobs that I've ever worked at have days sometimes where you have to stay an extra few minutes to finish up. I guess I just don't understand why this would even be an issue in the first place?",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "Honestly that's how I felt about it too. I don't see it as taking advantage",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Yeah, this is berating you.",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah you are right the more I think. I guess the way she worded it made it seem like she was upset more at my mgr than me but her tone and attitude towards me said otherwise.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "She's absolutely berating you. If she genuinely cared she would be building your confidence to help you become more assertive. She wants you to say no to your manager but I don't think she would want you to stand up to her.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA: If she's being a dick she's being a dick. Tell her to just own it.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "She was already angry in the car before you got there. You didn't stand a chance, you already know this and that's why you cried in the shower.\n\nIf any of that is right your been abused, time to plan your exit. \n\nI hope I'm wrong",
      "id": 19,
      "comments": [
        {
          "score": 1,
          "content": "I honestly don't know how to respond. I appreciate you're response and it's gave me something to think about. I knew she was angry when I seen her txt. I knew it wasn't going to be a pleasant ride but I had hoped it was just a small thing and that I was wrong",
          "id": 20,
          "comments": [
            {
              "score": 0,
              "content": "Do you ever just keep quiet when things are bothering you because the argument isn't worth it and it will only end up been your fault anyway?",
              "id": 21,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah. When we first started dating she would say things like \"its always my fault\" when we would fight. Now I'm the one feeling like it's always my fault",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Then you need to run. The power dynamic in this relationship sucks. Your gf is a bully.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Honestly I just described a text book case of abuse to you and you confirmed its your life. \n\nGet yourself safe away from this woman.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA, does she act out about simple stuff like this often? Seems like something else might be bothering her.\n\nGetting mad at the CC thing seems very silly. All she has to do is ask what it means...\n\nAs far as staying late, don't you want a partner that will be there for you no matter what and have a good attitude about it? Kinda seems like a red flag, getting upset over something so simple it is just unwarranted.\n\nIf you were 40 mimutes late or several hours than I think it would be a different story.",
      "id": 25,
      "comments": [
        {
          "score": 2,
          "content": "Honestly sometimes she does get upset over things I think are just little things.\n\nYeah the CC thing confused me the most because she did ask in our txt convo and I explained. It didn't seem like a big deal at all when we were texting. It wasn't until I got off that she seemed to be upset by it",
          "id": 26,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe (24f) works 12 hr shifts\nGf (28f)\n\nMy gf and I got into an argument when we got home from her picking me up from work.\n\nI ended up being about 15 minutes late getting out of work. A mgr asked me and a coworker to clean up about an hour before end of shift. It took longer than expected. When I realized (about 8 minutes late) I txtd her and apologized. She txtd me smth about not being able to say no and being walked all over. Clearly she was upset.\n\nWhen I got in the car I didn't bring it up but I could tell she was irritated. We end up talking about it and she says the same thing in the txt. I tried to explain that it wasn't me being taken advantage of but didn't really go anywhere.\n\nThen she brings up smth I had txtd her earlier. I had asked if she wntd to \"go CC shopping\". CC means custom content and she didn't know that so she thought I was talking about actually going somewhere. We cleared that up in txt but she asked what it was in the car. She was still upset, had attitude and it was starting to bother me. She was saying I give her only half the story. This was because I didn't explain CC in the first txt.\n\nShe later apologized (in the car) by saying \"I'm sorry I'm being a dick but you only give me half the story\"\n\nWhen we got home I cried in the shower. When I got out she asked what was wrong and I told her she was being an asshole to me in the car. It became a big argument after. I told her I was upset with how she spoke to me and that her apology sucked. She said I give her attitude and blow up on her over 1 thing all the time but today 3 things irritate her (there was stupid incident over a blanket in the car too) and she can't have attitude? Also said \"I can't have an off day?\"\n\nShe also mentioned that I didn't tell her what time my mgr had asked me to clean and she thought it was a few minutes before my shift ended and not an hour.\n\nI understand being upset I was late getting out but the other stuff just seemed so dumb.\n\nShe isn't talking to be right now.\n\nTldr:  AITA for being upset that my gf had attitude with me the whole drive home for being late getting out of work and not explaining what CC means?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 27,
      "comments": [],
      "relation": "No"
    }
  ]
}