{
  "post content": "Background: for my 24th birthday, my dad got me a grey metal KitchenAid standmixer for my apartment. It was about $700 I think. However, I did NOT ask for this and honestly I freaking hate the color as it does not match anything in my place and it's also too big. I gave it to my friend who liked it and was moving to a different state. My boyfriend then got me a cute black standmixer that fit into my apartment a lot better so that's what I have.\n\nMy dad was over last night and he noticed that the grey standmixer was gone and replaced by the black one. He asked where it was and I told him the truth (namely, that I thought the grey was ugly so I gave it to my friend and my boyfriend got me the black one instead).\n\nMy dad was shocked and said the grey standmixer had cost a lot and that he thought I would have liked it so that's why he gave it to me as a present. Maybe here's where I'm the AH: I said if he would have been more observant, he would have known that I absolutely hate the color grey (it's my least favorite color) and everyone in my life who knows me knows that.\n\nI honestly wasn't trying to be rude, I was just stating a fact. But my mom called me today and told me I really hurt my dad and need to apologize for \"throwing away\" a thoughtful birthday gift my dad had put a lot of money and thought into.\n\nI don't think that's necessary, I think after my dad gave me the standmixer, it became mine and I could do anything with it. And I didn't \"throw it away\", I gave it to a friend.\n\nSo AITA?\n\nedit: okay so clearly I'm the asshole. I'll apologize to my dad. I didn't think it was such a big deal. But clearly I'm wrong. To explain some things: 1) I didn't say the \"observant\" comment to hurt him, he kept saying he picked out grey because it matches everything (which it does not) so that's why I elaborated on me hating grey 2) literally everyone I'm close with (except my dad I guess) knows I HATE grey. It's almost a running joke at this point 3) my friend is really into cooking/baking and I wanted to give her a moving-away gift, she's not just some \"rando\" person I gave it to",
  "id": 1,
  "comments": [
    {
      "score": 55011,
      "content": "YTA\n\n>\tif he would have been more observant, he would have known that I absolutely hate the color grey (it’s my least favorite color) and everyone in my life who knows me knows that.\n\nthis is one of those instances where it's time to come back down to earth. because at age 24, expecting people in your life to know your least favorite color is absolutely bizarre. and saying it's because he isn't observant is wildly mean.\n\ndid you even thank him for the *$700* gift?\n\nEDIT: i am not op. please stop replying to me and addressing OP, it's extremely annoying!!!",
      "id": 2,
      "comments": [
        {
          "score": 14034,
          "content": ">I honestly wasn't trying to be rude, I was just stating a fact.\n\nDidn't you hear? They weren't trying to be rude. /s If I ever had a kid who said something so shitty I would be wondering where I went wrong seriously YTA.",
          "id": 3,
          "comments": [
            {
              "score": 19173,
              "content": "Fucking hell. The attitude on you is absolutely astounding, dude. YTA. For starters, saying you hate grey but love black makes absolutely no sense. Almost any color scheme you can pair with black works with grey. Also, you’re 24. Grow up. Not everyone knows your least and most favorite colors unless they ask. In fact, most people only know other’s favorite colors. They don’t carry around a ranked list. Secondly, it was $700! If you didn’t want it, you could have kindly said no thank you instead of giving away something that costed a lot of money. The correct and polite thing to have done would have asking your dad if he wanted it back. A little white lie doesn’t kill anyone. Could’ve just said it was a bit too big for your kitchen or that your boyfriend had already gotten one for you. You *hurt your father who wanted to give you a nice gift he thought you’d like*. And instead you give it away, and get all snarky with your dad with the whole “you obviously don’t know me that well” bullshit line. Yeah it was yours, but that doesn’t mean that what you did with it was right. Grow up, act your age, and give your dad the money back. Jfc.\n\n\nEdit: thank you for the awards but please save your money",
              "id": 4,
              "comments": [
                {
                  "score": 3809,
                  "content": "Exactly…just thank him and let him know that it’s lovely but just too big for the house and could you or he return it and get something smaller.  What a waste…I’d be pretty unhappy and hurt as the dad and that OP doesn’t even understand that is so spoiled and entitled.  BTW most people,would love that mixer…it’s on every wedding registry I’ve ever seen.  What a brat!  OP is TA big time.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4026,
                      "content": "This was my thought too - OP is a brat who doesn’t even appreciate a gift that most people drool over. All because it’s not the right color - are you kidding me? If someone gifted me an ugly brown (my least favorite color) KitchenAid or other expensive product I might be a bit disappointed on the color but ecstatic to have this really nice thing that I never would have splurged on for myself. \n\nWhile it’s true that once given, the gift is yours, the right and thoughtful thing to do would be to have thanked your dad for the lovely gift but explain that it’s too big for your apartment. Would he mind if you exchanged it for something smaller? Maybe take him out with you to pick something out together to help him still feel apart of the process and show your appreciation that your dad loves you enough to go out looking for a nice gift for you. Even if he doesn’t read your mind and know your taste, he does know he loves you. Heck, you could have even used it as an opportunity to slyly throw in “Oh, I think this little black one would match perfectly with my X Y and Z!”\n\nI hope your dad never wastes so much money on a gift for you since you truly don’t appreciate it.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1144,
                      "content": "Not to mention how freaking versatile those mixers are. With the right attachments you can make just about any kind of pasta imaginable and sausages. It's crazy useful!\n\n&#x200B;\n\nETA: attachments rl distracted me mid sentence. lol",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 621,
                      "content": "The black one is probably from Walmart for $50. She’ll regret it when she’s buying her third replacement.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 298,
                      "content": "I don’t cook/bake much but if someone were to get me the same thing, I wouldn’t care if it was 1970s goldenrod and avocado. If I were the type to be concerned about coordinating appliances, it probably could have been exchanged for a different color.\n\nNow, too big for the kitchen, I get that. (We have to keep our air fryer on top of the fridge, because we don’t have a cabinet that’s tall enough to fit it.) (We have a weird kitchen.) That’s when you say “wow, this is really great. Thank you so much. I just don’t know where I’m going to keep it. They wouldn’t happen to come smaller, would they?” \n\nOP is TA.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I have a beautiful kitchenaid that I bought myself during a killer sale and honestly it’s too big for my current kitchen, but I don’t care.  It’ll last forever and it’s the one I wanted because I do a lot of baking and larger batch baking.\n\nBut if someone had gifted it to me and it wasn’t the colour I wanted and too big I’d at least ask if they maybe have a gift receipt to get a colour I want and maybe size down one model because WTF, that’s a lot of money someone spent.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 549,
                  "content": "Op sounds like the most spoiled person ever",
                  "id": 11,
                  "comments": [
                    {
                      "score": 294,
                      "content": "Exactly. I’d be damned if I ever spent that much money on someone and they just threw my gesture back in my face, especially without giving me the fucking gift back. I hope the dad gets his money back and never makes that mistake again. It’d be $10 gift cards for the next 5 birthdays.\n\nYTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "man if i was her dad i would consider myself a failure for having raised such a rotted fruit",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "When OP probably didn't live in poverty and doesn't know the meaning of value.\n\nThis was a gift from his dad for his apartment and his complaint is the color?? Idc if it was neon pink cause I'll be proudly using the mixer and thanking them for the gift.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Like wildly and childishly spoiled. Like cried because my Land Rover gift was white and not black at her 100000 sweet sixteen.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Yes! OP owes their incredibly thoughtful Dad a huge apology with some serious grovelling. \n\nOP - eat some humble pie and apologize to your father for being such an entitled AH who doesn't appreciate him. You probably really hurt his feelings. I feel awful for him and I don't even know him. \n\nOP - YTA",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "I read their post and went 'WTF grey goes with everything!' Plus a $700 Kitchenaid mixer is from their pro line. My mom and I have one and it's a powerhorse. \n\nThey could have also gone and traded it for another color; most places will allow you to do that if you have a gift receipt or something.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I don't even know *my own* least favourite colour, let alone other people's.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "YTA...Let's not even rake it that far. A simple, \"hey dad, love the gift. It's kinda big, think we could exchange it for a smaller one?\" Attempt to communicate with him. FYI, after a while, parents stop giving gifts..especially 700$ ones",
                  "id": 19,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Let’s hope this is this particular parent’s last gift to the spoiled child.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": ">thank you for the awards but please save your money\n\nThanks...been saving up for a stand mixer",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "What’s crazy is OP said they didn’t ask for it as if they didn’t want a mixer and then probably complained to their boyfriend so he would replace it, because why else would he replace that right after you got rid of the one your dad got you? YTA, $700 is more than some rent payments people make and you just decided to give it away? You sound entitled",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "“This was so thoughtful! One thing- I’d prefer a different color. Can we swap it out with the store for one that fits my kitchen better? Like maybe the Onyx Black model listed on every website that sells them?”\n\nYTA, OP.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "At the end of the day it boils down to one simple concept.\n\nOP thinks the world revolves around her and thinks that everyone/anyone should know her preferences and needs, and in turn should cater for them exactly, otherwise any seemingly kind gestures made towards OP are treated/considered as cannon fodder/trash/not good enough/whatever.\n\nOP needs to get over their self and apologise to dad. Spoilt and entitled is never a good personality.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I cannot imagine giving away a new 700 dollar gift because it didn't match my \"aesthetic\". Why not just exchange it for a different color or at least return it to the dad so he could get his money back. But also maybe I'm not modern enough to understand the logic of getting something of lesser quality and giving away one that will last years...again....over a color not matching your kitchen. This is like next level first word no common sense problems.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1235,
              "content": "I teach high school students. This is their mentality about everything. The prom dress their parents just dropped $800 on? Well it's not exactly the right shade of purple so I'm just gonna sell it on FB and use that money to get one that is a completely different color altogether...",
              "id": 26,
              "comments": [
                {
                  "score": 1168,
                  "content": "Honestly I think selling (or returning) the gift here and buying a more aesthetically pleasing mixer would’ve been far more considerate. Just handing away a $700 gift and then accepting a replacement gift from someone else feels especially entitled, above and beyond the ridiculous “I like gray the least” of it all.\n\nYTA, OP.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 525,
                      "content": "Or saying “Thanks so much dad, this is really thoughtful and I do need a stand mixer! It looks a little big for my place, could I maybe return/exchange it for a smaller one?” and then also getting it in a different color when you do so. YTA",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I guarantee that that mixer could have been returned and exchanged.  I have a Kitchenaid mixer and once you buy one, any question you have, customer service pulls purchase history.  I use my Kitchenaid mixer nearly everyday.  OP must not cook enough to understand the versatility and greatness of such a gift.  I made homemade egg pasta and meatballs yesterday in mine.  I make bread a couple times a week.  I have had it for at least 10 years and still going strong.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 312,
                  "content": "To say I'd be pissed is an understatement but I wouldn't be dropping that kind of money on a prom dress. I didn't as a teenager and I definitely wouldn't as a parent.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 214,
                      "content": "I did the math and I think the cost of every single prom and homecoming dress, plus my wedding dress for next year, came to $900. My students drop that on a single dress per event.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 287,
              "content": "As Dumbledore would say, accidental rudeness occurs alarmingly often.",
              "id": 32,
              "comments": [
                {
                  "score": 36,
                  "content": "Or like Voldemort said, keep the grey mixer, it could come handy someday",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Yes, she was and she knows it. If she didn’t she wouldn’t be posting here. She’s TA",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1590,
          "content": "Hates grey, but loves black. Totally consistant",
          "id": 35,
          "comments": [
            {
              "score": 757,
              "content": "I stumbled on that too. I’m also very confused how something can clash with grey and match black??",
              "id": 36,
              "comments": [
                {
                  "score": 738,
                  "content": "Tbf I hate grey and love black.  But that doesn’t mean OP is ok.  She’s a huge AH.  I mean, first a kitchen aid mixer is a dream!   I’ve had mine as a gift from my dear MIL for more than 30 years.  If she didn’t like the grey she could have told dad and exchanged it for a different color or a completely different mixer.  Seriously, I hope the friend is a good one, cause they scored and are laughing their ass off at how stupid OP is.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 677,
                      "content": "My dad bought me and a SIL each a KitchenAid mixer one year for Christmas. It's red, which I would have never chosen. As I came to realize the red is often on sale which is why he was able to do it but it was still incredibly generous. Which is why I now have a red teapot, red ceramic ware, red kitchen towels....🙂",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 306,
                      "content": "She clearly doesn’t know enough about baking/cooking to understand the difference between a standmixer and a KitchenAid",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 167,
                      "content": "My kitchenaid mixer was inherited from my great aunt who bought it in the early 80s. It’s avocado green and it’s ugly and I love that sucker so much. It’s bulletproof.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 153,
                      "content": "Yep. I understand wanting to fit an aesthetic - my mom loves red so a lot of her kitchen appliances/utensils are red. Including a KitchenAid stand mixer I got her about 20 years ago. We were together when I bought her but if I'd gotten the color wrong, she would've told me and we would've exchanged it.\n\nThis is just a lot of entitlement and kidlike thinking. I gotta wonder if OP has a good relationship with her dad.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 134,
                      "content": "I desperately wanted a red KitchenAid when I was younger.  My parents gifted me the basic gray one because they found it on sale and I still love that thing.  OP is an ungrateful brat who clearly doesn't do much baking.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "Exactly this I still have my Kitchen Aid 20 years later that my husband gave me.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "Literally.  To all of it. This OP is...something else",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 52,
                      "content": "Exactly. Why not exchange it for another size/color? Seems to be some underlying hostility towards Dad",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "My kitchen aid mixer was a wedding present...to my maternal GRANDPARENTS in the 1940s. New attachments still work. Mine's so old, it was in the museum Kitchen Aide used to have at their outlet store.\n\nBuilt to last forever!",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah why not just get vinyl wraps like this etsy page or repaint it. [https://www.etsy.com/market/vinyl\\_wraps\\_for\\_kitchenaid\\_mixers](https://www.etsy.com/market/vinyl_wraps_for_kitchenaid_mixers)\n\n&#x200B;\n\nI can't even cook worth a damn, baking I'm meh and even I'd appreciate that boss of a machine ha ha.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 86,
                  "content": "If it’s the color I’m thinking of, the entire thing is like a shiny metal (stainless steel?), not the actual color grey (which I believe they also do have). I don’t like it because it looks very industrial. That being said, I would have never done something so rude, omg. It’s so ungrateful and if it really bothered her that much, she probably could have exchanged it. I think the metal one may be more expensive than the other colorful ones too.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I have the full stainless steel one (it was a gift) and I didn’t expect to love the color, but I actually do! It’s a fun contrast with the rest of my more homey, cozy kitchen and the metallic finish goes with everything.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I am weird about colors, love me a cool grey, hate me a warm grey 🤣, love the blackest black. OP is still TA for how they handled it all, how entitled and bratty they sound and how dismissive they have been of their father's feelings. I lost my dad a year ago, and just want to give him a big hug and tell him that I appreciate him.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1297,
          "content": "And consider the price - if it cost $700 and was a KitchenAid, that means it was in their heavy duty or possibly even professional range.  That means grey was quite possibly the only color it was available in.",
          "id": 51,
          "comments": [
            {
              "score": 700,
              "content": "They're also really easy to paint (or have painted) if you don't like the color. There's whole businesses that run JUST on painting kitchenaids.",
              "id": 52,
              "comments": [
                {
                  "score": 324,
                  "content": "Or buy cute decals on Etsy!",
                  "id": 53,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Exactly. I got mine using visa points and it's gray, not my fav but hey, it works and it was \"free\"(not really). I saw some decals on Etsy that look great, I'll get one.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 191,
                  "content": "There was a huge Twitter thread a few years ago where people traded their KitchenAids to get the color they wanted. It was honestly delightful.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": "Mine is avocado/mint green from the 70s. Does it match my kitchen? Absolutely not. Am I keeping it? Absolutely yes.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Those are good standard! Last forever",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I have my mom's old mustard yellow from the 70's such a beast, Love it!",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 394,
              "content": "This is exactly why. I have a $700 kitchen aid mixer from the pro line, it only comes in grey.",
              "id": 59,
              "comments": [
                {
                  "score": 150,
                  "content": "I lost my kitchen aid mixer in the divorce, it might have hurt more than losing the dog. I asked for two weekends and one Wednesday a month visitation.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 70,
                      "content": "The only things I took (besides clothes) during my divorce: my dogs (I took and hid them first thing, he only mentioned them as an afterthought during the final divorce proceedings 🙄), a single le creuset skillet, and my kitchen aid mixer. I'm sorry... my giant, grey, ugly af, kitchen aid mixer. It is huge. I love that damn thing.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 93,
                  "content": "Wow! Now I would love to know if OP even cooks. Her friend got so lucky, that’s pretty cool\nfor them-I hope her friend loves cooking at least!",
                  "id": 62,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I don't think I could have accepted that kinda gift from a friend with out at least inquiring why they were just GIVING it to me.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "This!! Could’ve been the 8qt commercial. Holy crap what an amazing gift. Would’ve outlived her. And to think it’s probably replaced with some Amazon one 😭",
              "id": 64,
              "comments": [
                {
                  "score": 17,
                  "content": "And one that's probably plastic and has a motor that'll die the second it gets hot. I've got one of the old metal KitchenAids from my MIL (I guess technically, it's my husband's, it was given to him before we met... But it's mine now 😂 ) and it doesn't care. Dough, homemade pasta through the press, meat grinding, Thanksgiving dinner.... Totally fine.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 212,
              "content": "Yes! My daddy made my mom buy me this one (that I wanted) rather than the less expensive \"pretty\" ones when I got married. 34 years later I'm still using that mixer multiple times a month. And every time I use it I think about how sweet my (normally penny pinching) dad was to surprise me with it!",
              "id": 66,
              "comments": [
                {
                  "score": 93,
                  "content": "Nah, the man absolutely was a Penny pincher! It’s a lot cheaper to buy one QUALITY one versus several cheap ones.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 23,
                      "content": "An example of boots theory for sure.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I thought everyone knew that saying. It's one of those amazing life advice things, \"Quality is cheaper in the long run\" \"measure twice cut once\" \"slow is smooth and smooth is fast\"\n\nI mean has no one else ever heard of Same Vines' \"Boots theory of economic unfairness\" ?",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Would be true if it's smth he's gonna use himself.  \nAs a gift this is extremely generous from a penny pincher.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "I was wondering why they didn’t just exchange it, but that makes sense.",
              "id": 71,
              "comments": [
                {
                  "score": 15,
                  "content": "The thing is that she probably could have exchanged it for a cheaper model in the right color and she would have gotten some cash out of it too. So shortsighted. What a spoiled brat.",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Exactly!!  I was thinking the same thing",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 722,
          "content": "the part that got me confused is it's a kitchen-aid mixer if OP didn't like the color why didn't she just let the dad know love the gift, but can we exchange it for a different color because it doesn't fit with my vision for the kitchen. \n\nA big part of being an adult is to be able to solve problems through communication. Like it couldn't have been that much of an issue if OP had no problem letting the father know she gave it away.",
          "id": 74,
          "comments": [
            {
              "score": 391,
              "content": "Looking up the price point, the only $700 kitchen aid mixer that pops up, comes in two colors: gray and red. So dad got the most neutral option. That’s pretty thoughtful in the gifting process. Also, dad picked a top of the line version because he thought his daughter deserved THE BEST. \n\nAgree with not understanding how OP couldn’t  communicate both being thankful (nowhere in the post she says she was upon receipt) and the simple ask for a gift receipt just to exchange the color/model.  Also it seems easier and less expensive to do an exchange; plus OP could’ve picked up accessories with difference.  \n\nOP = YTA",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "buy a cover for it if it can't be exchanged",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 583,
          "content": "Somebody humble this spoiled brat. PLEASE",
          "id": 77,
          "comments": [
            {
              "score": 17,
              "content": "oh i am pretty sure that after the first 2 YTA she stopped following the thread",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 546,
          "content": "I don't even know my own least favourite colour",
          "id": 79,
          "comments": [
            {
              "score": 374,
              "content": "My least favorite is pink. Mostly cause I'm a woman and anything designated feminine is fucking pink. But if someone got me a neon pink kitchen aid mixer, I'd slap a Barbie sticker on it and display it on my counter. Or more likely, buy a cover for it in a color I like so I'm not assaulted by pink every time I go in the kitchen. Which is a good idea anyway to protect it from dust cause who uses it daily?",
              "id": 80,
              "comments": [
                {
                  "score": 139,
                  "content": "Dude. Slap a Barbie sticker on it - FREAKING GENIUS. I am stealing this idea.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 124,
                  "content": "Shit would get a pair of googlie eyes and a pet name too",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Ditto! I frickin hate pink, but when my mum didn't magically read my mind, and bought pink things, I still used them.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "This happened to me! My whole life, I was *not* a pink lady, for the same reasons.\n\nI found a local mother selling a cotton candy pink one that was only year old, plus a bunch of accessories and bowls for $25. Obviously, I could not afford to pass that up. Everything was pristine.\n\nThat was in 2019 and it changed my life! It changed my outlooks around cooking, the color pink and even how I want my house styled! (Which is a lot more “fun and colorful” than I’d realized.) Loving pink isn’t for all, but the experience was surprisingly helpful for my neuroplasticity.\n\nThe irony is that the mixer had been a gift for the seller’s daughter’s birthday. (She was probably 3 or 4.) They sold it when the little girl told her mom that she didn’t like pink anymore. I gotta wonder if somewhere down the line she’ll change her mind after encountering a similar detail on a luxury good.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I despise pink, though I like yellow and orange even less. But I got a pink K-A for a friend, it was a breast cancer model in that especially hideous shade Susan Komen stuff came in before the scandals emerged, she really wanted it so I sucked it up and paid the extra cash for the color/donation upcharge and it also came with a more powerful motor. A sweet machine!\n\nWe had a falling out before I could get it to her and our friendship ended. It was past returning by then. \n\nSo I gave it to a woman who dislikes pink and knew enough to hate the Komen foundation already. Guess what her reaction was? \n\nI'm still getting thanks over 20 years later and she has used it to teach her daughter to bake. Because it's a freaking KitchenAid stand mixer and they are awesome tools!",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "My family's first KitchenAid was breast cancer pink because my mom found it at a garage sale.  It's absolutely hideous but they're still using it.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 199,
              "content": "Orange, here. But if someone gave me an orange kitchen aid stand mixer I’d dance a little jig. Those suckers are expensive. I can’t even justify the expense to this day when a hand mixer still works most of the time.\n\nEvery time I see my cousin merrily grating blocks of cheese with her stand mixer grating attachment, though, I cry a little inside knowing I have to grate cheese like a peasant.",
              "id": 87,
              "comments": [
                {
                  "score": 29,
                  "content": "::blink:: there's a grating attachment? I was today years old when I learned this! Thank you!!",
                  "id": 88,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Same!  I am reluctant to keep reading this thread because I know I’m going to find more attachments I definitely don’t need, but absolutely want… to eBay I go!",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "It’s so satisfying to grate anything in a few minutes without losing knuckle skin.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My fiance bought me a mint one (because he's fucking amazing) as a combination Hanukkah present, Valentine's present, and birthday present. So worth it.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I hate beige. My MIL handed down to me her beige Kitchen Aid stand mixer. I’ve used it for over 20 years now and lord only knows how many years she used it before that. Those things are heavy duty, amazingly high quality machines, and I appreciate it every time I pull it out. OP is YTA for being so ugly and breaking the heart of a dad that spent a lot of money on something he thought she’d love. Yes, a gift is yours to do with as you wish but…c’mon. Don’t be a petty little dick, OP.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "TBH I think this whole thing is a nonsense way of looking at color. colors don’t exist on their own, they exist in context. your least favorite color in one context is something you’d love in another",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 466,
          "content": "[deleted]",
          "id": 94,
          "comments": [
            {
              "score": 233,
              "content": "I don't even know my own favourite least colour",
              "id": 95,
              "comments": [
                {
                  "score": 10,
                  "content": "I don't even know my own *favorite* color.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 133,
              "content": "Lol apparently OP is so boring that their least favorite color is also a personality trait.",
              "id": 97,
              "comments": [
                {
                  "score": 23,
                  "content": "But really how can someone hate *gray* so much that they give away a $700 gift? Like, of all colors they hate one of the most neutral lol\n\nIt's like saying water is the drink you dislike most",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I guarantee your 4YO's least favourite colour changes every 7 minutes.",
              "id": 99,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 200,
          "content": "They also make sleeves and decor for the stand mixers I think? Also a quick call “hey do you still have the receipt for this? I appreciate it but it’s a bit big for my space and I’d prefer a different color. I love the gift but maybe we can go and exchange it for something a bit more me”. \n\nStill would have been a bit rude but much better than just tossing it out because you didn’t like the color?",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "God, my dad, who I know loves me unconditionally, can’t remember if I take milk in my coffee and I’ve been drinking coffee for 20 years. Expecting someone to know your least favorite color is wildly unrealistic.",
          "id": 101,
          "comments": [
            {
              "score": 23,
              "content": "How do you even know someone’s least favorite color from being OBSERVANT. Like does she  have one item in every possible color EXCEPT grey?",
              "id": 102,
              "comments": [
                {
                  "score": 10,
                  "content": "The only reason my parents know I hate orange... It's my sister's favorite color. So if anything is left at their house and we've both been there recently, and it's orange... They can safely assume it's hers.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "Agreed. OP is 100% on another planet. Who just flippantly gives away a gift worth so much? If it was 50$ ok fine, if you don’t like it give it away but everyone knows stand mixers can be HELLA expensive ..  just reeks of entitlement and ungratefulness. \n\nOP is definitely TA",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22178,
      "content": "YTA.  That mixer comes in like fifteen different colors.  I’m sure your dad would have exchanged it for a color you like, including black, if you had used your words.  I bought my twenty year old two pieces of Le Creuset for her first apartment. One piece she loved the color and the style, the other she liked the color but not the style.  So you know what she did? She used her voice, told me she didn’t know how much she would use that piece and we got something different.  Simple huh? No misunderstanding, no hurt feelings.  I’d be embarrassed if you were my kid.  It’s not the fact that “it’s a gift and my choice”.  This isn’t a Walmart gift card.  YOU chose not to communicate and hurt your dads feelings.  Bet he won’t make any thoughtful gestures again.",
      "id": 105,
      "comments": [
        {
          "score": 2245,
          "content": "Love le creuset! Great gift!",
          "id": 106,
          "comments": [
            {
              "score": 1458,
              "content": "[deleted]",
              "id": 107,
              "comments": [
                {
                  "score": 459,
                  "content": "As a 40-year-old who also loves cooking and that particular brand. I'm here to tell you to find an outlet or look on Facebook marketplace/ Poshmark/ Mercari because a lot of people buy that stuff and then resell it or get a gift in a color they don't like. Just make sure if you're not buying it in person you see a picture of the inside to verify it's not ruined.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 85,
                      "content": "100% agree with this.  I have one DO in a shade of purple I love.  I had to hunt to find it but got a great deal.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Oh yeah, I got an amazing Staub cocotte in deep blue with a lily design on the lid just from being patient on ebay for a few days. There's SO MANY enameled cast iron pots for sale in so many beautiful colors as long as you don't get too picky about wanting full matching sets.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Great tip! I almost bought a Le Creuset Dutch oven through Craigslist for $20. I thought I was getting a crazy deal until I asked for a picture with the lid off and there were huge chunks of enamel missing on the bottom. She claimed it was “easy to refinish them.” Nope!",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 161,
              "content": "My mother used to get it for me despite my telling her that I couldn't take it back home on the plane because of the weight. I used to exchange it for things I liked, and she cut the labels off to prevent me doing that and continued giving me le crueset stuff. That's when giving a parent's gift away is justified.",
              "id": 112,
              "comments": [
                {
                  "score": 117,
                  "content": "I had a friend who was constantly getting in fights with her mother (it's very easy to do), because her mother wanted her to take things home that her mother didn't want, but didn't get want to get rid of.   I asked how often her mother visited her house, which was virtually never, and would she see if all these things were there.   Since it was unlikely her mother were ever know, I suggested that she accept everything and go home via the dump, where there is also recycling.   She had a better idea and went home via her favorite thrift store where she donated them.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "My brother and I go through the same thing when going to visit our own mother. (\"Gosh Mom, that's really thoughtful, but my carry-on only has so much room...\") This year it was tins of the nephew and nieces' favorite Christmas cookies. (\"I couldn't let you leave without the candy canes, they're DJ's favorite!\") My brother grumbles as we pile into the car on the way to the airport, how there's not any room, and we laugh, you know this is just how she is, it's to be expected.\n\nLater that day I get a text from my sister-in-law: they were stopped and held up at security because the cookie tins set off the detectors! My brother about blew his top. So now our defense will be (and I invite anyone else to use it): sorry, it's a national security risk.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Thank you!  She loves them!",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 656,
          "content": "Not all the mixers come in other colors. I’m betting since it was $700, it was from their commercial line which only comes in dark grey. So he gifted her a really awesome mixer.\nEdit: TIL the commercial mixers now come in other colors. They did not when I bought mine.",
          "id": 116,
          "comments": [
            {
              "score": 473,
              "content": "Yeah she downgraded on quality for sure. As far as I know the pro line is either steel or empire red\n\nEdit: a quick peak at the KitchenAid website says that 700 won't get you the commercial grade, but will get you a pro line. Which is red or white. Unless he got it on big sale",
              "id": 117,
              "comments": [
                {
                  "score": 299,
                  "content": "Or he spent even more than OP thought.",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 121,
                  "content": "I have a pro line in grey. 8qt. I believe. Spent like $750 10 years ago. It’s AWESOME.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Let's hope she doesn't ask for a blender and throws away the Vitamix he gives her next year.",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I have one in copper. LOVE it. It was $950 like 12 years ago but I got one that was refurbished from KitchenAid’s website for half the price. LOVE LOVE LOVE it.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 52,
              "content": "This. The higher end ones are very limited in colors, and some are out of stock at times, especially if it was on sale. We have a red pro-line one, because that was the only color they had left during a $100 off sale.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "yes the silver one is from the professional line and much more money than the $350 she settled on because it was black.",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 123,
          "content": "No kidding. People want gifts to be enjoyed and used. It’s a lot less hurtful to have someone say “I love the thought but this doesn’t fit my decor / needs / etc” and swap it for something they’ll use and enjoy than for them to fake smile and then give it away behind your back.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Was it French gray or mineral blue? 😹",
          "id": 125,
          "comments": [
            {
              "score": 63,
              "content": "Hahaha no.  It was a griddle bottom and a mint color she does like. She’s vegetarian and couldn’t really think of much she could cook in it.  It was a valid point.",
              "id": 126,
              "comments": [
                {
                  "score": 52,
                  "content": "Good because French gray makes me wanna barf. \n-Detective Jake Peralta",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Honestly a griddle bottom on enameled cast iron is just silly to me, even for meat. It’s best when you want that lil bit of fond for a pan sauce, or for everything you’d use their Dutch ovens for.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Those are cool gifts! Also, kudos for raising a kid that manages to deal with disappointment in an adult way.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I’m just aghast at the idea of being gifted a KitchenAid and giving it away - not exchanging it, not even selling it (if unused they sell for almost full price anyway!), just giving it away… it’s so incredibly ungrateful. \n\nI had a second hand KitchenAid years ago and I had to swap for it for ugly Kenwood Major Pro for my work at the time. As soon as I’m in my new house I’m getting myself a beautiful new KitchenAid. Maybe some ungrateful kid will give me one!",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I honestly think the giving it away part is the worst part, like it was just ‘trash’. She could have tried to return it for store credit at the very least?! Your bf sounds weird that he caved to your whinig that it was the wrong colour and bought you a new one too- such spoilt brat vibes.",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9509,
      "content": "YTA He got you a very thoughtful and expensive gift and you just gave it away because it doesn’t match your stuff. Okay. Could have maybe told him up front you wouldn’t use it so he could get his money back. I can understand if you didn’t want to hurt his feelings doing that so let’s just skip past that part. Down the line when he asks about it you lash out at him and make him feel like he doesn’t know you or care enough to learn what you actually like and basically ANYONE else would have known that you would HATE that gift. After he got you such a generous gift? Really??? What a spoiled brat.",
      "id": 132,
      "comments": [
        {
          "score": 2484,
          "content": "I’m personally hoping it’s the last gift he bothers giving her over $25",
          "id": 133,
          "comments": [
            {
              "score": 1132,
              "content": "Based on any of her responses, dad should never buy her another gift.  I can’t even imagine how dad felt when OP  went off in how  unobservant dad is to not know that grey is her least favorite color.",
              "id": 134,
              "comments": [
                {
                  "score": 481,
                  "content": "Yeah, but her awesome _boyfriend_ bought her a _cute little_ black one, so that should make the dad feel better!",
                  "id": 135,
                  "comments": [
                    {
                      "score": 369,
                      "content": "I’m gonna bet that *cute little* black one cost a fraction of the price (I’m thinking under $100) and is going to break within a year.",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "I really would love to know how this came to be. Did her boyfriend just buy it for her to shut her up? Does he have a hero complex? Did he legit thjnk she was wronged? I’d love to hear the conversation(s) that led to him buying this “cute little mixer.” Absolutely any boyfriend I’ve ever had would have been appalled at that behavior, and quickly talked some sense into me.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 201,
                  "content": "OP has got it in her head everyone memorizes every little comment she makes as if she is the center of their universe. Knowing peoples least favorite color is not common knowledge.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 36,
                      "content": "What's crazy is that she loves black.  Grey is a shade of black.  If I knew someone loved blue, I would get them something that's blue, be it cyan or denim.  Dad probably knew she liked black but didn't realize grey was gravely unacceptable.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Also it's a mixer, it's not a fucking pillow couch. Who cares about the color as long as it's high quality?",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 682,
              "content": "I'm praying OP will get nothing but $15 Walmart gift cards from her dad from here to eternity. If she ever marries it can be a $150 gift card, a real splurge\n\nYTA OP good lord, in many ways but especially the INFURIATING \"if you'd been more observant\" bit. You sound obnoxious, bratty, ungrateful, self-centered and callous, to be honest.",
              "id": 141,
              "comments": [
                {
                  "score": 104,
                  "content": "If she ever marries it can be a $30 gift card. That’s all the splurge she deserves.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 9,
                      "content": "$15 for her and $15 for him.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 356,
          "content": "Agree.  Do you like baking OP?  If so, that is probably why your Dad got that stand mixer for you.  You went out of your way to hurt and guilt trip your poor Dad who was only trying to get you a gift.  I can only think of one word for this kind of behavior:  ingrate.",
          "id": 144,
          "comments": [
            {
              "score": 449,
              "content": "I imagine if she liked baking she would have understood the value and thoughtfulness of the gift he got her. Never in a million years could I imagine being so rude to someone in relation to a gift they got me. OP is an inconsiderate AH.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 198,
              "content": "No way an actual baker would get rid of this mixer. These things are life goals. I'd be surprised if OP even cooks.",
              "id": 146,
              "comments": [
                {
                  "score": 26,
                  "content": "The way she described it not fitting the aesthetic, I agree.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yeah she sounds like my aunt who has one but it's essentially decor for her kitchen and has never been used.",
                  "id": 148,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "OP is a spoiled brat. Definitely YTA",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "she doesn't like baking. she just wanted a mixer to look like she did.",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 152,
          "content": "She went and got the same thing in a different colour!! He got her something she wanted just not in the right colour/size. Extra spoilt brat. As other posters have mentioned she could have thanked him and asked if it was possible to change it for another colour! Besides anything else, is the colour even that important?? YTA",
          "id": 151,
          "comments": [
            {
              "score": 254,
              "content": "The $700 one only comes in grey. Dollars to donuts her boyfriend bought her an $80 one from Amazon that will be trash in 6 months where the $700 one would have probably been able to be inherited by her kids if she ever decides to have any.",
              "id": 152,
              "comments": [
                {
                  "score": 91,
                  "content": "I literally use the stadmixer my parents were given for their wedding over 50 years ago.  does it take up a lot of space? sure. its 50 years old, its big.  does it have *every* attachment under the fucking sun and an absolute godsend for my gluten free baking?? OH YES.  it has *never* broken down, never had an issue, I can still get new attachments (mincing, pea popping etc) and that thing will go to my friend's kids when I pass if it's still going (don't have my own).  if you buy quality, you will never buy twice.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I use the kitcheaid mixer my grandma got as a wedding gift in 1952. It’s over 70 years old but it’s a work horse and still works perfectly.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "Was JUST going to say that. I'm so glad that stand mixers are more accessible to people now, but the two models are NOT the same. I fully expect to have my grey one forever",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "It literally isnt..the color of my kitchen aide has never affected the mixing.\n\nHers only fucked with her aesthetic. Which is a word I've come to despise.",
              "id": 156,
              "comments": [
                {
                  "score": 8,
                  "content": "I'm a goth who loves everything in black and I'd be over the moon if someone gave me a *pink* KitchenAid.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "For real...as a child of two self-centered, narcissistic, asshole parents, I would love to have a dad who tried to be so thoughtful. It breaks my heart to think of how hurt he was by what she said.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5983,
      "content": "YTA. Your father gave you a gift that for the last decades has been the gold standard of kitchen appliances. This is an extremely thoughtful gift and meant to last you your lifetime. He probably thought this was the mixer you would take with you to your marriage and use when baking for your children. \n\nYou should have thanked him and explained that the color/size did not fit your taste, and to exchange it to something you would appreciate. \n\nYou sound really ungrateful to be honest.",
      "id": 159,
      "comments": [
        {
          "score": 1673,
          "content": "Honestly, I desperately wanted a stand mixer but it was painfully out of my budget. My brother called me one day, his MIL was moving into a seniors apartment and wouldn’t have room for her stand mixer, did I want it? I immediately said yes without even considering what colour it was. Turned out being white which is the LAST colour I would have picked but it was free and it’s glorious and a total point of pride in my kitchen.",
          "id": 160,
          "comments": [
            {
              "score": 559,
              "content": "Have you seen stand mixer decals/stickers? I got my mixer when I was young and my tastes were different, but I found some decals that really helped it blend in better with my current kitchen. They're vinyl so you can still wipe them down and everything and they're only about $15 generally.",
              "id": 161,
              "comments": [
                {
                  "score": 155,
                  "content": "I have not seen those! Will have to look into them. Thanks!",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "I decal-ed my stand mixer and it looks **fucking glorious**!!!",
                  "id": 163,
                  "comments": [
                    {
                      "score": 23,
                      "content": "we need a thread showing these off LOL",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Man OP could have just decaled her mixer black, then she'd still have the super nice one... damn",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "I got my white one for $100 off cuz it had a tiny mark on one side. It's the only reason it was in my budget, I was shopping for a different brand. Not at all the color I would choose otherwise - SUPER happy to have it!",
              "id": 166,
              "comments": [
                {
                  "score": 9,
                  "content": "Sears used to sell damaged or returned appliances on the cheap. I picked up a white mixer hella cheap because it had a small dent in the bowl. I could care less, I gots me a mixer🙌",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "My parents received a white kitchen aid as a wedding gift over 25 years ago. It no longer matches their kitchen but she still works just as good as when they bought it. They’re such a smart investment, I’d love if someone gifted me one.",
              "id": 168,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "[deleted]",
              "id": 169,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 140,
          "content": "Agree!!\n\nI have two kitchenaid mixers. One was a gift from my boyfriend (now husband) over a decade ago because he knew how much I loved to bake and up until then I mixed everything by hand - according to him, my apple blondies are 99.3% of the reason he married me 😂 he bought me a second one two years ago after we had our fourth little one and we knew one mixer wasn't cutting it when I would make cookies for the week or do up fresh bread, etc...\n\nYTA, op. Big time.",
          "id": 170,
          "comments": [
            {
              "score": 22,
              "content": "Ooh please tell me more about these apple blondies!",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Apple Blondies sound glorious!",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "This is the comment I was looking for. There's a reason they haven't modified the mixer in ever. They got it right the first time. I'd love to get one as a gift. Thankfully my wife already had one before we got together",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "My 20 year old kitchenaid JUST burned out the worm gear. My husband thought I'd immediately buy a new one but for $50 you can just replace the gears with a kit from Amazon.  Here's to another 20 years.",
          "id": 174,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4208,
      "content": "YTA over color? Why didn't you just tell him you want to exchange it for a different color",
      "id": 175,
      "comments": [
        {
          "score": 710,
          "content": "I also know plenty of ppl who have found creative ways to paint their kitchen aides. They last a long ass time and don’t always match if you move or change colors in the kitchen. But they are so versatile. It’s easy af to fix.",
          "id": 176,
          "comments": [
            {
              "score": 743,
              "content": "OP when someone doesn’t know their 37th favorite color and 573rd favorite animal:\n\n“I thought they loved me”",
              "id": 177,
              "comments": [
                {
                  "score": 37,
                  "content": "I chuckled because it's true",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "When I was getting married I had the more expensive grey one on my registry. My best friend asked if I was attached to that size& color because the smaller white one was on sale at Kohl's and she wanted to get me one. I said absolutely fine and then found fun decals to decorate it. OP sounds so spoiled.",
              "id": 179,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "And there are so many ways to change the color of it, depending on how crafty you are. Anything from spray paint to vinyl. I bet an automotive body shop would paint it. All else fails, get a cover for it in whatever damn color or pattern makes your narcissistic heart happy. YTA.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "There are even skins for them you can buy on Etsy.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "The first thing we did when we got a Cricut was to make a vinyl cutout of Mr. Game & Watch (in his Chef mode) to decorate our KitchenAid",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "OP is just dumb as a rock",
          "id": 183,
          "comments": [
            {
              "score": 23,
              "content": "Dumb and spoiled af",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "Because then how could she prove her point about what a terrible parent he is! /s",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "A 700 dollar gift at that.",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3403,
      "content": "YTA x100.  If you didn't like it, you should have given it back so he could return it.  You just threw away 700 bucks of his because you didn't like the color.  You sound incredibly ungrateful and spoiled.  I'd be ashamed if you were my kid.",
      "id": 187,
      "comments": [
        {
          "score": 645,
          "content": "I mean, she could have also exchanged it for a black one. 🤣 Maybe told dad , “Hey, I like it, but just not the color. Do you have the receipt so I can get a different color?” And OP said boyfriend got “a cute black stand mixer” that fit into her apartment better. So I understood that as a completely different stand mixer than the one her dad got. Either way, she could have also exchanged the gray stand mixer for the “cute black one”. She had options.",
          "id": 188,
          "comments": [
            {
              "score": 201,
              "content": "Yeah I think I have the model that get dad got her, and I wouldn’t trade it for something cuter that didn’t work as well! It’s not about the aesthetics!My husband got it for me the first year we were dating and I was beyond delighted, even if I also didn’t love the color! It’s been a game changer in the kitchen.",
              "id": 189,
              "comments": [
                {
                  "score": 241,
                  "content": "plus she just gave a INSANELY expensive mixer to a friend for FREE, like that would bother me if I was the father.",
                  "id": 190,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I fear she’s gonna contact ‘friend’ and say ‘you gotta give it back or pay me $700 cos my dad’s mad! Sorreee! Kthxbyeeee!’",
                      "id": 191,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I wish I was the friend. Who wouldn't love a KitchenAid as a gift",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "At that price range it was definitely something in the Pro series with a bowl-lift instead of the far inferior tilt-head models. I have a thing for watching cooking shows from the 90's like Great Chefs and I can't count the number of times that I've seen the bowl-lift models being used by some big name chef in the back of their kitchen.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Same here. My partner bought me the Pro mixer for Christmas a few years ago. It’s grey. I love it! He even got me a couple of the attachments. He did his research, and got me the bigger one, not because I bake a lot, but because the reviews on the motors said the smaller ones might not hold up as long. It holds a special place on my counter, and I’ve even learned to make butter!",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "\"cute black stand mixer\"= likely the cheapest one at Target. Her dad wanted to get her something nice, that would last forever and chose a neutral color most normal people wouldn't bitch about. Guarantee you the BF didn't spend $700. OP is immature, ungracious and I hope she's stuck getting $20 Amazon gift cards for her birthday for the rest of her life.",
              "id": 195,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 441,
          "content": "OP, think about your dad's gift in terms of how many hours of work it took him to earn $700 (post-tax). Even if you don't consider how thoughtful he was being (btw, that's an awesome gift! My KitchenAid is my most used and most loved appliance), that's a lot of effort to purchase that. You threw away all that effort over a freaking colour choice instead of having a conversation about exchanging it for black. \n\nYou were thoughtless and hurtful. YTA x 100 is right!",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "And made bf spend another $700 for a black one",
          "id": 197,
          "comments": [
            {
              "score": 246,
              "content": "100% bf bought the cheaper tilt model for $350",
              "id": 198,
              "comments": [
                {
                  "score": 317,
                  "content": "There is no way the replacement was even that. It was probably some off brand piece of junk.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Probably right. Ugh, this post was so upsetting for me. I'd have gladly taken OP's stand mixer. Lol",
                      "id": 200,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "YTA x700 if you ask me!",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "15 years ago my grandmother bought my sister and I each one of the large grey Kitchen Aid stand mixers. I don’t know if it is the $700 version but it doesn’t tilt, the bowl lifts and lowers with a little crank lever. \n\nAnyways, my sister called my grandmother and expressed that she was very grateful, however it was just too big for her to store in her apartment or keep in the countertop. She asked my grandmother if she could return it and get the smaller one in white. Grandma was more than happy to accommodate her reasonable request. \n\nI kept my grey one and use it every week on pizza night. Miss you Grandma!\n\nIf OOP were a considerate and caring person, they would have acted more like my sister.",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2399,
      "content": "Jesus YTA.\n\nYou threw away…. Sorry, regifted, somehow even worse….what sounds like the commercial grade, keep it for the rest of your life kitchen aid over the color?\n\nAfter you realize how stupid that was, then realize how petty that was. Then realize how insulting it was to your father.\n\n\nEDIT to add: I have the exact model I suspect your father gave you. It was a gift for our wedding from my in laws. 26 years ago. And nothing else has stood the test of time, nor been so utterly useful as we learned to cook and bake and make pasta and……good lord you did a stupid, too young to know better thing.",
      "id": 203,
      "comments": [
        {
          "score": 713,
          "content": "I feel like op doesn't cook. If someone got me a kitchen aid stand mixer I would be over the moon. I actually inherited one from my grandmother and it's been one of the best and most useful pieces of cooking equipment I own. I couldn't fathom just \"giving it away.\" NGL I clutched my pearls lmao.",
          "id": 204,
          "comments": [
            {
              "score": 197,
              "content": "I mean she cooks enough to get her boyfriend to buy her another stand mixer.",
              "id": 205,
              "comments": [
                {
                  "score": 329,
                  "content": "Was it because she would use it, or it was cute and makes her look like she cooks?",
                  "id": 206,
                  "comments": [
                    {
                      "score": 71,
                      "content": "Right? The replacement criteria was \"cute\" and \"small\" but mentions *nothing* about actual specs or utility.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "THIS^",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 144,
                  "content": "nah, it feels like a kitchen accessory who's primary function is to match",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "A smaller, black one. I'll bet money it is a different brand and it breaks in 6 months. No warranty.",
                  "id": 210,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah she didn’t specify brand at all.  Just small and cute",
                      "id": 211,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "My old roomie's lilac kitchenaid was too big, took up half the counter I used to use for lunch prep, an awful color against my black&warm decor, and shook the counter when in use.\n\nI was utterly thrilled to have that little monster in my house and I'd kill to have another.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I think We all just bought pearls simply so we could clutch them after reading this...",
              "id": 213,
              "comments": [
                {
                  "score": 22,
                  "content": "It would be in the same vein as getting a set of le creuset pans, turning your nose up at the color, and replacing them with a set of aluminum nonstick.\n\nAlso gray is a neutral just like black. It's not like it was electric pink.\n\nPain 😭",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "This. I have wanted a KitchenAid mixer for years but I won’t put it on any Christmas or birthday lists because I would hate for someone to spend that much money on a gift. If I did get one, I would cry happy tears so hard that I wouldn’t be able to tell you what color it was 😂",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My mom got me one as a gift a couple years ago during Black Friday sales. Hers has stood the rest of time for 45 years and mine for about eleven years. Those things are truly amazing.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Bet the friend couldn’t believe their luck.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Same thought! It's on my list and those things last forever.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "My sister got a Kitchenaid mixer as an anniversary gift from her ex-husband about 15 years ago, still going strong. When they got divorced she joked that he could have the house and the kids but leave her stand mixer alone lol.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "At that price, I'm thinking Commercial as well.  I had to replace a worm gear on ours after about 10 years because my MIL made a dough wrong that was stupidly tough.  Based on what I hear at the kitchen at times, we would have burned up the motor on several of these cheap mixers if we didn't have the Commercial one.  I can live with replacing a gear and regreasing every 10 years for a good product that replacement parts are easy to get.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": ">too young to know better thing.\n\n23 yr old here, I would absolutely melt if someone gave me a stand mixer! Do I have room for one? Oh not by a long shot! But I would absolutely love it regardless!",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This has nothing to do with age. Absolutely zero. She’s a brat at almost any age above 5.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Op is going to wake up at 35 and realize what she threw away. There are lots of people who would kill for a nice piece of equipment like that. Regardless, yes, she's def the AH.  I hope he father never gives her anything better than $20 gift cards for the rest of her life.",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1383,
      "content": "YTA  \n\n>the truth (namely, that I thought the grey was ugly  \n\nYou may not like the color, but you were ungrateful for the gift.   You should have told him as soon as you received the gift that the color wasn't one you would be able to live with, and you should have exchanged it for a color you liked, or for a model that was smaller, if that was also an issue.  \n\nYou handled the situation rudely.    \n\n>I honestly wasn't trying to be rude, I was just stating a fact.   \n\nJust because you were being factual, it doesn't mean you weren't being rude.    \n\n>I said if he would have been more observant, he would have known that I absolutely hate the color grey (it's my least favorite color) and everyone in my life who knows me knows that    \n\nThat hurt him.   \n\nThe world does not revolve around you.  Even though some people in your life may know you don't like the color, not everyone is hanging off every peep that comes out of your mouth and storing your comments for future reference.   \nSomehow your dad missed the detail that you don't like grey.  \n\nYour mom is right.   Apologize to your dad.",
      "id": 224,
      "comments": [
        {
          "score": 628,
          "content": "He probably was trying to go for a neutral that would match anything. Poor dad",
          "id": 225,
          "comments": [
            {
              "score": 377,
              "content": "He went for top of the line commercial or pro lines, which only come in gray and last a lifetime. The cutesy color ones have the tilt arm, less power, and less capacity. She upgraded color but downgraded quality.\n\nOnly someone who cares more about looks than baking would make this choice. \n\nYTA for wasting a thoughtful gift from your father. Poor dad indeed. You need to apologize.",
              "id": 226,
              "comments": [
                {
                  "score": 18,
                  "content": "You don't have to only have gray if you don't want a tilt head. My Pro600 came in many colors, including black, white, red, blue and the one I have, an awesome gunmetal blue.",
                  "id": 227,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I stand corrected! I realize that I've had my KA mixer for a decade now, and my research is outdated. I may have just been looking at the commercial ones back then that were only in gray.\n\nToo bad OP didn't trade in for a better color. It will probably be a regret down the road if they ever get into serious baking. Gunmetal blue sounds awesome!",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 83,
              "content": "You're right.   Grey goes with a lot of decor.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Laughing my butt off at that tho... What kind of decor does Black go with that Gray will clash with? Those colors go with everything!!!!",
              "id": 230,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This was my thought as well.\n\nApparently OP's mom also didn't know about this grey thing or she would have told the father. But I suspect OP is just like ALL of us when we were young and we didn't really talk to our parents much at that age. *Favorite* color, maybe but I doubt many of us would have told our folks \"Hey, pops, you know what color I really detest? Red?\" (and that's only if I had to name a color I prefer not have at that age, mostly because it was everywhere).",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "You laid this out so perfectly, I hope OP is taking notes.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I feel so bad for the dad:( he was just trying to do something nice for his daughter and probably thought it would connect them. I cant even imagine treating my dad this way.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "It makes me want to cry imagining ever talking to my dad like that, much less over a kind and VERY generous gift from his heart. Holy moly. Blown away by this brat.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Honestly, the line that shocked me most in the OP was \"I don't think that's necessary.\" \n  \nHow can anyone have this attitude about apologizing to someone? Compare that to supposing you don't think an apology is warranted. People think that all the time, and they're often right. \n  \nBut that an apology isn't \"necessary?\" \"Necessary\" to what? To mollify her dad? If so, that implies a cold-hearted calculation and judgment.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 797,
      "content": "YTA \n\nThose mixers are really expensive. But that's not even the point. He gave you a gift that he hoped you'd like and you just gave it away without a thought? If you didn't like the colour why didn't you ask him to exchange it?",
      "id": 236,
      "comments": [
        {
          "score": 98,
          "content": "OP didn’t want to bother with the logistics of exchanging it.",
          "id": 237,
          "comments": [
            {
              "score": 14,
              "content": "OP was annoyed that she isn’t the center of everybody’s universe such that they don’t know her least favorite color as a 24 year old adult",
              "id": 238,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Why actually talk with your family when you can carelessly toss away their thoughtful, expensive gifts instead?",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 670,
      "content": "YTA \n\nBIG TIME!\n\nKitchenAid products are hella expensive but worth it. They literally last for 100 years or more! \n\nYou could have asked your dad to exchange it for a smaller one and a different color. \n\nYou are extremely cold, ungrateful and apathetic towards your own dad. I feel so bad for him.",
      "id": 240,
      "comments": [
        {
          "score": 270,
          "content": "My kitchen aid mixer belonged to my mother in law and I got it when she died.  It’s from the 80s and still runs perfectly.  I use it all the time.  It doesn’t match a damn thing in my house but I was so happy when my sister in law offered it to me as she already had one.",
          "id": 241,
          "comments": [
            {
              "score": 73,
              "content": "Now, that's exactly what the definition of grateful is!! What a wonderful comment! I envy you having that mixer. I love mine but yours is so more special. \n\nOP, are you listening?",
              "id": 242,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I inherited my mom’s from the 80s and it doesn’t match a thing in my kitchen, and I still wouldn’t give it up as it is a workhorse.  I’ve made everything from marshmallows to pasta with it and would never give it up, just because I don’t like the color.",
              "id": 243,
              "comments": [
                {
                  "score": 9,
                  "content": "I kind of like the \"stuff that doesn't match\" that I inherit from relatives. It's just a nice sentimental reminder and makes me smile",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I inherited mine from my mother and it's beige and hideous and I'd never have picked this one out, but it's 35 years old *at least* and has been beaten to hell and back and it still works like a charm (and it also spends its down time under a dustcover, so extra reason not to care about the color). It's going to outlive me.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}