{
  "post content": "I know it seems like I suck.\n \nYesterday, I asked my fiancée what her Mac password was. She had some financial documents there. She took the laptop, typed the password, and gave it back to me. I got slightly pissed. I shared my passwords with her; why doesn’t she do that to me?\n \nSo, I went to my computer, which she probably uses more than me, and I changed the password. The next time I used it, I asked her to go outside the room so I can type the password. Then she got mad. I told her that’s how I felt when she did the same thing. She told me it’s different because that’s her laptop but this is our computer. Which it is not. I bought it before we were together, and I regularly upgrade it.\n \nSo, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 239,
      "content": "ESH. Act like adults and communicate or your marriage is gonna be a crazy circus",
      "id": 2,
      "comments": [
        {
          "score": -87,
          "content": "Communicate? What’s that. But seriously, we’re definitely working on that.",
          "id": 3,
          "comments": [
            {
              "score": 52,
              "content": "don't be passive aggressive, share your feelings or you will just be TA because she won't know why ur being weird. and vice versa. just be upfront it don't have to be a deep issue if you just talk",
              "id": 4,
              "comments": [
                {
                  "score": -42,
                  "content": "101%",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "How exactly were you working on it when she did something that upset you, and instead of communicating with her, you chose to passive aggressively change your passwords and then make sure she knew by being passive aggressive and asking her to leave the room?",
              "id": 6,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 94,
      "content": "YTA because you're being passive-aggressive instead of communicating with your wife. \n\nYou could have **asked** why your wife didn't share the password with you. You could have **expressed** how her choice to keep the password hidden made you feel and why. You could have **assumed the best** in the woman you've chosen to marry, realizing that she may have beliefs about privacy that aren't personal or about you. \n\nInstead of doing those mature, adult things, though, you acted like a child, and created a situation where you could *punish* your wife for her completely benign and reasonable decision to keep her password to herself. \n\nGiven that keeping a password secret is wholly conventional behavior, and being passive-aggressive is entirely dickish, YTA and not E-S-H.",
      "id": 7,
      "comments": [
        {
          "score": 14,
          "content": "I agree. If you have a long, complicated password, sometimes typing it yourself is purely practical. I hate the whole “no m, like for Mary” conversation.",
          "id": 8,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "[deleted]",
          "id": 9,
          "comments": [
            {
              "score": 30,
              "content": "> I know I messed up, but I did the exact same thing to her. \n\nYou created the situation, though. Wife did thing that unintentionally hurt you. So, you *deliberately* did a thing to hurt her to teach her a lesson. That's the distinction. You didn't change the shared password for any reason other than to get even / teach her a lesson. \n\n It's not about the issue of why your wife is keeping her password secret - it's about how you chose to be passive-aggressive instead of getting to the bottom of the issue. \n\n>Given that keeping a password secret is wholly conventional behavior, and being passive-aggressive is entirely dickish, YTA and not E-S-H.\n\nWhat about that does not make sense? Keeping a password secret is normal, expected behavior. Deliberate passive-aggressiveness is not normal, expected behavior. Because we don't know why your wife is keeping her password to herself (because you didn't ask her) we can't assume that she's TA, because by default keeping your password to yourself is normal. Therefore, YTA and not E-S-H.",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "And here you are going, \"If I'm wrong she has to be wrong too!\"\n\nGenuine question: Do you like your fiancee?\n\nIf you do, you're very much not ready for marriage, since your response to \"Yes, you are wrong\" is \"BUT SHE HAS TO BE WRONG TOO!\"",
              "id": 11,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It makes perfect sense. And no what you did is not the same thing.",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 40,
      "content": "ESH. You guys need to find common ground / trust with each other.",
      "id": 13,
      "comments": [
        {
          "score": 0,
          "content": "That’s fair",
          "id": 14,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "ESH - if this is how you and your future wife are going to resolve problems, you might as well end things now and save the costs of a divorce. OR.. Get some help with how you two communicate because this childish nonsense isn’t going to work out for you.",
      "id": 15,
      "comments": [
        {
          "score": -16,
          "content": "It’s just I thought I could communicate to her after she realizes how I felt. Though it does seem bad now.",
          "id": 16,
          "comments": [
            {
              "score": 4,
              "content": "It's a bit childish. A normal person doesn't need to be punched to understand that punching is not okay. If someone punches you, the problem is not that they don't understand how it feels.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "NTA - not married yet eh? Well now is the time to figure this out before it gets nasty later on. Also potential red flag.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "YTA\nI know I’m going against the grain here, but just because you were comfortable sharing your password with her, does not mean she is obligated to share hers with you. It doesn’t need to be a sign of how much she trusts or does not trust you, it could very well just be a rule she has lived by throughout her life. Asking her to leave the room was a silly and frankly immature thing to do, and if you had a problem with her previous conduct you absolutely could have just spoken with her about what was bothering you, instead of making assumptions, petty moves, and being a child about it.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "ESH. A lot",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "NTA. Petty? Maybe. Passwords should never be shared anyway. Doesn't matter with whom.",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "I normally think it's 100% ok to not give your SO the passwords to your computer/phone, but it sounds like you did this out of spite rather than a genuine desire for your computer to be a private/personal space so YTA.",
      "id": 22,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "NTA. You should both have separate accounts on each other's computers, but not know the other person's password on either.  Keep your stuff private, but if there's some reason for the other person to be using your hardware, then allow it.",
      "id": 23,
      "comments": [],
      "relation": "Support"
    }
  ]
}