{
  "post content": "I (F 25) have been in a relationship with my fiance (M 25) for 7 years. We were best friends for 3 before we became a couple. The first year dating sucked, he cheated on me a lot so we were very off and on. My friends really didn't like him, understandably.\n\nFor the past 6 years, it has been very happy and healthy. We've worked a lot on healthy communication and the relationship has improved because of it. He helped me find ways to cope with my depression, anxiety, and anger management. Both of us grew up in poor, abusive homes and we have both helped each other face that reality and move past it to become better people. We have been through a lot together, and we have grown up together. He proposed, I said yes, and our wedding is planned for the summer of 2021.\n\nThis weekend I went to a b-day party for my BFF's kid. Several of her boyfriend's friends were there. After I left the party, three of these friends approached her to ask about me. She texted me to tell me, and we laughed about it. The conversation quickly turned sour.\n\nMy friend told these boys that I was engaged but that \"I don't like her boyfriend so you can try to steal her away if you want (crying laughing emojis)\" I said that she had no reason not to like him anymore as he had grown a lot. She said \"Yeah I know. But I just think he's a dufus.\" I kind of exploded and said that I'd been in a loving relationship for almost a decade and that I didn't appreciate my best friend encouraging strangers to steal me away from the person I want to marry. She said \"It was just a joke.\" I told her regardless, I love him and he loves me and it really hurts that my best friend is unsupportive of my happiness. She never responded, and hasn't since.\n\nI told my fiance about this and he found it really upsetting, naturally. He knew she didn't like him at first but had thought he proved himself to be \"worthy\" and that they were on good terms now. He said he doesn't want to see her anymore if that is the way she feels about him. I completely understand as I would feel the same way if one of his friends said they didn't like me after all this time.\n\nI have been festering about this conversation since. It makes me angry that she would talk about my relationship that way to strangers. It hurts even more that after I told her how it made me feel, she didn't even care enough to apologize. I want to revoke her place in my wedding as a bridesmaid. My fiance told me I might be overreacting because I am angry and that I should wait to see if she apologizes. The way I see it though, the woman doesn't like my fiance, she doesn't respect my happiness, and because of that, she has no place standing beside me when I marry him.\n\n&#x200B;\n\nTL;DR: My best friend told me she didn't like my fiance and wanted someone to \"steal me away.\" He cheated on me 6 years ago but we've been happy since. I feel she is unsupportive of my happiness and now I don't want her in my wedding.\n\n&#x200B;\n\nUPDATE: So it was the general consensus that my friend's comments were rude, but that I definitely overreacted in this situation. I sent her a long text apologizing for my overreaction. I explained that her comments were really hurtful and while I didn't expect her to like him, I did need her to recognize that I was happy now and respect that, and not trivialize it with jokes about how she wanted me with someone else. I have also asked her to refrain from making comments about how she doesn't like him around me, because it makes me feel like shit. She said it was okay, and that she gets it and understands how I feel. I am feeling better about the whole situation, and a little silly for my petty angry reaction to the whole thing. Thank you all for judging me!",
  "id": 1,
  "comments": [
    {
      "score": 29,
      "content": "ESH. If this girl is close enough to you to be a bridesmaid, she should be close enough that when you're calm you can have a calm adult conversation about this.\n\nYour knee-jerk reaction to just immediately prove to her \"well, now you're not important to me\" is childish. If after discussing she doesn't apologize and cannot respect the relationship then you can cut her out without being TA.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Good point. I don't want her to think she is unimportant to me at all. We have been friends for 10+ years and I love her and her family dearly. It just really hurt that she had the nerve to tell strangers she didn't like my fiance and then to tell it to me directly. I am not sure what an appropriate amount of time would be to wait for an apology before I go cutting ties.",
          "id": 3,
          "comments": [
            {
              "score": 5,
              "content": "You don't need to wait, just confront her. Tell her that was very hurtful even if she didn't intend it to be and she can't do that again, then see how she responds. Best to talk in person about it, too.",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": "You're right. If I wait for her to apologize, I will never get one. Unfortunately, we live several hours apart so seeing her in person won't be a possibility. But I decided to take your advice and I've sent her a long apologetic text saying that I shouldn't have overreacted the way I did, explained how her comments about him have been hurting me, that I don't expect her to like him but that I did need her to respect the fact that I am happy where I am and want her to refrain from making those types of jokes to me. We will see what happens.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Good! Update us if you can!",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 7,
              "comments": [
                {
                  "score": 1,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NAH I think you over reacted a bit. Sounds like she was joking around and didn’t expect you to take it to heart so much! That said, if she doesn’t support your marriage I understand not wanting her to stand up with you while you get married. (But I think that deserves a calm, rational mature conversation not this petty fight!) \n\nThe thing with having a partner who was a cheating asshole is that while you might love and forgive them, your friends/family generally don’t. They don’t have the same soft spot for him. They saw their friend lied to and hurt. So it’s hard to blame her for not loving your fiancé.",
      "id": 9,
      "comments": [
        {
          "score": 10,
          "content": "Exactly. \n\n\n>it really hurts that my best friend was unsupportive of my happiness\n\nShe isn't unsupportive of your happiness, OP, she's unsupportive of your fiance. She saw the repeated lying and betrayal he put you through early in your relationship. Sure, time has passed. But that doesn't mean things should be forgotten, especially by your support systems. \n\nLove is blind, and inclines people to forgive unspeakable things. That doesn't mean every else is blind too though.",
          "id": 10,
          "comments": [
            {
              "score": 2,
              "content": "You know, that makes me think of something else. I am not sure if this is relevant or just muddying the waters, but she cheated on her boyfriend 2 years ago with her ex-boyfriend. She ended up getting pregnant around the same time, which led to a lot of drama about who the baby daddy was. She is still with the boyfriend she cheated on and they are in a loving, happy relationship now. It's kind of silly to me that she can judge him for something he did when he was a kid, knowing that she did similar things well into adulthood and can see that a happy relationship is still possible. I would never bring this up to her but definitely something I have pondered on.",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "Whoa that is an interesting twist! You’d think she be able to forgive and move on then! Have you had a serious heart to heart with her?",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "You're right, I probably am being petty about this whole thing. Our arguments typically end up being that way. All of my other friends have forgiven him, and my family all adores him. She is the only friend who has held on to those bitter feelings so it makes it even harder for me to understand. You do have a good point though, love is blind. I guess I can't expect her to love him.. But I do wish she would respect me enough not to blast my personal business to random dudes who are asking for my number.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "ESH - You mention that your boyfriend helped you with your anger, and yet you \"kind of exploded\" over an emoji text?? That's a huge overreaction. Your boyfriend (and you) is also being really immature by expecting your friend to like him. People don't always like each other - it shouldn't be an issue for a mature adult.\nFurthermore, your friend is acting like a child with her dismissive texts.\n\nESH, really.",
      "id": 14,
      "comments": [
        {
          "score": 2,
          "content": "True. The anger management thing is a work in progress. I did mention in the text to her that I might be overreacting, but it was upsetting how unsupportive she was of my relationship. It's kind of been bottling up for years (with her making small comments here and there about how he sucks) and the straw that broke the camels back was her telling a bunch of strangers about my business. Probably overreacted with my response because of it",
          "id": 15,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "NTA. I’d go to lunch or coffee and have a real heart to heart with her. Tell her that you’re extremely hurt, and don’t feel it’s appropriate that she be in the wedding if she doesn’t support your relationship. However, I’d also give her a chance to tell you if she’s seriously concerned about something. It sounds like she’s just being petty, but maybe she has a concern and just hasn’t grown the balls to express it, and wants to be immature and sabotage the relationship instead.",
      "id": 16,
      "comments": [
        {
          "score": 2,
          "content": "I would LOVE to do this, but it's really difficult with her. She doesn't like to talk about her feelings and gets really angry really quickly. If I tried to tell her that I was considering this, she would cut me off before I had the chance to talk about how she made me feel.   \n\n\nSmall example: In high school we shared everything. I borrowed a flowery hair clip of hers to wear to my cousin's wedding, and she commented on my pictures calling me a thief. I tried saying sorry and that I should have asked to borrow it first, but she blocked me. She didn't talk to me for 8 months.",
          "id": 17,
          "comments": [
            {
              "score": 3,
              "content": "Damn! Well I’m sorry this is happening. I imagine kicking her out of the wedding would either hamper your relationship or end it :/ but she may not be a friend you want to carry over into your adult/married life anyway if this is how she behaves and has behaved in the past",
              "id": 18,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah, I suppose it would end the relationship for sure. This is definitely something I have considered, which is why I am having such a hard time with this. On the one hand, I love her so much and have known her for so long that it would be a hard and heartbreaking thing to do. On the other hand, I want her to respect me and my relationship, even if she doesn't like my fiance. And if she can't do that, then am I disrespecting him by having her be a part of our wedding? Idk. It's a tough one.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It is a tough one. I got married 2.5 years ago and the best advice I can give is to trust your gut and ultimately do and have what/who makes you happy ❤️",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. The people that stand with you are supposed to support you in your marriage. She doesn’t, she’s out.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA.  What your \"friend\" said is no joke - it was disrespectful to both you and your fiancee.  You made your own point - those standing up with you at your wedding should be respectful of you both.  That doesn't mean mutual adoration, but certainly recognition of the hard work done to find a better place for you both.  Why have someone who disrespects YOU so much as to make the \"joke\" she did be your maid of honour?  She hasn't any.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - I can get why your friend may not feel great about your fiance, even if he has proven himself to be a much better guy than when you first started dating.. Biased opinions can be very intense, as well as persistent even in spite of evidence to the contrary. However, regardless of her views on your fiance, she definitely crossed a number of lines here. Whether or not you're overreacting is a bit tough to discern based on the context, and it's pretty subjective... but if you feel like this is a significant enough of a transgression, and being the fact that it is your wedding, then no, it's not really overreacting.",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "Right. I definitely agree that she has her reasons to dislike him. She is my best friend and he hurt me a lot before. It is hard for me to see it from her point of view at this point considering we have been so happy for so long. I did kind of blow up at her comment and even said I might be overreacting, but that it hurt. It doesn't help that the entire 7 years we have been together, she has made comments about how he sucks, which I ignore. I feel like this time it just finally sent me over the top because she was talking about my relationship to people I didn't know.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "This is a tricky one. I am gonna say NTA, but at the same time think about where she is coming from. She means well, and she cares about you and thinks you are making a mistake. As a friend, I have been in that position too. I do think the joke was pretty dumb, and the whole \"DURRRR IT WAS A JOKE STOP GET OVER IT\" is a moronic thing to say that invalidates your opinions. It's a DUMB joke, first of all, but even if it was a clever/funny one, it obviously upset you and the thing for her to do would've been to say \"you know what I'm sorry. You know I don't like him, but if he makes you happy, then fuck it.\"\n\nTaking her out of your wedding (I assume she was MOH, or at least a bridesmaid) is a huge step. It is clear there is simmering stuff here between her and your fiancee, and I tend to agree you don't want someone who isn't a fan of your fiancee being such a prominent person, or giving a speech.\n\nTHAT ALL SAID\n\nIt is POSSIBLE you overreacted. Her thinking he's a dufus doesn't necessarily mean she was ACTUALLY encouraging ppl to steal you away, or that she is unsupportive of your happiness.",
      "id": 25,
      "comments": [
        {
          "score": 2,
          "content": "“It’s just a joke.” Classic excuse of bullies, assholes and abusers.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Right, the whole \"It was a joke\" thing just seems like a way to avoid taking responsibility for your actions. Your comment is spot on what I was looking for though. I sent a really long message explaining that I knew how she felt about the relationship before, but that we had been happy for almost a decade and that it really hurt how unsupportive she was being. All I wanted from her was something to say that she gets it, and was just happy I was happy.   \nDefinitely possible I am overreacting though. It is a very touchy subject and I tend to get heated easily.",
          "id": 27,
          "comments": [
            {
              "score": 3,
              "content": "At the same time, I understand being protective. I am protective of my friends too! If someone I know is dating someone I believe to be an asshole (whether I am correct or incorrect in that evaluation is irrelevant!), I find it hard to be happy. \"Oh you're going to waste your best years married to that idiot? Great.....\" you know what I mean?",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (F 25) have been in a relationship with my fiance (M 25) for 7 years. We were best friends for 3 before we became a couple. The first year dating sucked, he cheated on me a lot so we were very off and on. My friends really didn't like him, understandably.\n\nFor the past 6 years, it has been very happy and healthy. We've worked a lot on healthy communication and the relationship has improved because of it. He helped me find ways to cope with my depression, anxiety, and anger management. Both of us grew up in poor, abusive homes and we have both helped each other face that reality and move past it to become better people. We have been through a lot together, and we have grown up together. He proposed, I said yes, and our wedding is planned for the summer of 2021.\n\nThis weekend I went to a b-day party for my BFF's kid. Several of her boyfriend's friends were there. After I left the party, three of these friends approached her to ask about me. She texted me to tell me, and we laughed about it. The conversation quickly turned sour. \n\nMy friend told these boys that I was engaged but that \"I don't like her boyfriend so you can try to steal her away if you want (crying laughing emojis)\" I said that she had no reason not to like him anymore as he had grown a lot. She said \"Yeah I know. But I just think he's a dufus.\" I kind of exploded and said that I'd been in a loving relationship for almost a decade and that I didn't appreciate my best friend encouraging strangers to steal me away from the person I want to marry. She said \"It was just a joke.\" I told her regardless, I love him and he loves me and it really hurts that my best friend is unsupportive of my happiness. She never responded, and hasn't since.\n\nI told my fiance about this and he found it really upsetting, naturally. He knew she didn't like him at first but had thought he proved himself to be \"worthy\" and that they were on good terms now. He said he doesn't want to see her anymore if that is the way she feels about him. I completely understand as I would feel the same way if one of his friends said they didn't like me after all this time. \n\nI have been festering about this conversation since. It makes me angry that she would talk about my relationship that way to strangers. It hurts even more that after I told her how it made me feel, she didn't even care enough to apologize. I want to revoke her place in my wedding as a bridesmaid. My fiance told me I might be overreacting because I am angry and that I should wait to see if she apologizes. The way I see it though, the woman doesn't like my fiance, she doesn't respect my happiness, and because of that, she has no place standing beside me when I marry him.\n\n&#x200B;\n\nTL;DR: My best friend told me she didn't like my fiance and wanted someone to \"steal me away.\" He cheated on me 6 years ago but we've been happy since. I feel she is unsupportive of my happiness and now I don't want her in my wedding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 29,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 30,
      "comments": [],
      "relation": "No"
    }
  ]
}