{
  "post content": "I've (27M) been friends with Jack (27M) since college. We graduated from the same program and we've remained buddies, hanging out every week. We met through lifting but we've both slowed on the gym since then. \n\nNeither of us have the ripped bodies we had at 19 and 20. I still go a couple times a week but these days I'm rocking a solid \"dadbod\". I'm 6 feet tall weighing 220 lb, 215 on a good day, got some pudge and a small belly but I wouldn't call myself fat.\n\nJack gained weight too, no judgment because so have I, that's life. We're the same height but he's definitely chubbier than me by a good 15 pounds.\n\nThe other day we were hanging out. I was wearing Levi jeans, the ones that have the size printed on the logo on the waistband (W36 L32, they look like that). At some point in the night I guess Jack snuck a peek. He exclaimed, *\"Bruh! You wear size 36 now!?\"* When I looked over at him he was chuckling, looking down at my belly and had a big smile across his face.\n\nSo I lifted up his shirt and gestured to his belly, *\"Yeah and what size do you wear, fatso?\"* I said it with an air of laughter, not in a mean way. I thought he'd take the banter and we were just guys being guys, but he immediately sucked in his gut as if I had embarrassed him and he yanked his shirt back from my hand, pulling it down to cover his belly. \n\nThe next few days Jack wasn't talking to me, and when I finally confronted him he told me I was way out of line. I'm confused because he made the first move commenting on my jean size, and all I did was lob the same banter back and I thought it was standard banter and guys being guys.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 117,
      "content": "ESH  \nYou both need to grow up. Rebranding personal insults as \"standard banter\" is so harmful to men and their friendships. If he is sensitive about his weight you shouldn't tease him about it and should apologize for doing so. Likewise, he shouldn't have opened that line of \"banter\" by insulting your waist size.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "Not everyone is you. Study’s have shown that fat shaming doesn’t improve a persons weight (obviously this is just average not single cases). Alot of people will instead feel shamed and sad and eating is there coping mechanism for that. \n\nMotivation comes from within and making someone feel small and worthless doesn’t help that.",
              "id": 4,
              "comments": [
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Your not weak if you cope in a different then someone else. You are not weak if you don’t like getting picked on for your weight. You aren’t weak if you face less adversity. If someone loses the weight then who cares whether they were motivated by rude comments or positive comments. That doesn’t make them weak.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 61,
      "content": "ESH...He started it, but I think lifting someone's shirt is an over the line response.",
      "id": 7,
      "comments": [
        {
          "score": 3,
          "content": "ESH.\nYeah —what if he had a colostomy ?",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 35,
      "content": "ESH. Looks like you boys haven't matured since college.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "ESH - you were both rude",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 20,
      "content": "ESH.\n\nCome on, you're adults now.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "Was it a typo where you said you guys are 27? ESH",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "YTA because you exposed his body without consent. The comments on either side weren’t great, but you crossed a line when you pulled up his shirt.",
      "id": 13,
      "comments": [
        {
          "score": -6,
          "content": "[removed]",
          "id": 14,
          "comments": [
            {
              "score": 3,
              "content": "‘Guys’ are not a monolith and have all manner of different levels of comfort with people exposing their bodies suddenly and without asking. The way OP describes this interaction indicates the friend didn’t invite or enjoy having his clothes yanked up. Verbally teasing is quite different than suddenly having your body exposed. You personally might be fine with all and sundry pulling at your clothes but that doesn’t make it ‘normal’. Unless it’s been established already that everyone involved is completely comfortable with this sort of thing happening at random, it’s not appropriate.",
              "id": 15,
              "comments": [
                {
                  "score": -2,
                  "content": "[removed]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 5,
                      "content": "All I have to go on are the actual words of the post.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "NTA.  Glass houses and stones and all that.",
      "id": 18,
      "comments": [
        {
          "score": -1,
          "content": "This.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "Esh",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "YTA. Smirking that someone is wearing a larger size is aggressive, but not on the same level as calling someone \"fatso\", so right there you've escalated. (ETA: the escalation isn't why I think you're TA. The next part is.) Lifting his shirt was way over the line, and so was poking him.\n\nThe fact that he was smirking suggests that he is enjoying you gaining weight because he has some resentment. It could be that he is jealous, but the level of your contempt for him makes me suspect he was smirking because you've been smug or contemptuous in the past.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    }
  ]
}