{
  "post content": "Every time my wife (32F) and I (27M) go anywhere together, whether it be out to a restaurant, my parent's house, shopping, etc., we always end up having a fight before we leave, because she'll always try to leave with her 4 inch heels on. I tell her she shouldn't be wearing those for where we're going, she gets mad and tells me how much she spent on the shoes, I tell her I'm not leaving until she puts on something practical, she finally does, and she pouts for 15 minutes in the car. \n\nHere's the thing. I have no problems with her wearing heels as a concept. I don't care that she's already taller than me by 4 inches and they add on another 4 inches. I don't care that they're basically Gothic dominatrix heels. None of that matters to me. \n\nThe problem is that she is an absolute *klutz*. \n\nShe wore those heels out to a restaurant on my birthday a few years ago, and one of the heel spikes (which aren't thin) slipped into a hole in a grate on the street. She landed flat on her ass and it took a while to get the shoe unstuck out of that grate. She ruined her favorite dress in the process and got a bruised tailbone. \n\nLast year, she wore them to my parent's house, where it was raining. She slipped as soon as she got out of the car on the wet road, fell, and sprained her ankle. That was a rather expensive trip to the ER.\n\n4 months ago, she wore just two inch heels to a job interview. You can probably guess what happened, but she lost her balance in the office where she was being interview at and whacked her head on a chair, breaking her glasses as a result. Had to get evaluated for a concussion and get a new pair of glasses out of pocket. No, she did not get the job. \n\nSo every time we have this argument, I keep reminding her about all the times that she's hurt herself while wearing heels, and how its a really bad idea to wear them, especially since we live in an area that constantly rains and we go places that require a fair bit of walking in that rain. She says she's willing to accept the risks, but I really don't want our experiences ruined because she hurt herself again. \n\nI keep telling her to look for practical shoes in a style that she likes, but she complains about how she \"can't find any\" because she has size 12 feet (which okay, I get it, but online shoe stores are a thing, you know?). \n\nI'm kind of at my last straw because we argued about it again last night. We were going to go out for dinner and it was rather rainy. Once again I refused to go out unless she wore practical shoes for safety reasons. She called me a controlling jerk and we didn't end up going out at all. \n\nSo reddit, *am* I a controlling jerk? I kinda feel like I am, but I really don't want to keep pitching in for ER bills because she keeps wrecking herself because of her freaking shoes.\n\nEdit: one very important thing I forgot to mention is that she has Meniere's disease, where you get random bouts of vertigo. She has stumbled and fallen while wearing sneakers before from having vertigo episodes, so it's very high risk for her to be wearing heels at all.\n\nEdit 2: So it seems pretty 50/50 so far of whether I'm an AH or not. The YTA comments are shedding some light on my behavior that I didn't really think was a problem until now I guess. So in light of that, next time we to out and she wants to wear them, I won't say anything, but I'm gonna hope that nothing bad happens as a result.",
  "id": 1,
  "comments": [
    {
      "score": 6609,
      "content": "Oh wow tough call. \n\nI'm going with NTA. You didn't scream at her. (Did you?) You didn't threaten her or insult her (....right???) You just stated that you're not going anywhere with her. That is you focusing on your own actions and setting a boundary. Medical bills are expensive. (Yay, america...) I would be irritated at my spouse for putting us in medical debt over a fashion choice as well. And her long term health matters to you and impacts you. \n\nDoes she ever shop at Torrid.com? They have Wide width shoes up to size 14 I think and many are very practical. Lots of semi gothy looks, lots of licensed fan gear... I'm wearing a super comfy pair of Beauty and the Beast pull on sneaks from there as I type this.",
      "id": 2,
      "comments": [
        {
          "score": 3667,
          "content": "Definitely did not yell, threaten, or anything of the sort. I just say \"I'm not going out with you if you wear these, it's a safety hazard. It's raining/we're walking a lot/etc., it's not safe.\" \n\nAlso did not know that torrid had shoe sizes that go that high, I'll let her know! Thank you!",
          "id": 3,
          "comments": [
            {
              "score": 1194,
              "content": "I know they DEFINITELY have size 12 but of course every brand and style is different and there are no guarantees.",
              "id": 4,
              "comments": [
                {
                  "score": 1456,
                  "content": "Still, the fact that they're gothy options works perfectly. I do get that it's hard to find practical shoes in the style so I do understand why she wants to wear the ones she has now, but I also don't want her to accidentally kill herself if she can get something safe and a style she likes!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 863,
                      "content": "Tip: wide heels and a small platform gives the illusion of more heel and makes the whole thing a lot more stable and more comfy. Also boots that are at least over the ankle help too (at least I can walk trough hilly woods with shoes like that).",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 172,
                      "content": "[Demonia](https://demoniacult.com/) runs up to a size 12 for women's shoes and most of theirs are platforms instead of heels, and most are boots that have more ankle support. They also have flats, creepers, and sneakers. Many are also feminine men's styles and would fit, too. [Something like these. ](https://demoniacult.com/products/deviant-204b)",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "Has she ever tried flatforms? I fall a lot but also love heels and use flatforms or platforms bc it’s easier to walk.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": ">gothy options\n\nHonest qustion: why doesn't she just get some nice DocMartens, aka the sexist shoe ever that can be worn with everything?",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "You should also check out BoxLunch - they are owned by Hot Topic but the $$ goes to charity so they get lots of licensing and I know they have a lot of purses and bags but they might have shoes too?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Jumping on with another shoe source recommendation. Nordstrom’s has a pretty decent selection in bigger sizes online (I’m a 13 and they’re one of the few places I can buy from). I don’t know if they’ll carry the styles she’s looking for, but with free shipping and free return shipping, it’s a safer option compared to some other online ones.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Torrid is a Hot Topic brand so they do take inspiration from their parent company.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Maybe try holding her arm like a gentleman",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Torrid shoes are amazing!",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 367,
              "content": "Has she thought about wearing practical shoes in transit and change into her heels once you arrive at the location, adding a cute bag to carry the shoes or you could offer to carry the tote.",
              "id": 15,
              "comments": [
                {
                  "score": 164,
                  "content": "[deleted]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 67,
                      "content": "I'm from Michigan... this is the way lol",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Pakistan. My favorite heels are always in the car with me.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 44,
                  "content": "I've heard of \"commute in flats, change into heels\" for women expected to wear heels at work\n\nI'm a guy who sometimes does similar, packing a change of clothes when it's either way warmer or way colder outside",
                  "id": 19,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I used to keep my work shoes at my desk. If anyone saw me in flip flops or sneakers on my way to my desk... oh well for them!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "i do this as an attorney! i learned after having to replace the heels on my favorite shoes *twice* over the summer after my first year of law school. ruined them walking 2 blocks from my car to the courthouse daily.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Ah yes, Washington State method as well",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is what I do. Otherwise my feet hurt before my evening even gets rolling.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I did that when I worked in the San Francisco Financial District for years!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My current boss keeps a pair of heels by her desk at the office which is changes to once she arrives.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 267,
              "content": "I have Meniere's also and wearing even tennis shoes out is scary. Seriously, the attacks come from out of nowhere, and if I had one wearing 4\" heels I would have to be carried home/to the car.\n\n\nNTA. You're prioritizing her safety.",
              "id": 26,
              "comments": [
                {
                  "score": 102,
                  "content": "I also have Meniere's and had to give up heels mostly. For me, the only way I can cope is to have as much contact with the ground as possible. I am a shoe freak, but safety comes first.\n\nHOWEVER!\n\n-- If you can get physical therapy for it, please do, with a vestibular specialist. Mine gave me exercises for walking and to help control my eyes when I was dizzy. It was VERY VERY helpful. Sadly, you'll need good insurance to pay for it though. ☹️\n\n-- There is a new medication called Betahystine (mine is B. Dihydrochloride) that you can get at a compound pharmacy (talk to your doctor) that has literally changed my life. I was housebound for nearly a year. It costs $40/month, well worth it.\n\n-- Try to support her with a low-salt diet. This makes a huge difference. Do it together. Tastes bland at first but you get used to it (and you can always sprinkle salt on if you want).\n\nIn any case, NTA, although you could maybe be more kind--shes not a klutz, she's suffering from a disease.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Same. If I went somewhere in high heels, I would bring practical shoes just in case of a Meniere’s attack",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "I love heels, despite being 5’10 already, and wore them at every opportunity. My 5’4 best friend used to make fun of me all the time. But I have MS. I was diagnosed at 23and wore heels as long as I could, but as the years went by I bought them shorter and shorter but by 2008, they were gone. I have boots with very low heels, but when it’s over, it’s over. I have to do whatever is safest.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "You might look into gifting your wife a modeling class (probably best to discuss it with her first through). I had a friend in school who was a tall klutz on medication that could give her bouts of dizziness. Her mother took her to modeling classes to boost her confidence and learn how to balance herself well. I kid you not she could play football in 6\" heels without tripping or falling. Took awhile, but she said the classes really helped her in just her day-to-day life.",
              "id": 30,
              "comments": [
                {
                  "score": 31,
                  "content": "Finding a long hallway with walls that are close enough for you to stretch out your arms out to catch your balance with can be helpful too. I taught a bunch of people in my sorority to walk in heels that way.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I don't wear heels, but I saw the presenter of a fashion show my wife watches saying to practice in the supermarket so you can support yourself on the trolley as you go around. \n\nSeems weird to me, but just throwing it out there in case it's a good idea!",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yes! Torrid shoes are meant for bigger sizes and they are built more stable! They will likely help with her klutziness problem. Make sure to suggest that to her. They are good quality for the price and some are pretty damn cute!",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Your wife is lying. I have size 12 feet and find lots of shoes online that aren't stilettos.",
              "id": 34,
              "comments": [
                {
                  "score": 6,
                  "content": "I also have lots of size 12 (and some 13) shoes that aren’t stilettos",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -5,
                  "content": "Not being into online shopping doesn't make her a liar.",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "This might not go over well but shopping where drag queens shop gets you heels in large sizes, too.",
              "id": 37,
              "comments": [
                {
                  "score": 4,
                  "content": "Years ago the radio station I listened to was doing an interview with the owner of a drag store.  Said he got a lot of business from WNBA players, especially for shoes.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Amazon also has larger shoe sizes.",
              "id": 39,
              "comments": [
                {
                  "score": 25,
                  "content": "Zappos is even better for that!  Which is actually owned by Amazon now, so I can’t understand why Amazon keeps it separate shoe store. Anyway size 11W here, so I know very well the pain of shoe shopping and gave up brick and mortar stores for that well over a decade ago!",
                  "id": 40,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Some people aren't very fond of Amazon and prefer to shop elsewhere when it's an option, even if they don't hate them enough to completely refuse to buy from them. I imagine it's easier to get those people to buy from them when they keep the brand separate.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Look, I'm a lot like your wife. Tall, giant feet, and klutzy as all hell, so I don't wear heels ever. You could have maybe been more diplomatic about it, but you're NTA.\nHave you tried sitting down and laying all your concerns out any time other than right before you go out?",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "I agree NTA. If she really does have all of these accidents then it’s time to figure something else out like the torrid shoes. They usually have wider heels for better stability and are good quality. I would be upset if I was OP. It’s not fair that he keeps having to pay for avoidable accidents. It sounds like she needs to compromise a little and figure something out.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Creepers may also be a good gothy option that add a little height while a little more stable. And more structured boots with a chunky heel or a platform also have support in case she does fall. And what's more goth than some good Doc Martens?",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I’m going with NTA bc Ménière’s disease is ridiculous and she’s putting herself in danger with that especially when the disease could worsen and she may not notice right away.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Sounds like she needs to buy shoes wherever drag queens buy them",
          "id": 46,
          "comments": [
            {
              "score": 42,
              "content": "It sounds like she \\*is\\* buying shoes wherever drag queens buy them, which is why she has so many heels.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I second Torrid shoes. I have wide but tiny feet on top of a shatter reconstructed ankle. Not supposed to wear heels but I do every now and then for date nights. I find they have some cute flats that are sensible, and I water proof them since we live in the rainy  PNW. Amazon I have found some cute larger shoes.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "OMG I LOVE YOU IVE NEVER FOUND BOOTS I COULD POSSIBLY WEAR BEFORE!!",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Shoe bags are a thing. She can wear her appropriate shoes to the event/venue and then slip into the pretty ones.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2697,
      "content": "If it’s solely related to her hurting herself then NTA.\n\nIt’s a reasonable request but she’s within her rights to say no. Just tell her she’ll have to fully cover the costs of all heel related ER trips from now on.\n\nShe might change her mind after the next one.",
      "id": 51,
      "comments": [
        {
          "score": 845,
          "content": "Hahaha, solely ...",
          "id": 52,
          "comments": [
            {
              "score": 98,
              "content": "Took me a minute",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "Dun duh shhh. (Or however you do it). Lol",
              "id": 54,
              "comments": [
                {
                  "score": 77,
                  "content": "Ba dum tsss",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "A for effort",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 173,
          "content": "Coming on the *heels* of that comment...\n\nHas she considered a walking cane? Lots of otherwise able people who have issues with dizziness (I have POTS), use a walking stick and they come in so many really funky designs these days, can be totally glammed / gothed up, and might just prevent some of these falls.",
          "id": 57,
          "comments": [
            {
              "score": 95,
              "content": "Canes can TOTALLY be stylish. A few years ago Selma Blair started using one because of her MS. She is a great example of a woman in her prime who makes the cane look good. At about 35 I stared to need a cane on bad days (back and hips are not good), but mine is just an ugly one with a giant stability foot on it. But the cane used to be my grandma's so I am not replacing it any time soon.",
              "id": 58,
              "comments": [
                {
                  "score": 30,
                  "content": "You can vinyl wrap it! Stickers! Paint! *Glitter*\nI spray painted mine metallic green and it rocks",
                  "id": 59,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Ooo I could put stickers on it! I wonder if my new \"Suck it abelism\" sticker would fit.\n\nEdit, cause people asked: https://bibipins.com/products/2-suck-it-ableism-sticker?variant=40429381386392",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Mine is purple with flowers on",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "If i ever have to get a cane, it's gonna be an evil lucius malfoy type.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 4,
                      "content": "As long as it matches the ensemble, that sounds perfect.\n\nDamn!! Matching the cane to the shoes!!! It's a whole look. I feel like there's a gap in the market here for fashionable disabled folk",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'd go for a crow's head handle, Kaz Brekker style",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "On a side note one of my closest friends was recently diagnosed with POTS and it’s been so life changing and limiting for her. It’s hard too because she has 2 young and active boys and she’s active herself. We were lake and hiking buddies up until her diagnosis. I don’t often see others that have it but I do notice it more after being with her through all of this. I hope you’ve been able to figure out a good regimen that allows you to function as normally as possible.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "If she hasnt changed her mind after breaking her glasses by hitting her head she wont ever change her mind.\n\nThe first time I ever hit my head hard enough to break my glasses permanently changed how I walk and carry myself so I would never do it again. The threat of losing an eye is so scary and real that it changes a person and if it didnt change her i dont think any one thing will.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Or maybe she can wear flat shoes for the walking part and when they arrive at the restaurant or wherever they are going she can put on the heels. At least that's what I'm doing most of the time",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "That would be my option to, to separate finances regarding intentional health issues. OP should calmly explain her, that he worries about her health and why he doesn't want her to wear heels and both should talk to a doctor about it, because he mentioned, that his wife has an illness and it could be very risky for her wearing heels. If nothing works I'd sit her down and tell her that she has to pay for her own medical bills that are caused by heel accidents, but she still has to contribute her regular share to food, rent or whatever.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1766,
      "content": "So if we change this from a wardrobe thing to something like free climbing. \"I refuse to go climbing with my wife unless she wears a safety rope, she falls often when free climbing\" then it's clearly not an arsehole situation. So I think NTA so long as you are being honest about your motives",
      "id": 69,
      "comments": [
        {
          "score": 464,
          "content": "Those are...two very different scenarios.",
          "id": 70,
          "comments": [
            {
              "score": 1135,
              "content": "are they tho? she had a disease that causes her to experience vertigo, heels will only make it worse. with all the occasions that she has seriously injured herself wearing heels, id say it is pretty comparable to climbing w/o gear. bc the gear=practical shoes shes less likely to hurt herself in",
              "id": 71,
              "comments": [
                {
                  "score": 46,
                  "content": "exactly this",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 302,
              "content": "This isn't as extreme, but it probably isn't a good idea to do something that increases your risk of being hurt unduly. She already has a medical condition that affects her balance, heels are more dangerous to her than an average woman. It's ultimately her choice, but I don't think it's a smart one.",
              "id": 73,
              "comments": [
                {
                  "score": 84,
                  "content": "Yep, this sounds like a good way to develop chronic pain from repeated injuries",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 243,
              "content": "She's fallen at least three times due to this, and with one of them had to get evaluated for a concussion. People kind of forget that it's pretty easy for humans to die if our heads get hit.",
              "id": 75,
              "comments": [
                {
                  "score": 8,
                  "content": "I seen million dollar baby",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "See: Bob Saget. That goddamn legend basically became the nursery rhyme: bumped his head, went to bed, and didn’t get up in the morning. RIP, America’s Dad.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Idk man, one wrong fall can kill someone.",
              "id": 78,
              "comments": [
                {
                  "score": 27,
                  "content": "I still haven't gotten over the time I dislocated my knee doing something completely stupid and relatively non-physically intensive.\nReally hit home how fragile our bodies can be.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I saw a funny interview a few years back with Matthew Grey Gubler, aka Spencer Reid from \"Criminal Minds\".  He was in a leg brace for several episodes and the interviewer assumed he was doing something extreme to injure it.  \"Nope, injured it while dancing at a club.\"  :-)",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 82,
              "content": "Falls can literally kill people. She's lucky she hasn't smacked her head on a concrete curb or on the corner of a sharp piece of furniture. It's not that different in this case, given that she has spontaneous bouts of vertigo.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I mean both can cause you some pretty serious medical bills. The level of severity are different but they’re in the same category of not following reasonable safety measures and causing injury for sure.",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "thing with avoidable hazard. in the case of the analogy it works",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Skipped and fell from standing on a flat surface and broke my leg. It’s the same scenario",
              "id": 84,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -9,
              "content": "\"Kobe Bryant didn't go to college; he went straight from high school into the NBA... So it's not the same thing at all...\"",
              "id": 85,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I think you meant free solo. Free climbing means you only use ropes for protection but not to assist in progress. Free solo means no ropes no protection whatsoever, you fall you probably die.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1537,
      "content": "\"The problem is that she is an absolute klutz.\"\n\n**NTA. You just don't want her to fall down and are more concerned about her safety.**",
      "id": 87,
      "comments": [
        {
          "score": 454,
          "content": "[deleted]",
          "id": 88,
          "comments": [
            {
              "score": 68,
              "content": "And of having nice occassions ruined by a trip to the doctor. I wouldn't consider that a perfect end to a nice evening...",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 102,
          "content": "Not only is she a klutz... but she has bouts of vertigo.\n\n1 + 1 = 2 and Klutz + vertigo = don't wear high heel'd death sticks",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1181,
      "content": "As the person speaking from the klutz's point of view, i think you're NTA. I have had to stop wearing heels for these exact reasons. I have hurt myself - at times badly - too many times. \n\nI would maybe suggest to her to maybe wear more practical shoes *to* the destination, and change into the *fancy* shoes when you get there. Might be a suitable compromise while she is still coming around to the fact that her well-being is more important than what her feet look like. \n\nSource: a 5'2\" woman who looks like a tiny baby next to her husband, and who would love to wear pretty, heeled shoes, but who has tumbled down the stone steps in front of the Peace Tower on Parliament Hill, Ottawa, Canada, and who knows that it's just not worth the risk, to my health OR dignity 😂",
      "id": 91,
      "comments": [
        {
          "score": 98,
          "content": "Just FYI, you should put spaces in Y T A otherwise the bot counts it!",
          "id": 92,
          "comments": [
            {
              "score": 90,
              "content": "sadly, the bot does not tally votes!  It takes upvotes as the tally and only counts the top comment.",
              "id": 93,
              "comments": [
                {
                  "score": 68,
                  "content": "True, but not \"sadly\". It's the better way. Otherwise the threads would be full of low-value content free vote comments, and users trying to game the count with multiple votes.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I feel like the better way to do this would be to count all the upvotes on EVERY comment with a vote, and then determine whether Y T A or N T A comments have more upvotes in total. Otherwise one top comment gets a lot of traction and wins by default even when lower down in the thread we find new information/arguments that end up changing the popular verdict.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Does anyone actually care about the final verdict?  Definitely plenty of people fishing for upvotes though.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Really? Then that kind of makes this pointless.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yup. Basically the first comment in to make any kinda reasoned argument (even when they are blatantly wrong) basically ends up winning. \n\nOr, often enough, a joke verdict that uses the opposite of the actual intent of the vote moves to the top. \n\nEveryone who reads it gets the joke and understands it means the reverse but still end up upvoting on it.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 59,
          "content": "Absolutely NTA. I used to wear combat style boots with hooks on either side. I didn’t do my laces up properly, ever. Drove my ex army husband insane, but he didn’t say anything until the third time I seriously hurt myself when a lace got caught on the opposing shoe’s hook. My pride was wounded. I initially felt a bit attacked. I was embarrassed. Then he offered that we’d go shopping for a pair of Doc Martens boots where a similar style but no hooks. He hates shopping. We did, and five years on, I still have my Docs, I haven’t had a shoe-related injury since, and I am ashamed I was ready to die on a boot style hill.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Further suggestion, shoe bags are a thing (I assumed they were and searched to confirm) and a nice shoe bag that accommodates her heels  might make a nice gift that makes shoe swapping on outings more convenient.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "You said he isn’t but judged him one… you need to space it or the bot will take it as he the asshole",
          "id": 101,
          "comments": [
            {
              "score": 4,
              "content": "Thank you!! Long time reader, First time commenter. Will fix now!",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Love this suggestion! Great advice. Also, as someone who loves heels, NTA. You sound like a reasonable, caring partner.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Same. My ankles are very weak. Since i was 7 (21 years old now) I’ve hurt my right ankle badly 4 times. Fracture the first time then a sprain. I’ve rolled it MULTIPLE times. I hurt my left ankle for the first time ever this past October and was on crutches/a boot for 3 months. 3 MONTHS!!! Any sport I play I need a brace on both ankles now. Walking itself can be hard on them if I’m walking a lot more than usual. Went to the zoo this week and I learned that lesson. \n\nHeels? Hellllll no. I know 10000% I’ll roll my ankle within the first 30 minutes. Biggest heel I can do is 1.5-2” boots with a thick heel.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'll give you a pass on the Peace Tower steps. Those stone steps are smooth and I'm convinced they turn slippery with the slightest hint of humidity.",
          "id": 105,
          "comments": [
            {
              "score": 2,
              "content": "Thanks for the pass. I almost broke my leg! Happy that I am still alive 😂",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 703,
      "content": "I have Menieres disease, and while it is largely under control, it not only causes dizziness, but affects my balance as well. I have fallen in flats. No way I wear heels. NTA",
      "id": 107,
      "comments": [
        {
          "score": 38,
          "content": "I'm just generally uncoordinated, but I'm more likely to fall over wearing flats because I pay more attention to where/how I'm walking in heels",
          "id": 108,
          "comments": [
            {
              "score": 9,
              "content": "It's always been funny to me that while I'm clumsy in practical footwear or while barefoot, I've never struggled in heels. I try to avoid them now that I'm having mobility issues and it makes me sad because they just give me such a mood boost too",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "THIS is the perspective we need. Thanks. NTA.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "OP should have not said she was a klutz. Having a disease like this is not being a klutz. He should have said from the beginning she has this disease because it's very clear wearing heels is a safety issue for her, and a big one.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 465,
      "content": "Wow. I was leaning the other way until I got to the klutz part. NTA. She’s a danger to herself. And it’s not cool to always have to worry about your partner because they’re purposefully putting themselves in harms way.",
      "id": 112,
      "comments": [
        {
          "score": 81,
          "content": "Same. Had me in the first half. I honestly couldn’t imagine a scenario in which he wouldn’t be the asshole from the top of my head until I read that.\nNTA; this would probably also save her from a lot of embarrassment—everyone who’s ever struggled in high heels also knows that other people SEE it.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 407,
      "content": "[removed]",
      "id": 114,
      "comments": [
        {
          "score": 171,
          "content": "I don't even have vertigo, I just move fast and am klutzy and had to give up heels years ago for my own safety.  I don't think I've worn them in 20 years.  This is kind of a selfish decision on her part as she's not the only one that has to live with the risk. OP should not have to have his night ruined and spend his money on someone else's risk when it can be avoided. She needs to figure out a different style shoe but NTA OP, I would not put up with this type of self inflicted problem either and would have boycotted dinner.",
          "id": 115,
          "comments": [
            {
              "score": 40,
              "content": "I'm super clumsy and I'm 5'11\". Used to love heels but felt silly in them (not that I've ever thought another person was silly in heels, just me being mean to myself). Lived in a city with cobbled streets so that plus being clumsy was a bad combo. I actually got a black eye once on a night out because I slipped over on a dance floor in heels. That was fun. \n\nI solved this by falling in love with a man who was shorter than me. When I'm with a guy I'm dating, I wear heels to be closer to their height and complement my outfit. Don't have to worry about the first part anymore and that's enough for me! Has definitely saved me a few injuries and more than a few blisters!",
              "id": 116,
              "comments": [
                {
                  "score": 1,
                  "content": "your a smart, common sense woman. and I would bet, just as attractive as you were in heels. lol also a woman not falling on her tucky is always a plus!",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’m clumsy and really short. I went to wedges which feel way more stable. Or platforms.",
              "id": 118,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm really short too.  My back (scoliosis) can no longer handle any type of heel.    It makes me sad, I used to love a good pair of platform shoes!",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "What about bringing the heels, and wearing cute but practical shoes on the way? Then changing when you get there? It avoids the weather problems at least.",
          "id": 120,
          "comments": [
            {
              "score": 55,
              "content": "as I said I have vertigo, although not from Meniere's disease, but it presents exactly the same way as traditional vertigo. I honestly don't know how she even stands in heels. the weather has nothing to do with it, and if OP doesn't know much about Meniere's disease, it's because his wife is not taking care of her health, and is not medicated. Meniere's disease can and will cause hearing loss as well as severe balance issue if not addressed. her balance had to be an issue for her to seek a diagnosis in the first place. it takes a specialist to do the tests.",
              "id": 121,
              "comments": [
                {
                  "score": 8,
                  "content": "That makes a lot of sense, thanks for explaining! I've never heard of this before and it sounds like it's a lot to manage.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 6,
                      "content": "thank you! it is a lot. I personally do pretty well, I know my limits, and take my meds. I hope OP will have a serious conversation with his wife about her health and educate himself about her illness.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 379,
      "content": "NAH\n\nYour argument is rooted in concern for her safety.\n\nShe just wants to wear pretty shoes.\n\nNothing wrong with either argument. But, as someone who is also a klutz, I've gotten in the habit of bringing flats in my purse in addition to my heels.\n\nSo. Wear the flats from the car on the walk to the restaurant. Swap them out for heels when ready to enter since all you'll be doing is sitting, eating, and occasionally walking to the restroom. Then, when dinner is over, swap em back out for flats when walking back to the car.\n\n#PROBLEM SOLVED, EVERYONE IS HAPPY AND SAFE.",
      "id": 124,
      "comments": [
        {
          "score": 54,
          "content": "This is actually a pretty good solution in my opinion. I like the concept of heels but I have a chronic ankle sprain and they hurt so much. This is a good idea, I might do this. Thanks!",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Except she's fallen mid interview in an office and hit her face and broken her glasses...",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Oh yeah, I always go to the theatre, important exam or wherever in flats and change them when suitable. Especially if I know I'll have somewhere to put them, like a locker (at school before an exam, we have lockers available at the library) or a cloakroom in a theatre. I also keep old sneakers in my car, just in case I end up stranded due to a flat or breakdown and need to change from unsuitable shoes (even if they're flats, I ain't waiting for a tow truck in oxfords if the weather is bad).",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 346,
      "content": "NTA. \n\nYour wife is trying to kill herself and you are rightfully preventing her from doing so. \n\nSeriously. 4-inch heels? And you keep injuring yourself with them? \n\nIf she gets injured and you’re the one who has to take care of her, you have every right to put your foot down and say, “Look, I’m done playing nurse to someone who is knowingly injuring themselves.”",
      "id": 128,
      "comments": [
        {
          "score": -44,
          "content": "OP mentioned 2 injures in the 4 inch heels; a slightly bruised tailbone and a sprained ankle, over 3+ years. The concussion was in the “safe” 2 inch heels. \n\nI went through a period of time in college where I’d sprain my ankle badly around once a year playing basketball. Thing is, I loved playing basketball. If I had decided to stop playing on my own, that would have been a reasonable and prudent decision. If someone else, maybe a close friend or GF tried to coerce me into no longer playing basketball under the ostensible reason that it’s an inconvenience for them when I get hurt, that would be bullshit.",
          "id": 129,
          "comments": [
            {
              "score": 59,
              "content": "Lemme guess, you're a man(actually first and hopefully only time I'll resort to using this stupid condescending tactic) who doesn't have Meniere's. Even without the vertigo disease, if you have such a pattern of falling, it's only a matter of time until OP's girlfriend falls wrong and cracks her skull or neck from tempting fate.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "If your friend or GF had to foot thousand dollar bills because you prioritized your enjoyment of basketball over their financial security they should be reconsidering their relationship with you.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}