{
  "post content": "\n\nHello.\n\n\nI (f26) have been married to my husband (m31) for 3 years, and we're expecting a baby boy together.\n\nWhen I married my husband I kept my maiden name which he was perfectly okay with. We already discussed this and agreed that any future kids we have will automatically take his last name. His family considers this huge deal and I decided to keep to just go with it.\n\n\nBut recently I started thinking about it a lot more and figured that it would be unfair for my unborn son to take my husband's family name and not mine. I talked to my family and they said my husband and inlaws are ridiculous to push this on me without a compromise expecting I go with it. So I went home and told my husband that I've changed my mind about the last name thing and want to either have both our last names combined or my last name to be given to our son. He was confused saying we had an agreement and then asked what was the cause of this sudden change of mind. I told him and he said I can't just do that and called me selfish when I pointed out that I'm the mother I get a say too.\n\nWe went back n forth on this and he said no way he and his family will let me do this to his son, as if my last name is a disgrace. We had a fight and we stopped talking after this. He said that I broke and violated my part of the deal and I should just 'deal' with it now but I won't accept it.\n\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 25640,
      "content": "What's with people on this sub lately talking to their biological family about their marital issues and not first conversing with their spouse\n\nRemoved edit of judgement",
      "id": 2,
      "comments": [
        {
          "score": 7506,
          "content": "There may be a correlation to people running to their families before their spouses over issues and them being assholes... 😅",
          "id": 3,
          "comments": [
            {
              "score": 2697,
              "content": "Or a correlation between people asking the internet for help/judgement about their spouse before actually talking with their spouse.",
              "id": 4,
              "comments": [
                {
                  "score": 3757,
                  "content": "The only reason I am in this sub is to read tone deaf posts from assholes. 🤷‍♂️",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2242,
                      "content": "It's like being able to gossip without it affecting your life.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Its entertaining, thats for sure.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Absolutely LOL",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yuppers.  That's pretty much why most of us are here! LOL.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I can't get over how the families always want to coddle the one who's being the asshole. \"Just apologize so the asshole will quiet down.\" Over and over and over. It's so obvious where and how these family patterns persist. Lord, just tell the asshole NO for once in their lives. No wonder there's such entitlement.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Lmao yes!  \n\nI was talking about this sub to my friend group and a few of them were like bleh bleh I finally unsubscribed ages ago. I'm so sick of people being idiots on there. im like babe that's the joy of it?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "The only reason I am on this sub is that IRL I am surrounded by awesome people but I need a daily dose of st00pid that I used to get at work now that I am no longer working directly with patients.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm here for when the headline and the story are totally mismatched. Like \"AITA: Threw my 2 year old niece in the pool. Update: she was on fire at the time\"",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Lmao same",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Anytime I feel like I don't have my shit together, I come here and feel better about myself.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I made an AITA post on a throwaway and it got over 10k upvotes because my ex and I had a disagreement and we didn't have time to talk about it so I posted it because I was curious (and was scared to death she'd find out because it got a lot of attention). When we actually had time to talk about it it was easily resolved in like 5 minutes.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Yepppp...\n\nAlso, they DID compromise already. I'm wholly for women doing what they want with their name, and having influence in how they want to name their children (and I am a woman), but this is going back on something they already discussed and agreed to, and bringing in other folks who get no opinion.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Or an actual causation. In the spirit of disclosure, my husband recently pointed out that it really bothers him when I don’t take his advice and opt, instead, to take my best friend’s. Granted, these are much smaller issues than what this post is about but the point is my husband made an excellent point and I will for sure be working much harder moving forward to put more emphasis on his advice than anyone else’s.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 723,
              "content": "well said. I remember a quote that says, \"Be careful what you tell your family about your spouse, while you may forgive him, they might never\" \nseriously people are creating issues in their marriages/relationships, forgetting that its tou and your spouse in the partnership and not aunty X or mummy dearest.",
              "id": 19,
              "comments": [
                {
                  "score": 387,
                  "content": "My father in law gave me advice on that.  He told me that if I need to vent about my wife, come to him.  He'll still love her no matter what.  And he told his daughter that if she needs to vent about me, go to my mom.  She'll still love me no matter what.  If you go to your own parent, they're usually going to have your back even if you're the one who's wrong.\n\nIt helps that both of our families are well adjusted and reasonable people, so this advice certainly doesn't work for everyone.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 105,
                      "content": "Interesting. My brother's now ex-gf used to vent to me for similar reasons, but I never really thought about why it worked.\n\nNow that they're split up, she's still my kids' aunt. We saw her separately for Christmas lol",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "I actually talk to my mother in law when I'm frustrated with my husband. (Because my parents suck) its kind of great because even though she tends to take his side, it's still an escape valve for me that lets me think about the problem with a clearer head. She has no reason to magnify drama, and sometimes has a good perspective on why he does things.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This is great advice, but makes me bummed out that my fiancée's parents are pretty emotionally stunted, and her brothers are 10 years younger than me and not particularly emotionally mature for their ages. \n\nI don't think I'm going to have that option available to me, even if it makes perfectly good sense.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I am 100 💯 sure that if I go to my FIL to complain about my\nWife he will have her back, regardless of who is wrong. My parents are dead and I only have a sister on my side of the family. Being a sister she will only have my back if my wife is wrong, if I am wrong my sister will just tell me quit being an a hole. I have less than even odds of ANYONE backing me up. I just keep shit to myself…",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "> It helps that both of our families are well adjusted and reasonable people\n\nwhats that like?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Deadass.\n\nI had trouble with my sister’s fiancé for years because of issues she told me about at the starting phase of their relationship. Stuff they had long moved past but I was still watching this man with my baby sister like a hawk.\n\nThese last 12 months have finally seen a shift. He’s a good man, you know. It’s just hard to see both images at the same time when your looking through the lens of family. We’re cool now.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Absolutely.  A marriage is between you and your SO.  Not you, your family, and your SO.  You confide in each other and work things out together and if you can't then get professional help if it's serious enough.  Adding family often creates a bias against your SO.  Family typically has no problem judging your SO for you.  Some family even uses your problems as ammunition to drive a wedge between you and your SO (speaking from experience) because they think you deserve better or even just don't like them.  It's really unfortunate to see so many people bring family in the middle of their marriage because it just seems too often that their problems worsen.  A parents job isn't to keep your SO safe/happy, it's to keep YOU happy so whatever is best for their baby (IN THEIR MIND) is what they'll do.  At least that's what I tend to see around more often than not.\n\nAnd YTA, OP.\n\nI respect you wanting to keep your name or anyone wanting to hyphenate, but you made a deal at marriage and the way you went about this was unfair.  By just deciding this, you're doing the exact same thing you accuse your husband of except that HE didn't agree to this change where as YOU did agree to a previous agreement.  Your husband most likely feels trapped, betrayed, and belittled by this and by his partner of all people.  Remember that you're a Team and meant to be supportive of each other and work together, not backstab and belittle.  He respected your decision at marriage, and YOU are expected to respect the predetermined decision YOU agreed upon.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Absolutely.  My best friend and her husband have been married for 19 years, together for 23.  She has never once complained about him to her family and has barely vented to me, because 'we will make up and get over it, but you guys will ruminate forever'.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My dad said this quote to me the day before I got married.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "Often if they know they are the asshole they run to family for support so they can leverage that into their argument with their spouse.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I find that people who ask “am I the bad guy?” To everyone but their spouse and just shut them out are, in fact, the bad guy.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's because they hope they can outnumber the other person when conflict comes.  \n\nSo if the other person says that it seems unfair, it's suddenly \"my family says otherwise,  you saying you want them to think less of you if you don't let me get my way\"",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1443,
          "content": "…Am i the only one seeing the MY unborn son…and not OUR unborn son in the title…???",
          "id": 33,
          "comments": [
            {
              "score": 188,
              "content": "Umm, wait a minute, yeah....... I did not notice that 😲😲😲",
              "id": 34,
              "comments": [
                {
                  "score": 197,
                  "content": "I am wondering if it would be a big deal if she was pregnant with a daughter.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 43,
                      "content": "We had a daughter, our first child. We discussed her having my last name, and my wife picks the first and middle name (that i agree with, obviously). It may seem silly but it does mean a lot with her having my name. My wife is her primary caregiver, she carried her, gave birth to her, feeds her and is the one our daughter goes to when she's tired/sad/scared etc. I work full time and do a lot to help and spend all my free time with them, but she is with our daughter the most. Its the way its always been, with mothers as the primary caregiver and bonding immensely over the dependency and their child, carrying them for 9 months, feeling them kick inside and grow.\n\nWe had discussed a hyphenated name of hers and mine, but it was just too long and my wife didn't mind and wanted her to take my name. If she had changed her mind half way through the pregnancy and discussed it with her parents before me, id be upset, mainly that she had this whole important discussion without me. The lack of communication here is the biggest problem.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 121,
              "content": "Yeah, the whole post reeks starting with that point.",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 102,
              "content": "right i thought they weren't together anymore and she's just married till the baby is out...",
              "id": 38,
              "comments": [
                {
                  "score": 80,
                  "content": "I kept expecting the husband to die. Got to the end and Hubby is still alive and my head was spinning as I was trying to figure out where I got the idea he was dead.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Same, I opened the post expecting the husband would die at some point",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "No, that's another sub. AmIaCountryAndWesternSong.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Add me to that list. Totally gave a “we aren’t together” impression.\n\nTo be fair, that may become a self-fulfilling prophecy.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I thought the husband was dead at first glance of the title.",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "[deleted]",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Oof you’re right…that mindset has got to change",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "“Mine” when she’s referring to the child, “his” when OP talks about him referring to the child. Never once “ours”\n\nOk “our son” is in there, but the mine and his still bother me.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "That is a huge red flag imo",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Well yeah, it's clear that that's her line of thinking if she even has to ask people if she's being an asshole when it's clear as day that she totally is.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes.  Goes right along with the mentality of 'I agreed well beforehand and accepted terms and demands of my own, but I am going back on my promise as my view is more important' mentality",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1270,
          "content": "I thought the exact same thing. It’s their child, not their families. \n\nHer family doesn’t get a say and neither does his.",
          "id": 50,
          "comments": [
            {
              "score": 666,
              "content": "I was going to say this, who are they married to and why do they get a say in the decision? You are old enough to get married and have a baby, you both should be thinking for yourselves. \n\nI’m going with ESH for both of you, this is a decision that you should be making together, not through ultimatum. \n\nSeriously how are you guys going to handle the tough decisions that will come in the future if this is how you’re handling this one. The stress is only going to multiply now that you have a child, The two of you need to grow up and start figuring out how to talk with each other like adults. Counselling might be a good idea.",
              "id": 51,
              "comments": [
                {
                  "score": 409,
                  "content": "I'm sure from OPs husbands view, they did talk like adults about it. Before they got married. And they agreed on his name for kids. Now OP is just blindsiding him last minute with a change out of nowhere.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 148,
                      "content": "People have the right to change their minds. This is her child too",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "I'm a new father and we discussed having my last name for our daughter, and my wife gets final say on their first names and middle names (we do discuss them thougj, obviously lol. There has been some vetoes, which often are along the lines of \"omg no, I grew up with a someone named ___ and I can't stand it\").\n\nIf she came to me half way through the pregnancy, after we already discussed and agreed on our child taking my last name, saying \"oh I talked to my family and they all agree the baby should have my last name\" id be really upset, personally.. not only because she's changed her mind about something really important to me, but that she talked to her family before me.\n\nIt means a lot to a father for their child to have their last name. The mother bears the child, breastfeeds the child, and is their primary caregiver (especially in the first few months) and bond immensely; thats just the way it is and has always been. It may seem silly but the last name is a way for fathers to bond with their children and feel pride and connection in a way that fathers can't really otherwise. I obviously bond with our daughter, and helped a lot and still do (our daughter is 11 months) but when our daughter is inconsolable or cranky or tired or sad, she wants her mom and I totally understand, and im glad my wife has that connection. Which is not to say if our daughter didn't have my name I wouldn't love her and be bonded with her, but it honestly makes a difference to me, silly as it may be.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Bring in Judge Judy, she's ready to back  up your common sense take",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I do agree that that talked about it, I’m referring to them both running to their parents whenever something is wrong.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "They originally did make the decision together, but now OP has decided not to follow through.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1068,
          "content": "This. I’m pregnant and found myself in a similar situation with my husband. Didn’t talk to my parents about it because they’re not in my relationship. Sat down with my husband and had a great conversation about what we had agreed on, how I was feeling and how we could compromise. From making my last name the kids middle name or hyphenated all understanding I had already agreed to something else and was ok to go back to it because I’m big on promises. We compromised at a hyphenated name. You can’t have effective communication until you remove your parents from your relationship. They will never give you an unbiased opinion. OP is the AH because they didn’t talk like an adult to their own spouse.",
          "id": 58,
          "comments": [
            {
              "score": 339,
              "content": ">You can’t have effective communication until you remove your parents from your relationship.\n\nFuckin truth, my mother in law lives with us. And even if she witnesses my wife being ridiculous and starting an argument she always takes my wife's side. Like I can't blame her for taking her daughters side, but at the same time I get ganged up on, in every argument that she noses herself into.",
              "id": 59,
              "comments": [
                {
                  "score": 48,
                  "content": "That has to be aggravating, hope it doesn't last too long <3",
                  "id": 60,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Until one of us dies, we sell the house, or divorce. So probably not going to be quick lol",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I took this as basically saying “I hope she croaks soon”. I’m sure you didn’t mean it that way. It’s probably just my macabre sense of humor 😂",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Tell her to get her nose out or your relationship or get her ass out of your home.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I think it is important to note that OPs husband also needs to take this step and cut the cord because a he is also using his parents and family to pressure OP into making that promise in the first place. Frankly ESH in my opinion.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Like all things in being a parent, you just don't know how you'll actually feel until you're actually a parent. I feel like agreeing to a name before having the baby is fine but definitely subject to change!!!!",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "If you’re still pregnant, please give a lot of thought into how the hyphenated last name flows. My parents hyphenated my last name and my entire life having to spell it out over the phone and in person or just whatever has been absolute hell. Just please think of the kids quality of life in this regards, I legit wish my parents would have just picked one name and gave it to me, my life would have been so much simpler.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 344,
          "content": "This right here. My family were always pissy with me because I never discussed my marital affair with them. I simply told them that what happened within my 4 walls was none of anyone's business but mine and my husband's. We've been married for over 30 years and I honestly believe it's because I never did discuss our private affairs with anyone else.\n\nThis is the advice I give all young people when they ask me the secret to a happy marriage. I always advise them to keep their marital matters, no matter how trivial within the marriage only. \n\nDon't tell your friends - they will use it for gossip fodder eventually.\n\nDon't tell your family - they will interfere and use the information against your spouse.\n\nAs for OP, yes you are the AH. First you agreed to your children taking your husband's last name and suddenly changed your mind. Worse, you're discussing with your family a matter that is none of their business but also one where you know they'll take your side.",
          "id": 67,
          "comments": [
            {
              "score": 61,
              "content": "Unless there is abuse going on! This is how abusers never get found out, because they spouse is keeping it to themselves!",
              "id": 68,
              "comments": [
                {
                  "score": 18,
                  "content": "This is how I got abused! Adhering to the policy. The policy is good, btw. It needs a few caveats, but it has made my healthy relationships that ended turn into lifelong friendships and a generally low drama life. \n\nPost abusive fucker: I now have two friends in different timezones who hear everything. Good, bad, ugly. Neither are imbedded in my day to day life, but they can catch worrying behavior and keep track of justifications better than I could.\n\nThe abusive relationship has only happened once, but it kinda wrecked my life for a few years so I'd like to avoid it.\n\nA good rule of thumb is if suddenly you feel really confused and blindsided by why your partner is upset with you after you've tried to ask them, talk it out with a third party who gives a shit about you and isn't a blood relative. It's an early boundary breaking technique.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That approach doesn't work. If you're not comfortable sharing about your relationship, you are unlikely to share when you are being abused. Even people who DO regularly share about their relationship with others struggle to admit being abuse victims.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">We've been married for over 30 years and I honestly believe it's because I never did discuss our private affairs with anyone else.\n\nThis. I've been married for almost 25 years and one of the reasons is because we decided to not go running off to our family to vent, ever. I have a sibling who did the opposite and told my parents about something in their marriage; since then they've forgiven their spouse but my parents continue to hold a grudge and expect my sibling to hold a grudge. Same with my SIL. You can't say my BIL's name without my MIL rolling her eyes, and the guy doesn't deserve that.\n\nBecause my parents, and any family outside the marriage, don't get the whole picture. They only get what you want them to know, and you're only going to tell them what you want them to know to be on your side.\n\nIf you need advice or report abuse, seek professional help. A third-party you can trust, but it should *never* be a family member of yours (heck, their family members are almost a better choice).\n\nHonestly, they should pound this home in pre-marital counseling.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "But what if you need help, or just another viewpoint?",
              "id": 72,
              "comments": [
                {
                  "score": 3,
                  "content": "Needing help is one thing but even then I would be very careful about who I confide in.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I agree with this so much. My ex husband ran to his Mom ANY time we had an argument or disagreement. From a small silly argument to huge ones. Of course it would all be from his POV and was usually filled with lies (he was very controlling and emotionally/mentally abusive with me) and I rarely told my family about these things. They brought it up to me a few times because of how controlling he was and how unhappy he was. There are times to talk to your family about things if you’re in a really bad or unsafe situation but for things like this, you keep it in your marriage. It just seems like nobody knows how to effectively communicate, or communicate at all anymore - nor do they know how to compromise. It’s all about being right and that’s no way to have a marriage or any relationship for that matter.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 326,
          "content": "They need to leave their families out of this discussion, like seriously wtf",
          "id": 75,
          "comments": [
            {
              "score": 10,
              "content": "Some people seem addicted to drama. The more you involve family, the more drama.\n\nSeriously wtf, I agree. Who needs that level of stress?",
              "id": 76,
              "comments": [
                {
                  "score": 6,
                  "content": "Right? My future in laws are irritated I don’t want only my partners last name and he wants to hyphenate with mine. But we just shut the conversation down now since it isn’t their business what we choose to do and how they want our future kids to have only his name. None of their business at all but so nosy! I can’t imagine getting heated and talking about it with my mom then talking to him, and him talking to his parents and getting them upset. I just am so boggled over this entire thing",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "I agree with you. I’d be so pissed if my husband spoke about an issue with his family before he spoke to me. Couples should communicate with each other first or somethings wrong.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "Right? Both of them are guilty of letting their family influence their decisions here. Leave Mom and Dad out of it, you’re adults. \n\nTons of stories on the sub about two people having an argument and then one party enlists their friends and family to start harassing the other. That would get people blocked from me.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "This comment deserves top place, OP, this decision is between you and your SO. And it sounds like you did have an agreement, it's strange for you to break the agreement without cause. Talk to your SO about that, and if necessary, a marriage counselor, not your family, shouts from the peanut gallery aren't helpful. No one belongs between you and your partner putting in their two cents, would you put up with that from him? \n\n\nWork it out like an adult, And be sure to keep it in perspective, weigh how much it matters to you both, against what it will cost you to get your way. Trust is a huge part of marriage, put your trust in you two as a team.\n\nSoft YTAH\n\nEdit to add: a lot of people choose to give the maiden name as a middle name so they can pass it down and keep it in the family, maybe discuss with him if this is a good option for your family (by your family I mean immediate family, you, your SO, and children)",
          "id": 80,
          "comments": [
            {
              "score": 59,
              "content": "Agreed that these people have terrible communication and should keep their families out of their marriage. But why isn't OP allowed to change her mind? What is \"cause\" for you? Haven't you ever agreed to something to keep the peace and discovered later that it actually really bothers you? Ideally they would be able to work this out amicably and respectfully, but the idea that I'm never allowed to change my mind in a relationship without being able to justify it to someone else's satisfaction is a little scary.",
              "id": 81,
              "comments": [
                {
                  "score": 4,
                  "content": "To give you what I hope is a thorough answer there is nothing wrong with changing her mind as such, but I think one needs to understand going into a situation like this that a previously settled agreement does make a difference. \n\nIdeally they will talk and ultimately find a solution that keeps them both happy, but in a situation where their differences are truly irreconcilable on this matter I think it's correct to honor the previous arrangement. No one parent has more right to matters of heritage over another. It could certainly be argued that a mother should get extra say given the time, difficulties, and dangers of carrying a child to term, but I don't think that extends to this here.\n\nIt's also not some universal thing. Some agreements should have more room than others for a parent or partner to change their mind. Parenting and relationships are all about understanding when and how to compromise, when and how to advocate for yourself, and far more importantly how to communicate these things. I would never expect a partner to honor certain agreements if their minds change, especially when their bodies are involved. You want to stop shaving? You want to dye your hair? You want to bulk up or get plastic surgery or tats all over you or whatever? I'd like to talk about it, but ultimately it's your call 100%. Even if we talked about those things earlier.\n\nDecisions for a child that is equally ours, though? The previous arrangement carries more weight. The child is ours and decisions about how to parent them and what to call them should be equal and based in strong communication. \n\nI guess the ultimate answer for why you need cause to go back on a naming agreement is because that's not just a decision you're making for you. It's a decision you're making for me as well.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I personally disagree that the prior arrangement should always take precedence in a conflict, but your response is very reasonable and I agree with most of it. \n\nI don't have an answer about what should take precedence given that both partners/parents have equal voices. It's probably one of those things that each couple needs to figure out ground rules for themselves.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I would respectfully disagree that “a previous arrangement carries more weight” in this situation because discussions and agreements of *hypothetical* children feel wildly different once children become reality. I would personally equate many of those to the same level of “you pinky swore back in middle school, and now we’re 30”. \n\nOnce a pregnancy or possibility of children is imminent is when those big talks should be revisited. And as soon as one of them reflects on a decision and begins to think differently, they need honest dialogue about it. Communication and flexibility are such critical skills for coparent",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I don't think it's -wrong- to go to your parents/siblings for guidance or perspective on something before confronting your spouse about it, especially if it's that kinda nebulous \"I'm upset about this but can't articulate it yet\" \n\nwhere it becomes an issue is when people take that moment and use it to gas someone up for a fight instead of providing level headed advice. Like... it makes a huge difference if it's a toxic family relationship vs a healthy one.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14940,
      "content": "You literally mention that you’ve had this promise at least since you were married and have both discussed and agreed! He is right to be upset knowing you have already agreed and it’s a big deal to his family, which you are aware of, in my opinion YTA, not for wanting to include your last name but for promising your husband his last name for the kids and then going back on that and starting a huge fight over something you guys has already agreed upon a while ago. It must be out of nowhere for him, yes you are the wife and future mom but that doesn’t mean you can just switch sides and go back on your word whenever you feel like it.",
      "id": 86,
      "comments": [
        {
          "score": 5083,
          "content": "I agree YTA for all the above points, plus I notice how when having a change of mind, OP speaks to HER family then comes home with an ultimatum! Why not of just speak with the husband instead?",
          "id": 87,
          "comments": [
            {
              "score": 1343,
              "content": "I never discuss marital issues with my friends or family, it’s not their marriage and they shouldn’t have any input. Family especially is an incredibly biased source.",
              "id": 88,
              "comments": [
                {
                  "score": 773,
                  "content": ">Family especially is an incredibly biased source.\n\n\"But honey, all my family can assure you I'm right!\"\n\nyeah, no shit",
                  "id": 89,
                  "comments": [
                    {
                      "score": 187,
                      "content": "What are you trying to say? That my mom has a biased opinion about this? Are you insane?",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Dude this is why couples therapy is so helpful. When my wife and I were seeing someone she would have no problem saying who was the asshole or if we both were. It honestly saved our marriage having someone impartial to talk to. Families aren’t always that way.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 74,
                  "content": "I know, it can also cause an echo chamber. I feel like people go to family for marital advice when they want to be backed up rather than wanting real advice",
                  "id": 92,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yes, I agree with this. For me I tended to reach out to friends if I was having relationship issues, but it was more for validation that I wasn't in the wrong, not for advice.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Not only that, but discussing marital issues can lead to them disliking or holding grudges against your spouse for things that the two of you have settled and let go of. \n\nMy friend used to run to her mom about every little thing when her husband upset her. I warned her that that wasn’t a good idea. Now she complains to me about how her mom absolutely *detests* her husband and her husband and mom no longer get along and it puts her in the middle - the two of them initially had a really good relationship. \n\nI said, “of course she does! She’s spent years hearing about all of the things your husband has done to piss you off or upset you, and she’s only heard it from your side when you’re angry/upset about it and are likely consciously or subconsciously exaggerating the situation some to make him look worse because you’re upset with him. You don’t call her about all the lovely things he does, just the shit ones, and now she’s holding all of those things against him because you’re her child and she wants to be on your side, so to speak.”\n\nShe learned that lesson the hard way.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Also a great way to make your family hate your partner. If you tell them every problem, you may be able to move past them but your family will hold onto them.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Did you notice that his major argument is HIS family won't agree to it? Why does it matter what his family thinks?",
              "id": 96,
              "comments": [
                {
                  "score": 3,
                  "content": "Agreed! Personally the decision is for the the parents and both sets of in-laws should butt out",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "They're both guilty of this imo, she's worse but then he was like, \"you can't do this it'll make my family mad.\" Bro? How about we leave this decision up to the two of you?",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I'm not reading an ultimatum in there. \n\nOP seems to have strong feelings, and is stating that she changed her view. She wants to discuss what to do. \n\nCan you point me to where she's giving him an ultimatum? I'm just plum not seeing that. Huh. Curious where you're reading that.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Both families have ultimatums. \n\nBoth are AHs for including their family on this decision. Op is soft y t a because she had a deal and is going back on it. I say soft, because the idea that kids automatically get their fathers last name isn't a fair tradition.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I was given a hyphenated last name, so I had both parents last names which is a situation I haven't heard anyone else have",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The only thing that gives me pause is when hubby say s “no way he and his family will let me do this to his son”.  First of his family gets no say and, secondly, it’s not just his son.  She shouldn’t be allowed to make a unilateral decision about it but OP should be able to open a discussion about it.  People are allowed to change their minds.  Obviously she didn’t approach it the best way but she can change her mind.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 514,
          "content": "But people are allowed to change their mind. That’s the thing, we all continue to evolve. \n\nOP offered the compromise that it be a hyphenated last name. Seems fair.\n\nETA: and for all we know, she could have been casually bringing up her changed views and they were dismissed. I know if my views were dismissed I would certainly go to my family to ask if I was being ridiculous. \n\nOP did you mention your change of view in any form to your spouse before talking to your family?",
          "id": 103,
          "comments": [
            {
              "score": 299,
              "content": "Yeah I'm a little confused by everyone being so mad that she discussed it with her family. It's ok to need a sounding board to make sure you aren't biased by your own perspective. It's not like she discussed something super intimate or private with outsiders. She also didn't send her family to harass her husband, like we see a lot on this sub.",
              "id": 104,
              "comments": [
                {
                  "score": 115,
                  "content": "It is okay to discuss, but stamping the decision with your family and simply informing your spouse is not the way to have these conversations. She does get to change her mind, I honestly don’t care about the coerced hypothetical she was forced to agree to,  but she needs to have that complete talk with her spouse. Also, why either of them feels they should get the ultimate say, without discussion with each other, I do not know. Technically she does birth certificate wise, but relationship wise this is supposed to be a partnership, so unilateral choices regarding kiddo should not exist. This is a bad foot to start on regarding how they will communicate as parents, if each feels they have sole ownership and say over this kid. \n\nESH, for his comments of “I just can’t do it”, yes you can, it’s quite simple. For her just making a decree as opposed to discussing and leaving family preferences out of it. Both of their families don’t get a say, it’s their kid.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It was \"I can't just do that\" and the \"I\" is referring to OP. He's saying she can't just go and discuss it with her family and then present him with the decision they made without him. And he's right to say that. You can't say 'this is what I'm naming my child, my family agreed to it, sucks to be you' to the other parent and expect that to be OK, especially when you've had a longstanding agreement to the contrary.\n\nThe current stance from husband and his family isn't the most mature but what's he supposed to do when she's behaved like this? God help that kid with parents who can't act like adults.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 260,
              "content": "This is one of those times where I wonder if this forum trends very young. Like, you can have adult conversations all you want, but things change. Things change as you grow older and things change when a hypothetical becomes a reality. Does it suck? Yes. Is life as simple as one time I agreed to something so now I am beholden to that forever and ever? No. I am baffled by all the automatic YTA because they had \"settled things before.\" That is a really, really immature way to approach a relationship, more along the lines of what I thought when I was a teenager. \n\nI think the compromise of the child having both names is a good one and not one deserving him coming back with \"my family and I won't ALLOW you to do this to HIS son.\" She is suggesting compromises and getting shot down and yelled at. Wild that somehow makes HER the sole asshole according to people here. I would go ESH or maybe even mildly in the NTA side just for how he reacted.",
              "id": 107,
              "comments": [
                {
                  "score": 75,
                  "content": "[deleted]",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I'm usually amazed how many people think that important opinions made never shift or change.  In this case, however, I think there's a lot of context that's leading people to the judgements.  There is a lot of \"I\" in this post (maybe not literally, but the sentiment is there). She wants, she's decided.  They discussed it and came to an agreement.  Good.  She feels differently now.  Still good.  She's decided something different without having a conversation (ideally mature) with him, and while some people talk things out with family before going to their spouse, it comes off a bit definitive here.  \n\nSo I agree that he shouldn't be saying his family won't allow it, but it reads a little like she's saying the same thing about her family. I guess I'm saying it's fine that she's changed her mind, but I think her execution of it might be leaving something to be desired.  His first reaction was confusion since he was, in essence, blindsided on a decision he thought was made long before. Then any communication they had just went to all hell.  So they both failed at that point.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I think people are mostly saying YTA not because she changed her mind, but because she went to her family and brought them into it before discussing with her husband.  \n\nI’m a big believer in when you know an issue is important to your spouse you discuss a compromise with the spouse.  Don’t go discussing the issue with other family members first.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm hardly a child and married for nearly 8 years.\n\nOP isn't an asshole for having second thoughts, but the way she handled this was quite poor.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Except her opinion is the baby should either have both names or just hers. She at this point isn't considering how her husband feels if she thinks the baby having just her name is reasonable.\n\nIt's ok to change your mind but she also made an agreement. So are we then to just accept that agreements don't matter? We all do things we don't want to do at times. Part of being an adult is living up to promises made. Especially when you knew going into this situation how important it was to your spouse. It's selfish and she clearly feels like it's more her baby than their baby.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "I was given a hyphenated name, never had an issue with it.",
              "id": 113,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Also as if no woman ever was railroaded into taking the traditional path ‘for compromise’ etc. Things presumably come into a somewhat different perspective with a huge change like, I dunno, gestating a child.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I will not lie to you, hyphenated last name is NOT a compromise. I have a hyphenated last night and it is nothing but HELL.\n\nExamples: Been to court. Judge dismissed charges. Found out a year later when I was taking state mandated bar class to get my liquor license renewed for work that I HAD A WARRANT OUT. Why? Oh, because when they dismissed the charges, they only used ONE of my last names and not BOTH that were tired to my SSN.\n\nAnother example: Going to jail, getting bailed out, and…oops. I was stuck in there a week. Why? My name got glitched out in their system. So, I didn’t exist. For a week. After bail being paid.\n\nDoctors? Oh, Lord, not a single one of my doctors managers to have any coordination on my last name. Same with pharmacies.\n\nMy debit card and credit cards are all different.\n\nAirplane tickets (haven’t flown since 2015) were always a nightmare because they wouldn’t accept my name online.\n\nThose are some examples but it was a problem in high school, in college, and even my W2 doesn’t haven’t my full last name!!",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 337,
          "content": "**She's not allowed to change her mind?**\n\nHe's perfectly within his rights to be upset that she has done so in the way she has, but beyond that I'm not sure why his family and him think they have a claim over babies they won't even birth. They should just use both their surnames and end this conflict already, that's a perfect compromise in my opinion.\n\nETA for her changing her mind and going through her family first, along with deciding it would only be her name and not only his, and husband and family for their pressure in making her choose this anyway.",
          "id": 116,
          "comments": [
            {
              "score": 223,
              "content": ">She's not allowed to change her mind?\n\nSpecially since the original deal wasn´t fair to begin with.\n\n\"What do you mean you now want to have rights too?\"",
              "id": 117,
              "comments": [
                {
                  "score": 148,
                  "content": "I don't understand all the Y T A. IMO it's ESH. I feel like OP should've definitely had this conversation with her husband first and not her family, but his family pressuring her to give their children all his last name was unfair in the first place. It is okay for OP to change her mind and want to discuss a new solution.\n\nEDIT: I will say OP should not be threatening to unilaterally make the decision and give the kid her last name. She should be fighting for hyphenation, not saying it's hyphenation or her last name. If they can't come to an agreement somehow, she should just write both names on the birth certificate anyways. Both people want their last name so both should be there, imo.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "I’m very interested in this “deal”. She mentions agreeing for the child to have his last name at the same time as the discussion on keeping her maiden name and he says “you broke your part of the deal”. To me this suggests that she got to keep her maiden name in exchange for the kid having the husband’s name. Or at least that he views it like that- he phrases it in a way that suggests he kept up his end of the deal but she broke hers, so he sees himself as ‘letting’ her keep her maiden name. All seems fishy to me.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 80,
                      "content": "And the \"he and his family will not allow this\" like ummmm wtf",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Yeah like.... \"allowing\" someone to keep their last name is *not* a valid bargaining chip. Her name and the child's name are completely separate topics! She has a whole fucking identity tied up in that shit. It wasn't a fair agreement in the first place IMO!\n\nNow, say, if she wanted to name the boy after her father or relative, or just a name she likes, and the husband said \"okay, that's not my first choice, but if he can have my last name, I'm okay with that\", then THAT is a fair compromise!",
                      "id": 121,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "YESSSSSSS FINALLY.  \nThis is the best point here.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "OMG THANK YOU - the original deal was such bullshit. This is the deal: OP keeps her name, kids get hubby's name OR she gets husband's name and kid's get her name? That neither parent has? Yeah okay. I have a bridge to sell you\n\nOP's husband essentially did a \"heads I win, tails you lose\", and people are mad OP didn't stick with that?\n\nHer communication sucks so ESH, but how is everyone thinking Hubby did nothing wrong here?",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Everyone is jumping on her for going to her family first, which is normally something I wouldn’t support, but he already has the full support and backing of his family, which he immediately threw in her face when she tried to discuss this with him. In this case it’s understandable why she may have wanted some support and backing prior to going in to the conversation.",
              "id": 124,
              "comments": [
                {
                  "score": 7,
                  "content": "This is true, I can't believe everyone is excusing the husband when he is doing the same shit",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 281,
          "content": "Plus, her argumentation is \"it's not fair to the baby\"... unless OP last name is an incredible blessing or her husband one has some bad meaning, I don't see the difference for the baby..",
          "id": 126,
          "comments": [
            {
              "score": 72,
              "content": "Yeah if the husband's name isn't something like Hitler that would get the kid made fun of, the baby isn't going to care. The kid won't know any different between Smith and Jones or whatever.",
              "id": 127,
              "comments": [
                {
                  "score": 9,
                  "content": "I'm getting flashback's to last week's \"Bin Laden\" post.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I didn't see that one, but I am really hoping someone wasn't naming their kid Bin Laden.",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Oh my, did you read *born a crime*? Yeah. Good stuff.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 251,
          "content": "I mean what was the deal? She gets the privlige of keeping her own name in exchange for her sons? Seems like some rumplestilskin shit",
          "id": 131,
          "comments": [
            {
              "score": 222,
              "content": "Right, people are conveniently overlooking that her husband is demanding she sticks to the \"\"Deal\"\" which was apparently that he let her keep her name in exchange for the naming rights to the children.\n\nSeems like casual misogyny, just another day on reddit.",
              "id": 132,
              "comments": [
                {
                  "score": 38,
                  "content": "I don’t get why he’s even against having two last names? Why people have to stamp their ownership everywhere?",
                  "id": 133,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Because the other dudes will call him a pussy or something, who knows. People are just really attached to their traditions and never think about them from the point of view of those not benefited.",
                      "id": 134,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "She is absolutely allowed to change her mind, and considering how patriarchal the custom is to begin with, I honestly don't blame her for having second thoughts now that the baby is real and not just a hypothetical someday child. What makes her TA though is dragging her family into her marriage - she and her spouse need to be a family and a team, with no input from \\*any\\* relatives on either side - and for using the silent treatment as a weapon. The silent treatment is straight up abuse, not to mention immature -- they are both guilty of that, so I guess more ESH? TL;DR they need to learn how to communicate, compromise, and discuss their problems like adults before they subject an innocent baby to their toxic lack of communication skills in their marriage.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Honestly it sounds like it was always \"him and his family against her\" with the naming debate. In that case I understand why she looks for support in her own family, she's outnumbered. Or maybe I'm reading to much into the post.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "The deal actually makes no sense whatsoever. Because if she had made the OTHER deal, supposedly, she would've taken her husbands name and their kids would get her name that she no longer has? Yeah sure, seems like a deal that Mr. I-Won't-Let-You-Do-That-to-MY-Son would have gone through with, makes total sense",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I agree with you and know what you’re saying but “naming rights” just makes me think Husband is like “His name will be Wells Fargo Jones. I’ve already agreed to naming rights!”",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 239,
          "content": "Agreed- it would be a different situation entirely if she had just approached her husband and mentioned her feelings. Instead she got outside opinions and came with ultimatums. I don’t know why people avoid honest communication so much...",
          "id": 139,
          "comments": [
            {
              "score": 70,
              "content": "You aren't the first person I've seen mention ultimatums, but where exactly are they? Unless OP edited her post, I don't see anywhere where she threatens anything if her husband doesn't go along with it. She should have gone directly to her husband in the first place, but otherwise it seems like she was straightforward about (1) how she felt their agreement was unfair, and (2) she doesn't want to be held to the agreement anymore.",
              "id": 140,
              "comments": [
                {
                  "score": 16,
                  "content": "From the OP\n\n> So I went home and told my husband that I've changed my mind about the last name thing and want to either have both our last names combined or my last name to be given to our son.\n\nIt's not a \"My option or I'm leaving\" ultimatum but a \"You'll compromise, or you get nothing\" ultimatum.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Agreed she should have just talked to him, but this isn't really an ultimatum. It's just her telling him two possible options she preferred.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "Gosh, if everyone was expected to unquestioningly stick to agreements they made as newly wed 23-year-olds, a lot of people would be in *a lot* of trouble. \n\nActually *being* pregnant and staring down parenthood is a pretty normal time to re-evaluate that kind of thing. A previous agreement made years ago outside of the situation should definitely still be up for discussion.",
          "id": 143,
          "comments": [
            {
              "score": 5,
              "content": "There are a lot of people in a lot of trouble... the $499 divorce billboard on my drive home backs that up.",
              "id": 144,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "She has the right to change her mind on such a big decision. She never should have made a promise like that as she is subject to change her mind at any time, but at the end of the day she didnt promise to pick him up something from the store or pay for dinner, she promised to give up sharing her last name with her child.",
          "id": 145,
          "comments": [
            {
              "score": 256,
              "content": "> her last name with her child\n\n**Their child.** This is his child too.",
              "id": 146,
              "comments": [
                {
                  "score": 76,
                  "content": "I mean she did put in the table the option of combining the last names. So she is not being unreasonable and by doing so acknowledge the whole THEIR child situation",
                  "id": 147,
                  "comments": [
                    {
                      "score": 60,
                      "content": "She said her last name only or a combined name. I get that it’s not any more equitable to have his last name only but why is she pushing for her last name only as an option, then? Her motivation doesn’t seem to be about equity.",
                      "id": 148,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Agreed. Promises that go too far into the future are generally unreasonable to expect to uphold. Life is too volatile to make a promise years in advance.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": ">future mom\n\nYeah and usually when someone pulls a \"well I'm the mother\" card to levy power over parenting decisions, that usually makes them TA!!!!!",
          "id": 150,
          "comments": [
            {
              "score": 81,
              "content": "Same thing counts for when someone says \"well I'm the father.\"",
              "id": 151,
              "comments": [
                {
                  "score": 33,
                  "content": "I agree! These decisions need to be made together.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 17,
                      "content": "They were. Someone is flip flopping on the decision now.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Wasn’t it? Did she say I want to keep my last name and after he said okay she started hearing the charlie brown adult voice and just nodded her head?",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Did she though? It sounded like she just re-opened the discussion and was happy for it to be both names.",
              "id": 155,
              "comments": [
                {
                  "score": 14,
                  "content": "I disagree with how she reopened this discussion. She got her family involved and immediately kicked off with an ultimatum. I can understand why husband would be shell shocked.\n\nMy comment was more directed towards comments saying \"she's going to be the one in the delivery room, she can just slip the name she wants on the birth certificate\" as if that wouldn't make her massively TA",
                  "id": 156,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I dunno, it sounds pretty normal to go to your family/friends/usual support people as a sounding board when you’re trying to figure out if you’ve got a point before you open a whole can of worms. Plus, his family sound like they’re pretty deeply involved, why should it be husband and his entire family vs OP on her own? If he can say ‘I have a point because my family thinks so’ then surely it isn’t wrong for her to have that same kind of backup. \n\nI agree that it’d be wrong to underhandedly put anything on the birth certificate. You can’t actually do that where I’m from.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": ">My comment was more directed towards comments saying \"she's going to be the one in the delivery room, she can just slip the name she wants on the birth certificate\" as if that wouldn't make her massively TA\n\nI see what you're saying there. But, that's 100% not what OP is saying or seems to intend. \n\nShe's literally just trying to discuss a change of feelings on a very important topic. No ultimatum. \n\nAnd so many commenters are treating her like she said something like you're pointing out. \n\nIt's kind of telling that she isn't doing any of those asshole things, right? \n\nWhy leap to the idea she will do such an asshole thing when OP's post is describing her trying to have a discussion, with absolutely nothing like this in it.\n\nI mean this whole comment with curiosity. Not trying to slam anyone ... just finding it all interesting, fwiw.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "She said “I’m the mother and I get a say *too*”, she’s clearly acknowledging that it’s up to both of them.",
              "id": 159,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "That's true. \n\nAnd, I don't see that in card being played in OP's post. \n\nI hear her stating that she's changed her mind and wants to have a discussion. That seems totally fair to me.\n\nShe didn't change her mind and tell him 'you need to do this!' she changed her mind and wants to talk. And, compromise. \n\nWhere does she say anything along the lines of 'well, I'm the mother!' ... what are you referring to, specifically, in her post?",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "This is something that needs agreement, though. It sounds like she just went along with it because the inlaws were pressuring her, and now she's reconsidering. \n\nI don't think anyone is TA here, she's changed her mind and something as big as her child's last name shouldn't be boiled down to a 'you promised!!' argument.",
          "id": 161,
          "comments": [
            {
              "score": 15,
              "content": ">something as big as her child's last name shouldn't be boiled down to a 'you promised!!' argument.\n\nExactly!",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7150,
      "content": "When you changed your mind from an agreement made with your husband, the first place you went is your family to discuss it. Now instead of an argument with him the whole family is involved straight away. I would be pretty upset if my wife did this to me.",
      "id": 163,
      "comments": [
        {
          "score": 1528,
          "content": "She went to where she would be validated and get her way first so she could bring a lot of backup in to try and overpower him. She knew she agreed and knew he would have a problem with her change of heart and instead of talking like partners she went to the people she cares about more first to get her way. This doesn’t seem like a marriage that is in great shape.",
          "id": 164,
          "comments": [
            {
              "score": 342,
              "content": "My question is how is this different than his family pressuring her into this agreement in the first place? She doesn’t talk about just her husband wanting his kids to have his last name but her husband and his family. Both are seeking validation from their families instead of talking and working together to come to a compromise.",
              "id": 165,
              "comments": [
                {
                  "score": 84,
                  "content": ">My question is how is this different than his family pressuring her into this agreement in the first place?\n\nBecause she was free to laugh in his face and walk away from the relationship since presumably they talked about it before the wedding day.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "It's might not be different, but we don't actually know what the husband's family said or the context in which they said it.\n\nI mean if OP and her husband disagreed and then the family started reaching out umprompted (or worse: prompted by husband) then that would be one thing.\n\nIf they were all together for an event and the subject happened to come up and people expressed their opinions, that's a whole different thing.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "There’s no indication that OP’s husband’s family was involved at all, other than they feel strongly about their last name.",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "I agree but they made this agreement before they were married. He knew how important his children having his name was to him and his family and it quite possibly could have been a deal breaker for whether he would marry her.  Her backing out of that agreement now makes her TA.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Think about it, if OP is making decisions like this without consulting her husband, think about all the other times they've had issues with her making brass decisions without him. I can see why they pressured her, that is if they even did and OP is wording it differently. Maybe they begged her because she refused to at first, who knows. But I feel like she's making herself seem more innocent than she really is.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": ">She went to where she would be validated and get her way first so she could bring a lot of backup in to try and overpower him.\n\nAnd now she's doing it again, clearly thinking she would be validated here.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yes exactly!!! This comment is right. She is rethinking an agreement they had. Conversations and flexibility should be available in a marriage",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4361,
      "content": "ESH \n- you for going back on what you said you’d do. \n- him for saying “there’s no way he’ll LET you do it”\n- and his family for getting involved in something that frankly is none of their business.\n\nEdit to add - that the OP’s family getting involved is also shitty, apologies I missed that out originally.",
      "id": 173,
      "comments": [
        {
          "score": 694,
          "content": "And her family as well for getting involved and pushing her to go back and compromise on what the couple already negotiated.",
          "id": 174,
          "comments": [
            {
              "score": 112,
              "content": "Sorry I missed that in the body of text but yes I agree. They are both adults, in an adult situation, no need for either side of the family to poke their nose in.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 149,
          "content": "100% agree with all of your points. \n\nAdding: I have no problem with hyphenating the baby’s names if both parents agree on it. I’m kind of laughing at her saying it’s selfish of him to want his kids to have his last name and then going on to say if we can’t hyphenate it I’ll give the baby my last name. How is giving the baby only her last name not just as selfish? \n\nI’m a traditionalist (at least in the US) when it came to naming my kids. Mine have their dads’ last names (may my first ex-husband Rest In Peace) and I kept my 2nd ex-husband’s last name after our divorce because my youngest 3 kids wanted me to have their last name still. I kind of wish I had used my maiden name for one of my boys’ middle names now though because I do love my maiden name. I don’t know if that is something OP could do to incorporate their name in the baby’s name while keeping their agreement with their husband.",
          "id": 176,
          "comments": [
            {
              "score": 17,
              "content": "I like the idea of using the maiden name as a middle name. My dad has his mom's maiden name as his middle name and I have heard of plenty of other people that have used their maiden name or a grandparent's maiden name as a middle name. Plus there is no guarantee that the son wouldn't take a future spouse's last name. I'm not a huge fan of 2 last names if it isn't a cultural thing because they can just get so long especially when one of the names is already long.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Also people forget you can just give a kid two last names. There does not have to be a hyphen, it does not have to a middle name. My husband is from Latin America, he has two last names, and in the last name column or section we just write them both. My kid will have two last names, no weirdo hyphen.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Did we read the same post?  This is what I read: “he said I can’t just do that and called me selfish when I pointed out that I’m the mother I get a say too.” \n\nHe called her selfish.  She didn’t call him selfish - unless it’s in a comment somewhere that I haven’t read.",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "There’s literally nothing he can do to stop it. It’s a figure of speech. Also, he is reacting to something in the moment while she had unlimited time to plan the conversation. You don’t think he deserves a little bit of sympathy and patience?\n\nShe backed out of an agreement they made before they were married. It’s important to him and his family so they came to terms before entering the commitment. She decided to do something different after his lifelong commitment. \n\nI see this as the same thing as deciding after marriage that you’re not into monogamy. Wanting children to have your last name is a pretty standard desire. Pulling that off the table warrants separation. \n\nHe is definitely NOT the asshole.",
          "id": 180,
          "comments": [
            {
              "score": 9,
              "content": "Yea I agree. I have no clue how somebody could say the husband is being an AH? He seems to be having a very normal and rational response to this situation.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "> There’s literally nothing he can do to stop it. \n\nAnecdotally, with all of my kids, the nurses or doctors worked with me to do the birth certificate stuff while the wife was recovering from L&D, so there likely *is* something he can do to stop it.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "I agree except for the part where she's the asshole for changing her mind. She's allowed to change her mind and I'm sure going through all the discomforts of pregnancy made her realize that it's BS that society defaults to giving the kid the dad's last name when she's quite literally going to rip her body apart to bring the kid into the world. Not a great way to handle the communication about the change of mind though.",
          "id": 183,
          "comments": [
            {
              "score": 16,
              "content": "This thread is full of people somehow unaware that real-life experience can change your perception of things. Thanks for not being that.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I agree fully with what you have said in regards to changing her mind, I worded that poorly.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "“He said no way he and his family will let me do this to his son, as if my last name is a disgrace.“\n\nI don’t know why it seems like everyone is missing this crucial line, but I think it really serves to solidify the ESH. They’re both dragging their families into it, and he has some messed-up ideas about being entitled to pass on his name and his name only. (She mentioned she was willing to combine the names.)",
          "id": 186,
          "comments": [
            {
              "score": 12,
              "content": "I’ve brought it up in the comments below and was downvoted for pointing it out, told it was a heat of the moment thing. \n\nTo me it’s telling, we all show our true colours when angry and to me what he allegedly said is concerning. \n\nAgree though, ESH, just double-barrel the name and move on.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Right?? Like how are people not seeing the husband as an asshole here?",
          "id": 188,
          "comments": [
            {
              "score": 7,
              "content": "Too blinded by societal norms surrounding last names to see that he’s also showcasing some shitty behaviour...I await my downvotes.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3259,
      "content": "YTA 100%\n\n>. We already disgusted and agreed that any future kids we have will automatically take his last name.\n\nBoom. This right here is all we need to know.\n\n\n>He was confused saying we had an agreement and asking what the cause of this sudden change on mind.\n\nHe was confused, and rightfully so!! You had an agreement. You reneged.\n\n>called me selfish when I pointed out that I'm the mother I get a say too.\n\nYou did get a say, when you agreed to it. For all we know, it was *so important* to him and his family that that agreement was a precondition to marriage. \n\nYour poor husband.",
      "id": 190,
      "comments": [
        {
          "score": 774,
          "content": "For real. She said she wanted to keep her name, he immediately discussed children.\n\nShe doesn’t really think about it and “goes with it.”\n\nThat’s on her. He was being upfront with how important it was to him. She was being flippant, not really thinking about it. But she made the deal.",
          "id": 191,
          "comments": [
            {
              "score": 308,
              "content": "She probably \"went with it\" because she sensed that it might be a deal killer and she wanted to get married.  If she didn't really agree and just did so to humor him and get him married to her, then switched on him once he was stuck and a baby on the way, that's pretty terrible.  Honesty solves so many problems.",
              "id": 192,
              "comments": [
                {
                  "score": 84,
                  "content": ">Honesty solves so many problems.\n\nThis right here.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "This people say so much shit for the marriage and then flip quick as fuck",
                  "id": 194,
                  "comments": [
                    {
                      "score": 21,
                      "content": "And everyone is like \"itS a MaRRiaGe NOt a ConTRaCt\" but marriage \\*does\\* confer legal obligations and benefits - it \\*is\\* a contract.  And this was part of the negotiations, part of the conditions for making that contract.  OP absolutely knew it.  You can \"change your mind\" about things like wanting to go to the movies on Friday, but unilaterally changing terms jointly agreed on before the marriage happened 100% sucks.",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I guarantee you this is 100% what happened. Op YTA.",
                  "id": 196,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I similarly kept my maiden name and agreed our children would have my husband’s. I don’t really care about keeping my last name around for future generations at all, but there was still a part of me that wanted my kid to have my name once I was actually pregnant and it was getting close to the baby being born. I honestly was surprised I had that feeling at all. \n\nI never ended up bringing it up with my husband bc I sat on it and thought for a while, (and ultimately decided it wasn’t as important to me as I knew it was to him) so my son does have my husband’s last name. I don’t really regret it except for on occasion when something is logistically annoying.\n\nPoint being I don’t fault op for suddenly feeling this way when she didn’t think she would. But yeah “deciding” on it with her family first and giving her husband an ultimatum still makes her an AH. There are better ways to communicate with your spouse.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This is an easy YTA. This thread nails it. She's just doing whatever she has to to get her way. Manipulating people left and right",
                  "id": 198,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "I need to know more about this “deal”, though. What consideration did she get, what was in it for her? Having a baby? Does her husband not really want to be a dad? \n\nIf his willingness to become a parent was a reward for OP letting the kids have his surname, then they’re both using a goddamn baby as a bargaining chip, that’s so messed up.",
              "id": 199,
              "comments": [
                {
                  "score": 39,
                  "content": "She said she wanted to keep her name. He said, I have no problem with that and understand, but I want our children to have my name. She agreed.\n\nIt is was a discussion about last names, then it most likely occurred prior to the marriage. Maybe if she said no, they wouldn’t have gotten married and he would have found someone that will let his children have his name.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Look my husband and I have the same deal, have been married for 8 years and are only just now expecting our first child. \n\nAs someone who was never a “I want to be a mother” person, I was never sure if we would have kids, and I didn’t put much thought into their last names. \n\nNow though, I will admit I am slightly miffed that while I am doing the bulk of the work for the child, it’s his name that gets passed on. We have compromised easily in our case, but I totally respect OPs perspective because… thoughts and opinions change.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 433,
          "content": "People are allowed to change their minds. \n\nAre you saying if a woman agrees to something and then later says no you just carry on with what she initially agreed to because she shouldn’t be allowed to change her mind?",
          "id": 202,
          "comments": [
            {
              "score": 387,
              "content": "She's definitely allowed to change her mind. Anyone is and should be able to. \n\nWhat makes OP an AH here is that she went to her family before discussing this change of mind with her partner just to get them to gang up on him. She knows she was reneging on an agreement and would rather attack then discuss with the one person in life you should be able to discuss things with. \n\nOP and her husband clearly have some communication issues.",
              "id": 203,
              "comments": [
                {
                  "score": 326,
                  "content": "Why is everyone here ignoring that HIS family also pushed their wishes into the marriage since the beginning. Because it was important to them too, not just him. \n\nBut the moment she decides to step to her family she's the AH to everyone. If she is one, then he is too for persuading her in the begining with his and his family's demands. \nNow that it's sinking in she realized that she felt likely felt obliged to agree. \nI think that if both parents want to use their last name then just use both.\n\nEdit: Neither I nor OP is saying his family pressured her directly. Or that her family attacked him directly. It's all indirect influence. \n\nBut him mentioning their wishes shows that they have some influence over him and something that should be decided amongst the couple. And shows that he had discussed and put significance in his family's wants. If we agree that she shouldn't have involved her family. Then he shouldn't have either and their external wishes should be irrelevant. They need to figure this out among themselves.\n\nEdit: I'm not saying either is right or wrong(form your own opinion). However both have their faults and points. And both have done the same with including the family's wishes or opinions. So I'm keeping the same energy that either both or neither is in the wrong.",
                  "id": 204,
                  "comments": [
                    {
                      "score": 140,
                      "content": "It doesn’t say anything about his family pressuring her to do anything. It said that having his last name is important to his him and his family. Which is super common for male children especially in small families where there might only be a few male children to carry on the family name. She is wrong by going back on an agreement that is obviously important to her husband and the family she married into and bringing this problem to her family before her husband",
                      "id": 205,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 79,
                      "content": "Everyone can suck here.\n\nBut from the sound of it the involvement of his family, prior to this incident, was more of a cultural/societal expectation. Which is different then actively recruiting your family to attack your spouse. \n\nThe issue here, to me, isn't about a name. It's how this couple can't seem to work out their issues in a healthy way.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Because it sounds like they weren’t intervening. It’s just background information that it is well known to be viewed as an an important tradition in his family",
                      "id": 207,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "He was up front about this, that it was a priority for him and his family to have children have his last name.  That was (apparently) a firm condition of marriage and children for him. And she basically accepted the condition, then once it's a done deal she goes back on that.  It's not the same. \n\nI don't see why her last name couldn't be the kids' middle name, but I think she needs to leave the last name alone because she agreed BEFORE they married.",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "This isn't about what's \"allowed\", it's about who is the asshole. Breaking a pre-marital agreement with her partner after next to no discussion is enough to earn a YTA here.",
              "id": 209,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 56,
              "content": "You’re reaching very hard right here. It is not the same whatever you’re tryna say there at the end. \n\nPlus she obviously knows how important it is for her husband’s name to be included in their son’s name. He wouldn’t have asked her “what about our kids?” If it wasn’t important to him. Come on now. I think she should follow through.",
              "id": 210,
              "comments": [
                {
                  "score": 35,
                  "content": "But she suggested the option of having both names so his name would be included…?",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Convenient she changes her mind after it's too later for him to be able to choose to not have a child or get married to her. That's the problem: they've already committed and now she wants to walk it back.",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "shes allowed to change her mind. But hes allowed to divorce her",
              "id": 213,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "She's allowed to change her mind and, in this case specifically, people are judging her AH.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I feel like you’re trying to draw a parallel to consent with this comment, but it’s really not a consent issue or if it is I’d argue that it should favors the husband in this situation.",
              "id": 215,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "This can be a bit of of a gray issue, can’t it? On big issues, discussed premaritally, are we allowed to change our minds after marriage? Like if my husband married me under the condition of a monogamous marriage, and then once married I changed my mind and wanted an open marriage, is that fair game? Likewise, if OP agreed with her husband that all future children would have his last name, which is evidentially a big enough deal for him to hash out prior to marriage, is it ok for OP to change her mind and expect compromise? \n\nI’m not sure that expectation is reasonable.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She's allowed to change her mind. The husband is allowed to refrain from changing his mind. In a vacuum, it's just a impasse and nobody is wrong per-se. \n\nBut some of the other details make it seem like OP is an AH.",
              "id": 217,
              "comments": [
                {
                  "score": 3,
                  "content": "Agree. I actually don’t understand why people go to their families before taking to their spouse. That seems to be the main issue here in my opinion.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Of course she’s allowed to change her mind. Her husband is also allowed to be angry at her changing her mind unilaterally on an issue that was so important to him it was a precondition of the marriage and not want to be part of it.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "“Your poor husband” relaaaax. She should have talked to him before involving her family but people change their minds on things. It’s perfectly reasonable for her to want her child to have her last name.",
          "id": 220,
          "comments": [
            {
              "score": 17,
              "content": "“Ya know how we discussed being monogamous before getting married? Well I changed my mind.”",
              "id": 221,
              "comments": [
                {
                  "score": 7,
                  "content": "Ha yes, because one of the main things that marriage is based on (being faithful) is exactly equal to a woman wanting her baby to share her surname, as well as her husbands.\n\nPeople here are ridiculous.",
                  "id": 222,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Nah but it’s a good indication of someone simply telling their partner what they want to hear to get what they want in the moment, knowing full well they’re kicking the can down the road to another time where they’re in a position of strength in the disagreement. \n\nIt goes from, “what are you gonna do, break-up/not get married?” To “what are you gonna do, go thru the expensive, emotionally draining process of divorce?”\n\nSo back to your smartass reply - yes it IS actually one of the main things that makes a good marriage: honesty and good faith compromises",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Thisss so much. OP HAD a say already. The say was already had and agreed upon",
          "id": 224,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2214,
      "content": "You and your husband are having this kid, not your extended families.  You need to have a calm, adult discussion with *just the two of you.*  ESH—not for what either of you want or for changing your mind—but because you two are handling this so badly and dragging the entire gene pool into it. If you think names are hard wait until the actual parenting kicks in. Get your communication issues sorted now.",
      "id": 225,
      "comments": [
        {
          "score": 187,
          "content": "I thought that was very odd too. It’s weird I never would think to add my in laws with naming my child.",
          "id": 226,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "Yup, I agree here. \n\nOP you need to fix this communication issue and fix it right now. \n\nGrandparents do grandparent things, which means babysitting, sleepovers, days at the park, etc. \n\nThey do not decide what sports your kids play, what name they have (first or last), how their hair is done, which school they go to and so on. \n\nTime to buck up and be a grownup, making your own decisions. \n\nESH, all of you.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "100% this. It’s ok for her to change her mind, and it’s ok for him to be upset. \nWhat’s not OK is the way they are handling this! Imagine when the other, bigger issues regarding raising kids arrive…",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "100% this. Forget everyone else saying \"you made a promise\" blah blah blah. The thing that sticks out is neither of you have actually discussed it without one of you being absolutely frothing mad, apparently. Things change, especially minds, but if you can't get together and talk it out like adults, then that's a pretty big problem. Not just for a last name of an unborn child, either",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This seems like a couple that should have spent a little more time maturing and working on their marriage before getting pregnant. They both suck for willy-nilly bringing an innocent baby into this half-baked marriage.",
          "id": 230,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I agree with this. We’ve all changed our mind about something, so I don’t think that’s an issue. Especially when something is a hypothetical versus reality. It’s easy to agree to something before you have children, then realize when it’s happening that you don’t feel great about that thing.\n\nBut the way they’ve both handled it is pretty crappy.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah, seriously! OP, please go to couples counseling with your partner and learn how to communicate and argue in a healthy way. John Gottman’s books and advice on marriage are so helpful. My husband and I went to a therapist who used Gottman’s framework early in our marriage to learn how to fight in a healthy way. Best thing we ever did!\n\nParenting together is going to amplify any weak spots your marriage has, and it looks like it’s already starting. The last name disagreement is way less concerning than the way you have both handled it. ESH.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1058,
      "content": "ESH \n\nGo for a double last name and stop making a big deal out of literally nothing.",
      "id": 233,
      "comments": [
        {
          "score": 521,
          "content": "The OP said she suggested both last names and husband wasn’t having it.",
          "id": 234,
          "comments": [
            {
              "score": 788,
              "content": "She also said the ultimatum was that or her last name. After agreeing previously (to even pregnancy) to give the kids his last name. Why is it so surprising to everyone that he’s annoyed over this? Being given that kind of ultimatum off the bat he’s going to be against it.",
              "id": 235,
              "comments": [
                {
                  "score": 238,
                  "content": "Also I don't get the ultimatum, if she can strong arm just her last name why not just force the double barrel instead of leaving out his name completely",
                  "id": 236,
                  "comments": [
                    {
                      "score": 120,
                      "content": "Agreed. Some better communication could have gone a long way “I thought about this more and I know our agreement was just your last name but I really want my last name to be included in the kids name as well. Hyphenating it seems like the best option but it could be their middle name or hyphenated middle as well.” That’s a compromise.",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 90,
                      "content": "Power play, that's why. \"Thank me for what I'm graciously granting you, don't forget I hold all the power\".",
                      "id": 238,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": ">want to either have both our last names combined or my last name to be given to our son\n\nI don't understand why people are reading this as an ultimatum, because you're right, it doesn't make sense as an ultimatum. It makes more sense that she was just giving the two alternatives that she was happy with. I guess people are reading it as an ultimatum because \"just OP's last name\" is so far from what her husband is okay with that people are thinking it isn't a *serious* suggestion, but I just read it as an alternative suggestion in case her husband has an issue with a hyphenated name. (I don't know what OP's husband's specific objections are, but I know many people are bothered by hyphenation because it makes the name too long, or maybe in this case it would be an issue because the child's last name wouldn't exactly match EITHER parent's.) This \"ultimatum\" makes no sense (and it isn't even phrased like a usual ultimatum--I would expect \"I want Option A, but I'll just do Option B if you refuse,\" not \"I want A or B\"), so I'm inclined to think that it wasn't actually presented as an ultimatum.",
                      "id": 239,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That would have been the move. If this was a cross to die on, her maiden name alone should have been left off, and she should have forced the double-barrel.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "That's what she did though, she suggested the kid have both their names and the husband said no.",
          "id": 241,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 720,
      "content": "ESH - I can see where he feels upset that you've changed your mind on a big issue that you both discussed and agreed on prior to even having kids.   I can also see your frustration that it was a big decision that maybe you both came to an agreement 'in theory' but that in reality it feels different.  \n\nSit down and talk calmly.  **Both of you need to absolutely STOP worrying about what EITHER of your families say and feel and stop brining them into the discussions- this is about YOU and HIM and YOUR new family.**  Hopefully there is a compromise to be found, hyphenated last name, one name as middle name, one as last... I know a family who's tradition has been to not give girls a middle name--then when the girls get married, the maiden last name becomes the middle when they get married (if they choose to take the husband's name as their last)",
      "id": 242,
      "comments": [
        {
          "score": 67,
          "content": "Agreed. Stop running to your extended family with your private couple’s problems. Because it’s going to make your families hate eachother.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This.\n\nWhatever you decide needs to be between you and your husband, and you both need to leave your extended family out of this. Likely this is only the beginning of them having opinions about your parenting decisions, and unless you want to parent by committee, you need to establish some boundaries.",
          "id": 244,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 560,
      "content": "NAH\n\nYou:  People can change their minds.  And there's patriarchy issues here.  And your opinion should certainly matter.\n\nHim:  You were aware that this is a big deal to him and his family, agreed to the child taking his last name, and are now backing out of that.  He's right to be upset about this.",
      "id": 245,
      "comments": [
        {
          "score": 704,
          "content": "It's kind of wild to me how many people think that you're not allowed to change your mind in a relationship\n\n\n\nEdit: at the time I commented this, 90% of the other comments I saw were giving some version of \"YTA for going back on a deal\". I don't disagree that OP could have brought this to her husband directly, and that this is a big deal. But at the same time, good marriages aren't necessarily the ones where you just make a point of sticking to your contracts even if your life changes. Lawyers get divorced just as much as the rest of us. You gotta be adaptive.",
          "id": 246,
          "comments": [
            {
              "score": 177,
              "content": "Especially while pregnant and your emotions are all over the place.",
              "id": 247,
              "comments": [
                {
                  "score": 371,
                  "content": "Maybe she’s realizing, hey I’M the pregnant one whose body is changing and who is risking my health and even life to have this kid, maybe it’s not so fair for him to not have my last name as well.",
                  "id": 248,
                  "comments": [
                    {
                      "score": 114,
                      "content": "And that's a totally fair thing for her to be feeling and thinking, but running to her family with this before even discussing it with him and then hitting him with an ultimatum that doesn't even include the option she'd already agreed on is an assholish way to go about it. His response about \"letting\" her was also assholish. This feels like a clear ESH.",
                      "id": 249,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, but in a partnership that doesn't give the mom more automatic say in how to raise the child.",
                      "id": 250,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "Yep. Like this is a question of life, not contract law.",
                  "id": 251,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Even if it were a question of contract law, sounds like a gratuitous promise to me. A contract requires something of value to be exchanged on both sides, what was she getting out of the deal?",
                      "id": 252,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "It’s honestly so demeaning to women when people blame pregnancy for bad behavior like this. As if we have no control over our emotions because of some hormonal changes. It’s hard, I get it but most women are still adults who are fully capable of functioning reasonably while pregnant.",
                  "id": 253,
                  "comments": [
                    {
                      "score": 56,
                      "content": "How is changing your mind about your own baby's last name bad behavior. People change their minds about all kids of things every single day.",
                      "id": 254,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "So many Y T A votes just because she changed her mind or talked to her mum  first. I chat to my mum about some relationship things and she helps me process stuff before I might let it come out wrong. It’s not healthy to bottle everything up or not get other perspectives in matters that are important and potentially big issues. It’s not always a bad thing to confide in someone for advice before approaching your spouse about something",
              "id": 255,
              "comments": [
                {
                  "score": 100,
                  "content": "Yea everyone saying “you talked to your fan first!!!” Is wild to me. I run arguments through my mom all the time because I don’t know if I’m being unreasonable due to pregnancy hormones or if it’s actually a reason to be upset.",
                  "id": 256,
                  "comments": [
                    {
                      "score": 9,
                      "content": "OMG, right?  I almost always check with my dad to see if I am being reasonable or not before potentially dropping a bomb like this, and as everyone is rightly pointing out, this is kind of a big deal.  Just because her family is supporting her does not mean she is being ridiculous, especially since she got a \"neither I nor my family will allow you to do this to my son!!\"\n\nHonestly there is not enough info or background here to make a judgement, with what we've got, ESH.",
                      "id": 257,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "Responses in this sub and reddit in general often don’t reflect real life or real situations. I wonder how half of the people here even function. The fact that so many people are like “you agreed to give your kids his last name, you’re TA for going back on the deal”, as if it’s even a fair “deal” (read: patriarchal tradition) in the first place, shows how people here tend to lack nuance and understanding of many factors in a situation.",
                  "id": 258,
                  "comments": [
                    {
                      "score": 49,
                      "content": "This comment thread is so full of misogyny, it's one of the worst things I've read on reddit. It's astonishing to me how many males uphold sexist patriarchal \"traditions\" with literally zero self awareness while insisting their opinions are because \"she promised!\" or \"she talked to her family about something before bringing it up with her husband!\" Basically, reaching for any- and everything that doesn't actually admit the truth. If there's one thing I've learned, it's that racists and sexists will deny their own biases until they're blue in the face. \n\nNever has the young, male, lacking-in-any-kind-of-life-experience demographic of reddit been so crystal clear to me as in this post.",
                      "id": 259,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "You're allowed to change your mind. But you can't complain about people not being happy with your change of mind after you already had an agreement. It makes you the asshole.",
              "id": 260,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Seriously, the number of people basically saying \"you agreed to it you have to do it\" is crazy, like a previous agreement trumps everything else.\n\nWhat if she previously agreed to abort any pregnancy (or vice-versa) and when the time came she couldnt do it? Would she be an asshole in that?\n\nHusband is right to be upset she went back on her word, she's right to want her child to also have her name, regardless of previous agreements. The asshole thing in this is that they're immediately involving their families in this, rather than privately hashing it out like 2 married adults.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Especially when you begin to think of your child as a person and not an idea. As a child of this exact situation where I only carry my fathers name, I strongly advise giving both names. It’s about creating a family where the child is connected to both sides. I think it’s perfectly reasonable for someone to not know they feel this way until it’s a reality.",
              "id": 262,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I think sometimes the problem is the person who changes their mind wants immediate change and gives ultimatum if it doesn't happen. You need to slowly have the conversation and let the other person work out their thoughts and get used to the change first before strong arming them.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm shocked by the number of people who are acting like she's a complete asshole for wanting her name to be included. The kid will have four names instead of three. Get the fuck over it everyone.",
              "id": 264,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Agreed. I don't think a healthy marriage is one where a wife is forced to do something just because she agreed to it years ago. Before we were married my husband and I said we would have 4 kids. Later I decided that didnt work for me. I said I was going to make Turkey on Saturday, but changed my mind. \n\nPlans whether big or small change as people change. People have to be flexible and consider other's feelings, even if the feelings are unexpected.",
              "id": 265,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 377,
      "content": "NTA. Double-barrel naming the kids seems perfectly reasonable.",
      "id": 266,
      "comments": [
        {
          "score": 154,
          "content": "Until the next generation, it doesn’t last long. You can’t have four last names as the child of two hyphenated last name parents.",
          "id": 267,
          "comments": [
            {
              "score": 593,
              "content": "That’s the great part, *they* get to decide what to do then.",
              "id": 268,
              "comments": [
                {
                  "score": 258,
                  "content": "[deleted]",
                  "id": 269,
                  "comments": [
                    {
                      "score": 72,
                      "content": "If that’s a problem there are more deep seeded issues in that family",
                      "id": 270,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "My husband dropped his mom's name when we got married because for me to take his name I would have to take the full thing and he never really used the whole name anyways. She was actually pretty understanding about it. Conversely, my sister gave her daughter both last names, the relationship ship didn't work early on and my neice has had very little contact with her dad (dad's choice). My neice primarily goes by my sister's last name, but **my neice likes that it's her choice which to use**.\n\nSo I guess I'm pro double last name lol",
                      "id": 271,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "In the only case I've heard of, the guy dropped both his parent's names for his wife's last name.",
                  "id": 272,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 204,
              "content": "Having two last names is actually super common in parts of the world. Upon marriage the person just chooses which of their last names to keep, and which to take.",
              "id": 273,
              "comments": [
                {
                  "score": 5,
                  "content": "Yep! Mexican American and I have both my parents last names It’s really not complicated millions of people do this",
                  "id": 274,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "That’s an issue for those children to work out and has no bearing on the current situation",
              "id": 275,
              "comments": [
                {
                  "score": 3,
                  "content": "Personally I wouldn’t want to give my kids more issues that have to be worked out. It’s their decision though.",
                  "id": 276,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "It's very common in hispanic names to take both parents names. And the world still hasn't collapsed",
              "id": 277,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "It’s not that common to have hyphenated last names so I doubt they’d have any kids with two of them; but even so, you’d just gotta try and make space on the document or just choose whichever names you want; it’s not impossible to do",
              "id": 278,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Tell that to basically the entire population of Spain, and most of the Muslim world 🤣",
              "id": 279,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 71,
          "content": "She offered that compromise",
          "id": 280,
          "comments": [
            {
              "score": 4,
              "content": ">We already disgusted and agreed that any future kids we have will automatically take his last name.\n\nShe's not Darth Vader dictating terms to the Baron of Cloud City. This compromise sucks.",
              "id": 281,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Everybody saying she can't change her mind mid pregnancy has me thinking about a friend who was in a similar situation: It was a difficult pregnancy, she ended up sacrificing a lot, even worrying for her life at times and while her husband is a nice enough guy, he wasn't as involved as she wished for him to be, so she often felt very alone with the burden. After all that, giving the baby his name really hurt her. She couldn't even do it differently for the next kid, because German law forces you to stay consistent between siblings.\n\nPregnancy is a major life altering event and it should be expected that perspectives can sometimes change in the course of it.",
          "id": 282,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}