{
  "post content": "Okay, I know that this isn’t on the more extreme side of this subreddit, but I still need to know if I’m the A-hole here.\n\nFor some context, for many years it’s just been me and my best friend. We have tons of things in common and we’re inseparable. I was never opposed to having more friends but that never really happened. Her and I message each other after school (not constantly) but we don’t really bring it up in real life.\n\nOnto the rest of it. Recently someone else just kind of forced their way into our friendship. It’s not that I dislike them for that, but their overall vibe and personality is what makes me dislike them. Sometimes it’s fine, the day goes on nicely, no problem. Other times not so much. We don’t argue or fight but I still get put off by everything.\n\nI’ve dealt with it so far and I won’t have to see her again at the end of the year, so it’s cool, I’ll just put up with it and then it’ll all be over.\n\nUntil recently she started bugging me for a phone number to message me when we’re not together in real life. I usually joke about it a bit and it naturally moves into another topic, but I know I can’t avoid it forever. I honestly can’t tell if I’m the A-hole here or not. So, tell me, Reddit. AITA for not wanting to give a “friend” my phone number? ",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH, you don’t have to be friends with anyone you don’t like. You do sound a little possessive over your friendship with the other girl though if you’re saying they “forced” their way in.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Heck, I didn’t mean to make it sound like that. I guess what I was trying to say that they just randomly showed up and decided to be friends with us without any prior indication of having even the slightest interest in what we’re doing. You may be right though, thanks for pointing that out.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH since you can talk to whoever you want though you will eventually have to tell her you don't want to give her your number.  If you want to save face, ask her to direct message you on some form of social media instead. ",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "NAH\n\nThis is a perfect idea for you.  Explain to her that you don't have an unlimited service plan with your phone but that you *occasionally* use ______ (Skype, Discord, or some similar thing), and she can contact you that way.  Tracphone has that type of service (for instance 1500 minutes and X-number of texts) in case she asks, and you simply state that you reserve the texts for your parents, grandparents, etc.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nOkay, I know that this isn’t on the more extreme side of this subreddit, but I still need to know if I’m the A-hole here.\n\nFor some context, for many years it’s just been me and my best friend. We have tons of things in common and we’re inseparable. I was never opposed to having more friends but that never really happened. Her and I message each other after school (not constantly) but we don’t really bring it up in real life.\n\nOnto the rest of it. Recently someone else just kind of forced their way into our friendship. It’s not that I dislike them for that, but their overall vibe and personality is what makes me dislike them. Sometimes it’s fine, the day goes on nicely, no problem. Other times not so much. We don’t argue or fight but I still get put off by everything.\n\nI’ve dealt with it so far and I won’t have to see her again at the end of the year, so it’s cool, I’ll just put up with it and then it’ll all be over.\n\nUntil recently she started bugging me for a phone number to message me when we’re not together in real life. I usually joke about it a bit and it naturally moves into another topic, but I know I can’t avoid it forever. I honestly can’t tell if I’m the A-hole here or not. So, tell me, Reddit. AITA for not wanting to give a “friend” my phone number? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH\n\nSometimes we meet people that want to be better friends, but we just don't mesh well with them, and that's okay. \n\nNormally I would suggest being honest with the other party and telling them that you're just not interested in being their friend, but there's really no way to tell that to someone without hurting their feelings. Since, as you said, your time near this person is limited, I suggest that you just continue to dodge attempts to get closer and then move on once you're out of close contact. ",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "Alrighty, thank you. Any suggestions on how to do that without giving her a “I don’t like you” sort of vibe?",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}