{
  "post content": "3 days after endgame came out and I was finally ready to go see it, a randomly placed comment on Facebook spoiled the ending to me. I was a bit upset, but not so much that it ruined the movie for me.\n\nI remembered who had done it, and I've come to find out they're a massive game of thrones fan. So I did the only sensible thing by looking up spoilers (thank you freefolk) and messaging him some questions about an item he was selling, while peppering in spoilers for tonight's finale.\n\nHe's pissed. I told him sucks to suck pretty much.  ¯\\\\\\_(ツ)_/¯\n\nFriends think I was an asshole, but honestly I think it was pretty deserved. The dude spoiled endgame in public comments so I was likely not the only one spoiled, but I direct messaged him GOT spoilers so there weren't any others who saw it. AITA\n\nEdit: in case it changes how you feel about it, the comment I stumbled upon was not on anything at all related to the avengers / marvel, and it wasn't conversation about the movie but rather \"XXXXX Dies.\"\n\n**EDIT 2, ELECTRIC BOOGALOO**\n\nThe general concensus seems to be ESH, and I'll accept it. I'm not sorry, I'd do it again to be honest.\n\nA soul for a soul",
  "id": 1,
  "comments": [
    {
      "score": 849,
      "content": "ESH, but good for you!",
      "id": 2,
      "comments": [
        {
          "score": 76,
          "content": "I agree, some r/pettyrevenge stuff there.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "A soul for a soul",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 440,
      "content": "ESH I get that people are emotionally invested, but ffs grow up.",
      "id": 5,
      "comments": [
        {
          "score": 33,
          "content": "> ffs\n\nFacial feminization surgery?",
          "id": 6,
          "comments": [
            {
              "score": 8,
              "content": "For fucks sake is what it means, in case you were still wondering.",
              "id": 7,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "That exists???",
              "id": 8,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah, first thing I saw when I googled ffs",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "This is such a childish situation all around",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 276,
      "content": "YTA not a totall asshole just an ass.\nYou getting end game spoiled was a random timing of logging onto facebook and seeing said comment. (I saw the movie a few days after and just avoided social media) yeah it sucks for you. Heres why you are the ass...you specifically remembered who did it. You looked then up. You talked to them directly. Even worse so was the item listing is how you got him.",
      "id": 11,
      "comments": [
        {
          "score": 155,
          "content": "It was fucking hilarious, though. That dude was utterly clueless, and this is too funny to fully condemn. Everyone knows it’s a dick move to post spoilers from a hugely anticipated movie on social media.\n\nGotta agree with most of the rest of the posters here and say ESH.",
          "id": 12,
          "comments": [
            {
              "score": 16,
              "content": "It honestly depends on what he was commenting on. If it has nothing to do with Endgame okay sure kind of justified but if it’s an avengers meme you did this to yourself.",
              "id": 13,
              "comments": [
                {
                  "score": 21,
                  "content": "Not at all related to avengers. I purposefully avoided things like that.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 16,
                      "content": "This is going to sound petty as fuck, but I hope it's the same guy that spoiled Endgame for me, on a completely unrelated post not even 6 hours before I was going to see it. NTA, and I'm living vicariously, friend.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -4,
              "content": "I feel like spoiling Endgame is worse than spoiling anything else. GOT spoiling is also bad, but below the first. One people have been waiting since 2008 and through 22 movies. The other is a show that's spanned 10 years.\n\nEdit: Corrected year.",
              "id": 16,
              "comments": [
                {
                  "score": -1,
                  "content": "> people have been waiting since 2003 and through 22 movies\n\nThe first movie in the Marvel Cinematic Universe came out in 2008.  It's barely 11 years old, not nearly as big of a difference as you stated.  I will agree, though, that the MCU is a bigger deal than Game of Thrones (although both are admittedly huge cultural phenomena).",
                  "id": 17,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeaaah gonna disagree about that.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "A Song of Ice and Fire began in the 90s.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Oop. That's my mistake on the dates.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "So why YTA and not ESH?",
          "id": 21,
          "comments": [
            {
              "score": 12,
              "content": "It was a ESH until op revealed the plan...\n1. Op looked up spoilers.\n2. Op contacted the dude through marketplace on an item hes selling.\n\n*locks briefcase* case closed haha",
              "id": 22,
              "comments": [
                {
                  "score": 18,
                  "content": "I don't see how this negates the original guy being an asshole?",
                  "id": 23,
                  "comments": [
                    {
                      "score": -10,
                      "content": "Op says randomly placed facebook comment",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "you know when people say that they don't mean a literal case right",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -17,
          "content": "OP is a dick.",
          "id": 26,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 139,
      "content": "ESH. I can’t say I wouldn’t do the same but it doesn’t make either of us less of an asshole for it.",
      "id": 27,
      "comments": [
        {
          "score": 11,
          "content": "To me, two wrongs dont make a right but they also dont make it equal. OP is an ass, other dude is an asshole. OPSM",
          "id": 28,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 125,
      "content": "ESH. But I ain’t mad.",
      "id": 29,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 83,
      "content": "ESH, but you’re still a justified asshole. Nice job (:",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "NTA. That person deserved it",
      "id": 31,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 49,
      "content": "ESH, sounds like he wasn’t trying to spoil it for you specifically so this is more r/pettyrevenge",
      "id": 32,
      "comments": [
        {
          "score": 17,
          "content": "He was trying to spoil it for anyone who saw the comment",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 33,
      "content": "Obviously ESH but welcome to petty revenge.",
      "id": 34,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA, this is the law of equivalent exchange",
      "id": 35,
      "comments": [],
      "relation": "Support"
    }
  ]
}