{
  "post content": "Me and my husband have a constant issue with him going to bed without having a shower. I’ve spoken to him many times and stated that I don’t want him to get into our bed without showering. Reason why is that first hygiene, second, he’s a heavy diesel mechanic who comes home caked in diesel fuel. He washes as much as he can off at work but comes home and I can still see it visibly on his skin. He always makes the excuse that he’s too tired and cannot fall asleep straight away after his shower. he most definitely does fall asleep straight after his shower! We constantly argue about it because I’m so sick of washing the sheets every second day because of the stains and smell on them. He makes me feel as if I’m asking too much and that I’m such a cow for not letting him get enough sleep. \n\n(We have 2 kids, 1 year old and a 2 month old, I understand he’s tired from work and then helping me where he can with the kids but it’s just basic hygiene. I’m also a clean freak and I personally shower 2 times a day because I hate feeling sticky after running around with my daughter). \n\nAm I being an a-hole for demanding he shower before getting to bed??\n\nEDIT: wow I’m glad to see that I’m not crazy! He’s very unhygienic kind of person and I’ve been encouraging him to be a bit more clean. When he comes home from work and doesn’t shower, he won’t get up in the morning to shower neither. He will wait till the next night. If I didn’t hound him to shower, he wouldn’t shower for a couple of days, trust me, I’ve actually timed it as a little experiment. For the past few months, I’ve been sleeping on the lounge while he sleeps in bed. Tbh, he comes from a very clean home like his mum is a clean freak but didn’t teach her kids basic hygiene. He ever rarely brushes his teeth too, that’s a whole different story that sings the same song! I thought I was going crazy seriously! Thank you all for giving some amazing advice!",
  "id": 1,
  "comments": [
    {
      "score": 3901,
      "content": "NTA - While I understand that he's tired his not showering also poses a health risk for both of you.  Sleeping in or next to diesel fuel is not healthy.  Have you tried approaching it from a health angle?  If he still can't understand the concern, then it's appropriate to respond.\n\nHowever, it is rarely productive to tell an adult what they can and cannot do. Not \"letting\" him sleep in your bed may make him feel as though he's being treated like a child.  Might I suggest telling him what YOU will do?  \"I will sleep in our bed when you shower before going to bed.\"  If he doesn't, maybe you go sleep in the guest room.  Same outcome, but wording that is less conflict ridden.",
      "id": 2,
      "comments": [
        {
          "score": 1597,
          "content": "Also make him responsible for cleaning the sheets",
          "id": 3,
          "comments": [
            {
              "score": 1108,
              "content": "No problem, I'll get that done every other feb. 29th.",
              "id": 4,
              "comments": [
                {
                  "score": 526,
                  "content": "I'd rather be in a two single beds kinda marriage 🤢🤮",
                  "id": 5,
                  "comments": [
                    {
                      "score": 100,
                      "content": "\"Lucy! Im home!\"",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "It’s amazing!!! My husband and I sleep together when we want. And when I want to sleep by myself I do. It I constantly toss and turn I don’t want to wake him so I go into the other room.\nIt’s amazing!!! I’ve never slept better in my life",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Or no marriage at all, I could never sleep in a bed covered in diesel or be with a partner who expects me to.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Actually these sounds like a good idea, assuming the fumes aren’t an issue. That way OP doesn’t end up with her stubborn hubby taking over the bedroom while she’s on the lounger",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "🤣😂😭🤢",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "😂😂😂",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 478,
              "content": "Lol, the guy who can't be bothered to shower isn't going to do laundry. He'll be perfectly content sleeping in his diesel sheets.",
              "id": 12,
              "comments": [
                {
                  "score": 178,
                  "content": "Having been married to a diesel mechanic myself, can confirm that the term \"grease monkey\" is entirely astute...\n\nMy ex used to come home caked in varying degrees of filth & sometimes wanna go straight to bed. I understand it's a physically taxing job, but hell, I *gladly* offered to help bathe him before getting into bed!\n\nHe never changed the linens unless I begged off that particular task (due to sickness, etc.). The worst was when there was some rancid odor emanating from the bedroom that took me a while to trace to a tiny pile of his filthy clothing bunched under our bed that had been left to fester -_-\n\n(Side note: I literally only used that room to sleep & frequently burned incense; coupled with bad sinuses, it took a while to notice. I had also asked him to check for the source at least a couple of times before I became too disgusted & was concerned one of my cats had stashed something dead somewhere)",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 118,
                  "content": "Slip a protective cover under your sheets and protect your mattress. Sheets are a minor barrier for the funk a diesel mechanic encounters through the day. I don’t know how OP can even sleep next to him. Pregnancy does a number on your olfactory and heightens that sense to ridiculous levels. My youngest is 10 and I can still smell every damn thing everywhere I go.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Every guy I've been with has had the decency to shower whenever I asked. They do like my shower though. Its nice. And most have been very abusive in other ways. I feel like this is the tip of the iceberg of issues OP and her husband have.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Considering she said he \"helps\" her with the kids and here and there I don't doubt this is the tip of iceberg.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I agree.  This is a view into OPs future with the husband.  It won't get any better than it is right now.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "He would never change the sheets.",
              "id": 18,
              "comments": [
                {
                  "score": 0,
                  "content": "Based on literally nothing but ok",
                  "id": 19,
                  "comments": [
                    {
                      "score": 6,
                      "content": "He’s too lazy/unmotivated to take a short shower before bed. \n\nHe’s not going to strip the bed, wash the sheets, dry the sheets and make the bed. At least at no reasonable regularity. \n\nBased in reality for other people like this.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": 50,
                  "content": "[removed]",
                  "id": 22,
                  "comments": [
                    {
                      "score": -3,
                      "content": "[removed]",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "But would he tho??",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I doubt he'd go to the effort of cleaning the sheets if he won't even take a shower.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "And making the god damn bed!! NTA",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "In a perfect world sure...but somehow i think this will not end up with clean sheets for op..just extremely dirty ones",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "He'll do that as well as he showers.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "Sounds like she's a housewife? Feels like it's kinda taking the piss to not have a job and also not do the housework....",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 424,
          "content": "She's two months postpartum, she should get the nice bed. He's getting treated like a child because he's acting like a child.",
          "id": 30,
          "comments": [
            {
              "score": 113,
              "content": "I agree he is and that her comfort comes first.  The problem is, he clearly doesn't see it that way.  My suggestion was to empower her even when he isn't acting like a grown up.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Diesel fuel on a baby's skin is really bad.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -17,
              "content": "The woman showers twice a day. She clearly has some issues. If he didn’t ALLOW her to do something, I’ll warrant you would would be outraged on her behalf.",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -21,
              "content": "That child is also the breadwinner.\nI didn’t know adults depend on a child 😂😂😂",
              "id": 34,
              "comments": [
                {
                  "score": 14,
                  "content": "You don’t know that. Op could be on maternity leave. \n\nIt’s crazy how often people in this sub run with the sexist assumption that women don’t work with exactly 0 evidence",
                  "id": 35,
                  "comments": [
                    {
                      "score": -7,
                      "content": "I was responding to the the comment calling the husband a child… \nAs in an adult shouldn’t depend on a child to provide for an adult.\nHonestly if they argue on common hygiene personally marriage shouldn’t be a card dealt. 70 percent of marriages end in divorce.\nConversions about expectations in a relationship, kids, maternity leave, stay at home parents should all be discussed prior to marriage/ kids/ life trajectory changes but often time are overlook or downplayed. People shouldn’t have to compromise something in there life they feel strongly about. Every one deserves there happiness",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "I'd also be concerned about him interacting with the children and having diesel fuel on him.",
          "id": 37,
          "comments": [
            {
              "score": 29,
              "content": "No doubt... I say hose the pig down when he walks through the door. Unfuc\\*ing Real.",
              "id": 38,
              "comments": [
                {
                  "score": 31,
                  "content": "No, before he comes in.  Do it outside so as not to get nasty diesel water all over the floor.\n\nAnd use a pressure washer.  With soap.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 13,
                      "content": "And bristle brush with long handle.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "We have a shower in our laundry which is directly accessible from outside and if I do yard work or mess with the car I ask my wife to bring down a change of clothes and i have a shower there and only then come in. Admittedly it's not diesel, which I am thankful for as I'm well aware of how much a bastard that stuff is to get off clothes, let alone skin.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Good advice and likely exactly how she needs to handle this,  but it's infuriating that she has to tiptoe around her husband's feelings while he blatantly ignores hers.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I think that OP is confusing diesel fuel with grease/oil. My brother used to be a diesel mechanic and he didn't get much fuel on him as usually that's not a problem. Diesel vehicles have a TON of grease points along with oil. You can't see fuel on your skin but you can see grease/oil",
          "id": 43,
          "comments": [
            {
              "score": 47,
              "content": "Around a baby does it really matter what he has on his skin? Fact is he has something visible and therefore isn't clean enough to be around a baby.",
              "id": 44,
              "comments": [
                {
                  "score": 1,
                  "content": "I think you are missing the point. I was only correcting what she thought was fuel. I wasn't putting my input to where she was TA or not. Nor am I defending the husband. I'm just stating facts and you are assuming. You know what they say about assuming, right?",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "I am a daughter of a diesel mechanic and my husband is a heavy duty truck mechanic. I agree about the grease but I've seen alot of diesel fuel soaked clothes. I soak the clothes before placing in the washer. We fight about him being tired and not wanting to shower.  There's no good excuse to go to bed dirty.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "\"diesel mechanic\" encompasses an enormous number of trades.  Dude could be repairing locomotives, or he could be working on VW Golfs.  A diesel mechanic covered in oil, grease and diesel is not out of the ordinary at all.  You realize grease and oil smell too right?  Not unlike diesel really, just less potent.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "This guy doesn’t fucking shower, do you think he’s going to wash his grody sheets?? C’mon. Kicking him out of bed is like the minimum.\n\n\n\nHow did this guy get laid enough to create 2 people??!! The bar is on the fucking floor.",
          "id": 48,
          "comments": [
            {
              "score": 14,
              "content": "Let's not forget he rarely brushes his teeth as well",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Assuming they have a guest bedroom?",
          "id": 50,
          "comments": [
            {
              "score": 54,
              "content": "I tried to knock a stray eyelash off my phone half a dozen times thanks to you. ☹️😆",
              "id": 51,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "They're assuming there is another place to sleep - because the OP has already established that there is by saying she's sending her husband there. Referring to it as a guest room is expedient and easily understood.\n\nNot much of an assumption.",
              "id": 52,
              "comments": [
                {
                  "score": 23,
                  "content": "No, she is sleeping on the lounge and has been for months! Meaning pre-birth and after. I dont know how this man sleeps so soundly, knowing his pregnant wife was sleeping on the lounge. And the gall to complain about sleep to mother of a 2 month old is insane.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This answer is 100% the best explanation. Very appropriate & reasonable!",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I understand the making him feel like a child isn’t exactly productive logically but honestly he is acting like a child who doesn’t want to take his nighttime bath 🤷🏻‍♀️",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I agree. Also, it can't be healthy for the kids, especially the baby, being around diesel fumes. Maybe he will shower for his kids' sake?\n\nOP, NTA",
          "id": 56,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1599,
      "content": "If he was working a regular job I would say leave him alone but since he works with diesel fuel I would ask for the same thing. NTA.",
      "id": 57,
      "comments": [
        {
          "score": 629,
          "content": "Same.  I was all ready to call her an asshole for being so unreasonable, but OP is totally right. It would be one thing if he worked in an office and she was demanding he take a shower before getting into bed: I take my showers in the morning, and never take one at night.\n\nBut the fact that he works a mechanical job and is literally covered in dirt and grime makes it a totally different story.  If I come home covered in *anything* the first thing I’m doing is taking a shower no matter what.",
          "id": 58,
          "comments": [
            {
              "score": 301,
              "content": "Some jobs you shower before you go in, other jobs you shower after.",
              "id": 59,
              "comments": [
                {
                  "score": 218,
                  "content": "And in hospitality it’s both!",
                  "id": 60,
                  "comments": [
                    {
                      "score": 127,
                      "content": "Yeah; I've not been a butcher in literally 8 years but I still shower before and after work just out of sheer ingrained habit.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "As an ER nurse, can confirm.  Team after.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 66,
                      "content": "I’m in the lab, even if we are wearing scrubs and a lab coat with gloves I’m still showering when I get home. No ty.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "Heme onc nurse, my kids have been trained since infancy to not touch me til I have decontaminated…aka showered.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "numerous abounding safe many chubby pathetic cover test tease pocket\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 57,
                  "content": "I've known a few people with blue collar professions (farmer, plumber, factory) who put a shower in the laundry room near the back door so they can strip off and shower immediately after coming in. Dump the work clothes in the washer, too, it never goes into the main living space.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 10,
                      "content": "That’s fucking smart.  The only thing better than that would to have like a legit decontamination airlock in your doorway, so you can step in and automatically get sprayed down before entering the house 😂",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I grew up in a rural agriculture area and have seen this. My dad's a farmer and he immediately takes a bath when he gets home. He likes to soak and relax and then he eats dinner.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Perfect way to say it!",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Absolutely the same, was already formulating my YTA response when I saw “caked in diesel”.  Never mind smelling bad the man is a health hazard, speaking of which surely his workplace should provide some better safety gear?  I get that mechanics are going to get dirty but if someone is getting covered in fossil fuels on the daily then they need better PPE.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Thing is you're \"literally covered in dirt and grime\" regardless when you've been out all day, be it general sweat, pollution or just the elements. It just sounds like your tolerance of what you consider shower-worthy is different to others. Some people (night showerers (me)) are more sensitive to what they consider dirty, than you are, and you are more sensitive than OPs husband. It's all just a scale of what level of filth we're willing to sleep in. OP would be no more the arsehole here than you would be",
              "id": 71,
              "comments": [
                {
                  "score": 22,
                  "content": "This , exactly. Zero/no tolerance here.\n\nWanna sleep in your own filth? Fine, sleep in your own bed.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "And some people sweat in the night and don't to carry that into the office.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Absolutely understandable, in which case that kind of person would potentially shower mornings and nights",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yes! This is what I was thinking. Even with an office job I shower at night before I get into my bed. So it was NTA to me from the beginning. It’s gross to be out all day, shedding skin cells and oils, sitting in the discharge your vagina produces as a woman, potentially sweating, coming into contact with others that have the same going on and touching all types of things that are touched by others, and THEN get in your bed. So yes, we all have different standards and it just depends on the person because this is totally reasonable to me.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "In my experience, this is a cultural thing and totally depends how you're raised. Personally, I was raised as a \"morning showerer\" and I see 0 issue with going to bed without a shower - it's my bed and I'd rather be clean in the morning when people are actually going to see me vs in my bed where people aren't. But I've found that people have very strong opinions about this either way.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "NGL, I have never gone to bed without a shower, even back when I was in my early 20s and would be hanging out till 3am. It's just icky to get into bed without feeling clean and fresh. Being out all day = being around all sorts of stuff, and I just feel so much cleaner after a shower.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It's not unreasonable with an office job at all. I knew a guy who showered in the morning, used a deodorant and reeked of sweat in the evening (no physical activity during the day). I wouldn't want to sleep next to a person like that.\nAlso when you go out and spend time in public spaces with other people and/or use public transportation you bring all their dirt and germs home. Good reason to shower before going to bed.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yup. I've worked in restaurants in between jobs several times. I'd come home covered in either food, juice/alcohol, cleaning products, or all 3 and I'm absolutely taking a shower as soon as I come home. Even when I'd come home at 2 am after a 15 hour shift and have to open the next day. I'm showering before I get in bed.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "She is still an AH for letting him handle literal babies without showering. I’m not generally one for “demands” or putting your foot down” but this is her children’s health we are talking about. He needs to come home and go straight to the shower. It should not be up for discussion.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Agreed. \n\nIn fact, in Pittsburgh (where my yinzers at?!), there’s a bathroom in the basement of  nearly every house built before 1980-ish. Why? Because men used to work at the steel mills and in other heavy manufacturing plants. They would come in at night through the basement, then strip down and shower before they went to the main floor. The basement bathrooms were/are called a “Pittsburgh Powder-room.”\n\nIt was the only way to keep the main part of the house clean. If they could do it in the 1950s, I think this guy can handle doing it now.",
          "id": 81,
          "comments": [
            {
              "score": 4,
              "content": "Love the Pittsburgh Potty/Shower!",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Absolutely. From the title I was going to say yes, but the fact that he comes home covered in gasoline?  Gross!!",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "The old blue collar vs white collar bathing divide",
          "id": 84,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Yep.  I was an executive assistant, my husband a truck driver.  He showered when he came home,I showered when I got up, a pattern that continues into retirement.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Manual labor jobs need to shower after work, white color jobs shower before work.  It is a clear split that makes logical sense",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I was also ready to say that showering everyday isn’t necessary for some people. And not letting him sleep in their shared bed is extreme. But diesel mechanic? Still covered in grease and noxious fume emitting substances? Nah he needs to wash himself. Or he needs to get himself a twin bed and sleep in a different room. Although with two small children in the house being exposed to fumes, that wouldn’t really cut it for me either.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Ditto.\n\nMy ex used to work at 5 Guys burgers and would come home smelling drenched in peanut oil. I can't imagine how awful *actual* oil would be. 😬",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 826,
      "content": "NTA. He doesn't realize the prolonged exposure effects on his health, but maybe you can stress a bit more how this is actually affecting not only him. Here is a fact check sheet that can scare you [https://dep.wv.gov/daq/Documents/June%202019/053-00080\\_MSDS\\_13-3435.pdf](https://dep.wv.gov/daq/Documents/June%202019/053-00080_MSDS_13-3435.pdf)\n\nBasically, you are definitely not wrong. He should also prioritize his health here.",
      "id": 89,
      "comments": [
        {
          "score": 246,
          "content": "Especially in the bed she presumably feeds her 2 month old in. Babies aren’t even supposed to use sunscreen until 6mo because their skin is too porous",
          "id": 90,
          "comments": [
            {
              "score": 17,
              "content": "Kid was likely born [with microplastics in his system.](https://thehill.com/changing-america/well-being/longevity/531322-for-the-first-time-scientists-find-microplastics-in/amp/) They’re showing up in breast milk, too.",
              "id": 91,
              "comments": [
                {
                  "score": 13,
                  "content": "Well, that applies of all of us now, since it doesn't have to do with hygiene so much as the use of plastics for so many things increasing since the mid 20th century. Microplastics come from plastic items being discarded and breaking down to the molecular level and then spreading out everywhere. They say that people around the world now unknowingly ingest around a credit card's worth of plastic per month because the plastic molecules are carried up with water molecules during evaporation and are part of rainfall/snowfall everywhere and so they are in the soils where we grow foods we eat, no matter how carefully we choose our food sources. \n\nNot that I'm defending the mechanic here. There is no reason to compound a problem he can't prevent at this point with something he *can* prevent, which is adding petroleum residue to the potential issues in the environment his babies live in. I mean, maybe he just doesn't know, or doesn't believe that petroleum products like what he works with have much more immediate and medically measurable health effects?",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That’s just from basic life. It’s in everyone. You can’t avoid it. It’s in our water, our food, our clothes.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Not to say that this specific thing isn’t very important too, but by that fact alone there’s worse here than the micro plastics.",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "If he's in the US I would be really shocked if that's not part of his company's safety policies.  Whether or not he listens is another story.   I don't know why he's not showering at work.  I'd also be surprised if they didn't have facilities for it.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "He’s sleeping in it. He gives zero fucks.",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 609,
      "content": "NTA - I worked construction many years ago and wouldn't even sit down on any of the furniture before showering. I came the door and straight for the bathroom.",
      "id": 97,
      "comments": [
        {
          "score": 198,
          "content": "Hell when I worked in a dusty factory we actually had a paid 15 minutes at the end of shift to shower before we even left the factory.  It was just implied the work was gross enough nobody wanted to get in their car all gross much less their bed, and that was for relatively inert albeit gross feeling dust.",
          "id": 98,
          "comments": [
            {
              "score": 6,
              "content": "That’s really cool and I wish more places offered that",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "My dad was in construction as a carpenter. He did too.",
          "id": 100,
          "comments": [
            {
              "score": 17,
              "content": "I can't imagine my Dad getting in bed after working on a construction site without showering first. Sheetrock is soooooo dusty. Thankfully, he and my Mom agreed on this.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "I was going to suggest this same thing. Like, why does it have to be right before bed considering his objections of 1) being tired, and 2) claiming he can’t fall asleep right after a shower. Seems the obvious solution is to shower immediately when he gets home.",
          "id": 102,
          "comments": [
            {
              "score": -29,
              "content": "The answer is he's probably working 16 hours so everyone can have a roof over their head. While his wife showers twice a day and complains.",
              "id": 103,
              "comments": [
                {
                  "score": 16,
                  "content": "Ok and? Working 16 hours a day doesn’t mean you can be unhygienic. My spouse works anywhere between 13-18 hours and yet he still showers when he gets home, sometimes he’ll shower 3 times a day if he’s helping out with the military vehicles his unit has because he doesn’t want to have humvie or tank fluid on him. \n\nOld husband is using “I can’t fall asleep after a shower” as an excuse not to shower, it sucks that his mom didn’t teach him basic hygiene but he’s a grown man who has children who he’s putting at risk by leaving diesel oil on his skin",
                  "id": 104,
                  "comments": [
                    {
                      "score": -22,
                      "content": "[removed]",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yep! My husband works in construction and the first thing he does upon coming home is head straight for the shower!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Well from OP's description he's already washing up before leaving work, and helping her with the kid when he gets home (probably at her request).\n\nAnd at the very least she doesn't feel like he's too dirty to take care of his baby when he gets home from work, so it's odd she finds him too dirty to sleep in his own bed 🤔",
          "id": 107,
          "comments": [
            {
              "score": 11,
              "content": "Right?!? Like give the man fifteen minutes when he gets home to go shower up before jumping into household duties, then everyone is set for the rest of the night.",
              "id": 108,
              "comments": [
                {
                  "score": 11,
                  "content": "Umm she said he doesn’t brush his teeth. Being unhygienic is not something he’s doing because she’s rushing him off his feet—he’s just never been into hygiene. \n\nI don’t think she’s an a*hole for not wanting him to get in the bed dirty but what can you expect from a person who doesn’t brush their teeth. He’s 🤮 for not brushing. She’s 🤢 for kissing someone who doesn’t brush.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -11,
              "content": "The OP is busy chasing her husband away 😂",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Just did that literally an hour ago. I can't even bring myself to sit on a chair after work before a shower, I feel so grimy. Construction is such a dirty job, I was covered in concrete dust from hammer drilling",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Just to chime in - my partner (carpenter) does the same. I also used to shower every time I came home from bar work, which can get pretty grimey and sweaty. Only now, working in an office job, do I occasionally skip a shower after work. Even then I feel a bit gross.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That was my thought. I used to work for an equipment rental company. My primary job was CDL delivery driver but I would wash and do basic service on the equipment in my down time. The first thing I did when I got home was shower.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That's what I did wheni got home from the gym when I had a membership. I walked straight through the door to the garage, strip the sweaty clothes off and throw them in the wash, then go straight into the shower.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "My husband is an ironworker and takes off his coveralls and work boots before he walks into our house. He is also straight to the bathroom for a shower!",
          "id": 115,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 396,
      "content": "NTA.  I'm surprised you're even able to wash the sheets with fuel on them.\n\nI'd make a new rule-- he showers immediately upon arriving home, or he sleeps on a guest bed and is solely responsible for laundering that bedding.",
      "id": 116,
      "comments": [
        {
          "score": 82,
          "content": "Making rules for the other person in a relationship only breeds resentment. It will be more effective if OP moves out of the room and, as another poster said, makes a rule for herself: “I will sleep in the bed with you when you shower.” And then sleeps elsewhere when he doesn’t.",
          "id": 117,
          "comments": [
            {
              "score": 183,
              "content": "The problem is, that still leaves her doing the laundry.  She shouldn't be punished because her husband is being an asshole.",
              "id": 118,
              "comments": [
                {
                  "score": 60,
                  "content": "And still likely building resentment lol",
                  "id": 119,
                  "comments": [
                    {
                      "score": 62,
                      "content": "What about the resentment SHE is feeling? Sometimes you need to put your foot down.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "the problem is a grown man needing to be told to wash the Diesel fuel off of him lol like it’s just wild that this guy has a wife and kid and still can’t be bothered. I feel like the real issue is her enablement. She has already said that he is “very unhygienic”, so why has this been allowed to go on for so long? I get loving and supporting your partner, but his lack of hygiene is disrespectful to her as his wife. Like she said he can barely brush his teeth. He needs to want to change and probably see a therapist for why he thinks this is okay as a father and husband.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes!  She hasn't got a partner, she has another child.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "[deleted]",
                  "id": 123,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Insert \"It's been 75 years\" meme here.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "That’s what I was saying. She can say she won’t sleep in the bed nor launder the bedding until he starts showering when he gets home. I also suggested buying a waterproof mattress protector and new cheap bedding and making those changes before making any proclamations cause I have a feeling her currently stuff would never get washed.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "For sure I made a deal with my husband I’d do the bathroom cleaning 75% of the time if he sat to pee instead of splashing everywhere. He happily agreed to doing less chores. Win win. He doesn’t seem to have any resentment  as far as I know.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -13,
                  "content": "She's the one that wants to do the sheets so often and it will only be for the bed she's sleeping on. Separate bedrooms seems like the way to go here.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 8,
                      "content": "> She’s the one that wants to do the sheets so often…\n\nBecause the sheets have fuel on them. This is not an issue of preference! Guy needs to get his act together, that’s unhealthy and disturbing.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "She can visibly see diesel residue on his skin and he can just come home and pick up the kids and play with them until bed?\n\nFuck that, you should be able set small rules like “shower the fucking diesel off you first” in a healthy relationship.\n\nIt sounds like OP is going to start resenting husband for a legit reason. If he’s going to start resenting her for needing to wash the cancer goo off, well then I guess it makes sense that he’s a diesel mechanic…",
              "id": 129,
              "comments": [
                {
                  "score": 37,
                  "content": "Yeah, pretty common sense to me. It’s not like it’s a  rule meant to control another human, it’s basic safety, health and consideration of others. Should be a household automatic expectation. Maybe have him practice a new sleep hygiene routine. Plenty to be found off the internet.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Normally good advice but a mom with a two month old baby should be sleeping in her own bed or where she is most comfortable",
              "id": 131,
              "comments": [
                {
                  "score": 0,
                  "content": "Yes, so she will need to find a way to have her own bed. Forcing her husband out of the marital bed isn’t healthy or mature, or even possible. What is she going to do if he refuses to leave the bed? Drag him out of the bed? C’mon. Learn a bit about how to healthily enforce boundaries. You can only enforce a boundary by YOU doing something. \n\nThey are married, so the only actual way out of this beyond wife sleeping elsewhere would be divorce or moving out of the house, and I think that is pretty drastic. Again, she cannot force her husband to do anything. She has to make the choice for herself. \n\nIf the husband isn’t a total dick, as soon as she voluntarily sleeps elsewhere, I think he’ll start feeling the weight of what she is saying and probably do something about it. On the the other hand, maybe he’ll be bitter and immature and not change. Who knows, really, but OP should be prepared for either outcome.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yeah but after a while that mattress is going to reek permanently of fuel, effectively destroying that bed. No amount of showering and washing sheets will save it then. Even if OP sleeps in a different room on the nights her husband won't shower, it won't take long before their bed is toxic...",
              "id": 133,
              "comments": [
                {
                  "score": 2,
                  "content": "This is a good point. She should probably permanently sleep in a different clean bed and invite husband to sleep with her when he is clean, and when he is not, he can sleep wherever he wants that isn’t her clean bed.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It cracks me up all the people saying OP should sleep in the guest room unless he showers! Um they have 2 babies and who says they even have a guest room?! Hell no, take a shower when you get home or don’t touch the kids and sleep on something on top of the couch. Ridiculous.",
              "id": 135,
              "comments": [
                {
                  "score": 0,
                  "content": "See my comment. It’s interesting to me how many people think that adults can force other adults to do things. I can’t (and don’t) even force my children to do things. I create boundaries and consequences that I can enforce.\n\nIt is incredibly unhealthy and immature to think that an adult should force another human to do anything.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I didn’t say she had to force him, my limit for myself and children would be to not be touched by or sleep with a greasy man. That shit is literary toxic.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I agree.. But I think at the same time, with her being the one who has to clean the sheets, she'll also need to tell him she's not cleaning that.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Unfortunately, without specialized detergents, that fuel and oil is on every other piece of clothing that goes through the machine. It coats the machine and builds up over time, water doesn't just magically wash it away. Maybe not a huge deal for adults, but bad for the lifetime of the machine and the babies who's clothes get washed in there.",
          "id": 139,
          "comments": [
            {
              "score": 3,
              "content": "Yeah, in her place I would be losing my shit.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is the way op and if I had a guest room I’d be doing just this. Mine now sleeps on the couch instead, though he’ll tell you it’s because I cosleep and that may be true, but my nagging probably wasn’t not it either",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 218,
      "content": "Diesel fuel?\n\nHe needs to take a shower everyday just for his health.\n\nNTA.\n\nEdit: \"showering everyday\" should cover showering to clean diesel fuel from their body. When that shower takes place seems to be exceedingly evident.",
      "id": 142,
      "comments": [
        {
          "score": -45,
          "content": "They didn't say he doesn't take a shower every day, just not at night. I take showers in the morning.",
          "id": 143,
          "comments": [
            {
              "score": 89,
              "content": "He needs to shower after his work day because he is literally covered with fuel and oil. Read the actual post.",
              "id": 144,
              "comments": [
                {
                  "score": -28,
                  "content": "The post says he showers at work before coming home.\n\nIts very possible he isn't giving himself a thorough enough shower or using enough or the right kind of drgreasing soap and shampoo.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 55,
                      "content": "No it says he cleaned up at work before coming home, Nowhere does it say he showers. My guess is he washes his hands and arms as best as he can.",
                      "id": 146,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -29,
                  "content": "I read the post, I also read the above comment where the commenter talked about showering ever day instead of the topic of showering at night. Read my actual comment and the actual parent comment. Then you know what you can actually do with your comment.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 38,
                      "content": "My guy the original comment said he needed to shower daily and you replied talking about morning showers.\n\nI don’t care if the man takes a shower in the morning, he comes home smelling like diesel fuel. He needs to not smell like diesel fuel all night  when he shares a home with his wife and infant.\n\nMy husband also showers in the morning, but he doesn’t smell like gas when he comes home from work.",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "This is irrelevant. He is covered in toxic fumes and fuel after work, regardless of when he showers currently.\n\nIf he doesn't want to shower twice in a day, he can KISS by adjusting his shower schedule to shower after work rather than before.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 177,
      "content": "NTA, why doesn’t he just shower when he gets home from work? That would solve the supposed sleep issue he is having and he would smell better in general.",
      "id": 150,
      "comments": [
        {
          "score": 107,
          "content": "Yeah, he really shouldn't be handling the babies covered in toxins either. He could change into comfy lounge wear too.",
          "id": 151,
          "comments": [
            {
              "score": 12,
              "content": "Probably doesn't handle the babies, I would say the dynamic in this relationship is that he has been working a paid job so he gets to do whatever tye fudge he wants once he clicks off .",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "When I worked a dirty job, I wasn’t even comfortable sitting on my furniture without showering.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 170,
      "content": "This is actually a huge problem people do not seem to understand. When you work as a contractor,  mechanic, farmer, nurse, or doctor, etc, showering when you get home before doing anything else is more necessary as a work related hygiene subject. This used to be normal practice, and I wonder why people started to unlearn it?\n\nWhen you work around gas, oil, farm sprays, manure, bacteria, unhealthy dust, etc, you don't want that stuff in your house tracking around. Also, another good reason to take your boots and shoes off. \n\nI remember that was the first thing that happened in our household growing up (contractor work)as well as my relatives as farmers. They would come in right before supper (farmer language) walk to the shower and throw clothes into \"that hamper\" for them, they would shower and change, eat dinner, clothes where washed and dried right after. \nHe works around grease and oil, so this would also clean out the crap in his nose, too. He is not only protecting you and your children but himself by taking a quick shower when he comes home, or as soon as he can. \n\nI am surprised that no one taught him that.",
      "id": 154,
      "comments": [
        {
          "score": 71,
          "content": "Farmer's daughter here and this is how it worked in our house. When my dad worked with the hogs, he put his clothing in a bucket of water & pine-sol, end of the week he would wash them, and as they dried run a load of plain water & disinfectant to clean the washer.",
          "id": 155,
          "comments": [
            {
              "score": 28,
              "content": "And there ya go! Also, \"pine-sol\" for everything 😆",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Best recommendation I ever heard for a washer was \"it gets barn smell out of clothes\". My parents' old house on the farm had one closet where the barn coveralls were kept, and even though the clothes were only put in there after being washed, that closet had a very distinct smell whenever it got hot out.",
              "id": 157,
              "comments": [
                {
                  "score": 5,
                  "content": "Some occupations get permanent smell in those clothes, which is why there are \"work clothes\" and clothes for other aspects of life.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "One of my friends has a house on an 80 acre pecan farm. They've got a bathroom I can't remember the name for but it was like a farmhand bathroom. It has a door coming in from the field, and has another door to exit into the house. Literally they walk directly from the dirt into a room to wash up, then enter the rest of the house.  \n\nI dont know why they got rid of them.  Actually,  I do.  Cookie cutter builds are easier to slap into place and sell for stupid high profits.",
          "id": 159,
          "comments": [
            {
              "score": 10,
              "content": "Yesss a wash room! Ugh I wish this was standard in every home",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly. Old farmhouse had a door where work boats and coats were hung and right next to that was an old bathroom.",
              "id": 161,
              "comments": [
                {
                  "score": 2,
                  "content": "I spent too long searching google for different bathroom types, and the closest I found would be like a half bath with dual entrance.    Super convenient.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Perfect, the farmhouse, they added a shower, a lessor one at that, but it worked.",
                      "id": 163,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I can agree with this for people who get physically dirty like farmers, mechanics, etc.\n\nNurses and doctors, OTOH, unless they are grossly exposed to fluids from a major trauma, a bowel blowout, etc aren’t the walking contagion people think. After all, very few nurses change the clothes when they get in the car to drive home, for example.\n\nI work in a regular outpatient clinic, and I don’t shower before bed. I shower in the mornings and have never had a problem.",
          "id": 164,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 165,
              "comments": [
                {
                  "score": 0,
                  "content": "Work bags stay in the break room.\n\nShoes: yeah, but I don’t know too many people that wear those in bed",
                  "id": 166,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It’s wild to me how lax people are with noxious chemicals. I’m a scientist and I once spilled a chemical on myself that soaked through my lab coat, and I had to leave my shirt in a fume hood and go home in just my blazer. Literally stripped my blouse off *in the lab* and awkwardly rushed back to my car. \n\nThe chemical safety officer said it was the only safe thing to do, and everyone graciously ducked into their offices to let me escape unseen.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA all day. I work in a hot factory not even a mechanic and I wouldn’t dream of getting into bed without a shower even after a 17 hour day.",
      "id": 169,
      "comments": [
        {
          "score": 38,
          "content": "jeez i just work in a grocery store and i wouldnt go to bed without shower after work. even when i work until midnight.",
          "id": 170,
          "comments": [
            {
              "score": 21,
              "content": "When I worked in a restaurant, I had to shower after work because I smelled so much like cooking oil, I couldn’t imagine being chill with diesel oil smells and visible grime *shudder*",
              "id": 171,
              "comments": [
                {
                  "score": 11,
                  "content": "i used to work nightshifts in a fastfood for a year. coming back at 7am, i was still showering even if it made me more awake. cant go to sleep smelling like a burger... and my husband wouldve (rightfully) kicked me out of bed lol",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "NTA\n\nThis is not only a hygiene issue, it's a health/safety issue. He needs to get that diesel fuel OFF his skin with a good shower as soon as he gets home.",
      "id": 173,
      "comments": [],
      "relation": "Support"
    }
  ]
}