{
  "post content": "For starters “civil war” is hyperbole we aren’t shooting each other. Also I’m doing this on mobile and I suck at story telling. I’ll try to do my best please try and follow to the best of your capabilities.\n\nSo I (17M) developed anxiety and depression partly due to my father (43M) being absent from my life because he served 24 years in the military. He retired 2 years ago and since then he blows up about almost anything. Disagree on dinner? Disrespect. Don’t want to watch the same show on tv? Disrespect. Don’t go to sleep on our bed time even though I’m practically an adult? Disrespect.\n\nYesterday I was getting into an argument with my sister about studying for the ACT. I don’t know how it is outside the U.S but the ACT is a standardized test that takes roughly 3-4 hours to see if you’re worthy to got to college. I didn’t want to do it as I literally spent my day doing homework and I really just want to relax. \n\nMy dad comes home and he sees us arguing. Of course he takes my sisters side because the ACT is important. \n\nFine I’ll study. So I read through some of the prep stuff but I don’t actually do the tests.\n\nMom gets home an hour later and we eat dinner. Everything is fine until we start talking ACT. My sister an I start talking about the best way to study. She’s on the side that I should do it untimed so I can build up my skills sooner rather than later. I said that I should do it timed that way I can establish a baseline and that all the teachers I’ve talked to agree. But before I can explain that, I get interrupted.\n\nDad decided that we’re getting to loud and that’s disrespectful.\n\nHe starts talking about how, once again, my sister is right. She took the ACT so she knows what she’s doing. He stops so I try and finish my point.\n\nDad: I wasn’t finish talking but ok\n\nSo I stop everything I’m saying.\n\nMe: what was that you said? Because to me it sounds like an unfinished thought.\n\nDad goes ballistic. I could have killed a man and he would have been calmer about it.\n\nDad: Don’t you f*%^ing talk to me like that I am your father and you don’t talk to me like that.\n\nMe: why shouldn’t I? \n\nDad: I’m your dad that’s why. \n\nWe go on a long argument about respect and how I should learn it.\n\nDad: I gave you what I can give and you talk to me like this.\n\nMe: what have you given me? Anxiety? Depression? Thank a f*%#ing lot for that. \n\nDad: you know what I’m done with this. You’re gonna get a 13 (very low for the ACT) and I’m going to f*%#ing laugh.\n\nHe gets up. He takes my phone and he walks away.\n\nMy sister is on my side about how dad has treated me. How he blows up over the smallest detail, and that he needs to respect us if he wants our respect. My mom is on dads side though. He’s the authority therefore I should respect him. \n\nI don’t think ITA but if I am please tell me. I did leave some stuff out for the sake of my own time, but if you need to know more than ask and I’ll try to answer.",
  "id": 1,
  "comments": [
    {
      "score": 17,
      "content": "ESH.  \nThis is not an argument about the ACT.  \nYou and your father have some issues you need to work out if you're going to develop any kind of healthy space in his house.  \nIf it doesn't look like that's going to happen you need to apply yourself to ACT or to an apartment.",
      "id": 2,
      "comments": [
        {
          "score": 10,
          "content": "I agree. It started as an argument about ACT but it went into deeper rabbit trails. I’ve tried to get better. I take time out of my day to hang out with him, I’ve tried understanding sports so I can talk to him more, and different things. But he doesn’t do the same thing. I make efforts but it feels like he doesn’t.",
          "id": 3,
          "comments": [
            {
              "score": 7,
              "content": "That sounds really hard.\nFirst you have to figure out to live without him there, then you have to figure out how live with an almost stranger who yells a lot.\nAnd it must seem like he expects you to appreciate him for being deployed when you were just a kid who wanted his dad.\nHang in there man.",
              "id": 4,
              "comments": [
                {
                  "score": 3,
                  "content": "Thanks for that, it means a lot",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "[deleted]",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "I’ve seen different therapists over the years. It’s not that I don’t like talking to him, when he’s chill he’s pretty cool, but he just loses it so easily toward the end of the day. I do agree with you on the whole I could have been better about my temper. Happy cake day by the way.",
          "id": 7,
          "comments": [
            {
              "score": 5,
              "content": "You should see a therapist again.\n\nWith your dad.",
              "id": 8,
              "comments": [
                {
                  "score": 2,
                  "content": "I’ve tried but “therapy doesn’t work”",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA\n\nMost people who harp on disrespect like that are fairly rude in their own attitude toward others. But don't expect your mom to ever agree with you. She was okay with your dad being absent pretty much your whole life, so she's unlikely to change her tune now that he's around more for her.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "Oh I’m not mad at my mom or my sister. I’m not mad at my dad either. I just wanted to highlight that, for now at least, my house is a house divided",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA - uhhhhhhhhhh. Has your dad ever considered therapy? This kind of controlling and violent behaviour is borderline abusive, and might be attributed to some serious PTSD. \n\nThat being said, mental illnesses and traumas don’t give you the right to control other people through violent tendencies and intimidation. Respect is something that’s earned, not freely given, and even if you were rude that’s not an excuse to go off on you. I’m not surprised you have anxiety and depression, and I hope you can get some help for coping with those as well. This clearly isn’t a good environment for you, and you should probably look into ways of getting out.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA - Him being your dad doesn’t automatically mean you have to respect him\n\nYou get respect by giving it\n\nJust because he is your father and older doesn’t mean he gets to treat you like crap and yet get treated with respect \n\nHis “authority” lasts only till your 18\n\nHe seems to have a really short temper and doesn’t seem to like when anyone disagrees with him in anything",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "ESH\n\nI say this coming from a very similar situation. My dad also blows up over the smallest things and everything was disrespectful when he was in a bad mood. The “you should respect me because I’m your father” argument was also very common to him. I actually had a failed suicide attempt largely due to how he treated me, so trust me, I get how you can be feeling.\n\nGenerally speaking, his behavior is pretty crappy so he’s an AH here. While he’s likely provided a lot for you, that doesn’t give him excuse to treat you like an object he owns.\n\nHowever, your snarky comments also make you a bit of an AH as well. I did the same thing, and for me it developed over time as a mechanism for coping with him being overly controlling and acting like a toddler. Not sure how much you can relate to this, but for me It was an underlying thought of “well if I treat him with respect, nothing changes. If I actually disrespect him maybe he’ll notice.” In hindsight, that behavior only made the rift grow wider. I don’t blame you here, but at this point you’ve basically just got to take your lumps and then when you turn 18 and move out, just go your separate ways. \n\nSorry for going on a bit of a tangent, but what I wish I would’ve learned is that you can’t control how your dad acts, you can only control how you act. Just don’t really argue with him, but the trade off for him is that he is harming his relationship with you. Eventually, he may learn that once you become an independent adult, you don’t have to come back and respect him “because he’s your father.” Respect has to be earned.",
      "id": 14,
      "comments": [
        {
          "score": 1,
          "content": "Thanks actually. I do relate to a ton of that. I know I can’t control his behavior, I just wish that it was easier to recognize his good and bad days.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH, but you're a teenager. You GET to suck. Ask your parents for family therapy b/c your Dad really needs it and you deserve to have that.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor starters “civil war” is hyperbole we aren’t shooting each other. Also I’m doing this on mobile and I suck at story telling. I’ll try to do my best please try and follow to the best of your capabilities.\n\nSo I (17M) developed anxiety and depression partly due to my father (43M) being absent from my life because he served 24 years in the military. He retired 2 years ago and since then he blows up about almost anything. Disagree on dinner? Disrespect. Don’t want to watch the same show on tv? Disrespect. Don’t go to sleep on our bed time even though I’m practically an adult? Disrespect.\n\nYesterday I was getting into an argument with my sister about studying for the ACT. I don’t know how it is outside the U.S but the ACT is a standardized test that takes roughly 3-4 hours to see if you’re worthy to got to college. I didn’t want to do it as I literally spent my day doing homework and I really just want to relax. \n\nMy dad comes home and he sees us arguing. Of course he takes my sisters side because the ACT is important. \n\nFine I’ll study. So I read through some of the prep stuff but I don’t actually do the tests.\n\nMom gets home an hour later and we eat dinner. Everything is fine until we start talking ACT. My sister an I start talking about the best way to study. She’s on the side that I should do it untimed so I can build up my skills sooner rather than later. I said that I should do it timed that way I can establish a baseline and that all the teachers I’ve talked to agree. But before I can explain that, I get interrupted.\n\nDad decided that we’re getting to loud and that’s disrespectful.\n\nHe starts talking about how, once again, my sister is right. She took the ACT so she knows what she’s doing. He stops so I try and finish my point.\n\nDad: I wasn’t finish talking but ok\n\nSo I stop everything I’m saying.\n\nMe: what was that you said? Because to me it sounds like an unfinished thought.\n\nDad goes ballistic. I could have killed a man and he would have been calmer about it.\n\nDad: Don’t you f*%^ing talk to me like that I am your father and you don’t talk to me like that.\n\nMe: why shouldn’t I? \n\nDad: I’m your dad that’s why. \n\nWe go on a long argument about respect and how I should learn it.\n\nDad: I gave you what I can give and you talk to me like this.\n\nMe: what have you given me? Anxiety? Depression? Thank a f*%#ing lot for that. \n\nDad: you know what I’m done with this. You’re gonna get a 13 (very low for the ACT) and I’m going to f*%#ing laugh.\n\nHe gets up. He takes my phone and he walks away.\n\nMy sister is on my side about how dad has treated me. How he blows up over the smallest detail, and that he needs to respect us if he wants our respect. My mom is on dads side though. He’s the authority therefore I should respect him. \n\nI don’t think ITA but if I am please tell me. I did leave some stuff out for the sake of my own time, but if you need to know more than ask and I’ll try to answer.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA your dad needs help. I’m not saying that you handled this perfectly but you dad flying off at the handle like this all the time is abuse and how children grow and learn to adapt to that constant fear of verbal (and I’m guessing sometimes physical) abuse is not my place to judge. Sounds like you could benefit from some therapy and it sounds like there’s no place on earth your dad should be other than therapy. ACT isn’t the end of the world parents who put this much pressure on kids are bad parents not only that it’s just straight up bullying and verbal abuse. If you can leave as soon as you can. There is no fixing relationships like this in home. Your only hope is to live separate lives both go to therapy and hope that one day you get to a tolerable relationship you both agree on, but you don’t owe him a relationship that’s solely if you want it too. Understand that it’s not a you problem it’s a him problem and unfortunately all shitty parents have to have kids right otherwise they couldn’t be shitty parents? Sometimes we just have to accept that there’s always some kid out there related to a horrible parent, unfortunately that’s your lot in life but it most definitely doesn’t have to determine the rest of your life. The act nor your dad get to determine that. I wish you the best of luck 💓",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}