{
  "post content": "He’s 16, gained muscle mass, got a haircut, new clothes and new (fake af) friends. And a whole lot of confidence. I was happy for him.\n\nYesterday he threw a tantrum because our parents didn’t let him go into town at midnight in Spain. We are not from Spain. He wanted to bring home Spanish ladies so that he could fuck them. He told my mom to suck it, gave her the middle finger and slammed the door Cuz she told him no. I texted him we could go into town tomorrow, a little earlier and I would buy him a drink. He told me my parents would regret this day. Wtf.\n\nHe constantly talks about all the ladies that wants to fuck him and how they stare and drool. I don’t see them, but okay.\n\nMaybe it’s because I’m 19, I got out of bad relationship and really really enjoy being single with my smaller friend group of 6. I only know 30 people I want to invite to my party as opposed to 100, like him. We’re at different places in our life.\n\nBut shit when he talks like that to my parents and tells me that I’m the opposite of a sex god (when we literally look like twins, I’m just a girl) it pisses me off. Am I the asshole for saying things like “oh what the 3 girls you have had sex with?” “You mean your fake friends that you can’t trust?” “You’re really not THAT hot. And no you don’t look 21, you look 16, just like you are.” ? \n\nIt’s meant as a “get off your high chair” rather than a “I’m out to destroy your self esteem”.  He ruins our vacation with his constant sex talk and complaining.\n\nSo am I being the petty big sister or is he acting like a complete jerk?\n\nUpdate:\nThank you for the advice :) I had a little talk with him and explained why it’s uncomfortable for me to know about his sex life and by the facial expression he gave me, it seemed to sink in. \n\nThere was even a Spanish girl who actually flirted with him (in front of me) and instead of him getting all cocky, we just looked at each other and laughed :D",
  "id": 1,
  "comments": [
    {
      "score": 900,
      "content": "......what?....",
      "id": 2,
      "comments": [
        {
          "score": 437,
          "content": "Something tells me this is the reason alcohol is at 21 in America",
          "id": 3,
          "comments": [
            {
              "score": 175,
              "content": "Alcohol is 21 in America because we drive a lot more and when we're younger.  It was 18 in the 70's or something but raised after a bunch of teen DUI deaths.",
              "id": 4,
              "comments": [
                {
                  "score": 112,
                  "content": "Its 21 because of a lobbying group called MADD (Mothers Against Drunk Driving). Technically the drinking age is a state thing, but states could lose federal funding if they have it below 21.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Federal funding for highway maintenance, yeah.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "You buy drink at 18 in the UK (although you can drink it at private residences earlier), and can learn to drive at 17.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Legally being able to do something and affording it are two different things.  Its cheaper to learn how to drive and buy a car and more practical in the US than Europe.  Everyone drives at a young age here.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Wait, really? In Australia the legal drinking age is 18 and we learn to drive at 16. Pretty sure we drive just as much and at an equally young age.",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "Is this guy 16 or 12?",
          "id": 10,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "My reaction exactly",
          "id": 11,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -13,
          "content": "This would only come from a girl that has sexual thoughts about her brother...",
          "id": 12,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 179,
      "content": "ESH. He’s definitely acting obnoxious, mean, and intolerable. But your snide remarks aren’t helping any.",
      "id": 13,
      "comments": [
        {
          "score": 47,
          "content": "Nope they definitely don’t :/ but what can I do that helps? I ignore his comments most of the times, but eventually it gets too much",
          "id": 14,
          "comments": [
            {
              "score": 40,
              "content": "Have an actual conversation with him when he is not acting that way. As in, sit down with him when he’s being chill and talk to him about his behaviour and the fact he might not realise he is being obnoxious but that he really is.\n\nNot saying it’ll go well but if you want to try to solve it then that’s the way to go.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I get you, NTA. My mom's BF has a son who is exactly the same. 26 though and a chubby man-child neckbeard. Yet he is convinced that every single woman wants him, and won't shut up. His hobby is evaluating women, like sitting at a bar and ranking girls with his friends. Once he asked me \"AnnyPhoenix, do you think I'm irresistible?\" while bloody playing with his armpit hair! (we were at a pool). My response was a solid \"Nope, not one bit.\" to which he remarked \"Well that just means that you're not a real woman yet. Real women are thirsty over me.\" he went on bringing it up for months, as if berating me for my \"immaturity\". \n\nGo tell him, girl, before he gets too set in his ways. It gets so extremely annoying that you have to say something, and being nice just does not work. Talking face to face with an extra inflated ego is probably the most frustrating thing.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -15,
          "content": "Doesn't she sound like she wants to bang her brother?",
          "id": 17,
          "comments": [
            {
              "score": 3,
              "content": "... no?",
              "id": 18,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 143,
      "content": "NTA- Your 16 year old brother is going through a lot of changes (mentally and physically) which is normal. It’s also normal to be a teenager who has found a new identity and gain confidence. What isn’t normal is speaking to your parents like that, becoming a conceited d-bag, and thinking you’re God’s gift to the female population. Dad needs to put a quick and immediate halt to that bs. You on the other hand, have done exactly what a big sister should be doing; checking his bs every chance you get. I suggest having a conversation on how he would feel if some musclehead idiot was treating you in the same manner.",
      "id": 19,
      "comments": [
        {
          "score": 28,
          "content": "That last part may be a good idea. I want to add he’s quite protective of me. Yesterday he stepped in front of an old man who was staring at my butt and gave him a death stare, which really means he has murder in his eyes. I appreciate that about him at least :p",
          "id": 20,
          "comments": [
            {
              "score": 25,
              "content": "Yea, that’s a perfect example to use when having that discussion. Relate his bad behavior towards women to have it reflect into that creepy old guy that he adamantly wanted to beat up. Nothing more sobering than to find out you’re displaying the very actions of someone you despise.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "Maybe she isnt the asshole, but this KINDA comes across like she wants to bang her brother.\n\nBIG red flag....",
          "id": 22,
          "comments": [
            {
              "score": 11,
              "content": "Honest question, how does this sound like that?",
              "id": 23,
              "comments": [
                {
                  "score": -2,
                  "content": "She cares SO much about her brother’s muscle mass and sex life.\n\nBrothers are off limits. Always.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It sounds like she cares because he keeos bringing it up. You're reading into things, my dude.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 73,
      "content": "NTA but your family sounds fucking weird",
      "id": 26,
      "comments": [
        {
          "score": -1,
          "content": "My family or my brother?",
          "id": 27,
          "comments": [
            {
              "score": 37,
              "content": "Brother mostly but parents a little too. Don’t let your 16 year old walk over you",
              "id": 28,
              "comments": [
                {
                  "score": -8,
                  "content": "Wait what did my parents do?😂",
                  "id": 29,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Let their teenage son flip them off, tell them to suck it and run out the door. My dad would’ve beat my ass for half that lol",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 24,
      "content": "NTA. He is acting like a complete jerk. You're probably seeing bits of the people you mentioned escaping as he manifests every form of male obnoxiousness. But he is still trying to find an identity, so maybe a little sisterly advice after he has had that drink you offered...",
      "id": 31,
      "comments": [
        {
          "score": 6,
          "content": "What should I say? We have some pretty good, wholesome moments as well. I do give him advice, and always have. It’s mostly been about things you don’t want to ask your parents about tho (like how to hide your porn search etc). But this is not like that. This is him having completely changed in the span of 6 months and now I can’t even recognize him. I want to say something useful instead of my annoying comments",
          "id": 32,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "NTA, but maybe not the most effective way to get your point across. He’s 16, he’s gained muscle mass for the probably the first time in his life, and he’s overcompensating. Obviously he can’t keep talking like this for the rest of his life or he really will end up a virgin for perpetuity, but there is a way to confront him about this issue that will get through to him instead of bouncing off of his fragile male ego. It’s probably time for a father/son heart to heart, but if you’re willing to talk to him as his sister, then good on you.",
      "id": 33,
      "comments": [
        {
          "score": 5,
          "content": "I want to actually. He’s less annoying when it’s just the two of us, alone. He has ADHD, so my parents lets him get away with more than they should and maybe that’s why he’s less tolerable around them. I don’t really know what I can say though, since he tends to turn everything into a negative thing :/",
          "id": 34,
          "comments": [
            {
              "score": 8,
              "content": "Fragile male ego comes from insecurity, and the best way to get through to an insecure person is to get on their level. You can start with shared experience (“I remember when I was your age, I was really worried about what people thought of me,” etc.) or you can just be forthcoming about the fact that you sense he’s overcompensating but that you understand why. He’s a teenager, he feels vulnerable, and he’s being defensive in a socially offensive way. The goal of the talk is not to make him *more* defensive by being accusatory, but to make it known than he can let down a few walls and be a real person instead of a walking caricature of machismo. \n\nI doubt everything will be resolved in one conversation, but by talking on his level and making clear that you’re available to listen and give advice without judgement, you open the door to him seeking you out for future guidance.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Does he have a diagnosis/prescription? Shouldn't be drinking with most of the standard meds, they up your feelings of tolerance without the physical tolerance, plus heightened risk of stroke, etc. Bad combo with youth and repressed american alcohol attitudes.\n\nAs a fellow sufferer, that's a normal response. It's also a great avenue into depression which has a high co-morbidity. He's going to have to consciously get past those feelings because they will not stop. If he's open to advice, something like mindfulness meditation can help. It might help with the rest of the stuff too :)",
              "id": 36,
              "comments": [
                {
                  "score": 3,
                  "content": "We are not from America. At all.\nHe doesn’t take medication anymore since they made him feel really sick and drowsy. Besides his ADHD is only like 4/10 and has gotten much better with the age. \nHe got his diagnosis at like 4 tho",
                  "id": 37,
                  "comments": [
                    {
                      "score": 1,
                      "content": "my apologies on the assumption. \n\nYSK though, adhd doesn't get better, we just learn coping skills. Some of which are far too situational to function outside of the developed environment (eg going from school to work). Send him over to /r/ADHD.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "Is your brother the new overtly sexual George Michael from Arrested Development?",
      "id": 39,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "Giving his mom the middle finger? Sounds like your dad needs to throw a haymaker at his kid's face.",
      "id": 40,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "More family members discussing each other's sex lives. Bizarre stuff",
      "id": 41,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH I’m no therapist but still, most assuredly your brother is fighting his own demons.  If I had to guess, I’m betting he is struggling with his self esteem (though I could be wrong).\n\nWhatever the case is, though, I bet more than anything he needs support.   Please, talk with him from a place of love.   Let him know you love him and support him, you are there for him, and then see if he will talk about what’s really going on.  And apologize for anything bad you said to him.\n\nI really hope this helps the both of you.  Best of luck!",
      "id": 42,
      "comments": [
        {
          "score": 3,
          "content": "Thank you. We are currently waiting for the pool to clear out so we can go swim. Yesterday we both got really silly and played as if we were 10 again, so I think that’s an ideal time to remind him he’s a great guy :)",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}