{
  "post content": "I20f have been with my bf for almost 3 months. I just started staying at his apartment recently for overnights. He’s my first real boyfriend.\n\nI live at home with my family still and we’re very open. I walk around in a shirt and my underwear majority of the time, and it’s not an all girls house hold. I have a dad, and two brothers ages 17 and 14. I also did it growing up and I also have an older brother. If guest stopped by un announced growing up so be it, they’d see us in our bedwear. It’s just the normal for me, and I guess I expected other people to do it.\n\nAs you could probably imagine, I did this at my boyfriends apartment when it was just the two of us, which he loved. Then two days ago his brother stopped by and I came out of the shower in a t shirt and cheakies underwear(but not too cheakies it only exposed a little.) When my bf saw me he immediately whispered to me to put on some pants which I did. After his brother left he was super pissed an asked if I was trying to “seduce his brother or something.” I told him I didn’t mean anything by it, just that at home I walk around like this, and he said well not at his home and not when we have guest. He told me I looked like I was trying to “strut it for his brother.” I apologized but he was super upset and went to sleep early, which isn’t like our normal sleepovers since I stay over so rarely. \n\nIt’s been 3 days and he hasn’t asked me to sleepover again. Aita?",
  "id": 1,
  "comments": [
    {
      "score": 23001,
      "content": "YTA\n\nPeople you are unfamiliar with don't need to see your underwear.",
      "id": 2,
      "comments": [
        {
          "score": 5877,
          "content": "I agree it’s odd to walk around in your underwear  around strangers I would have been mortified and headed straight to the bedroom to change YTA",
          "id": 3,
          "comments": [
            {
              "score": 3156,
              "content": "I think it's odd to be in your underwear around family even. Maybe just me, but I don't want to see my siblings in nothing but their underwear.",
              "id": 4,
              "comments": [
                {
                  "score": 1293,
                  "content": "When I was about 13 my dad started getting uncomfortable with me being in a tshirt and underwear watching TV before bed and told me In had to wear pants. That was my social clue. So, yeah, now it’s something I would never do around men I’m not sleeping with.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 785,
                      "content": "My sisters and mom both walked around in giant tshirts and underwear. We were a very prudish family and it was just what they slept in.\n\nThat being said, if they walked out like that with company they would have immediately done a 180 and changed into something else.\n\nConversely, in college, my gf roommate would wear a crop top and panties around me. It wasn't a thing because no one made it a thing. I was there ALL the time.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 310,
                      "content": "I stopped chilling in boxers around the time I turn 10-11. It just becomes weird at some point as you start developing\n\nIdk how she didn’t have the common sense to put some clothes on when her bfs brother pulled up\n\nShe’s weird asf",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 332,
                  "content": "Grew up with older brothers - they liked walking around in their boxers - I was  not a fan... I remember one time I had a friend over (who only had sisters) and my brother walked into the kitchen in his boxers, saw her, and quickly walked out again - I didn't process anything weird until my friend was like OMG WHAT WAS THAT",
                  "id": 8,
                  "comments": [
                    {
                      "score": 236,
                      "content": "did the mouse come out of the house or something?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 112,
                  "content": "I don't want to be in just underwear around anyone but probably my husband. I will take a nap in underwear and a tshirt sometimes, but that's in my bedroom and I'm not just walking around like that. \n\nI think technically my roommate would have seen me in a tshirt and underwear once because I was taking a nap and was woken up by a phone call about an emergency with my mom and I had to go to the hospital 2 hours away and I went out of my room to yell for my husband. But it was an emergency and I was also wearing boy shorts so it's not like anything was showing. But it was still awkward as hell.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I've definitely snuck into the kitchen (just outside of my bedroom and on the other side of the house from the kids) in just my underwear in the middle of the night... that's it unless it's my partner. I also know that guys can wear no shirt, but it irritates me to try to police half of my kids about their clothes, so rules are rules and everyone wears shirts AND pants 😂",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "That’s actually normal in family where nudity is normal. It’s only weird if your parents didn’t raise you like that but walking in underwear in front of your bfs brother, that’s a big no.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Eh I grew up in a similar situation and if my family is all on vacation together packed into an airbnb together you’re either gonna see my dad, my brother, or myself walking around in boxers\n\nEdit: now that being said it’s only around family I’d never do it at someone else’s house",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I will say, it depends. I had a friend describe it to me once as \"Yeah I can wear underwear around my brother because he's my ***brother***. What's he gonna do, be into me? No, because he's my ***brother*** like we are flesh and blood so he doesn't see me that way.\" And sure, there are a million weird incest stories on reddit, but if you know your own family dynamics, then you know where stuff like that stands.\n\nNow here, it's the BFs brother, no blood relation to OP, so yeah I can see how there is danger of attraction there. But this should have been so simple - \"Babe can you not do that?\" \"Sorry it's what I'm used to but of course I can stop\" \"Thanks, you're great.\" Why wasn't it this?",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It's odd in some parts of the world, there are other countrys where this is the norm.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Right?  When I go to visit family, I make sure I'm clothed, and that I bring jammies that give me plenty of coverage if we're all lounging around watching TV.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I (30f) wouldn't care if I saw my younger brother (28m) in a T-shirt and boxers, but I wouldn't wear just a shirt and undies around him. I'm not sure why it's different. Probably because boxers are basically shorts.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It honestly depends on the family. I know in my family it's not odd to be running around in underwear while getting dressed even in our 30's at our parents but my friends house that is absolutely not how it goes. \n\nI think she probably shouldn't have done what she did because she doesn't know the brother. I do wonder if she knew the brother was before coming out the shower.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I agree that it's super awkward for most people to see a stranger in their underwear so YTA for that. \n\nBut I also think the BF reaction is not productive in a relationship. Some people are just more comfortable in their skin. To jump directly to comments like you're seducing the brother or strutting is a red flag for someone who thinks they own you and your body. What happens at the beach when your wear a bikini in front of friends and family?\n\nWhat should have been a funny encounter to be fondly remembered during the brother's speech at your wedding has turned into a red flag experience.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1433,
          "content": "Adding to the top comment.\nWhile I agree with YTA although softly, am I the only one that is getting icky vibes from the boyfriend's response? I understand that he's not okay with it, but jumping straight to \"trying to seduce his brother\" basically implies that he thinks she's walking around the house like that just to seduce him.\n\nEdit: Because it seems the last sentence can be misunderstood as \"him\" referring to the brother.\n\nI meant that the boyfriend's mindset seems to be \"my girlfriend is walking around my apartment in underwear to be sexy for me\" instead of \"... because she's grown up this way in her home and doesn't seem to think that this can be inappropriate in other circumstances\", which is why he jumped to those accusations when his brother was present.\n\nEdit2: I retract the \"icky vibes\" comment. While not a great response of the boyfriend, it's more understandable when factoring in the age assuming the boyfriend is around the same age as OP.\nThanks to /u/SpectralDinosaur/ for point that out.",
          "id": 20,
          "comments": [
            {
              "score": 1184,
              "content": "I'm a woman and would think a woman in underwear and a t-shirt was trying to be seductive to their partner. It's on TV all the time and whilst I grew up with just my mum and sisters, none of us ever walked around in underwear. It's all about what's normal to you.",
              "id": 21,
              "comments": [
                {
                  "score": 558,
                  "content": "In my house growing up, and even now, it was totally normal for us to be in underwear/occasionally naked around eachother. It’s just a difference in culture. It was never a “weird” thing for my mom and I for example, and it was certainly *never* seductive. It was just for comfort.\n\nIf a stranger/someone else came over though? I would’ve sprinted to the bedroom to find any pair of pants as quickly as possible. I think OP’s boyfriend is really overreacting, but I do agree on a very gentle esh.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 569,
                      "content": "I have to say I’m not pleased with parents who encouraged their teenage daughter to walk around in underwear when guests were over. Brothers, whatever who cares, but guests? No. Absolutely fucking not. It’s not even about decorum, you’re endangering your kid.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 211,
                      "content": "Pretty much this. OP describes a t-shirt and undies as \"bedwear\", which yes it absolutely can be, but when there are people you don't know coming over I feel like there's a difference between that and some normal pj's, you know?",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 101,
                      "content": "I don’t understand how you think the bf is overreacting AND that you should immediately run to the bedroom to cover up? You recognize the issue here and you have a cultural context that the bf doesn’t have. \n\nThe BF isn’t overreacted, he just misunderstands. He sees her choice of clothing as a sexual act, and it’s reasonable to be upset when that “act” is directed at his brother. \n\nSeems like both sides need to do a way better job of communicated.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "i think it’s more so her parents did teach her to put some pants on when company are over. my nephew is going through a stage where he won’t wear clothes, which is fine if it’s just the family, and he’s at home but when guests come over he needs to put on clothes",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You can't find me anything but ass naked in this house during my own time. The second that doorbell rings or any gues enters the door, I'm flashing to the closet for a full muumuu.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, what you do around family and a significant other is just…different. I grew up in and live in a place where same-sex nudity is no big deal, just a cultural thing specific to our unique location (think similar to nude saunas). And with my mom and many female friends, there isn’t an issue to pee with the door open around each other, or out in the woods on a hike. But I’m not going to do that with everyone, especially people of the opposite sex. Hell, some people have families where it’s normal to shit in front of each other while holding a conversation - and that’s fine if that’s your norm - but you don’t do it in front of others with whom you don’t have that kind of relationship no matter how normalized it is within your own family unit.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "That's fine for the actual members of the household, but the brother doesn't live there. He is a guest visiting his brother, OPs boyfriend. It is NOT normal to walk around your SOs family half-baked when they don't live with you!",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "That’s what I’m saying. If someone comes to the door, throw some pants on!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah, it's not weird for me either. I've frequently walked in on my mom getting out of the shower and have sat on the bed and talked to her while she gets dressed. She's done the same to me. We're just adult females, nakedness isn't always sexual, it's just our bodies, I feel comfortable in front of my mom and sister and they feel the same towards me. Even my best friend wouldn't be an issue, though I wouldn't do it with strangers.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 286,
              "content": "I am a woman and I would also assume someone walking out in their underwear was trying to seduce me/whoever in the room isn’t already fucking them. I ALSO walk around with no pants on, but not in front of my partner’s family. Common sense.",
              "id": 32,
              "comments": [
                {
                  "score": 60,
                  "content": "As a guy, the idea of walking around in front of a gf's sibling in only underwear is so weird and creepy.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 127,
              "content": "Attention seeking vibes is a very reasonable conclusion to come to from this situation. Thinking she might be wanting his brother to see her in her underwear is not an unreasonable thought.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Yep. bf's house = bf's rules, but assuming that she's trying to seduce his brother makes him look paranoid (and in this sub paranoid always means projecting). My boyfriend always walks in my house with only a shirt and (triangle) underpants, but it never once crossed my mind that he might be trying to \"seduce\" my family.",
              "id": 35,
              "comments": [
                {
                  "score": 69,
                  "content": "That's so fuckin weird why is your bf half naked around your family",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I mean the dude probably knows his brother better than any of us and his brother is probably a teenage horndog so it might not be all that difficult to seduce someone at that age even unintentionally",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Yeah, that made me cringe too. He has every right to be uncomfortable, but he could have addressed it like a normal person.",
              "id": 38,
              "comments": [
                {
                  "score": 140,
                  "content": "He did address it like a pretty normal person lol. Y'all are acting like none of ya' have any insecurities, or have never been jealous over something that could've just been a misinterpretation.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 102,
                      "content": "No, normal would be \"hey, why didn't you put pants on? That made my brother and I very uncomfortable\", not \"why are you trying to seduce my brother?\".",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 77,
                      "content": "Normal people are born self actualized, thoroughly self aware, and omniscient. Didn’t you know?",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "He did address it like a normal person.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Personally, I switch roles and imagine my bf walking around in his briefs in front of my sister. I'd call him a pig and shove him down the river. Decency and self respect, not to mention respect for your SO does not equal an ick. I would actually judge you for thinking it's a problem they reacted that way. Like maybe you're into the family scene when it comes to that stuff? Lmao. Otherwise why blur the line? \n\nWhat other reason do people have for walking around in intimate clothing in a situation like this with people they don't know very well? Psychological issues. This isn't a Victoria's secret fashion show.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Devil's advocate here. Considering how much he enjoyed her walking around his apartment like this when it was just the 2 of them, he probably got the idea that she was trying to be sexy for him. So when she walks out like that in front of the brother, well...",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "They're, presumably, both around 20 and haven't had real relationships before. That's prime fuel for HUGE insecurities. It's a bit shitty that he jumped to that conclusion first, but not surprising or that abnormal for the age.",
              "id": 45,
              "comments": [
                {
                  "score": 3,
                  "content": "You have a point there, I probably haven't factored in the age enough.\n\n20 is already a few years ago for me, so responding with that instead of \"That's inappropriate!\" or an angry \"What's wrong with you?\" is more understandable with that in mind.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Whenever a guy posts anything remotely similar to this, everybody always accuses him of playing dumb to get away with creepy / pervy behavior, and that he's gaslighting his gf.  So why is it just how she was raised, she doesn't know any different when a woman does the same things?  \n\nEvery man is automatically viewed as a manipulative villain, while every woman is viewed as a naive infant.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I would feel the exact same way if my partner came out half dressed in front of my friends/family. He probably does think that she walks around like that because he enjoys it. Clearly they’ve never had that “this is I how do things at home, is that okay to do here?” Talk.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 290,
          "content": "Her *cheakies* underwear at that. “It only exposed a little.”",
          "id": 49,
          "comments": [
            {
              "score": 115,
              "content": "[deleted]",
              "id": 50,
              "comments": [
                {
                  "score": 85,
                  "content": "Well it’s “cheekies” you know, like butt cheeks",
                  "id": 51,
                  "comments": [
                    {
                      "score": 39,
                      "content": "[deleted]",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "the misspelling of \"cheekies\" twice in OPs post was killing me.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I think that’s maybe the issue here; it’s black or white, there are shades of grey. If anyone — guy or girl — wandered around in cheekies (or a thong) while a guest was present, I think it’d be cause for some concern. In this case, if she was wearing boxers instead, it *might* be different cause they’re less form-fitting, less revealing, etc. Speaking personally, I’d be less self-conscious walking around friends and family in boxers than I would tighty-whities for the reasons above. Some articles of clothing are more revealing than others, and consequently have more of an association with “trying to be sexy”. Or improper, gross, etc. \n\nContext is also important. Most people wear their underwear when they’re comfortable (like when they’re around people who are used to seeing them in their underwear — or less), so me and my wife wear less clothing when home alone, even if we’re not playing at having sex. But if someone’s stopping by, we throw on more clothes. \n\nAlternatively, if a *group* of people are taking an impromptu dip in the lake and don’t have swimwear, yeah, maybe the girl(s) would strip down to their underwear and a tank top and it not be sexual. That’s not to say someone there might not *sexualize* them, but that’s a slightly different thing. Same thing if a dude decided to wander out of the bedroom in a thong during a family/friend gathering because he thought it’d be gross/good for a laugh. Some people might laugh, others might be uncomfortable. \n\nFor *her*, what she is wearing isn’t an issue, but I don’t think she is representative of what is considered socially acceptable. She just hasn’t had the experience — until now — where she was made aware that a lot (most?) people would find what she wore, in that specific context, as unusual.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 248,
          "content": "“BuT I hAvE bRoThErS” 🤦🏻‍♀️",
          "id": 55,
          "comments": [
            {
              "score": 7,
              "content": "Yeah wtf, if my older sister walked around like that I'd be like \"what the fuck are you doing put some damn clothes on\". And God forbid if my friends saw her like that, id never hear the end of it",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 149,
          "content": "Yea op seems sheltered…don’t assume strangers want to see you butt or boobs…just a general rule of thumb…or your underwear",
          "id": 57,
          "comments": [
            {
              "score": 9,
              "content": "Not to mention that she has only been with the BF for 3 months…barely time to really get to know the brother (still pretty odd to do something like that in front of the brother) but it’s the OP really being out of the loop that it’s the norm.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Agree, plus if this was a guy doing it to a girl everyone would scream he’s a perve or creep. It’s one thing to be tits out at your own home, but to have people come over like that is just common sense.\n\nFYI I’m always shirtless at my home #boobiesBeFree but I would never have guests over like that.",
          "id": 59,
          "comments": [
            {
              "score": 5,
              "content": "I myself come from a family that walks around in undies, and from a culture where it's common for people of same gender all wash together in a sauna entirely naked, but like, other people have to be ok with it.",
              "id": 60,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "even family shouldn't have to see your underwear...   \nit's cute when you're 5, but a whole ass adult?!? \n\nmaybe it's because my family raised us to be a little conservative... but idk this seems weird to me",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I like “YTA” becuase I was gonna say “AYD”(are you dumb) lol",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agreed. I grew up in a family that walked around in underwear but I wouldn't do this. It's extremely inappropriate to be around basically strangers in just your undergarments, especially since it isn't even your own home that you're in. YTA",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10174,
      "content": "YTA \n\nYou heard his brother was there and you still got cheeky (no pun intended). And no, it’s not normal to prance around in your underwear in front of guests.",
      "id": 64,
      "comments": [
        {
          "score": 1860,
          "content": "Or siblings",
          "id": 65,
          "comments": [
            {
              "score": 1241,
              "content": "[deleted]",
              "id": 66,
              "comments": [
                {
                  "score": 447,
                  "content": "It all depends on how you grew up. I would have never walked around in my underwear around my brother, that would have been as far away from normal in my house",
                  "id": 67,
                  "comments": [
                    {
                      "score": 398,
                      "content": "He just said it's different for each family.\n\nAnd honestly, guys walk around in boxers all the time in families. That's considered underwear..\n\nI find it an issue that girls can't be held to the same standards because they've been so overly sexualized that panties are seen as sexual 🤮.\n\nYou don't see boxers as sexualized... or even the tidy whities lol.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 58,
                  "content": "[deleted]",
                  "id": 69,
                  "comments": [
                    {
                      "score": 12,
                      "content": "If I (F) had a sister I honestly wouldn't even care about being naked in front of her (for changing or something...obviously context is important). People get naked in front of total strangers in the gym locker room so it's whatever to me. I've been naked plenty of times in front of my best friends and think nothing of it. So I'm not super conservative about my body. But to be in any state of undress in front of my BIL?! Absolutely not. My SIL, maybe to some degree, but my husband would rightfully be upset about me being half naked in front of his brother.",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "Are you my brothers? I thought about putting pants on before they got home...but that's as far as I got.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Thought about it 😅 but was tooooo lazy.  They already here and see and aren't complaining sooo will continue to be lazy 😊😊",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "yeah this, my little sister would walk around in a sports bra and boxers, that was just her comfy clothes. but never in front of extended family and friends",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah, family it depends on what you grew up doing and what’s normal or not. I wouldn’t walk around my family in my underwear. Around my boyfriend, sure. Around his roommate/guests/his family? No, that’s weird. Same way I would find it weird if we were staying with my parents/siblings and he walked around in his underwear, that would be weird. \n\nWhen we’ve visited my family, he throws gym shorts on before heading down for coffee. I’d throw on pj shorts or gym shorts if I was around his family too. \n\nBut I think the big thing here is, around family/in your own home, you and your family can decide what you’re comfortable with. Don’t do it at your boyfriends place around his family/friends/roommates. It’s not hard to throw on some pj shorts or gym shorts, or keep a bathrobe handy. OP could even ask to keep a spare bathrobe or some gym shorts at his place if she’s over there a lot. \n\nOP - sorry but YTA. It wouldn’t hurt to talk to your boyfriend, clear the air, and come up with a solution. Maybe he gives you a heads up if someone is coming over and you’re there, and maybe you could keep some sweatpants or shorts over there for when you spend the night.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Completely agree. I grew up with only brothers, and I don't do this personally, but I don't see an issue with it. I have changed (down to bra and underwear) in the same room with my brothers and they just know not to look, and I trust them not to. We grew up in a beach town, so they've seen me in a bikini a million times, why is an underwear and bra all that different? They also change down to boxers in front of me. I'm not sure why it's a big deal unless you're worried about them sexualizing you. But yea, I would never do it in front of a stranger.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 255,
              "content": "[deleted]",
              "id": 76,
              "comments": [
                {
                  "score": 78,
                  "content": "I am grown-up now and my brother is too, I am not uncomfortable to be in my underwear while he is present in the same room, but just when I change or get dressed. Yes, when we still were living in the same house (parents’) I could come to the kitchen wearing t-shirt and panties in the morning, but definitely not being dressed like that all day or in front of the guests. And yes, YTA.\nEdit: typo",
                  "id": 77,
                  "comments": [
                    {
                      "score": 27,
                      "content": "not everyone’s comfortable with it but i would say it’s definitely pretty “normal”",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I haven’t changed in front of a male relative since I was like ten, but I don’t judge families who do. It’s healthy, IMO. But someone else’s family? BFFR that’s not okay. Put your buttcheeks away.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 48,
                  "content": "Sure, as young children. Not when you're a 20 year old woman with 14/17 year old brothers.",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "It’s not OP’s siblings though.  And it’s generally not normal past a certain age for siblings of the opposite sex anyway.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's very culture centric tbh\n\nFrom reading this post it sounds European. It's normal in some countries there",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Eh nah it's pretty normal I'd say, especially as kids or young adults",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Why ?I get strangers as it may be perceived as sexual but im sure your siblings have no interest in fucking  you .",
              "id": 84,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Get off pornhub",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Very untrue, America is one of the only countries that is weird about familial nudity, it is normal to see your family naked most everywhere else.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I would give a pass to family that's living together mainly because I come from a place where a good part of the year is 1000 degrees with 1000% humidity and every family member from 3 generations is crammed together with no AC. Everyone would regularly be in as little clothes as possible just purely for survival. \n\nDoesn't change OP's situation though. She's still wildly inappropriate.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Nah i wore boxers growing up with no shirt but whenever guest were over, we had to put clothes on. Different for each family. I have never had guest over and been in my boxers lmao",
              "id": 88,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "No, it's normal if it's siblings. Me and my sister were raised getting ready in 1 bathroom with my mom. There's no avoiding it with families of daughters.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 364,
          "content": "Lol why do ppl in underwear get funny verbs for walking- like we suddenly \"prance\" or \"strut\" because less layers of material are covering us.",
          "id": 90,
          "comments": [
            {
              "score": 487,
              "content": "I don’t know. Probably for the same reason I suddenly start moseying as soon as I put my cowboy boots on.",
              "id": 91,
              "comments": [
                {
                  "score": 66,
                  "content": "How we doin, pardner 🤝",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Dammit, you almost made me spit out my mouthful of breakfast smoothie.  😄",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "If you're with your mistress, then now you're galavanting",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "new boot goofin",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I think it's to emphasize the carefree nature of it",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Personally, I like to saunter when I am in my unmentionables.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 71,
          "content": "It depends on the culture. It was quite common in an ex of mine's family in Milan, but still I'd say ESH for this situation. I understand both sides of the coin on this one, having come from the American South where such openness in front of guests, etc wasn't seen as a positive. Takes a lot to wash away those preconceived, backward notions I learned growing up down here, even though I'm liberal. But, yeah, there could've and should've been a discussion about it, especially as the bf had been dating her for at least 3 months and this has never come up as far as how her family is?",
          "id": 98,
          "comments": [
            {
              "score": 33,
              "content": "I'm from the deep South myself! And that whole home nudist thing definitely exists down there, too. Beyond the home, there are also [nude resorts down south as well](https://www.aanr.com) ... one I explored for a newspaper article I wrote 😉\n\nI always chuckle when I remember my mother calling us to breakfast on Saturday or Sunday mornings, yelling, \"Come to breakfast ... but make sure you put on some clothes first. Your grandmother is here!\" 🤣🤣",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yes. US culture generally seems quite prudish and expects you to cover up.  \n\nThis would not even be a conversation in Germany for example or Scandavian countries with a much less sexualised approach towards nudity.",
              "id": 100,
              "comments": [
                {
                  "score": 3,
                  "content": "Ya, it was a hell of a discovery when an ex and I discovered the coed spa there in Stuttgart was fully nude. Lol, the shock on both of our faces, but fuck it, it was Valentine's Day and a lovely place! Everyone else was doing it, so its normalized and just skin. Would go back again, the spa is cool af! I need to find the name...",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Oh yeah, when I moved to the South from Canada, I went from being a pretty conservative dresser to skimpy while wearing the same clothes lol",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6113,
      "content": "So if your Dad's male friend stopped by and you just came down from the shower in a shirt and underwear, your dad was cool with that.\n\nI personally find that maybe a little weird. I understand growing up around family doing that, and how that may be okay, but when ever anyone came around who wasn't immediate family to visit, pants on, it was more a respect thing to.",
      "id": 103,
      "comments": [
        {
          "score": 791,
          "content": "I find it weird even around her dad and brothers. Although I guess that's a double standard because my dad and brother would walk around in just boxers. My husband does that when it's really hot too but we also have a tenant and he doesn't do it in front of her. He walks around shirtless most of the time though and my friend once felt uncomfortable which I thought was ridiculous.",
          "id": 104,
          "comments": [
            {
              "score": 863,
              "content": "My parents sit around in underwear and sometimes I see my dad's balls and I hate it.",
              "id": 105,
              "comments": [
                {
                  "score": 905,
                  "content": "Enjoy the opportunity to gaze at your origin story!",
                  "id": 106,
                  "comments": [
                    {
                      "score": 401,
                      "content": "Now you made this their _villain_ origin story.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 133,
                      "content": "Duuuuuuuuude. I'm frikking dying. Needed this.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "The Balls of Life",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Just spat my lunch out bahahaha! You win the internet today!",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "DUDE!",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I didn't need to read that.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 172,
                  "content": "You don’t like seeing your first apartment?",
                  "id": 113,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Omg I’m dying laughing!!! Thank you!! I needed the laugh.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I just spit out my coffee!",
                      "id": 115,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "God damnit take my upvote!",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I've seen too many of my brothers and sisters ejected from that apartment, brings back bad memories.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 80,
                  "content": "Sometimes when I'm sitting in my underwear I see my own balls and hate it.",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "How loose of boxers. And by the way you lived there",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I’m kinda shocked he’s just letting his nuts just slip out. My partner and I are both men and we hangout in our underwear pretty often. I only ever see his balls if he is purposefully showing them off for some reason.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Depends on the cut. I use to have boxer briefs that were really loose. Mine has slipped out before without noticing. But once I did notice I would be embarrassed.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Pro tip: Look at his face while talking to him instead",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This made me lol",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "HAHAHAHAHH",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "This is fucking hilarious",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "ewww",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 188,
              "content": "You found it ridiculous? I find it hypocritical your double standards and inability to see the other side",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 123,
              "content": "I’ve never been more traumatized in my life, thus far, than when I (F10 at the time) had a sleepover at a friends house and her mom came to the breakfast table in (edited to add ONLY) only underwear and tights. It was the “norm” for them, but also my friend (F10) and her two 17 y/o brothers were absolutely mortified every time it happened.",
              "id": 128,
              "comments": [
                {
                  "score": 68,
                  "content": "I would be mortified too if my mom did that! My dad and brother also wouldn't walk around in boxers when guests were over.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 22,
                      "content": "The boys and father never did that, I would be ten times more traumatized as a young girl. I’m glad everyone doesn’t think I’m ridiculous for sharing. I’m being crucified here for this opinion and sharing a trauma. I guess it is Reddit, so this is typical behavior.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "When my brother or I  (also male)  had sleepovers... my dad would also appear late at night in his whitey-tighties to say something or tell us to go to bed.  Blech and mortifying!",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "OMG!! When I(M)was like 11 or 12 I went out of town on a trip with a friend and his Dad. We were staying in a hotel and at one point the dad and the son both came out of the bathroom ass naked. I had never seen another man naked besides my dad (which was probably when I was like 6 or 7)and it freaked me the fuck out. Still think about it randomly. Obviously some families view nudity differently and we’re pretty open inside of my household with our children but they’re still very young. But I would never think about hanging dong in front of one of their friends.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It is a double standard. If you think your brothers/father/husband are ok strutting around in shorts only, in their own home you shouldn't find it weird for her to do what she does in her home. You just admitted to having double.standards for men and women.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Walking around in boxers and cheekies are two different things. I feel like a guy walking about in tighty whities or even boxer briefs in front of his family would be inappropriate.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "The transition from being able to see your family changing clothes to it suddenly not being acceptable can be rough. Unless it's urgent, I agree that walking around in your underwear in front of others (male or female) as an adult can be weird. However, I'm a woman and when I started going through puberty (or rather when my dad started to notice me going through puberty) things got tense. My parents, two younger brothers, and I would be on vacation and everyone always changed in the same room, then suddenly my dad got angry when I tried. My mom tried to be reasonable and explain it made him uncomfortable so I should change in the bathroom. But, ultimately it made me feel like an outcast. Everyone else can hang out and talk in the same room while changing, but I'm not allowed there because of some hormonal thing I can't control. I remember going shopping with my mom years later and when I asked her to step out of the changing room so i could take off my clothes she laughed and kind of lovingly said \"you're such a prude \". \n\nThose kinds of interactions around puberty or younger have a lasting impact, positive or negative.",
          "id": 135,
          "comments": [
            {
              "score": 53,
              "content": "Why was your mom allowed to change with everyone and she's a girl too? It was just you?",
              "id": 136,
              "comments": [
                {
                  "score": 63,
                  "content": "I never got a chance to discuss it, but I'm guessing the other people in the room were fine with her changing (dad, obviously, and brothers were still young). I think my going through puberty made him suddenly aware of things he'd kind of ignored. Suddenly, I was an \"underage girl\" and that changed the entire dynamic of our relationship.\n\nEdit: To clarify, it wasn't weird that a young girl shouldn't change in front of her male relatives anymore. It was how it was handled in my situation. There was no discussion or explanation, just suddenly I was yelled at for trying to do something that had previously been normal and sent to another room by myself. Families all handle nudity in different ways and many times, they create patterns they didn't mean to.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 19,
                      "content": "You’re edit made sense. One day being allowed to do it, then getting yelled at must have been confusing. My father would never change in front of us (3 daughters) so the thought of seeing my father without clothes would probably scar me for life.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yea that is tough. I'm a father of a 2 teenage girls at 30 so pretty young. Once I noticed their awkwardness/hiding when putting on bathing suits or their reluctance of me knowing they had bras I made sure to respect their privacy but not shun them and keep it very open and honest about why the dynamic has shifted and that it's ok.\n\nMy hope is that this teaches them boundaries with male friends/boy friends in the future while also teaching them self respect. I hope it works hahs. While they are still awkward in bathing suits and period talks they seem to understand and know that if and when they may need me for anything like 3am female hygiene products I'm ready and willing.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "It was also weird because no one else had to adjust their behaviour except for you, which is totally unfair. Everyone should have had to start getting dressed behind closed doors or your dad should have learned to regulate his discomfort and avert his eyes - this wasn't your fault, reaction or problem really. It was his, and he made it a family thing.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "100% your dad was the problem not you. Your his daughter for Christ sakes! He can't look at his kid without sexualizing her??! The same ppl the have problems with women breastfeeding their kids, I can't wrap my mind around conceding to the creepy Dad vibe instead of calling him out.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "I'm a dude married to a woman, and we've got two younger daughters, like elementary school age. Our house is pretty free, as my wife will walk around naked before a shower, or come out without a top on to do something, and the kids think nothing of it. They sleep in T-shirt and undies, and will often walk around the house like that, or naked if they needed to get clothes from the laundry room. They'll climb and cuddle on me while in their sleep gear (I assume that'll probably stop as they get older and more self conscious). I'll sometimes walk around in a tank top and boxers, but more often than not put on shorts or comfy pants. I'll jokingly lament to my wife that it's not fair everybody else gets to be body comfy but me, cause I'm the one with the penis. \n\nStill, as free and comfy as we are, no way in hell anybody runs around in their underwear with guests of any gender there. Had a similar conversation about appropriate sleep attire when having a sleepover with friends or family. Shirt and undies are fine at home with your sibling and parents, but anybody and anywhere else requires another level of coverage.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I thought the same thing! That’s so weird that if her father’s male friend came over he was totally chill about it. Freaking creepy.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I’m a fucking nudist and I wouldn’t do that.",
          "id": 144,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "But according to her comments dad's friends did come over and they never \" looked\"at her differently. And they all saw her in her underwear and shirts.",
          "id": 145,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Right My family does it and I know it’s not normal for everyone but around guest or literally anyone but immediate family it’s weird asf wtf",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Ha. Without going into details that I will not go into.. when my sister got her first high-school best friend (she's 6 years younger than me) obviously they hungout at my parents house. First day friends mom came over she said to my mom \"oh my gosh you have a pool boy? He's cute\" my mom obviously said \"uhhh, that's my son\" \n\nPut 2 and 2 together.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My dad had no shame when it came to being naked in the home, say after a shower or while getting dressed.\n\nOne time when I was a kid I had two friends over and he came out of the shower naked and walked past my room; as soon as he saw I had friends over he quickly ran off and put clothes on. He came and apologized to my friends. He later told me if I ever have friends over and he's in the shower he'd better tell me so that doesn't happen again.\n\nWalking around in your underwear or naked in your home or with your family is fine, but it's not normal if company is over.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Now that you put it that way…that’s super creepy…",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3713,
      "content": "I'm going to say YTA. While you might be comfortable with this at home, you have to have a bit of common sense to understand that you are *not* at your own home and you were aware his brother was there (per your reply to someone else).",
      "id": 150,
      "comments": [
        {
          "score": 324,
          "content": "Yup, at least ask beforehand. I walked around like that at some of my exes their houses as well, after I noticed it was just normal there and after checking if people were okay with it. I am still gonna vote YTA, because you should've checked first OP, and if there are guests around, it is just normal to put on pants.",
          "id": 151,
          "comments": [
            {
              "score": 142,
              "content": "The terrible thing about asking, as I recall from some relationship therapists, is that you have to be ready to be told \"no.\"  Otherwise you're not really asking.",
              "id": 152,
              "comments": [
                {
                  "score": 7,
                  "content": "This is a whole paradigm shift for me.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Ask before?! lol im trying to imagine that….. you’re at your brother’s place and his girlfriend says “hey I was raised in a home where we hang out in our undies as a family. Can I take my pants off, my panties are only a little sexy. It’s cool if you take your pants off too” 😂",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "100% agreed. YTA for not confirming if it was ok in your bf home.",
          "id": 155,
          "comments": [
            {
              "score": 6,
              "content": "That's because she already knew the answer.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "She’s young so I’ll give her half of a pass on not understanding societal norms but the whole “this is how I’ve always done it at home” thing isn’t an excuse. The way you’re expected to behave/carry yourself at other people’s homes varies on expectations of the people that live there, every household is different and she seems to not understand that. So yeah she’s the asshole.",
          "id": 157,
          "comments": [
            {
              "score": 7,
              "content": "nahhh man i grew up in the same environment and know better no one should have to tell people these things it should be common sense",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yep. Exactly this.\n\nNot respecting other peoples bounderies in their spaces is the definition of being an asshole. You get a pass if you don't understand the norm but onces it's been communicated, you have to respect it.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2439,
      "content": "YTA.  \n\nI grew up in a relaxed home too.  Yet I knew--and you know too--that \"underwear\" are called \"underwear\" because it's normal for them to be worn under clothing.  Walking around in underwear around people who aren't family members and who have the same gender as people you date is a sexual statement and you know it.\n\nYou don't have to have the same attitudes as your boyfriend does about clothing, but you should respect his feelings by getting dressed when people who aren't him or your family or your friends are around.  Also, his brother may have felt uncomfortable.",
      "id": 160,
      "comments": [
        {
          "score": 393,
          "content": "I still remember the first time I got elastic boxers and my dad had to tell me you can't wear just those with other people arround. I don't know if the parents are neglectful, uncaring or both but it's not ok to not educate your kids like op's family did",
          "id": 161,
          "comments": [
            {
              "score": 238,
              "content": "The thing is, this wasn't just boxers that might as well be shorts. This was revealing underwear, where OP stated was exposing herself somewhat.\n\nThe bfs brother did not consent to walk in on a woman in just skimpy underwear on the bottom half.\n\nOf course, OPs bf took it the wrong way... being in underwear is sexual in nature, no matter the view op has. And I'm sure it was really uncomfortable for both as it showed OPs bf that the way she presents herself isn't just about enjoying doing it around him. It devalues it to be okay with doing it around anyone, especially another man.\n\nOP needs to apologize to both her bf and his brother. If she doesn't apologize she well find herself single.",
              "id": 162,
              "comments": [
                {
                  "score": 94,
                  "content": ">being in underwear is sexual in nature, no matter the view op has\n\nWhat?",
                  "id": 163,
                  "comments": [
                    {
                      "score": 97,
                      "content": "Yeah my granny undies scream sexy lol",
                      "id": 164,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 77,
                      "content": "[removed]",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I didn't realize the moments before I put on my work clothes were always sexual in nature 😅😅😅😅😅😅😅",
                      "id": 166,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "That's culture centric. In other cultures it might be fine.\n\nIt's wrong to tell someone their parents are neglectful or uncaring because they didn't Americanize their children",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "She did comply once she knew that her bf was uncomfortable.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2262,
      "content": "If you don’t know the difference between wearing just a t-shirt and underwear around your family vs in front of your bf’s (of 3 freaking months no less) brother, you are way too immature to be having sleepovers at anyone’s house.\nYTA",
      "id": 169,
      "comments": [
        {
          "score": 320,
          "content": "You are right and I mean wow! Frankly it baffles me she has to even ask this. This us way too immature and clueless coming from a 20year old.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 177,
          "content": "I mean it is her first real boyfriend and she called it a sleepover. Even with no wrong doing those two things alone indicate immaturity.",
          "id": 171,
          "comments": [
            {
              "score": 45,
              "content": "I have friends in relationships of over 4 years that don't live together and still talk about \"sleepovers\". It's just a term that's used by certain people, not necessarily immature.\n\nEdit: spelling",
              "id": 172,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She know it’s inappropriate because she stated that when it’s just her and her bf, he loves when she walks around underdressed. She is aware that being seen in her underwear is a turn on and is using the explanation of “that’s the way I grew up” as a way to excuse her behavior.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I wonder if it were his dad or his mom if she would have done the same",
          "id": 174,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1155,
      "content": "YTA Respect his boundaries, or leave.  Don't pretend the rest of the world grew up like you did.\nWe were a casual underwear family, too, but we put on clothes when others come over.  You know it's a problem. Go apologize, or move on.",
      "id": 175,
      "comments": [
        {
          "score": 276,
          "content": "She's already apologised, stated in her post. This isn't one of the usual \"validate my decision to be an AH\" post, this seems genuine confusion and wanting to improve.",
          "id": 176,
          "comments": [
            {
              "score": 152,
              "content": "This seems like a validation post to me. She apologized. She knew what she did wrong, then said she hadn’t been invited for a sleep over since. \n\nI feel like if you were genuinely confused, you wouldn’t apologize until you know why, but she apologized. That’s just my take on it",
              "id": 177,
              "comments": [
                {
                  "score": 83,
                  "content": "I agree, but just worth noting with the not apologising until knowing why thing, I (and I think many others) will apologise if we knew we upset someone/did something wrong, even if I'm not sure what I did was wrong. I know *something* was wrong so I'll apologise pre-emptively.\n\nJust clarifying that she could well be apologising without understanding.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Agree. Apologizing isn’t about who is right or wrong, it’s about 1-taking accountability for your part(and sometimes more, because of part 2) of the disagreement, and 2-valuing/placing the relationship above the disagreement.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "User name checks out. 😂",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I disagree. It's normal to apologize for upsetting someone, even if you aren't sure why they are upset or if you did anything wrong. Apologizing isn't an admission of guilt.",
                  "id": 181,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": ">I feel like if you were genuinely confused, you wouldn’t apologize until you know why, but she apologized. That’s just my take on it\n\nUm, as a Canadian I am deeply offended by this. I'll apologize to you if you're in my way, gosh darnit.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "She knew why, her boyfriend explained it succinctly enough. And her boyfriend was upset. So she apologized. \n\nNothing there is a mystery. You *should* be able to follow along.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It's really good form to apologize even if you don't know what the wrong thing was. You're apologizing for hurting them, not necessarily the thing you did",
                  "id": 184,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "It's not genuinely confusing though. You don't date someone for 3 months and prance around someone elses apartment when there are guests. It's completely immature and a disregard for her partners boundaries. \"Sorry\" isn't a magical word that makes all negative emotions go away in an instant.",
              "id": 185,
              "comments": [
                {
                  "score": 23,
                  "content": "Christ, lmfao.\n\nHer intention clearly wasn't to be disrespectful. It was just a misunderstanding. An apology and a promise to not do it again should be enough.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 13,
                      "content": "yeah it's wild these people cant seem to understand not everyone was raised the same way.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "BF really treated her like shit and all these people are saying OP's the AH and treating her like she made a horrible thing, honestly I think NTA just because she was confused and BF treated her horribly",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Exactly. At home, growing up, I believe there was a mix. I know my mom would be like this, but only on the second floor (bedrooms location). And one of my sisters and I would also be in t-shirt and underwear. But I think I stopped doing that around 11/13 years old. I don't think OP has never been in another person's house before (other than family, and current boyfriend), so she shouldn't be so unaware of the situation. Common sense is the key in life.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I really don't understand these posts. It's assuming that underwear is by nature more revealing than most swimwear which just isn't true. What makes it one more appropriate that the other? We live in a disgustingly prudish society.",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "He didn’t even state his boundaries, he was being accusatory and threw a tantrum. How is that stating boundaries?",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "He doesn’t get to have boundaries about her clothing.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "It's not a boundary. It's a rule. And how is she supposed to respect his rule before he tells her it exists?",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1038,
      "content": "Asshole? No. You two simply have a different understanding and comfort level regarding undergarments at home. Basically, you're naive, and being young having grown up in whatever way you did, that's just what you're used to. It's not the most common mentality, at least not in the US, but it's what you grew up knowing apparently. \n\nYour boyfriend is going to feel the way he feels about it, and you can't help that. All you can really do is just assure him that it was naivety and how you grew up, not a seductive or malicious predatory move, and move forward, of course with the understanding that with your boyfriend, company over means covering up. This isn't to downplay what you're comfortable with, but if company is coming over to his house, they are also more likely to share his sentiments with comfort-levels regarding clothing as well, so it's more of a benefit to all parties involved. If it is a dealbreaker, though, you're young and it's early in the relationship, you can go your own way if you need to. Somehow, though, I don't imagine a little misunderstanding like this would be cause for a dealbreaker on your end.",
      "id": 194,
      "comments": [
        {
          "score": 426,
          "content": "Seconded NAH. You just see things differently, it's a misunderstanding and a miscommunication, nothing more",
          "id": 195,
          "comments": [
            {
              "score": 53,
              "content": "I feel so too, especially as I imagine she’s talking about a long shirt here. I have an Oodie (giant fleecy jumper) that comes down to my mid-thigh. I’m often only wearing underwear underneath but feel like that’s covered enough to be decent.",
              "id": 196,
              "comments": [
                {
                  "score": 64,
                  "content": "I thought that at first too but as I kept reading it seemed clear the underwear and her “cheeks” were visible. So think just normal hip length shirts",
                  "id": 197,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Either way she would’ve been much more exposed had she come out in a bikini, but somehow those are okay to wear around other people.",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I don't know that I'd assume that. The shirt could be mid thigh, and just walking, especially from behind if loose enough depending on the woman, could be enough to expose some butt. I'm not even sure that it would matter if her underwear were showing at all based on the reaction. A long t-shirt kind of screams I'm not wearing much, and if the brother was going to get embarrassed or whatever about it with underwear showing, it probably doesn't matter if they weren't, and bf was going to have the same reaction.\n\nHonestly, and I know other people aren't going to like this take but it's what I believe, people need to stop sexualizing clothing and even naked bodies in general. A body is not sexual. Actions are. Was she prancing around and trying to give him a thrill? Or was she simply walking around normally and trying to be comfortable in a place she should feel comfortable? Did she sit on his lap and rub her \"scantily clad\" butt cheeks on him? Or did she go and sit/stand by her boyfriend and try to be part of the conversation?\n\nAll that aside, bfs reaction seems over the top if she not only immediately did what he asked, respecting his boundaries, but also apologized for making the mistake. Guy seems to have some like jealousy/insecurity issues separate from this.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I think the boyfriend is the AH. She made an honest mistake. Sure, he’s entitled to his feelings, but accusing her of trying to seduce his brother, rejecting her explanation, telling her that her intent was to “strut it” for him, and then ending the night early is intentional behavior.",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "I had to scroll down way to far to find a reasonable response such as yours.",
          "id": 201,
          "comments": [
            {
              "score": 83,
              "content": "Same. Girl's not an AH unless you do some assuming/projecting. It's pretty clear how her bf got the wrong idea, but it doesn't make her an AH. Just a dummy for the moment, who needs to adjust (which she seemingly planned to do).",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Same. Ig this sub is full of prudes and incels.",
              "id": 203,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Right?! So much jealousy in these comments.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 137,
          "content": "Idk about this. She states in a comment that if she knew her cousins were coming over they would all get dressed. She knew the brother was there that day and should've shown him the same respect.",
          "id": 205,
          "comments": [
            {
              "score": 94,
              "content": "I think she she meant that if she knew there would be guests (like for a dinner or something) she would get dressed but if someone showed up as someone else’s guest without her knowing beforehand she wouldn’t",
              "id": 206,
              "comments": [
                {
                  "score": 69,
                  "content": "Yeah, she specifically said that if people just turned up then so be it",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Did she know he was there? It read like she got out of the shower wearing top and undies and brother was there and boyfriend asked her to put pants on. Which she did with no hesitation. \nI honestly think it's a misunderstanding",
              "id": 208,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "My family did this too. I honestly think the way the guy reacted is worse than her innocently walking around in her underwear. People are calling her immature but the reaction of the guy is definitely immature. He could easily sit down and ask why and explain his side, but instead he got mad like a child.",
          "id": 209,
          "comments": [
            {
              "score": 57,
              "content": "how about don’t objectify women for walking around in comfortable clothing. I’m shocked the internet is so prude. If I was a guest in someone’s home and saw someone in their underwear, it’s whatever",
              "id": 210,
              "comments": [
                {
                  "score": 50,
                  "content": "Lol imagine if you were a guest in someone's house and there was a teen girl who didn't know u were there and she comes down in a tee shirt and panties\n\nAnd you automatically assume she's seducing you?\n\nBecause that's what her bf did. And reddit is backing this thought process",
                  "id": 211,
                  "comments": [
                    {
                      "score": 25,
                      "content": "So much incel thinking, it’s shocking\n\nI would expect that most people who see someone in underwear and a tshirt assume they’re just comfortable, but here we see a lot of prudes who hyper sexualize the smallest bit of skin on young women\n\nGet over yourselves people.",
                      "id": 212,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It's weird how over the top people are being about this.  My family is like the OPs, too.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My mom used to walk around in a t-shirt and underwear all the time. It was just \"normal\" in our household to be partially dressed around family, as long as all private areas were covered.  As I got older, I found out a lot of things in my household were outside of social norms and adjusted accordingly. As an adult now, I would never do this if my children were home and never ever with company, but I'm also 41. It seems like an innocent misunderstanding, and he overreacted instead of trying to understand her POV and gently explaining his norms and expectations.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Yeah but the bf reaction is over the top, that makes him the AH. Not a big one if this is the end of it, but if it was me it would light up like a massive red flag.",
          "id": 215,
          "comments": [
            {
              "score": 92,
              "content": "This one though. I would be concerned that the first thing he jumps to is she’s trying to seduce his brother.",
              "id": 216,
              "comments": [
                {
                  "score": 18,
                  "content": "My guess is that he believes she dresses like that around him FOR him. As in, he doesn’t really know it’s how she was raised. He sees this as a sexy thing his girlfriend does for him, and I’m sure he loves it. \n\n\n\n\nThat would make his reaction make a lot more sense IMO.",
                  "id": 217,
                  "comments": [
                    {
                      "score": 10,
                      "content": "In that way it would make sense. But there’s more mature ways to have that discussion without flat accusing your gf of trying to seduce someone. With that being said, they’ve only been together 3 months and she’s only 20. I’m assuming he’s in that age range. They’re still learning how to communicate in relationships and have those hard convos in a mature way. I want to add that I do think he is valid in having those feelings and wanting her to have some sort of clothes on when guests (especially his family) are over.",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yeah, I thought the same thing... I'm glad someone else said it.\n\nHow much porn has he watched for him to assume it's more likely she tried to seduce his brother than that she's made a mistake?! That's kinda messed up, I'd be feeling pretty crappy if that's what my bf assumed from my behavior.",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Why is this so far down… Jesus.",
              "id": 220,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Right? I had this feeling too.  Like, if this was honestly an aloof mistake, he has every right to express that he doesn't feel comfortable with it and have a discussion to see if they could find some common ground.  But if his reaction was explosive and accusatory, I'd keep a close eye on that flag moving forward.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "[deleted]",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Scrolled way too far to see someone being reasonable. NTA she was just treating her bf's place as her own which you should be able to do in a relationship. Once bf showed he was uncomfortable OP immediately complied. I do think bf's reaction was a bit much. They should've just talked about boundaries beforehand",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Seconded. Being an AH implies intent",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Agree, mostly. I /do/ think the boyfriend is an asshole for accusing OP of trying to seduce his brother. Like? That was very much an overreaction to someone who just came out of the shower.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I also feel like there are two separate responses going on with the boyfriend.\n\nOn the one hand, he's has a different upbringing and is just surprised and maybe even uncomfortable with this behavior she's found normal her entire life.\n\nOn the other hand, his response makes me also think he has some degree of \"me Tarzan, you Jane, my property\" mentality going on.  Which isn't entirely great, but maybe also understandable to an extent.\n\nMaybe ASK \"why flaunt the goods in front of my brother\" and listen to understand or compromise on the response, rather than immediately telling someone \"they can't\" or \"you're wrong\".",
          "id": 226,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 500,
      "content": "I know this is against a lot of the top comments, but I'm leaning toward NAH. OP is used to this, it's her norm. Her bf isn't. He confronted her about it, she put on pants and then explained and apologised. I feel like she genuinely meant no harm.\n\nIt's just a communication thing, now that she knows she'll wear her pants at his place (I'm hoping). BF is not an AH because for him, and obviously most people, its a bit weird but I don't think he's handled the aftermath very maturely, seems like she made an honest mistake, which again, she apologised for!",
      "id": 227,
      "comments": [
        {
          "score": 261,
          "content": "Omg! One sane person in the whole thread... What is WRONG with these people! The worst thing the UK did was exporting all the Puritans to the US where they multiplied and are still today oppressing people and making them feel guilty for no reason. Thank you Acceptable And. I agree I don't think she meant any harm either.",
          "id": 228,
          "comments": [
            {
              "score": 80,
              "content": "Right? A few days ago there was a similar story with a guy in underwear and everyone was saying it's normal..",
              "id": 229,
              "comments": [
                {
                  "score": 32,
                  "content": "But didn’t you know that women only walk around in their undies to strut their stuff but men only do it because it’s more comfortable?? /s",
                  "id": 230,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Good point. Hypocrisy is normal to so many people.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Do you happen to remember the post title or have it on hand?\n\nI'm painfully curious now, I really want to go and compare the responses.",
                  "id": 232,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Exactly, it's all prude Americans itt.",
              "id": 233,
              "comments": [
                {
                  "score": 16,
                  "content": "I'm American and I agree with you. The guy is clearly the asshole and he way overreacted. Seducing his brother because she showed too much leg is insane. She should take it as a good sign he's not currently talking to her and move on. He seems narcissistic and controlling.",
                  "id": 234,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "In America, you can't even wear a tank top without it being weird.\n\nAnd notice how it's only the women held to higher clothing standards \n\nPuritan misogynistic culture...",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Totally agree! This whole thread stinks of misogyny.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah this is the correct take imo. There’s a significant amount of (internalized or otherwise) sexism in a lot of the comments saying OP is TA. It’s a lack of communication 100%. I personally would lightly say the bf is TA for his over exaggeration immediately accusing her of trying to seduce his brother, but this is a scenario that can easily be resolve by a little more communication on both of their parts.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Oh, so I’m not insane and this is an American thing?",
              "id": 238,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "Agreed. But the bf’s reaction was over the top. Accusing her of trying to seduce his brother is not cool.",
          "id": 239,
          "comments": [
            {
              "score": 61,
              "content": "Yeah, that’s asshole territory in my book",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I can't believe how far I had to scroll to find someone pointing this out. I get what others mean about not treating his home like hers but to accuse her of seducing his brother? Like he couldn't just talk about this particular boundary without throwing accusations around and now everyone in the thread is assuming poor intentions.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yep. An ex accused me of this once. I was wearing short shorts and not sitting with my legs together. Sorry it's 40 degrees outside and I'd like to be comfortable! Not interested in the brother at all.\n\nIt's a sign of a bigger issue.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "Thank god! I thought reddit had collectively lost its mind on this one.\n\n“YTA because your boyfriend’s brother did not consent to seeing you?” what kind of unhinged bullshit is that!?\n\nIs nobody going to mention how weird it is that OP’s boyfriend immediately concluded that she was trying to seduce his brother?",
          "id": 243,
          "comments": [
            {
              "score": 9,
              "content": "That was my gut takeaway, seemed like a massive overreaction.\n\nBut then again I'm a hell of a lot older than them and pretty desensitized to things like nudity.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I think he was hurt more than anything. I can put money on him thinking that she was wearing that stuff “for him” and then he finds out that it wasn’t anything special and she just wears it for anyone. It’s not as special or intimate if anyone can see it, and I’m sure that kinda hurt him",
          "id": 245,
          "comments": [
            {
              "score": 29,
              "content": "Oh boo hoo, then he should grow the fuck up instead of accusing her.",
              "id": 246,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I feel like he is being an asshole since though. I said NTA but tbh his reaction being ongoing is a huge red flag for their relationship",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Totally agree. I’m quite surprised at all the pearl-clutching prudes in this thread. NTA",
          "id": 248,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I had to scroll so long, lol! Must be a lot of Americans who say YTA? For me this is completely normal.",
          "id": 249,
          "comments": [
            {
              "score": 7,
              "content": "americans are so weird about anything that could even be slightly related to sexuality, to the point where someone wearing comfortable clothes in their own home leads them to criticize that person. \n\nit’s truly insane here, there is nothing suggestive, sexual, or seducing in what OP did but americans are so weird about it that they make it that way",
              "id": 250,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "American here & I agree with the NAH votes on this one. OP & her bf just found out the hard way that they have different comfort levels. Nothing wrong with that. If anything, the bf's accusations towards OP are kinda over the top.",
              "id": 251,
              "comments": [
                {
                  "score": 3,
                  "content": "Obviously, we know it's not all Americans, but generally, it feels like there's such a strong and pretty toxic Puritan culture from a lot of commentors that are American. Makes me so sad because it leads to so much toxic masculinity, exerting control on other bodies and actions, and slutshaming people that have a right to do whomever they please.",
                  "id": 252,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "This, it wasn't done to intentionally cause harm/insult, it just she wasn't aware of their social norms and seemingly adjust after being told. A person can commit a social faux pas and not be an asshole, accidents happen. Honestly the boyfriend sounds more like the asshole because he instantly assumed she was being dishonest in her ignorance.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Also, OP never explicitly stated that she knew his brother was there when she got out of the shower. I interpreted it as she came out of the bathroom, he saw her, she didn't think it was a big deal and then went and put on pants, then her bf had a jealous meltdown. I feel like her bf is TA",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 255,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 408,
      "content": "NTA.\n\nI guess most of the redditors here come from family cultures that overly sexualise any form of nudity. There seems to be a belief that women’s clothing choices exists not in any way for the comfort of women, but for the male sexual gaze. \n\nI think if your bf had said ‘Oh nudity is more unusual in my family’ and ‘would it be okay with you to wear pants when we have guests’, I’d be more sympathic.\n\nBut to run with ‘your clothing choices mean you’re trying to seduce my brother’ is serious AH behaviour from him. I would be very upset with him if I were you. \n\nMe and my boyfriend are mostly in underwear in the house. If guests come round unannounced, they adapt. My partner is also Brazilian and it’s very normal because is hot in Brazil, so the less clothing the more comfortable.\n\nI’m so confused at all of these Y T A comments. Very weird, conservative, patriarchal views.",
      "id": 256,
      "comments": [
        {
          "score": 154,
          "content": "There appears to be a crazy amount of prudes in here, yours is only 1 of about 10 sensibile cmments sadly.",
          "id": 257,
          "comments": [
            {
              "score": 12,
              "content": "Yea this whole thread is bonkers; I guarantee all these people spew their lives into public on social media but god forbid someone possibly see your natural human body in your home.",
              "id": 258,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Agree with that. NTA.\n\nAnd I'm not Brazilian.\n\nThe BF clearly overreacted. Underwear and a tshirt is more than what she would be wearing on a beach day. Not that big of a deal for the little bro'.\n\nOP, be weary of that BF, he seems to be very insecure and prude.",
          "id": 259,
          "comments": [
            {
              "score": 7,
              "content": "Exactly. TIL the majority of Reddit has never been to a family pool party or the beach with their significant other’s family. The BF’s behaviour also stood out to me. Depending on how he worded it, definitely AH behaviour. Also shows that he’s the jealous type.",
              "id": 260,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Yes!\n\nI have found that most of them are American and a couple of others from more conservative cultures.\n\nAs a non American who lives in America, I am constantly surprised that my liberal friends, not all, but the ones that aren't have traveled extensively, lived in other cultures (not military, that is just American culture in another country) or are married to people from other cultures, are significantly more conservative than they think they are.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Truly astounded by the number of people saying she was in the wrong. \n\nSerious discussion has to happen between these two, but personally I'd lose the SO before I'd be forced to wear full pants in any place I was invited to stay.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "Also, it’s ok to say “it’s not something we do here”, but to accuse her of seducing his brother is so weird",
          "id": 263,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "[deleted]",
          "id": 264,
          "comments": [
            {
              "score": 11,
              "content": "It's cause America was colonized by Puritans and their values still trickle down into the social norm",
              "id": 265,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Dig dig dig, we have a winner ladies and gentlemen, spot on.\n\n*I'm too poor to give you an award, so this comment and an upvote will have to do.",
          "id": 266,
          "comments": [
            {
              "score": 3,
              "content": "I got you bro 😎",
              "id": 267,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">But to run with ‘your clothing choices mean you’re trying to seduce my brother’ is serious AH behaviour from him.\n\nI am stunned this wasn't the takeaway for the majority.\n\nAt worst, this is just a difference in accepted norms that could be handled by an adult conversation. \"Hey I know that's your norm, and I think it's awesome, but growing up we were more modest. Would you mind just throwing shorts on when family is here?\" Reasonable request, even if I think it leans to the weird side of the issue.\n\nBut to claim how you dress is an attempt to seduce is so blatantly problematic. Speaks to issues of trust, patriarchy, and about six other flavors of nuance.\n\nTurns out the boyfriend wound up far more exposed than OP.",
          "id": 268,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Omg been scrolling for like 5 minutes to find a comment like this!! Why is this subreddit so full of people of over sexualise the tiniest bit of nudity??? You’ve summed it up perfectly 👍👍\n\nOP is absolutely NTA.",
          "id": 269,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I cant believe i had to scroll so far to see this comment.\n\nwhen i was in greece as a child with my family, strangers dropped their bathing suits to get completely naked & either stay that way, or get changed into dry clothes\n\neta: this helped me learn that nudity does not equal alluring\n\nthe human body isn't some sexual thing. we live in them. if everyone in the usa learned to not sexualize regular nudity & confuse it for sexual advancements or offerings, i think the country would be in a much better place",
          "id": 270,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}