{
  "post content": "Hi\n\nI'll keep this simple, and avoid going over the top.\n\nIn a nutshell my GF (33) and her little girl (7) moved into my (35/M) house last year.  The house is owned and I bought it because I have two children (8 YO twins - M and F) from a previous relationship.\n\nWhen she moved her and her girl in I made it clear she was welcome to stay as long as she treated my house as she would her own.\n\nYet when she moved in her amd her daughter did the following over the last year or so.\n\n- Left mountains of food everywhere.  - Left pans of food on the kitchen counter until it went green with mold.\n- Got muck/handprints everywhere\n- Broke and refused to replace things in my house\n- Would leave the radiators, lights, gas on all day\n- Refused to tidy up saying she was tired\n- Left mountains of clothes everywhere\n- Used the floor as a rubbish bin (ended up with mice)\n- Constant drama, shouting, arguing - Witnessed by neighbours\n- Literally drained me emotionally and financially\n- Both of them gave me attitude non-stop, for no particular reason other than to stave the boredom.\n- Put holes for shelves etc in all my walls\n- Would spend money on fun things for her and her daughter, yet left me to pay the grown up things like bills, debt etc\n- Kept leaving the toilet a mess\n- Treat my own 2 children like dirt when they came over, ie shouting, drama, constantly blaming them for everything etc\n\nWhen I questioned her on any of these matters she would say I was being controlling.\n\nAbout a month ago, a serious argument erupted and I told her it's best she leave.  I said 'if you want to live like that, then go and get your own place'.  It was a shame for me to see my hard earned investment become ruined by someone with no respect for it.\n\nWe are still seeing each other, but now she has gotten her own place I feel terrible.  She's having to walk everywhere as she dosent drive, and her working hours have altered as previously I was taking her little girl to school to make life easier for her.  Also, she was only paying me £165 per month for everything, but now her bills will be in excess of £600 per month for her rent alone.\n\nI feel dreadful for this, I feel like maybe I should have had more patience towards them or been a better guy when they were here.\n\nAITA?  Or would anyone else have reacted in the same way?\n\n\nEdit: Just to follow up - She doesn't drive and I also feel bad that now she has to walk/get the bis everywhere as before I was acting like her own private taxi service.  Ie, taking her shopping, giving her daughter lifts to school and to dance classes etc.\n\nUPDATE:  Wow, didn't expect such a response from this!\n\nAfter getting many responses, roughly 90% of which say I'm NTA and the rest saying I am for staying with her I've decided to break this off.\nLike some of you've mentioned, I owe this to my children and myself to give them what they need.  A good, solid, strong dad who is happy and secure.  As of this point, she is no longer in my life.\n\nA while ago I asked my 8yo daughter if she thinks about me when she's not at my house, her answer was:\n\n \"Yes I think of you getting shouted at by XXXX\"\n\nSome of you have said I'm a shit dad for staying with her after all of this.  I would argue against this, but if I stay with her I would have to agree with you all.\n\nUPDATE:  I wasnt going to post this, but as many of you are asking about it as you consider it a factor, I'll respond.\n\nA)  No the sex was mediocre at best, once a week if I was lucky.\n\nB)  She never gave BJs\n\nC)  She INSISTED on me giving her oral sex before we slept together.  Every time.  She told me \"Go down on me, or there is no sex\"\n\nD)  Never did anything else.  Vanilla sex was as far as we ever went",
  "id": 1,
  "comments": [
    {
      "score": 14493,
      "content": "NTA and why are you with her still if she doesn't respect you or your property? This clearly isn't going to work out long term",
      "id": 2,
      "comments": [
        {
          "score": 5459,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 2137,
              "content": "My ex wife would like to give you a gold, but she's too busy with the next guy she's planning to destroy.\n\nEdit: Ty kind internet stranger!",
              "id": 4,
              "comments": [
                {
                  "score": 274,
                  "content": "Haha. Same here man.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">Haha. \n\nDamn I feel that.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Thanks for the laugh. I needed it today.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Anytime mate!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Is my mom your ex wife?",
                  "id": 9,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Only if you are a magical typing baby... Or over 18",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 527,
              "content": "The heart and the penis make a man do stupid things. \n\nMy ex wife was a lot like OPs Gf. \n\nConstant unfulfilled promises to get better, eventually I gave up and lived with it... \n\nDump and run, OP. She doesn’t respect you or your property and you can do better - even if that better is being alone.",
              "id": 11,
              "comments": [
                {
                  "score": 505,
                  "content": "Precisely why I don't date \"potential\" any more.  I look at the full body of work.  It helps I'm 46 and have more life experience.  Anyone can talk about getting better but actually taking the daily step to do so is another thing.  Mostly alcohol is to blame in my experience.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 360,
                      "content": "Don’t date potential. Damn, that’s deep.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 200,
                      "content": "\"Precisely why I don't date 'potential' anymore.\" \n\nPOETRY. After my last gf (granted, we were both VERY young at the time), I decided it was no longer in my best interest to wait for somebody to grow up. In the end I felt like I was raising her, not dating her. \n\nImmediately after found a grown-ass lady who was just finishing up school full-time WHILE working 40+ hours and who had also just dumped some dead weight. She'd been paying rent and bills on behalf of herself and her partner for years and finally got sick of her partner's lazy, spendthrift bullshit. \n\nWe're married now :)",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "I learned that in my early 20's thank God! Dating someones potential only leads to heartache and disappointment.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Once I learned this, things got a lot of easier for me.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Wow",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Yeah, after the 14th time they promise and it doesnt get better, you should probably assume they stopped trying or will never change.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 132,
              "content": "This fucking sub sometimes. The top post is calling a guy a predator for offering to pay his neighbor to cook.\n\nThis guy (and his kids) is a domestic abuse victim and people make jokes about his abuser having a nice ass...",
              "id": 19,
              "comments": [
                {
                  "score": 57,
                  "content": "There’s people sarcastically calling him father of the year and saying he’s the arsehole because he didn’t leave her before. \n\nIt’s 2019! Are we really still victim blaming? Haven’t they heard of coercive control?\n\nI hate to get all MRA, but swap the genders in this story. Ugly.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 45,
                      "content": "well im a feminist and ive escaped a violent partner and a lot of these comments make me sick.. he was very much being controlled and abused, the fact that he feels guilty about this whole thing and that SHE would call HIM controlling whenever he called her on her shit is very telling. \n\npeople saying hur hur dat pussy or calling him a bad dad are gross. it's dismissive and minimizing to say that men are so desperate and simple that they're ruled by the pursuit of sex to the exclusion of all else and it's cruel to call a man already riddled with guilt and trauma a bad parent for getting caught up in a relationship like this. emotionally abusive relationships are so insidious because you never see them coming, it's not until hindsight and a hundred little things add up and even then - an entire reddit sub needed to tell this guy that this isn't normal\n\nhopefully OP will start healing now that he recognizes what a problem his relationship was and start prioritizing himself and his needs now",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I feel like there's a lot of grey area that's being missing here.\n\nYes, he should be there for his kids. Neglecting the abuse of your children is just as bad as abusing them and he definitely should get some blame in that.\n\n\nHowever, a lot of the times abuse victims don't even realise they're being abused and see abusive behaviour as normal. There are a ton of reasons why people don't leave their abusive partners so it's hard for me to vilify OP. \n\n\nNevertheless, his children come first and he should recognize. If he still insists on seeing her after this then that is worthy of condemnation.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Men are making jokes about his ex having a nice ass and no gag reflex. Men.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Well I agree it normally wouldn't be a issue what he asked for. But the way he made it sound was kinda strange.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 57,
              "content": "[deleted]",
              "id": 25,
              "comments": [
                {
                  "score": 19,
                  "content": "Man. I'm 38 and have never encountered that. I wonder what I am missing. Or maybe I'm just a robot inside...",
                  "id": 26,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Not sure if it's a blessing or not that I've never experienced pussy so good I'd ruin my life.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Dude, Shakespeare is like required reading in High School.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I have and in the long run it's not worth it. There were so many red flags I just blatantly ignored because the sex was so good. We ended up engaged and then she cheated on me. Honestly, all these years later I feel lucky to have dodged that bullet. She ended up with 3 kids to 3 different guys and is still single, mooching off her parents.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "[deleted]",
              "id": 30,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "The main reason why I kept with an ex for so long...",
              "id": 31,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "> Some people see the good even in shitty people.\n\nThis still doesn’t explain it. You can see the good in someone while also not dating them. My neighbor is a drug addict that does shitty things but I can see they have a good heart. I still wouldn’t date them. You don’t need to date someone just because they have some good.",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "That was determined to be false.",
              "id": 33,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Taking a sip of coffee while in the later part of reading this comment was a bad idea.",
              "id": 34,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1036,
          "content": "Doesn't respect him and his property *and was abusive towards his children*. In their own home.\n\nOP's judgement is questionable. She sounds trashy as hell, it's not like it would be a huge loss if he never saw her again.\n\nEDIT: I just saw OP has posted in the past about his girlfriend **hitting** his child. Dad of the Year.",
          "id": 35,
          "comments": [
            {
              "score": 228,
              "content": "Yeah, property means sweet fa in the grand scheme of things, it's the mistreatment of the kids that gets my blood boiling.",
              "id": 36,
              "comments": [
                {
                  "score": 274,
                  "content": "Imagine being that kid and knowing your dad is still snuggling up to this witch. If you can't be trusted to be on your kid's side if no one else's, you've failed as a human.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 92,
                      "content": "I couldn't agree more. And the thing is, that trust can never be repaired, the damage will be permanent. This guy is risking so much more than he seems to even realise. Not so much for himself, it's the kids bearing that risk :'(",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "Imagine knowing your dad values sex more than your comfort/safety at home.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Imagine saying this to an abused woman... guys a victim here as much as his kids are.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "He's only human, we all make mistakes and I bet no one of you judgy balls have been abused like that so stop being so harsh and just give proper advice instead of acting all high and mighty - even though I agree",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It's odd that he cares more about his property and a woman he is not even married to than he does his kids. Those poor children.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "Holy shit, the gf hit OP’s child and he still stayed with her? He’s a shitty dad.",
              "id": 43,
              "comments": [
                {
                  "score": 156,
                  "content": "No, he’s being abused and needs help. You wouldn’t say this about a mother in a million years. \n\nSomethingsomething #whyhestayed",
                  "id": 44,
                  "comments": [
                    {
                      "score": 57,
                      "content": "I definitely feel like Reddit would call a mother out on this, but I agree that dad is also a victim here.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "If a mother lets their boyfriend hit their kid, that's pretty shitty as well?\n\nVictims are victims but kids are the ultimate innocent ones here.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I'd say the same about a woman. Those who don't value their children first in these scenarios *should not* be parents. If your child has been hurt or abused in anyway by the person abusing you, you are a shit parent for staying.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 113,
              "content": "He also said in one of his posts that she was subjecting him to physical harm, too",
              "id": 48,
              "comments": [
                {
                  "score": 105,
                  "content": "I understand there's a lot of complex psychology when it comes to staying with domestic abusers, so that complicates things somewhat. When it comes to your kids, though, I feel like that's the line. Being hesitant to leave an abuser is understandable if you fear an escalation in which your kids will be put in even greater danger, but that doesn't appear to be the case here. Maybe it's judgemental, but it's hard to respect someone who doesn't see protecting their children's physical, mental, and emotional wellbeing the greatest priority. Getting her out of the house was a great first step, but keeping her in his life means that he's keeping her in his kids' lives. Maybe OP needs therapy, or a come to jesus talk, or I don't know what, but he needs to act sooner rather than later. It's only a matter of time before she starts working on him again and then she's back in the house and the next thing you know they're married or she's pregnant, so leaving is harder, and his kids feel unsafe and abandoned, and their relationship is irreparably damaged.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "[deleted]",
                  "id": 50,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If he feels he can't leave her, he definitely needs to see a domestic abuse counselor. She has done a number on him, and he needs someone to help him see her manipulation and abuse.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Yeah, OP is hardcore TA for not immediately kicking her out when she hurt his kids.",
              "id": 52,
              "comments": [
                {
                  "score": 2,
                  "content": "No, he and the kid were victims. Don't victim blame.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Oh crap. I was side-eyeing him through my computer for staying with someone who was mean to his kids, but she hits them? What a garbage human. I hope he doesn't continue to choose his girlfriend over his kids. They will remember that he let her do those things. My husband certainly remembers his mom letting his step-dad verbally abuse and threaten him with violence. They aren't so close anymore. I don't think she even knows why. She's never cared to ask. What a shock.  \n\n\nOP- get to a therapist who works with domestic violence victims. You need some help getting out of this relationship and seeing her for who she is.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 223,
          "content": "[removed]",
          "id": 55,
          "comments": [
            {
              "score": 93,
              "content": "I wish my bills were $600/ month..",
              "id": 56,
              "comments": [
                {
                  "score": 71,
                  "content": "He didn't say dollars. That funny L shape means pounds. At the current exchange rate that makes, let's see... pushing $800. Wow. The pound's gone way down from what I remember. Yeah, still real decent actually.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I guess she just got used to spending all her cash on the fun stuff and didn't have much to fall back on.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Dude, that's most of a month's wages on full time minimum wage just on rent in the UK, and as a single mum (now) thats a lot\n\nBut she deserves it in this case so oh well",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The £600 is just the rent alone. She went from paying £165 for everything to who knows how much.",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "He was/is obviously in an abusive relationship.  Would you call an abused woman pathetic?  And the fact that this has this many up votes shows how fucked up this sub really is.  Pathetic.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "You're a dick. Abusive relationships arent always punching and screaming. You wouldnt say this to a woman, so why tf are you saying this to him?",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "What the fuck is going on in this comment section? Can you honestly not see that this is textbook domestic abusive behavior on OP's girlfriend's side? Do you honestly think calling OP pathetic for getting abused is the way to go? Are women who defend their boyfriend hitting them pathetic?\n\nI get it, it's the internet, you can say whatever you want, it's not serious anyway, hurr durr. But don't lie to yourself and act like this isn't standard human behavior that could happen to anyone in a specific situation.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "AudibleNog that's a real asshole comment to make. If this was a woman and the roles reversed would you recognise the signs then that this might be an abusive relationship and call the woman \"fucking pathetic\"? And how you have 100+ upvotes for this is quite scary.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 73,
          "content": "[deleted]",
          "id": 65,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "Or his CHILDREN?!\n\nOP sucks because he is continuing a relationship with someone who treats his children \"like dirt.\" GF sucks for all the other stuff.\n\nESH\n\nEdit after OPs edit: Props for self reflection followed by action. Not everyone is capable of facing criticism and changing because of it. Good luck to you and your children, don't let anyone make you believe you (or your kids) deserve to be shit on.",
          "id": 66,
          "comments": [
            {
              "score": 4,
              "content": "You suck for supporting domestic abuse and having no empathy for victims. Grow the fuck up.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Just wanted to say that the guy replying to your comments is a clown, and you're not saying anything even remotely controversial here.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Especially when he said she treats his kids terribly.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "He’s the asshole for considering letting a woman who treats his children like shit back into his home.\n\nOP your kids are old enough that a wicked stepmother is really gonna fuck with them. If you continue to let this slob treat your kids like crap don’t be surprised when you don’t have relationships with your adult children. \n\nYour kids (and you) deserve so much better.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Not to mention his kids.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "> why are you with her still if she doesn't respect you or your property?\n\nNot to mention his kids. \n\nNTA",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She probably WAS treating OPs home like she would her own... Dirty people are dirty whether in their own home or others.\n\nOP, NTA for kicking her out, only for still dating her (which I hope is ending based on the update). Your kids deserve better, why are you being selfish and being with this woman?",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6958,
      "content": "\"We are still seeing each other\" 🤦",
      "id": 74,
      "comments": [
        {
          "score": 1981,
          "content": "Sometimes posts on this sub really make me wonder why people put themselves through the things they do.",
          "id": 75,
          "comments": [
            {
              "score": 539,
              "content": "Love isn't always rational.\nAlso, moments when you either think that it is worth it, or you think that might be an attempt to change something by the other person(s).\n\nBut yeah, there is much you shouldn't put yourself through.",
              "id": 76,
              "comments": [
                {
                  "score": 112,
                  "content": "Yes, love may not be rational. But if you're making your kids live in a shithole and go through hell everyday just for the sake of \"love\"... Bish.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Yes, that would be irrational. See?\n\nThat's why moments of clarity are important. Where you take the time and think about things.\nThose are the moments people need to find, make decisions in, and act upon.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "There's a lot you shouldn't put yourself through, but love is complicated, I get it. However. She HIT. his KIDS. I don't care how \"complicated\" your love is, if your SO is abusing your children and it's safe to leave them, you *must do so.* He has the financial means to live without her (obviously, since he kicked her out), and he doesn't seem to fear for the safety of his children if he were to leave. It really doesn't get more simple than that.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "People are desperate, needy, and scared of dying alone.",
              "id": 80,
              "comments": [
                {
                  "score": 4,
                  "content": "I sure am but I still wouldn't put up with this shit.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "A lot of times it's inertia. They have to make an effort to change the situation and it's likely to be painful to get through. They get use to the daily abuse and have trouble mustering the will to do something about it.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Sunk cost fallacy.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I remember reading the #whyistayed and it opened my eyes to this. While we only see this part there is another part that the abusee holds onto.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Because their abuser has convinced them that every problem in the relationship is the victim’s fault, and the minuscule sliver of happiness that they’re managing to squeeze out of an abusive relationship is the most they’ll ever deserve in their life.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I have a former friend who refused/refuses to leave her mentally and verbally abusive boyfriend. He'd regularly leave her at home to go get drunk, then scream at her and break shit because she didn't sit at home alone waiting for him to get back so he could scream at her and break shit for another reason. But, accordimg to her, it was fine because he apologized every time and only occasionally got physical with her.\n\nAt the time I broke off the friendship she didn't have any actual friends because she wasn't \"allowed\" to. She had people she would secretly text when she needed someone to dump her emotional trauma on. Then she'd get mad and go no contact for a week when they expressed a negative opinion of her abusive, controlling boyfriend.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "They've never gotten better treatment. I can say from experience. I let people walk all over me, was a 'yes man' whenever people asked for money or help. I thought that was normal and when time came that I'd need help, I'd get it. I was wrong.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It's unfortunately standard behavior for people in abusive relationships. The human mind is extremely good in tricking itself. Abusers also often have the talent to make their victims feel guilty.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 136,
          "content": "Lol. This. I’m gonna say ESH bc OP is an idiot if it’s all true. However, this reads way too harsh and one sided for it to be completely true. If she was that bad they wouldn’t still be together.",
          "id": 89,
          "comments": [
            {
              "score": 170,
              "content": ">If she was that bad they wouldn’t still be together.\n\nYou're thinking too logically. People stay in all kinds of abusive relationships. She could be that bad or even worse.",
              "id": 90,
              "comments": [
                {
                  "score": 3,
                  "content": "Yes so true. This does sound pretty one sided though.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "How does him being an idiot make him an asshole?",
              "id": 92,
              "comments": [
                {
                  "score": 73,
                  "content": "He's making his children's lives difficult. He admitted that she hit them and he's still seeing her...",
                  "id": 93,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I keep reading through the post and I can’t find where it says she hit his kids? Could you point it out? Even if she didn’t hit them though, his kids don’t deserve to be treated in the ways she has been.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Ah, sorry, didn’t read close enough",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "Especially when he says things like I feel terrible but then describes running her around in his car as \" own personal taxi service\". I see a lot of what he does for her, and there's some resentment attached, what does she do for you u/writing316 ?",
          "id": 96,
          "comments": [
            {
              "score": 66,
              "content": "And she hit one of his kids. Like seriously OP protect your children and dump the witch.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "Lol how can they even salvage this?\n\nThey clearly weren't ready to move in together in the first place. They didn't fix any of their problems, just pressed the reset button. If they continue to see each other there will eventually be a need to move in together again, what will happen then? \n\nI'd guess the same disagreements on house tidiness...",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Captain save-a-ho",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Never in my 31 years have I heard of this. Not even in a TV show or movie lol living together, then moving out due to not getting on well, and staying together lmaoo sorry OP but I've never heard anything as daft in my life!! What was the end goal lol",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3985,
      "content": "ESH. How can you still be with a woman that threat your children like dirt?",
      "id": 101,
      "comments": [
        {
          "score": 451,
          "content": "She must give one hell of an awesome fuck and bj...",
          "id": 102,
          "comments": [
            {
              "score": 1013,
              "content": "Or OP’s misguided like a fuck ton of us are?\n\nI hate these 1950-esque jokes",
              "id": 103,
              "comments": [
                {
                  "score": 325,
                  "content": "You seem to be under the impression that nobody stays in relationships for the sex. \n\nOP legitimately could be in it for the good sex. Or maybe OP is misguided. But we honestly don’t have enough to say one way or the other.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 274,
                      "content": "> You seem to be under the impression that nobody stays in relationships for the sex.\n\nOne can stay in a bad relationship for a variety of reasons, including sex. \n\nBut \"Hehe, I guess she gives good head\" is different from \"Maybe they have great sex?\" The first is a joke, the second one isn't and you can ask yourself what makes the joke funny.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "[deleted]",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 102,
                  "content": "Imagine if all the women in abusive relationships on here got hit with \"but I bet you're still with him because he buys you things lol\"",
                  "id": 107,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Or if the men in abusive relationships were just told “suck it up pussy, are you a man or not?”\n\nOh wait we already say that to those guys",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Some of them are.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "The fact that he acknowledges her mistreatment of literally everything of his, including his own human children, makes me think he’s staying for sex or some other superficial reason. He has not given us one positive trait of hers.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "So lame and outdated.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "How is that a 1950s esque joke lmao a sex joke?",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "or shes abusive and victims tend to stay too long always",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "Or y'know. She's abusive and people tend to stay in abusive relationships.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I'm not sure if you're joking or serious, but...good sex isn't the only reason people stay in jaw-droppingly horrible relationships. For one thing, when you're in a relationship that has a lot of emotionally intense bad stuff, the good moments can seem a lot more powerful and intense by contrast. (Uh, including non-sexual good moments.)",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Well now we know from OP’s update, as easily could have been expected from the description of his manipulative, selfish, abusive, control freak partner. She was also! surprise! selfish and terrible in bed. \n\nMost long-term abusive relationships aren’t staying alive because of superficial transactional reasons like “haha awesome bj”. It’s more likely because the victim has deep emotional vulnerabilities that the abuser is exploiting.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I hate that a woman being good at sex is all it takes for a man to supposedly deal with an absolute loser.  I hate that this is a thing.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "He updated and he gets no blowjobs",
              "id": 118,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 148,
          "content": "This is so far down the list as well, after making holes in the walls for shelves. Treating your children badly should be reason enough to break up with her.",
          "id": 119,
          "comments": [
            {
              "score": 38,
              "content": "I saw it as an \"at the end for emphasis\" thing.",
              "id": 120,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Honestly when things are this excessively super bad and people come here like AITA? I always wonder if it is a fake karmafarm story. Like you cannot be THIS stupid.",
          "id": 121,
          "comments": [
            {
              "score": 16,
              "content": "It isn’t like domestic abuse, which is what this is, is something rational.",
              "id": 122,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "[deleted]",
              "id": 123,
              "comments": [
                {
                  "score": 2,
                  "content": "I see, I am sorry that has happened to you. I guess I am subconsciously trying to believe shitty things like this don't happen in reality but I guess they do.",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "People get sucked in by abusers, who are often very skilled at picking their targets and exploiting their weaknesses. I think some people also have trouble believing that their SO could be that awful of a person. They don't want to believe it and buy into all of the garbage these abusers spit out at them. Cognitive dissonance can be one hell of a veil for people.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "His post history is kinda depressing",
              "id": 126,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Ah, so all women in abusive relationships are stupid for not leaving.\n\nIt's as if, and stay with me here, abuse and love mix together in a horrible way that makes people stay in horrible situations cause they minimize the abuse but maximize the tiny bit of love they see.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 70,
          "content": "10 days ago he tried posting AITA for staying with a gf that hit his daughter (but was removed cause it mentioned violence), so that shows you what his priorities are.",
          "id": 128,
          "comments": [
            {
              "score": 26,
              "content": "Ooooh good detective work. So he is severely YTA.",
              "id": 129,
              "comments": [
                {
                  "score": 5,
                  "content": "I mean, clearly she sucks majorly, so I'd still go with ESH. However, a YTA judgement is fair enough as a means of driving the point home to OP: *Get. Out.*",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Ok. That kinda makes everything clear.",
              "id": 131,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "Apparently she hit one of his kids and he's still selfish enough to keep seeing her. I honestly have to question the principles  of a person who sustain a relationship with a person who was abusive to his kids. \n\nOp needs psychological help, he's falling into whatever emotionally manipulative trap this woman is setting",
          "id": 132,
          "comments": [
            {
              "score": 4,
              "content": "This entire thing is a bit strange. How do you take such pride in your home, yet let someone else's trash pile up to the point you have mice? At what point does you asking them to pick it up end and you pick it up yourself. Like, I understand he shouldn't have to pick it up. But still.. I wouldn't let it pile up like that. I'd clean it and give her an ultimatum that if it happens again, she can fuck off. That and the plates on the counter getting moldy. Stuff like this is the girlfriend's fault, 100%. But it shouldn't have gotten that bad.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Seriously. Why are your 8 year old children less important than this awful, disrespectful, freeloading woman?!",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I agree with this 100%. I grew up with a stepmother that constantly blamed me and my brother for everything, talked badly about our mother, and just generally treated us badly. My father didn't do anything and is still with her. That stuff can affect your self-esteem and mental health for years to come. ESH.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Why do woman stay in these type of relationships.  The way that this sub is treating this situation because he is a guy is outrageous. It is clearly an abusive relationship.",
          "id": 136,
          "comments": [
            {
              "score": 17,
              "content": "Yes, i also believe the lack of double standards is a bit alarming on this sub. I saw post were half of comments were \"get away from him, he is toxic and controlling\" on guys that did far little then what the woman from this post did.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I don't know.\n\nEveryone is very clear this is an abusive relationship.\n\nThat doesn't give him a free pass to keep hurting his daughters like this.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "It’s called either \nA) emotional manipulation (ex. Op asked her about all of the things he listed and she tried to put the blame on him saying he was controlling for even mentioning it to her and tries to put the blame on his children for something they did) or \nB) he’s “blinded by love”\nAlso this is just my opinion but she sounds a little entitled to me",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2017,
      "content": "NTA - Man, you just got used for a free place to stay and a free fucking vacation from responsibility. How the FUCK and why the FUCK are you still with someone like that? She just treated your own children like dirt while disrespecting you. I strongly urge you to evaluate this relationship.",
      "id": 141,
      "comments": [
        {
          "score": 327,
          "content": "Imagine as a kid growing up with a step “mother” and step “sibling” who get to do all this shit while you were raised to follow some rules and have some common fucking sense. Not to mention the constant arguing and OP’s kids receiving shit from the clearly shittier people. They’re 8 for fucks sake, they understand stuff, take better care of them.",
          "id": 142,
          "comments": [
            {
              "score": 28,
              "content": "This is the plot of Cinderella in real life.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1338,
      "content": "NTA She is a GF from hell, I don't understand how you still see her, I hope you don't bend and let her come back again",
      "id": 144,
      "comments": [
        {
          "score": 406,
          "content": "She is telling me that this is all my fault though.",
          "id": 145,
          "comments": [
            {
              "score": 1293,
              "content": "Well, it’s not.",
              "id": 146,
              "comments": [
                {
                  "score": 34,
                  "content": "It kinda is he brought that crap on himself.... And look at him he still feels guilty... I mean dude have a little self respect would you n take better care of your kids.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 488,
                      "content": "Shes abusive. that's what abusers do. Dont blame the victim for their abusers actions",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Don't blame the victim. Yes he could have done better, but he's still the one getting abused here.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 327,
              "content": "Because she's abusive and manipulative. Abuse doesn't have to be physical. Read that again.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 287,
              "content": "Of course she's telling you it's your fault. It's her personality - she's dysfunctional, possibly mentally ill or personality disordered. She's incapable or unwilling to take responsibility for herself and her child.\n\nNo sex is worth it. And if she shows you affection, she's faking it. You've been used all kinds of ways. \n\nIt's only your \"fault\" that she has to take care of herself now.\n\nCut her off. Work on yourself.",
              "id": 151,
              "comments": [
                {
                  "score": 106,
                  "content": "Sounds possibly narcissistic",
                  "id": 152,
                  "comments": [
                    {
                      "score": 126,
                      "content": "This relationship is probably so draining on your own kids too.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "dude think of your children. you literally said she treats them like dirt! how in the fuck are still trying to justify being with her?\n\nI had a similar situation growing up and let me tell you even years later it's sometimes hard not to hate my father for the unnecessary pain he put me through by moving in with my abusive piece of shit step mother. is that what you want for your future? your kids to hate you?",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "It doesn't matter if she is or not. You need to cut her out of your life, and especially out of your kids lives. She is not a good person, stop talking to her. Stop seeing her. Block her on everything.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It's not narcissistic to put yourself first. It's not narcissistic to refuse to help someone who has been nothing but trouble for you. Narcissism means you knowingly and directly harm and manipulate other people to get what you want. Your GF is the narcissist, not you.\n\nYou are in an abusive situation. Get out.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah. And you sound desperate as fuck. The only explanation for how someone could be so pathetic for such a rotten woman.",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Agreed. Likely covert, probably has a history of personal trauma. \n\nHurt people hurt people. Not an excuse, just a fact.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 135,
              "content": "OP it really shows that you have a good heart in feeling dreadful about this, but I think this girl is taking advantage of that good heart you have and making you feel guilty about something that is not your fault.\n\nYou worked for that house of yours. That was a goal and you’re proud of it, that’s part of you. She doesn’t respect it. You have two kids who are completely innocent of anything. She doesn’t respect them either. You have a heart and she’s walking all over it. She doesn’t respect you. These are three very important things in your life and none of them are getting healthy nourishment by this woman. And they should be.\n\nFind someone who builds you up and doesn’t slowly crumble things down like it sounds like she was doing with your home. Stick to your guns, reevaluate, and also I just want to say make sure your kids are always treated properly.",
              "id": 159,
              "comments": [
                {
                  "score": 43,
                  "content": "Thank you 😀",
                  "id": 160,
                  "comments": [
                    {
                      "score": 31,
                      "content": "You can do better.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is such nonsense for one simple reason, he let this woman live with his kids for a whole year without doing anything about it. It took a serious argument for him to finally do something about it.\n\nHe admitted he knew that this woman was treating his kids like dirt, therefore he consciously made a decision to prioritize his own selfish needs (either sexual or companionship) over his children's development. His kids clearly learnt that he isn't a good role-model and won't stand up for them if they need it (the saddest part); this is very evident from their response to his question:\n\n> \"Yes I think of you getting shouted at by XXXX\"\n\nOn the surface, it may appear that OP is being an angel and helping a single mother out, but when you dig a little deeper, you realize that he's doing it at the expense of his kids' well-being; does that sound like someone who 'has a kind heart'?",
                  "id": 162,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Damn dude you actually just taught me a lesson, no sarcasm, thank you",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "How on earth is her laziness, entitlement, disrespect, and basic shitty behaviour all round, *your* fault? What, did you force this alleged adult to treat the kids like crap? To wreck the place?\n\nToxicity alert :(",
              "id": 164,
              "comments": [
                {
                  "score": 2,
                  "content": "Get this...my ex, who barely worked a day in her life, complained that *I had a job*, and it was my fault I never \"spent enough time with her\".",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "You’re in an abusive relationship, it sounds like you gave her every opportunity to get better but instead she used you as a crutch to never learn to walk again. The only reason she’s still with you is that she thinks that you will give her that crutch back.\n\nRespect yourself and find someone that will help you as much as you help her instead of being with someone who makes you do double the work.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Because you were a cheap way to live. She has zero respect for you. Even if you have no self respect how are you okay with someone who mistreated your children? Dont be the sort of father that chooses having someone to have sex with over your own kids.",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": ">Left mountains of food everywhere. - Left pans of food on the kitchen counter until it went green with mold.\nGot muck/handprints everywhere\nBroke and refused to replace things in my house\nWould leave the radiators, lights, gas on all day\nRefused to tidy up saying she was tired\nLeft mountains of clothes everywhere\nUsed the floor as a rubbish bin (ended up with mice)\nConstant drama, shouting, arguing - Witnessed by neighbours\nLiterally drained me emotionally and financially\nBoth of them gave me attitude non-stop, for no particular reason other than to stave the boredom.\nPut holes for shelves etc in all my walls\nWould spend money on fun things for her and her daughter, yet left me to pay the grown up things like bills, debt etc\nKept leaving the toilet a mess\nTreat my own 2 children like dirt when they came over, ie shouting, drama, constantly blaming them for everything etc\n\nThis is why you kicked her out. This is on her. It isnt your fault her life is hard. It is hers\n\nShe lacks respect for 2 major things. Your home and your kids.",
              "id": 168,
              "comments": [
                {
                  "score": 13,
                  "content": "I'd add a third to your two of his home and his kids - she lacks respect for OP as a person. I'm not sure she respects him even as a useful ATM for her. \n\nAt 35 OP is nowhere near old. There are lots of lovely women out there he could have a real relationship with, including lovely single mothers. The one he's stuck on comes across as abusive, narcissitic and manipulative. \n\nOP - I don't care how low you are feeling after having at least two serious relationships go south. Block this gaslighting user and go looking for someone to have an equal relationship with. They're out there...",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "She's gaslighting you, dump her ass",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Because she's abusive, that's why.\n\nSeriously. Cut the tether and run. It will be substantially easier now that she isn't living with you.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 889,
      "content": "YTA (Edit: ESH) because you are still dating a woman who abuses your kids.  Stuff like that can mess up a kid for life.\n\nEdit: people have pointed out that OP is a possible victim of emotional abuse. I was  so caught up in the long list of his GF’s “troubles” and the fact that her abuse of the kids was listed LAST, that I lost it.\n\nOP take the resources you were giving that woman and use them towards individual therapy for yourself and family therapy with your kids. Good luck.",
      "id": 172,
      "comments": [
        {
          "score": 195,
          "content": "so, that would be esh, the \"abusive\" gf and the op, for not breaking up with her.",
          "id": 173,
          "comments": [
            {
              "score": 39,
              "content": "To be honest, I don't care about OP's Girlfriend. If a parent is willingly exposing their children to abuse, he/she is the asshole. OP is only enabling that POS to abuse his own  children that's why he is the asshole.",
              "id": 174,
              "comments": [
                {
                  "score": 101,
                  "content": "Because he’s being abused and manipulated, Jesus. He’s as much a victim as his children are.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 2,
                      "content": "OP also lacks enough common sense to put his kids' well being ahead of his romance interests. That's shown by him listing \"kids being abused\" LAST in his list of grievances. He needs therapy, but he also needs to set his priorities in order. ESH still.",
                      "id": 176,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "thanks, i was so focused on how misplaced the question was, forgot the ESH option.",
              "id": 177,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 79,
          "content": "Because he’s being abused and manipulated, Jesus. He’s as much a victim as his children are. \n\nHe doesn’t need to be attacked, he needs fucking help and therapy.",
          "id": 178,
          "comments": [
            {
              "score": 51,
              "content": "This is one of those \"if the genders were swapped\" thing, I swear",
              "id": 179,
              "comments": [
                {
                  "score": 22,
                  "content": "I usually roll my eyes at the \"gender swap\" comments, but Jesus Christ this thread is horrific. Imagine a thread with hundreds of comments telling a woman she's a stupid bitch because she has an abusive partner.",
                  "id": 180,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Victim blaming.",
          "id": 181,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "I would love to see this reply in response to a women posting a story about her abusive BF.....it's just an awful reply overall but the gender dynamic would be interesting.",
          "id": 182,
          "comments": [
            {
              "score": 6,
              "content": "I take ownership of that and apologize. I was so irritated by the sob story about how bad his GF has it  (and the fact that he listed the abuse of his kids LAST) that  I didn’t think about his emotional state.",
              "id": 183,
              "comments": [
                {
                  "score": 6,
                  "content": "Well isn't that a mature response! I appreciate that. Have a great day.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "His GF is abusing him as well. ESH",
          "id": 185,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "u/NYCQuilts edit your post so the bot isn't confused by two scores in your post. Do \"Y T A\" with spaces or dashes (-) in between the letters.\n\nOh, and ESH in this situation. If this was a woman staying with a freeloading man who was abusing her and the kids, and she were questioning leaving him, I'd still say E S H. Him listing the abuse of his own kids LAST is what pushes him into asshole territory. That shows that OP is not in the right headspace to be a parent (in my personal view).",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 525,
      "content": "What were you doing when she was treating your kids like dirt? How can you even think about inviting someone, who is hostile to your kids? Is getting laid that important to you? Why the fuck you care about this person so much?\n\nYou are not the asshole for telling her to move out, you are an ass for not doing this earlier.",
      "id": 187,
      "comments": [
        {
          "score": 374,
          "content": "Yelling at them constantly, telling them off etc.  \nIf one of mine did something they got chores etc to do, told off.  If I tried to tell her little girl off for something, she would be in my face squatting up to me.\n\nI did ask her to move out a number of times before.  Even my parents suggested it to her.\n\nI am an ass for not doing this sooner.",
          "id": 188,
          "comments": [
            {
              "score": 423,
              "content": "And you are still dating her? Unbelievable.",
              "id": 189,
              "comments": [
                {
                  "score": 12,
                  "content": "I wouldn't even call her a girlfriend, it sounds like the poor guy was stuck raising some other dudes daughter.",
                  "id": 190,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 232,
              "content": "Grow a backbone at least for your kid's sake. It's horrible that your kids have been forced to live in an environment with MOLD AND MICE because you want to stay with a manipulative person who gets your dick wet.",
              "id": 191,
              "comments": [
                {
                  "score": 4,
                  "content": "You’re such an asshole. He’s a victim too and you’re blaming him wtf",
                  "id": 192,
                  "comments": [
                    {
                      "score": 4,
                      "content": "The real victims are his kids",
                      "id": 193,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Yes, we're blaming him, because he put his kids through something horrible. If he was single then I suppose I would feel some empathy for him, but not in this situation.",
                      "id": 194,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "WHY ARE YOU STILL WITH HER? Have some respect for yourself buddy.",
              "id": 195,
              "comments": [
                {
                  "score": 4,
                  "content": "Not to mention some care for his children :(",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "I can't even contain my disgust for you right now that you allowed this woman to treat your kids so poorly. I can't describe my fury that you continue to see this woman who abused your kids. ESH except the kids, but YTA for bringing this person into your children's lives. My god man, how can you feel sympathy for this woman over your own kids? She must be really good in bed if you're so willing to abandon your role as a father over her. Your kids must think you don't love them at all.",
              "id": 197,
              "comments": [
                {
                  "score": 3,
                  "content": "Yes. Well stated. I’m going to add there are sadly many men (and also women) like this who put their new relationships above their children. IMO that is the exact opposite of what they should do.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It's really sickening. Be a parent or don't, but if you decide to be one, don't fuck up their lives by bringing toxic people around to abuse them. They don't deserve that. I'm really hoping that /u/Writing316 only gets the kids once in a blue moon because I'm honestly just hoping for any situation where his kids aren't around this abusive woman and their enabling father very much.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "[deleted]",
              "id": 200,
              "comments": [
                {
                  "score": 15,
                  "content": "Dude, that is insane behavior. Talk to your partner like an adult. Kids will get yelled at sometimes. As long as it’s not over the top, abusive, or targeted out if resentment - kids fuck up. Having a voice ‘a little bit’ raised to them will not ruin their lives. If anything, you’re showing that manipulating relationships for your favor by threatening breakups is ok. Your daughter SHOULD be your priority, but acting like a child in front of her is hurting her more than being talked to loudly once is.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Trying to overexplain/justify your own behavior so that you’ll feel good about yourself is not the way to go.\n\nYou’re also awful",
                  "id": 202,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Yes, and also an ass for still seeing her. \nYou need to end things with her. **Completely cut her out of your life too, don't remain friends or call to check in on her or answer calls or listen to apologies from her. Cut her out. **\n\nAnd once you've moved on, don't tell yourself \"I'm an ass and I'm sad for myself for being weak.\" instead tell yourself:\n\"I WAS an ass but I now choose to be stronger and do better!\" move forward, make your kids feel your confidence in changing for the better and learning from your mistakes.",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "You are an ass for not cutting this infection out of your life.",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Youre an ass for not leaving her already that makes you a bigger asshole than her even",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Jesus Fuck. I'm not your children and I'm disappointed in you.",
              "id": 206,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "YTA This so much. You're caring about your house more than your kids. That bitch should have been out the second your kids were being abused having to live with the verbal abuse, mold, and mice. Seriously f you OP.",
          "id": 207,
          "comments": [
            {
              "score": 24,
              "content": "And physical abuse. Check his post history- \"AITA for not breaking up with my girlfriend when she hit my daughter?\"\n\nThe fact that he kicked her out over the house and not the kids is disgusting, he doesn't deserve children.",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 344,
      "content": "NTA and why are you still seeing her?\n\nShe treated your house and kids with no respect, contributed zero and generally seems a waste of space.\n\nYou’ve done the difficult thing and told her to go because of her behaviour, and she and her daughter are no longer your responsibility. She could have had a nice home and partner with a cute family, and she threw it all away. You were being used for a cheap place to live and as a walking bank account. She brought all her “hardship” on herself. \n\nWalk away and find someone who loves you, and your kids, and will appreciate the home you offer when that time comes - you (and he twins) have had a lucky escape from this lazy dirty mooch. No regrets are required on your part- you tried to do a good thing and had it thrown back in your face\n\nEdit - thanks for the Gold!",
      "id": 209,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 316,
      "content": "NTA for now.\n\nYo wtf. How are you still in a relationship with them?",
      "id": 210,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 314,
      "content": "Dude.\n\nI went through your post history.\n\nThis is the GF who smacked your daughter?\n\nWHY ARE YOU STILL SEEING EACH OTHER AND WHY ARE YOU FEELING BAD?!?\n\nThe amount of posts you've made about the same woman seriously makes me concerned that you have some symptoms of the typical abuse victim. \n\nESH. Stop seeing this woman. Period. I know at times when you're in a relationship with your abuser, it's hard to leave them and hard to see how unhealthy it is... But you've got two kids that are affected by your life choices and YOU REALLY OUGHT TO PROTECT THEM FIRST.",
      "id": 211,
      "comments": [
        {
          "score": 69,
          "content": "100% u/Writing316 you are being abused, your children are being abused, and you are a victim of abuse. \n\nBe honest about her gas lighting you (\"she's telling me it's my fault\" - verbally abusive behavior. Phsyically she was abusing your kids?!?! GTFO. \n\nSTICK TO YOUR EDITS. \n\nDO NOT LET HER IN YOUR LIFE. Be done. \n\nYou can get a tinder and bang others, 30's is still young. you'll be fine without her, but think of your kids and how much better off they are without this monster of a woman.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah. I know there's not as many resources for guys who are being or have been abused, but this situation looks full of red flags. OP, do some research into what abuse looks like and see if it fits, OK? A lot of people have this idea that abuse = hitting, it's actually way more complicated than that. Even given that you've said you've broken up with her, sometimes if you don't know what to look out for you could end up in the exact same situation with someone else. Learn what the signs are so that you don't subject you and your kids to this sort of thing again. You and they deserve better.  \n\n\nAlso look up what \"gaslighting\" means if you don't know already. Cuz it sounds like she's been doing a lot of that to you.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}