{
  "post content": "My wife didn't like her job. I was telling her to look for a job while she was still in her current company. She wanted to take a break from work but we cannot afford it right now due to our accidental conception. She's 3 months pregnant. \n\nSo I made her a resume and applied her for a few interviews. However, she didn't attend any of them saying she doesn't feel like it. She said she wants to be a SAHM. I told her we weren't even planning this pregnancy and now we cannot afford for her to become unemployed as well. \nShe didn't listen and just quit her job without consulting with me. I was super mad at her. I told her I don't want to bust my ass while she relaxes at home. She cried and said that she doesn't want to work anymore. So I told her I'd be quitting my job as well and then we can both stay jobless and homeless with our child. \n\nI pretended to quit the job in front of her by sending an angry mail to \"my boss\" but instead sent it to my friend. \nShe was shocked and asked me why I'd do such a thing. I told her tough luck and went to sleep. The next morning onwards, she got ready for an interview and started attending interviews. I called my work and took a break of 1 week. \n\nToday, my wife got a job and she gave me the news at night while we were having dinner. I then told her the truth about my not quitting the job and about it being a way to make her go back to work. \n\nShe got mad at me and told me I was very petty and I should've just sucked it up and let her stay at home. Now she's not talking to me. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 26284,
      "content": "Honestly, ESH.  Sounds like children having children to me.",
      "id": 2,
      "comments": [
        {
          "score": 6018,
          "content": "ESH, you should have been upfront and genuine with her, you tricked her and deceived her. On the other hand, you don't have to agree for her unemployment. You don't need to be the sole breadwinner and sustain the whole family while she is at home. Your financial position doesn't allow it. Your lack of willingness to follow through with her wishes is quite understandable. \n\nBoth of you went behind each other's back and lacked communication. Both of you are at fault here.",
          "id": 3,
          "comments": [
            {
              "score": 3986,
              "content": "All I can say is this sounds like a deeply unhealthy relationship and I hope for your child's sake that you either seek couples' counseling or divorce.",
              "id": 4,
              "comments": [
                {
                  "score": 1259,
                  "content": "I have a feeling this “unplanned” pregnancy was only on OP side",
                  "id": 5,
                  "comments": [
                    {
                      "score": 393,
                      "content": "What's that feeling based on, if I may ask?",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "There's research data showing that in some countries around half of pregnancies are unplanned, so your conclusion is probably hasty.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Thinking maybe she intentionally \"planned\" this by poking holes or stop taking birth control to stop working?",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "OP is the man who wrote the post, right? So did you mean that the unplanned pregnancy was on the OP's wife's side instead?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Ah, the good ol' Baby Trap.\nDon't do that, people.\nthat's a bad thing to do.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "You do know that overall it takes 2 people to get pregnant… and abortions are becoming less of an option depending on where people live. \n\nAnd “get to stay home” is hilarious. Being a stay at home parent is in no way a relaxed/ relaxing situation.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I agree and expect she’ll “need” bed rest but only during working hours soon.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I was 100% thinking the same thing.  She got pregs on purpose thinking being a SAHM means actually getting to “relax at home”.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 947,
              "content": ">you should have been upfront and genuine with her, you tricked her and deceived her\n\nYou mean, like, telling her that they can't afford for her to be a SAHM, that the unplanned pregnancy is adding financial strain and they absolutely cannot afford for her to be unemployed with a baby on the way? I wonder what would've happened if he'd only been upfront about it... It's not like she'd have cried and thrown a fit about how she doesn't want to work, that'd be ridiculous. Guess we'll never know...",
              "id": 14,
              "comments": [
                {
                  "score": 421,
                  "content": "Yup. He was upfront with her and she ignored him.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yeah she did. I’m not sure if this was the right thing to do. But he already tried to do it the right way and it failed.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 269,
                  "content": "Thank you! I'm not sure how much more clear he could have been. And what do people expect him to do if she flat out refuses after he told her he didn't want her to quit?\n\nPeople want to call him childish, but I don't see where anyone has a better idea. I thought what he did was smart and effective.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Agreed. His only other option really would be to leave her if she is going to purposely sink their ship but then people would say he was the asshole for that too.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Their problem isn't that she quit her job after his logical reasons not to, nor is it him pretending to quit his job and 'deceiving' her. \n\nTheir problem is they are not on the same page when it comes to financial planning or family planning, they don't listen to each other, and they are not working as a team.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I was actually trying to think of something he could have done instead, and couldn’t think of anything.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 109,
                  "content": "I think lying to your wife and pretending to quit your job is low.  Very low.\n\nThat said, this wife, if she's an adult who can do math, has to know that they need her salary.  She just wants her way, and thinks it's HIS job to figure out the money.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 247,
                      "content": "Sorry, he tried the mature way, she acted like a baby, so he stooped to her level and it worked.  I really don't know see how his lie is low.  To me to achieved exactly what was *needed.*  After all, this is not a want, but money to support their child, it's a requirement.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "He tried everything else. Sometimes people need a jolt to reality and he did it for her.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "What’s also low is quitting your job for real and wanted to be a stay home mom when you know damn well you can’t afford it because you’re lazy",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "So he should have done what she did and actually quit?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Agree.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 373,
              "content": "He WAS upfront with her. She didn’t care and told him to suck it up and quit anyways.",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 294,
              "content": "\"Communication\" really is the magic buzzword of this sub. I can't grasp how you could perceive this as a communication failure. He communicated quite clearly that they could not afford for her to quit her job and she completely disregarded him and did it anyway. She calculated that he would have no choice but to take all the pressure for their survival onto himself and just figure it out, and she didn't care about doing that to him and her family. He flipped the script on her. It was shitty, but it worked and I really don't see what choice she left him.",
              "id": 28,
              "comments": [
                {
                  "score": 27,
                  "content": "I see clearly the choice of a divorce here after communication fails, not planning and executing a deception.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 28,
                      "content": "So divorce her and let her get half his shit, potentially a percentage of his check for alimony, and definitely a percentage of his check for child support, on top of having lower priority when it comes to custody with the mother getting primary custody more than likely. He did all that and now that she's getting 2 checks a month from him, she **definitely** doesn't have to work. Sounds like a great backup plan.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Wow reddit really jumps to divorce really quick. Can't get your spouse to agree on ONE thing? Welp! You are not suitable for each other, get a divorce 😅",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "How would divorce fix it? She can just live off his child support.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "They don't have money and your solution is legal fees + alimony + child support not to mental all the prenatal and labour expenses? Bruh",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I was thinking that but if she doesn't want to work what if she tries to get him for all he has? Just gets payed a bunch of alimony (maybe) and child support.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This. Yes op did something manipulative and extreme but she was no angel here. She is intentionally shifting all financial responsibility onto him..",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "But he was upfront about it and she pretty much told him with quitting her job anyway and not going to those interviews  that she didn’t care",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 173,
              "content": "\"you should have been upfront and genuine with her, you tricked her and deceived her\"\n\nThis is ridiculous. It's like no one reads the post. He TOLD her she needed to get a job and he didn't want to work while she stayed at home. She quit anyway and refused to look for another job. How much more \"upfront and genuine\" could he possibly be??",
              "id": 37,
              "comments": [
                {
                  "score": 30,
                  "content": "Right! He even helped her find a new job cause he understood she wasn't happy with the old one. I get that Pregnancy can be hard on a woman's body but if you cannot afford it, then you HAVE to make compromises.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 154,
              "content": "OP was quite upfront with his wife. What else was he supposed to do?",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "Thats a negative there ghost rider. He told her upfront they couldn't afford that and she basically said fuck you and quit anyways. She only chose to act like an adult when the situation demanded it and only got mad because she proved that there is no reason for her to stay home.",
              "id": 40,
              "comments": [
                {
                  "score": 3,
                  "content": ">Thats a negative there ghost rider.\n\nAye Captain!\n\nNote: sorry friend at work says that and we all call him Captain",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "Even if their finances did allow it, her being a SAHM should be a decision that they make together and mutually agree with. Communication is key in relationships, and in this situation it sounds like neither of them was communicating like an adult.",
              "id": 42,
              "comments": [
                {
                  "score": 64,
                  "content": "I feel like communication isn't the problem. They both got each other's messages loud and clear. The problem is she didn't respect his reasonable answer. She doesn't respect him enough to talk about her plans before she does them. This little stunt she pulled is taking the financial responsibility of not just herself but the upcoming baby and hurling it in op's lap without a second thought or care. She doesn't respect his feelings in the matter. She doesn't respect his right of choice in it. She doesn't respect the expectations op had when they got into the respect and the work op puts into it. God it's horrendously disrespectful. I don't like working either but I gotta eat and I'd like a place to sleep. Let me just con my man into working for me.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "He's been upfront with her before trying this. Ms. Simply didn't care about his very reasonable opinion.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "Yeah tbh I see OPs concerns,ha thinking about their financial situation and that’s perfectly reasonable but doing some elaborate trick to manipulate the situation isn’t really a good move.His wife can quit her job,but she can’t expect OP to just accept that he now has to somehow fund her and the kid they didn’t plan to have",
          "id": 45,
          "comments": [
            {
              "score": 98,
              "content": "I will say though, what were the options? She wasn’t listening to ‘I won’t tolerate you being a SAHM’, so what’s left then?",
              "id": 46,
              "comments": [
                {
                  "score": 9,
                  "content": "Personally? \"If you want to quit your job and be a stay at home mom, it'll be as a single stay at home mom on welfare, because I want a partner, not a leech.\"",
                  "id": 47,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Oh yeah see unfortunately child support and divorce payments don't work like that.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Lol the spousal support/child support doesn’t think like that. OP is fucked every which way. Be careful who you knock up.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 133,
          "content": "No. She's the child. Unfortunately, sometimes the only thing a Child understands is a taste of their own medicine, and it worked.\n\nIf the genders were reversed, this would be trending hard on the front page with countless posts completely immaculating a useless Man who just doesn't want to work...\n\nNTA.",
          "id": 50,
          "comments": [
            {
              "score": 64,
              "content": "Mmm.... Based on the comments I think the deception would be derided no matter what gender was doing it. This is not a short term caper, this is a \" I'm taking a week off of my job in order to prove a point and pretend something to my spouse in order to get my point across\". If it takes that much, why are you in this relationship?",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Emasculating.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "All these people who think lying and tricking a spouse is a good idea 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
          "id": 53,
          "comments": [
            {
              "score": 91,
              "content": "Imagine totally disregarding your partner while you make a completely avoidable life choice.  The lying and tricking only came about as a result of a massive betrayal.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "ESH but I wouldn't have said anything, waited the week out and pretended to get my job back. If we are going this route that is.",
          "id": 55,
          "comments": [
            {
              "score": 5,
              "content": "That is what I was thinking.  He should never had told her what he had done.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "They'll fix the relationship....by having another baby.",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Agreed. Children don't need this kind of behaviour at their upbringing.\n\nDo the kid a favour and get an abortion, seriously.",
          "id": 58,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I agree but I wonder how accidental was that pregnancy.",
          "id": 59,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "THEY BOTH SCREAM TOXICITY",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "The poor kid being born and brought up in that household",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6161,
      "content": "ESH. You for how you handled the situation, and her for insisting on being a SAHM when it wasn't in the best interest for your family.",
      "id": 62,
      "comments": [
        {
          "score": 2443,
          "content": "Also, she's really pushing it on the SAHM bit when she's only 3 months pregnant.",
          "id": 63,
          "comments": [
            {
              "score": 1526,
              "content": "I also doubt the pregnancy was accidental on her end",
              "id": 64,
              "comments": [
                {
                  "score": 621,
                  "content": "This was my first thought 🚩",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 140,
                  "content": "Really? Getting pregnant also needs a rubber less dick inserted into a vagina and coming in it. Not easy to be accidental JUST ON HER END.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 84,
                      "content": "If you can't trust your female partner when they say they are on hormonal birth control or similar, then why would you have sex with them, or be together at all. \n\nThe pill, implant, IUD and others are pretty much 99% effective if used correctly. Many couples rely on 1 of these methods alone. And it's not unreasonable to do so unless you are 100% childfree.\n\nSo unless they used the pull out method. It can absolutly be an accident on her part.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "She could have said that she was on pills",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Rubbers break, dude. Or she could have sabotaged it somehow, or been lying about being on birth control.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Or maybe holes were poked in the rubber we don’t know their sex lives",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "You can still get pregnant even if there’s a condom. Those can and do fail. Especially if someone were to mess with them (poke holes in them) or if they weren’t stored properly",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "This is assuming condoms are 100% effective. They are not. They’re 98% effective.\n\nEven when paired with the pill (which is 99% effective if used perfectly, therefore estimated to be 91% effective for the average user) there is still a chance for conception.\n\nIdk how some ppl don’t know this, they should teach it in sex ed.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Not if she intentionally poked holes in the condoms.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Pregnancy trapping os really not always the answer. Most likely she saw the baby as an out to her job. I would ask her why she wants to be at home so Badly. Last time I saw something like that personally, turns out the person wanting to not work as depressed with suciadal tendencies",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Oh bullshit lol ya know what prevents pregnancy? Don’t have sex .. if he does he is accepting a risk of pregnancy. The first few months make many sick as fuck , tired constantly and it hurts frankly so I don’t blame her for wanting to be home ... I guess he will have to deal with it if she is put on bed rest .",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 357,
              "content": "True, but what pregnancy hormones do to your head are unreal. She may be feeling sick. I spent a month 2 to 7 of my first pregnancy, vomiting.",
              "id": 76,
              "comments": [
                {
                  "score": 408,
                  "content": "As harsh and difficult as that is to go through for every pregnant woman, it’s no excuse to act like an asshole and quit your job on the spot without consulting your partner and just expecting them to pick up the slack. \n\nAnd just in case you come back and say you weren’t excusing it, this was 100% an excuse.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 151,
                      "content": ">As harsh and difficult as that is to go through for every pregnant woman, it’s no excuse to act like an asshole and quit your job on the spot without consulting your partner and just expecting them to pick up the slack.\n\nyeah, hormones, mental illness, stress, lack of sleep.  lots of things that might explain behavior.  but they are never excuses to be an outright asshole to someone.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Pregnant with my first child, I could either cook or eat because I would become so nauseous from the smell of cooking that I could not eat. I still worked as a care taker cooking every day  through 5 months of nausea because I am an adult who understand that children takes money to feed and dress.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 131,
                  "content": "That’s awful but what does that have to do with being a SAHM? If they can’t afford it they can’t afford it.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 109,
                      "content": "[deleted]",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 66,
                  "content": "Honestly the pandemic has been such a mess I’ve had a lot of wouldn’t it be nice to just run away from working for a while fantasies lately.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Fantasies are different than actually doing it though. I have a feeling the pregnancy wasn't unplanned on her end.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I'm solidly in my second trimester and the nausea, vomiting, headaches, exhaustion have NOT let up. I'm miserable. But I work as a night ER nurse at a hospital that requires I work mandatory overtime. I'm going to work up until the day I go into labor. I technically have the ability the quit, and I have taking several months off after the baby is here. But I'm not quitting yet because I don't want my husband to have extra stress. He's helped me out by taking on the majority of the household chores so I can rest more. We're a team.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Yes but in 6 months she will be a SAHW since I’m assuming it’ll be cheaper to stay at home than pay for $$ daycare.",
              "id": 85,
              "comments": [
                {
                  "score": 28,
                  "content": "If they can find a daycare with an infant spot available. Those are harder to find right now than toilet paper was in April 2020",
                  "id": 86,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Some daycares have such long waitlists for infant care you would have to put your name down before you even conceive",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I'm 3 months pregnant right now and I can tell you that 24/7 I am feeling sick and miserable.  I can't eat I can't sleep. I'm constipated all the time it sucks. We are both very happy about baby. But that doesn't take away from the fact that I'm  sick constantly.",
              "id": 88,
              "comments": [
                {
                  "score": 2,
                  "content": "We can only go off of what OP said which is that she wants to stop working without any particular reason given. Most women feel like shit while pregnant, we don't quit our jobs, that we can't afford to because of it though.",
                  "id": 89,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "On the one hand, yes\n\nOn the other hand, pregnancy does a number on you. Even at three months you're already constantly tired and most women are also dealing with morning sickness and tons of other symptoms. Growing a baby fucking sucks, in my experience",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "He also used an entire week of vacation that he should’ve saved to use when she gives birth.",
          "id": 91,
          "comments": [
            {
              "score": 145,
              "content": "It's effectively November, if his vacation rolls with the new year it won't matter.",
              "id": 92,
              "comments": [
                {
                  "score": 36,
                  "content": "Yep, even with a medical emergency last year that used all my previously banked days to cover, I just had to take a week \"because\" to ensure I'll be under my carry over limit at the end of the year.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "That’s pretty crazy too! My partner and I spend all year coordinating our holiday so we take time off to go places together or do things at home. Granted it’s more complicated for us because his runs calendar year Jan-Dec and mine runs financial year Apr-Mar, but one of us would never take an entire week without the other! Their relationship seems like an absolute train wreck!",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "Same! It’s just crazy to me that he used an entire week of vacation to spite her.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "[deleted]",
          "id": 96,
          "comments": [
            {
              "score": 86,
              "content": "I’m not sure what the solution is because I disagree strongly with the wife, but this feels super manipulative and childish to me. I know if my partner did this, I would suggest therapy and leave if it came down to it. Being a stay at home parent is something both parties need to agree to imo. I want to be a SAHM and my partner knows it, but I would never go about it this way. I don’t know if pregnancy hormones are having an impact on her behaviour, but this whole interaction just feels unhealthy to me.",
              "id": 97,
              "comments": [
                {
                  "score": 129,
                  "content": "Go ahead and leave, after that temper tantrum where you quit your job because you don't want to work and now you're single with a newborn. What's that going to get you?  He was real clear and she basically threw him the middle finger. He was petty but he knows his wife, apparently. We don't.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Yeah what did was by definition manipulative and pretty shitty, but.. it got the result that is best for the child, and its not like OP could force her to work. If its ESH then she sucks way more.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "If you cannot find a better solution, even with the benefit of being completely divorced from the situation and being able to think about it rationally... I don't think you can fault him for his.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "Honestly, just leaving is preferable, though he will probably have to pay child support. \"I can't afford to take care of us. If you aren't willing to have a job this isn't going to work out\" It's not good for either of them to be in a relationship that's so uncooperative and manipulative.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 88,
          "content": "The real answer. Sounds like these two deserve each other",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I’d like to be a SAHM too.  My son is in his early 20’s but….. apparently it’s ok to demand it.",
          "id": 103,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "What does ESH stand for",
          "id": 104,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "And for deciding unilaterally she'd be kept woman.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5090,
      "content": "ESH - You two should not be bringing a child into this world. You don't even respect each other. The lies, the manipulation, the deception, the selfishness... you are not good partners to each other, and you will not be good parents together.",
      "id": 106,
      "comments": [
        {
          "score": 677,
          "content": "Yes, you are so absorbed in your petty lies and manipulation to get what you want. You need couples counseling.",
          "id": 107,
          "comments": [
            {
              "score": 152,
              "content": "They better get it soon cause in 6 months…",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Never heard of a successful marriage based on games and lies. Poor kids.",
          "id": 109,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "The only mature human in that household is the still-percolating fetus.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "yeah, they should just have an abortion and go separate ways.",
          "id": 111,
          "comments": [
            {
              "score": 8,
              "content": "If they're in texas its way too late",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "They’ve got about 6 months to get their shit together before all hell breaks loose. Good luck, OP. You’re gonna need it.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2252,
      "content": "ESH. I feel really sorry for this kid because they're gonna be raised by two other kids.",
      "id": 114,
      "comments": [
        {
          "score": 277,
          "content": "Wait til they find out how much they *really* can’t afford the therapy their poor kid will need.",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I know kids with better communication skills than them.",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "ESH is the right response and  OP in your current state MZpljc is right it’s basically kids raising kids! \n\nYou need to sit down with your wife and talk to her about why she wants to be a SAHM. Look at your wages make a budget together factoring in nappies and formula (even if you plan to breast feed take it from a mum it can be hard and having a budget that supports formula will support your family of not for an emergency feeding plan then extra money to save). \n\nMaybe instead of being 100% SAHM she could move into a job that requires less of her time or is less stressful. A job that can be left at work so she doesn’t need to think about it.\n\nAlso factor in the cost of day care into your budget. How much does your wife earn a day as in my area day care for a child Uber 2 is $150 a day! \n\nIf your wife is working then you will need to sort out a schedule that supports both parties to contribute to the house and the child equally! This means you will both need to do chores, you will both need to wake up at night to feed/change baby, you will both need to cook. \n\nIt could be worth it at least in the short term for your wife to be a SAHM if that’s what she wants. \n\nBut the only way you can both know that for sure is stop acting like lying and sneaky children and talk to each other, lay your current and future expectations on the table and make plans for the different scenarios to see what fits the family most.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1510,
      "content": "Yikes.  \n\nESH.  \n\nYou should have talked about this before getting married.  If SAHM is a job, its not just relaxing.  But if that is a hard limit you should have worked that out before and gloved up.  \n\nPretending to quit to make a point is very petty.  Stress is bad for pregnancy, going jobless to stress her out is definitely AH territory.  Y'all need counseling.",
      "id": 118,
      "comments": [
        {
          "score": 368,
          "content": "She wasn't stressed when she quit her job clearly since she must've expected me to work overtime to make up for her slack. She only got stressed when she realized that her plan of staying at home was foiled",
          "id": 119,
          "comments": [
            {
              "score": 1135,
              "content": "If you have this much disdain for your wife, why are you married?",
              "id": 120,
              "comments": [
                {
                  "score": 464,
                  "content": "It's not disdain it's frustration at not having money, her not wanting to contribute to the family etc. She will not be able to dii household chores either since she's pregnant, and I cannot be the breadwinner as well as do all the housework. We're not rich.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 1084,
                      "content": "Pregnant people can still do chores",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 230,
                      "content": "When I read you writing that you foiled her scheme, I sense disdain. \n\nHonestly, it sounds like you two have a very short time to figure out whether your differences on very important issues are reconcilable.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 123,
                      "content": "So im currently breastfeeding my infant who is currently recovering from a tongue and lip tie procedure, before that it was jaundice. Im currently on maternity leave. However I can safely say being a mother isn’t “relaxing at home”. It’s feeding and changing your baby. Recovering while also nourishing. It’s playing the game of “do i get a nap myself or take a shower after not having one for three days”. It’s worrying about them but trying to not go insane. It’s waking up every 2-3 hours to feed your child. It’s also keeping up on the house, specifically laundry and cooking. Cleaning when you can. Eating meals separately because the baby woke up and needs one of you.\n\nYou clearly have no idea what your about to get into and I pray for that child…and im not even religious. But yeah being a stay at home parent isn’t a vacation from chores and responsibility. Good luck. Also got look into how much child care is gonna cost, is the cost of her working even gonna bring much in once you account for that?",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": "Uh…as a 34w pregnant lady, I am definitely still doing the majority of chores lol…on my list of things to do today is cleaning the toilet, the kitchen, the never-ending laundry, and maybe clean and rearrange the fridge if I get to it. I can’t always do them in one go because I get tired easily, so I take breaks, and I can’t lift anything too heavy, but we’re pregnant, not suddenly made of glass.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 41,
                      "content": "Bro your wife is using you at every chance. Unless she’s on medical bed rest, there is not much she can’t do at 3mo. And she unilaterally made a decision that impacted household finances long term. Honestly I get your disdain and it’s rightly placed. You just went about it wrong. \n\nYou should have told her work or bust instead of lying to her.",
                      "id": 126,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Lol she can still do chores. But so should you.. What is this kindergardened behaviour? SHARE EXPENSES, CHORES, RESPONSIBILITIES. And I very much hope when she is depressed out of her mind after giving birth having a job she hates and a husband who b*tches about doing chores, you will finally get up from your butt and help with the kid you BOTH needed to be there for it to happen. Your peepee was very much needed in the situation abd now you are blaming your wife and mabipulating her to do things.\n\nI would sooner trust me dog with that poor baby. At least she cares.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I need to give you a dose of some very real reality here my friend. Something you both have not taken into consideration, yes you can be the breadwinner and do chores. I do it every fuckin day, however, for this scenario what will you do if she gets put on bed rest during this pregnancy? That will leave you with being the sole income and doing all the household chores. What will you do then? I was put on bed rest at 3 months until I delivered, with strict instructions to not get up for more than 5 mins at a time or risk a miscarriage. We went from a household that could barely make it on two incomes to me being sent from my doctors appointment straight to the hospital and then bed rest. Single income with a high risk pregnancy. I had to quit my job that day because I couldn’t return and I couldn’t get up to do chores either. My child was in the NICU for awhile and I couldn’t work then either. Also she will need time to heal after the delivery and more so if there are complications. Get your shit together, a baby is coming and it can have complications. So ya’ll need to make “what if” plans and stop being children.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I moved house *twice* while I was pregnant and I did most of the packing, lifting and unpacking since my husband was working. The only time it was rough to do housework was when I had morning sickness. Unless she has a high risk pregnancy she will absolutely be able to do housework. Also, being a SAHM isn’t just ‘relaxing’ as you seem to thing. It’s 24/7 looking after another little human who can’t do anything for themselves. Sometimes that means missing meals and not taking a shower. It’s hard. \n\nTo be honest ESH. You both should have discussed this before bringing a child into the world.",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 80,
                  "content": "If you can’t afford it you can’t afford it. It’s not disdain.",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "Here’s a typical Reddit comment. It’s not disdain for the wife but for her actions.",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "OP denies it, but this comment alone is dripping in it. It sounds more like how people talk about a co-worker they tolerate rather than a partner they love.",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Are you positive she didn't get pregnant on purpose?",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 94,
          "content": "[deleted]",
          "id": 134,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 702,
      "content": "ESH. Your wife for quitting without discussing the finances. And you for applying to jobs for her without her permission and fake quitting your job. Use protection next time, if you didn’t already. \n\nY’all need to have some serious conversations before you bring a child into this world...",
      "id": 135,
      "comments": [
        {
          "score": 368,
          "content": "We did use protection. She was on pills I used rubber. I applied to jobs because she said it was hard. I wanted her to go to work",
          "id": 136,
          "comments": [
            {
              "score": 691,
              "content": "Not gonna lie…doesn’t sound like an accident since she wanted to stay home….",
              "id": 137,
              "comments": [
                {
                  "score": 169,
                  "content": "My third child was conceived while I was on the pill, and my husband used condoms.  I had just gotten through colic with the second kid (which I refer to as \"Those months I didn't sleep\". \nThe LAST thing in the entire universe I wanted was another baby, but surprise! \nIt happens.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "reddit brain moment",
                  "id": 139,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "There are a numbers of ways that the pill fails, stomach bugs, use of e wrong medication alongside it. We don't know enough details assume she did ot on purpose.",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 383,
              "content": "Are you *sure* she was on the pill? Failure rate for both pill and condoms together is astronomically low.",
              "id": 141,
              "comments": [
                {
                  "score": 440,
                  "content": "Well, she did want kids so maybe she didn't take a pill just for the pregnancy to happen. However, I don't hate the baby, I hate our situation and I don't like the fact that she doesn't want to make the situation better with me. Neither of us wants to abort the baby so earning together is the only way out",
                  "id": 142,
                  "comments": [
                    {
                      "score": 376,
                      "content": "I think her plan was to use the pregnancy to be a SAHM. Maybe she is burned out or depressed, she should have talked about it to you before just taking the jump.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "Or maybe the pill is not 100% effective, or maybe there are a number of other medications that can render the pill useless or maybe you up yeh effectiveness of the pill by always using a condom. Eons ago the pill I was on had a bad batch hit the market and a LOT of women were thrilled to get their period because a LOT of women ended up pregnant",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I love how you casually drop that she may have trapped you into an actual pregnancy, gotta cover all the bases right? Since people arent agreeing youre NTA?",
                      "id": 145,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Were you the one to purchase the condom? Did she have a chance to tamper with them? Do you still have some lying around that you could try out if they hold liquid?\nI wouldn't give a verdict until you know for certain that she didn't force you into the situation you are currently in and suffering for. Choosing to have children should be a decision between a couple, made with utmost preparation, I'm not saying accidents and surprises can't sour the plan, but it's still better than having none and doing a trustfall. \nWhat you wanted to achieve is logical, if you can't keep up only the two of you with one salary, it wont hold a baby any better. \nThe sad part is, sooner or later your relationship is highly likely to suffer. Either because you will try to juggle childcare at the expense of time spent together, or having trust issues regarding both of your honesty. I hope you have some support nearby tho, grandparents or aunts/uncles. \nStill if you are happy for the baby itself, and you can think reasonably and responsibly still, you will be a good father. I wish you the best",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Your probably sneaky wife vs poor saintly you just trying to do the right thing? Nah, not buying it.",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "Are you certain this baby was actually accidental? Not saying it doesn't happen but with both of those forms it's unlikely.",
              "id": 148,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "She was on pills, you used condom and she still got pregnant... Huuu. \n\nhum OP. Are you sure she was on the pills ? Are you sure she didn't stop the pills in secret, that the pregnancy wasn't on purpose so she would have an excuse to be a SAHW ?",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "You know, I didn't fully trust that you were telling the whole truth in your post. Now I know you're lieing.\n\nAnd you reek of narcisism.",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 533,
      "content": "Weeping for the next generation about to be born into this dysfunctional ass relationship.",
      "id": 151,
      "comments": [
        {
          "score": 194,
          "content": "Ass relationships don’t result in pregnancy.",
          "id": 152,
          "comments": [
            {
              "score": 8,
              "content": "😂 you right",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "But then… how did the wife get pregnant?",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I just spit out my coffee 😂😂 Take my poor person's reddit gold and upvote 🏆🏅🥇",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 429,
      "content": "[deleted]",
      "id": 156,
      "comments": [
        {
          "score": 105,
          "content": "Yeah, it's deeply upsetting when you can see the disfunction in the child's life starting to manifest so long before the poor thing is out of the womb.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "This. ESH",
          "id": 158,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 379,
      "content": "ESH and this marriage does not seem destined to last much longer. You can’t even talk about the most basic things. I really hope you see a counselor together and at least try to figure out how to be decent co-parents because I promise you this only gets harder after a child enters the picture.",
      "id": 159,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 304,
      "content": "**NTA.** You spoke about it and let her know that it's not an option right now and and then she just quit. How were you two supposed to make ends meet? I would love to be a SAHW (kids are grown) but with the current economy, I can't. Babies have needs and most of those needs require money.  Now your wife we be at the mercy of her new company as far as FMLA because that doesn't kick in until you have been with your current employer for 12 months and 1,250 hours, so her job won't be protected when she has to leave for birth.",
      "id": 160,
      "comments": [
        {
          "score": 213,
          "content": "Finally a NTA. I am reading all these ESH and I am thinking beyond leaving her and separating from her what else could he do? I think, however, she will quit again. They need counseling and I have doubts this relationship will last",
          "id": 161,
          "comments": [
            {
              "score": 98,
              "content": "Better to leave then to play games and engage in toxic behavior. Sometimes you're better off alone.",
              "id": 162,
              "comments": [
                {
                  "score": 33,
                  "content": "and pay alimony plus child support",
                  "id": 163,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Alimony is unlikely unless they've been together a long time with a significant pay gap. & Nothing is stopping him from being the custodial parent.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "He'll be paying for them if he stays, yeah?",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "They were both working and it doesn't sound like he makes significantly more than she does. Alimony might not even be a factor",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "He'll leave her or separate from her and she'll just file for child support and she gets to be a SAHM anyway.\n\nMy sister has a client who has 3 kids from 3 different fathers. She basically made it her source of income by only going after rich men. Really fucked up.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "All the ESH are basicallly the reddit antinatalist crowd criticizing OP for having a kid he did not even choose to have.",
              "id": 168,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "I know, the way the OP handled the situation may not have been ideal but his wife was being stubborn and refusing to interview for other jobs. What exactly was he meant to do? He obviously knows they can’t afford to have her as a SAHM more than folk on Reddit do (unless some of these people intend to help pay their bills).",
          "id": 169,
          "comments": [
            {
              "score": 141,
              "content": "Right? everyone wants to fall all over themselves to excuse any idiotic behavior a pregnant woman can come up with, and pretend that he just needs to talk to her (he did) go to counseling (they can't afford it) and get a better job (right off the job tree, where the jobs grow).  \n\nAnd most of the E-S-H comments seem to come back to \"your communication skills are bad\". Like, ok how many times can you sit someone down, show them the budget, and explain why this won't work at all, before it becomes clear that you can't communicate facts to someone that doesn't want to hear them? how do you communicate more clearly than stating facts and pointing out your respective roles in the successful management of the household? she doesn't *want* to work anymore, and just wants OP to \"figure it out\". She at least understands that someone has to work, and only found herself a job when OP forced her hand.",
              "id": 170,
              "comments": [
                {
                  "score": 53,
                  "content": "I couldn't agree more it has nothing to do with communication. Op's wife is deadass disrespectful. She decided she didn't want to work. Not that she was feeling tired. Not that her health was in decline. Not that she wanted time with her baby. Op states she said she doesn't WANT to work. Shit, I'd love to just TELL my partner he's on his own and kick back but that's not how adulting works. She didn't give two shit about how he felt about her selfish decision until he threw it back in her face.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I was more amazed that he actually set her up for interviews and she just didn’t go. Like wtf man.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "I know right? She sure got off her butt quick once HE quit, proving she could've done it all along. She just didn't want to. She wanted to use her pregnancy to quit and be lazy and rely on him working alone.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Agree with this. NTA",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Alright I have to admit I think they’re both AHs for reasons that 100s of comments have already pointed out. But OP is the justified AH in the sense that he tried to be logical and showed his wife all the proper reasoning of why she couldn’t quit her job and she just didn’t listen. Sometimes you need to act extremely to make progress. Justified AH which makes me say NTA.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Seriously all the ESH ppl are brain dead. Literally the only options OP had were abandoning his pregnant wife entirely by leaving or this.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}