{
  "post content": "Not the best title but I will explain.\n\nI (F26) am 10 years younger than my boyfriend of 6 years and we’ve been rocking this relationship up until recently. \n\nI am about to start a career in law and it’s been a very uphill battle to get here, my boyfriend has an established career in a completely different sector and now he’s inspired by me and wants to start again so he can have a legal career. I think it’s great, follow your goals and live your dream however, this means as I’m working my way up and establishing myself he’s going to be a duckling and starting from the very beginning.\n\nIn the past we’ve discussed kids and I love children but I honestly don’t mind either way if I do or do not have kids (sounds horrible but that’s the only way I can describe it). He on the other hand really wants kids, so we jointly decided that if we have a child he can use the maternity leave to be the stay at home dad. This is mostly because his job is stable, he is very respected and very established in his line of work so taking 6 months to a year out won’t effect him at all and he wants to take that time out for a kid and I do not. If I had to take 6 months out it could ruin my career. \n\nNow he wants to start again with his career, would I be the a-hole If I said “if you choose this route I don’t feel like we can have children” or something along those lines. I don’t like the idea of stepping on someone’s dreams and I personally would hate it if someone told me ‘no’ but the again I don’t want to be in the position where I have to sacrifice my career because plans have changed. \n\nAm I an a-hole for even considering this and would I be the a-hole for actually saying this?",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "NAH. You should absolutely have that discussion with him. Having a kid is a huge thing, especially when one person is puting their life on hold to be the stay at home parent. If he is starting a completely different career path, he may or may not be allowed to take tons of time off to stay at home with the child.\n\nAlso, no it does not sound horrible that you wouldn't mind having a child or not having one. That's a personal choice and you shouldn't be ridiculed for whatever choice you make. \n\nGood luck! Hopefully an update follows.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Also how I feel. NAH",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA\n\nYou need to be up front with your partner about the impact or the career change will have. So that they can make an informed decision. \n\nIf you feel this way and don't say anything now, when the topic comes up later it'll be worse especially when they find out you felt this way and didn't say anything.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NAH.  You would be the asshole if you put it in such absolute terms, but absolutely not the asshole for wanting to have a serious discussion about the issue before either of you goes any deeper into the legal profession. This includes the question of who takes leave, when is the right time for children (or is there one?), what kind of jobs will we need to have to get decent benefits for our family, what kind of legal workplaces will be more flexible for young parents and/or family health crises, and so on.  It might even be worth a couple's counseling session or two - preventative counseling BEFORE a major problem arises is not recommended enough.\n\nOne lawyer to another, it's difficult to exaggerate just how demanding a career in law is, whether in a traditional law firm, a nonprofit, or a government office (I've done all three - well, the government was an internship).  I'll never forget a warning I got as a pre-law file clerk from a lawyer with a young family, \"Don't go into litigation if you want to have children.\"  Her oldest was four and her second was two and she was leaving law altogether after five years.\n\n(As an aside, from a lawyer of almost 14 years - has your BF ever worked/volunteered/interned in a legal practice before?  If not, I beseech him to do so - nonprofits are always looking for professional volunteers and even for-profits are happy to get a little free labor in. Let him experience what life in law looks like from day to day BEFORE he commits to the time, expense, and agony of getting a law degree and entering the profession. I say this to EVERYONE considering law school.  Are there any undergraduate prelaw classes he could take taught by actual law professors?  That's a good taster of what law school is like.)",
      "id": 5,
      "comments": [
        {
          "score": 3,
          "content": "Have been practicing 8 years, largely agree here. Law school and job can be done, but it's *hard*. Trying to restart a new life track into a demanding field AND trying to have kids is another layer of difficulty. There are (depending on your local area) legal employments that are reasonably child-friendly (particularly in state government and some niche areas) but they often don't pay enough to comfortably pay off student loans quickly. Make a plan, expect problems to pop up, but make sure everyone is aware of the cost involved!",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA but I would have a serious discussion with him about this. He is the one who wants kids, so he is the one who needs to decide what is more important to him, having his career or kids.\n\nYou're not wrong for not wanting to be a stay at home mom or anything, but make your expectations clear so there's no surprises down the road for him.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NAH at this point. He's not the AH for wanting to consider another path, but you're also not an AH for it changing how you feel about having kids with him. I wouldn't give him an ultimatum, but you should absolutely discuss it.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH just don't make it into an ultimatum",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA you dont have to have kids if you dont want to. And if you do you don’t have to have them right away. Wait until you become respected enough or get a higher position.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH, but choose your words though. Imagine the shoe was on the other foot.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "YTA. \n\nI don't see anywhere in this post that your BF would want *you* to stay home if he decided he wanted to up his career game. If he's planning on managing the childcare *and* his career, it's shitty to tell him he can't do that. \n\nStick to what ***you're*** willing and not willing to do. You're unwilling to make compromises in your career? You can be upfront and say that *you* won't sacrifice *your* career, and see where that leaves him. If he decides he's willing to do all the work because he wants the kids *and* the job *and* the killer partner, I don't see anything wrong with that (assuming, of course, one of the things you *are* willing to do is carry the baby).",
      "id": 12,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNot the best title but I will explain.\n\nI (F26) am 10 years younger than my boyfriend of 6 years and we’ve been rocking this relationship up until recently. \n\nI am about to start a career in law and it’s been a very uphill battle to get here, my boyfriend has an established career in a completely different sector and now he’s inspired by me and wants to start again so he can have a legal career. I think it’s great, follow your goals and live your dream however, this means as I’m working my way up and establishing myself he’s going to be a duckling and starting from the very beginning.\n\nIn the past we’ve discussed kids and I love children but I honestly don’t mind either way if I do or do not have kids (sounds horrible but that’s the only way I can describe it). He on the other hand really wants kids, so we jointly decided that if we have a child he can use the maternity leave to be the stay at home dad. This is mostly because his job is stable, he is very respected and very established in his line of work so taking 6 months to a year out won’t effect him at all and he wants to take that time out for a kid and I do not. If I had to take 6 months out it could ruin my career. \n\nNow he wants to start again with his career, would I be the a-hole If I said “if you choose this route I don’t feel like we can have children” or something along those lines. I don’t like the idea of stepping on someone’s dreams and I personally would hate it if someone told me ‘no’ but the again I don’t want to be in the position where I have to sacrifice my career because plans have changed. \n\nAm I an a-hole for even considering this and would I be the a-hole for actually saying this?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    }
  ]
}