{
  "post content": "for context, i (F18), have been working at this coffee shop for over two years now, i close 4 days a week with only me and one manager left to run the store from about 2pm to close. The other three days a kid (M16) closes with a different manager. This is about the only staff we have excluding the owner (who will never close), another kid (M19) who can only work day shifts do to collage, another kid (M18) also works days and does night classes, and a grown man who works in the back baking all morning and has another job in the after noon making him only available in the mornings. So they very clearly need me working there with them. \n\nI’ve been there for a while now and i really don’t mind the people, they can be a bit rude sometimes but i’m super shy and don’t talk much anyway so i stay out of everyone’s way and just get all my work done. Anytime i’ve worked with my manager she tells me about how i’m the best employee she’s worked with and she likes how i just get stuff done. \n\n\nFast forward to a week ago, i went inside of work on one of my off days to say hi order a coffee and get a sandwich, i am a vegetarian, i’ve struggled a lot with food and being able to eat enough for my whole life and i always had a hard time not getting grossed out when eating meat, so i stopped and my relationship with food got much better, so i ordered a grilled cheese and got my coffee and left. \n\n\nI was driving away and i went to take a bite, i take one swallow and it’s fine. When i went to take another i felt a super gross texture and i instantly spit out my food and pulled it apart, they put chicken in my sandwich,(they know my diet and what i normally order), i was so upset but thought it was a mistake so i took the loss on the 3$ sandwich felt a little gross and moved on.\n\nThe next day when i went into work, when i get there there is normally a shift change so i get to see my other coworkers as they leave. I was talking to a guy in the break room while getting ready to work and he was about to leave. I casually made a little joke about how i’m never coming to this place after after they got my order wrong (just trying to mock rude costumers) and i told him about my grilled cheese i ordered and how it came with meat. He laughed and told me that it was actually our manager that made me that and it wasn’t an accident, she wanted to “pull a prank” on me and make me try the chicken cause she said it’s delicious and she even gave it to me free of change anyway.\n\nAfter he told me what she said, i packed up all my stuff took my hat and apron off and told the manager what i heard, how i’m done, and how disrespectful that was to do. I’m still getting calls and texts telling me how rude it was to leave with no two weeks notice and how much this shows that i’m just petty and can’t take a joke. They are so short staffed now they close early and i know it’s affecting Business . \n\nSo am i the ass hole ?",
  "id": 1,
  "comments": [
    {
      "score": 6559,
      "content": "NTA.\n\nWhat she did is food tampering.  I believe that is against health regulations and can be a crime in some places.  I don't know the rules where you live.",
      "id": 2,
      "comments": [
        {
          "score": 826,
          "content": "I think for food tampering there has to be an intent to cause harm, but I do agree it's not okay.\n\nEdit: I may be wrong and if so please let me know that's just my understanding and I did google, but I think you're right that it varies per state\n\nSecond edit: I learned it doesn’t matter if there was intent to cause harm thanks all :) thanks for taking the time to explain to me!",
          "id": 3,
          "comments": [
            {
              "score": 1428,
              "content": "Wouldn’t giving a known vegetarian meat totally constitute “intention to cause harm” anyways? People who have never/rarely eat meat have problems digesting it.",
              "id": 4,
              "comments": [
                {
                  "score": 168,
                  "content": "Potentially, I wouldn't expect everyone to know that. There's a lot of plausible deniability fo the manager. I'm vegan and have met people (normally older) that don't know it would hurt if I ate meat.\n\nEdit: thank you for explaining that I was wrong!! I now know it doesn’t matter want the intentions were or if they knew it would cause harm.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 280,
                      "content": "Is plausible deniability really a valid legal defense? I feel like that could get out of hand quickly with defendants claiming to not know about basic laws.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "It doesnt seem to matter though. For all anyone knows, your vegan for health issues or medical. Feeding you such food could make you sick (dangerously or otherwise)  they knew op didnt eat meat , and 'because it delicious' added a food she knew op didnt eat. \n\nThat's similar equivalent (personal opinion) to giving a diabetic sugared candy knowing they only take sugar-free,  or giving a person gluten when they request gluten free. \n\nI'm lactose intolerant,  now that I can afford alternative food theres a HUGE differance in how I feel. If someone knowingly fed me dairy , even knowing itll make me sick, I'd totally drop them.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "\"plausible deniability\" goes out the window when you've purposely tampered with someone's food and given them something you're fully aware they did not want.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "You don't have to know that. you only have to know DON'T FUCKING TAMPER WITH PEOPLE'S FOOD.\n\nNever. It is absolutely NEVER okay to do that.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Not knowing isn’t okay in a food service environment. Mistakes are okay, but “pranks” with food are not. Speaking as someone who has not eaten meat in 16 years I will get severe diarrhea when I accidentally eat meat and believe me I will make that your problem if you did that to me on purpose 🤷🏽‍♀️ that’s a health risk for me my guy",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "my OH has an allergy to anything that comes from a mammal so any tampering with his food could have very dangerous consequences.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Doesn’t matter in Florida. A bride went to jail on her wedding day. She and the caterer thought it would be funny to marijuana in all the food. It was even in the lasagna. Three people got taken out in ambulances and even more got sick. She thought it would just loosen them up since no one gets sick from a little pot. She was charged with multiple felonies. She wasn’t a kid either, she was in her 40’s.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Potentially, I wouldn't expect everyone to know that. There's a lot of plausible deniability for the manager (edit: about meaning to cause harm not knowing the law but I learned either way it’s wrong). I'm vegan and have met people (normally older) that don't know it would hurt if I ate meat.\n\nEdit: thank you for explaining that I was wrong!! I now know it doesn’t matter want the intentions were or if they knew it would cause harm.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 102,
                  "content": "My 80 year old dad's been a veggie since he was 16 - no meat at all including fish. \n\nEverywhere they eat out he let's them know he's vegetarian, asks whether the dish he wants has meat in it and orders accordingly. \n\nHe can tell within 10 - 15 minutes of eating something whether it's had any meat in it because it starts shooting out of his bum and he feels really, really sick. \n\nMy best mate is allergic to onions.... he gets blinding migraines and again, when he eats out he makes sure they know he cannot have onions. He knows when they've just picked the onion out of his dish because within half an hour the oil slicks in his eyes start and within an hour, he's throwing up and he literally cannot see due to the pain. \n\nMy sister is highly allergic to fish and shellfish - she let's them know, she asks whether the hot chips have been fried in the same oil as the fish because she's allergic. Usually they're pretty good with the oil and/or what's cooked on the hot plate, the thing she has the biggest problem with is if a dish had fish sauce in it. After one mouthful she knows because her lips start tingling and her throat starts to constrict.\n\nSo yeah, if someone's specifically made it known that they can't have a particular product, whether you think they're \"faking\" or just being fussy, respect their fucking order because they ordered that for a reason.\n\nEdit: sis is a her not a he",
                  "id": 14,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Semi off topic-  we found out recently my friend also is allergic to onions! It was crazy, like who thinks of being allergic to onions?  We use it in all our cooking and the one dish he ate had 0 in it. Call it a hunch.  No problems whatsoever. Next time, added onions. \n\nHe knew we were modifying the recipe. Just not ingredients. 👏 sure enough onions.  We went through all the ingredients of the sauce.  (Spaghetti sauce for curious ones)   he knows now and avoids them like plague , says he actually feels much better ^__^ no gunky eyes and nose craziness. He also didnt realize just how much food has onions in it!",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "My son used to have a severe dairy allergy. people thought I meant lactose intolerant, but he would go into anaphylaxis if there was even a trace of milk protein.  He'd get hives if cheeto dust touched him.   A 'prank' like that would be fatal.   (He did grow out of it, and can have milk now, but is lactose intolerant.  Big difference).",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Just like some people put nut because they don't believe to allergies and try to \"prank\" them. They don't \"intend to harm people.\"",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Yes. Grandma has been veggie for over 30 years. Someone messed up with her order once, complete accident and they were extremely apologetic and comped everything, as after eating the smallest amount she had to run to bathroom sharpish. I know that feeling as just a mouthful of certain foods at certain times can have me sprinting for the toilet (IBS) \nAlso even without the length of time there are some people that cannot actually process or digest meat and are vegetarian for medical reasons.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That feeling when you look glance at a piece of bread and feel bloated... you learn pretty quickly with IBS which foods are going to cause a flare up.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Right? Imagine feeding someone who is severely allergic to peanuts as a “dude it’s just a joke.”",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "You are correct here from what I know. Also, some people are allergic to certain meats so it could actually cause harm that way as well. I have a cousin who is allergic to red meats. It makes her super sick when she eats it.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "That's actually a myth, but the manager is still an asshole.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "I don't know the specifics what OP told her coworkers, but do they know why she doesn't eat meat?\n\nSome vegetarians **prefer** not to eat meat, some **can't** eat meat due to allergies/health complications.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -26,
                  "content": "No, that's silly.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -39,
                  "content": "OP does not eat meat for health reasons, which is not a protected class. It is not for religious reasons or a disability that is protected, so there would be no criminal liability in this case. OP could still attempt to sue civilly, but that is up to the judge whether to allow it or not. OP would have to prove harm was done in some way, either emotionally or physically through not being able to digest it, etc.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 12,
                      "content": "You don’t know where OP is, you don’t know what the law is there, and you’re throwing around irrelevant terms like “protected class” (which applies to US employment law, not to criminal law). But hey, you seem confident in the outcome, so you do you.\n\n(fwiw, I agree this doesn’t sound like something that would be a criminal matter, but that’s based more on generalities/experience/vibes than invented statutory elements.)",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I agree a judge would probably not give a shit here but this is am I the asshole, not am I legally protected to do this dickhole thing. That said, op is not an asshole. The manager is. And based off of all the food tampering shit that comes up on here, theoretically it could become a legal issue. Unlikely in this small of a company. But some of these posts have situations where someone is stealing food at work. The person then puts ingredients in their food that either lead to an allergic reaction, or to make it taste like absolute shit. The food thief gets away and the person who has been repeatedly stolen from is at fault for knowingly “poisoning” the person taking their shit. It’s completely backwards in my opinion but in some cases it can become a legitimate legal case.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "Nope. Any deliberate altering of food/drink is classified as food tampering and illegal. At least where I live.",
              "id": 28,
              "comments": [
                {
                  "score": 7,
                  "content": "Oh good to know",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 85,
              "content": "It doesn't matter whether there's an intent to do harm or not due to how bad food allergies can be. Whether or not it is a harmless prank, they never know the type of reaction a person can have to it. It wasn't like they got busy and mixed up orders or were just lazy or something. If OP got sick from that chicken, she could've sued them and what would their reply be? \"Oh, it was a joke!\"?",
              "id": 30,
              "comments": [
                {
                  "score": 49,
                  "content": "People can also be allergic to meat iirc, it's a side effect of lyme disease for some people",
                  "id": 31,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Yup. Personally, I think if someone says \"oh, I can't/don't eat X\" then it should be respected without questioning \"but why?!\" The reason doesn't matter. Maybe it's a personal choice. Maybe it's an allergy. Maybe it's for religious reasons.They told you they cannot eat said thing so do not feed them said thing.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Lone star tick disease actually. The bacteria produces a sugar molecule that is found in many meats and when introduced to the blood your body starts to recognize it as a threat. Then when you eat it in meat you react.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "No, there is another disease that makes you allergic to red meat specifically. You get Lyme disease from ticks, and you get this meat allergy disease from ticks, too. My girlfriend took our dog to Florida, and he got a few ticks on him, and all of a sudden, he was allergic to red meat, and his tongue and throat would swell up, sad 😔.  Luckily, the ticks in my area don't have this meat-eating allergy disease or Lyme disease.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "So, my mom can eat fish and poultry, beef and pork make her severely ill. If someone screwed with her food like that, she could end up in hospital.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It's called alpha-gal and it's mammals that cause the histamene reaction. But you're right in that people have allergies or migraine triggers for all kinds of things.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "There is also cat-pork syndrome.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "No, I think it's actually a separate tick borne illness. My sister is currently being tested. A few weeks after a tick bite, eating a burger seemingly sent her into anaphylaxis.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yup it's called AGA or alpha gal allergy. folks that have it are allergic mostly to red meat and/or most mammals so things like beef, pork, lamb , deer, rabbit, pretty much mammals.  In super severe cases, the person who has it cant even eat dairy.  Symptoms can range from mild hives to omg a epi pen isnt gonna save me. \n\nIt can be transmitted via tick bites with/out acquiring lyme. It also can just be something someone's born with from my understanding",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "[Alpha-gal](https://www.mayoclinic.org/diseases-conditions/alpha-gal-syndrome/symptoms-causes/syc-20428608)\n\nIt's different from Lyme disease and people get it without having Lyme\n\nThe tick bites them and transmits a sugar molecule into their body.  Their body makes antibodies against this sugar.  The antibodies cause a severe reaction to eating meat and meat products such as gelatin, and even dairy.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thanks for clearing this up for me!!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "If I was Catholic and they pulled this on me on a Friday during Lent, I'd be upset that they screwed with my religious practice. The same if they slipped a little bacon into a Jew or Muslim's food.  None of us would find it funny. Mistakes are one thing, but purposely screwing with someone's food as a prank just isn't funny. \n\nAs the worker, I might kick this up to the owner and see if he tried to make it right somehow.\n\nBut, NTA.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Food tampering doesn’t have to have intent to cause harm. It has to be done intentionally as was done in this case.",
              "id": 43,
              "comments": [
                {
                  "score": 5,
                  "content": "i used to work taco bell in texas, if we where informed of a food restriction, be it allergy/religion etc, we would get in trouble if we added said restriction, now if someone just says no cheese and we make a mistake we are not liable for her allergy, but the moment she say allergy, it better be perfect.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Thanks for letting me know I wasn’t sure",
                  "id": 45,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I am a restaurant manager. The moment a customer states they have dietary restrictions I get involved with that individual as well as the appropriate staff. Especially with allergies I confirm the allergen is not part of the recipe and communicate with customer if there is an issue.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "There’s is an intent to cause harm. If you haven’t eaten animal products (in this case animal parts) in years it can make you sick and possibly put you in the hospital. \n\nJoke or not OP’s boss is playing games with her health. What if OP had an allergic reaction?  It would be attempted murder knowing she doesn’t eat said food.",
              "id": 47,
              "comments": [
                {
                  "score": 2,
                  "content": "I know that (I’m vegan) I think I just misunderstood and there’s a lot of technicalities I’m not aware of",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -6,
                  "content": "Provide some evidence this is the case. You might have indigestion but not so sick you will be hospitalized.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "It doesn't need to have intent to harm because when people spit or put pubic hair in the food they are charged with it.",
              "id": 50,
              "comments": [
                {
                  "score": 3,
                  "content": "That makes a lot of sense! Thanks for clarifying",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "\"doing it on purpose,\" because they know she's a vegetarian is more than sufficient evidence of intent to cause harm.\n\nFurthermore, it did actual harm.  OP was subjected to an unpleasant experience and now doesn't have a job.",
              "id": 52,
              "comments": [
                {
                  "score": 1,
                  "content": "This has been pointed out several times. Thank you for further clarifying",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "enough meat to a long-time vegan or vegetarian can put them in the hospital with some nasty gastrointestinal complications. So.",
              "id": 54,
              "comments": [
                {
                  "score": 1,
                  "content": "Trust me I know I just was confused on how rules around food tampering work/are enforced",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "There was intent to cause harm here. The fact that the manager doesn't think it's harmful is irrelevant, what matters is she intended to tamper with the food and OP considers themself harmed.",
              "id": 56,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah fellow redditors helped me understand that thank you",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "OP should also put review up that the manager purposely put meat in her vegetarian sandwich as a \"prank\".\n\nOP should tell manager she quit as a \"prank\" and she should be able to take it since she loves pranks.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "NTA. What your manager did is awful, plus if they had wanted to fire you they wouldn't have given you any notice. Why would you do it for them?",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "She should call corporate and report this! I’m pretty sure they would be happy to know that their manager is pulling the shit!",
          "id": 60,
          "comments": [
            {
              "score": 6,
              "content": "This is actionable behavior. I’d do it to prevent this from happening to anyone else.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA. A prank is based on a shared sense of humour. Violating someone's fundamental principles (especially if she knows you have wider issues with food) is not a prank, it's sick. You were right not to put up with the AH behaviour of someone who has less maturity than an 18-y-o for a single moment longer.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This.  Food tampering is a crime everywhere.  Sometimes it can kill or seriously injure a person.  In this case, OP was *merely* deprived of her income from a job she's had for over two years.  \n\nSue them, sue them, sue them.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It can be but I've only heard it applying when things such as hot peppers or food that someone is knowingly allergic to is added to someone's order without their consent. It normally seems to be when the recipient needs medical care for the tampering.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I'd kick this up to boss's boss so she knows why you quit.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Imagine if op had food allergies, now that could have gotten serious.\n\nOp you need to talk to the owner, you shouldn't have left but the manager should be fired",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Yeah, I'd reply with something like: \"leave me alone or we can find out how illegal putting meat in a vegetarian's food is. Don't message me again.\"",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1632,
      "content": "NTA. Not having enough employees is the owners fault. The prank wasn't harmless at all",
      "id": 68,
      "comments": [
        {
          "score": 389,
          "content": "Yeah, OP, NTA for leaving but you should tell the owners what the manager did to you (assuming the manager is not the owner of the coffee shop).",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "Agreed! And why won't the owner get his/her/their butt in there and cover the shifts needed? If I was the owner and the choice was between closing the restaurant and working the shift myself, I'd damn well be working.",
          "id": 70,
          "comments": [
            {
              "score": 14,
              "content": "Never mess with somebody else's food, especially when working in the food industry.\n\nAlso what time does the cafe close at? Can a 16 year old legally work that late.\n\nOP, check your pay stubs and check with your local agencie to make sure he was paying taxes and stuff for you. If not report him for that as well.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "Yup. This is a business with an owner who has bad hiring practices, bad staffing in place, has allowed bad management to fester, and is driving away dedicated staff. \n\nThey can fire you at any time, for any reason or no reason. \n\nYou can quit at any time, for any reason or no reason. They aren’t your family. You haven’t abandoned anyone. Nobody dies because you weren’t at work. What happened was, you quit, and a manger who was foolish AND makes more money than you, was faced with an inconvenience. They have to tell the owner, risk the owner finding out about what actually happened, hire somebody new, train them, and probably watch them bail because this is a poorly run business that will likely fail. \n\nOP, if you’d like to own a coffee shop, you’ll probably be able to get that space and the equipment for cheap in 6 months to a year. Just saying.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "And the pranks might be the reason they are short staffed…",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "They're way short staffed in the first place. Hmm....I wonder why. It's not because how awful the manager and the owner, isn't it?",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Exactly! If nothing else (and there was a **lot** else!) the prank cost the restaurant an employee.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 966,
      "content": "NTA. Two weeks is a courtesy, not a legal requirement. This establishment stopped deserving your courtesy when your manager played a prank on you forcing you to eat something you don't eat.\n\nYou burned that reference, but given how shitty they're being about this, they probably weren't going to give you a good reference anyway.",
      "id": 76,
      "comments": [
        {
          "score": 104,
          "content": "NTA. They should be happy you’re not setting up a lawsuit for deliberate tampering with your food.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I know a lot of people that are vegan because meat hurts their immune system and makes them very sick.",
          "id": 78,
          "comments": [
            {
              "score": 31,
              "content": "I'm actually allergic to chicken. A bite of chicken like OP had wouldn't kill me but I would be incredibly sick for days afterward.",
              "id": 79,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -6,
              "content": "That's a weird reason to quit buying wool, or did you mean vegeterian?",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "References don’t matter. There is an entire sub full of people who are willing to be a reference.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Totally agree here. OP, you did nothing wrong. If this is a corporate location, report to HR. If it’s a small business, consider telling the owner should that bridge still be open.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 535,
      "content": "NTA. \n\nThey're lucky you're not suing them.  It's never OK to mess with someone's food.  They didn't know whether you had an allergy or some other health issue.  This was not a prank, it was bullying.\n\nGood on you for standing up for yourself.  I wouldn't have had the confidence at your age.",
      "id": 83,
      "comments": [
        {
          "score": 56,
          "content": "NTA, but I really hate when people think suing a business is easy, it's not. Lawyers aren't cheap and a small store who has 5 employees isn't going to attract any \"we only get paid if you do\" lawyers\"\nOP is not wrong for fucking over their employer bc you don't bite the hand that feeds you. The manager will now have to cover OPs shifts good luck 🥰",
          "id": 84,
          "comments": [
            {
              "score": 57,
              "content": "A small store who only has 5 employees and now regularly has to close early will likely ALSO struggle to afford a lawyer.\n\nJust the threat of a lawsuit would probably get her some compensation, at least to cover some bills while she finds a new job (or pay down any debts she incurs while finding a new job).",
              "id": 85,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm sure if they have business insurance it would cover legal fees for lawsuits, but in this case, it'd be their best interest to settle.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Many insurance policies do not contain employee misconduct as a coverage. In fact the owners could lose coverage for such a thing depending on the insurance company and area or at the least see a premium rise.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Lawyers can work on contingency if there’s a compelling enough case. There can also be free legal resources. Or lawyers doing pro bono work. Or small claims. Not saying any of these can be options here. We never know based on OP’s location and access to public or personal resources.",
              "id": 88,
              "comments": [
                {
                  "score": 3,
                  "content": "Small claims would be the best route for OP if there are no medical bills. OP doesn't need to have a full representation by a lawyer. A consult to figure out the best way forward and probably a demand letter for compensation or something. Small claims in many places don't allow lawyers.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 342,
      "content": "NTA\n\nI bet she's the type to feed someone a known allergen to \"test\" them.\n\nThe manager's lack of hiring is not your fault. The manager's inability to be professional is not your fault.",
      "id": 90,
      "comments": [
        {
          "score": 33,
          "content": "I hate those people so much. I have both allergies and migraine triggers and I've had it happen a few times.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I have a couple of intolerances and people act like it’s some minor inconvenience and I should just eat *whatever*. \n\nYeah, it sure is fun to vomit uncontrollably or shit myself because someone thought it would be cute to not disclose that they used artificial sweetener in a dessert because “it’s not a big deal”.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 195,
      "content": "NTA. Your vegetarian for a reason and they know it. They disrespected you and your choices. For all they know you could have an allergy to some meats and could have killed you \"as a joke.\"\n\nI'd leave a review somewhere telling people what happened (you ordered a grilled cheese and they willfully put chicken in it despite never requesting it nor it being part of the recipe).",
      "id": 93,
      "comments": [
        {
          "score": 47,
          "content": "They don't even need to know that OP is a vegetarian, let alone why she is. Even omnivores can choose to go meatless at times (waves at everyone), and I'd be furious to be given meat when I didn't ask for it.",
          "id": 94,
          "comments": [
            {
              "score": 6,
              "content": "I don’t disagree, in this case they do know however and chose to ignore it.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 100,
      "content": "NTA. You manager deliberately disrespected your boundaries concerning what you eat. It’s not a joke if you don’t find it funny. Also, they got called out and didn’t even try to apologize. They know they’re short-staffed, and they’re still treating employees like that? If they can’t respect a dietary choice, you can’t trust them with more complicated workplace issues. Your ex-coworkers should stop harassing you and block their numbers. You don’t have to work at a place that doesn’t make you feel welcome.",
      "id": 96,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 87,
      "content": "NTA that's not a prank it's assault, and plain dumb who purposely adds meat to grilled cheese as a prank, good or not. I'm not a veggie person and would be pissed if someone added chicken to grilled cheese. The manager clearly has zero respect for you. Please leave bad reviews, that shop deserves to go under",
      "id": 97,
      "comments": [
        {
          "score": 4,
          "content": "I....yes it's fucked up, and potentially illegal, but I don't think the charge or the definition would be \"assault\"",
          "id": 98,
          "comments": [
            {
              "score": 2,
              "content": "It's definitely something, could be a few terms for it",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No, it wouldn't fit. It would be potentially food tampering. Or OP could sue. Or report to the state's food safety cert folks. \n\nA lawyer in the local jurisdiction would be the best person to ask.\n\nQuitting with no notice is probably the easiest route.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "NTA for walking out, but you should absolutely report this to the owner. What the manager did was very wrong, and the owner deserves to know about it.",
      "id": 101,
      "comments": [
        {
          "score": 27,
          "content": "And your city's health department, unless the owner is bending over backwards to apologize and sounds sincere.  Even then, you wouldn't be wrong to report it.",
          "id": 102,
          "comments": [
            {
              "score": 1,
              "content": "The health department will not give one shit about this. It’s damn near impossible for a place to be shut down even when they repeatedly have violations.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "NTA. You can quit for any reason or no reason, but being openly disrespected and laughed about behind your back is definitely a reason. There is no reason they should expect you to stick around for weeks after, listening to them bitch about how you can't take a joke and you're causing a problem for nothing and you're so dramatic, which is, btw, what would happen right up to your last day. Your boss knew she was playing dominance games, so why was she unprepared to lose?",
      "id": 104,
      "comments": [],
      "relation": "Support"
    }
  ]
}