{
  "post content": "I'll preface this by saying that my husband (Luke) M32 does not get along with my parents. You can't tell who's right or who's wrong, there's always this ongoing tension between them but can be civil enough to sit together at one table.\n\n\nI recently got an invitation for christmas celebration from my parents. The invitation including me and Luke but Luke thought this was somewhat rude and a disrespectful because he believes he should get his own invitation and not have his name mentioned as an \"extention\" to mine. We talked and he said he wouldn't go unless they send him a proper invitation. I called mom and asked if she could do it. She thought it was ridiculous and said that she and dad did the same with my sister and her husband. I told her it was fine but Luke can be sensitive like that and so a simple invitation in a form of a text directly to him will fix it. She got defensive and said that Luke is being ridiculous. Dad claimed that Luke is trying to pull some power move to humiliate them but I thought this was a small issue. They still thought it was ridiculous so I told them I won't attend if they don't send him a separate invitation because he won't attend if he doesn't get it. This blew up and my sister started arguing saying Luke needs to get over himself and shamed me for trying to \"force\" our parents to send him an invitation by saying I won't come if they don't.\n\n\nWe haven't talked after that and we're waiting as of now.\n\n\nedit! The invitation I recieved was in a text. Luke is saying that a simple text to him will finish the conflict but my parents still think it's ridiculous and that they won't invite him since they already have.\n\n\n**UPDATE! I just got off the phone with my sister. She told me our parents have just disinvited me (Luke was probably already disinvited since the argument occured) from the celebration. I feel horrible but I can't argue anymore, just like I can't argue about what everybody else in the comments is saying. I admit it! Luke is the problem. He just caused me to be disinvited from the event and is blaming ME for it.**",
  "id": 1,
  "comments": [
    {
      "score": 49344,
      "content": "Luke is TA and YTA for condoning it.\n\nWhen you're married, you don't get separate invitations. Your mom called and said \"I hope you guys can come for Christmas\" or \"We're looking forward to seeing you at Christmas\", that is the Royal You, not just you OP.\n\n**Question**: If a friend issued the same invitation as your mom did, would Luke be kicking up a fuss, or would he just go?\n\nThis isn't about the invitation. Luke just doesn't want to go. Your choice is to stay with him, or go without him, but your parents don't have to issue Lukie Wubbie his own special private invitation. And think hard - is this really the only time he kicks up a fuss, or do you tiptoe around a LOT of things. Be honest.",
      "id": 2,
      "comments": [
        {
          "score": 11152,
          "content": "I’m interested what the backstory is here actually.",
          "id": 3,
          "comments": [
            {
              "score": 8516,
              "content": "Right? If this is any indication, I bet Luke is the issue",
              "id": 4,
              "comments": [
                {
                  "score": 5207,
                  "content": "Instant first thought for me too, Luke is definitely the problem. I bet you can tell who's in the wrong OP you just don't want to admit it. Christ does he want seperate Christmas cards too. YTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2720,
                      "content": "“ M32 does not get along with my parents. You can't tell who's right or who's wrong,”. As soon as I saw this, I was thinking “I bet we can”. And i was right. OP probably “cant” because she married Luke.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1072,
                      "content": "I'm going to speculate that there's \"tension\" because OP's parents see Luke exactly for who he is, a temperamental little AH who likes to control OP. And they ain't having it.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 625,
                      "content": "I agree. But also reddit loves to hang anyone who doesn't 1000% stand behind their spouse against their parents/family. You're still right tho. He does sound like a problem person and a shit stirrer.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 320,
                      "content": "I'm betting she knew in the beginning but after years of gaslighting and manipulation now she genuinely doesn't. I'm hoping AITA can get through to her that Luke is definitely the problem here.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "The ‘not really sure who is right or wrong’ leaves me to believe OP’s husband is the bigger issue. If OP gave examples of both sides I would agree it could be unclear. Usually when specifics are not provided there is a reason. So far we have a grown man throwing a fit he didn’t get a separate invitation for something that shouldn’t require a separate invitation. I would be more concerned if the parents sent them separately. If friends get married do they send invites them each an invite?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4245,
                  "content": "I want to know how OP and \"Luke\" sent out their wedding invitations. Did every person invited get their own? Were they sent to couples? Once they knew the names of the +1s, did they send invitations directly to them as well?\n\nOP: YTAs",
                  "id": 11,
                  "comments": [
                    {
                      "score": 387,
                      "content": "I thought the same thing, but who knows, maybe they eloped at the city hall and so they are unfamiliar with the practice of sending invitations. It is kind of weird that they never have received a wedding invitation addressed to both of them.\nAlso: who the heck mails invitations (for anything other than a wedding) to their families in the year 2022? With my family, we just text each other “The party starts at six, hope you can make it.”",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Omg for real! This guy wants his own formal invite delivered on horseback like he’s the king coming to Christmas dinner! Sounds insufferable and I’m sure he’s the problem. My mom would die laughing if I demanded she text my husband also to invite him to Christmas dinner when she had already given me the information.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1552,
                  "content": "Yeah I laughed out loud that they can't tell who the problem is... the problem is Luke. This is not a two sided issue. He is isolating OP who is so used to tip toeing around him and his nonsense that she can't tell where the problem began.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 227,
                      "content": "Right? They say they can’t tell who the problem is, yet they named their throwaway “Lukeproblem135”.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 184,
                      "content": "Exactly!! This is how my ex started isolating me from my family.  He started a big fight with my sister over absolutely nothing and then forbade me from speaking to any of them.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 176,
                      "content": "And its not like no one else will attend if Luke isn't formally invited with a solo text to his phone. Everyone else will be there and no one will miss the goofy couple.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Your comment hit hard\n\nI had a sibling in this very situation and I’m stressed about them - and this just fits the behavior of my sibling’s SO so well :(",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 715,
                  "content": "Yes, Luke is the issue. No wonder her parents don't like him. I don't like him and I've never even met  him.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Right? He sounds EXHAUSTING. I don't like to diagnose via reddit, but his BEHAVIOR is narcissistic.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I wish OP would provide more info",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": ">Right? If this is any indication, I bet Luke is the issue\n\nWell, Luke plus OP's enabling of Luke. Luke is the AH in chief, but OP is also an AH here.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Dad said “power move” it makes sense if Luke is the issue 🤣",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "This is my thinking. If he’s doing that over an invite for Christmas - my guess is he is the source of 75% of the issues bw him and the parents.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I think the clue is \"he doesn't want to be seen as an extension of me\". He sounds like an \"ALPHA MALE ™️\"",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "As soon as she said “You cant tell who’s right or wrong” I knew it was the husband.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "OP’s name says it all LukeProblem…",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1362,
              "content": "I mean, based on the clearly irrational behaviour shown by Luke here, it seems less likely that one \"can't tell who's right or who's wrong\" and more likely that Luke is clearly the one in the wrong but has managed to pull OP into his delusions of offense.",
              "id": 28,
              "comments": [
                {
                  "score": 194,
                  "content": "Yea OP married a controlling man is my guess and it will only get worse. OP's DH has some serious insecurities and they are not healthy.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "There’s no delusion, she just won’t admit to it because she wants to stay in the relationship. So it is in her best interest to gaslight everyone into thinking Luke is not the prickly one. Once she says it out loud, she has to make a decision and deal with it, which of course she doesn’t want. Because if he’s the difficult one, instead of both being equally at fault, it follows that she should leave him and she’s so far unwilling, though she may change her mind in the future depending on how untenable things get",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "“delusions of offense”. Brilliant. As someone who lived OP’s life, I have a hard time explaining what kind of hole I was pushed into, to support my narc Ex. But now I can say I was “pulled into his delusions of offense” and holy fuck does that save me a lot of time (and privacy) when people ask about him.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yup.  100% agree with this. I wonder how often something like this happens where Luke insists on something small, casting himself as a victim, which in reality is a power move designed to distance OP from her family.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Luke has played it so that OP \"can't tell who's right or who's wrong\". Controlling people are good at this. I don't think Luke really wants to go, but he doesn't want OP to go, either, and his plan is working.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Ah you think she’s getting gaslit by hubby?",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 414,
              "content": "My theory is Luke has been lurking r/justnomil and taking the advice about pitching a tanty until your spouse alienates themselves from their family.",
              "id": 35,
              "comments": [
                {
                  "score": 464,
                  "content": "#abusive controlling behavior and red flags. This thread is full of these tbh",
                  "id": 36,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yep. I was married to someone like this. I see the red flags",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "This is what it seems like to me. We don’t know the whole story of why things have given to this point. However, it seems like he is now kicking up a fuss over nothing to try to sabotage her relationship with her family.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Their advice for everything is that either your spouse alienates their entire family and friends or they don't love you and are abusive. \n\n\"His mom tells people she's a grandmother even though we chose mee-moo as her name from the baby\"\n\nGirl go NC immediately. She obviously doesn't respect your boundaries.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 181,
              "content": "\"You can't tell who's right or who's wrong, there's always this ongoing tension between them but can be civil enough to sit together at one table.\"\n\nYes I can.\n\nYTA OP",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Sounds like Luke is into stupid mind games and power plays where he forces people to be subservient to him in creepy ways.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3745,
          "content": "OMG. I think I was married to Luke! Or maybe it was a Luke-alike. \n\nOP, honey. Luke is TA. And I’d venture to say he’s spun you right round baby right round, because you trust him over your own lyin’ eyes. Anyway this kind of thing, getting pulled into your partner’s temper tantrum, having a partner who creates strife in your family, feeling like you need to stay home from holidays to show solidarity with partner’s ridiculousness: all that comes of being subjected to lots of controlling behaviour.\n\nWhen you start being an AH (& you have) just to avoid the fallout of displeasing Luke, he can sit back and smoke a cigar and enjoy watching the carnage. \n\nHis work is done. You’re fighting with your people, you don’t know which way is up and you’re clinging to him for balance. \n\nETA: Maybe your parents are controlling too and it just hasn’t come up here, there’s a reason his behaviour hasn’t got all your sirens blaring and maybe it’s bc people-pleasing is emotionally familiar territory.",
          "id": 42,
          "comments": [
            {
              "score": 1014,
              "content": ">Luke-alike\n\n😂",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 385,
              "content": "I was also married to a Luke (15 years ago) and reading this put a knot in my stomach. This kind of tantrum doesn't just come out of nowhere. Does he often take things that are important to you,  pick one tiny detail to hyperfocus on, blow it up to create a huge drama,  then make you pick sides? Bonus points if you are punished in a big way if you don't choose his side. Does he go to extreme lengths to control you and your life? Do you find yourself apologizing to him even when you don't feel like you've done anything wrong, just to pacify him? Maybe I'm way off base here, but if this sounds familiar, you're in an emotionally abusive relationship. It doesn't get better, they just get more bold in how they abuse you.",
              "id": 44,
              "comments": [
                {
                  "score": 175,
                  "content": "I can confirm this. My abusive ex-husband started early. He separated me from my parents. He isolated me from our friends. He pitched fits when I maintained friends he didn't know. He convinced me to close my bank account. He then closed his that he'd added me to and \"couldn't\" add me to the next account. He had me isolated and dependent before he escalated his mental abuse to physical violence. I left before he could graduate from hitting near me to actually hitting me. It started with stuff across the room. The last instance was him hitting the wall above my shoulder so his fist was inches from my head. I couldn't hit snooze any more.\n\nBefore they hit you, they hit near you. Before they hit you with fists, they hit you with words.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 53,
                      "content": "I called my parents to come get me & the baby the day he punched the wall next to my face. I knew in that moment that next time it would be my face",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": ">This kind of tantrum doesn't just come out of nowhere.\n\nFor sure it didn't come out of nowhere: \"Luke can be sensitive like that.\" Family is probably done walking on eggshells around him and no longer want to say \"how high?\" when he asks them to jump. Then he punishes everyone involved by punishing OP. No parent wants to see their child isolated, so they'll usually jump until being manipulated is no longer tolerable. \n\nThat's just my guess on how this situation has gotten this far.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "Luke-alike! Clever.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "What you did there? I see it",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This makes so much sense. Isolation baby, is the name of the game.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1962,
          "content": ">When you're married, you don't get separate invitations. Your mom called and said \"I hope you guys can come for Christmas\" or \"We're looking forward to seeing you at Christmas\", that is the Royal You, not just you OP.\n\nYeah, I'm absolutely baffled by the husband's taking offense. Like, OP's parents are treating the couples as separate family units -- that's just being respectful of the families that their children have made. Lol, should they deliver individual invitations to future grandchildren, too?",
          "id": 51,
          "comments": [
            {
              "score": 1809,
              "content": "And I bet anything he would have taken offense if he had received a separate invitation.\n\n\"Oh, what....I'm not a part of the family?? I'm not your spouse? They aren't acknowledging we're a couple! I'm not going!\"",
              "id": 52,
              "comments": [
                {
                  "score": 408,
                  "content": "I immediately thought the same thing. Luke sounds like an AH and OPs parents are probably just tired of his tantrums.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Whenever they mention \"person in question does not get along with the other people in question\" with zero additional context I always assume it's the individual's fault. And 99% of the time it's absolutely the case",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "THIS.  RIGHT HERE.  Husband sounds like nothing is ever good enough for him.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Exactly this. My cousin’s ex pulled this crap when he was trying to isolate her from the family. \n\nThey’d issue a verbal or text invite to my cousin for her, her now ex, & the kids to come to dinner or whatever was going on & he’d gripe about not getting a separate invitation “because he’s just some afterthought & not really welcome”. Then when they did issue him a separate invitation to make him feel more welcome, he griped about them not seeing him as part of the family.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 277,
              "content": "Some people enjoy feeling offended and/or being the victim. Luke seems to be one of those people. \n\nPoor baby /s\n\nAnd yes, OP, YTA",
              "id": 57,
              "comments": [
                {
                  "score": 20,
                  "content": "I have a SIL who will literately give you the shirt off of her back -and she has, indeed done this for my daughter- but if you’re not family, and you need something, she’ll insert herself into whatever it is you’re going through **solely for the Bitching Rights.**\nI remember her going on **for weeks** when she helped a friend move. Weeks.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 201,
              "content": "he's taking offense because he's the Man, he's the head, he doesn't want to be his wife's plus one when he should come first.",
              "id": 59,
              "comments": [
                {
                  "score": 127,
                  "content": "I suspect you're right and he'd've been fine with \"Mr & Mrs Luke Lastname\"",
                  "id": 60,
                  "comments": [
                    {
                      "score": 176,
                      "content": "What’s wild is that it was just a TEXT. It wasn’t a formal invitation. He’s having a tantrum because mom didn’t separately text him to get his RSVP.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Even wedding invite etiquette says married couples are invited as couples. It doesn't get much more proper than that.  (And this is totally not a situation that needs to adhere to wedding invite etiquette, but   more separate invites isn't less formal.)",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "It's a sign of respect for the relationship! If you don't think it's serious or long-term, or if attending together is *in question* for some reason - separate invites (cards, etc). If you issue a joint invite you're assuming they're together long-term and functional.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Ah here you go OP, and let me text your husband and each of your individual children, and oh Georgie is only 3 and doesn’t have a phone, how ever will they know they’re invited to Christmas? Oh dear oh my.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 461,
          "content": "You absolutely know that if they’d sent separate invitations in the first place he’d be furious and demanding a joint invitation.",
          "id": 65,
          "comments": [
            {
              "score": 21,
              "content": "“How dare they expect me to go on my own.” Or he would refuse to reply to the invitation.\n\nThough my guess is he’s trying to cut OP out of his communication with her parents. Sometime in future he’d want to get the couple’s invitation sent to himself.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "This!\n\nI'm appalled at OP's husband's immaturity.  Usually my late husband and I got an invitation with both of our names together from both sides of our families and friends. FFS, usually the couple get one invitation instead of two.  It's like Mr. and Mrs. Asshole, you're cordially invited to the party we're having on Sunday, blah blah.  It's not like Mrs. Asshole, you're invited to the party and Mr. Asshole, you're invited.  WTAF?!?\n\nTO OP, YTA\n\nYou and your husband need to get over that because it's very common that the couple gets ONE invitation. You both are immature.  Really......",
          "id": 67,
          "comments": [
            {
              "score": 17,
              "content": "[Mr. and Mrs. Asshole](https://youtu.be/XGdjKvivJA8)",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Half the time my partner and I communicate through each other to both our parents! I.e. can you tell your mom I’m bringing x dish for dinner, can you let your mom know I’m going to be arriving 15 minutes late because of work, etc.  You are a team! He needs to start acting like it and you need to stop enabling this behavior of his.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "“You can’t tell who’s right or who’s wrong”…. Yes we can 🤣",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "\"You can't tell who's right and who's wrong.\" HAHAHA",
          "id": 71,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": ">Luke just doesn't want to go. \n\nI'm sure that if OP's mom had sent Luke a separate invitation, then Luke's complaint would be \"They don't see me as part of the family- look how they excluded me from your invitation.\"",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": ">When you're married, you don't get separate invitations.\n\nThis is *so true*, family and friends alike. It's almost always a couples invitation now that we're married until specified \"girls night\" or whatever. 75% of the time, my MIL texts just me and extends the invitation to us both. I would *love* to know the backstory here because it feels like Luke is just a dick, and OP isn't able to see it. The parents are clearly over him.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18607,
      "content": "YTA holy crap that's not how invitations work. Couples always get invited together. He wouldn't be invited if he wasn't your husband. Why didn't you shut that shit down immediately? Your husband is a bigger asshole but you enable him.\n\n>You can't tell who's right or who's wrong\n\nI kinda feel like I can.",
      "id": 74,
      "comments": [
        {
          "score": 5409,
          "content": "It’s funny how OP can’t tell who’s right or who’s wrong….. but the whole of Reddit can.\n\nI’m guessing that Luke has been pulling crap like this for years and OP is numb to it.",
          "id": 75,
          "comments": [
            {
              "score": 2571,
              "content": "Seriously, I don’t know Luke and I don’t like him.",
              "id": 76,
              "comments": [
                {
                  "score": 1927,
                  "content": "Based on what OP has written, I imagine that Luke is like My ex boyfriend. He would just talk at you until you *saw things from his perspective*.\nI ended up agreeing with him on the most ridiculous things. I became completely numb to his bullshit. He was manipulative and bully.\n\nIt’s why I didn’t want to make a judgment against OP. She is in the wrong, but if Luke is anything like my ex….",
                  "id": 77,
                  "comments": [
                    {
                      "score": 1011,
                      "content": "…then Luke needs to become her ex.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 482,
                      "content": "My 17 yo daughter's father used to do this to her. He would just talk and not stop talking until she agreed, especially when he was trying to get her to do something she didn't want to do but he really wanted her to do (even things like going out for a specific sport in school). \n\nThankfully, we got her into therapy and her therapist taught her that she CAN stand her ground and it's okay to say no and mean no, even to your parents. It helped her to hear that from someone other than me. He's stopped doing this so much to her because it stopped working. Thank God. And now I don't have to worry about her putting up with future a boyfriend/husband trying to do this! \n\nOP needs to pay attention. I bet it's actually easy to see who is right/wrong in these situations.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "I think we all can.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "This is 100% the one. We can absolutely tell who is the bigger AH in that dynamic and it’s not your parents. I cant believe you even entertained this ridiculous power play.\n\nYTA and so is your husband.",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "If this is a reflection of how Luke normally acts then it's absolutely clear where the \"tension \" comes from.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12674,
      "content": "Seems like your husband is getting what he really wanted, which is to not go to this christmas celebration.  Has your husband always been trying to isolate you from your family?",
      "id": 83,
      "comments": [
        {
          "score": 2127,
          "content": "Well spotted.",
          "id": 84,
          "comments": [
            {
              "score": 227,
              "content": "This is not good OP. [Not good at all.](https://media.tenor.com/dAjBzKj9H3AAAAAC/danger-alert.gif)",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "At first I thought maybe Luke just isn’t invited to a lot parties (no surprises there) but this also seems like a very valid possibility",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1036,
          "content": "And blaming it on the parents.",
          "id": 87,
          "comments": [
            {
              "score": 19,
              "content": "And blaming OP for ….. agreeing with him, or at least that he should be humored, and going to bat for him. \n\nIt’s a power trip thing. He was invited to a party and he wasn’t in control so he had to exert control some how. And when you can’t find fault with the actual subject at hand you make issue out of how the issue was brought up.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 607,
          "content": "My thought exactly. I put myself in the parents' shoes for a minute and my first thought was, well, I'd tell Luke to get stuffed even if it means missing out on one Christmas with my kid, but then the next though was that this would be a major milestone in Luke's attempts to separate OP from her family. As a parent, would you suck it up so you don't lose your daughter and hope she sees sense before it's too late or do you stick to your guns and risk her distancing herself from you? What a miserable choice they have to make.",
          "id": 89,
          "comments": [
            {
              "score": 164,
              "content": "Knowing all too well how it ends, I would suck it up. Anything to maintain those ties and not play into his plan. Isolation is so dangerous for DV victims, and absolutely heartbreaking for their family.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 269,
          "content": "Classic behavior of an abuser. She doesn’t see it yet but give it time and she will.",
          "id": 91,
          "comments": [
            {
              "score": 20,
              "content": "Unfortunately many don't or make excuses for the abusive behavior like it seems OP is doing. I really hope that she takes a much deeper look at her relationship with Luke rather than Luke's relationship with her parents.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": "I also wanted to point out OPs edit. She’s now been disinvited for taking Luke’s side and now Luke is blaming HER. For what?! \n\n“Hey babe I’m so mad your family didn’t send me a personal invite! You should tell them to do that or else I won’t go!”\n\n*tells them to send a personal invite and is uninvited as a result*\n\n“Wow this is all your fault that we’ve been uninvited!”\n\nOP. He doesn’t care about being invited, he cares about controlling you, isolating you from your support network, and making you feel bad about yourself so that he can control you more easily. You didn’t give very much info about the fallout, but look up DARVO and really think about just how often this pattern of behaviour happens.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5813,
      "content": "\"Did the same with my sister and her husband\".\n\nIf this is true, you and your husband are most certainly TA. \n\nPerhaps your husband needs to stop being so overly dramatic. Becoming so hurt over his name included on an invitation sounds like he just loves stirring up unnecessary drama.",
      "id": 94,
      "comments": [
        {
          "score": 511,
          "content": "Of course it's true. Thats how everyone does invitations.",
          "id": 95,
          "comments": [
            {
              "score": 61,
              "content": "Yes! I did, however, gently insist to my in-laws (who I get along with very well) that they should text me invitations. BUT that’s because my husband has ADHD and will forgot to tell me, forget to go, and forget about events entirely. Eventually I was like, “If you guys don’t include me in the text chat, we’re not going to be there because he’ll straight-up forget and I’ll never know.” Very much not like OP’s situation but just a funny example of a time when sending an invite to both members of a couple is wise.",
              "id": 96,
              "comments": [
                {
                  "score": 17,
                  "content": "Lol, my mom will tell me she invited my brother via text. I remind her, 'uh, you should probably text his husband because he's ADHD af.' More than once my brother told his husband to drop my brother's dog off for puppysitting and his husband just showed up with the dog and we had no idea he was coming. No problem watching the big goof. He was the sweetest big boy.\n\nAfter a few of those I'd get a text. 'Did your brother tell you...?' Nope. But all good, drop the dog off! \n\nNow my mom and I will often send backup invitations to his husband.\n\nBig stuff like Christmas plans we expect him to remember and handle because his husband will ask him as they make plans. Sister's birthday party at a restaurant? Better tell his husband. There's too many people to expect his husband to remember everyone's birthdays.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Very true. This doesn't just apply to married couples. Sometimes people would invite me through my parents, or my cousin and vice versa. It all depends on what's seen as a family unit.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 194,
          "content": "> …my sister _and her husband._\n\nOP literally just did the same thing in writing that her parents did to offended Luke.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Why would anyone waste postage sending invites to individual members of a household? Nobody does individual invitations like that, it’s not a thing.",
          "id": 100,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "He’s not hurt, he’s trying to isolate her from her family. He stirs up this nonsense on purpose about nothing, then talks her into backing him up. All part of the plan.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "but he's sensetive",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5283,
      "content": "[removed]",
      "id": 103,
      "comments": [
        {
          "score": 609,
          "content": "I have no award, but this was perfectly worded. So, here you go. 🍪",
          "id": 104,
          "comments": [
            {
              "score": 171,
              "content": "Thank you! I feel thoroughly awarded :)",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 441,
          "content": "Yeah this whole thing reeks of an abusive partner slowly isolating someone from their support system.",
          "id": 106,
          "comments": [
            {
              "score": 22,
              "content": "Man you hate to say something like that from a one off post but I agree because they are treating this like it is a perfectly normal request and aren’t putting a stop to this nonsense. usually you come into these things with the best version of your story. The best version of Luke still looks unhinged/controlling. \n\nOP YTA but are you okay?",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 386,
          "content": "More than creating drama, this man is trying to cut her off from her family. \nOP, please take a look at his behaviour toward you outside of this tension with your parents. Are you constantly trying to please him? When you're upset or angry, are you the one who ends up apologizing? Does he make all the final decisions in your household or get hostile when he is questioned? Do you ever feel like you have to be careful around him or walk on eggshells, and have to frequently placate him? This very much sounds like an abuser setting the groundwork to cut you off from support. \nPlease note that it doesnt have to be an intentional, conscious thing on his part, abuse can be a pattern of behaviour that isn't necessarily a purposeful action. But its still abuse and still harmful to you. Please consider the kind of person your husband is. Your parents don't  get along with him for a reason.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Agreed. Weird hill for him to die on. Is he mad because he is being treated the way a woman usually is (as extension of spouse in invitations)?  Or because he just wants control over you and sees their connection to you as a place he doesn't have total control?  \n\nIs this the way he is about everything?\n\nYTA. Mostly to yourself.",
          "id": 109,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": ">And (a) it's totally normal to send one invitation to a couple, (b) he is only important to them because he's your partner -- you're the one they love and value.\n\nI have an educated guess that Luke mysteriously wouldn't see a problem if the invitation was directed at him and his wife was the \"extention\"...",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Also if this is such a small issue why can't Luke let it go? Why does OP put so much value to catering to his feelings? \n\nWhy is a grown man so \"sensitive\", when it's in fact a tantrum and demand?\n\nYTA you are enabling him, and treating him like a spoiled child",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3872,
      "content": "YTA, although it’s really more that you’re letting Luke *make* you be an asshole to yourself, because he *is* being ridiculous.  There is no etiquette book on earth that recommends sending married couples two separate invitations.  In fact, I guarantee if they *had* done it his way for some reason, he’d be spinning *that* as an unforgivable insult and still demanding you stay home, because that’s really the point here.  Put your foot down that this is his problem, and buy yourself The Gift of Fear/Why Does He Do That? for the holidays, because the red flags are *strong* with this one.",
      "id": 112,
      "comments": [
        {
          "score": 773,
          "content": "Yeah, I can see that. If they sent 2 invites, it's gonna be \"what, they don't consider us a unit?\" Bs",
          "id": 113,
          "comments": [
            {
              "score": 62,
              "content": "\"It's like I'm not even part of the family! I'm just some stranger!\"\n\nYep, there is no correct solution. No matter what they did, he'd take offense and twist it to make it look like a deliberate slight.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "If I got a \"separate\" invite from my mother in law that would seem like my wife and I had \"separated\" and my attendance would be optional. Almost a pity invite or formality at that point, if you're not invited TOGETHER.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Yes!!! If they had originally sent two different invitations, I guarantee you he would’ve had an even bigger problem with them than this! He’s just a shit-stirrer.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Love the constructive advice and book suggestions.  Looking them up myself!",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "You can access Why Does He Do That for free, dropping this off here https://ia600108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf\n\nEdit: thank you for the award kind stranger 🥰",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2895,
      "content": "YTA. \nLuke is a drama queen and you fell for his manipulation.\n\nYour family is right. This IS ridiculous.",
      "id": 119,
      "comments": [
        {
          "score": 312,
          "content": "[removed]",
          "id": 120,
          "comments": [
            {
              "score": 26,
              "content": "Honestly I would be offended if my wife got 1 invitation and then I got another. Especially If it came from her family.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "lol this prob one of many reasons parents and Luke dont get along",
          "id": 122,
          "comments": [
            {
              "score": 26,
              "content": "I don't know Luke, but i don't like him.\n\nBut of course, OP can't see who's wrong or right here lol",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2591,
      "content": "YTA you’re a couple, why on earth would they send individual invites?!? This is crazy, your husband needs to get over himself.",
      "id": 124,
      "comments": [
        {
          "score": 393,
          "content": "For real. I'd be super confused if my in-laws suddenly started to send us individual invites.",
          "id": 125,
          "comments": [
            {
              "score": 104,
              "content": "I'll admit other than, say, weddings, I don't think my family or my in laws have formally invited me to anything.  It's usually \"We're meeting at your brother's this year, you bringing pie?\" Or \"when are you flying in for Christmas\"?",
              "id": 126,
              "comments": [
                {
                  "score": 35,
                  "content": "Now that you say that... I think I've only gotten formal invites to weddings or once a \"big\" birthday. Other than that it often times is just a text (group text, so maybe that would've been sufficient for op's husband, lol)",
                  "id": 127,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Same, and it's usually my aunt that sends the text to the blood relative and, obviously their SO and kids are included. My MIL just texts all info to my husband and I don't even care. One less text for me to read and event for me to keep track of.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Seriously! I was expecting something like they received a formal invitation addressed to \"[OP's name] and guest\" or something like that. Which would be pretty insulting if you're married. But who expects to receive individual texts inviting you to a party??",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1952,
      "content": "What kind of sick control game is your husband playing ?!\n\nYTA. If your husband can't be civil with your parents, and you take his side, don't bother going. Clearly, he will look at anything thing to be able to avoid them or stir up some trouble.",
      "id": 130,
      "comments": [
        {
          "score": 167,
          "content": "[removed]",
          "id": 131,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 44,
          "content": "OP should go without him. If it blows up because she's going and he's not? Then, yeah, he's definitely trying to isolate op from her family. I'd suggest she gets the hell away from him before she ends up trapped.",
          "id": 132,
          "comments": [
            {
              "score": 22,
              "content": "This! I’m curious to know if her parents are the only people he has issues with like this. My ex was like this and by the end of the 3 years with him I had no friends left and I had to do serious work to repair my relationships with my family and it started with issues like this",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yeah, he's basically just telling her parents \"HA, I can make your daughter not attend Christmas with just an unreasonable text request!\". He's basically making it so there can be no good ending as long as he's involved. If they don't send the text they don't get their daughter for Christmas and he shows how much control he has over them all. If they do send the text then he wins and still shows how much control he has over them all because he got his way in the end. Him trying to make it seem like a small, simple thing by saying they just need to send him a text is also a way to manipulate OP into thinking her parents are the crazy ones since they won't send a \"simple text\".",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1349,
      "content": "Thr right response from you should be \"Luke, stop being an AH. These are my parents and I am going to the party with without you. You have been invited so if you choose not to come, thats your choice but I am not talking about this again.\" Luke is a massive AH and so are you if you side with him.",
      "id": 135,
      "comments": [
        {
          "score": 167,
          "content": "This is the only answer you need, OP.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}