{
  "post content": "Okay so I’m in a bit of a dilemma here.\n\nI am currently 37 weeks pregnant so we are getting ready to receive our girl. The problem is my husband has recently told me he wants to teach her Spanish too.\n\nThe thing is, he isn‘t even Spanish! He was born here but lived on Spain since he was 4 until he was 19. Now, if he had some sort of cultural or family connection to Spain then I might consider it. But he is American!\n\nWhen he initially told me at around 21 weeks I thought he was joking so I let it go, but now that he brought it up again I told him how I felt about it.\n\nI told him what I told you guys above and that it would be hard for her because they are very different languages.\n\nHe started arguing that there are many kids that are raised bilingual and are very smart but I also feel like it might cut me from my child.\n\nHe is mad at me for not accepting and I can’t help but wonder if I was an asshole here.",
  "id": 1,
  "comments": [
    {
      "score": 61570,
      "content": "\"If he had some cultural connection\"\n\nUmmm... He has lived there for 15 years wtf are you on about?\n\nYTA",
      "id": 2,
      "comments": [
        {
          "score": 20222,
          "content": "Hé litteraly grew up in the culture",
          "id": 3,
          "comments": [
            {
              "score": 18053,
              "content": "Even if he didn't, there is no really good reason to not teach a child another language, I was taught English from a very young age (i wasn't born in a native speaking country nor do I have any connection or family with any native speaking countries) it helped me immensely. And in this case, with a heavy cultural connection to the father, there is even a bigger reason, it certainly wouldn't harm the child to be bilingual.\n\nIn conclusion yeah OP, YTA",
              "id": 4,
              "comments": [
                {
                  "score": 10586,
                  "content": "OP says she fears that their kid learning a language she doesn’t know will cut the child off from her. OP, you should take that as a sign to try learning spanish as well, especially since your husband is so connected to spain’s culture and language. YTA for dismissing his very valid identity AND idea to raise your child as bilingual. many studies have shown that raising multilingual children has its benefits, and language is best learned at an early age.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2884,
                      "content": "Is not like the kid will not know English too, im sure if she continues the same path of arbitrarily making decisions like this the child will grow and cut themselves off from her even in English. Kids are innocent but they absolutely love when they grow and notice their parents negated them opportunities..I know I did, nothing like growing and discovering that your mom never let you achieve your full potential because they had some irrational fear just like op has now..thank you mom! /s",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 762,
                      "content": "Almost all of my friends kids are bilingual (English and Japanese) even if one parent knows absolutely nothing of the other language. It has never cut off a parent and child (I just did a quick tally, and I know 26 kids who are half Japanese half other, live in Japan, and bilingual, and 4 that also speak Spanish or Indonesian). \n\nFirst, as the parent in the non-dominant home language, you pick it up pretty darn fast. My friend was even worse than me at Japanese despite living here 6+ years more than I, but now he’s conversational at best, because his kids speak both all of the time. It’s a great chance for the parent to learn the second language too!\n\nSecondly, learning another language early on is really, really great. Of those 20+ kids, a few of them are in college and essentially polyglots - one now speaks Italian, French, and a bit of Korean, another can speak Korean, Mandarin, some Tagalog and is learning Classical Japanese just for fun, on top of English. \n\nIt helps you build those pathways. I never learned a second language (well, I started to, but had a teacher in the US in my formative years who bullied me for mixing up words like Dog and Hund so I suppressed everything I knew about German/Dutch to the point that it impacted my ability to process language in the first place) and am struggling daily with Japanese despite living here for almost a decade. I wish I had that drive. \n\nMy friend from high school is a university professor in Spanish lit, and her daughter speaks Spanish fluently despite no connection to Spain other than a few trips. The kiddo goes with her mom to conferences, and they always make a point of learning basic phrases in the local language. When they were in Japan, she just had to hear a word once or twice in Japanese was and she could use it days later, it’s amazing how brains get wired! She even picked up the sound nuances it took me a few years to even be able to hear the difference in (“su” ス vs “tsu” ツ for example)\n\nI love languages, and wish I had an aptitude for them. This soon-to-be-mom is depriving her child of something that the kid will grow to regret. \n\nPlus, who cares if Spanish time is “dad time?” Like, that’s the absolute best way I can imagine them bonding, and I’d be so proud of my husband if he took that on and used it to help build a great relationship with the kid!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 350,
                      "content": "She may learn Spanish if she wants to, but it's really not necessary to be involved in her child's life 100%. She doesn't NEED to control everything she says, the child will speak English and their relationship should be healthy enough that she will share with her mother. \n\nThis seems to me a major red flag for future controlling behaviour in parenting. \n\nI have a multilingual child and it doesn't bother me in the least.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "It’s crazy, I know two languages that my parents don’t and two that they do. It makes me an excellent translator on our family vacations because I love Latin America and it’s been so beneficial and enriching in so many ways.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 925,
                  "content": "Especially living in US where Spanish is widely spoken. This would be a great bonus to have. YTA",
                  "id": 10,
                  "comments": [
                    {
                      "score": 194,
                      "content": "Yes.  Especially in certain parts of the U.S., like the Southwest and New York City, knowing Spanish gives you an edge or might even be a job requirement, especially in neighborhoods with a large population of immigrants who are old enough and recently arrived enough that they can't speak English fluently.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 888,
                  "content": "Sounds like op just wants her kid to speak ‘American’🙄can’t imagine what kind of person would see learning another language as a negative…oh wait…\n\nYta",
                  "id": 12,
                  "comments": [
                    {
                      "score": 209,
                      "content": "The juxtaposition of a people who are self proclaimed \"the greatest power in the world\" and yet continue to degrade the quality of their society with their own ignorance.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "Republican “Christians” are very much like this 😒.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 625,
                  "content": "Yup, all children in my family are educated as bilingual as a minimum. Growing up, approx 2/3 are trilingual. That's a huge bonus for work or on holidays",
                  "id": 15,
                  "comments": [
                    {
                      "score": 229,
                      "content": "Just went on a trip to Mexico with 10 extended family members.  My nephew went to a Spanish Immersion school from the time he was 5, he’s the only one of us who speaks Spanish and he translated for us the whole time. When I was in Costa Rica I was really wishing I spoke Spanish so I could get around better and now Op wants to take away the chance for her child to be effortlessly bilingual?  Definitely TA.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I knew a Spanish family like that. They had a standing, low key competition as to who could learn the most languages. Last time I heard, it was a female cousin 🥳.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 592,
                  "content": "YTA. It would almost certainly benefit the child to speak two languages; the brain is wired to be able to learn two (or more) languages at a time:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6168212/",
                  "id": 18,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yup. A lot of English speakers are monolingual, but the evidence suggests that multilingualism is probably a much more typical state for humans generally. And as well as the cultural, social, and economic benefits, it seems to provide some protection against dementia, and can aid recovery after a stroke.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "[deleted]",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 380,
                  "content": "Man I still don't understand why some people hate bilingual people or hate people learn other language. Like legit I lost count on how many post of people hate when other people talk in multiple language. Even yesterday there was a post of someone calling OP racist for knowing spanish. \n\nIs this a case of stupid people hate smart people like in Idiocracy. Are we really going to that way?",
                  "id": 21,
                  "comments": [
                    {
                      "score": 444,
                      "content": "When I was a child, probably late 80’s, we moved back to the US. My father had been stationed in the Netherlands first, then Germany. In the Netherlands, all my schooling was in Dutch, and in Germany it was mixed immersion. \n\nBecause of this, little first grade baby me didn’t understand that there were different languages, because I could answer in Dutch, German, or English, and my teachers understood. Flash forward to Wisconsin. I’ll set the scene. \n\nWe were poor, like home made clothes and hand me downs poor. I was the new kid at school, joining midway through the year. I was the youngest, because cut offs were different for ages for starting school in Europe. And I was always just kinda that awkward girl. \n\nMy teacher actually got joy out of ridiculing me, because (as she told my mother when she came in for a conference) “she thinks she’s better than us because she lived somewhere exotic.” My mother finds this hilarious to this day, the idea of a German air base as exotic, with our random bombings by the red army and terrorist drills. But I digress. \n\nThis woman would single me out and make me stand up in front of the whole class when I answered an “obvious” question wrong. Some examples were mixing up animal names (cat vs katze “she doesn’t even know what a cat is!”), counting weird (id count in some mixed up version of German, Dutch and English and it was hilarious in retrospect!), and using the wrong letter pronunciations for sounding out new words with phonics. \n\nI started having (what I now know were) panic attacks every morning, vomiting uncontrollably. I still can’t eat breakfast and I’m in my 30’s.\n\nI found out years later that she had been in trouble before for doing this to ESL learners, but nothing came of it because schools in the 80’s were the Wild West of shittery. She was old by the time I had her, and according to friends I met later in high school who had her who happened to be anything other than lily white, a racist too. Like watermelons and fried chicken jokes with first graders. \n\nSo that’s how idiocy like this perpetuates. This fear that knowing more than them about *anything* means you’re looking down on them, instead of embracing our differences and learning from each other throughout life. \n\nOh, and as for my language skills. I had such a hard time that my mother took me out of school early that year and homeschooled for the rest until we moved across the country, but the damage was done. They thought I had cognitive issues because all language was suddenly panic inducing. Spelling tests could cause me to puke and pass out, and it took until college to manage to read a written speech in front of others. I developed a terrible stutter in that time, too, as my brain would just lock up out of fear I was saying it wrong. And now, I can’t audibly process languages right, so despite literally being immersed in a language for 10 years now, I can barely make small talk in Japanese no matter how hard I try. I can read pretty well, though, go figure. \n\nSorry, this rant was actually rather cathartic. I didn’t mean to dump all that, honestly!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Prepare for the crops to be watered with Gatorade",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Considering that Spanish is also a language with fast rising speaker numbers, it's a good idea to start to teach them early if you can and have a high speaking level yourself. And the earlier kids learn new languages the easier it gets for them to learn even more as an adult, which is a very good qualification for any job in their future! Kids are like sponges, fill them with whatever (language) skills you can (without ruining their childhood ofc). \n\nYTA",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This! My mom never lived for real in the UK or US, but when she was in highschool they would send her every summer to live with an English family, some sort of aupair situation but just for learning the language not to work, so she picked up a very good English, and when I was born she taught me. She really had no cultural ties, but she knew the value of learning a second language and how much easier it is if you teach someone when they’re young.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Same here! I live in a country where English isn't the native language, but my dad taught me and my siblings English when we were little. In fact I grew up trilingual (my mother isn't from my native country and taught me her native language) Long story short, this has only led to advantages for me later in life and my development was not stunted in any way.\n\n\n\nOP is TA.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "It's half his life. He spent more time consciously in Spain than in the US.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "But he is AMERICAN!\nI smell racism here, YTA",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I'm guessing OP is the kind of person that sees adopted kids as less than bio kids too.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2046,
          "content": "I don't know whether to marvel or just be dumbfounded of how ridiculously stupid the post is. Of course the child should learn Spanish. The father lived there for 15 years. If OP is so insecure, she should learn too.",
          "id": 30,
          "comments": [
            {
              "score": 429,
              "content": "And he learnt it at very young age. So there is a good chance that he speaks it like a native speaker. \nI do not teach my children English, because I do not want them to catch my accent, but otherwise I certainly would.",
              "id": 31,
              "comments": [
                {
                  "score": 197,
                  "content": "What do you think is wrong with your accent? Or do you mean you don’t want them to pick up mistakes that you make, they should learn it from a proper teacher. Native English speakers have so many accents anyway it doesn’t even matter, you’re probably more likely to understand someone speaking English as a second language than you are a strong Glaswegian or Black Country accent!\n\nI love [these guys analysing so many accents!](https://youtu.be/E8aeMbUlvLY)",
                  "id": 32,
                  "comments": [
                    {
                      "score": 13,
                      "content": "In what might be an amusing reversal of that to some, I learned Spanish in school (can speak and read at a rudimentary level but would not consider myself fluent, especially anymore).  I was told once that I speak it with an Argentine accent.  Could have fooled me.  Maybe it's because the teacher I had in High School was of Italian-American descent?",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "It's easier to change an accent than it is to learn a language.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This was a great wee video, thanks for posting it! I really love the variety of accents we get with English speakers, it’s absolutely fascinating to me, even just in my own country (Scotland) never mind all the others! I’m always trying to identify little unique things about each area/city/state etc. Or if I hear a non native English speaker speaking English, I like to try to identify where they’re from. I used to work in a call centre and it was amazing to hear so many accents every day. So it’s nice to know that other people do that too!",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "I’m English and I can’t understand some other native speakers if they have an accent. Sometimes if it’s strong, it’s harder than a non-native speaker’s accent. I certainly wouldn’t let an accent put you off.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yeah and some Americans struggle with the plethora of UK accents. I mean, it's not like I can 100% understand Yorkshire or Glaswegian accents, but I catch most. I suppose living in Europe with easy access to the BBC helps...  \n\n\nNote, the same goes for all the different variations of Europeans speaking English with their native accents!",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I think accents adds character to the language. It's always so nice to hear what people have to say. If everyone sound exactly the same, it would be quite boring. Plus, I think it would be nice if they had something to bond over with their parent. It's always good to have some base knowledge than none.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "That's ALSO a terrible reason to deprive children of a language. You should absolutely teach your kids English. You're hurting them to appease your pride. Your love for them should outweigh your pride. My mom refused to teach me the language of our ethnic heritage because she was embarrassed, worried it had given her an accent in English. She doesn't have an accent in English. If she ever did, it wouldn't have mattered, as accents are great. They don't detract from the speaker's skills, and they're often endearing. It's been horrible throughout my life to have been cut off from my family, my culture, my community and my religion, because she allowed her insecurities to take priority over my well-being. \n\nPlease don't do this to your kids. Afford them every opportunity for advancement, self-development, and a good life that you possibly can!\n\nEdited to fix one sentence, to better reflect my opinion ;)",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1280,
          "content": "i shudder to think what OP's views on immigrants are. YTA",
          "id": 40,
          "comments": [
            {
              "score": 527,
              "content": "seriously. OP's xenophobia is so obvious",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 508,
              "content": "C’mon we know what her views are, “Your in America now, speak English!”\n\nYTA",
              "id": 42,
              "comments": [
                {
                  "score": 66,
                  "content": "Exactly, I’m curious to see if she makes any edits trying to defend it. I can see a “I’m not xenophobic but….”",
                  "id": 43,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Bold of you to presume she knows what xenophobic means",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 986,
          "content": "Americans: \"My great-great grandfather migrated from Norway, so I am Norwegian! Lutefisk!\"\n\nOP's partner: Grows up in Spain, gets immersed in the culture, learns the language, wants to teach it to his kid.\n\nOP is a bit yikes.",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 938,
          "content": "Americans: \"I'm Irish! My family arrived from Ireland two hundred years ago!\"\n\nAlso Americans \"he only lived in the country for fifteen years, he has no cultural connection to it whatsoever\"\n\n(Obviously I'm generalizing but it's so freaking weird to hear both, as a European 🥴)",
          "id": 46,
          "comments": [
            {
              "score": 103,
              "content": "> Americans: \"I'm Irish! My family arrived from Ireland two hundred years ago!\"\n\nAdding on to u/aka_June_Monroe 's point, Americans identify as their ancestors because many of the immigrant communities lived in the same area - and still do.  It's why you have \"Little Italy\"'s in places like New York City or Baltimore.   Or why you have \"Chinatown\".  Newly arrived immigrants went to where others of their culture already lived.  They might have lost the language over the generations but, very often, some of the other cultural traditions survive.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 549,
          "content": "So he's lived in Spain since he was a toddler until he was an adult, in my opinion he's as Spanish as I am (I'm a Spaniard). Let him teach his daughter Spanish!",
          "id": 48,
          "comments": [
            {
              "score": 9,
              "content": "I started learning Spanish in the United States and lived in Spain for a year to continue my education. I eventually received a Bachelor's of language arts in Spanish.  Learning Spanish was the love of my life. I read magazines, books, watched television shows in Spanish.  I Picked up intercambios so I could practice verbal skills for several hours a week. I lived in Granada.  The accents really differ from one part of Spain to another. In Granada, la gente come los sonidos cuando habla.  In Madrid, the language was easier to comprehend.  I made so many wonderful friends.  The food was much healthier.   Everyone was thin and fit from all the walking and healthy diet. In fact, one of my American classmates lost about 25 pounds.   The women were really beautiful.  I swear some of my female friends could have won a beauty parent.  One of my friends, Rosa, lived on a farm in Peligros.  They grew olive trees (of course), raised rabbits.  It was so funny. I remember asking a family member why they had so many rabbits.  I was shocked  to learn they were raised for food. Your post brought up so many wonderful memories. I could go on and on, but I think I'll stop here.  ❤",
              "id": 49,
              "comments": [
                {
                  "score": 8,
                  "content": "I'm glad to hear you had such a wonderful experience here! Yes, we have many accents just in Spain, the Spanish spoken in Southern Spain is one of the most difficults but Granada's accent isn't that bad, it could be Murciano! I laughed at your rabbits story, my in laws raised rabbit for many years for food because it's a very lean meat. \n\nI feel reflected in your story just in the opposite side, I felt in love with the English language, moved a few years to the UK and came back to Spain to open an English academy so I completely understand :) Languages make you open your mind and your heart!\n\n It's bollocks that OP wants to gatekeep a language when it's one of the best presents you can gift to your child!",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 390,
          "content": "Not jut any 15 years, it was his formative years. \n\nOP, YTA",
          "id": 51,
          "comments": [
            {
              "score": 8,
              "content": "Exactly, in Spain there are many foreigners who live here for years but don't even know the language. They are usually retired English tourists who live in the beach areas.",
              "id": 52,
              "comments": [
                {
                  "score": 12,
                  "content": "Who all voted for brexit 🤦‍♀️",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 227,
          "content": "IIRC learning more than one language as a child is really beneficial for brain development or something, and it's always nice to know more than one language.\n\nYTA",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "I don't understand this mentality, like at all. I once dated a guy who was born in Vietnam, raised by a french family in france, and he identifies as French. There's literally nothing wrong with that!\n\nIf you follow this train of logic then African Americans should just be considered Africans. Its a weirdly racist way of thinking that diminishes how people consider themselves culturally by just looking at their race. Identify with whatever culture you want, as long as you're not appropriating it.",
          "id": 55,
          "comments": [
            {
              "score": 30,
              "content": "I'm adopted from South Korea, grew up in Norway with the only parents I know being ethnic Norwegians I hate to be told I'm not Norwegian because I don't look the part.\nYour identity isn't for anyone else to decide.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I agree. I was getting some racist vibes from OP…",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "There are also various benefits to raising a child as bilingual and I know the states is a bit different than Canada, where we have french & English as our official languages, but Spanish is still used a lot in the states. \n\nSpanish and English are also quite similar. If you grow up speaking French or Spanish, it makes spanish or french easier to learn. This post is so \"murrica\" it hurts.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23665,
      "content": "YTA-Babies have an amazing capacity to learn things including multiple languages and stop gatekeeping Spanish.",
      "id": 59,
      "comments": [
        {
          "score": 6155,
          "content": "She can’t gatekeep what she doesn’t know 😭",
          "id": 60,
          "comments": [
            {
              "score": 2667,
              "content": "She probably just doesn't want the kid to have that kind of connection with its father when they inevitably divorce because of her shit attitude.",
              "id": 61,
              "comments": [
                {
                  "score": 1175,
                  "content": "That's what she literally said. \"it might cut me from my baby\". I don't like people like OP lmao",
                  "id": 62,
                  "comments": [
                    {
                      "score": 321,
                      "content": "Then she should take part and learn Spanish as well.\n\nOP is doing exactly what she is worried about happening to her. OP is trying to control the raising of their future daughter",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 84,
                      "content": "Exactly\n Like ffs why don't you try to learn Spanish with your kid? Talk about a bonding experience for the whole family. But it's clear she doesn't really care for her partner or his heritage.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 188,
                  "content": "[deleted]",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1137,
          "content": "My cousin is an american who didnt speak anything but English, he married a woman from Germany.  She only spoke to their son in german, he only spoke to their son in English, they sent him to a spanish speaking preschool, the kid is fluent in 3 languages by 4 or 5 years old and makes most adults looks stupid.  I haven't seen them in a decade or so, but Im sure that kid is doing great in school.",
          "id": 66,
          "comments": [
            {
              "score": 431,
              "content": "My kids grew up speaking 3 languages and it is such an advantage. Instead of being isolated to one job market they now have doors open to much bigger societies. Let alone all that lovely local art and literature. Some things just can't be translated.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "Same with my brothers kids. Parents spoke English & Russian and going to a German school. Fluent in all 3 and know which language is which.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I have two cousins, their dad is Dutch and their mom is Finnish, mom talked finnish with them, dad Dutch, together they spoke English, at school they also learned Swedish and when the youngest one was six, they moved to Germany, when the youngest one was 12 they move to the Netherlands.\n\nNow these kids are fluent in Dutch, Finnish, Swedish, German, English and to a certain extent low saxonic german because their grandmother wanted them to speak that with her. Im so jealous of these kids",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Lived in Germany and the Netherlands and knew several mixed-nationality couples who did this with their children and they are all incredibly smart as a result",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 354,
          "content": "Our barely 2 yo is bilingual and she effing astonishes me.  We basically speak only Korean in the house and thats really the only language she uses with us but she goes to an English daycare since we live in the US.  She speaks absolutely no Korean at school or at my (white) parents' house and will correct them to English if they try to use Korean.  She's very recently started doubling words in Korean and English to me (the only white person she allows to speak Korean to her) but speaks exclusively Korean with my Korean husband and his parents and will correct them to Korean if they try to use English. Even at such a young age she has NO confusion as to what is what and when and where to use certain words.  OP is being overly paranoid and is at the perfect stage to start learning spanish since as a baby everything will be so basic anyway.",
          "id": 71,
          "comments": [
            {
              "score": 77,
              "content": "Exactly this. I live in Mexico and have a Canadian neighbor. She married a Mexican man and had kids with him. She speaks English with her kids all the time and the kids speak Spanish everywhere else. I've seen them grow up and now they're around 10 - 12 years old and speak perfect English and Spanish. OP YTA.",
              "id": 72,
              "comments": [
                {
                  "score": 10,
                  "content": "My favorite is the French dude on youtube/ tiktok Luic?  Who lived in Mexico and the US so is perfectly trilingual and makes videos comparing the 3.  Young brains are fascinating",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah wtf is OP on about \"English and Spanish are so different she'll get confused\" ? Kids grow up in the US speaking English and Korean, English and Mandarin, English and Hindi, English and Punjabi, etc, etc. Spanish is considered to be one of the closest languages to English. This post makes me so mad. Congrats on raising such an incredible baby girl by the way. 2 is very young to be so proficient in one language let alone two",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "Learning languages is as natural as breathing for a toddler, so of course the natural thing to do is wait until they're 13 to start even trying. \n\nI swear, American education seems like an attempt to punish kids for the crime of existing",
          "id": 75,
          "comments": [
            {
              "score": 24,
              "content": "Yep. And many Americans act like being bilingual is some complicated thing that will confuse a child. Meanwhile in the rest of the world, kids are growing up speaking 2-6 languages with no problem. My friends in Uganda speak 4 languages natively. Four! And yet we can't even get our shit together enough to competently do Spanish immersion in the US.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 55,
          "content": "Lol babies aren’t born fluent in English.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "They really do, it’s so much easier for babies to learn multiple languages than it is for an adult to learn another language later on. Babies are learning both languages the same way at the same time whereas adults are learning to translate in their head while they’re thinking of what they want to say.\n\nOP sounds like they’re scared of their baby having a “secret language” with the spouse.\n\nPlus like…isn’t learning Spanish a good thing? Like it’s always great to have extra skills since they can come in handy at any time and I feel like knowing Spanish is great when a lot of folks in America speak it already 🤷‍♀️",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yeah OP is def YTA.\n\nMy 11 about to be 12 year old speaks English and Russian from her dad’s side. \n\nMy youngest who’s dad is Puerto Rican speaks English/Spanish and just entered kindergarten is in an immersion program at school where they only speak Spanish and gradually pivot to English towards 8th grade. \n\nThere is no downside whatsoever to speaking another language.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I say this as a former baby, I really wish my parents had taught me Italian (I’m second generation) or really any other language when I was young. \nI’ve tried learning Spanish but I’m clearly too dumb. Even dating a native Spanish speaker for 9 years, who’s family pretty much only spoke in Spanish, got me as far as understanding what they said if they slowed way down.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Seriously! My niece speaks English, Spanish, and Croatian and knows who speaks which language in the family and switches accordingly. She's now learning French for fun. The kid is a little genius! I'm really proud of her",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "One of my cousin knew 4 languages at the age of 8 all because her parents were talking to her in 4 languages, teaching a child as many languages as you know is teh best thing to do when they are growing up\n\nYTA",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19198,
      "content": "YTA.\n\nLiving in a country for 15 formative years is a cultural connection. You don't have to be born there. \n\nYour kid will hate you forever for not teaching them Spanish when you could and they have to start from scratch at school.\nKids pick up languages so easily. \nHeck if you don't want to be excluded maybe you should learn it too! That'd be a great whole family bonding experience!",
      "id": 83,
      "comments": [
        {
          "score": 2220,
          "content": "exactly. i was born in alaska but have lived in idaho for years now. if i moved back that doesn’t mean i won’t eat potatoes",
          "id": 84,
          "comments": [
            {
              "score": 380,
              "content": "Exactly! The cultures we embrace are what shape us and how we navigate this life. \n\nAlso, potats are lyf. Just sayin' 🥔🥔🥔🥔",
              "id": 85,
              "comments": [
                {
                  "score": 15,
                  "content": "unlike popular belief we actually don’t grow that many potatoes 😂 you see way more onions then potatoes",
                  "id": 86,
                  "comments": [
                    {
                      "score": 12,
                      "content": "You mean those commercials lie?",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "As a born and raised Idahoan, I laughed. Tyvm.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 568,
          "content": "Agreed! My dad knows French fluently, but didn't teach us because he thought that he didn't know it well enough and my mom doesn't speak it. I'm still sad that I didn't learn it as a child - huge regret!",
          "id": 89,
          "comments": [
            {
              "score": 171,
              "content": "Same! Both of my parents speak Russian, but didn't teach us.. Born in Estonia, lived most of my life in Finland.. I would be speaking 4 languages now!!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 407,
          "content": "[deleted]",
          "id": 91,
          "comments": [
            {
              "score": 87,
              "content": "Knowing Spanish is an excellent advantage in picking up other romance languages (French, Italian etc) should someone want to learn those.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "That's what I was thinking too, it would be useful here in the UK but the US has a huge Spanish speaking population!\n\nI wonder if there's some prejudice against immigrants going on here? The way OP's denying her husband has any cultural ties to Spain, & the insistence that he's American feels more than a bit xenophobic.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "OP’s husband essentially spent all of his school years (save for university?) in spain, and dismisses that as irrelevant to his ties with the culture. absolutely unbelievable. if anyone lived abroad in the US from ages 4-19, you bet they’d have learned english and integrated themselves in SOME way into the culture.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "As a kid who grew up with Spanish speaking parents that didnt teach me the language, you are 100%correct! I  am sooooo angry that they didn't teach me and now they make jokes saying how its odd that i dont know Spanish but my parents are fluent",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13495,
      "content": "YTA. If he lived there for 15 years especially his formative years he DOES have cultural ties to Spain. \n\nWhy would you not want a bilingual child?\n\nAmericans are so dense they can't see the benefit of knowing more than one language. And yes I am American. 🙄",
      "id": 96,
      "comments": [
        {
          "score": 3813,
          "content": "After “he isn’t even Spanish” I expected OP to say he doesn’t know any Spanish. He lived there for 15 formative years - he’s highly connected to the country! \n\nOP, YTA. Learning another language is good for everyone, especially kids.",
          "id": 97,
          "comments": [
            {
              "score": 1274,
              "content": "Spanish is a really useful language in America too. It’s the second language. Also being bilingual protects the brain against lots of degenerative issues. There’s literally no down side apart from OP might feel left out of some conversations.",
              "id": 98,
              "comments": [
                {
                  "score": 231,
                  "content": "I went to a restaurant with one of my Spanish speaking friends. We were treated so well by the staff it’s like a real life cheat code.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 69,
                      "content": "Can confirm, speaking Spanish in my town's restaurants drastically improves service.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I’m willing to bet the downsides are her family will mock the child for speaking “Mexican”. Just a hunch.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Plus it gives the kid a leg up if he’s required to take a second language in high school and/or college.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 141,
              "content": "Yeah, exactly! Even if he didn’t grow up there, it’s ridiculous. Does OP not realize how useful Spanish is in America?",
              "id": 103,
              "comments": [
                {
                  "score": 12,
                  "content": "I’m Australian and even I recognise how helpful that would be",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Even if the language had 10 speakers it would be good, billingualism from birth is enormously beneficial.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 357,
          "content": "Yeah I’m a bit confused as to why anyone wouldn’t want their child to be bilingual when someone is willing to teach them for free!!! It’s very useful for the future plus op can learn a bit of Spanish along the way too :)",
          "id": 106,
          "comments": [
            {
              "score": 192,
              "content": "As an American, it’s because they have a touch of racism.",
              "id": 107,
              "comments": [
                {
                  "score": 22,
                  "content": "Yeah, wonder if she would feel the same if it was French.",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Yep, that's about it. Sometimes it takes the form of nationalism, which, again, is influenced by racism. I've met plenty of Americans who view the US as the peak of human culture and look down on all other cultures (especially non-European cultures). It's incredibly ignorant and one of my least favorite things about (a lot of) people in this country.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I know some people who didn’t want their kid to learn Spanish because they’re proudly ignorant flaming racists",
              "id": 110,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 253,
          "content": "OP doesn’t want the child to be bilingual because “I also feel like it might cut me from my child”. Basically they don’t know Spanish and worry the father and child will be talking and they won’t understand. \n\nOP YTA, learn the language and expand your mind!",
          "id": 111,
          "comments": [
            {
              "score": 11,
              "content": "They can use the chance to learn the language also…",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Oh for sure, OP is probably worried that the dad and baby are gonna have secret conversations without her.\n\nIf she’s so worried about not sharing that connection then she needs to either learn the language with them as well or find something she can share with the baby that’s special to her.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": ">Why would you not want a bilingual child?\n\n\nBut than she is going to loose the special connection to her child forever! /s",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I don't even understand why it matters anyway. If my completely not Spanish husband knew Spanish or anyt other language well enough to teach our child it I would just be happy for that to happen! What are the downsides? It's so bizarre this is a hill this person wants to die on.",
          "id": 115,
          "comments": [
            {
              "score": 7,
              "content": "Hatred for other cultures and people will do that to a person.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7546,
      "content": "YTA. Being bilingual is such a gift! Your child would have such a headstart. It's a huge bonus on any resume or future career.\n\nAlso you say he has no connection to Spain yet he lived there for almost all of his childhood?! That is a huge connection. He spent his most formative years there. He DOES have a huge cultural connection to that country.\n\nHonestly you sound jealous or even a bit racist",
      "id": 117,
      "comments": [
        {
          "score": 1214,
          "content": "More like xenophobic. Most spanish people are white europeans and don't suffer from racism.",
          "id": 118,
          "comments": [
            {
              "score": 901,
              "content": "tbf an american is likely going to atleast subconsciously associate spanish closer with central americans, as america has closer ties than Spain. It could be racism leaking through on that account.",
              "id": 119,
              "comments": [
                {
                  "score": 461,
                  "content": "Yeah a lot of Americans are surprised that Spanish people look white.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 182,
                      "content": "Also having to explain to americans that for central americans the relationship they have with spain culturally is not a fun loving sharing one… I mean they didn’t take the language voluntarily lol",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Its because we like to just put Spanish and Mexican on the same category, wrongly so",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "One of the more enduring Spanish celebrities in U.S. pop culture is Charo and I always get tickled when I witness people finding out for the first time that she's from Europe.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "A lot of them are surprised Spain exist and Spanish is more than just a language.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "I am surprised they are not being called mexicans too. Seems to me Americans think everyone that speaks Spanish is mexican. Hard for them to wrap their mind around a shit ton of countries existing that speaks Spanish too.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 433,
          "content": "Thank youuuu I was reading the comments like is nobody gonna say the quiet part out loud??? Like god why on earth would an American cringe so damn hard over the idea of their child speaking Spanish? I have no idea. Truly a mystery 🤔",
          "id": 126,
          "comments": [
            {
              "score": 206,
              "content": "The fact she brought up they live in America, as if Spanish isn't widely spoken here, was simply ridiculous and off-putting.",
              "id": 127,
              "comments": [
                {
                  "score": 28,
                  "content": "Very much \"Yew in 'Murrica now. Talk 'Murrican!\"",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Just to add to your point, my mother who doesn't speak a word in English spent a whole day walking around NY all by herself and managed to get by just fine speaking only in Spanish. lol.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "There are more people who can read/understand spoken Spanish than English in the US. It's insane to not give her kid a chance to learn. What happens when the kid goes to school and wants to take Spanish? Is OP going to still say no?",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Right? And even if you have 0 cultural connection to Spain, so what? There are loads of Spanish speakers in America, it will only help to be able to speak fluently with more people!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 261,
          "content": "This should be higher. \n\n\"He's American\"\n\nSo? I'm American and so are my parents. They both learned and spoke conversational German, my mom because her dad was in the Army so she lived for like a FRACTION of the time OPs husband did in Germany and my dad because he was interested in the language and culture. Paid off when he was stationed in Germany.\n\nMy husband is American... technically first generation because his dad EMIGRATED HERE FROM FRANCE. Guess who learned French just from visiting family? And guess who else learned French and speaks it with him? (That would be me). We aren't planning to have kids but if we did I would absolutely get a French au pair so the child would learn French well so they could speak it with half their family. \n\nNow for the kicker...OP, if German or French would be ok but the issue for you is that it's Spanish...\n\nPlease confront your inner biases and soon.\n\n*Edited to correct emigrate",
          "id": 132,
          "comments": [
            {
              "score": 13,
              "content": "Plus like... Spanish. In the US. How on earth will that ever be useful /s\n\nIts not like he i",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "A lot of white Americans barely learn anything relevant to other countries and perceive other languages as threatening, it's so wild. Nobody in my hometown spoke any other languages and I've been so jealous of my multi-lingual friends I've made since moving away. I've spent the past couple of years trying to get conversational in Italian and it's a slog for me as an adult. This would benefit OP's kid so much and it sucks that her xenophobia will hold her child back in life.\n\nOP, YTA.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 55,
          "content": "Seriously, I'm actually sad I'm not bilingual - it would have made learning languages a lot easier and been such an asset. I'm not native English speaker, but if I was, that would be even more a reason to want to be bilingual. Besides, there are so many Spanish speakers in America that it would definitely be useful to be able to speak both languages fluently.\n\nSo yeah OP, YTA. Do some research and after that you should have no reason not to give your baby the possibility to learn to be fluent in two languages as a kid when it is soooo much easier and faster to learn. It doesn't take anything away from learning English or anything else in life, quite the opposite.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I hope her husband teaches their daughter Spanish so they can talk shit about her in front of her face.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "The part about being worried about being cut off from her child makes me feel like that's the big motivation.  Not sure if that's because they are actually concerned the father might keep their kid from them or if they are just jealous and insecure.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "She kind of sounds dumb to be honest",
          "id": 138,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Not to mention that bilinguals have better problem-solving skills and may even be at a lower risk of Alzheimer's. Raising your kid bilingual is basically all upsides, if I or my partner were fully fluent in a second language it wouldn't even be a question.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Hi, Spaniard whose lived abroad here.\n\nYou're completely right, down to the last sentence. Living somewhere else, especially during that time in your life, will leave an emotional connection with the place and their culture. I lived abroad during my teen years and I still think of going back to some of the places I lived in (I'm currently in the US as a college exchange student for this reason.)",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Just saying, it wouldn't really be racist. More like xenophobic.",
          "id": 141,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3058,
      "content": "YTA\n\nHe doesn't have a cultural connection to the country he was raised in? Yes, he definitely does if he was there from the ages of 4 to 19!\n\n\"I told him what I told you guys above and that it would be hard for her because they are very different languages.\"\n\nBeing bilingual enhances understanding of both languages. And this will make your future child more well-rounded and more employable.\n\n\"He started arguing that there are many kids that are raised bilingual and are very smart but I also feel like it might cut me from my child.\"\n\nThen find your own way to bond with the kid! It is okay for parents to bond with their children over different things, it doesn't have to take away from your relationship.\n\nEdit: Thanks for all of the upvotes everyone!",
      "id": 142,
      "comments": [
        {
          "score": 1287,
          "content": "OP: He has no cultural connection to Spain \n\nAlso OP: He spent half his life in Spain.\n\nLmao. Sounds like OPs husband wants to teach the baby a language OP is too lazy to learn",
          "id": 143,
          "comments": [
            {
              "score": 621,
              "content": "I was also getting the impression that OP only wants their kid to speak “American” 🙄",
              "id": 144,
              "comments": [
                {
                  "score": 393,
                  "content": "Hilariously not only did he spend 15 years in Spain, he lives in the country with the second highest number of Spanish speakers in the world! The kid is missing out to NOT have the opportunity to be bilingual. \nYTA OP.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 76,
                      "content": "This is America after all. I can’t honestly imagine someone taking a chance to learn a second language away from their kid. But then again. This is America after all.",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Sounds more like xenophobic and controlling. In one comment she says she doesn't want them to be able to talk about stuff with her knowing what they say.",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "As if OP doesn’t have any capacity to also learn Spanish. Her reasoning holds no water.",
          "id": 148,
          "comments": [
            {
              "score": 11,
              "content": "Right? Spanish is considered one of the \"easier\" languages to learn at any age",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yeah I got really stuck on they are very different languages. No tf they aren't.\nEnglish and Japanese are very different languages, not English and Spanish. \n\nI'm waiting for my son to get better at Japanese so he can help me get better 🤣",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">Being bilingual enhances understanding of both languages.\n\nSpeaking any other European language enhances your English because you finally learn some grammar.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1767,
      "content": "YTA  being bilingual is an asset and completely normal for kids.",
      "id": 152,
      "comments": [
        {
          "score": 401,
          "content": "I feel so bad for the husband that not only is OP shitting on and completely invalidating his life experience, she is so ignorant that she doesn't want her child to have the additional advantage in life that is bilingualism. \n\nThere are no downsides to being bilingual. Provided OP is not a terrible mother, her not speaking Spanish will have no impact on the relationship she has with her child in any way.\n\nYTA",
          "id": 153,
          "comments": [
            {
              "score": 12,
              "content": "My husband and I were both born in the US and I plan on teaching our future kid(s) Portuguese and Spanish (and taking classes ourselves.) It is a huge asset where we live! \n\nOP is absolutely TA.\n\nYTA OP",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "And her reason is, \"it will cut me away from my child\". Woman, you too can learn Spanish if that's a real fear. And that's so short-sighted, what if as she gets older daughter decides to learn Spanish on her own, will she forbid that too?\n\nAlso, husband spent his formative years in Spain, but because he wasn't born there, he has no cultural ties to that country. That's rich. YTA 100 times over.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1650,
      "content": "Yta\n\nWhy are you so against this. Spanish is an extremely common language and would be a benefit. The high school my children went to required a second language to graduate and it’s far easier to teach them young vs as they get older. Take advantage of the fact your husband speaks another language and is willing to teach your child. You could ask him to teach you as well",
      "id": 156,
      "comments": [
        {
          "score": 538,
          "content": "She mentioned in another comment that she doesn’t want to be in a situation where she can’t understand them and she can’t learn Spanish because she’s an adult with responsibilities.",
          "id": 157,
          "comments": [
            {
              "score": 459,
              "content": "Easiest way to fix that is to embrace change and learn Spanish with her family",
              "id": 158,
              "comments": [
                {
                  "score": 347,
                  "content": "Sorry I shoulda been more clear. Her reason for not learning Spanish from him or on her own is because she “has responsibilities” when in reality she just doesn’t want to.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Yeah, the typical sad excuse. We all have the same 24 hours in a day, and many adults who \"have responsibilities\" take time to learn a 2nd language.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Oh no worries, you were clear, I just worded my comment oddly. She feels like her responsibility gets in the way when learning Spanish would actually open some doors for her.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah, so Duo Lingo subscribers who listen on the way to and from work are irresponsible children? I cannot with this OP.  \nGiving your child EVERY OPPORTUNITY FOR LEARNING POSSIBLE is part of being a responsible adult. I cannot believe she's COMPLAINING about this.",
              "id": 162,
              "comments": [
                {
                  "score": 6,
                  "content": "Yo wtf I normally listen to podcast on the way home. I NEVER considered doing that and now I’m mad cause I literally have a 30 minute commute each way to work and I’ve been there almost 2 years. The progress I could’ve had by now.",
                  "id": 163,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Ah... so that's the real problem - she doesn't want her son and husband to have a conversation where she doesn't know what they're saying. And she can't be bothered to learn also so that it's not an issue.",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1101,
      "content": "YTA. \n\nWhat if he actually was Spanish? Would you still not want him teaching her Spanish?",
      "id": 165,
      "comments": [
        {
          "score": 483,
          "content": "As if this xenophobe would actually marry a Spaniard lmao",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 187,
          "content": "I mean he literally is Spanish. He grew up there. Nationality is defined by cultural belonging and not through DNA",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "She is the kind of person who thinks the national language of USA is English and will yell Spanish speaking people to go back to their country.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 604,
      "content": "4 to 19 is a huge gap of time and the majority of your husband’s formative years - something that should be significant and understandable to a future mother. He clearly loves the country he was raised in and wants his child to have an appreciation for it as well. Not to mention the general benefits of bilingualism, mentioned elsewhere. \nYTA",
      "id": 169,
      "comments": [
        {
          "score": 104,
          "content": "Yeah it’s insane to me to try to ignore the most important part of her husbands upbringing and life and to feel a need to say “he’s and American”.. I hope this is just hormones so her husband isn’t coming to permanent negative realizations about her",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}