{
  "post content": "I (32F) grew up in a low income household and was determined from an early age to start investing and owning real estate.  I graduated from pharmacy school with minimal debt and bought my first rental property. I currently own 4 rental properties with my fiancé. We both learned how to remodel and fix basic things to keep costs low. We use the rental property money to invest in stocks and looking into buying a 5th property. \n\nMy best friend (32F) of 15 years has been married to her husband for 3 years and they have 1 child and 1 on the way. Their landlord has decided to evict them. He has given them 60 days to find a new place. They have asked if they could live in one of my rental properties.\n\nThe problem is they are not very clean people and that is one of the main reasons for their eviction. My friend has 4 cats and they pee EVERYWHERE. On their clothes, sofa and beds. They also tend to scratch the walls and  cabinets. She just says it’s just because they’re a*holes. Their current home is on the brink of being on a hoarders episode. Her husband spends his free time playing video games and does not try to help in cleaning or doing any “woman” chores. \n\nMy friend has also asked if we could give her a discount on the rent since they are about to have their 2nd baby.  Both of them work but my friend’s job  will not pay her the whole time she is on maternity leave. \n\nI told her I could give her a temporary reduction on the rent but she would not be allowed to have the cats. She said they are like her children and could not get rid of them. She said that would be like asking to get rid of her human children and I am the a*hole for even suggesting it. I told her those were my stipulations. I have been fortunate that my tenants with pets are respectful and clean up religiously after them. \n\nShe currently is not talking to me and telling our other friends that it’s my fault she is about homeless. A couple of friends have said I should make an exception but  I’ve put so much time and money into these homes. So am I the asshole for telling my friend she can’t move in with her cats?",
  "id": 1,
  "comments": [
    {
      "score": 8344,
      "content": "NTA.\nNever mix business and friendship together.",
      "id": 2,
      "comments": [
        {
          "score": 1736,
          "content": "This is the correct answer. Even if the friend was the most perfect tenant ever OP still shouldn’t rent to them because mixing business and friendships is a good way to screw up your business and lose friends.",
          "id": 3,
          "comments": [
            {
              "score": 486,
              "content": "Yes, friend has given OP a choice of whether to lose the friend, or the friend and the house. Not a great choice, but one with a clear answer.",
              "id": 4,
              "comments": [
                {
                  "score": 223,
                  "content": "Especially since the relationship would end eventually due to resentment when the friend's family eventually trashed the house",
                  "id": 5,
                  "comments": [
                    {
                      "score": 128,
                      "content": "Or when OP raised the rent again. OP said a temporary lower rent. Also, resentment for when OP wants to do renovations, rent to someone else, sell the property, etc.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Or when she gives OP a sob story every month that they can't afford rent.  She's ALREADY asking for a reduction in rent to move in.  Then OP will have to go through an eviction process to get her out, all the while the friend trashes the house.  Then trashes OP to everyone else too (as she is already).  DON'T DO IT!!!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I agree! Anything involving money usually ruins friendships. I would just let her know there are no vacancy’s at the moment. OP can’t kick out a tenant for their friend without legal repercussions.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "NTA.  I'd straight up tell your \"friend\" that if she doesn't want to end up dealing with both Animal Control and Child Protective Services for the state she allows her home to be in, she definitely doesn't want to live in one of your properties because you'll call them.  That's neglect if not outright abuse to both the animals and the children to let them live in such conditions.  Not to mention the cost to you to deep clean and repair the mess she'll make of your property.",
              "id": 9,
              "comments": [
                {
                  "score": 6,
                  "content": "Honesty is the best policy. Don't spare her feelings because she already knows her situation is horrible. If she doesn't change, her situation will never change. Your friends can't help her because she is okay with her living situation. Nope, good luck to her and her mess.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Correct and the same goes with lending money. Someone once told me-        \nNever loan money to friends and family that you can’t afford to lose.      \nBasically because people won’t pay it back then you either have to go after them legally (which will result in a ruined friendship) or you have to let it go. I have found this to be true the few times I have lent money where I expected it to be paid back.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1168,
          "content": "This. OP, text your friend, \"I'm so sorry for suggesting you should get rid of your cats to live at one of my rentals. I've thought long and hard about it, and I think it's better we simply don't mix business and friendship. I care about you too much to do that.\"\n\nThen, leave it at that. She'll still be mad, but you took the offer off the table. You won't have her ruin one of your rental properties, and you have pulled back the idea of taking away her cats.",
          "id": 12,
          "comments": [
            {
              "score": 164,
              "content": "This is the perfect answer!!! Please op do NOT rent to your friend, EVER!!!! Tell her keep the cats and keep hope alive, because if you let her in you will lose more than money. I've been in a bind and I've asked friends for help. Guess what? Not everyone said yes. And some of the no's had plenty of room. You know what i didn't do? Shit talk and guilt trip the no's. I accepted it and we are still friends. Your friend put strings on your friendship, she's not your friend your just a person she thinks she can use.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This, 100%. This person will ruin her home, and I am willing to bet that they’ll stop paying rent and refuse to leave, too. At this point I wouldn’t even trust them to get rid of the cats if they agreed to it.\n\nThey have an eviction on their record, that’s plenty of reason to say no.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 284,
          "content": "If it were me, I might be stupid enough to do business with a friend I thought I could trust, but even I wouldn't do business with someone with a history demonstrating I can't trust them.\n\nNTA You know what would happen if they moved in. Your friend doesn't have a right to demand you be okay with cat pee all over your house.",
          "id": 15,
          "comments": [
            {
              "score": 54,
              "content": " Exactly. I might be ok with friends or relatives that have shown I can trust, but in this case, just reading about the cats peeing all over, was a deal breaker.",
              "id": 16,
              "comments": [
                {
                  "score": 17,
                  "content": "For real. This is like letting a friend borrow your car when they have a history of speeding and ignoring road signs. Like yeah, you could take that risk but why bother when rational decision making suggests otherwise?",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "This week reduced rent, next month no rent, etc. You see how this ends OP?",
          "id": 18,
          "comments": [
            {
              "score": 76,
              "content": "Yup. It's \"money is a little tight this month\" to \"you know we just had our second baby and I'm not working\" to not returning calls to everything else, until you have to evict them too. \n\nThe rental market is tough just about every single place in North America. Renting with an eviction on your record is damn near impossible. But there are geared-income housing and housing that assists families who have children. Tell your friend to approach a social worker about her situation, and they will find some help.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "OP has three issues with this tenant:\n-\tthe cats\n-\tthe reduced rent ask\n-\tthat they live like hoarders. \n\nThey balked at the first one. Be glad a it just means OP doesn’t have to address the other two.",
          "id": 20,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Or with family either for that matter.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I think there are situations where business and friendship can work well, but it truly depends on being prudent about the friend and the business, and being prepared to have those disagreements and knowing how you'll let one side or the other get impacted. There are friends I would happily go into business with, and friends I know I absolutely can't.\n\nBut in OPs case, I think it's a step beyond. It's not selling jams together or even opening a restaurant together or something. How many people would allow themselves to be in a position where they are effectively in charge of whether their friend has a roof over their head? It's a lot of pressure, especially when you already have to care about the quality of life you're providing to your other present and future tenants. \n\nOP has a responsibility to her other tenants to not place a neighbour that has cleanliness issues etc. near them, and at the end of the day has to think about her own stability. If her friend causes issues in the building and that starts impacting OPs livelihood, it doesn't sound like said friend would do anything to help OP make up for costs and issues there. \n\nSo NTA.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "She's not your friend. That simple :)",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Indeed! We're renting off a couple that are our friends and one of them was my partner's work colleague! Everything related to the house were renting off of them is through an agency and we signed all the relevant contracts. Our friendship doesn't mix with business",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Also friend is AH for allowing cats to do this. I have three cats and they all use the litter box, don’t scratch walls, etc.",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2937,
      "content": "NTA\n\nAnd honestly this was a choice between losing this friend NOW or losing them LATER after they had ruined your shit and you had to evict them.",
      "id": 26,
      "comments": [
        {
          "score": 471,
          "content": "My therapist always says this when I have a hard time setting or upholding boundaries - do you want to just deal with this now or have to cut them out later? It's always just easier to deal with this sort of thing now.",
          "id": 27,
          "comments": [
            {
              "score": 7,
              "content": "Unless they’re the type to throw back those times in your face as “see I was understanding”. In hindsight she was probably just going through a lot because she was overall a great friend until then. But she hit a point that she started throwing stuff like that back and would start doing the things that another friend would do that we had both come to the conclusion that the other friend was just using me. I wish I had checked in more with her but at the time I was going through some ptsd stuff and wasn’t doing much of anything",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "I lived next door to a situation like this. The family of the owner approved the move of shady relatives to move in, and they made their money to live with scrap metal. They would keep whatever wasn't worth money. And weirdly, only owned a hammer for taking apart said object and did all their work at night\n\nYears later, when the eviction finally went through, the owner had to call a restoration company. My husband went over to the house to ask about the condition and found out that:\n1. They punched all the walls. Not one or twice, but repeatedly until not one wall wasn't covered in \"punch holes\"\n2. Cat urine everywhere\n3. Wrote phone messages on the wall with blood\n4. Had to take the entire inside down to the studs and rebuild. The restoration crew was from another state (bc no one in the state could handle the work), and they were here for two months every day during the holiday season. It couldn't have been cheap.",
          "id": 29,
          "comments": [
            {
              "score": 26,
              "content": "Wait...they wrote phone messages on the wall in blood? If they had the time to find a stabbing utensil, surely they had time to find, I don't know, a pen. I have questions.",
              "id": 30,
              "comments": [
                {
                  "score": 17,
                  "content": "We all do. I doubt we will ever get answers.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "To be fair, it message wasn't legible. They didn't even have air conditioning and we live in AZ, so a pen would be the last of their immediate concerns. \n\nWhen they finally were evicted, they put all their stuff out for bulk pickup, it was halfway down the street and piled up about 4 feet. These idiots first didn't leave open access to driveways.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I can only imagine the terror of walking into an apartment and seeing \"Judy had the baby!\" scrawled in blood on the walls.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Two words... menstrual blood.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Their neighbour was Sideshow Bob",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "There wAs a very expensive house on the water in our neighborhood that had a hoarder in it. Her two dogs would always get out. You could smell the inside of that house from the driveway. I thought the lady owned it. But one day noticed a red sticker on the front door. She was renting and being evicted. The eviction took a while. After she left, they had contractors in there ripping out the drywall. I can't imagine the extent of the damage. The contractors were in there for a few months doing work.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "sounds easier to tear down and start over. I really hope OP is reading this!",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "So true",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "My mom did basically exactly what OP did. I was close friends with her daughter, and then drifted apart as teens. When they moved out, it had turned into an animal hoarding situation. The animal piss was insane, literally dry heaving trying to clean it out. It was awful.",
          "id": 39,
          "comments": [
            {
              "score": 7,
              "content": "My mom convinced my grandma to rent to her friend and her wife. At first they were good tenants. Then they started bringing random animals in. It was a property on a berry farm so it wasn’t the worst thing at first. She had 2 goats and some dogs. The first issue was her tying the goat to the pear tree and him eating or ramming into it ended up killing the tree. She also randomly trimmed them almost to the trunk without permission. By the time they moved out there were 4 cats that were shut up in a small bedroom because they were half feral strays and their geriatric dog had had accidents everywhere that weren’t properly cleaned. And the house was so infested with fleas that within 30 seconds of walking in, your shins would visibly be COVERED in them. And of course they were worse in the back corner room where the cats were. So almost the farthest point from the entryway",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -5,
          "content": "This!!",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1880,
      "content": "Cats peeing everywhere is NOT normal. It's either health, stress, or lack of proper litter care. \n\nThat's not ok and it's not healthy for humans (especially pregnant ones!) nor is it healthy for the cats.\n\nHonestly, I wouldn't rent to someone that was evicted regardless of the cats. NTA",
      "id": 42,
      "comments": [
        {
          "score": 383,
          "content": "very true--if he won't clean and she can't clean litter because it's proscribed for pregnant women, then that litter probably hasn't been cleaned in many months?  \nand then for the pregnancy before.  It's not a wonder that the cats are in the habit of peeing anywhere they can find.",
          "id": 43,
          "comments": [
            {
              "score": 174,
              "content": "yep if her husband can’t be bothered to clean up after himself there’s no way he’s scooping the litter box(es) daily. Honestly doubt they have more than 1 litter box, which is probably also part of the problem.",
              "id": 44,
              "comments": [
                {
                  "score": 130,
                  "content": "I had 2 cats and 2 litter boxes. Instead of each using one, they used one to pee in and one to poop. I got a little chuckle every time I cleaned them.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 58,
                      "content": "omg that’s hilarious! we have 3 litter boxes for our 2 cats, and they just use one wayyy more than the others. I wish they were smart enough to dedicate one to poops and one to pee 😂",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "This is actually why they recommend one litter box per cat(Plus 1 more box).  So 3 boxes for 2 cats etc etc.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That’s exactly what our cats do!",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Mine do something similar. Two brothers, two jumbo boxes. As to why one litter box is almost empty and the other is full of piss and poop, I'll never know. They're right next to each other.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Smart furry overlords.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Mine do this too!",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I only have one cat and he does this. I bought him a covered litter box and an uncovered one when he was a kitten to see what he liked better. He exclusively poops in the covered one and pees in the other.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "My cats do that! They poo in one and then move to the second one to pee. I thought they were weird and told them so. I guess I'll need to apologize.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Besides with 4 cats, she should have at least 5 litter boxes that are cleaned regularly. We have 2 cats and 4 boxes.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It's technically only proscribed for pregnant women if the cats go outdoors at all. Strictly indoor cats have a much lower chance of contracting toxoplasmosis.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "This. Cats don't pee outside the litter box without a reason.",
          "id": 56,
          "comments": [
            {
              "score": 89,
              "content": "We have eight cats, until recently, nine, and we do not have this problem.  Those poor kitties.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Came here to say this. Considering what he said about them, it‘s probably a cleanliness issue. Cats will not go in a dirty box. What is clean? Laundry, clothes, even a bed. Those poor animals. They should be re-homed with someone who is not a hoarder.  NTA",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Intact tomcats (and females in heat) are notorious for spraying absolutely everywhere. So that might be a reason…",
              "id": 59,
              "comments": [
                {
                  "score": 20,
                  "content": "Was thinking this exactly! When my cat was small, before being neutered and when in heat, would absolutely pee anywhere she felt like it, regardless of the clean litter box. After being neutered, that never happened again.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Sometimes I think it's a territorial thing too. I had a male orange cat that would spray any of my fiance's belongings after he moved in. He was neutered and never had a problem with it before my fiance moved in. I cleaned his litter boxes every day. (I bought a second one. One for upstairs and one for downstairs). So he had multiple clean areas to go. I even bought special cleaner to clean up after he would spray to deter him from doing so again. I bought a black light so I could track exactly where he was marking. So I could clean the exact mess if I didn't see him do it directly. He was brazen at times would do it right in front of us. But it was always my fiances things his leather coat, inside his work boats, we had an extra room my fiance turned into an office. That whole room turned into a target. It was a lot of work to keep up with that kitty!!",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Exactly.  I currently have 7 adult cats (some fosters, a few mine).  One has kidney disease, one has gastro problems and the rest pride themselves on just how much poop and pee they can produce.  Not ONE OF THEM eliminates outside the box.  It’s a LOT of boxes, and the fedex ex guy probably hates me cause I buy litter in 35 lb bags, lol.\n\nThe boxes all get dumped morning and night, it’s quick with sifting trays, and goes out to the trash can immediately.  There’s no reason healthy cats should be going outside the box.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "And why OP may want to consider calling in the Human Society or whomever handles Animal Cruelty because that is an issue with not taking care of their “children” very well.",
          "id": 63,
          "comments": [
            {
              "score": 18,
              "content": "If it's that bad with the furry \"children,\" that's neglect of their *actual* children as well because breathing in all of that ammonia is not healthy.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": ">Cats peeing everywhere is NOT normal. It's either health, stress, or lack of proper litter care. \n\nMost likely the last thing. The husband is not cleaning at all, even when his wife is pregnant seemingly and OP described their apartment on the brink of a hoarder episode. So in all likelihood the litter boxes are just so dirty that the cats don't want to shit and piss in it. \n\nThey might also not have enough. I think 5 are recommended for 4 cats. That can also get expensive. All the litter they need for them and they don't seem to be rich, so another reason why they might not clean them out often enough.\n\nThe other reason you mentioned are also possible, maybe in addition to the litter box problem. Also some cats like to mark their territory. If the group of 4 cats are not harmonious, that would increase the chance.\n\nAlso it wouldn't surprise me if they don't have proper scratching posts.\n\nOP's friend said the cats are like her children, but she doesn't seem to take properly care of them. I hope she takes better care of her human children. Though letting the one already born live in an apartment with cat piss everywhere doesn't sound promising.",
          "id": 65,
          "comments": [
            {
              "score": 5,
              "content": "We have 7 throughout the house for 3 cats just to make sure.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "We have two cats and when it has happened it has been stress related (and disgusting), and is cleaned up immediately. We also rent. I can't imagine living in filth like that. Gross.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I mean some cats can be total assholes… my cat had a lovely clean try, but still decided to piss on the dogs bed, I think cause she hated the dog….she eventually stopped doing it and stopped attacking the poor dog on sight (she really hated the dogs for a couple years and even though they were just sleeping away minding their own business she would attack. \n\nHowever if that cat is pissing everywhere and anywhere that is a smell that OP will NEVER get rid of. I was offered a move by my HA to somewhere you could very clearly smell cat piss in, and turned it down since I knew exactly what my cat would do, start pissing over the top of it to mark her territory and leave her scent behind. Even the most well behaved non asshole cat would (if they exist)",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This is how I found out my cat had a bladder issue.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "You’re right, someone should call animal control because those cats deserve better.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "They might be unneutered males spraying everywhere too.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 501,
      "content": "NTA. They've shown you your own property's future, and they have no plans to change. Also, once they get in they will always be late with/not pay the rent and expect you to put up with it for friendship's sake. Do you really want to go through the hell of evicting them? Better to piss them off now and just refuse them outright.",
      "id": 72,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 469,
      "content": "NTA. Friendship is over tho. Just end it now before she moves into and ruins one of your homes.",
      "id": 73,
      "comments": [
        {
          "score": 98,
          "content": "Yep cat friend ended it when she told mutual friends you’re an asshole.  It’s done.",
          "id": 74,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "Yea, just save the money. NTA.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 365,
      "content": "NTA,  but don't let her move in at all. There is a reason she is being evicted.  She isn't a good tenant. She is already asking you to discount rent and she hasn't moved in yet. Do you really think it won't get worse once she moves in.",
      "id": 76,
      "comments": [
        {
          "score": 9,
          "content": "Yup. This isn’t something like “my best friend is about to be homeless through no fault of her own,” this is “my best friend and her family live in filth and are being evicted for it.” Of course you shouldn’t let her destroy one of your properties too.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 202,
      "content": "Oh my lord ***do not do this*** - she is preparing to take advantage of you and this would certainly end the friendship, whatever friendship there was, if it isn't already clearly over by her somehow making her wrecking her apartment and getting evicted your fault.  The r/landlord sub is ***full*** of nightmare stories of renting to \"friends\" who stop paying, wreck places, etc., and based on your story I would bet my own money you would live to severely regret renting to this person.  NTA x1000.",
      "id": 78,
      "comments": [
        {
          "score": 16,
          "content": "Yeah definitely NTA, my home has an apartment unit that I moved my daughter into and I rent the back of it (huge with separate entrance) to one of our good friends who is just naturally immaculate and quiet. \n\nMy dad passed and my son pays the taxes/utilities + $600/month to me for his house. We have a great thing going and all 3 are saving hundreds and hundreds of dollars a month compared to market rate. \n\nI am terrified one of them will decide to move. I have so many friends that have “called dibs” but they have all been nightmare tenants their whole lives. I do not want to take housing off the market but damn it makes my anxiety spike thinking about cleaning a hoard or having to evict.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 154,
      "content": "NTA. The friendship would’ve ended no matter what once she asked the question. She was looking to take advantage of your friendship which tells you how much your friendship really meant to her. \n\nYou made the right call. I don’t recommend renting to her at all - even if she gets rid of the cats. The apartment will be trashed regardless.",
      "id": 80,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 138,
      "content": "NTA\n\nThey're horrible pet owners. My cat is an ahole, but he uses his litter box appropriately and generally behaves. His asshole nature comes in his interactions with people.\n\nNot only are they horrible pet owners, but they have no respect for anything, even themselves, esp their children if they plan to raise their human children in the filth their furry children leave behind.\n\nIt sounds like your friendship is over, unfortunately, if they value you as a friend for only what you can do for them, and that's a transactional relationship, not a friendship.\n\nIt's up to you if you explain your reasons to your in common friends but you are in no way TA here.",
      "id": 81,
      "comments": [
        {
          "score": 37,
          "content": "<<My cat is an ahole, but he uses his litter box appropriately>>  Thank you for this Gem.  \nSO true for cats in general LOL",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Yeap. My friends cat is also an a-hole and he uses the litter box all the time.  He just steals all of the hair ties rather then revenge poops.  There must be thousands of them hidden behind the couch",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "NTA, she’s being evicted due to destroying the house she currently lives in, she isn’t clean AND she is demanding a reduction in rent?  You know renting to her will end badly.  So lose a friend now, or lose her later after she has destroyed your house and stuck you with $$$$ in damages.  You made the right choice.",
      "id": 84,
      "comments": [],
      "relation": "Support"
    }
  ]
}