{
  "post content": "My mom always gets the best gifts. It has been a big point of contention in my marriage for years as my wife feels that my mom should be getting gifts for her kids partners as we are older and in relationships. It took me an embarrassingly long time to realize she was right because that was just so foreign to me and i felt super uncomfortable when my in laws gave me gifts.\n\nLast year I hinted at something my wife really wanted and hoped my mom would get it, but this year I decided to set a firm boundary and not accept any gifts from my mom unless she also has gifts for my family (wife and 1.5 year old son) Now I take full accountability here. I fucked up and didn't have the conversation with my mom. I really did mean to, but life just got in the way and it didn't cross my mind until we arrived. She had my dream gift. I've been wanting a snowmobile for a couple years now and she got me one. I knew it was going to suck but there was nothing for my wife or son, so I pulled her aside and said I couldn't accept it.\n\nShe seemed really confused and said she shouldn't have to buy gifts for my wife and called it weird. She said my son is only 1.5 and won't even notice. I told her I was sorry and it was an amazing gift but she was going to have to return it. She was frigid the rest of the night and wouldn't even say goodbye. Her brother's wife pulled me aside and told me I was completely inappropriate and she would never expect my grandma to buy her anything. My uncle married her. No one else in the family did. My uncle and grandma also begged me to go and apologize to my mom and it was hard, but I couldn't. Now apparently the whole family is talking shit about what an asshole I am.",
  "id": 1,
  "comments": [
    {
      "score": 48,
      "content": "I’m going with ESH because 1) you can’t expect your mom to read your mind so this was just setting her up to fail, and 2) it’s just really weird that your mom isn’t getting gifts for your partner and her grandchild. I’m not married, but I’m pretty sure most families include spouses (and definitely kids!) in gift giving.",
      "id": 2,
      "comments": [
        {
          "score": 10,
          "content": "I was going to go with ESH too... but I kept going back and forth between she sucks for not getting the wife and grandbaby gifts to it's her money and she has the right to spend it on whoever she wants at the end of the day. I couldn't come to a consensus on that one. LOL - I get why he's decided not to accept gifts going forward, which is his right, but he should've talked with her about this at some point during the year. Terrible timing to tell her after she presented the gift.",
          "id": 3,
          "comments": [
            {
              "score": 6,
              "content": "I really don't feel like she's obligated to buy his wife gifts if she does not want to.",
              "id": 4,
              "comments": [
                {
                  "score": 5,
                  "content": "Agreed! I think it’s a little hurtful cause a small token gift to show she at least thought about her during the holiday season would be nice, but at the end of the day it is her money and she can spend it however she wants. 🤷🏼‍♀️ I have a feeling hubby won’t be getting gifts any time soon after this. You really can’t make ultimatums that require people to spend money on others. That goes over like a lead balloon. 😂",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I feel like once you are grown, gifts should be appreciated but never expected.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think that while it’s nice for parents to get something for their children’s established partners, it’s weird to expect it. OP’s wife is clearly in the wrong in her thinking here. It is odd for a mom to buy her adult son a snowmobile and get her grandchild nothing, for what is largely a children’s holiday. I’d have an issue with that.\n\nBottom line: gift giving holidays are out of control, and yeah it seems like ESH.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "OP sucks for thinking it’s okay that his mom only buys HIM gifts.  Holy cow.  His wife really had to explain that to him?",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 25,
      "content": "ESH. Who doesn't buy gifts for their grandchildren or their daughter in law? You should've had that conversation with your mother beforehand, but your mom also sucks for not getting gifts for family. (Your wife is now part of the family. That's the whole idea of marriage.) Your family is weird.",
      "id": 9,
      "comments": [
        {
          "score": 10,
          "content": "Yeah wtf the amount of comments on here agreeing is so bizarre to me. Even if I had never met the partner and it was a new relationship and I was meeting them for the first time on christmas I'd still get a cursory little gift like a coffee gift card or SOMETHING.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The idea that people aren’t buying gifts for their children’s partners or their grandchildren is so foreign to me. Recently my ex’s parents were kind enough to include a small gift for my child with my new partner in their gifts for my older two. It was unexpected but ever so thoughtful. I can’t imagine being on the opposite side of the spectrum.",
          "id": 11,
          "comments": [
            {
              "score": 4,
              "content": "Right? A few years ago, I opened my home to a friend from out of state when she and her husband divorced. Not only did my family welcome her to spend Christmas with us, but they bought her presents too. How does someone not give gifts to their own family? Especially to the grandbaby! OP's mom sounds miserly at best.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "> Who doesn't buy gifts for their grandchildren or their daughter in law? \n\nI'd assume at least a decent number of people. I guarantee my grandparents have never got my mom's husband anything and he would probably be weirded out if they did",
          "id": 13,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "YTA. Your mom has never gotten gifts for her kids' partners. Your wife convinced you it was wrong, but your mom was always that way. You didn't think it was important to set the boundary with her, and you expected her to read your mind. You should have had the conversation with your mother. You hurt her feelings for no reason.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "ESH You're mum is very strange just buying a gift for her child and not their grandson or their child's partner. I totally get why that doesnt sit well with your wife. And YOU should have had this conversation with your mum so you didnt have to cause a scene at the party!",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "YTA for being able to prevent this entire episode but forgetting and then telling your mom immediately after that you can’t accept it.\n\nShould she buy wife and child gifts? Probably, but that’s beside the point since it’s completely up to her.  Yes, you should have waited until next year.",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "YTA\n\nYour mom has no reason to believe there's an expectation that she should be getting gifts for your wife if you don't tell her. Giving gifts to children's partners is not universal and she has a right to say no.\n\nIf you had at any point told your mom that your wife felt left out and asked her to include her so she felt welcome in the family I would feel more sympathetic to you. But this was 100% your fuck up and your mom is right to be upset with you.",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA- for many reasons. \n\n1. It’s taken you years of not listening to your partner to realize that something was wrong? Years? \n2. When you finally do realize you are hurting your partner, you don’t even bother to make it a priority to call your mother which brings me to\n3. That was horribly hurtful and embarrassing to your mother and everyone else to bring up during a holiday gathering. While I do think she should have been more thoughtful and inclusive, YOU should have had that conversation privately and well ahead of a party that she was hosting and well before she spent so much money on a gift that may not be returnable and will cause her a huge hassle to return if she can. It slipped your mind? You got busy with life? Nope, I don’t buy it. If you are truly that self-centered, I would highly recommend that you find a good therapist and start working on yourself ASAP. It sounds like you may have been raised that way, as your mother is also very self-centered. In the meantime, you owe everyone around you an apology.",
      "id": 18,
      "comments": [
        {
          "score": 0,
          "content": "> It’s taken you years of not listening to your partner to realize that something was wrong? Years? \n\nI did listen. We did discuss, but it just seems so foreign to me. I really am struggling to understand it, and honestly I feel pretty sad, like I'm not even my own person anymore and can't even have my own relationship with my mom. It still feels weird to me. I guarantee neither of my grandparents have ever bought my stepdad or my aunt a gift, so that is my normal",
          "id": 19,
          "comments": [
            {
              "score": 5,
              "content": "No one said you couldn’t have a relationship with your mom. If she wants to get you a special gift, but not anyone else, your birthday would be an appropriate time to do so. \n\nYour grandparents doing the same thing helps explain why your mom thinks that way, but it does not make it right. You keep saying that’s your normal and you don’t understand, but the second your wife explained that it isn’t normal, that it’s actually hurtful, is when you should have realized. Instead, you keep doubling down. \n\nIt isn’t acceptable for your mother OR your grandparents to have done this for so long. The fact that the other people have not wanted to speak up does not make it any more acceptable. Now you do know, so do better for your family.",
              "id": 20,
              "comments": [
                {
                  "score": -5,
                  "content": "> but the second your wife explained that it isn’t normal, that it’s actually hurtful, is when you should have realized\n\nAnd of all the people I've talked to it was pretty split, so no it isn't some universal norm and a lot of people were concerned that my wife was being entitled. Even now that I've chosen to back her it really doesn't feel right to me. It isn't about other people not wanting to speak up either. It is about no one in my family likes fake relationships. My stepdad and aunt would be mortified if they had to get gifts out of obligation",
                  "id": 21,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You're NTA but I can see your Mom not getting anything for your wife but she should for her grandchild. Even if it's only something small, since the child is so little.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Your mom gets you an enormous gift and not even a book for her grandkid?",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA\n\nAs is your wife. Look ever family has different gift giving traditions, my family has a weird split one. Dad's side gifts are only given to children/parents, not siblings or spouses, and even then it's pretty limited (only two out of several did it until I was in my teens). Mum's side no gifts for spouses, only children/parents/siblings, and even then limit of how long for, and not all siblings do it.\n\nJust because your wife expects something gives her no right to demand it. I give gifts to my sibling's spouse/partner, but I don't expect it from them. Because that's just my way of doing it.\n\nGift giving is about the giving, not demanding a gift.",
      "id": 24,
      "comments": [
        {
          "score": 2,
          "content": "Agree",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "YTA \n\n  This is just a clash of different family traditions and expectations. You've likely made your mother feel judged as well as rejected. It's not her fault your wife's family do things differently. As long as she's not singling anyone out, she should be allowed do what she's always done. Does your wife buy her a separate gift too?",
      "id": 26,
      "comments": [
        {
          "score": -7,
          "content": "> Does your wife buy her a separate gift too?\n\nNo, but she doesn't need to as it isn't like we are asking for my mom and her husband to each get us a gift.",
          "id": 27,
          "comments": [
            {
              "score": 2,
              "content": "So your mother gets a gift from you and you get a gift from your mother. That seems fine. Is it that your wife ends up being responsible for buying your mother's gift instead of you? That might make you a lazy partner and disinterested son. It isn't your mother's fault (well, it could be but you're grown now). If this is the case, your mother might not be aware her DIL spends so much time on her (and you so little). You should have accepted the gift.",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "What did your wife get your mam?",
      "id": 29,
      "comments": [],
      "relation": "No"
    }
  ]
}