{
  "post content": "My roommate has helped me a lot in the past. Im hard off, and jobless. He invited me to come stay at his house for however long I need. He's bought food and little things I needed also gave me his old phone when it cracked. I found out I was pregnant recently and applied for food stamps, I get $192 a month. I'm trying not to eat crap food (he only buys pizza and fast food) and buy things when I need them. It's the 16th and I've already gone through it. I'm not sure if this is because I suck at budgeting or maybe too generous. Probably a bit of both. I don't mind sharing, I just can't as much anymore to make things last. We live with three other people. Two out of these three have stolen from me multiple times money/food. I'm suspicious a lot. It kinda makes me seem like a real asshole sometimes.\n\nLast night I kinda freaked out on him. \n\nI made dinner before he got home and put the left overs in the fridge. He came in with an iced coffee and asked to use my honey. (Gross but ok) just please don't use a lot, it's exspensive. (He knows this because it's the 3rd bottle Ive bought because he uses so much) So later I walk into the kitchen and he's got my left over eggs in a bowl, a brand new thing of bread opened when there was one already opened next to it (arrg!) \"Please don't eat my eggs I was saving them for tomorrow. Also did you not see the already open bread?\" He starts apologizing saying he didnt see the open bread (eyeroll) says he'll put the eggs back. He starts apologizing again, I tell him it's okay I overreacted but I'd really appreciate if he'd ask me before taking things.. he says something along the lines of, \"he didn't think he was like the other roommates and thought him and I were on a no questions about food basis.\" I said, \"Well yes, you're not like the other roommates, but I've told you multiple times I have to make this food last as long as possible and I really don't like people taking things without asking.\"\nNext morning. I wake up to eat my left over bacon and eggs from dinner. Open fridge, eggs are in the same bowl he dumped them into the night prior, no cover over them just in the middle of the fridge. I had them in a ziplock in my drawer, so that's a bit aggravating. Nevermind it, continue looking for my bacon, there were 6 pieces left. Gone. I'm pretty mad at this point. I ask him about it he says he didn't eat them. Okay.. but we've been the only ones home? \n\nI'm trying hard to just let these things go. But bacon is one of the more exspensive things I bought and I didn't even eat the majority of it. Ive pretty much keep having to beg him to just ASK me before taking things. \n\nAm I wrong for being upset? Should I just let it be since he's done so much for me? I feel like an asshole being so bent over food.",
  "id": 1,
  "comments": [
    {
      "score": 17,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "Should've mentioned he doesn't pay rent either. Neither do the other three. It's his mom's house that she's no longer living in. She still pays electric, water etc. We're all moving out soon so no one is expecting for me to have my baby there. I'm saving money to get my own place.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 3,
                  "content": "The bottom line is she isn’t paying rent, And that’s still only thanks to him.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "ESH - look, in an ideal world, your friend wouldn't take your food, but dude. He's letting you stay rent free, he lets you eat any of his food, no questions asked, and he's (presumably) about to let you and a newborn stay, for free. That is... a lot. Living with a newborn is insanely difficult for the parents, let alone a friendly roommate. I think you need to let it go if he occasionally shares some of your food.",
      "id": 6,
      "comments": [
        {
          "score": 5,
          "content": "Not to mention that he helps her with food.  And gave her a phone",
          "id": 7,
          "comments": [
            {
              "score": -6,
              "content": "He works at a pizza shop and brings home pizza three or four times a week. That's it. Also, to say thank you for the phone I do his laundry and clean up all his messes. That's getting old though.",
              "id": 8,
              "comments": [
                {
                  "score": 6,
                  "content": "Wow, you really are sounding like a spoiled brat. Doing his laundry and cleaning are getting old huh? You know what else would get old? Being a homeless, starving pregnant woman. Stop being such an entitled mooch and pull your weight any way you can, because your friend is helping you out way more than you seem to realize.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well said.  Everything she has to keep her alive comes from either this guy or the government taxing working people to give some to her.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "You're right. Thankfully all of us will be out of this mess soon.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I forgot to mention no one there is paying rent. It's his mother's home. No one is expecting me to have my new born live there, we all have to leave soon. I'm saving money to get my own place. Just trying to make the money I receive for food last so I don't go into my savings.",
          "id": 12,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "YTA\n\nIf you were paying rent it'd be a different story but you can't really get too upset if he's helped out with your food, given you a phone, etc.\n\nSide note - bacon is not a budget food. You need to buy rice, lentils, and veggies. Easy to have enough food for a month on that budget if you stick to cheap staples like that",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "I forgot to mention no one in the house pays rent. It's his mother's house. She pays electric water etc., and everyone has to leave soon. I'm just trying to make the money I receive for food last so as to not dip into my savings. I also clean up after everyone. Everyone there is pretty dirty. I also clean his room just to be nice and do his laundry since he works late. Not that it really matters. \n\nAnd yes, I know. I put it back twice before finally justifying the cost and placing it in my cart. I know it's a luxury item. I just haven't had any real home cooked meals in awhile and I guess was a little selfish with buying it.",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "It’s not your place, it’s his moms and he generously invited you in.",
              "id": 15,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "Uhhh I hate to say this I really do but YTA. How much more will he have to help you when your baby comes? Why are you even having this baby if you can barely feed yourself and rely on government assistance?",
      "id": 16,
      "comments": [
        {
          "score": 2,
          "content": "He's not helping me with the baby. Everyone in the house doesn't pay rent. It's his mother's house and she expects all of us out of it soon. I'm trying to make the money I receive for food last as to not dip into my savings so I can get my own place. I'm only 2 months along, I don't think anyone, especially him, think he's going to have to care for the baby. \n\nAlso, I don't have to rely on assistance, it just helps.",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "Oh okay. Probably should have mentioned that you're saving up and moving out soon in your post. That does change things.",
              "id": 18,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "YTA.  You're not even a roommate, you're a mooch.  Take, take, take, and when he eats a little of your leftovers you freak out even though you said he also helps you out with food.  And a little tip-bacon is a luxury and most definitely not healthy",
      "id": 19,
      "comments": [
        {
          "score": 8,
          "content": "Truth. $192 per month is a very small amount, but buying things like bacon is a bad way to spend that. Meat should be a rare treat on that kind of budget. However, I think that her friend should probably be considering the fact that she's so hard-up right now that she truly needs everything she's got, and not take the little that she has.",
          "id": 20,
          "comments": [
            {
              "score": 2,
              "content": "True, except she says that he buys her food and little things that she needs.  If I were him and I was allowing a friend to live rent free, bill free, and I gave her a phone and I buy her food and little things (I'm assuming soap, shampoo, etc) and she got mad at me for eating a few leftover eggs and was rolling eyes when talking about it?  I'd be pretty pissed",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It definitely was am item I never ever buy. I've been looking at pictures of BLTs for the last month and idk I gave in. Also, my roommate is a very sweet and compassionate person. He's not upset or angry with me for being upset or angry with him. He's almost too nice, that's why I feel like such an asshole for being so stingy about my food.",
              "id": 22,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Should've mentioned no one there pays rent. It's his mother's house. And we all have to leave soon. I'm saving money to get my own place, so I try and make the money I receive for food last so I don't go into my savings. \n\nAlso, I know bacon is not healthy. I bought it as a luxury knowingly.",
          "id": 23,
          "comments": [
            {
              "score": 3,
              "content": "That sounds a little better, but the eyeroll kind of set me off after all he's done and is doing for you",
              "id": 24,
              "comments": [
                {
                  "score": 0,
                  "content": "Lol I didn't do that in person. Just writing it agitated me. I don't understand opening a new thing of bread when there's the same kind right next to it already open.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Am a man, done this before. Some people's eyes work like crap looking for food lol. Maybe you can determine it was done on purpose, but I'd wager unintentional.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "I know you didn't roll your eyes in person, but you did it behind his back to a huge group of strangers, like he's some moron for opening a $1.50 loaf of bread.  How can you even have any inkling of moral high ground here?  This guy gives you a place to stay for free.  He helps you with food.  He helps you with other costs.  You don't pay for water, heat, electricity, gas.  He gives you a freaking cell phone.  You can't take care of yourself.  Then you go and have unprotected sex and get knocked up and are adding a baby to the mix.  The money you do have for food isn't earned, it's taken from other people, people who go to work every day and earn it, only to have the government take some and give it to you.  You earn nothing, yet you have some sense of superiority over a new fucking loaf of bread being opened when there was another open one.  Wow.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "esh\n\nby your words, hes helped you out a ton. from his point of view, you're probably being an asshole after all hes done for you. on the other hand, he should also realize how hard up you currently are and try to be more mindful. i mean, you're counting number of eggs and strips of bacon. if you're this hard up, how is your child gonna get fed? go apply for work at a temp agency, fast food, medical assembly line, whatever you need to take care of your future kid.",
      "id": 28,
      "comments": [
        {
          "score": 2,
          "content": "Yes, he definitely has. Also, I kind of know I'm being an asshole.. I just really don't want to be eating pizza for a remainder of a month if I run out of food, (he works at a pizza place.) I work for courier service right now. So every bit is being saved for a place. And if I do run out of food, which more than likely will happen, I won't use that savings to buy more, if hes bringing home pizza every other night for free, (free for him too.) I'm just saying it would be nice if he understood I'm trying to make my food last as long as possible. I guess I'm just being selfish.",
          "id": 29,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "[removed]",
      "id": 30,
      "comments": [
        {
          "score": 1,
          "content": "It's not his responsibility and it's not like he's eating all of it and leaving me with nothing. I just want him to understand that I'm trying to make it last as long as possible for myself. I don't mind sharing every now and then when I can, but just taking without asking doesn't work for me.",
          "id": 31,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA for acting entitled and selfish here. This guy is literally letting you live with him rent-free and as you said, provided you with a phone and food! This guy is basically a guardian angel for you, and you have the absolute gall to yell at him for eating a few eggs and \"expensive\" honey? Why are you buying expensive honey when you are struggling to make ends meet anyway? A lot of things in your post, from the way you phrased things to the amount of times you talk about how angry and irriated you are make you appear extremely ungrateful. You would be out on the street if it wasn't for him, so yeah, I think if he eats a couple of your eggs and a piece of bread you should let it go. Even if this occurs regularly, you are getting the far better end of this deal and if you keep starting drama you run the risk of losing this pretty sweet setup you've got.  \n\nAlso, I would work on your budgeting as you really should be able to survive on $192 a month for food if you are spending it wisely. If you're only making it halfway through the month, you're doing something wrong. Try to buy things that are cheap in bulk like rice, beans, frozen chicken breasts, etc. Bacon and honey aren't exactly cost-effective and are luxuries that you might need to go without until you get a stronger foothold on your finances.",
      "id": 32,
      "comments": [
        {
          "score": 1,
          "content": "He really is a saint. I didn't yell at him though, just very agitated voice. I don't yell. And I guess the reason I posted about the most exspensive items is because I knew they really shouldn't of been bought and he consumed most of them. But none the less I understand what you're saying. I do need to be more grateful.",
          "id": 33,
          "comments": [
            {
              "score": 3,
              "content": "Okay good, just wanted to make sure you were aware of his generosity and didn’t take it for granted, sorry if I was harsh in the original post. Good luck to you with the pregnancy and I hope you get back on your feet soon!",
              "id": 34,
              "comments": [
                {
                  "score": 1,
                  "content": "It's okay. This post has really made me see what an asshole I've been. And thank you!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "I’m not going to chime in on if you’re ta because I think everyone else has it covered.  Think about planning out many of your meals.  If you are in the US, look into getting WIC.  Being on food assistance, you’ll automatically qualify.  If you can keep it in your room, do it.  \n\nGo on Craigslist and get a small used fridge for your room.  Read the ads, try to buy on sale.  \n\nYou’re also pregnant and you’re going to be emotional.  That’s okay.  Just do your best to keep those feelings in control.  If you are able to plan out your food, buy him a dozen eggs or two in a month just for him or some other thing as a treat when you can.",
      "id": 36,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 37,
      "comments": [],
      "relation": "No"
    }
  ]
}