{
  "post content": "Hey everyone, throwaway for all the usual reasons.\n\nMy wife  (F45) and I (M44) are hosting Christmas Day this year. She is a successful lawyer, her sister who is coming from out of state with her family, is also a lawyer and her husband is some sort of high flying consultant for a mining company. \n\nThey have never said anything directly to me, but apparently the sister has often told my wife that they both think I am not good enough for her, presumably because I don't have some corporate job. I do just fine, but I do work a lot....I am working on Christmas eve, and then again on the 26th. On Christmas day I will probably get up around 5am to start cooking, since among other things, I'm going to BBQ a brisket and some pulled pork, which take a long time. I love firing up the smoker, and I've always been complimented on my BBQ, even by said inlaws.\n\nSo here's the thing. My wife told me the other night that the brother in law recently did a stint in rehab. It came up when she was talking to her sister the other night about Christmas she had mentioned organising alcohol for the day and did her sister want anything in particular. Her sister replied that BIL had just gone through rehab, so she wasn't going to be drinking. She also said it would be great if we could all have a \" dry Christmas\" to make it easier on him.\n\nMy wife was obviously nervous about asking me since I suspect she had a good idea of my answer,  but when she floated the idea I laughed and said there was absolutely zero chance of me not having a few drinks on my one day off when I'm going to be cooking all day. \n\nAs I said, I'm working the next day so it's not like I was planning some huge bender.\n\nWe had a huge fight about it. \n\nShe thinks I'm being difficult and it wouldn't be that hard. I reminded her that these people don't even particularly like me, and they're coming into our home, and if he couldn't handle being around alcohol at all, maybe he should still be in rehab.\n\nOn reflection the last bit was a pretty mean thing to say but I was quite emotional by then.\n\nTell me true Reddit....AITA?\n\nEdit after many comments. \n\nAs I said somewhere below, I am not a heavy drinker, and I was not planning on getting loaded. I won't need to hide alcohol in a different vessel or anything like that. I recognise my answer was more out of spite than any issues with going for a day without drinks.\n\nI said my wife was nervous about asking me, probably because she knows how much I like to chill with a beer or two while I'm bbqing. To the people who twisted this into her being scared of me....it's really not like that.\n\nI didn't provide extra details on the BIL and SIL since the stories on here are often long, but it isn't just a vague feeling that they look down on me. I  could provide many examples but one that comes to mind is last time they were here, he was talking about his new car and then said, 'what year is your truck from?'\nWhen I said it was a 2009 model he replied, \"Oh man, I can't believe that thing still runs. Must be like driving an antique. Do you need a special license?\"\n\nStuff like that is pretty constant when they visit.\n\nOnce when they were here I took him golfing. He kept trying to get me to bet with him on particular holes, which I refused. That evening when SIL asked him about our day, he said it was OK,  but could have been more 'interesting'....clearly referencing my non betting.\n\nI have apologised to my wife for the fight and acknowledged that I was out of line.",
  "id": 1,
  "comments": [
    {
      "score": 1410,
      "content": "Nope NTA\n\nReally rude for your SIL to even ask that you have a dry Christmas in YOUR HOME, honestly.",
      "id": 2,
      "comments": [
        {
          "score": 467,
          "content": "IMO the request is absolutely ridiculous. The SIL and BIL are asking OP to give up part of his Christmas celebration on his only day off for the holiday, and for an alcoholic who has been perfectly clear that he doesn't even like OP. Fuck that. Let him manage his own alcoholism at home if he can't handle it.",
          "id": 3,
          "comments": [
            {
              "score": 60,
              "content": "Has he been “perfectly clear” about not liking OP?  It seems like a game of telephone that this guy isn’t even involved in, I feel bad for him.  Holidays are tough on recovery.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "OP just needs to cancel them coming and enjoy his one day off in peace.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -5,
              "content": "[deleted]",
              "id": 6,
              "comments": [
                {
                  "score": 37,
                  "content": "OP is working the days before and after Christmas. He has one and only one day off for the holiday. He will be spending that day at his own home cooking for guests. OP deserves to be able to enjoy his holiday how he wants to in his own home, which for him includes having a few drinks throughout the day. Asking him not to do so is unfair.   \n\n\nAdd to that the fact that he is being asked this by two people who have openly stated that they do not like OP and do not think he is worthy of having married into the family. BIL's alcoholism is his to manage, asking someone he views as inferior to him to manage his alcoholism for him is plain fucking ridiculous. If it will be too difficult for BIL to attend a family gathering where the homeowner has a few drinks throughout the day, BIL isn't read for family gatherings this year.",
                  "id": 7,
                  "comments": [
                    {
                      "score": -8,
                      "content": "[deleted]",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -9,
              "content": "How has he made it \"Perfectly clear\"? OP's wife has told him that they think he could have a better job. They don't treat him poorly, they don't berate him or even say mean things to him. \n\nAnyone who can't go without alcohol for 24 hours has a problem themselves.",
              "id": 9,
              "comments": [
                {
                  "score": 18,
                  "content": "OP talks about alcohol and Christmas in a way that implies he pretty fuckin' regularly goes 24 hours (or even longer) without alcohol. OP's problem isn't that he can't go a day without alcohol. It's that it's Christmas in his own home, and he wants to be allowed to have a few drinks to celebrate on, again, *his only day off* that he gets to celebrate.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": "She just asked though and said it would be nice / easier for BIL presumably since he just got out of rehab snd is still in early stages of dealing with his alcoholism. It doesn’t sound like she insisted or made it a mandatory condition of their attendance. It sounds like OP’s wife is the one that agreed to it and decided they would. SIL initially  just said that she wouldn’t be drinking because of BIL having just been in rehab so there wasn’t anything specific they should get for her to drink. The way it’s worded too, op could be saying that his wife is the one that came up with dry Christmas for all thing. But even if it was from the SIL I don’t think it’s an AH move to ask - if the answer was a no and she had a problem that’s another story maybe but just asking, isn’t inherently obnoxious.",
          "id": 11,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "Honestly, the fact that your wife is inviting ppl who insult you over, and hasn’t shut that bs down yet makes her a huge TA.",
          "id": 12,
          "comments": [
            {
              "score": 2,
              "content": "You are a lucky person who doesn't have to face any family AH at Christmas.",
              "id": 13,
              "comments": [
                {
                  "score": 8,
                  "content": "If I had a family member who continually disrespected my s/o, the would absolutely not be allowed in my house, and if my s/o allowed that towards me, they would no longer be my s/o.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'm not saying you're wrong and fair play to you if you manage to live by this rule I'm just saying families are usually a little more complicated and (especially at Christmas) everyone has to put up with a couple of AH in the family. These guys don't sound like great company for OP but equally I don't think (and clearly the OP doesn't think either) that they've been insulting enough to be banned from the house.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "wife. and they are family",
              "id": 16,
              "comments": [
                {
                  "score": 0,
                  "content": "thank you! edited. ive need reading way too many AITA posts while averaging 3 hours of sleep this week.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "My nieces husband is “dry”. My sister always buys sparkling grape juice for their family. That way he can enjoy toasts, but not be tempted to drink.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agree. And someone who is serious about recovery will recognize that their recovery can not be dependent on what other people are doing.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 20,
          "comments": [
            {
              "score": 14,
              "content": "Stolen from u/Kaiser93",
              "id": 21,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "Not sure why you're being upvoted so much, alcoholism is a disease, a bonafide illness. \n\nIt's the equivalent of someone with a severe nut allergy asking them not to have nuts at a dinner party? It's not an entirely unreasonable request?\n\nSIL is simply asking for support from her family to potentially get BIL through a life saving process. BIL has allegedly been a bit flash with his earnings around OP but does he deserve a death sentence for that?",
          "id": 22,
          "comments": [
            {
              "score": 6,
              "content": "Yes, alcoholism is a disease. No, it's not like a nut allergy. That's fucking ridiculous. A nut allergy can harm you if you ingest trace amounts of peanut dust. OP having a couple drinks doesn't potentially harm the BIL in the same way.\n\nThe SIL could have just left it at \"we won't be drinking, my husband is in recovery.\" Presumably this is the same thing they do when they go to a restaurant and are sitting next to a table whose patrons are enjoying adult beverages. Instead, she wants a dude who is going to spend his only day off -literally- catering to her and her husband to not enjoy his day as he sees fit. In his own home. It's rude as fuck.\n\nAnd I didn't ask for the upvotes, so *I guess you got me there*.",
              "id": 23,
              "comments": [
                {
                  "score": -2,
                  "content": "\"His only day off\" as though OP hasn't said he's working 2 days? he could be off the 23rd and the 27th for all the info we have... \n\nI'm not sure where your info is that they're going out to restaurants and asking people to stop drinking? Or why you're making that assumption? I'd say it's opposite ends of the scale to ask a stranger to stop drinking compared to asking your family for support? \n\nI don't think you have any grasp of addiction if you think it's rude as fuck...",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1,
                      "content": "On the contrary, when they go to restaurants, I'm sure they DON'T ask other patrons not to drink. \"We won't be drinking\" is the only thing SIL needed to say.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "A single reecees pieces could kill me. These two arent the same",
              "id": 26,
              "comments": [
                {
                  "score": 0,
                  "content": "And a relapse \\*could\\*kill BIL?",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -8,
          "content": "[removed]",
          "id": 28,
          "comments": [
            {
              "score": 12,
              "content": "Stolen from u/Slow-Management9570\n\nBad u/ngedmondvxczed",
              "id": 29,
              "comments": [
                {
                  "score": 2,
                  "content": "u/EinsTwo doing the Lord's work over here",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 561,
      "content": "Nah NTA. But yeah, could have been nicer. \n\nThey don’t like you, but that attitude all but ensures that they’ll never like you.  And worse it makes your wife side with them.   As a compromise you could have said you’d only have a drink or two while you bbq, and you won’t flaunt drinks in their face. \n\nI get it’s your day off.  And you should be able to relax.  But it’s also the holidays.  Nobody gets to relax lol.",
      "id": 31,
      "comments": [
        {
          "score": 16,
          "content": "Nicer ? They invite themselves into his home on his day off and expecting him to cook. \n\nIf the roles were reversed everyone would call him a sexist. \nIt’s “their” home, but she didn’t bother to care to ask if he feels alright having them in their home. \nShe didn’t bother to ask if it’s alright if he cooks for them it was expected from him. \nThen the sister-in-law had the audacity to go into someone’s house and uninvited and expect them in to behave in their own home on their day off as well cook for her. She can F off .",
          "id": 32,
          "comments": [
            {
              "score": 82,
              "content": "Where does it say they invited themselves?  It sounds like it’s just the OPs turn to host.  They’re family after all.",
              "id": 33,
              "comments": [
                {
                  "score": -7,
                  "content": "Yeah. Of course he can.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -15,
                  "content": "So your wife can have guest over that you don’t like and expect you to match their life style without caring how you feel about it nor ask you about it. \n\nIf you are single you can do what ever you want. But this is a marriage. If she feels obligated to please her sister husband that’s on her.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 30,
                      "content": "A wife can have her sister and her family over for Christmas.  Welcome to marriage.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "... have you read a completely different post to the rest of us?",
              "id": 37,
              "comments": [
                {
                  "score": 1,
                  "content": "Let me see.. Reading about the A that doesn’t give a f about their spouse feelings because theirs matter. And then reading about the A that broke up and then married the cousin. And the A that’s claiming the pregnant girlfriend ruining his day. Then the A that thinks bonus money should go to bills while his should go to his hobby’s. Damn",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Yup, what’s wrong with a drink or two. \nShow you can drink responsibly. And if BIL wants a drink remind him that he’s an alcoholic and his wife said he can’t have any.",
          "id": 39,
          "comments": [
            {
              "score": 144,
              "content": "***If BIL wants a drink, remind him of the hard work he did he rehab, and remind him being sober is an ongoing choice.\n\nSIL saying he can't have any removes the autonomy and consequences from the recovering person. He's an adult.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -5,
          "content": "He did say he wasn’t going to go on a bender. Meaning tipsy/buzzed but not drunk. Which would be around 2 drinks.",
          "id": 41,
          "comments": [
            {
              "score": 3,
              "content": "2 drinks? Not everyone is the same.  I’ve seen lots of people get wasted off 2 drinks and I’ve seen people drink 24 beer and show no sign of drunkenness.  Op could be a alcoholic and drink all day to get a buzz.",
              "id": 42,
              "comments": [
                {
                  "score": 1,
                  "content": "Well damn I didn’t know we had all the details from this internet post! Glad to know I was just making a completely stupid assumption based off what we were told whereas you and everyone else must know.\n\nI just used my personal experience on what I’ve seen with 2-3 drinks but fuck me I’m fucking dumb right? Not like you didn’t just say you’ve seen people in your own personal experience need more than 2 drinks to be buzzed. Fuck me for that right?\n\nLike fuck guys sorry I did not sit here and analyze every word to deduce on ASSUMPTION that he’s some alcoholic asshole who needs to put down a fifth and a mini keg all by himself!",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -1,
                  "content": "[deleted]",
                  "id": 44,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I suspect he’s not, it probably wouldn’t be such of problem if that’s all it was.  Also, the fact that he had to clarify that he’s not going to get wasted.  I kind of get the opposite impression. I feel like op is in fact a heavy drinker and had to be asked not to drink.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 449,
      "content": "[deleted]",
      "id": 46,
      "comments": [
        {
          "score": 490,
          "content": "You're seeing just one day.\n\nHubby is seeing that he's spending his one day off in a high stress situation: cooking and spending time with people who look down on him.\n\nIf you want to be able to ask someone to dry out their house for your benefit, don't be the kind of person that makes someone want to drink.",
          "id": 47,
          "comments": [
            {
              "score": 136,
              "content": "Exactly! If they don’t want people to drink then maybe they should be hosting",
              "id": 48,
              "comments": [
                {
                  "score": 41,
                  "content": "This is very on point actually. \nIf its that important host the party and set your rules 🤷🏻‍♀️",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -62,
                  "content": "Do you only go to gatherings to drink?",
                  "id": 50,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Lol, no, of course not. But it’s mildly ridiculous to ask someone to change what they’re doing in their own home. He didn’t say he was going to suggest drinking games, but there’s no reason he should t be able to have a few beers while he cooks for everyone",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "I don't only go to gatherings to eat, but I wouldn't cancel Christmas dinner because my asshole brother-in-law decided to join overeaters anonymous.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "No but I do have a variety of alcoholic, nonalcoholic, and caffeinated beverages in my home to offer guests. The host should decide whether their party is dry or not.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "I think it's more about the fact they don't seem to respect OP but want him to accommodate them.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "\n\n>don't be the kind of person that makes someone want to drink.\n\nGood one!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Holy fuck that last line is perfect. I was at my gf’s (M) house for Thanksgiving and her brother (B) and his family were there. It was my first time meeting B and family and honestly, they’re a circus. M and I both had drinks and B made a comment to M’s mom about it (in Portuguese, M’s Brazilian) and this line just brought me right back to that",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "If hubby can't handle being around his inlaws without alcohol, then BIL isn't the only one with a problem.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "> That being said, asking someone to go one day without drinking is not really asking that much.\n\nIf the in-laws were hosting it wouldn’t be asking that much. Asking for someone to restrict the menu just for you and go without drinking in their home where they are doing the hosting and cooking and all the work on what appears to be one of their limited days off isn’t a small ask, it’s a very entitled one.",
          "id": 58,
          "comments": [
            {
              "score": -19,
              "content": "Okay no it isn’t. \n\n“Hey I’m deathly allergic to peanuts could we not have them?”\n\n“Fuck you no stop being entitled we eat peanuts in this house!”\n\nAlcoholism is not a choice & if he falls off the wagon is might kill him. Asking for OP not to drink for one day is not a ridiculous ask. OP can say no & then hopefully they don’t come but asking is not rude.\n\nEdit: I realize peanut allergies are not the same as alcoholism. My point is that people can ASK to have their issues accommodated without it being rude (what the comment above me said). If they demand it’s different but asking if people would be willing to do something that would help you stay healthy (aka skip alcohol) isn’t rude. It’s obviously on BIL & SIL not to go if alcohol is being served & that’s too difficult for BIL. \n\nAlso for the recovering alcoholics who can be around alcohol without any issue that’s awesome. Some can’t (especially right away) so assuming everyone’s recovery journey is the same as yours is wrong.",
              "id": 59,
              "comments": [
                {
                  "score": 95,
                  "content": "Peanuts do not have the same social significance as alcohol. I have rarely asked friends to join me for a cup of peanuts on Christmas Eve, although maybe I should.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Also, simply seeing peanuts don't trigger the allergy.  Not the same thing.  Just ask if they can respect his disease, and not trigger him by drinking openly.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -27,
                      "content": "If a person can’t celebrate Christmas without having a few drinks, BIL isn’t the only one with disordered drinking.  OP either seriously hates these people (in which case, don’t spend Christmas with them!) or he’s got problems of his own.  Any way you look at it, someone needs to cancel this Christmas get together.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -33,
                      "content": "If someone in my family had a pine tree allergy I wouldn’t just leave the tree up because it’s “Christmas tradition”\n\nAlcohol isn’t more important to Christmas traditions than the health of family members. \n\nBIL has an alcohol problem & asked if they could avoid it on Christmas. OP said no & hopefully BIL/SIL make alternate holiday plans so BIL doesn’t risk his health.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "A medical issue you have no control over (like a nut allergy) is not the same as being an alcoholic. Choosing to consume alcohol is a conscious choice. Your body having an adverse reaction to a food is not. \n\nVery insulting to compare these two wildly different things.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I do not agree with the nut allergy comparison at all, but your depiction of true addiction as something that is a matter of conscious choice for the addict (which he clearly is as he was in rehab) is wildly off-base. The whole POINT of Substance/alcohol consumption getting to the point of being an addiction vs. someone who is not an addict (even if a heavy social drinker) is that the CHOICE to stay away from the substance is beyond them. They cannot just \"take a break\" \"walk away\" or stop without help of some kind. And this guy just got out of rehab...a really dangerous time.  Not saying it is impossible to be around alcohol as an addict, but it causes a lot of people to relapse. It often takes people years before they can do it. Still, it is on him to decline, not have the expectation of a dry environment. It's fine they asked but it's fine they were told no. Still, he really has no business being in the presence of his drug of choice at this point. SUCH a bad idea.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Alcoholism is a medical issue. Do you think people drink themselves to homelessness & death because they feel like it?",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Alcoholism (aka alcohol use disorder) is a medical issue that you have no control over. The lack of control is what makes it alcoholism instead of a drinking habit. It literally changes your brain chemistry to make it very very difficult to say no to a drink: https://www.therecoveryvillage.com/alcohol-abuse/faq/why-do-alcoholics-drink/ \n\nBIL is making the responsible, healthy choice by keeping himself away from situations where he is more likely to relapse, just as someone with a peanut allergy is making a reasonable, healthy choice by avoiding situations where they might be around peanuts.\n\nEdit: to be clear I don’t think anyone in this situation is acting maturely. Definitely a light ESH for the dismissive/gossipy ways they are communicating their preferences/boundaries. I’m just saying that not being around alcohol is a healthy decision for BIL atm.\n\nTho it’s also totally reasonable that SIL was the one to communicate the no alcohol rule since she was already talking to OPs wife about the Christmas gathering.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Awful comparison. Cross-contamination with nuts is easy. There was a girl on here not too long ago who had to go to the hospital because her moron boyfriend ate a Reese’s then kissed her.\n\nBut OP’s cocktail isn’t going to accidentally end up in SIL’s husband’s glass unless SIL’s husband puts it there. If OP was making rum cake or planning a pairing menu where every course was served with a specific wine then I’d agree but that’s not the case.\n\nAlso, people with nut/food allergies learn to manage their allergies and carry EpiPens for the fact that they know they can not expect or ask the world or others to be nut/allergen free. What SIL & husband are doing is basically the opposite.",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Omg, stop. It’s not even close to being a peanut allergy. As a sober person for many years myself, it is fine that she asked and fine they said no. It’s OP’s one day off for the holidays and if he wants to have alcohol, he is allowed. Yes, it seems like it’s not a big deal coming from the addict’s perspective, but only one person has the problem. When I got sober, I lived in a house with my actively alcoholic mother and there was alcohol everywhere all the time. If you want to get sober you will and if you don’t, a little alcohol at Christmas isn’t going to change that.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Some people need a stricter avoidance of alcohol (especially at first) & if BIL needs that he should make sure his environment is alcohol free (in this case by just skipping the holiday). \n\nCongrats on your sobriety it’s an impressive feat.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "\"Alcoholism is not a choice & if he falls off the wagon is might kill him.\"\n\nThen if he can't resist temptation when no one is offering him alcohol maybe he should still be in rehab.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 12,
                      "content": "He just BARELY got out of rehab. That is the single most dangerous time for someone with an addiction. He shouldn't necessarily still be in rehab but he shouldn't even think about going to a party where there is alcohol. That can take someone in recovery years to master. But it is on them to decline the invitation, not expect everywhere he goes to be alcohol-free. It would be a kindness if it were dry, but it is absolutely not a reasonable expectation to have someone do.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Wow I hope you didn't strain any muscles reaching for that peanut analogy\n\nAsking somebody, Who you don't already like, to do something in their own home on their only day off is unreasonable",
                  "id": 73,
                  "comments": [
                    {
                      "score": 4,
                      "content": "They’re probably just figuring out if they will be attending so asked about an accommodation before canceling. Demanding would be rude but asking isn’t.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "YOUR sobriety is never anyone else's problem or responsibility. If you cannot be around temptations then you do not get to go out. That's how it works, it may sound cruel but it's completely enabling behaviour to expect the world to warp around your personal needs and addictions. An alcoholic is never truly recovered, but a \"recovered\" alcoholic can exist around alcohol and not drink. OP's BIL is NOT ready to be going to festive parties. You don't jump out of rehab right back into parties and celebrations, you continue working on your addiction every single day. And if that means 1 smaller christmas where it's just you and your wife/support group, then that's fine. \n\nAgain, YOUR sobriety is NEVER to be anyone else's responsibility or problem. YOU are the one who needs to know your limits and take that step back until you are recovered enough to actually function around triggers. It takes literal years after leaving rehab to actually recover from alcoholism, and it's something that never actually leaves you entirely.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Again just to recap - BIL made a request to make the gathering safe for him to attend. OP said no. OP’s wife is angry. We have no idea how BIL feels & can only hope he now decides not to attend because that’s best for his sobriety. \n\nYou can say OP’s wife is an A but BIL didn’t demand anything (request is not a demand) & it doesn’t mention BIL pushing back on the “no” answer at all. \n\nIf the wife is mad at OP because SIL & BIL can’t attend that’s only the wife’s problem & no one else’s. OP can’t blame the BIL for wife’s anger since alcoholism is not a choice & as you rightly pointed out BIL needs to make decisions that keep him healthy & safe (asking if ppl would be willing to not drink then not coming if the answer is no).\n\nEdit: this is also a family gathering where he presumably felt safe asking for accommodation. It isn’t a massive party.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Anyone else getting flashback to Randy Marsh in a wheelchair? \n\n[Randy has a \"disease\"](https://youtu.be/h0TfqpCYei4)",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -2,
                  "content": "Yeah I agree with this. There’s nothing wrong with the request. OP doesn’t have to agree to it, but it’s pretty weird that OP can’t go one day without alcohol. If having a couple of drinks is this big a deal to him he might want to examine that.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Who said he can't go one day? That is a very large jump to claim someone who you know nothing about might have a drinking problem based off this one post. A post where even OP says they have to work the next day so they're not getting schnockerd. That statement says control not alcoholism.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "Thank you! A lot of the people saying N T A seem to have no courtesy regarding addiction or think that the host is some authoritarian dictator. Additionally, both wife and husband are hosting and the wife clearly wants this. OP should be more willing to compromise.",
          "id": 80,
          "comments": [
            {
              "score": 50,
              "content": "No just guests that shit on family are the dictators that make demands. He isn't making any demands. He's saying no to theirs.\n\nThey need to come to the table with a compromise, not him.",
              "id": 81,
              "comments": [
                {
                  "score": 19,
                  "content": "OP's problem right now is his angry wife not his BIL/SIL making a request. Currently she is the one fighting with him about it. I'm not sure why so many ppl are shitting on SIL/BIL when it sounds like they just asked. I would assume they asked because they won't attend if it's dangerous to BIL's sobriety. \n\nHopefully they just don't come. It will be better for BIL's health. If OP's wife is angry that still isn't BIL's fault. That's between them.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My opinion is NTA. And I say that as the wife of an alcoholic with 6 years of sobriety. My husband has been successful in his sobriety because he knows that it is *his responsibility.* Not mine or anyone else’s. I can still go out and have a few drinks at a concert and my husband isn’t going to relapse as a result. And if he did, and tried to blame me, I would remind him that his choices are his alone and that his sobriety is his journey. How can an alcoholic own their success if they can’t own their mistakes? \n\nSuggesting that everyone should stop drinking around an alcoholic takes the onus of sobriety off of the alcoholic. And makes it really easy for the alcoholic to blame others - “if you had not been drinking I would have stayed sober.” Nope, that’s not how it works.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Nah, he shouldn't have to bend over backward on his one day off for someone who clearly doesn't respect him in the first place. If they want a dry Christmas, they can stay home.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "They are demanding he doesn't drink. In his own home, while he does all the cooking, while the look down on HIM? FUCK THAT.\n\nnot making it obvious vs not doing it all are miles apart.",
          "id": 85,
          "comments": [
            {
              "score": 18,
              "content": "Did they demand or just ask?",
              "id": 86,
              "comments": [
                {
                  "score": -3,
                  "content": "I don't consider asking with emotional blackmail an \"ask\"",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Your sobriety is never anyone else's problem or responsibility. End of story.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "The exception for one day that you're asking OP for is the one day of the holidays that OP is not working.\n\nOP should not be expected to have a dry Christmas in his own home on his only day off because his BIL is a former alcoholic. I say this as a former alcoholic who went to rehab - others can take all the precautions to prevent a relapse as they want, in the end the only person who can prevent a relapse is the individual in question. I was a sneaky drinker, nailing the stereotypes like hiding booze around the house and such, and I was going through a 26 (750ml) every 2 days. My friends were supportive and avoided drinking while I was getting well, but I honestly wish they'd have just kept going on as normal. It felt like people were changing their routines just to not set me back and to a certain degree that made me feel like a burden, like I was ruining their good time by not drinking. Those types of intrusive thoughts led to my one and only relapse during my sobering. These days I can consume moderately without going back to the excess, but I can say from a personal standpoint that simply removing alcohol from the premises is not always the solution people think it is.\n\nIf an alcoholic wants to drink, they will find a way to make it happen.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "As someone who has a parent and cousins I’m close to who are addicts OP is NTA. The in-laws are rude and speak down to him and look down on him. OP has to work Christmas Eve and the day after he has 1 day off and he wants to drink. They’re mean people and OP wasn’t wrong to say what he said. OP wants to relax a bit while having a holiday off while being around people who make him need a drink. If the in-laws and wife want OP to accommodate the BIL then maybe they should’ve been nicer/shut down the rude stuff sooner.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 184,
      "content": "NTA, but how about going an extra mile and drink alcohol out of a tumbler? That way he doesn’t get triggered, and you still get your buzz. Just an idea.",
      "id": 91,
      "comments": [
        {
          "score": 35,
          "content": "That’s what me and my husband do since my parents don’t want us drinking around my addict brother.  I honestly hate catering to him especially since he himself says he is fully recovered and never really had an *alcohol* problem.   However my parents insist and that’s why we don’t host and always show up with Yetis.  My parents probably know what’s in there but since we aren’t waving it around or acting foolish they don’t say anything.",
          "id": 92,
          "comments": [
            {
              "score": 16,
              "content": "This!! Any time you see the Purple Yeti in my hand, I can guarantee you it’s not water.",
              "id": 93,
              "comments": [
                {
                  "score": 3,
                  "content": "I drink my coffee and my booze out of the same Pink Tervis, so it's a gamble.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Best compromise I’ve seen in this thread so far 👏🏻",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "My thought exactly.  Don’t hide it but be discreet and BIL won’t have it shoved in his face.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 104,
      "content": "NTA. It's your home and your only day off and it's Christmas for crying out loud. That said, why did it come up only now, when Christmas is almost upon us? If they were serious, or simply more considerate, they would have addressed it sooner. I'm imagining it may have gone differently if it was addressed right when plans were initially being made.",
      "id": 97,
      "comments": [
        {
          "score": 15,
          "content": "This too! Like they're soooooo close with SIL and BIL that they don't even know about he rehab stint until now? Ooooookay!",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "Or maybe they didn't think going without alcohol for 1 day would be a big deal.",
          "id": 99,
          "comments": [
            {
              "score": 2,
              "content": "Any other day I think would be not a big deal. Such as any of the other days before or after Christmas. \n\nBut it's a holiday, and the husband's one day off that whole time who otherwise has to work throughout the holiday season. And it's a guest demanding it not the host.  It's almost the equivalent of the sister being a guest at their wedding then demanding the bride and groom to have no alcohol at the event because the sister's partner just got out of rehab. \n\nAny other day it would be no big deal. Given the context it IS too much to ask. If I were the husband I would have reacted the same way and laughed at the request.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 86,
      "content": "I wonder what would have happened if the wife had not asked her sister about the alcohol.\n\nSounds like they normally have alcohol for christmas, but the sister didn't say anything about rehab etc. until the topic was brought up to her by OP's wife. \n\nChristmas is already close, planning should be done for a long time by now. If it was important to SIL, she could have adressed this earlier. \n\nNTA",
      "id": 101,
      "comments": [
        {
          "score": 18,
          "content": "I thought this too.\n\nIf wife hadn't brought it up and just done a alcohol shop and offered them wine or beer on arrival, then what?",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 73,
      "content": "ESH- it’s probably not appropriate to ask the family to do that at a group event, but you also suck if you can’t go a day off cooking without drinking so much it’s a mocking “absolutely no chance”",
      "id": 103,
      "comments": [
        {
          "score": 156,
          "content": "It’s his one day off, having to work all 6 other days probably. He has a right to enjoy it in his own house. If addicts can’t handle their addictions then they should be the one to stay away from the thing not ask others to keep it away for them. In my experience not enough addicts take enough responsibility for their own choices that landed them in the situation in the first place. SIL and BIL could have simply said hey we’re just gonna celebrate at home instead of trying to make an entire house cater to one persons problem then caused them selves.",
          "id": 104,
          "comments": [
            {
              "score": 29,
              "content": "I mean they might still say that & stay home. They just asked if people would be okay with it. My family has done dry holidays for recovering people. Skipping drinks for one day really isn’t a big deal to us & if it makes everyone feel welcome it’s worth. OP feels different but SIL & BIL weren’t out of line to just ask.",
              "id": 105,
              "comments": [
                {
                  "score": 34,
                  "content": "Some of us skip drinks every other day of the year and look forward to Xmas where we can eat,  drink and enjoy each others company. \n\nYou could have a birthday cake without candles, but then it's just a cake....",
                  "id": 106,
                  "comments": [
                    {
                      "score": -9,
                      "content": "To each their own. Alcohol isn’t an important part of Christmas in my family (or a part at all some years) but clearly it is to others.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "That's the point - the inlaws have already made it clear they don't welcome OP in the family.  Why should OP bend over backwards for the assholes?",
                  "id": 108,
                  "comments": [
                    {
                      "score": -2,
                      "content": "I didn’t say he needed to. I just said they’re allowed to ask & that I personally would make a different choice.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -17,
                  "content": "Skipping drinks for one day isn’t a big deal unless you have your own issues with drinking…",
                  "id": 110,
                  "comments": [
                    {
                      "score": 22,
                      "content": "OR it's nice to have a few beers in your own home on your one day off while cooking dinner for the whole family. \n\nHe's not doing shots and beer bongs in the living room. Implying that someone who wants to have a few beers over the course of a day on a holiday has a drinking problem is absurd. Especially if it's for someone who doesn't even treat him well in his own house.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Don't be ridiculous. The one day is Christmas--his only day off in the whole holiday season. Not everyone who enjoys a drink on a feast day is an alcoholic, and the choice between a few beers while grilling and an asshole brother-in-law seems like an easy one.",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "There is 0 indication OP is an alcoholic. It is quite clear in this post he isnt going to overindulge. However, let's pretend your leap is true and OP is an alcoholic who cannot go 1 day without a drink. Forcing that in an uncontrolled setting is actually quite dangerous and can be detrimental to his health. Either way you slice it his wife is being unreasonable.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -3,
                      "content": "Yes. my thought exactly. who can't go one day without a drink?",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Why should he have to? It’s his day off, he can relax and have a couple beers and cook.",
          "id": 115,
          "comments": [
            {
              "score": -27,
              "content": "He doesn’t have to, but I do think a better answer re family members, for better or for worse, is not an automatic absolutely not. There was no give on his part, no consideration or empathy. So while he doesn’t have to, he could. And that could be a big step in proving his in laws wrong about him and making his wife happy, instead of being stuck in the middle.\n\nEdit: missing word",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "He sucks for wanting to have a couple drinks on his day off? A day where he’s cooking and hosting? How?",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "It would’ve been ESH if they were people he cared about. Given the circumstances, solid NTA. Not the people to bend for at all.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It's not just any day off though is it?\n\nIt's Christmas where op is already hosting.\n\nIt's thier 1 day off from Christmas",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is the second comment I've seen conflate \"can't\" with \"doesn't want to.\" OP enjoys having a drink or two while cooking and he wants to enjoy that this year, as well he should. I'd choose to skip alcohol at Xmas for someone I loved, but not for a relative I didn't even feel comfortable around.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 56,
      "content": "Sorry, but YTA. \n\nYour BIL just got out of rehab, and they are asking you not to drink for one day, not an extended period of time, or never again when they are around. \n\nYes, it is your only day off, but part of being a family is doing small things to help others. Your wife has told you that they don't like you that much, but you don't say that they have ever done anything mean/rude to you, and I think it is a little odd that they seem fine with you but your wife has told you that they \"often\" talk about you. That feels like something you should take up with your wife. \n\nIf they have been fine to you, clearly like you enough to come over and compliment your BBQ, why wouldn't you take this opportunity to extend an olive branch? Clearly BIL has had a rough time, so how great would it be if you sat BBQ'ing with him with a soda and chatted? \n\nAsking for one dry day-even if it is your only day off- is not an AH thing to ask, and your reaction was overly hostile even if you didn't want to say yes to their request. It also seems important to your wife, so not just her family but HER, and you couldn't give up a few drinks for her, and went too far in your fight with her. \n\nIt's all about your reaction to the request that makes you the AH in this scenario, even if at the end of the day you were still going to have a few drinks.",
      "id": 121,
      "comments": [
        {
          "score": 76,
          "content": "Sounds like this is his only day off over the holidays. Its a lot to ask.",
          "id": 122,
          "comments": [
            {
              "score": 50,
              "content": "Specially for a person who looks down on him",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "It's not. It's alcohol.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "He's TA for how he reacted. If he wanted a drink he can choose to keep it away from his BIL or keep it discrete. Just simply offer to compromise since everyone else involved seems pretty amicable to a dry holiday.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -19,
              "content": "How is it a lot to ask? He would rather fight with his wife then refrain from having a few drinks on one day? That's absurd.",
              "id": 126,
              "comments": [
                {
                  "score": 55,
                  "content": "Conversely, his wife would rather fight with him and demand he rearrange his one day off to accommodate the BIL who's been nothing but disrespectful to him than ask her sister to make alternate plans",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Its not just any Saturday. OP has mentioned how much he works. It is his only day off over the Christmas period, in my family asking for a sry Christmas for the sake of one person would be a big deal because everyone works and we rarely get days together where everyone can unwind without thinking about work.",
                  "id": 128,
                  "comments": [
                    {
                      "score": -22,
                      "content": "There are other ways to unwind than by drinking alcohol",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It’s most definitely a lot to ask from a person who continually disrespects OP, and wants to come over to OP’s house.",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Would you accommodate people who had been outwardly disrespectful towards you, family or not? I would genuinely like to know the answer. \nIt would be one thing if OP had a strong relationship with these people but it seems that is not the case. \nAlso, as someone who has struggled with more than one addiction, it is NO ONE else's responsibility to maintain my self control. It is on me. \nOP is NTA and although the request could be seen as not entitled in a different family dynamic, when it comes to this situation, OP owes none of these people anything. Including his wife (unless she has somehow defended him to her family which was not mentioned)",
          "id": 131,
          "comments": [
            {
              "score": 5,
              "content": "OP says that his wife says they don't like him, not that they have been disrespectful to him directly. I think that's odd, but that's what they wrote, so I'm going with it. \nTo answer your question directly, yes, I would accommodate the wishes of my partner, who is the one who asked in this case, regardless of whether the request was coming from family who didn't like me. I value my partner's feelings, the end. \nAnd no, it is no one else's \"responsibility\" but we all make concessions to support those around us. This is one day, and right after they got out of rehab. I think that warrants more care than a request to never drink in front of him again.",
              "id": 132,
              "comments": [
                {
                  "score": 22,
                  "content": "If my partner actively chose their family who don't like me, over me, they wouldn't be my partner. \nKnowing full well how the family feels about him and being hesitant to ask in the first place tells me that the wife asks him to accommodate these people often. She knows it is unfair and asks anyways. That is not being a supportive partner. \nAlso to say you're going off what they said EXACTLY, what makes you think that people who have voiced their dislike of a person to the wife would be magically nice to them? There is obviously things not being said here and you will never convince me that you would genuinely do this for someone you actively know doesn't like you. \nAgain anyone saying YTA clearly has better family dynamics than OP and cannot actually relate.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 8,
                      "content": "So I am making the following assumptions:\n1. OP loves his wife, and regardless of family dynamics, the two of them have a good relationship. \n2. The relationship with BIL isn't soooo bad if they are spending the holidays together. \nBased on those two things, I just can't imagine reacting like OP did if my partner asked this question. That's it, that's what my judgment is really based off of. My partner has toxic family members that they have cut off, I have family that is deeply problematic. Both of us have deep substance abuse running in our families. If he made this request of me, even for a family member that didn't \"respect\" me, I would do it. For my partner.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "or she knows he's a big drinker and would refuse to not consume alcohol no matter what the reason.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "They have not been outwardly disrespectful towards OP. He wouldn't even know they think he should have a better job if his wife hadn't informed him. He doesn't OWE them anything, but why wouldn't you want to help a family member who has gone through a bed situation?",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Am important consideration is BILs disrespect and contempt for OP.  For me, bending over backwards for someone who thinks I'm beneath them is simply not something I could do.  \n\nBear in mind my family, happily and without complaint, didn't serve alcohol at Christmas for decades because one family member (who was always kind) had overcome alcoholism.  Bottom line - you reap what you sow.  BIL has done nothing to warrant this consideration.   Imagine what BIL would say about OP is situations were reversed.  OP can drink what he likes on Christmas.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yes. And there’s always a compromise to be made without unilaterally shutting down the request. Maybe you can drink a few beers while cooking and preparing the food and then the BIL shows up for the actual dinner which can be dry. YTA for not entertaining any compromise for something that’s a big deal.",
          "id": 138,
          "comments": [
            {
              "score": -4,
              "content": "yes! We're talking about a serious addiction here and one day compromising, just don't drink around the BIL. Also by not compromising on something that could cause a serious issue, you're probably just going to make things worse with your in-laws. Try to find a compromise and then I would lean NTA, but right now YTA.",
              "id": 139,
              "comments": [
                {
                  "score": 10,
                  "content": "There is no real compromise here though.\n\nDrink or not drink.\n\nBest compromise would be OP doesn't host",
                  "id": 140,
                  "comments": [
                    {
                      "score": 0,
                      "content": "There is a compromise. He could drink during the day and the BIL comes later for just dinner. BIL doesn’t have to be there the whole day if the compromise could be that they just come for a portion of the day",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "All of your advice only applies to ppl who dont think theyre better than others cause of their status/money.",
          "id": 142,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "Exactly, do it for your wife not your in-laws.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 42,
      "content": "NTA - my sister is a recovering alcoholic and my parents would never have any alcohol around because of her. They actually requested I didn't serve alcohol at MY wedding. That didn't happen. \nI'm empathetic, but if you can't handle being around alcohol then you shouldn't go out. It's ridiculous that people should not be able to do what they want because someone can't control themselves.",
      "id": 144,
      "comments": [
        {
          "score": 7,
          "content": "But the BIL just got out, this isn't the same as an ongoing old problem.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "I think there are levels to it. A wedding is one thing but a small family get together for the holidays is another. ESH",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "Controlling our impulses are our own responsibility no one elses. Coming from an ex pot head I'd never tell someone to not smoke around me that's my problem and if the thought overwhelmed me that much I wouldn't go. NTA.",
      "id": 147,
      "comments": [
        {
          "score": 11,
          "content": "A little off topic but I would say smoking around someone is different then drinking. Unless they are drinking a ton or getting right in their face you’re not gonna smell the alcohol on them where as you will smell weed. Then again I wouldn’t tell someone they can’t smoke in their own home, I would just excuse myself.",
          "id": 148,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -14,
          "content": "Addiction is a serious thing though: being courteous around someone struggling with it is something that you should do. You don't HAVE to but the point of this subreddit is to talk about who's more in the right. Additionally, just because you did not struggle with addiction doesn't mean someone else doesn't.",
          "id": 149,
          "comments": [
            {
              "score": 19,
              "content": "Oh believe me i did struggle, thing is me and you just disagree on this point. Imo if its most other days of the year do a nice thing and dont drink but its christmas, he's working either side of xmas day and its his home let him have a drink.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}