{
  "post content": "So recently I've uninvited my brother(29) to my wedding after his behaviour with regards to inheritance from our recently departed grandmother. \n\nOur grandmother died (it sucks but was expected) and I sh*t you not 2 days after she had died, he's \"explaining\" to me how much inheritance we are getting. This was also my mother's birthday. Literally 2 days afterwards. \n\nHe'd googled the price of her assets and looked at the will (not because he was asked to but he wanted to see what he was getting) and \"done the maths\"\nAfter pointing out how disgusting his behaviour was I excused myself and left as I don't have time for that. \n\nFast forward to a group chat created by another brother to try and smooth things out before the funeral. This did not go as planned for that brother. Within 10 minutes I'd been told I need to to get both sides of the story but it's ok because I'm getting married so I can say as I please.\n\nI'm a very black and white kind of person, I say things how I see them and if I offend someone, well then be offended. At no point had I provoked him yet me getting married clearly was a cheap shot from him and that didn't sit right with me. So I told him where to stick it and while he's there to throw my wedding invite out.\n\nNow fast forward again to the day of the funeral. Family members are telling me to clear the air. How our grandmother wouldn't want this.  Normal guilt tripping stuff. \n\nAt no point had he made an effort to even attempt to justify his sh*tty behaviour but here at the funeral I'm the bad guy for uninviting him? Both of my grandparents would be turning in their graves if they could see how he is acting. \n\nSo AITA for uninviting him? Most of my family think I am\n\nEdit: Out of all my brother's (5 in total) we have the least communication between all of us. His behaviour over the years has never been great (committed fraud with other family members ID and that's barely the start) but the moment our grandmother passed he was all of her things. The cheap shot about how I can say as I please as I'm getting married made no sense but it was the final straw for me.\n\nEdit 2: After speaking to my mother this morning I have just found out he has taken a loan out with the intention of paying it off with his inheritance. We buried my grandmother 3 days ago. \n\nEdit 3: This is one of many issues over the years on this side of the family. They have always been drawn towards drama and as we've gotten older I mainly see most of them at funerals and weddings. Our uncle wasn't involved in the funeral because he'd been arrested for breaking into our grandmother's. I hate the drama and I don't want to be a part of it.",
  "id": 1,
  "comments": [
    {
      "score": 597,
      "content": "Op -\"At no point had I provoked him\"\n\nAlso Op -\"After pointing out how disgusting his behaviour was I excused myself and left as I don't have time for that\"\n\n\"I'm a very black and white kind of person, I say things how I see them\" Me too Op.\n\n  \nAnd I think your story is sus fight me",
      "id": 2,
      "comments": [
        {
          "score": 101,
          "content": "Please see my comment above asking for more info. I totally agree this seems a little sus.",
          "id": 3,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -185,
          "content": "Ok oversight on my part and challenge accepted",
          "id": 4,
          "comments": [
            {
              "score": 77,
              "content": "Aw, sorry OP. I thought \"challenge accepted\" was in response to my other comment asking for your bros to get invited into this to give their views. I think you meant \"fight me\" was challenge accepted, yeah?",
              "id": 5,
              "comments": [
                {
                  "score": -117,
                  "content": "🤣 yes I accepted the fight",
                  "id": 6,
                  "comments": [
                    {
                      "score": 35,
                      "content": "What was your brothers side of the story that he wanted to say in the group chat?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Okay. Judgement put on hold for the moment.",
              "id": 8,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 178,
      "content": "I’m not sure what happened here. Are you saying your brother said that you feel like you’re getting married so you can do what you want? \n\nI think ESH, unless I’ve missed something.",
      "id": 9,
      "comments": [
        {
          "score": 238,
          "content": "For being a “black and white” kind of person, OP’s writing is very murky grey.  All I understood is that this family is big on drama.",
          "id": 10,
          "comments": [
            {
              "score": 53,
              "content": "Yea that's because it's just another way of saying my way or the highway.\n\nPeople like that just mean they're a dick to anyone for any reason.",
              "id": 11,
              "comments": [
                {
                  "score": 8,
                  "content": "\"If you can't accept me at my worst then YoU DoN't DeSeRvE Me At mY BeSt.\"",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Black and white thinking isn't common so I dont believe she has that issue cause it's not a good thing to have and it's not about saying something blunt to hurt people it's the fact we think a certain way and it's a yes or a no and we can't see the grey side of things. It's really an annoying thing to have",
              "id": 13,
              "comments": [
                {
                  "score": 9,
                  "content": "I have bpd and it always irks me when people think \"black and white thinking\" means the same as \"tunnel visioned and self righteous\"\n\nBlack and white thinking has literally ruined my life. Ive ended friendships over a single argument and stayed with abusers because of single apologies because i dont see people as \"good but does bad things\" or \"bad but does nice things \", i see them as \"evil and can never be good again\" and \"flawless and can never hurt me\"\n\nIve lost everything down to FAVOURITE FOODS and PAIRS OF SOCKS I CAN TOLERATE WEARING because of how extreme my love and hate for things is. \n\nOp doesnt have black and white thinking. He feels justified in being a dick because he pulls no punches.\n\nThis whole post is waaaay too biased to actually judge imo",
                  "id": 14,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Me too with the bpd!! Thats why whenever I see it I'm like...no you got no idea what black and white thinking is. It fucking sucks. We have to go through so much to deal with it. And yeah this person just wanted to bash someone in the post. It's pretty sad.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "Oh, you din't miss anything, we got nothing.\n\nThat's the central point of the conflict and I have no freaking clue what it means.\n\n>Within 10 minutes I'd been told I need to to get both sides of the story but it's ok because I'm getting married so I can say as I please.",
          "id": 16,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "My opinion is that OP is leaving parts out of the story that may make them seem like they are to blame.",
          "id": 17,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 124,
      "content": "ESH. \nBeing a black and white person doesn’t mean you have to be a jerk and offend everybody. You’re creating drama for no reason.",
      "id": 18,
      "comments": [
        {
          "score": 51,
          "content": "> Being a black and white person doesn’t mean you have to be a jerk and offend everybody.\n\nYeah thats just AH behavior and also i cannot follow anything they are saying.",
          "id": 19,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "It's not black and white thinking at all btw",
          "id": 20,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "^",
          "id": 21,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -23,
          "content": "I don't see what somebody's racial make-up has to do with this, though.",
          "id": 22,
          "comments": [
            {
              "score": 8,
              "content": "it’s not a racial thing. Black and white means very clear with no ambiguity. Perhaps it refers to newspapers.  Actually, I think it more means right or wrong. It’s either this or is that. Doesn’t leave room for gray areas, such as nuance.",
              "id": 23,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 54,
      "content": "ESH.\n\nYour brother's behavior was disgusting. But escalating immediately to uninviting someone from your wedding is a relationship-ending move and seems excessive unless there is far more history with your brother than you are telling us.",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 38,
      "content": "NTA\n\nThe funeral didn't even happened and he was already building sand castles with \"his inheritance\". It's rude, greedy and selfish. The grandparents would have changed their wills if they could. At least now you can see how he thinks of the people he claims to love.\n\nETA: He's not even in the will, your mother is. So 2 days after the death, on your mother's birthday, in her presence, your brother thinks he is within his rights to talk about \"his inheritance\".",
      "id": 25,
      "comments": [
        {
          "score": 6,
          "content": "It's certainly fast moving. My mum experienced it. Her mum died and within hours her siblings were emptying what they wanted from the house.\nI remember she was heartbroken because stuff her mum promised her had disappeared when it came to it",
          "id": 26,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 24,
      "content": "Let me put it this way.\n\nYou are **NTA.**\n\nIt's frankly disgusting behavior to lose the matriarch of your family and have your eyes immediately fixate on the value of a payout.  Now, with that said, I also think you should clear the air with your brother unless you plan on going no contact for the remainder of your life.  \n\nI'm speaking from experience here.  The last thing you want on your wedding day is the gray cloud of a tumultuous family relationship floating around.  Also if you are planning on having any relationship in the future, you'll regret that he wasn't there.  \n\nNow for the future.  Your brother is extremely concerned with inheritances.  You now know this about him and should prepare for the inevitable future with your own parents.  Make sure your parents know that after witnessing his actions upon your grandmother's death, you want their last will and testament to be explicit with its' beneficiaries in order to avoid any arguments.  If everything isn't written out, I get the feeling your brother will be looking for any excuse to increase his portion of your parents' assets.  Which is grotesque, but it's my situation as well.  My brother's already plotting for my parent's houses and assets, meanwhile he's so unreliable that I'm the sole trustee.  See if you can do the same.",
      "id": 27,
      "comments": [
        {
          "score": 9,
          "content": "See I agree with this. I would not want to hear someone talking about how much money we'd be making off a recently departed family member. And if I was close to that member?? I would probably lash out. With the facts given, I think OP is NTA. The brother's behavior IS disgusting and inconsiderate, yet OP should give consideration?",
          "id": 28,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I see all this so much in my future. My only sibling is so incapable of handling things that I am executor of both my parents wills. And has repeatedly demonstrated how he sees our parents' as there to provide for him and to enable his lifestyle and I can see so many battles coming when the worst happens. \n\nThink I might have a chat with both my parents about how their wills have been written out.",
          "id": 29,
          "comments": [
            {
              "score": 2,
              "content": "Have your own ideas on how you’d want their assets handled before you approach them. It’s macabre, but letting my parents know that their houses will stay in the family. That their collections will not be sold off. And that preservation of the trust for future generations, is the plan.",
              "id": 30,
              "comments": [
                {
                  "score": 2,
                  "content": "I would absolutely never tell my parents or anyone else what I would want to happen to their possessions and assets after their death. That's just as bad as how my brother behaves and it's  very disrespectful. My parents are adults and can make their own decisions which I intend to respect. \n\nI will however ask my parents to be very clear about their intentions in their will so that my brother can't argue or try to guilt trip me when that time comes.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "This is why I have been up front and very vocal with my kids about my will and how I want thing done. I want to do my best to ensure no hurt feelings after I’m gone.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "[removed]",
          "id": 33,
          "comments": [
            {
              "score": 2,
              "content": "Where did I say that?\n\nInheritance should be a family meeting hosted by the Grantor.  Not speaking about inheritance before it's needed is what gets people into family destroying arguments about who-gets-what.\n\nAre you asking me if after a family member dies, if you should be pricing-up your inheritance and joyfully telling your siblings how much money your getting, at the birthday of your Mother whose own Mother / MIL just died, then yes.  That is not the place to talk about inheritance.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Of course not. But there's a big difference between 2 days after a death and \"never\". But then again, you know that don't you?",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "ESH.\n\nYour brother sucks because his behavior was inappropriate, but you suck for escalating to uninviting him to your wedding, which can easily end any relationship.",
      "id": 36,
      "comments": [
        {
          "score": 0,
          "content": "This in a nutshell but want to add one more thing: your mom is grieving losing her mom.   Adding to that by her 2 offspring not speaking to each other - because that would be the result of your not reversing your position on the wedding, adds more to her angst.    \n\nOp was right, but escalated instead of sitting brother down and asking him to drop the subject until the estate is settled.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "You say you called his behavior disgusting, but somehow think you didn't provoke him in the least.\n\nYou're TA, and so's your brother.",
      "id": 38,
      "comments": [
        {
          "score": 6,
          "content": "Sorry when I said his behaviour was disgusting this was 2 days after she'd died. When I say I didn't provoke him, I meant in the group chat that was at least a week later",
          "id": 39,
          "comments": [
            {
              "score": 22,
              "content": ">I'm a very black and white kind of person, I say things how I see them and if I offend someone, well then be offended.\n\nSince you do not care how you make other people feel, why are you even posting here?",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Now you're splitting hairs. You both suck.",
              "id": 41,
              "comments": [
                {
                  "score": 5,
                  "content": "You're attacking him on a specific detail in his write-up (namely calling gross, selfish behavior disgusting) and are now becoming angry when he clarifies the specifics. You suck my dude.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "ESH. \n\nWhenever someone says \"I say things how I see them and if I offend someone, well then be offended\", they more than likely are far more abrasive than they want to admit. \n\nIt seems he pounced on the inheritance stuff, then you decided to give your unsolicited opinions to others, and he made a comment.  \n\nYou both sound difficult.",
      "id": 43,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "NTA - you are not obligated to invite anyone to your wedding and if your bro is already not close and is pissing you off… go for it. \n\nAlso I can not imagine that kind of disrespect to your MOM. She just lost her mother. That’s a different kind of hurt. Yeah he’s saying the quiet part out loud that many people are usually all over the inheritance when someone passes. Especially those who are in desperate money situations. But this is one of those times that its quiet for a reason. Just because he isn’t grieving doesn’t mean he shouldn’t be kind and respectful to those who are. \n\nAlso your family’s reaction wreaks of “boys will be boys” energy but idk your gender to say for sure.",
      "id": 44,
      "comments": [],
      "relation": "Support"
    }
  ]
}