{
  "post content": "I (20M) am currently at my second year of university; I study physics and I absolutely love it! Anyways, a couple of months ago, Mother asked me if I was willing to tutor her friend's dumb son, who's in high school and struggling with physics. My schedule was full, but eventually I begrudgingly relented.\n\nI went there, we do our lesson, one hour of pure hell, and then comes the moment to get paid. The mum looks angrily at me and says \"Here's the amount me and your mother agreed upon\" and hands me 10€. I am confused, I clearly remember telling Mother my hourly fee is 25, but take the money nonetheless and walk out. When I get home, I call Mother to ask about it. She says \"She's a dear family friend, you should make an exception for her\". I roll my eyes, but agree, she's a family friend, maybe I should give her a discount. So, for the next month I tutor the offspring and I get less than half my normal pay.\n\nTwo weeks ago, we had to switch to online tutoring because of hardening covid regulations. I did what I had to do and before I closed the call the hag said \"BTW I will be paying you 5 from now on. Online tutoring isn't like normal tutoring! And he's not getting any better so why should I pay you?\" I was taken aback. I told her that this wasn't acceptable, and if she wanted to continue our lessons, she would need to pay me my normal (reduced) fee. She complained \"But 10 is too much!\" I couldn't hold it in: weeks and weeks of underpaid, mind-numbingly frustrating work bubbled up and I exploded. \"Listen, 10 is already nowhere near what I normally charge, you already got a discounted price just because my mother went over my head and decided that this was acceptable! As for your offspring not getting any better, I am a student with an average grade of 30 with distinction (in my country 30 is the max grade at uni), I am a tutor with dozens of clients who can vouch for my professionality and I have several professors who can vouch for my competence. I am not the problem; your son simply isn't interested in getting better! So, from now on, either you pay me my full price, or I just drop you. Be grateful I'm not making you pay me back what you owe me!\" I hung up and stormed out.\n\nMother called me soon after, yelling that I was rude and I shouldn't have made such a scene given that tutoring isn't my job and how bad I made her look in front of her friends. I countered saying that it doesn't matter it isn't my job, it's about the principle: I do something time-consuming for you, you pay me, end of story. She didn't listen and kept on berating me and wailing about her ruined social image. I hung up. Over the course of the last week, I've received texts and calls telling me I went too far, I should have just taken the money and not been such an a-hole. The only people that have my side are my dad and my girlfriend, who tell me I've done nothing wrong, but I no longer know if that's true.\n\nSo, I come to you, people of Reddit: AITA?\n\n\n\nEdit: thank you so much for all the constructive criticism (polite and rude both)! I just want to address something really quick: most of the criticism was for 3 things: I tutored the kid even though I shouldn’t have, given the conditions, my perceived sense of entitlement and my use of the words “dumb” and “hag”.\n1- you are absolutely right.\n2- right again, but I can only say that I was raised in an obscenely entitled environment (nobility, yay), it is only natural that I exhibit entitled behaviour. I recognise that and I’m trying to get better, but shedding my entire education takes time.\n3- I never called any of them dumb or hag, I just referred to them in such way in this post. And, BTW, hag means “unpleasant old woman” (Oxford dictionary), which is accurate, and dumb is a person who acts in a stupid or foolish manner, which he did when he flat out ignored me when I was trying to help him, it DOES NOT mean the r word or is in any way an insult to his intelligence.\n\nAgain, thanks for the input and great advice!",
  "id": 1,
  "comments": [
    {
      "score": 4006,
      "content": "Wow.\n\nYour mom secretly negotiated a 60% discount without your knowledge or consent.\n\nThen this lady summarily decided to cut an additional 50%, you're now being offered 20% of what you consider your fair rate.  \n\nAnd she blamed you for her child's continued failure.\n\nThat's downright offensive.\n\nNTA.",
      "id": 2,
      "comments": [
        {
          "score": 2128,
          "content": "Negotiated is the appropriate term: it implies an exchange of a sort with profit in mind. She exchanged my time and my potential money for social credit. \nGods, I love my family...",
          "id": 3,
          "comments": [
            {
              "score": 806,
              "content": "NTA.  You should, in fact, bill your mother for the amount she discounted and let her know you do not approve of any further discounts and won't accept any referrals from her until she pays you for the social credits she bought with your time.",
              "id": 4,
              "comments": [
                {
                  "score": 573,
                  "content": "Skip the billing.  Just don’t accept ANY jobs from friends of your mother.  Time to move on.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 214,
                      "content": "Yeah, please skip the ridiculously childish suggestion of billing your mom 2.5x the price you (kindly but foolishly) agreed to be (and already have been) paid. The number of upvotes that comment has is everything wrong with this sub.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "At this point asking the money will cost much in headache rather than the actual money.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "This. \n\nShe negotiated the discount, that's all fine and dandy, but then she should pay the difference. That lady may be HER friend but I doubt very much she is YOUR friend. \n\nOh and NTA.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "this",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 380,
              "content": "By the way tutoring *is* your job, even if you have otber employment. You are exchanging money for a service, it does not matter if it is not your main focus.",
              "id": 10,
              "comments": [
                {
                  "score": 82,
                  "content": "Exactly. And if mother says it “isn’t you job” then YOU DON’T HAVE TO DO IT. \n\nNTA.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Tutoring **is** your job!",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "This!",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "Tell your mom that you will teach the kid as long as she makes up the balance of 25 euros that is not paid by the kid's mom.\nAlso tell her that you will only tutor if paid in advance. \n\nSuper NTA",
              "id": 14,
              "comments": [
                {
                  "score": 193,
                  "content": "That would have been a smart choice: being paid in advance, maybe next time I’ll try it",
                  "id": 15,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Actually forget getting the money. It's better to never met them again. All of it never worth the headache. \n\nAlso, because she said \"tutoring isn't your job.\" Then you could counter with. \"You're right. It's not my job. So I won't do it ever again. Ever.\"",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "Is the friend Anna Wintour or the Queen of England? Who gives RA about her social status.",
              "id": 17,
              "comments": [
                {
                  "score": 90,
                  "content": "I don’t care much for it, but Mother would be a Fürstin, so she cares a lot about what people think of her. Unfortunately I can’t change that.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 98,
                      "content": "Perhaps you should remind your Mother that undervaluing your time and skills will lead people to think less of you (and therefore her). You were being treated like a servant rather than a proper tutor or educator and you were raised better than to tolerate such disrespect.\n\nI have relatives like your Mother and, like you, I prefer focusing on my own life and accomplishments. I also know I have an easier time convincing them to do stuff if I phrase things in ways they will understand.\n\nSide note - Also, that woman’s behavior would have been improper and rude even if you had been a servant. Your Mother has very poor taste in “friends.”",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "A what? I don't know what that is.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "She can learn that you’re not available for friends and family discounts and when doing so you will make her look bad.\n\nEventually she’ll figure it out, made to look bad often enough.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "Tell mommy her social standing doesn’t mean anything to you. You’re good at what you do and that means getting paid for it. She doesn’t set the price anymore and I wouldn’t tutor for the old hag anymore even if she paid me the full amount. God I fucking hate parents that “loan” out their children for their friends benefit.",
              "id": 22,
              "comments": [
                {
                  "score": 3,
                  "content": "To be fair, mummy's social standing and privilege likely *has*  meant  *a lot* to OP and done a lot for OP. Be that as it may, OP should still be upset that Mummy unilaterally decided to discount the tutoring rate.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Tell your mother, and anyone else, your are not a prop for her to use to gain social credits. If you provide a service, you get FAIRLY compensated for that service, or you don't provide the service at all. \n\nStop discussing this, just remind your mother she can't offer your services without your approval first, and if she does it's her own fault if she looks bad. Start hanging up if she argues with you.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I couldn’t have put it better myself - your time for social credit.  It must drive you nuts to have such shallow family members.  The good news is, once you graduate and get a decent job you can leave them far behind, if you choose to.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "NTA - get paid what you're worth.  good on you.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Let me guess... Italy? If so, hi fellow countrymen",
              "id": 27,
              "comments": [
                {
                  "score": 2,
                  "content": "Hell yes, i asked the same thing because...well, i'm italian and i can recognize a fellow pasta-eater here.\nCiao a te, connazionale! :D",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "[removed]",
              "id": 29,
              "comments": [
                {
                  "score": 0,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I’m disgusted by the mom going behind OPs back! I’m taking Latin and I pay my tutor (who is the head department for Latin at a really good university) 40$ per hour. Honestly I should be paying her more but she doesn’t mind since she has other students she tutors.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I would also say NTA, but in post op mentions her son as dumb son when he is not at any fault, sure maybe he is not good in studies but calling him dumb over something like this  especially if you are hired to help , not good\n\nOVERALL IS STILL NTA",
          "id": 32,
          "comments": [
            {
              "score": 1,
              "content": "OP didn’t say the son was dumb.. he said the kid simply isn’t interested in getting better. Not dumb.. not incapable.. simply not interested. A teacher and a tutor can only go so far if the student in question refuses to engage.\n\nETA: I went back and re-read where “dumb son” was in the set up. My initial response was focused on the actual response to the mom.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You meant 25% correct?",
          "id": 34,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 846,
      "content": "NTA at all. You were right to stand up for yourself.",
      "id": 35,
      "comments": [
        {
          "score": 336,
          "content": "I think I was right too, but I feel I like I should have reacted better, not I such a violent way",
          "id": 36,
          "comments": [
            {
              "score": 274,
              "content": "Actually, this is a really good way for you to figure out what your happy assertive level is. Don’t feel bad for the mum, she was rude, condescending and fully deserved it. Don’t feel bad for your mum either - well done, bc you’ve just established a clear boundary with her! Better to start setting em when you’re young! \n\nNTA",
              "id": 37,
              "comments": [
                {
                  "score": 29,
                  "content": "This is an extremely positive take, and I am absolutely here for it! Sometimes we don’t actually know where our line is until we find ourselves hurtling through the air over it- then we land in the dust, and much to everyone’s surprise we lose our temper.\n\nBecause that was the line\n\nAnd this is a good time to set up some some metaphorical road markers. You know: a couple of traffic cones, maybe a few flares, some fluorescent paint, maybe even some biohazard tape (‘cos who hasn’t got some of that shit lying around, right?).\n\nAnd then you’ll know: here is my line. I need to stand a few feet in front of it, and brace, and assert that we will not be moving any closer, thank you.\n\nBecause look: getting undervalued sucks. Getting taken for granted sucks. Getting your time and expertise “voluntold” sucks. And OP wore that for a while and tried to be helpful, not necessarily having learned that family and family friends are not proof against “give them an inch and they’ll take a mile and then probably break into your car and change the radio station.”\n\nBut getting abused and *further* undervalued? That was the line. And it turned out OP wasn’t actually okay with any of that stuff after all, and *all of that stuff he wasn’t okay with* hit him like a tonne of bricks.\n\nSure, it would have been better if he didn’t yell, but also? That’s a lot of mis-use to hit a person at once, so NTA from me.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Exactamundo!! And thank you :)\n\n\nI used to not rise over and over and over and THEN I snap - but you get gaslit when you do that. Bc to others (who feel entitled to get involved, lol), you didn’t rise, so you must have been fine with the situation/behaviours, even if it’s obvs not okay and *they* wouldn’t like it. \n\nBut now I nip something in the bud. A quick, pointed “hmm, I don’t appreciate the tone you are using. Please adjust it when you communicate with me in future” is polite and sets a clear line. A more frank “you are being inappropriate.” can also whack a mole v swiftly. \n\nDon’t suffer fools gladly. You’ll live longer!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This. Was thinking when I read this, that mum (& this while story) could well also feature on r/EntitledParents!",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Time is money. NTA.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "I think it’s amazing you held it in as long as you did. I wouldn’t have been able to. This woman TOLD you what she was going to pay you for your time, regardless of what you charge. She has a lot of nerve. And so does your mother for deciding that for you without even telling you. They suck and you were right to say what you did.",
              "id": 42,
              "comments": [
                {
                  "score": 6,
                  "content": "I think my husband made me watch the opening of the “F*k you, pay me” video at an impressionable time in my PhD and it is now *widely understood* that I do not work for free.\n\nSo yeah I too would have cracked it.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "You probably should have/could have reacted better, but I think a lot of people would have snapped, and you \\*have\\* been wronged. Nobody's perfect. Maybe in the future have some sort of line prepared when people try to pull this bullshit. NTA.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "No way. Both the friend and your mum were extremely disrespectful towards both you and your time. NTA at all.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "People with manipulative parents often feel guilty when standing up to them. Even well into adulthood. You're 20 now but imagine your mother doing this when you are 30",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "NTA\n\nI think you would have reacted non violently if you hadn't been manipulated into this crap show by your mother.\n\nTrying to comply with her \"request\", behave properly to the boy's mother (and your mothers friend), and teach an indifferent, bored and disinterested child would strain anybody's patience.\n\nThe final smack in the face of being offered 20% of your usual fee understandably flung open the doors.\n\nAll you did was set them all straight about how you had been treated. You are human, and had been goaded for a long time. You have learnt that there are times when it is best to evaluate what is going on, discuss what is happening, and then get the hell out of there.\n\nTBH, you did better than I would have, give yourself a break.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 505,
      "content": "NTA might want to also tell her she can't decide your prices, I am my own boss as this is my free lance job last I checked you were not on my pay roll.",
      "id": 48,
      "comments": [
        {
          "score": 217,
          "content": "I probably should have said that when I started tutoring",
          "id": 49,
          "comments": [
            {
              "score": 80,
              "content": "It's not too late to say that.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 365,
      "content": "NTA of course.\n\nWhy does your mom care so much about what her terrible friend thinks? Also, your mom is a massive asshole for dropping your price without telling you. You should have backed out after the first session.\n\nThe way you talk about these people, you clearly hate them. Stop working for people you hate this much. You clearly have plenty of other clients.",
      "id": 51,
      "comments": [
        {
          "score": 291,
          "content": "My mum’s only concern is her social standing. Have you noticed I addressed her as Mother? My brothers and I are not allowed to call her that, she requests her title. She only cares how the other old aristocratic mothers see her and her “perfect family”. I hate them so much",
          "id": 52,
          "comments": [
            {
              "score": 126,
              "content": "The biggest asshole here is your mom. You are NTA.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "If she wants to act like that, call her by her first name. Because she doesn't deserve the title. 💯\n\nNta.",
              "id": 54,
              "comments": [
                {
                  "score": 142,
                  "content": "I did that once. I called her by her name instead of Your Highness and her name. I went to bed without supper for two days",
                  "id": 55,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Your mom is narcissistic, I hope you do yourself a favor by walking away and never look back.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I hope you understand that's incredbily abusive as supper is one of the bare essentials that she legally owes you, which makes her a criminal.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "If she was so concerned about her \"social standing\" she wouldn't 'volunteer' your tutoring without your knowledge and consent. She voluntold your services basically. Any rejection or embarrassment is because of what **she** did, and is **her** problem, not yours.\n\nIt's **her** fault that the friend got to take advantage of your tutoring and tried to take advantage of you again by asking for a further discount. \n\nYou're charging for your time, skills/knowledge, and experience. Online tutoring doesn't change the fact that you will be spending one on one time with someone, using your expertise to help someone.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "What i don't understand is how your mother thinks undervaluing your time SO MUCH doesn't reflect back on her?\n\nIf she's a princess, surely getting tutoring from her accomplished, intelligent, successful offspring should be worth a premium?",
              "id": 59,
              "comments": [
                {
                  "score": 35,
                  "content": "For her it’s not undervaluing my time. In her optic, she’s gracious enough to to allow her friend’s son to be tutored by me and, as an additional token of her magnanimity, I’ll do it for less. I’m completely out pf the equation in her mind",
                  "id": 60,
                  "comments": [
                    {
                      "score": 18,
                      "content": "The more you post about your mom, the more I wonder why you sustain a relationship with her.",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I'm glad you've figured out what kind of person your mother is, and I hope you have other, better people around you. Do whatever is best for you. I wish you nothing but love and happiness in your life.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Start calling her mommy dearest",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It’s pretty gross that your mother is more concerned about her (false) public image and “looking bad” in front of her friend rather than looking bad in front of you, her actual child. You don’t need toxic people like that in your life, regardless of whether you’re related to them - especially when they use “family” as an excuse to mistreat you.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Sure made herself look like a fool, and her child like a slave fool. NTA",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "YTA my friend. Practice saying \"I don't care\" when your mom brings up her social standing.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 242,
      "content": "ESH, but you only mildly so.\n\nYou should have said “5/hr doesn’t work for me. The lowest I will go is 10/hr, and that’s already less than half what I usually charge.” When she says “but that’s too much” you simply say “I’m sorry we cannot reach an agreement; this will be my last day tutoring him”. End. Really end.\n\nNo of the defending yourself, or belittling anything else. Just “my terms don’t meet your terms so we can’t proceed”.\n\nYour mom’s a huge AH here for undervaluing your and daring to make this sort of deal without talking to you.\n\nThe other mom’s a huge, entitled AH for taking advantage of you.\n\nAnd you also have a touch of AH for not discussing payment with the person employing you before agreeing to do the work.\n\nMore professionalism!\n(And way less of this client!)",
      "id": 67,
      "comments": [
        {
          "score": 140,
          "content": "Thank you, yeah I should start being more professional. It's just that I've started more ore less a year ago and I'd never been cheated and used this way before, it was an unfamiliar situation and I didn't know what to do",
          "id": 68,
          "comments": [
            {
              "score": 85,
              "content": "Eh... no better way to learn than screwing up. Well... that’s been my personal experience... :)\n\n(Tutoring is hard!)",
              "id": 69,
              "comments": [
                {
                  "score": 56,
                  "content": "Thanks for the advice mate",
                  "id": 70,
                  "comments": [
                    {
                      "score": 45,
                      "content": "[deleted]",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Its better to be a little dickish in trying to stand up for yourself then learn at such an impressionable age that rolling over is the best way to go.  \n\n&#x200B;\n\nStand up for yourself more, and always be open (like you have been in this thread) to hearing that you may have gone too far.  I also agree that your reaction/mini lecture while well deserved and \\*chefs kiss\\* beautifully done, wasn't very professional.  Solely to make your life easier, do what the commenter above said, thats a perfect \"script\"!",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Also, as a former teacher and tutor I hope you change your mindset towards students and become more professional in about how you think and talk about them\n\nDon't ever call them dumb\nThat is a slur and abusive ableism\nFolks with learning disabilities do not deserve this\nYou also called the son lazy and not interested in learning\n\nWhich is it? Lazy? Dumb? Not interested?\nBecause even if all 3(and kids with learning disabilities get called all three all the f*cking time) it is YOUR responsibility to help this child grow academically, YOU are the one supposed to be able to break problems down to whatever level they are at, YOU are the one that is supposed to be so knowledgeable & enthusiastic about the subject you teach that it manages to kindle an interest in them\n\nAnd yes.... if he happens to be an entitled asshole too cuz his mommy brought him up to be one... then you are called upon to teach him some life lessons AND PHYSICS\n\nThat's the job, no matter how little it is paid (no you do not have accept being underpaid, but once you start tutoring, the duties stay the same)\n\nIf you are not prepared to do that, please get out of the tutoring/teaching business because your attitude is more harmful than you great grades are helpful\n\nESH\nexcept the student (cuz yeah... you have not told me enough about him doing anything actually wrong to deserve any of the abuse heaped on them here)\n\nBitte tu was an deinem Validismus denn so wie du über deinen Studenten redest hört sich meiner Meinung nach nicht viel besser an als der Klassizismus der Fürstin \nintellectuelle Übergebenheit ohne gleichwertige morale Exzellenz leitet nur dazu das man ein sehr begabtes Arschl*ch wird\nDas wünsch ich dir nicht zu",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -9,
          "content": "I’d add to this to have a contract drafted by a lawyer and have clients sign it.",
          "id": 74,
          "comments": [
            {
              "score": 7,
              "content": "How oblivious are you to social interactions? You don’t sign contracts for tutoring.",
              "id": 75,
              "comments": [
                {
                  "score": -1,
                  "content": "You should have contracts for everything where money is exchanged for a service. It makes everything clear. He got screwed because he worked on taking and assumptions. Had they sat down and hashed things out, wrote it down, and signed it none of this would be an issue. I think you are naive if you don’t understand this basic business practice. Everything in writing.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 1,
                      "content": "God you are so disconnected.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 207,
      "content": "ESH, your mum and the kid's mum suck for obvious reasons. You went too far and you come across as thinking you're superior and smart. You get top marks in your uni? That's awesome. It is very impressive and huge congrats but like another commenter said, it doesn't necessarily make you a good tutor. \n\n\"Dumb son\" wow. Was that really necessary? Is he stupid or is he not interested in getting better? Or is it both? It was the right decision to stop tutoring the boy but your explosion was somewhat of an asshole move. \"Be grateful I'm not making you pay back what you owe me?\" Uh no, after the initial session you agreed to that price (grudgingly). They don't owe you shit besides an apology for the mum's attempts to underpay you. Your mum and his mum are the main assholes but I couldn't exclude you because I get such a strong sense of derision from you.",
      "id": 78,
      "comments": [
        {
          "score": 88,
          "content": "God I agree. Like of course he should be paid for the tutoring but his tone and language... I shudder to think what entitlement he exudes in the rest of his life.",
          "id": 79,
          "comments": [
            {
              "score": 27,
              "content": "I wholeheartedly agree that I am a bit entitled, but if one’s raised by an overbearing, entitled mother, this is kinda usual for said person. I’ve only recently realised what she is and acted accordingly. It will take time to shed 20 years worth of entitled indoctrination",
              "id": 80,
              "comments": [
                {
                  "score": 17,
                  "content": "Okay but you realize that you're making excuses for your own entitlement while calling another kid with a terrible mother and a lot less life experience and learning dumb, right? You shouldn't tutor this kid, but if you can have compassion for the life lessons your adult self needs to learn, you can extend that same compassion to a kid.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Hey, I wish you the best of luck! Honestly, it can take a long time to unpack all the personality traits our parents pass on to us through our upbringing. Recognizing the ones you don't like early (and trust me, 20 is early compared to some) gives you a much better chance of becoming the kind of person *you* want to be.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I mean if they view the student with such distain, I can see why the lessons aren’t helping.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Had to scroll too far for this. Wth people?",
          "id": 84,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "Agree wholeheartedly. I'm taken aback at how many people see nothing wrong with OP. He seems like an absolutely wretched person. I dislike everyone involved in this. ESH. Ugh.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Very strong agree. OP comes across as just spectacularly condescending. I can't imagine they're an effective teacher, where patience and empathy are so crucial.",
          "id": 86,
          "comments": [
            {
              "score": 21,
              "content": "Yeah I was thinking the same. I had a lot of teachers, all in some sience related subject, genius in the material itself and no problems with the students who would understand the material and just had minor problems, but clueless on how to help those who just lacked the same level of understanding and \"love\" for the matter as them. I remember a Math teacher who was just born for maths. But who would get this very sad, helpless look if someone asked a question and didn't understand his explanation, because it was to deep into the material. The way OP talked about his love for physics', combined with calling the kid \"dumb\", (big YIKES!) instantly reminded me. \n\nAlso, showing to his \"countless other students\" dosen't prove much. How old where they? In what form of school? Are we talking about students who are average and just want that last hop to good or people who are really struggling? \n\nI'm seconding the ESH",
              "id": 87,
              "comments": [
                {
                  "score": 4,
                  "content": "Exactly. The best teachers are those that can help others who are struggling and this person has no business being a teacher. I’ve worked with plenty of students that are years behind on their studies and I would never ever talk about them like this. It’s disgusting.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If OP has spent his childhood with that kind of mother, most probably (based on his other comments) being belittled about everything to do with social interaction, it isn’t unusual for children to lock onto the one thing they succeed in (his education) and it forms a massive part of his self worth. I agree (as apparently OP does) that he needs to learn to temper his pride in education but it is understandable. Note it also comes out when he is facing off a representative of his mother’s social circle that represents her values and his perceived failures, its no wonder he reaches for the thing that gives him strength and pride.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "THIS. Holy fuck. If a student isn't getting showing improvement, *especially* in 1-on-1 tutoring, that's a reflection on the teacher, not the student.\n\nThis kid was already struggling, and almost certainly has emotional blocks and anxiety when it comes to physics. Having a tutor that calls their student \"dumb\" and the time spent tutoring \"one hour of pure hell\"... even if not said directly to their face, the student picks up on that attitude. So glad that poor kid is out of such a toxic learning environment now, at least.\n\nMy only consolation is that OP will 100% feel as dumb and hopeless during his PhD research as he made this poor kid feel during tutoring.",
          "id": 90,
          "comments": [
            {
              "score": 27,
              "content": "Or as op said he isn’t interested in getting better and learning. You can have the best teacher in the world but if you do not want to learn you will not learn that is a fact.",
              "id": 91,
              "comments": [
                {
                  "score": 1,
                  "content": "Then it seems best to vote out after one session instead of expecting full payment when he knows the pupil won't get better.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -6,
                  "content": "And the worst teacher in the world can kill any student's interest in a subject and destroy their desire to learn.\n\nIt's quite literally the tutor's job to develop an individualized approach that engages them in the way a classroom teacher doesn't have time to. Instead, this poor kid probably just felt stupid every single week as his tutor stewed in resentment.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Again you can only do so much he isn’t a child we don’t know how much work he actually put in.",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I was a great student but through being a TA learned that I was an average TA at best. Thinking good grades in a subject translates to being successful at everything related to it is a dangerous path to start down. It just means we're good at HW/tests and may or may not translate to anything else.",
          "id": 95,
          "comments": [
            {
              "score": 8,
              "content": "I mean he doesn’t only has good grades he also has testimonies of clients and professors that can vouch for his efficiency so it seems he isn’t the problem in the equation.",
              "id": 96,
              "comments": [
                {
                  "score": 5,
                  "content": "Idk the fact that the clients can vouch for \"professionality\" is a weird choice to me? Especially given this post shows anything but. He's probably not totally terrible if he has clients that come back but it doesn't necessarily mean he's great with all kinds of students. Profs saying he's \"competent\" is irrelevant to tutoring skills. Maybe I'm nitpicking because he sounds like a jerk though, I admit it.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I mean no one is amazing in every single aspect of a field . He definitely could have handled it better but we don’t know what kind of effort the teen was actually putting.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah after getting called out, OP literally says in another response \"I should be more professional.\"",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": ">You went too far and you come across as thinking you're superior and smart. You get top marks in your uni? That's awesome. It is very impressive and huge congrats but like another commenter said, it doesn't necessarily make you a good tutor. \n\nWell, he is superior (in the academic way) and smart because he is attending university, that's already a given. What makes him a good tutor, as he said, is the amount of clients and the trust of professors he has.",
          "id": 100,
          "comments": [
            {
              "score": 5,
              "content": "I have met many people at university who I would not class at smart - I think that's a poor way of measuring someone's intelligence. A better indicator of his book smarts is the fact that he's excelling at his degree. \n\nThe trust of their professors is irrelevant unless they do tutoring within their university. The amount of client should hold some weight but again, interesting choice to focus on professionalism rather than the student's results/improvements",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 118,
      "content": "ESH I’m not impressed by someone who calls a kid “dumb” and being smart in a subject does not necessarily mean you’re good at teaching it to others, so there was no need to go on a rant about how smart you are and how bad her son is. \n\nI’m also not impressed with your telling her to be grateful you’re not making her pay back money she never agreed to in the first place. The issue is with your MOM. she’s the one who told your friend the cheaper price. You should’ve just talked to her instead of letting your bitterness reign unchecked.\n\nBut, She shouldn’t have told you your time is only worth $5 and she can’t unilaterally decide that.",
      "id": 102,
      "comments": [
        {
          "score": 14,
          "content": "Surprised I had to scroll so much to find this. The way you talk about the boy and your whole reasoning is silly. I have the best grades, yeah but are you able to pass on your knowledge and efficiently answer questions without making your pupil feel dumb? Because if your attitude with him is similar to what you show in this post, no wonder why the boy hasn't progressed a bit.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah since when does being good at something mean you're good at teaching it. I've had many professors that easily dismantle this statement. OPs attitude stinks and im not surprised it's been reflected in his students progress",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 79,
      "content": "You handled it like a champ\n\n\"Why should I pay you more?\"\n\nBecause you are worth it. If you aren't worth it in their eyes then they would be smart to hold onto their money instead. But they just want to rip you off\n\nNTA.",
      "id": 105,
      "comments": [
        {
          "score": 23,
          "content": "Thank you!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 58,
      "content": "NTA \n\nYour mom was using you for social cred. Entitled parent was using you for basically free tutoring. Who gives a flying F what these people think?",
      "id": 107,
      "comments": [
        {
          "score": 41,
          "content": "She often does that. I could post a thousand time on r/entitledparents stories about her if I had karma lol",
          "id": 108,
          "comments": [
            {
              "score": 24,
              "content": "> I countered saying that it doesn't matter it isn't my job, it's about the principle\n\nWhile its true that it is about the principle, tutoring is your job. You do the work and you get paid for your work",
              "id": 109,
              "comments": [
                {
                  "score": 16,
                  "content": "Yeah I know it technically is my job, but at the same time it isn’t, it’s just to earn a bit on the side",
                  "id": 110,
                  "comments": [
                    {
                      "score": 13,
                      "content": "So it's your other job. You can have a full time and part time job, they are both your job.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You might have enough karma now!",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "ESH cause you sound intolerable yourself",
      "id": 113,
      "comments": [],
      "relation": "No"
    }
  ]
}