{
  "post content": "(For context, me and my ***Wife*** are in our late 30’s, married for 4 years)\n\nI’m rarely the type to ever get fever sick in general and when I do, I just drown myself in ‘feel better products’ (nyquil, soup, tea, orange juice) for a day or 2 while also just taking it easy. My fiancée on the other hand is complete opposite. She passively feels ‘off’ everyday due to something: not handling work stress well, bored from working at home, hating the weather (no matter what season, they all suck), feeling drained because she never really eats well, feeling lethargic because she doesn’t exercise regularly, etc. If she is does ever get fever sick, she simply goes to bed and will not go back to work until she feels better (maybe a day or 2).\n\nSo, I recently started to feel sick (fever, cold chills, sneezing nonstop, low energy) and I did my usual slow down and recover effort. The first day I made it clear why I’m moving slower and just acting off so there no unsaid surprise. I didn’t complain. I said very little through the day and just went into autodrive. When day 2 rolled around, I still felt off but better.\n\nMy wife asks if I will be going to the gym as usual and I said no.\n\nShe then proceeds to get mad at me for asking how she was feeling since I know I am off.\n\nShe goes into left field telling me how she is surprised how I can’t sympathize with her and ever feel proud about her daily struggles.\n\nI ask what she is talking about.\n\nShe tells me that the way I currently feel is how she feels everyday and that I never acknowledge her efforts for only mildly complaining everyday instead of losing it completely.\n\nI was baffled and asked her why I am being yelled at for simply asking how she is feeling for the day. I already still feel bad overall but now I’m being yelled at for not making efforts apparently in the past.\n\nAs she keeps pushing for a fight, I eventually I tell her that she is a Narcissist and that it’s shitty to kick me when I down in health. I confirm that I do make efforts to sympathize with her but at a certain point she is just complaining without making any effort to address the problem or relax to unwind from it all. I told her that in a way I’m starting to see that she is acting like her dad (which she hates for similar reasons as this scenario). Bold comment I admitted, but the scenario is almost exactly the same as what she delt with except she was in the hospital and he made her feel like crap because he visited & was complaining non-stop about his minor issues that were just a joke.\n\nThese types of scenarios have been occurring a lot more in the last 2 years but it really hits me the hardest when she pulls them when I get sick. I literally try to avoid her when I get sick because this legitimately happens every time for one reason or another.\n\nSo, AITA?\n\n&#x200B;\n\nEdit: Confirmed wife/married. Apparently that threw everyone in a loop for since I quick typed the question and tripped over my thoughts.",
  "id": 1,
  "comments": [
    {
      "score": 3020,
      "content": "ESH. None of this sounds like narcissist behavior, just a woman who deals with general malaise (and perhaps depression, but I'm not a psychiatrist) regularly and feels she doesn't receive the validation she deserves. She handled her reaction poorly; that doesn't mean you don't also deserve validation and sympathy when you are feeling unwell.\n\nHowever, throwing terms around like \"narcissist\" because someone acts selfishly is inappropriate. NPD is an actual condition with specific behaviors and diagnoses. It's become a trump card to shut people up when they're just acting shitty, and it's wrong.\n\nHonestly I think couple's therapy could do you both a world of good. This mostly sounds like a breakdown in communication that has festered for so long it has caused resentments in you both.",
      "id": 2,
      "comments": [
        {
          "score": 593,
          "content": "Something a lot of men don't know, and I always see them asking \"why are women never at 100% health, why does my gf always feel ill\" etc etc is what we call the period cold. The period cold happens in the middle of our cycle where the hormones cause our immune system to decrease in function dramatically. It's around the time of ovulation I believe but I may be wrong and it's the 1st week. \n\nTo sum that up, a normal cycle is around 4 weeks. For 1 week we have the period cold, for 1 week we have pms or in a lot of cases pmdd, and 1 week for our period. So people with uteruses literally have 1 week in our lives every month that we feel \"normal.\" Guess what, there's next to nothing you can do about this besides using birth control to stop your period completely, getting a hysterectomy, and using vitamins to supplement in between. \n\nImagine how fun that must be for us.",
          "id": 3,
          "comments": [
            {
              "score": 241,
              "content": "Getting a hysterectomy does not stop hormones. I have no uterus, but I still have my ovaries and my hormones. I still deal with the same shit, minus bleeding and endometriosis pain.",
              "id": 4,
              "comments": [
                {
                  "score": 63,
                  "content": "They were likely referring to a complete hysterectomy which removes the uterus, ovaries and cervix.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 111,
                      "content": "That's not a \"complete hysterectomy\". That's a hysterectomy with bilateral oophorectomy.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 37,
                  "content": "Fair, I should've said ovaries removed along with a hysterectomy, which will trigger menopause symptoms.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Which brings its own various ailments. The hot flashes that start at the top of my head and make me want to run into a blizzard. Then be shivering, freezing after. Interrupted sleep because of the night sweats. Headaches, dry skin, tired…it seems for women, it doesn’t really end. We just learn that we have to live with it, and keep going.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "And surgical menopause is much more intense than natural menopause. If you go through the menopause naturally you'll go through peri-menopause for many years first where your hormones slowly decrease. Surgical menopause can hit you like a truck, and leave you at higher risk for heart disease, loss of bone density, sexual dysfunction, recurrent UTIs and depression. We can't win!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I yeeted my ovaries,  but it required a marriage proposal, a bioethics committee, five years of my life and an incurable, progressive disease.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Don't forget mittenschmerz, where the egg descending through the fallopian tube in the middle of your cycle also causes pain\n\nLiterally some sort of pain or discomfort 75% of the time.",
              "id": 11,
              "comments": [
                {
                  "score": 14,
                  "content": "I got this one day while standing at a tram stop in the middle of the city with my then 4 year old.\n\nI went from fine to absolutely doubled over in pain, barely able to breathe, in *seconds*. In 15 seconds, it was so bad that I vomited from pain.\n\nBy the time the tram arrived - the pain was almost gone, but I was covered in sweat and shaking like a leaf, and my kid was freaked out.\n\nPart of the reason I have an issue with the idea of an all-powerful, all-knowing, and loving god... if they knew what they were doing and had the ability to do it better, why wouldn't it be different? All-knowing + all-powerful = did it on purpose =/= loving... ? = no.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "I get this badly. It sucks.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yup. Except my mother calls it mittelschmerz. I always know which side I ovulated on each month.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I have a mate who would get little cysts and could literally feel them pop.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "My favourite is all the ways the menstrual cycle can fuck with us in general. There's the obvious actual days we're having our periods... which can be debilitating for many women, but then there's a lot of women who also get significant cramping during ovulation.. and because this is when your hormones are peaking, it can also result in breast pain and/or tenderness. \n\nI went to the doctor a few years back for what turned out to be a kidney stone, and he asked why I didn't say something sooner or complain more. I told him that I had just thought it was menstrual cramps because they also can feel like that and make me want to hurl. The only reason I finally realized that wasn't what was happening was because I started to experience pain that started higher up and then kind of shot down. \n\nNot to say that getting sick doesn't suck in general. It does. I feel bad for anyone with a cold. But I think society often likes to ignore that women are expected to function at 100% capacity even when we're experiencing significant issues because of our menstrual cycles.",
              "id": 16,
              "comments": [
                {
                  "score": 32,
                  "content": "I am an adult woman. I was working on something with my dad last month. I had a really bad cramp. My dad thought I tripped so he laughed and held out his hand. I couldn’t take his hand because you can’t really move until it is over. He was thinking I needed a hospital for multiple reasons. I told him it was as just a period cramp. He’s literally seen me have contractions with less concern. His mind was blown. I was like “this is still less painful than the migraine that will be arriving in about 48 hours”",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "When I had gallstones, there was a lady in the bed next to me who had delayed coming in with the same thing because she thought it was period cramps!! \n\nI was vomiting from the pain and hooked up to morphine, and she just wanted a heat bag.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Enter Endometriosis.\n\nI haven't had a good day in decades and am absolutely crippled by daily severe pain. Although I was told the immune drop happens during your period not ovulation. That's apparently why my recurrent infections from my badly impacted wisdom teeth start with my period every month, as if I didn't have enough issues lol",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "We get a what?? I've never experienced that kind of thing.  I guess I'm very fortunate.",
              "id": 20,
              "comments": [
                {
                  "score": 12,
                  "content": "I'm with you. I didn't know this either and have never experienced such a thing. Guess i must be fortunate as well.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -2,
                  "content": "Standard aita gender wars stuff",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "the uterus is maybe The Worst designed organ. just..straight trash",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "What??? This sounds horrible. Are we certain it's not something that can be fixed?? Why do some women get it and some don't?",
              "id": 24,
              "comments": [
                {
                  "score": 46,
                  "content": "So I did some googling because it's been awhile since I looked into it and turns out this is usually around the same time as PMS, but can happen earlier as well. Ovulation causes an entirely different release of hormones with other side effects. \n\nThe consensus is it depends on you. If you already have a weakened immune system, autoimmune diseases or similar it'll effect you harder. You might experience flare up of pre-existing conditions. Some people might not experience anything or only some symptoms (ie. a sore throat.) \n\nStill can't find much on remedies other than what I listed. \n\n[source](https://www.womenshealthmag.com/health/a29268666/period-flu-fever-cold-symptoms/)",
                  "id": 25,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Wait this is (potentially) why I get a sore throat all the time? I’ve been blaming it on my house",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Hormones, genetics, everyone’s body is different. \n\nDoctors don’t give a shit, most of them just throw pills at you that maybe mask the problem and then tell you you’re either making it up or just have to deal with it. Sometimes hormonal birth control helps, sometimes it doesn’t.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I get hormonal migraines triggered by fluctuations in my hormone levels. So I can get migraines when I ovulate and anytime from several days before to several days after my period. I also have irregular periods, so I can have two weeks on two weeks off two weeks on or one week on, but a 15 day cycle. It’s like a migraine minefield. I’m glad I don’t also have a period cold. Let me know if you’d like to chat about the fun and interesting things periods do to my digestive system. I guess I get more of a period stomach flu than a period cold.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "=O I wasn't aware of this (I'm afab) it's interesting!! I also tend to be sick before and after my period and in general bad health so... at this point I don't pay attention anymore but thank you for the teaching!!",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "And for a shockingly long time, the FDA did not require drug manufacturers to include women in drug trials unless the drugs were specifically for women. Which means the drugs we’ve been taking for those colds were tested in bodies with different hormone profiles.  Then dosages were developed using only adult male average weights as the standard (because again only men were in the trials), so women have been routinely overdosed for decades.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 276,
          "content": "[deleted]",
          "id": 31,
          "comments": [
            {
              "score": 90,
              "content": "This is textbook depression",
              "id": 32,
              "comments": [
                {
                  "score": 139,
                  "content": "It's also textbook \"be a woman/fat person with a chronic complaint\". So often we're not treated appropriately or at all by doctors. It could be something as simple as a B12 or iron deficiency.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 70,
                      "content": "My chronic illness alarms went off at the part \"this is how she feels every day\"",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This though",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 72,
                  "content": "She could also have chronic health issues like PCOS, PMDD, Depression, Corrisol or other hormonal imbalances, etc. \n\nDepression could be a symptom rather than the full picture.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It could be any one thing or a combo. Since OP didn't really provide physical symptoms, I simply went by what he provided.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "There are so many chronic illnesses that could be it. Recent studies showed that depression is way more often a symptom of neuroinflammation, mitochondria dysfunctioning, MCAS, hormonal imbalances and so many more. And not a standing alone condition, that's why anti depressants have such a bad effectiveness rate. I have several severe chronic illnesses and I'm mentally fine, actually exceptionally good considering how sick I am and still one insurance who doesn't want to pay just says it's depression, against all hard facts and lab results. Bodies are complex, female bodies due to the monthly hormonal changes, extremely complex which is the reason why we develop way more often chronic illnesses",
                  "id": 38,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Since OP didn't name physical symptoms other than fatigue, I didn't touch medical issues. At the very least though, she's unhappy and OP dismissed her feelings.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "“JuSt ExErCiSe AnD eAt BeTtEr GoD wOmEn ArE sUcH wHiNeRs.”",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "… but poor diet and no exercise contribute heavily to malaise and depression …",
              "id": 41,
              "comments": [
                {
                  "score": 20,
                  "content": "Yeah, I think a lot of people really underestimate how much eating poorly and not moving enough can impact how you feel. Sure, it's not a cure all and it won't 100% fix every issue ever, but it can absolutely *improve* your life. Tbh I didn't think much of it either until I actually started taking care of myself better (eating more veggies/less processed foods/sugar, drinking more water, regular walking etc). The few times since where I've eaten poorly and laid around, even for a day, made me physically feel like shit, not to mention way more tired and anxious.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I think so many women have been told that actual diseases are poor diet and exercise that we forget that sometimes it really is poor diet and exercise.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That should fix it…",
              "id": 44,
              "comments": [
                {
                  "score": 30,
                  "content": "r/thanksimcured",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Yeah let’s all write a fan fic and see what heights we can take this story",
              "id": 46,
              "comments": [
                {
                  "score": 7,
                  "content": "This whole sub is fanfic lol",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Please reread the post. I read it that his wife blamed not eating well and not exercising as causes for how she feels, I didn't read it as OP blaming those as causing her problems.",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "This is assumption territory. Maybe she tells it herself why she struggles.",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -1,
              "content": "Those things most likely wouldn't make her worse off tho. I see people not do the little things constantly then complain as if they need some new drug to magically cure them. \nA friend of mine who is a Dr. says that patients do this all the time. He always tells them that they need to do the little things first and then if that doesn't work, other methods can be considered. You shouldn't jump straight to surgery when taking some vitamins or exercise would address the problem. \nSome people love to complain more than they like to do things. If she was taking action to get better then yeah I would be on OP to give her more support but constantly giving validation and support to someone who takes no action is mentally and emotionally draining.\nA recently divorced couple friend of ours had one spouse that was always \"sick\" and complained about it constantly. She couldn't hold a job and wouldn't do things around the house. She didn't have the energy to do anything in the marriage. She would suddenly have energy for fun activities, tho, then be tapped out for the rest of normal life with chronic pain. He started to lose patience and stopped the support and validation. She started to claim he was gaslighting her and emotionally abusing her. He was extremely worn down and they eventually divorced. Funny enough after she blew through her alimony and all other forms of welfare and support, she finally faced the music and had to start fending for herself. She magically found the energy to get into shape and got a job. The complaints about her health are gone. Now she just complains about her ex and does things on purpose to flaunt her new self to gain the attention of her ex. The complaining attitude never stopped it just shifted from one topic to another. Some people just are complainers",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "Another terminology point - is she your wife/spouse or fiancée (3rd line)?",
          "id": 51,
          "comments": [
            {
              "score": 14,
              "content": "Oh nice catch. Might be a made up story",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "[removed]",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 123,
          "content": "Agreed. Its sort of annoying how popular the term ‘narcissist’ has become. I feel like people use it so loosely anymore, its lost meaning. There are for sure narcissists out there, but while her behavior may be a little selfish in the moment, I don’t feel like this qualifies as narcissism.",
          "id": 54,
          "comments": [
            {
              "score": 93,
              "content": "They even put a capital N.\n\nYou don’t just “become a Narcissist” out of nowhere as an adult.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "I think part of the problem is that the term \"Narcissist\" was an insult long before it was ever used as a name for a diagnosable condition, and was still being used as an insult long before the condition ever became common knowledge.\n\nIt's common for disibilities and mental illnesses to be named, and then have those names used as insults until they loose meaning, like dumb and stupid, and like autism is currently used as an insult by many people. But narcissist started backwards, where it was first a loosely used insult for people who were selfish or full of themselves and I can't believe no one involved in the naming process of NPD thought this would cause or worsen this problem.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "It's like calling someone a sociopath just because they've annoyed you. I'm glad NPD is more widely understood, but the side effect is that everyone uses it, all the time, without thinking. I'm lucky to have survived my childhood because of NPD, so having Susan on Facebook call me a narcissist because I've made a comment she didn't like is irritating, to say the least.",
              "id": 57,
              "comments": [
                {
                  "score": 7,
                  "content": "I'm proud of you for having survived the childhood and I so hope you are in a better place <3",
                  "id": 58,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thankyou.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Everything get so normalized. It's so annoying to see people throw out narcissist, gaslighting, etc. when it's really NOT that. Even depression sometimes is used as a 'today i feel a bit blue' and it feels... so annoying. I think socmed are awesome because it can open door for many people to learn what they have/they are exposed to and feel better but on the other hand, so many people are just stealing words and using them in bad context until it become the new trend (and far away from the actual thing)",
              "id": 60,
              "comments": [
                {
                  "score": 2,
                  "content": "True!  I am tired of  every stupid person  throwing around diagnostics.  Narcissist’s are seldom turned into as adults. The wife might just be tired of being in a relationship with OP.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah... I'd be tired too...",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "good spot for my usual spiel. \n\nhere are several articles that explain NPD, explain the stigma and how its harmful, and talk about myths versus facts regarding NPD:\n\n\n[Reducing The Stigma Behind Narcissistic Personality Disorder](https://www.achievemedicalcenter.com/blog-post/reducing-the-stigma-behind-narcissistic-personality-disorder)\n\n\n[Stigma Is Bad… Except for Narcissistic Personality Disorder?](https://mentalhealthathome.org/2020/10/27/stigma-narcissistic-pd/amp/)\n\n\n[5 Things You Got Wrong About Narcissistic Personality Disorder](https://everydayfeminism.com/2016/05/narcissistic-personality-myths/)\n\n\n\n[Why Narcissistic Personality Disorder Is Stigmatized (And Why It Really Shouldn’t Be)](https://www.avalonmalibu.com/blog/why-narcissistic-personality-disorder-is-stigmatized-and-why-it-really-shouldnt-be/)\n\n\n[Myths Vs. Facts on NPD](https://www.sane.org/information-stories/facts-and-guides/narcissistic-personality-disorder)\n\n\n[Not Every Jerk You Date is a Narcissist: The Dangerous Power of Labels](https://medium.com/invisible-illness/not-every-jerk-you-date-is-a-narcissist-the-dangerous-power-of-labels-1de956c1f12f)\n\n\n\n[Narcissism is Not Abusive. Abuse is Abusive.](https://thecenteroflifecounseling.com/narcissism-is-not-abusive-abuse-is-abusive/)\n\n\n[a post by someone with npd](https://npdsafe.tumblr.com/post/644763726469283840/of-all-the-rude-anons-i-get-one-of-the-more/amp)",
          "id": 63,
          "comments": [
            {
              "score": 4,
              "content": "Thank you for this, going to educate myself",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Your final link is broken",
              "id": 65,
              "comments": [
                {
                  "score": 2,
                  "content": "oh, thank you!!",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Perhaps just therapy for her to start with",
          "id": 67,
          "comments": [
            {
              "score": 118,
              "content": "Perhaps a doctor for her if she genuinely feels crappy everyday",
              "id": 68,
              "comments": [
                {
                  "score": 206,
                  "content": "I'm pretty much the same way as OP's wife due to chronic illness, I honestly get why she's not seeing a doctor. Many doctors tend to play down the symptoms if they don't show on a blood test, blaming it on periods or diagnosing them with a mental condition they may not have to get them to shut up. It's kinda why I gave up on doctors, it took me ages to find treatments that actually helped.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 93,
                      "content": "Right, I'm similiar to OP's wife and I get so frustrated when people tell me \"you should work on your health, go to the doctor\". It's not gonna help, I'm pretty sure it's some type of genetic disease but in my country only expensive doctors could understand what's wrong. That being sad the whole argument between OP's wife and him still sounds weird. Feels like there's a lot of build up resentment and they need to unpack that",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "I finally got a huge blood panel done by a functional medicine doctor and found out im not low iron I’m low ferritin.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Doctors play down symptoms even when you've had 2 parathyroid adenomas removed, had a major post-surgery suture infection that required open wound care for 2 months (and all your other symptoms started around then), and a 5.1 cm ascending aortic aneurysm with a host of elevated autoimmune, endocrine, and inflammation markers and new contact allergies to everything on the planet.  \n\nYup.  I'm tired.  I hurt constantly.  And it seems like something new goes wonky every day.  Some new rash or pain or lesions in your mouth and nose or starting to use a cane because your hips and lower back have gotten that bad or going bald and losing your eyebrows... Oral minoxidil, folks.  It works.  And dermatologists only keep patients if they solve problems.  Word gets out.  So they're great.  But otherwise, I completely get giving up on doctors.\n\nIt is time and energy you don't have, when there is too much else to get done.  I figure I may as well wait until I wind up in an ER, because I'm not getting help before then anyway.  I just have to hope it isn't the aneurysm that sends me there, cuz I may just roll straight into the morgue. 😂\n\nI can't really say if OP's wife is bitching all that much or if she just feels like he really isn't hearing how bad things are for her.  I'm going to guess ESH.\n\nOP sounds less than sympathetic to his spouse and her outburst may be in response to that.  And I know I'm tired of hearing about and experiencing my own medical BS, so I figure everyone else is, too.  So, if she's constantly focused on her health issues and never getting anything done on her life or the house or her relationship, I can see where that would get old.  No matter how tired (or afraid) you are, you have to try to live a little.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Also, not to sound insensitive, (i'm disabled by chronic illnesses too) but sometimes, when you are bad like 99% of your time, and someone expect you to make them the big play because they fell sick two days, it let me be like \"wtf??\"\n\nIt's not a misery contest, but if I'm barely able to through the day, I won't go all over someone else because they feel 'a bit unwell today'\n\nThe fact that the partner says \"I feel that every day\" is pretty significant... The man is probably amongst those who literally don't care about a possible chronic illness...\n\n&#x200B;\n\nI hope you are in a as good place as you can be despite it, tho!",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "It took me 8 years and a few dozen doctors telling me I was “fine” before a doctor finally figured out I had an autoimmune condition. Once I started treatment. It was night and day, but it took forever and continually advocating for myself to get there. It’s not so easy as “perhaps a doctor”",
                  "id": 74,
                  "comments": [
                    {
                      "score": 4,
                      "content": "People keep commenting that and I’m sorry it seems to be a theme for a lot of people. Doesn’t mean she shouldn’t try.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -24,
                  "content": "Except she refuses the doctor",
                  "id": 76,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I didn’t read that",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Therapy and perhaps a full health workup at her doctor. If she's struggling that much on the daily she may have some sort of undiagnosed condition.  I'm not a doctor, I'm not guessing the what, but even if it's nothing physical,  it doesn't hurt to look after her physical and mental health. Hell,  it could be just stress. As a chronic list maker and constantly carrying a mental load of this and this and this need to be done, I'm exhausted all.the.time. Is there something you can take off her plate to lighten the load (not insinuating you aren't doing enough,  but there may be something that's taking up a lot of mental space).\n\nTo call her narcissistic would be a bridge too far at this point.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I’m debating if they should stay married.",
          "id": 79,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "While I agree, I think I’ve read personality disorders were not a condition per say but just a personality type, hence why they are do hard to treat. Because there’s no cure but self awareness and self-will. Eta but I’m no mental health pro, so take it with a pinch of salt, lol.",
          "id": 80,
          "comments": [
            {
              "score": 2,
              "content": "Some personality disorders can be effectively treated and the symptoms can go away. For example, DBT works really well for BPD, which isn’t a personality type, it’s a maladaptive way of coping with extremely strong emotions, usually stemming from childhood trauma. Idk if NPD can be treated, though, since I don’t believe many people with that disorder present for treatment.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Disagree. This could very well be a case of vulnerable/covert narcissism, though we know very little:\nhttps://www.healthline.com/health/covert-narcissist",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1067,
      "content": "Edit -  Had no idea this had blown up while I was away from my computer. Thanks for sharing your personal stories and frustrations. <3 I read them all.  \n\n\nYTA. Please, *please* stop throwing around clinical terms like 'narcissist' at people to complain about their actions.\n\nI want to say first off that having a mental or physical illness is not cart blanche to treat someone poorly. If your wife has been taking her stress and malaise out on you, that's something she needs to address in therapy. If she has been throwing out distress signals for a long time and feels that they have gone unheard, she may be jealous enough of your physical well-being that, the instant you go down with an illness, she (inappropriately) jumps on the opportunity to point out that this is how she feels every day, and isn't it hard, and \"do you care now? Can you see and hear me now? Can you please hear me now?\"\n\nAsk yourself how supportive you've been of her difficulties. She also needs to take herself to task and address how she's been treating you. Stop calling her names and please help her to seek help for her issues. She may really need you and just not have the tools to ask you in an appropriate way.",
      "id": 83,
      "comments": [
        {
          "score": 423,
          "content": "I have NPD (yes diagnosed, and working on it) and she doesn’t sound like a narcissist… and NPD is a legit mental illness, using the term as a way to dismiss or silence someone is wrong in so many ways.",
          "id": 84,
          "comments": [
            {
              "score": 255,
              "content": "I'm bipolar and so sick of hearing people misuse it. Like no your boyfriend isn't bipolar, he just has anger issues. (Not you u/fluisterduisternis You're doing good in working on your issues & I wish you good luck on your journey to being the happiest, healthiest you that you can be)",
              "id": 85,
              "comments": [
                {
                  "score": 167,
                  "content": "Well damn… thank you for this. I’m used to being villified when coming out as NPD, and I guess it’s not entirely undeserved. But I want you to know that people symphatizing like you have a much bigger impact on my progress than you might realize.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 132,
                      "content": "The fact that you can acknowledge your diagnosis is in itself impressive, not even accounting for the work you are doing.  Kudos to you.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "No one should be villifying you for having NPD. It's not something you can help anymore than I can make my ADHD disappear. The fact that you openly admit it and that you're working on ways to manage it is a huge leap in mental health awareness. Honestly, and I don't want this to come across as condescending because I genuinely mean it, I'm proud of you for having the courage to own it. That's not easy but you're helping others who may be suffering in silence.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I’m pretty sure my mom has NPD in a clinical sense (I’m not privy to what exactly she’s been diagnosed with but everything I know fits NPD) but in the last decade she has gone to therapy, she has worked on herself, she has reevaluated her priorities, and she has gotten so so so much better. I’m incredibly proud of my mom and I’m proud of you; it’s hard shit to deal with and you’re putting in the work! There are lots of disorders and illnesses that make people difficult to deal with but if you’re putting in the effort and genuinely trying to improve yourself you deserve nothing but support. Keep up the good work!",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "We don't choose to have these issues. We can only deal with them as best we can. It's difficult & frustrating & it gets so tiring. But as we learn how to handle these challenges we're given the opportunity to learn how to empathize & support so many people beyond us. \n\nKeep making progress. Keep learning how to manage a difficult mental/medical/emotional condition that isn't fully understood. U/ok-acanthaceae5744 is right & kudos to you 😊",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "[deleted]",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "Preaching to the choir. Bipolar type 2 here. Any time someone does anything out of the ordinary, when the weather is changing rapidly, or someone is being moody, it's like some people just default to \"oh lol so bipolar\". Like dang, if y'all just knew how fucking awful it is to be this way, maybe you'd stop using it as a freaking adjective for funsies.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I have BPD, and I totally relate. It’s tossed around to basically mean crazy ex-girlfriend. I’ve seen so many posts about a crazy ex with “undiagnosed BPD.”",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Just curious how you ended up being diagnosed?. I’m fairly sure my mother is biopolar/and or NPD but as you can imagine so hard to try navigate it with her. Have suggested talking to doctor/therapy for years but she doesn’t engage. Her siblings all agree there is an issue but they are quite scared of her how she reacts when upset so tiptoe around her. I really don’t know what to do.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I had gone back to college & had pretty bad breakdown & wanted to end it all. Walked into the student mental health services & asked for an appt. They told me the next available was in 3 weeks & asked what it was about. Said I didn't want to live anymore. They asked me to sit down & got me someone right away. That started my journey.  \n\nI know that doesn't help you but I always found it a funny story (my humor is kinda weird)\n\nDo YOU have help? Until your mom is open to help there's not much you can do (or so bad that she can be involuntarily committed)\n\nKeep yourself safe first & foremost. Seek therapy for your own mental help. If your parent or family has a mental illness there's a higher chance that you do too. Being raised by/with someone with mental illness can give you issues that are best dealt with a professional. \n\nYou can learn healthy ways to set boundaries to keep yourself safe & healthy. \n\nI wish I had more encouraging words to give you. Even if you convinced your mother to seek help but if she won't accept that she needs help, you can't make her realize. You can only protect yourself.\n\nETA: Al-Anon is a group for family members of alcoholics but they deal with loving someone who has a problem. They would probably have better techniques that would apply to you. \n\nI would highly recommend therapy or counseling for you dealing with this. I wish you & your family the best ❤",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "My grandmother had NPD. And it was sad too because she fiercely loved her family but was so detrimental to her own happiness. \n\nI wish she had been diagnosed sooner. And I wish she had been able to work on it. \n\nNPD is a specific mental disorder. I am so done with people attributing just blanket “selfish” or behavior that you don’t like because it doesn’t serve you as “narcissistic”",
              "id": 96,
              "comments": [
                {
                  "score": 24,
                  "content": "I’m sorry you had to experience that. We’re a special brand of fucked up.\n(Note to self: no you are NOT SPECIAL ffs)\n\nEven being diagnosed isn’t a garantee for progress. I was furious about my diagnosis and refused to accept it for a long while. It’s been two years and I’m just now starting to become aware.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Haha. No. That’s ok. And just know that despite anything I loved my grandmother, I know she loved me.\n\nThere was some pain and heartbreak. But I also have peace and perspective now and appreciation for who she was. She had a wicked sense of humor and despite everything with the NPD still offered the world so much. She was a teacher/librarian at a school. She fought for teacher’s unions and raised two smart and funny kids. \n\nSo this always bugs me when people say narcissistic or hear NPD and just assume “bad” or only apply negative connotations or misrepresentation. \n\nAnd I’m glad to hear you are working on things. I think that’s half the battle.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "yes, people can be selfish or even deeply self-absorbed without having NPD.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Ditto with BPD. Drives me fucking insane.",
              "id": 100,
              "comments": [
                {
                  "score": 6,
                  "content": "Lovely isn’t it.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Absolutely this. OP became the AH as soon as he struck out at her in that way. It's not the same as saying she's blameless, but OP specifically asked, \"Hey, am I TA for saying this to her.\" The answer is yes and he should be taken to task for that. I agree with the top comment 100% that couples therapy would do them a world of good, but honestly I really am concerned about the wife's health. She sounds like she's doing poorly and could benefit from some workups -- metabolic panels especially. It could be a problem that's surprisingly easy to fix.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I've never seen/met someone admitting to being diagnosed with NPD,so for what it's worth, this internet stranger is incredibly proud of you! You must already have come so far on your journey to be able to say this. Good luck and all the best on your next steps. Keep up the good work (and listen to your therapist!).",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Narcissist is not exclusively a clinical term though.",
          "id": 104,
          "comments": [
            {
              "score": 61,
              "content": "Right, but OP's wife still doesn't sound particularly narcissistic in the non-clinical sense, either. They both sound difficult.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "But especially when it’s not an accurately used clinical term it’s an insult and usually a low blow. (Of course if you are in a relationship where someone has treated you so badly you fairly hurl that term at them in retaliation, it’s probably time to leave the relationship)",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I mean sure but if she’s also calling him names or just plain being rude, it’s pretty much obvious that he’s gonna snap, EHS in my opinion, we don’t know enough to really say he’s the asshole or she’s the asshole, At this point everyone sucks here until proven otherwise.",
          "id": 107,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "She won't go to a Dr... see Comments.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "So the wife isn’t wrong at all in this scenario?",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -4,
          "content": "So you think what she did was not an asshole move?",
          "id": 110,
          "comments": [
            {
              "score": 1,
              "content": ">AITA for telling my wife she is becoming a Narcissist?\n\nIt was an AHish thing to do, yeah. If OP's wife ever makes a post asking the same type of question I will gladly give her that AHish rating too. But in this particular conflict? He was definitely the one that pushed it too far.   \n\n\nAlso I don't do whataboutisms.",
              "id": 111,
              "comments": [
                {
                  "score": 2,
                  "content": "This sub LITERALLY has a vote for \"whataboutism\". ESH. It's literally there for when more then one person is an asshole.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -45,
          "content": "That's a lot of assumptions! So you really think OP is the only asshole here? \nWife really likes to complain (but not actually do anything to fix the situation) and takes it out on the poor OP. Does she even love him?",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -83,
          "content": "How many times did you write “it sounds like”. Your comment is all speculation and guessing. The amount of mental gymnastics to put all the blame on OP was impressive though.",
          "id": 114,
          "comments": [
            {
              "score": 80,
              "content": "Probably because they are intelligent enough to realise that with this statement alone they can not say for sure. By default, it *is* speculation and guessing, hence, sounds like.",
              "id": 115,
              "comments": [
                {
                  "score": 16,
                  "content": "That’s really narcissistic of you /s",
                  "id": 116,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Way to make this all about you and not even consider asking how beaute-brune is feeling today /s",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "I read it over after posting and blame the brain fog on the overused phrase lol. I'll edit so it sounds less repetitive but my opinion still stands. Short story, don't call people narcissists. Let the therapist figure that out.  \n\n\nedited. OP is still TA, but now the phrasing should annoy you less. <3 <3 <3 <3",
              "id": 118,
              "comments": [
                {
                  "score": 0,
                  "content": "Personally ESH. Making pain a competition is never fun, but if his wife has been having a hard time for over two years, something should have done before.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 25,
                      "content": "There are some people who run pain Olympics just for love of the sport, and others who do it because they're not getting a response when they tell others they're hurting. Without knowing them personally, it's impossible to tell which it is, but you can tell a lot by the way an OP words their post. Extrapolating is the name of the game on AITA in order to make judgments. I really don't like how OP referred to his partner and spoke about her problems, and if I didn't like it as an internet stranger, she probably likes it even less.",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 556,
      "content": "I feel like saying YTA for 2 reasons.\n\n1. \"These types of scenarios have been occurring a lot more in the last 2 years ...\"\nThat tells me, your wife has always been like this. And you married her regardless. \nAnd over the last 2 years, you've gotten more and more annoyed. \n\n2. What's with the \"narcissist\"-label?\nDo you have to diagnose her?\nTell her you are hurt by what she seid. Tell her she makes you feel bad. Tell her, double standards are not helping. \nBut words like \"narcissist\" are like hand-grenades. Once you've thrown one, there'll be a lot of damage. And you won't be able to keep it under controll.",
      "id": 121,
      "comments": [
        {
          "score": 54,
          "content": "How does your first point make only him TA? Seems like an ESH unless you're implying that she doesn't have responsibility for her actions",
          "id": 122,
          "comments": [
            {
              "score": 75,
              "content": "Means that he knew she had health issues so he didn't enter into a marriage to be blindsided by someone who had chronic issues",
              "id": 123,
              "comments": [
                {
                  "score": 9,
                  "content": "Chronic issues with no diagnosis and no attempts to change things. \n\nI have auto immunes, I get how long a diagnosis can take, I get how hard managing a condition can be, but yes she's responsible for taking action and this BS \" well you married her\" is just absurd. \n\nShe is self absorbed which is what I assume he meant by narcissist. She should leave the poor guy alone like he's sick.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Buy its okay for him to needle her even though she's going through it every day?\n\nDo you know how hard it is to get a diagnosis for a chronic condition as a woman? Have you looked at the average diagnosis times for (for example) endometriosis?",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Oh, check which sub this is on, i think you might be lost",
              "id": 126,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -5,
              "content": "I don't get the concept of \"ESH\"\n\n\nWho cares, whether SHE sucks. It's already a well established fact, that she sucks. There is no doubt about her sucking.\n\nBut I don't care about HER. \n\nHE is the one on reddit. He is the one asking AITA. He is the one, who was so desperate or so afraid of ending up alone, he married a woman with habbits and a behaviour that obviously never matched his at all. \n\nThis was never going to work. And he should have known.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "She won't go to a Dr or talk to someone!... see Comments. She'd rather have something to bitch about.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 401,
      "content": "YTA. It sounds like your wife has a chronic illness, maybe even multiple. She also sounds like she's at the end of her rope trying to get you to see that and empathize/sympathize. Was it the best moment to tell you when you're sick? Probably not. But it does make me wonder how many times she's tried to express this and you've shut her down because she doesn't deal with her illnesses the way you do.\n\nI was going with E S H except that you went for a low blow by comparing her to her father. What did you think that would do?",
      "id": 129,
      "comments": [
        {
          "score": 45,
          "content": "\"...how many times she's tried to express this and you've shut her down...\" \n\nThis is a complete assumption. We're assuming she has good communication and didnt just let this build up, only to blow up when he got sick.",
          "id": 130,
          "comments": [
            {
              "score": 75,
              "content": "Her communication may or may not be good, but I’d like to know about OP’s listening skills…",
              "id": 131,
              "comments": [
                {
                  "score": 42,
                  "content": "[She literally refuses](https://www.reddit.com/r/AmItheAsshole/s/3Ma5jvyvdw) to see a doctor and go to individual or couples therapy, yet complains to her husband and everyone around her. It sucks that she’s dealing with either a physical and/or mental illness, but there’s only so much sympathy you can extend to someone who refuses to help themselves before losing your patience.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 16,
                      "content": "To be a little fair, sometimes if you see a doctor they just blame things on your period or your weight (even if you lose weight) or any number of things that aren’t helpful (you should exercise more even if you can’t, get more sleep, try eating these things etc that even if you can manage them it doesn’t help and some people can’t). It also gets discouraging to test for things and have those things not turn out to be anything and you still feel like crap and they don’t know why. It does feel like a waste of money.\n\nAnd the answer is just to get another doctor and try and push through until they can finally find something that either a.) is a reason that was hard to find or at minimum b.) find something to help with your symptoms. But this can take literal years and a good team and it’s exhausting. I’m not excusing her behavior about yelling at her husband while sick and like I said you shouldn’t give up entirely because you’ll never find help that way so I’m not defending the way she’s living, but I do understand why she feels that way because I have in the past felt that way myself.\n\nI also know it can be very draining to be on the other side (in my case it was for my poor family having to watch me be in pain and hear me be upset), so I understand what he means, and I did my best to not go at it too hard, but sometimes it felt like I had to or I’d lose my mind and snap (and I’m sure to some people it felt like I was still complaining too much even though I was trying very hard and I do feel bad for them for that even though I know I did my best). But my family never told me I was a narcissist for it, and they were with me for the years it took for me to get help (if anyone was curious I finally found out I have Sjögren’s syndrome. I can’t be cured obviously haha but I have gotten on a regimen of things that help me live a kind of normal life).\n\nAgain I know OP isn’t engaging in the years it takes of find help nor is it okay to yell at her husband when he’s sick, just explaining from the chronic illness side how some of these behaviors happen.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "It gets rough. I have multiple chronic illnesses. Every time I go to a doctor, it's such an emotional rollercoaster that at some point, I just give up because it takes too much of my already lacking energy and brain power.\n\nIndividual therapy sounds good but definitely not couple's therapy. As OP has no problem throwing sensitive topics back at his wife just to hurt her, I wouldn't want to give him even more tools to do that.\n\n\"You act exactly like your dad who came to visit you in hospital to complain about his non-issue medical problems. Just like now, you complain about your non-issue medical problems while I'm actually feeling off.\" It's a double whammy. Hurt her by comparing her with someone who hurt her and dismiss her health concerns at the same time!",
                      "id": 134,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Maybe OP’s listening skills are fine and he’s tired of having to validate her complaining every single day of his life. It’s exhausting. We don’t know if he’s empathized previously, idk why everyone is assuming he hasn’t.",
                  "id": 135,
                  "comments": [
                    {
                      "score": -6,
                      "content": "Because he’s a man. He’s obviously never listened and have poorer communication skills than all the women in the world. His wife must have been putting in all the effort and communication in the relationship. /s",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "Why would it be \"..may or may not be...\"? I think both expressing and listening are critically important.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Isn't this what the whole argument was about? She telling him everyday how she feels and he not acknowledging it?",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah this post screamed ‘missing missing reasons’ to me, I would not be at all surprised to hear that his wife does in fact have a diagnosed chronic illness/fatigue condition that he has just ignored or dismissed because it’s not visible like more physical illnesses tend to be, based on how dismissive he seems to be based on this post (she doesn’t go to the gym enough or eat well enough for him so it’s her fault she often doesn’t feel well).",
          "id": 139,
          "comments": [
            {
              "score": 1,
              "content": "It's so sad to me how prevalent this attitude is when it comes to chronic illness. I can't imagine my partner treating me this way 😭",
              "id": 140,
              "comments": [
                {
                  "score": 1,
                  "content": "I know right? Makes me even more grateful for my partner, he’s an absolute angel.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "But imagine if it was a husband acting like that towards his wife.\n\nWould you still say he wasn't TA? \n\nI've seen so many posts inverses to this that always said NTA.\n\nNoone ever tries to justify a man acting selfish with chronic illness.",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "She's not sick, she's lazy. She's young enough to feel fine. She refuses to eat right and work out. He should leave her.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "She won't go to a Dr or talk to someone!... see Comments. She'd rather have something to bitch about.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Hard to empathize when she acts helpless and does nothing to improve her situation.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -9,
          "content": "She doesn’t eat well or exercise and yet is mystified by why she feels tired and crappy. She doesn’t have chronic illness. Plus, OP has detailed she refuses to go to the doctor. She just wants to complain but doesn’t want to take any necessary steps to fix what she’s complaining about. Tiring and miserable.\n\nNow, on the flip side. I have no idea what OP means by all of this making her a narcissist. It’s way off base in terms of what narcissism actually is, and calling her that to her face is confusing and unproductive. Plus, comparing her to her father is a low blow.\n\nNeither seem too fantastic, to tell you the truth.",
          "id": 146,
          "comments": [
            {
              "score": 120,
              "content": "I have chronic illnesses and on the outside it looks like I don't eat well or exercise. Both symptoms of my illness and an absolutely frustrating catch 22. \n\nI also hate going to the doctor because it can feel pointless, demoralizing, confusing, anxiety riddled and so on. Unless of course you have a good care team which includes a supportive spouse. Or at the very least a spouse who doesn't diminish or deny those experiences. edit; I also live in Canada where I have access to healthcare paid by taxes. Imagine getting the run around and you have to pay out of pocket? I'd never go!\n\nOf course this is my bias and very well may not be the case in this situation. But with how OP speaks about their spouse, I wouldn't be surprised.",
              "id": 147,
              "comments": [
                {
                  "score": 53,
                  "content": "Yep. As someone with multiple chronic illnesses, no one under 40 (probably older tbh) gets treated with any sort of respect or understanding when it comes to our illnesses (when we finally get diagnosed) because we're deemed \"too young\" to be able to \"understand real problems\" which leads to a massive rate of missed diagnoses, often to the point where any treatment that could have been more effective years ago will no longer provide the same relief, but that's if they don't accuse you of drug seeking, blame being female, blame mental illness or any other disability and actually diagnose you",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I was about to say I likely eat more chocolate ice cream than I should. I have ADD and Anxiety and the chemicals and minerals my brain are more short on do actually show up in chocolate ice cream so I unknowingly had cravings for specific minerals.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You need to developed a taste for dark chocolate, like 50-70% cacao. Shit honestly changed my life. I eat a little square in the morning instead of coffee",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -3,
                  "content": "he lives with her. its likely that he Sees with his own 2 eyes tge crap she eats/doesnt eat and her activity level. \nif shes relentlessly complaining about not feeling well but Doesnt go to dr or try to seek a remedy then she cant expect people to continually Empathize/sympathize with her...like at least TRY to change something or seek help from professional(dr etc) , try to narrow it down amd try ANYTHING to help make it better...",
                  "id": 151,
                  "comments": [
                    {
                      "score": 6,
                      "content": "He might see that, but he probably doesn’t understand WHY that is since he’s not, you know, in her body. It’s easy to look at someone and judge their lifestyle.\n\nCorrect exercise and diet could probably help the wife a lot. HOWEVER. She may very well have an issue / issues which she doesn’t even know about herself, let alone OP. He should be offering encouragement and help, not criticising her. She clearly doesn’t feel supported by him, because he isn’t supportive of her. OP may find she ‘complains’ less if he just offers some sympathy and validation.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -22,
                  "content": "But do you constantly complain?",
                  "id": 153,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Maybe for some! There's always something wrong with me haha",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I'm not weighing in necessarily about the wife's behavior, but I can tell you from personal experience medical bias is a real thing that can make going to the doctor a trying experience for women (and even more so if you are also a member of other marginalized groups). \n\nYou get told your problems are not actually problems or that they are due to period or your weight or your mental health. And while those things may be true, these reasons are often given without the appropriate investigation or these reasons are actually symptoms of other issues.\n\n Serious medical conditions are often left untreated. Getting the run around makes it so defeating to go to a doctor when you know they are going to basically pat you on the head. On top of all of that, exercising when you feel chronically fatigued is really hard and probably takes more energy than you get out of it. While eating a healthy diet is always a good idea, doing so takes a lot of mental energy that people with chronic health conditions struggle to maintain.\n\nSo imagine a scenario where OP's girlfriend is developing hypothyroidism, or she has long COVID or anemia... She may have sought help in the past and been told it was just in her head. Her boyfriend tells her to get in shape or stop complaining, but she is just so tired and can only focus on getting through the day. She may not be the whiney, selfish person that OP sees, just a chronically I'll person. \n\nAgain, I don't know about OP's situation. However, I know that a relative of mine said I loved to complain and wouldn't help myself. Turns out, I had an undiagnosed health condition. The doctors were shocked that I was doing as much as I was, considering the state of my health. Going through that (and seeing it happen to friends) has made me side-eye anyone who talks about a woman in their life like OP is doing.",
              "id": 155,
              "comments": [
                {
                  "score": 30,
                  "content": "This.\n\nMy therapist is constantly telling me that she can't believe how much I have to deal with, because for a long long time I just blamed myself for everything, like I could magic all my health problems away, largely due to being told I complained too much as a child, which... undiagnosed autistic and collagen disorder that caused a lot of pain, but I didn't know how to describe it, and it was always labelled \"growing pains\" will lead to that, and by the time other health conditions started to mess with my body, I was already conditioned to just \"suffer quietly\".\n\nAt 24, I've only just realised that yes, I am allowed to talk about my pain and how my good days are at a 5-6 on the pain scale instead of 8-9 during bad days, and that for people who don't know how chronic pain and illness impacts you, they would be rolling around on the floor. But we can't just do that. We still have to find a way to function as much as we can.\n\nOnly other chronically ill people seem to understand that. And a lot of people who aren't chronically ill just act like yoga or whatever the fuck will make us feel better, or that going to a dr will result in anything but being dismissed, belittled, or straight up told we're exaggerating.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yes!!! \n\nAnd the aggravating cherry on the shit sundae is when you've asked for answers for ages, got told it was nothing, and then something big happens and the medical professionals exclaim \"why didn't you get this checked out sooner?!\" Or my favorite \"why didn't you say it was this bad?\". \n\nIncidentally, this happened a lot during my pregnancies, which were high risk and I was under the care of a specialist. The first pregnancy, I told the doctor that I was having painful contractions fairly consistently, they said \"oh that's normal, just Braxton hicks\" over and over until I was actually having the baby way too early. I got asked on the delivery table \"why didn't you tell us you were in labor earlier?\" \n\n Another pregnancy, I kept telling the doctor that I always felt like I was coming down with the flu, I was beyond tired, and felt winded. The doctor told me that I had gained too much weight and that feeling like this was normal for the second trimester. At some routine blood work at 7 months, it was found that I was dangerously anemic. The doctor said if I had given birth right then, I could have bled out. Then she asked me why I didn't tell her my fatigue was so bad. \n\nIt was so unfair and so maddening. Like it was my fault I didn't say it exactly the way that would have made them realize what was going on.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I guess this is a big question, though, that the OP doesn't clarify: \\*has\\* she sought medical treatment? I mean, even if she didn't get a diagnosis per se, if her malaise is serious enough after that long, only speaking for myself, I would at least get it checked out.\n\nAnd I don't say this because I want to discount her experience; I have a number of friends with chronic conditions - some of which haven't really been adequately diagnosed or treated. I also have known people who simply appear to be chronic complainers and attention-seekers and those people are also real. But...\n\nESH. Yes, it's poor form/ communication to kick OP while he's down and to make his illness into some kind of contest. Making OP's sickness about herself is ill-timed at best, selfish at worst.\n\nAt the same time, now this is an opportunity for OP to approach her with empathy, apologize for her not feeling heard, and really listen. Encourage her to get it checked out if she's feeling that unwell for so long, not out of an attempt to silence her, but in an attempt to hear her and care for her.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yep, it took me eight years to get diagnosed with fibromyalgia at age twenty-four, and longer than that for depression and anxiety. After going to yet another specialist who told me nothing unusual showed up, I just started crying. He looked puzzled and asked my mom if I needed to go to a counselor, because why was I crying at good news? It was because I knew I was sick and wanted to know what it was and how to take it down. (I have a splendid guardian angel doc and am doing MUCH better now.)",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Are you a doctor? Is she your patient? \n\nHaving a chronic illness makes you feel like shite, you don't want to eat, and exercising when you have some chronic illnesses is an impossibility.\n\nAnd not wanting to see a doctor also doesn't mean there isn't anything wrong with you, it could mean anything, that she's afraid of what they will say, good or bad, or that she genuinely doesn't have anything wrong with her or, as in my case I couldn't even communicate what was actually wrong, I just knew something was because I felt like absolute shit. 3 years of feeling like I could just lie down and sleep for a month, or not sleep for days on end, non stop cravings for unhealthy foods, not eating for weeks. I couldn't describe any particular issues apart from feeling crap. \n\nTurns out I have Addisons disease or adrenal insufficiency. It sucks because I look \"normal\"",
              "id": 160,
              "comments": [
                {
                  "score": -3,
                  "content": "Well, I don’t know what to tell you. \n\nOP never specified that she has a chronic illness. If she won’t tell him, and she won’t go to a doctor, then he’ll never know. So I guess the only solution is to complain away?\n\nThat doesn’t sound like fun. I’m sure it’s difficult. But if she’s just going to just mope and dope endlessly without ever looking to aid the problem, then I’m not sure what she should expect. It’s not everyone else’s responsibility to be miserable just because you are. \n\nI’m not even trying to go to bat for OP, because he seems like somewhat of a piece of work himself. But you referenced her directly, so that’s my take. At some point, people get tired of endless complaining with no solution. Likely because it’s very tiring.",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "She could very well be depressed, with eating poorly, not exercising, not seeing a doctor as symptoms of it. A complete lack of motivation is a sign of something going on.",
              "id": 162,
              "comments": [
                {
                  "score": -8,
                  "content": "Maybe. But the complete rejection of help and/or attempting to fix the problem(s) is what I can’t sympathize with. Because that just becomes a never ending cycle that engulfs everyone around them. It’s ok to not be well, but if you refuse help/solution AND continue to make everyone else suffer for it? Then I can’t be bothered.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah, well no one said that depression is logical.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -14,
          "content": "Or she just likes to complain??",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -16,
          "content": "Bring chronically ill does not have to mean being a chronic complainer. Complaining doesn’t help at all and is simply annoying and stressful for others. Keep your negativity in check.",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -22,
          "content": "Constantly complaining about it while doing nothing to change the situation earns zero sympathy if you ask me. I wouldn't give her the attention she is seeking either cause that's what it really comes down to.",
          "id": 167,
          "comments": [
            {
              "score": 21,
              "content": "I guess I think about my partners differently, because they're my partners who I genuinely care about, not some stranger or passing acquaintance. I don't believe that attention-seeking is always \"what it really comes down to\" - I think a lot of times there's something deeper going on, whether they realize it or not.\n\nIf my partner is attention-seeking, why? That suggests to me there's some sort of unmet need that is worth considering, not out of obligation but because I care about them. Sometimes that need is ultimately outside of my ability to control or provide, but approaching it with curiosity and empathy might help both figure out what's really going on.\n\nMaybe that's legitimate medical care for an undiagnosed issue. Or maybe it's a manifestation of childhood neglect and she needs therapy. It might take some doing to get either addressed, but if they can't really have that conversation, then it never will be.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "If you can't be sympathetic to your spouse why even get married? Or stay married? Seems like a miserable situation for everyone involved.",
              "id": 169,
              "comments": [
                {
                  "score": -11,
                  "content": "I mean, he says in the post that's he tried to be sympathetic for years now. How do you think you'd hold up living with someone who whinges and moans about every little thing, refuses to do anything about any of it, and then flies off the handle at you when you have one bad day?",
                  "id": 170,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That’s what he said, yes. But what does that mean? How did he express that to her? ‘Trying to be sympathetic’ could be gritting his teeth when she tells him she feels like crap, or giving unasked for advice, or a number of other responses which may not be helpful. Additionally, ‘trying to be sympathetic’ may mean he wasn’t truly feeling sympathy, just being  insincerely soothing which would be very frustrating to the wife.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 260,
      "content": "Your wife sounds depressed not narcissistic.",
      "id": 172,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 197,
      "content": ">She tells me that the way I currently feel is how she feels everyday and that I never acknowledge her efforts for only mildly complaining everyday instead of losing it completely.\n\nNTA  b/c justified.\n\nBecause I know exactly how this shit feels. I shatter my kneecap into bits last year? Suddenly my wife is complaining non-stop about hip pain without ever following up. I suddenly deal with nerve issues leading to numbness/weakness/tingling in my right hand and wasting away of triceps? Suddenly my wife has this horrible hand injury that OMG OW THAT HURT, and again, *does not do anything about it*. I'm sick? She's sicker.\n\nOn and fucking on.",
      "id": 173,
      "comments": [
        {
          "score": 99,
          "content": "My mother does this, she complains CONSTANTLY of various aches and pains but completely refuses to go to a doctor (but will immediately tell me or my stepdad to go if we have issues). If I complain about any pain/sickness, she gets super huffy about how I 'can't possibly be having a bad time compared to HER bad time'. She was really surprised the one time I called her out for it and pointed out that more than one person can have something wrong with them at once, and to let me vent about my thing without belittling me",
          "id": 174,
          "comments": [
            {
              "score": 20,
              "content": "Yep! Definitely seen this thing.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Reading this made me realize how much of a trooper my mom is.\n\nShe had a car accident nearly 20 years ago which shattered one arm from wrist to elbow into so many pieces that the doctors gave up counting. It has healed over many years of arduous therapy, but she had to deal with constant pain, aches, and cold sensations in that arm ever since.\n\nI don't think I ever heard her moan about it, even when visibly in pain.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "This is exhausting to deal with when it’s just a friend. I can’t imagine living with a person like that or worse being married to them. Yikes.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "His wife prob feels the same way about him, because he dismisses and minimises her issues. \n\nShe's sick and he never listens. Why do you assume *her* chronic condition is exaggerated/not real? Both of you are calling OP's wife a lying malingerer on no other evidence than the fact that you can't feel her pain because you're not her and also \n\nher condition *inconveniences OP* so it's just a lie.",
          "id": 178,
          "comments": [
            {
              "score": 23,
              "content": "its exaggerated because she's not done anything to fix it. He described how she doesn't practice any type of self-care.",
              "id": 179,
              "comments": [
                {
                  "score": -18,
                  "content": "It's difficult for women to get proper healthcare for their symptoms.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 10,
                      "content": "[deleted]",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "This has absolutely been my experience. It took me 16 years to get diagnosed with my chronic illnesses. I was always dismissed and told it was IBS or anxiety (I have systemic muscular dysfunction). I still don’t know the root cause or even a treatment that might help. I was only diagnosed because I did all the research and figured it out on my own, and when I did, I booked straight into the specialists in those disorders for diagnosis. And yet I’m still dealing with doctors (even at the ER when I collapse in excruciating pain) telling me it’s in my head or I’m just over-exaggerating / sensitive / anxious.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "There's no indication that she's actually tried to get it. She also doesn't exercise and eats like shit, according to OP.",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 0,
                      "content": "Do what now? Where do you live? I’m a woman, and I’ve never had any issue getting proper healthcare. And I live in one of the states that’s considered at the bottom for everything.",
                      "id": 184,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "She won't go to a fucking Dr or talk to someone!... see the Comments. She'd rather have something to bitch about.",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "So weird.  I hope there are many positive things about your marriage to more than make up for this weird behavior",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -14,
          "content": "Are you secretly writing about my marriage? 🤦🏻‍♂️😂",
          "id": 187,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 166,
      "content": "You don't know what the word narcissist means. \n\nStop using it.\n\nESH. Learn to communicate like adults or get a divorce.",
      "id": 188,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 116,
      "content": "YTA\n\nBy diagnosing her you've ended any productive conversation. It's yes you are vs no I'm not until someone wins. \n\nTalk about your actual concerns, not your diagnosis. She sounds more depressed than narcisistic anyway.",
      "id": 189,
      "comments": [
        {
          "score": 6,
          "content": "She won't go to a fucking Dr or talk to someone!... see the Comments. She'd rather have something to bitch about.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 94,
      "content": "Yta\n\n1. There's nothing that you say that makes her a narcissist \n\n2. Narcissist is a diagnoses of a disorder and you can't say it that easy without beïng an AH\n\n3. She's not like her dad, you're acting like her dad. You feel a bit ill, o boehoe, she got to feel that way everyday. \n\n4. She just needed you to let her know that you appreciates what she does while not in good health. She needed a bit empathie now you also feel off.\n\n5. You start by telling us how you do everything perfectly and taking care of your health and she is not. So you basicly want to paint a picture that it's her own folt she feels sick.\n\nI do understand why you not going to the gym triggerd her. She's feeling like shit everyday and you problebly keep reminding her she needs to go to the gym. And now you feel that way and you don't even go yourself...\n\nThink about, witch one of you two are showing narcistic behavour... hint, it's not her.\n\n(I say showing behavour, not that you are! That's not up to me and that's not an easy diagnoses)",
      "id": 191,
      "comments": [
        {
          "score": 15,
          "content": "I totally agree with you. The fact that he has to tell us that he \"takes care of himself unlike her\" implies he actually does think she is at fault for her illness. \n\nI finally got treated for endometriosis which has improved my life 10000%. I am no longer constantly in pain and sick. But...but...but...I am still so tired. My husband and I both eat healthy, do yoga, and we don't have a car so we walk and bike everywhere. But still, I don't feel as well as him. I'm glad he is sympathetic and never makes me feel bad for not being able to do as much. I would feel so triggered if he claimed that he can do more because he can do more and I'm just lazy.\n\nOp, yta",
          "id": 192,
          "comments": [
            {
              "score": 7,
              "content": "I also have have endometrioses. I do understand why she doesn't wanne see a doctor. It's so frustrated every time you just hear how \"It's normal\". \"It's all in your head\", you just give up at some point until you can't even go to the bathroom by yourself and only when my husband said he was worried, they wanne take a good look and it was like, oh... i'm sorry we missed this for 15 years!!! And i live in a country where insurence paid the healthcare. If you have to pay for yourself, just to hear that again it really would feel like a waste of money.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "She most likely is at fault for how she feels. People need to stop using chronic illness as an excuse for those who don't take care of themselves. She sounds lazy and entitled.",
              "id": 194,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -1,
              "content": "She won't go to a fucking Dr or talk to someone!... see the Comments. She'd rather have something to bitch about.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "She's \"triggered\"... fuck off. There's something seriously wrong with her, and she refuses to see a Dr or talk to someone. I'd snap at her for constantly bitching too, instead of helpimg herself. Those people are soul draining.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 68,
      "content": "YTA, mainly because if my partner was constantly getting sick and feeling ill then I would go out of my way to get them to a doctor. She could have long COVID, a chronic illness, etc. She should be getting help.",
      "id": 197,
      "comments": [
        {
          "score": 78,
          "content": "She refuses. Tried forcing the issues but she claims its a waste of money. Tried to advise therapy for her or us. She refuses.",
          "id": 198,
          "comments": [
            {
              "score": 97,
              "content": "I get this - I don't think everyone calling you TA is fair here.\n\nIt's like that one friend who complains incessantly about her love life/job etc. but doesn't take a single step to remedy anything.\n\nIt's utterly exhausting - listening to the same complaints day in and day out, giving the same advice back constantly knowing they won't ever listen to it or take action.\n\nTo be honest, at some point you've got to ask yourself: is maintaining this relationship draining your happiness? In many scenarios, it feels like a relief to ditch people who are this emotionally draining.\n\nYour wife won't help herself, but gets annoyed that you won't fawn over her endless whining. I couldn't put up with this personally. Life's too short.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "It took me three years to be diagnosed with a B12 deficiency. Why? Because my misogynistic doctor at the time refused to listen to me, and I had to take my husband into consultations with me otherwise I'd be treated like a hysterical woman. My husband noticed my going downhill and being seriously fatigued and anxious. But it wasn't until I saw a different doctor when I'd reached the end of my tether who listened and set up urgent blood tests that my deficiency was found and I began treatment. \n\nI totally understand her refusal because of the way I was treated in the past.",
              "id": 200,
              "comments": [
                {
                  "score": 30,
                  "content": "Even the way OP writes this implies he thinks she's overdramatic about her illness.....hmmm gee I wonder why she thinks perhaps she won't be listened to when she tells someone about her physical ailments.....\n\nHell, he comes close to outright saying he thinks it's her own fault she feels like shit. Again, really a mystery why she feels like a doctor would be a waste of time...",
                  "id": 201,
                  "comments": [
                    {
                      "score": 17,
                      "content": "He says she is overdramatic about everything, including working from home, the weather etc... If someone is overdramatic about everything its hard to figure out what is warranted and what is not.",
                      "id": 202,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Your anecdotal experience would only be relevant here if she’s already tried seeing a doctor with him and had a dismissive experience or two, but it sounds like she hasn’t even attempted to get a first or second opinion yet. That coupled with refusing therapy absolutely makes her the AH. You can only help those who help themselves.",
                  "id": 203,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I dropped like 30lbs in 6 months, got hives on and off randomly, a rash on my face, hallucinations, and extreme fatigue and went to about 6 doctors who half heartedly ran some tests but mainly just lectured about “the risks of anorexia”\n\nEventually after about a year of symptoms and no diagnosis it kind of went away with ocasional mild recurrences. 4 years later i got extremely ill with sweats, shakes, seizures and motor dysfunction and went to the ER and they discovered I had an autoimmune disorder that had been attacking my liver and kidneys for years!! I gave up going to doctors because they DIDN’T LISTEN when I knew something was wrong!",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It took me 16 years to get diagnosed with a few muscular disorders because doctors kept dismissing me and telling me it’s just IBS or anxiety. I only got diagnosed because I did all of the research myself, figured out my diagnoses, and flew halfway across the country to see the specialist who named one of the disorders for professional diagnosis. And yet, since my issues are prettt unknown in the medical world (one didn’t even have a name until 2019), I’m still dismissed by doctors, always told it’s IBS or anxiety, even with specialist diagnosis.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thats wild to me because thats an easy diagnosis. A simple CBC which is a part of physical lab work everywhere easily tells you this. Hemoglobin down, MCV elevated. Classic algorithmic treatment of fatigue defaults to a CBC anyways. You sure you saw a real doctor? Not a nurse practitioner or PA? Your scenario is one of simplest you would ever get on a board exam. Pretty wild you had to do that much for something so simple. Sorry about that.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Do you go to therapy? It will definitely help you deal with conflict like this more productively. Or maybe even help you reconsider whether this is a healthy relationship for either of you.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I hear you OP, calling her a narc wasn't the right move but I do get your frustration. It is intensely draining being with a spouse who is content to complain every day but does not do anything to address the issues - I think you could try apologising for the narc comment, and then clearly stating to her that something needs to change or you will not be staying in the relationship. \n\nHaving someone with such a negative frame of mind offloading to you all the time wears you down after a time. For your part, in future - be wary of what you let slide and practice calmly telling the other person how their behaviour affects you. If they flip out at your response, it means they have a bit of work to do to be a good partner.\n\nIt can be hard to navigate trying to have empathy and be supportive, but not to get in to a situation where someone is just using you as their emotional support crutch.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "If you've made it clear you'd support ways for her to get treatment, then definitely NTA. \n\nYou're nicer than I am. If someone has a problem they refuse to solve, I will eventually just tell them I'm no longer the audience to complain to. Something like \"honey, I love you, but I can't listen to you be in pain/tired every day for the rest of my life. If you don't want to see a doctor, that's your choice, but I can't listen to you talk about it without trying to make it better. If you ever do want to see a doctor, I'm here to help and be supportive of that. I'm really sorry you feel so bad, but I can't have our entire relationship revolve around how you're feeling every day unless I know we're working as a team to make it better.\"",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "If she refuses to get help than you have every right to exit the marriage. Nobody deserves to be miserable.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "It's very difficult for women to get proper healthcare for their symptoms, bordering on impossible. Unless YOU find her a doctor, go with her and force him to work on her, you're not helping. \"Just go to the doctor already jeez\" does not help.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "Why would she go pay someone to invalidate her experience when she seems to be getting that for free at home?\n\n Read your first paragraph again and think about how it must feel to her to have every issue she has brushed away as something she must have done wrong. This is how women are treated a lot for physical/mental illness that doesn't have an obvious cause. You want her to feel like going to a doctor would actually help? Be on her side instead of blaming her.",
              "id": 212,
              "comments": [
                {
                  "score": 1,
                  "content": "She is to blame...",
                  "id": 213,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}