{
  "post content": "\n\nI'll preface this by saying that I (M35) am a widower with 2 kids (9, 11). I recently got back to work and since I work nightshifts, I had to get the kids a babysitter (they're at school during the day and my sister stays with them) I was able to find a babysitter with the help of a co worker (actually they're related) and things have been going pretty well except for few days ago.\n\n\nThe babysitter called me while I was at work to tell me that my 9 year old daughter broke her glasses, I got home, heard both sides of the story and came to a conclusion that it was in fact an accident. but the babysitter said my daughter broke them intentionally after she refused to let her outside late in the evening. I asked my 11 year old daughter and she said the babysitter's story is accurate but since she and her sister have a beef then, I figured she lied to set her sister up. my 9 year old daughter cried and said she didn't mean it and it was an accident. I apologized to the babysitter for the misunderstanding but she insisted there was no misunderstanding and then asked me to pay her for a pair of new glasses. I was taken aback by her request and told her I thought we talked this out and rolled it out as an accident but she insisted it wasn't an accident. I apologized but refused and said it was unfair to expect me to pay, especially since she didn't pay attention to keep her glasses safe regardless of wether it was an accident or not. The babysitter argued with me then started crying swearing that my daughter broke them to get back at her. My 11 year old daughter sided with her but my 9 year old said she is only siding with the babysitter for her own benefits. The girls started fighting and I ended up telling the babysitter to leave. she got my co worker involved and she said I should take responsibility and pay the babysitter for new glasses since she can not afford them being a broke college student and in need for glasses. I apologized but refused to pay, my co worker got upset and shamed me for condoning my younger daughter's actions and treating the babysitter poorly when she's the victim in this situation.\n\n\nIt's been days and the babysitter is still wanting me to pay for new glasses but I feel like she's trying to use the fact that I'm in dire need of help and is hoping to get extra money out of my pocket.",
  "id": 1,
  "comments": [
    {
      "score": 58765,
      "content": "YTA. It doesn't actually matter if it was an accident or not, your child broke her glasses so you need to pay to replace them.",
      "id": 2,
      "comments": [
        {
          "score": 27166,
          "content": "Yes! Regardless of intention, her glasses are now broken because of his daughter. Just because she didn't 'mean' it doesn't mean it has no consequences.\n\nOP, YTA and massively.\n\n>I asked my 11 year old daughter and she said the babysitter's story is accurate but since she and her sister have a beef then, I figured she lied to set her sister up.\n\nThis reeks of favoritism. Two out of three people told the same story, and you choose to believe the other one? Your children should be equally credible in other situations, and the 11 year old is even more credible here because the babysitter backed up her story.\n\nThere's no basis for you to make that conclusion besides the fact that you obviously consider your youngest the golden child.\n\n>I apologized but refused and said it was unfair to expect me to pay, especially since she didn't pay attention to keep her glasses safe regardless of whether it was an accident or not.\n\nSo it's her fault *your child* broke it? Regardless of whether it was an accident or not, she shouldn't have to foresee the kid's tantrums.\n\n>I feel like she's trying to use the fact that I'm in dire need of help and is hoping to get extra money out of my pocket.\n\nOr maybe she's just a broke college student whose glasses - a medical accessory needed for *seeing* \\- your daughter damaged?\n\nOP, you're being a horrible father to both your children.\n\n1. You obviously favor your youngest over her sister, which I assume is a pattern and not just because it saves you money. Why are you so quick to assume that she's lying when her sister has a much more obvious, and valid, motive to lie?\n2. You're teaching the 9 year old some dangerous lessons. What your actions indicate is that, not only does damaging others' property (even accidentally, which I doubt) have no consequences, lying will also be tolerated as long as it serves you. Not good lessons to teach a 9 yo, are they?",
          "id": 3,
          "comments": [
            {
              "score": 6963,
              "content": "He also chose to believe in the one that could get in trouble. No way that would make someone lie!",
              "id": 4,
              "comments": [
                {
                  "score": 3891,
                  "content": "He’s choosing to “believe” the daughter that broke them because he thinks that somehow relieves him of responsibility which is utter and complete BS.\n\nIt seems very clear the daughter did break the glasses intentionally but regardless- he’s still responsible.\n\nYTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1281,
                      "content": "Yeah, there isn't necessarily some deeper favoritism at play where OP is persecuting the 11-year-old. He could easily just be incredibly greedy, cheap, and willing to exploit a domestic worker who he thinks is too young/female/poor to fight back. And so he's looking for a pretext to do that, and in the meantime, this young woman is going to have to stumble around without her medical equipment.\n\nObviously these are still horrible (and, yes, misogynistic) values for OP to model for his daughters, and he should be deeply ashamed. I do hope the sitter gets reimbursed and then finds a family to work for that treats her like a person.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I know smfh op.",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1315,
              "content": "I thought the same thing. Why would he believe one over the other? Especially since the youngest had even more of a motive to lie. Not to mention that it shouldn't even matter that it was an accident.",
              "id": 8,
              "comments": [
                {
                  "score": 840,
                  "content": "Because that is the version of the story he could then self justify not coming out of pocket …. Eye roll",
                  "id": 9,
                  "comments": [
                    {
                      "score": 359,
                      "content": "Yup, and meanwhile the babysitter took time away from her schoolwork to end up $200 in the hole that night, depending on how good their parents insurance is. Accident or not, your kids break something you offer to pay.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Great lesson to teach the kids, too...as long as it's an accident you're not responsible. <Double eyeroll>",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Which is really dumb because it’s his kid’s fault that the babysitter no longer has something she will probably need for everything from cooking to driving. u/EricThrow3976 YTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "This! Plus he trusts the babysitter enough to watch his children, but not enough to believe her.  YTA big time.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Especially considering younger children are more liable to lie if they think the truth will get them in trouble. I have a feeling even if the younger admitted to doing it on purpose OP would still be opposed to paying.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And anyway, reading this, \"it was an accident\" almost surely just means \"I didn't mean for them to BREAK when I threw them.\"",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 967,
              "content": "Of course it was the babysitter's fault the girl ruined her glasses! She \"didn't pay attention to keep her glasses safe.\" \n\nEveryone knows you must keep an eye on all your belongings at all times, or someone might for instance very easily accidentally drop them on the floor and stomp on them like.\n\nTotally the babysitter's fault.\n\n/s",
              "id": 16,
              "comments": [
                {
                  "score": 407,
                  "content": "Ugh I said this too. Not to mention, how much more can you \"keep an eye on\" glasses than by 🤓LOOKING THROUGH THEM?!?! 🤓",
                  "id": 17,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yep. Can verify.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Actually trust me ir don't matter if they on your face or not my sister when she was that age use to take them off my face and break them when she did t get what she wanted. Last pair she broke she punched me broke them in half because she went outside when my dad was asleep without permission. Had to wait almost two years to get a new pair",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 233,
                  "content": "Yep. He needs to keep an eye on the kid who likes to break stuff and lie about it.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Not to mention a nine year old is definitely old enough to see that she got away with this shit. Next time she's pissed the property she decides to break could easily be OP's.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Yeah, may e that would fly if she left her glasses on the ground in the middle of the hallway where people walk.\n\nBut OP seems to leave out the pretty obvious fact that the girl had to go out of her way to break the glasses.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 227,
              "content": ">consider your youngest the golden child.\n\nthat and also because siding with the younger daughter means he won't have to pay\n\nedit: a word",
              "id": 23,
              "comments": [
                {
                  "score": 14,
                  "content": "No matter who he chooses to believe he still needs to pay for the glasses because regardless of whether it was on purpose or an accident his daughter broke the glasses and they need to be either repaired or replaced.\n\nIf someone accidentally hit OP's car with their own car I assume he would think that the person causing the accident is responsible for the damages. Why make exceptions for glasses. If someone accidentally caught his roof on fire with fireworks I'm sure he wouldn't mind paying for the damages on his own because it was just an accident.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 7,
                      "content": "So very true! It doesn't matter if it's an accident or not he should pay for it. His daughter broke them, if someone else's kid accidentally scratched his car because they wasn't paying attention and ran into his car he'd want their parents to pay for it!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "[removed]",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "It might not be favoritism, just extreme cheapness.\n\nHe thinks if he believes it’s an accident, he won’t have to pay. It’s cheaper for him to side with the younger one.\n\nI love how *he* decides to believe the 9 y-o and then says “I thought *we* ruled this as an accident.” As if he’s the only one whose conclusion counts for anything.\n\nYTA",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "I don't think it's favoritism, I think he has chosen to believe the girl who suits him best and that gives him the excuse not to spend money.",
              "id": 28,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "Very well put. I would just like to jump on this to add, if you get in your car and run over someone accidentally, it’s still an accident, but it doesn’t make them any less dead. \n\nOP, not only are YTA (a massive one at that), you are teaching your daughters:\na) that’s it’s okay for you to have favourites amongst them, \nb) not to trust you to listen to them when they have a problem - especially your eldest daughter and \nc) that the youngest is entitled to do what she likes without consequence. \n\nOP, you may be a widower and yes, it’s tough, but you’re not doing either of your daughters any favours.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "He's also a horrible employer, and teaching his kids it's okay to take advantage of people who work for you.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Because his younger daughter words fit his narrative of not wanting to compensate his sitter, that's why he side with her. definitely an AH.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2773,
          "content": "Reading about accident or intentional was driving me crazy here. It’s irrelevant. You break it, you buy it.  YTA",
          "id": 32,
          "comments": [
            {
              "score": 810,
              "content": "I was a nanny in college and one time a young toddler (15 months) grabbed my phone out of my coat pocket where it was hung up and threw it down the stairs to their basement. I told her parents about it and they immediately offered to replace the screen. They took me to the phone repair store, we found out that it was completely broken, and they bought me a new one. I can't imagine not replacing something my child broke, regardless of whether or not they meant to. Regardless of they were even old enough to understand breaking. Who cares? The sitter is now out of a pair of glasses because of his child. He needs to replace them.",
              "id": 33,
              "comments": [
                {
                  "score": 166,
                  "content": "To me doesn't matter either accident or intentional.  If my kids broke it I'm paying for it.  Especially something that is needed like glasses.  Glasses can be expensive depending on need.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I could even understand if OP said, \"Hey I'm also super broke, can we see about fixing your glasses instead?\" And babysitter refused and demanded new glasses. Then it'd be NTA, but as it is OP YTA.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Like if the kid broke thrm on purpose I'm willing to bet she snapped them in half beyond repair and he's not telling us this because it makes thd kid look guiltier",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "It is kind of sad that it feels so amazing to hear people doing the right thing.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "My four years old broke expensive sun glasses a friend had by accident, right under our nose, I was broke and would never have put that much money in sunglasses, still I didn't think twice and offered immediately to pay for them - friend was nice enough to accept only half of it and still, I would have happily paid because money not worth loosing a friend and even more the value I taught my son - apologize, stern talk even if it was an accident - those are personal and fragile stuff, and the unvaluable we assume our responsability as a family, don't evade troubles, well fix them together.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 506,
              "content": "Absolutely. I hate when people only take responsibility for their actions when they do something intentionally.",
              "id": 39,
              "comments": [
                {
                  "score": 28,
                  "content": "As if intentionally breaking something would be ok as long as you pay for it.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Exactly!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "The outlook that an \"accident\" absolves someone of culpability and responsibility is absurd and far too common.  Glad to see Reddit stepping up to call this behavior out.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 16,
                      "content": "It's like OP has never heard of car accidents and why they are called accidents and despite being accidents, someone is determined to be at fault and will have to cover the damages.\n\nOne accident I was in I wanted to punch this guy in the face.  I was stopped, at a stop light for like 30 seconds and he rear ended me.\n\nHe gets out, looks at my bumper and goes \"It's not that bad, you can probably pay for that yourself.\"\n\n\"The fuck you say?\" You hit me, I don't care if fixing it would be 10 bucks, you are paying.\" (he reluctantly gave me his insurance, and they basically had to replace my bumper, it was not 10 bucks, it was like 400, but his insurance paid out).\n\nIt was probably OP.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "That was my dad. He felt he didn’t have to apologize, much less replace, anything he broke (of mine at least) if it was accidental.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 237,
              "content": "I so agree. The only way that I could see accident versus intentional mattering is if the babysitter was somehow irresponsible with her glasses (e.g. left the on the floor and child accidentally stepped on them or left the on the couch and child accidentally sat on them) in a case like that splitting the cost might make sense, but since that doesn't seem to be the case here then OP is responsible. If the babysitter is like most people who wear glasses at her age then the glasses were likely on her face when they were broken (can't say for sure, but that's where mine are except when I sleep and shower) and she would need them to drive. OP is seriously affecting her life.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "Exactly. Intent and result are two very different things, and intent does not void responsibility. Accidentally kill someone? May not have meant to, but someone still died. So that’s called manslaughter rather than murder.  \n\nSorry for your loss OP, but you’re the asshole every which way. For the blatant favoritism (your children recognize it, promise) for refusing to replace the glasses, for treating a coworker’s relative that way, and for needing Reddit to explain basic manners and common courtesy when you’re supposed to be the parent in the situation.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "THANK YOU. Also the part where (35M)OP makes a college age girl cry by refusing to fairly compensate her, and then tries to bring his coworker in to gang up on her? That’s a greeeaaaaattt look OP, YTA.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Same. It's driving me nuts this guy seems to think he's magically absolved of responsibility if it had been an accident. \n\nLike this guy would be \"oh, okay,\" if he was rear-ended in his car by a driver that come following too close and said, \"sorry, dude, didn't mean to do it, it was an accident.\"",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "So agree.  Your child broke something that is the property of someone else. Teaching your child the responsibility of replacing the item is important. Crying and saying sorry doesn’t make the babysitter whole.  Glasses are expensive. Buy the new pair or risk losing your babysitter AND a coworker as a friend.  YTA.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1799,
          "content": "What kind of AH is he raising the 9 year old to be here? An adult AND her older sister tell him that the 9 year old broke something on purpose but a few tears and OP takes her side over them both?\n\nHe's not only the AH for not paying but also for clearly showing the 11 year old he doesn't trust her when it comes to the golden child (the 9yo). OP is raising a manipulator and showing her that she takes priority over he older sister.",
          "id": 50,
          "comments": [
            {
              "score": 1692,
              "content": "This is the type of parent teachers loath. \n\n>*\"Your daughter took her classmates lunchbox and stole her snack.\"*  \n>  \n>\"Sweetie, did you take her lunchbox?\"  \n>  \n>**\"No, mummy.\"**  \n>  \n>\"Obviously, you must be lying--she just said she didn't take it.\"  \n>  \n>*\"I have a witness.\"*  \n>  \n>\"They're just trying to get her in trouble.\"\n\nA nightmare.",
              "id": 51,
              "comments": [
                {
                  "score": 626,
                  "content": "Yup that works right up until court when suddenly someone independent is deciding who to listen to.\n\nI used to work as a police officer and some parents who had very clearly followed this pattern.\n\nI had a 20 year old decide that it was a great idea to threaten me with a knife and break my arm in the ensuing struggle because I caught him dealing. This was on body cam, cctv, other officers arrived to my emergency call to witness the breaking and I had the hospital report of the bruising etc from an obvious struggle. \n\nAt the court date I had his mother walk very brazenly up to me to ask why I was \"fitting up\" her son for something he \"clearly didn't do\" and that I had \"probably just fallen over and wanted someone to blame\". Like look at all the evidence lady    we have the drugs, the knife, multiple angles of video of it happening.\n\nShe still swore blind that here \"baby\" was \"innocent\" as he was been taken away having been sentenced for dealing, possession of the knife, threatening a cop with the knife and the assault that resulted in my injuries. Like I get denial and \"blind spots\" when it comes to your kids but seriously.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 332,
                      "content": "One day I was in court for another case when an 18 year-old guy who I had prosecuted several times while he was a juvenile. Each time his parents had refused all counseling treatments we offered and swore we were picking on their baby. \nNow he was in adult court.  Once again he had broken into a home and stolen whatever he could sell. The mom asked to speak after the kid pleaded guilty. She said to the judge that now she realized he really needed the counseling we had offered repeatedly. The judge said “We’ll, ma’am, I hope he gets some in prison, because that’s where residential burglars go.” Then he sentenced her baby to 4 years in prison.  It’s unChristian, but I smiled at the look on the mom’s face.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 127,
                      "content": "Seems like this father is going same route. I feel for the other child. \n\n>denial and \"blind spots\n\nPutting your head in sand is what that's called I think. Denying any mistake bcoz your baby is perfect. There's being protective & then there's enabling & teaching bad behaviour.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This degree of delusion makes me physically ill. And it's all too common.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": ">some parents who had very clearly followed this pattern.\n\nI call these people the \"not my baby\" people.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Situations like this remind me of an old XTC song, \"No Thugs In Our House\" about a delinquent who is always getting in trouble with the law and the parents words are this chorus lyrics:\n\n>No thugs in our house, are there dear?\n>We made that clear,\n>We made little Graham promise us he'd be a good boy",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This reasoning literally ruined my entire childhood.\n\n\nIt is absolute bullshit.\n\n\nYTA, op!!!",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 449,
              "content": "The 9 year old even floated the idea that her sister is lying! This isn’t the first time this has happened, clearly.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 188,
              "content": " I have a feeling this happens a lot.  I saw it in my brothers family.  The younger kid was a total shit and her older sister caught the blame every time.",
              "id": 60,
              "comments": [
                {
                  "score": 14,
                  "content": "He'll wonder why the older one grows up and leaves home and has little to no contact with him. After all, she was the difficult one and he did his best.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Right?! I was in shock the kids were this old. He raised kids to 9 and 11 and hasn’t learned that parents pay when their kids break stuff (even accidentally). How did OP get through the toddler phase?",
              "id": 62,
              "comments": [
                {
                  "score": 23,
                  "content": "I'm guessing their mother was the responsible one.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 883,
          "content": "And clearly it wasn’t an accident. The 9yr old is acting out… expectedly if they recently lost their mom. Your daughter needs firm boundaries and therapy. You need to pay for the glasses and trust your 11 year old. You are stepping on one daughter to support the other.\n\nEdited: YTA",
          "id": 64,
          "comments": [
            {
              "score": 588,
              "content": "I’m so confused why he walks in and immediately tells the 11 year old she’s lying cause the kids have “beef.” What in the fuck is this man doing? Losing control of his life? Cause then he decides to take it out on another kid and tell the baby sitter to take better care of their shit if they don’t want his kids to destroy it. YTA.",
              "id": 65,
              "comments": [
                {
                  "score": 169,
                  "content": "I think we know who his favorite kid is. 2 to 1 and he believes who he wants to believe.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Idk if favoritism so much, it's more if I believe the 9 year old, that relieves my obligation to pay for them so more of self serving",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I think we figured out what the kids have 'beef' if he consistently favors one over the other",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "I was wondering why he even asked the 11yo if he was just going to disregard what she said?",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Seems like the OP gives the daughter everything she wants or asks for or treats her like the golden child, always giving her what she wants. So when the babysitter told her that she couldn't do something, the daughter acted out like a spoiled child who is used to always getting their way or isn't use to be told \"No\" sometimes by the father.\n\nIf the father doesn't correct the behavior now, the daughter will only grow more spoiled as she gets older and feel entitled to everyone giving her everything she demands or asks for all of the time.  And when she doesn't get it she lashes out and does things to purposefully hurt or get back at the person who told her \"No.\"\n\nThe OP needs to teach her that she won't always get her way or what she wants every single time in life.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 367,
          "content": "Exactly thank you!!!!",
          "id": 71,
          "comments": [
            {
              "score": 894,
              "content": "Also, OP said he only found a sitter with the help of his coworker. He can be quite sure that it's going to be real difficult to find one now. The word about this will spread. \n\nNobody is going to be willing to take the risk of babysitting your kids, is it really worth it to you, OP?",
              "id": 72,
              "comments": [
                {
                  "score": 472,
                  "content": "I'm honestly surprised that student continued to come. If someone broke my glasses, SOMETHING I NEED FOR SCHOOL AND LIFE, I'd go nuclear and say \"I\"m not babysitting until you pay for my glasses\".",
                  "id": 73,
                  "comments": [
                    {
                      "score": 136,
                      "content": "The babysitter refused/refuses to babysit anymore, glasses paid for or not. Can't say I blame her.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "EXACTLY plus personally I can't even drive without glasses. One pair in particular, and with how much they cost I can also fuck off on a bus for a while because OP has raised a spoiled kid",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "He will be so surprised when she takes him to small claims court,  because I had glasses that cost me upwards of $400.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "And i would spread the word at school to everyone who babysits",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "That hardly seems nuclear! Small-claims court seems in order here, and of course the babysitter should never sit for them again, since the customer here is clearly lacking a sense of responsibility. What if a sitter's laptop breaks? If a kid's being driven by a sitter and spills food in their car?",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Maybe this is WHY OP has trouble finding a sitter. Also great way to alienate your co workers OP. If you’re that desperate for childcare you’d think you’d try and keep your night nanny so you can continue to provide for your kids but.",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "He’s not getting another babysitter anytime soon. Maybe some tweaker would do it, if he’s ok with that.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "Oh yea, yta. It was the 9yr Olds fault who is so habituated to getti g what she wants that she's learnt to lie at such a young age. OP needs to fix not just the situation by buying new glasses, but his kid before she gets spoilt",
          "id": 81,
          "comments": [
            {
              "score": 9,
              "content": "That poor poor babysitter I hope she gets her glasses replaced and gets the fuck away from this toxic asshole",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "This is the only accurate response to this situation! Op YTA",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "100%. Also I am confident your babysitter is looking elsewhere for employment. So if you don’t replace them, you could be a lot worse off.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I swear, people can’t see things for the other persons point of view. If a child broke her glasses, bet she would be here asking if she was TA if she demanded the child’s parents pay for repair/new glasses. \n\nYTA, be an adult and pay for the glasses. The only difference is this: if it was an accident, no punishment. If it was intentional, punishment. Either way, you pay.",
          "id": 85,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "This. Your kid still broke them.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17389,
      "content": "YTA. You are actually legally responsible for accidents as well as deliberate breakages that happen on your property to people you have employed. Quite apart from that, you are teaching your daughter that her actions have no consequences if she didn't meeeeaaaannn it. Your co-worker is right and even your 11-year-old daughter can see this. Grow up, take responsibility and make good the damage.  \n\n\nIf you don't, I hope she sues you, because she would win.",
      "id": 87,
      "comments": [
        {
          "score": 3292,
          "content": ">YTA. You are actually legally responsible for accidents as well as deliberate breakages that happen on your property to people you have employed.\n\nYup. Let's hope she puts in a claim against OP's home insurance if he continues to try and avoid his responsibilities. I'm sure the deductible plus rate rises for the next few years will be more than a pair of glasses but hey at least she didn't get anything out of his pocket right?",
          "id": 88,
          "comments": [
            {
              "score": 1402,
              "content": "The babysitter could also file in small claims court where she would be virtually guaranteed to win. The burden of proof is fairly low and the OP already confessed that the damage happened.",
              "id": 89,
              "comments": [
                {
                  "score": 329,
                  "content": "The problem with that are the usual access to justice issues. She doesn't really have the money or time to be doing that (she needs her glasses now) and OP seems to be the type of AH who will drag it out to avoid having to pay. Trying to claim directly to his insurance will put it right infront of an adjuster who will probably review the facts and cut a cheque relatively quickly.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Question: how would she find out the identity of OP’s insurer to make a claim? I expect that he’s not likely to assist her in making a claim by telling her.",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "She probably won’t because a lot of young people are scared to report malpractice for fear of negative retaliation.  Learn your rights and take him to court if he keeps it up.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "This.\n\nAccident or not determines the follow-up for 9yo. The babysitter needs to be made whole regardless. OP YTA.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "'Even your 11 year old', mate my 5 year old knows right from wrong, and that you don't touch other people's things. Let alone break them!\n\nThose kids are going to grow up entitled, with no concept of responsibility for actions. YTA, so it's counted but I know you're not the OP.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Especially since, \"I didn't mean to!\" is kid for, \"I might have done it on purpose, but I didn't think it would have *this* result!\"",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10226,
      "content": "YTA - *it's her fault, really, for not foreseeing my child's vindictive tantrum and failing to protect her glasses from being deliberately broken.*\n\nWe get it. You have a favourite child who can do no wrong, and you literally let her get away with destroying *accessibility aides which are necessary for, you know, SEEING*.\n\nEven if it was an \"accident\", she's (your child, and therefore you) still responsible for it. The babysitter isn't trying to squeeze money out of you, your child broke her glasses. Doesn't matter if it was an accident. Your kid broke her accessibility aide and you need to fork it over.\n\nYour kid ruins something, it doesn't matter if it was an accident, it's your responsibility to make amends.\n\nJFC \"it's her fault for not protecting them better\". Gods, drop the victim blaming.",
      "id": 96,
      "comments": [
        {
          "score": 1083,
          "content": "Yeah i don't think OP is a dad figure 'its her mistake she didn't cared of her glasses' -Whats up with this? OP even your 11y sided with sitter cause the kid know truth,YTA Its completely a golden kid senerio from my point my kid won't do it tendency you are not being a good parent you are ruining their future correct their mistake don't support them",
          "id": 97,
          "comments": [
            {
              "score": 37,
              "content": "OP is a man, btw.",
              "id": 98,
              "comments": [
                {
                  "score": 19,
                  "content": "Thanks mate👍",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "hey if the \"accident\" was babysitter took off glasses and set them on the floor while playing with the dog, and kid stepped on them cause they were on the floor.  OK sure that's the babysitter being careless. since OP didn't include the nature of the accident and it's of a nature the kid may have done it on purpose. I'm not giving OP benefit of the doubt about carelessness.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 898,
          "content": "And assuming this all went on in front of the kids now the 11-year-old knows that she’s not trusted/respected as much as the 9-year-old AND both kids have now been taught they don’t need to accept consequences or fix problems they create.",
          "id": 101,
          "comments": [
            {
              "score": 597,
              "content": "The 9 year old just needs to cry and blame the 11 year old for doing something \"for her own benefit\" and OP will jump right on her side. \n\nHe's raising a manipulator golden child and telling the 11 year old she won't be believed. I guarantee this is not the first time the 9 year old has done something like this (what 9 year old deliberately breaks someone glasses as revenge) and knows she will not face any consequences.",
              "id": 102,
              "comments": [
                {
                  "score": 121,
                  "content": "This is one of the reasons my relationship with my sister was *so volatile* for the longest time. She got *everything* she wanted, and I was *constantly* blamed for *her* actions. \n\nOP is ruining a sisterly relationship, being a shitty employer, and a terrible father figure.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "The sad part is I bet the 11 year old is in trouble for telling the truth.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 469,
              "content": "Yeah, what are the odds that the 11yo has “beef” with the 9yo because she keeps getting away with stuff like this?",
              "id": 105,
              "comments": [
                {
                  "score": 28,
                  "content": "Also, no matter what kind of beef I had with my sister, I'm not going to go along with someone lying about her just to get her into trouble. The older sister is obviously being truthful. And I don't blame the nine year old either. She was probably scared and lied.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I feel so bad for the 11 yo right now",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 511,
          "content": "God that’s what gets me. I literally can’t see without mine. At its most basic definition, needing glasses is the most normalized disability, and it’s insulting on all sides. I can barely walk around my own house alone without my glasses, I need a guide. My depth perception? Fucked. Gone. Everything is a blur of colors and barely distinguishable shapes. But when I wear them, others don’t think about it, bc glasses are small and we just don’t think about it anymore. They don’t think about the fact that if one thing goes wrong, I cant leave my house because it would be 1) horribly dangerous 2) illegal, as I am required by law fo have my glasses on if I get behind the wheel of my car. I don’t live with family most of the time, or with people on the same schedule as me that could help me for a few weeks until new glasses come in. Without glasses, I can’t use a computer because I have to shove my face within five inches of the frame just to make anything out. Even with my phone, after a while it really fucking hurts your eyes, and so I can’t even do my job. \n\nMy life would literally halt.",
          "id": 108,
          "comments": [
            {
              "score": 306,
              "content": "Isn't it fun when you knock your glasses off the nightstand and end up looking like a Scooby Do character the next morning, on the floor feeling around for them?\n\nI'm laughing at the \"protect them better\" part. Like they're literally affixed to my face 99% of my waking hours and I still manage to lose those things sometimes, because they're small, lightweight plastic *and I cannot fucking see without them on.*",
              "id": 109,
              "comments": [
                {
                  "score": 81,
                  "content": "Oh my god the panic at the three minute mark where you think “Surely this is the time I indeed lose them for good.” Always strikes the fear into my heart. Or my personal favorite, “Mom I can’t find my glasses and I can’t see the floor clear enough to know whether or not if I put my foot down if I’ll crush them”. I don’t have that help anymore. \n\nI suffer alone.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 27,
                      "content": "If you’ve got your cell phone- open your camera and use that to look around the floor without moving. It’s a life saver when I drop mine or take out my contacts and then realize my glasses aren’t on the bathroom counter because I left them in the bedroom or something.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "A useful trick I use, if you can find your phone in those situations, open the camera and hold the screen up however close you need. The phone camera is a solid eye substitute when glasses wander off lol.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ah, many times I have Done the Velma.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My husband broke my glasses while I was wearing them. He accidentally hit me in the face while we were watching tv in bed. (I said something to him, he was on his side with his back facing me, so he rolled over to answer and his shoulder hit the corner of the frames and broke the screw holding the lens in place in half. Oops?) he felt so bad and had no issues paying for new ones despite the fact that my glasses are stupid expensive. I am ridiculously blind and just my right eye is -9.00. So lenses are either really thick and heavy or I get the lightweight ones which have to be specially ordered and are expensive. I do the lightweight ones because I like my neck. For just basic frames, lightweight lenses, basic coatings and nothing else, they cost over $600.",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I haven’t seen my glasses in about 2 weeks,maybe almost 3 weeks now.\n\nDid I find them yet? Nope checked both jobs,home is spotless,car is as well,and parents home is spotless. Still can’t find them.\nI needed a new prediction anyway so I’m stuck paying contacts AND glasses now. I only got contacts cus they are cheap to get a pair for the week and last about 2 weeks each.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 14,
                      "content": "When I was in high school, my mom lost her glasses. Our cat loved batting them off tables (cats gonna cat) so we did the standard \"where did Joey decided the glasses belong?\" check. Nowhere. She ends up getting a new pair, and this is before the Zennis of the world and she has biofocals, so we're talking like $400.\n\nMotherfucking cat knocked them into a desk drawer. Must have been open for half a second and he saw his opportunity and took it. We found them the day after her new glasses came in.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Also, depending on what you have going on, glasses are insanely expensive. My insurance only covers part of that 600. Could I go cheaper? Sure, but my quality of life goes down",
              "id": 117,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Yeah, GLASSES ARE PROSTHETICS even though society never thinks of them that way. I am functionally blind without glasses; luckily I can use contacts, though they're far less comfortable.\n\nI would not be able to see the ground in front of me.\n\nYTA op, that is a medical device your kid broke. Like it or not you need to pay up.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "Exactly. I'd file that under the \"you broke it, you buy it\" rule. The reason for breaking it is irrelevant, all that matters is that you (the one legally responsible for the actions of your children) caused that person to lose what belongs to them.\n\nYTA, pay up.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "The thing about her trying to get more money out of him is so absurd. Like, she needs the money for her glasses, this isn’t some swindle where she’s gonna take the money to do whatever else. She’s not profiting from this situation if he pays for the glasses, she’s just not losing money on her job.\n\nOP YTA for not taking accountability of your kid’s actions. If she broke something at a store you wouldn’t brush it off as an accident and tell the employees you won’t cover the damages, right? This is the same.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I was waiting for this comment. Glasses are essential and super expensive, often eye care doesn’t have great coverage on many insurance plans. They are an accessibility aid that your babysitter NEEDS (it does not matter what she needs them for, if she was wearing them that day I assume it was for more than just reading) I know that without my glasses I cannot legally drive so unless she was picked up by someone or lived within walking distance, she could have been put into a dangerous situation. You’re so the AH here OP, and it’s ableist of you to minimize this situation. The audacity you have is appalling.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Right if your kid accidentally hits my car I want the damage fixed. She needs glasses to\nSee and drive.\n\nEdit. This is going to cost him a lot more in the long run. He’s gonna have to pay more for a new sitter. I hope she stops sitting for them.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Imagine op going to a store with the little and her pushing a tv over and op telling them they should have protected the tv better",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": ">JFC \"it's her fault for not protecting them better\". Gods, drop the victim blaming.\n\nRight. OP's complaint might make sense if she was babysitting a toddler, but not a 9 year old.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "\"hoping to get extra money out of my pocket.\"\n\nEXTRA money? OP's trying to take the poor sitter's money from their pocket because of damage done by their kids. Like the sitter would be out a pair of glasses if they weren't off looking after OP's little ones?\n\nShameless, absolutely YTA.",
          "id": 125,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4565,
      "content": "100% YTA. I can’t believe that you actually think it is not your responsibility. Your daughter broke the glasses and whether accidental or deliberate you need to pay for them.",
      "id": 126,
      "comments": [
        {
          "score": 630,
          "content": "It’s not like she broke something inconsequential either, this poor girl literally needs her glasses to see.",
          "id": 127,
          "comments": [
            {
              "score": 36,
              "content": "even if it was inconsequential. even if it was a $5 hair clip, OP should replace it. to completely victim blame the babysitter is rude and indicative of how he views his oldest child vs his youngest.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "This right here. If I was babysitting OP’s kids and they broke my glasses, I wouldn’t even be able to drive myself home. What if she needed them to legally drive? I’m so frustrated for her.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "My kid accidentally broke her friends toy when they were playing. You better believe we replaced it, I even made her pay for some of it so she knows that reparations are important, and she did so willingly. She’s only 7 and she already gets it more than OP.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3774,
      "content": "YTA\n\nDo you even hear yourself? Whether it was an accident or not is irrelevant, however in this case it be seems more likely that your younger daughter is lying because she's afraid of being in trouble. What is relevant is your daughter was involved in breaking the babysitter's MEDICALLY NECESSARY equipment, while she was working for you. \n\nI suspect this is not the only example in your life when you've tried to weasel out of paying for something you should be responsible for. Just pay for the new glasses already.\n\nIf your babysitter is STILL babysitting for you while you stiff her, I hope she wises up and stops. Babysitters are a valuable resource, and this one is making it possible for you to earn your living.",
      "id": 131,
      "comments": [
        {
          "score": 680,
          "content": "Was thinking the same if I was the babysitter no way I would come back without an apology and some amends made.... And he is accusing the babysitter of trying to extort him (or pressure not sure what he wrote) since he knows she needs her/him(?)\n\nLaughing my ass off",
          "id": 132,
          "comments": [
            {
              "score": 341,
              "content": "I wouldn’t come back at all, glasses, apology or amends. He’s shown he doesn’t trust her and will listen to a nine year old over her. what happens when a window gets broken, etc?",
              "id": 133,
              "comments": [
                {
                  "score": 21,
                  "content": "What happens when her arm gets broken because the kid \"accidentally\" spilled something on the floor",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "This is the part that gets me the most. He thinks she’s trying to squeeze money out of him? She is going to have to replace her glasses because a child having a tantrum broke them. Chances are they’ll cost more to replace than she got paid to watch the children that day. So with OP refusing to pay this poor college student is now in the net negative financially and has the inconvenience of getting new glasses all for the privilege of wasting a night of her valuable time to watch vindictive kids. Yeah, sounds like a real scammer. /s She just doesn’t want it to cost her money to watch some brats.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I wouldn't babysit for this guy again.",
              "id": 136,
              "comments": [
                {
                  "score": 9,
                  "content": "Yet he thinks she is the bad guy!!!!",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Hmmm.  Accuses babysitter of lying but still engages her?  Utter crap, he just does not want the bill.  If he really thought she was lying he would move heaven and earth to get a replacement",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 303,
          "content": "OP is also teaching his daughter that she can weasel out of consequences for her actions. YTA on every account.",
          "id": 139,
          "comments": [
            {
              "score": 10,
              "content": "Exactly, good point.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I hope the babysitter doesn't come back.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I’m peeved that this person thinks the babysitter is trying to get more money from them after damage took place in their home. Amazing how situations can be twisted.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This. I don't like comparing glasses to other disabilities, but for a lot of people who have them they're necessary to function. I wouldn't be able to do my job or go outside without my glasses.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3435,
      "content": "YTA. If I accidentally hit your car and dented it, would you be ok with me brushing you off and saying, hey it was an honest accident? Man up and take parental responsibility for your daughters actions and buy your sitter new glasses.",
      "id": 144,
      "comments": [
        {
          "score": 576,
          "content": "I was thinking the exact same thing. Just because something is an accident, it doesn't absolve someone of responsibility.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "[removed]",
          "id": 146,
          "comments": [
            {
              "score": 17,
              "content": "They have kids too lol",
              "id": 147,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 147,
          "content": "Tell her if she really cared about her car, she wouldn’t be driving it!",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "Just start crying and tell him you didn’t mean it, you’ll be right.",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "\"To be fair, you should have seen me coming and moved out of the way before I hit you.\"",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Now all I can think of is the Clueless where she’s driving and says “ooops, sorry” like that fixes it.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Maybe next time pay attention to where you park your car. If you don’t want me to dent it, don’t park it where I might drive into it. 🤷🏻‍♀️ Sorry not sorry. \n\n/s",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "What if someone accidentally rode a bike into him and broke a leg or something?\n\nAccording to OP, it is OPs responsibilty to predict that someone might break his leg and he should've planned for it better. It's an accident so definitely no one but OPs fault for being at the wrong place at the wrong time.\n\nSMH. OP is such an AH.",
          "id": 153,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2959,
      "content": "\"Let me preface this by listing specific reasons why I think I'm not required to hold my kids responsible for their actions especially when it'll cost me money.\"\n\nPay for the glasses. YTA.",
      "id": 154,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2512,
      "content": "Wow just wow OP. YTA\n\nHere we go:\n\n1. All of the comments are right on the money I hope you read them but there are some important things missing most importantly you're about to f up both your daughters for life if you don't cut this out\n\n\n2. As the other redditor said, if we're in a car accident and I say I'm sorry, would you just let me walk away and you'll pay the bill for fixing your own car? Whether it's an accident or deliberate, the person who did it is responsible for making the victim whole. As your daughter is a 9-year-old it is your responsibility as the parent to make the victim whole.  I am saying victim because this poor young lady is out a pair of medically necessary glasses, she needs to see properly to function!\n\n\n3. Way to go Dad of the year by marginalizing your 11-year-old because you suspect she's piling on because she's fighting with her sister. You don't think it's possible for somebody to tell the truth about a situation just because they are currently not getting along with one of the parties? Way to tell your daughter you don't respect her, way to tell your daughter you don't trust her. Good luck with that when she hits her teens, you better start praying now she never really needs you because she's not going to come to you with the truth on anything. You need to go back to your 11-year-old,  have a conversation with her, you need to say you respect her feedback and her observations and that you trust her. Because right now you have to told her publicly that you do not trust her over her 9-year-old sister.\n\n\n4. Way to go Dad teaching your 9-year-old and 11-year-old that there are no consequences if you didn't mean it and it was an accident. Guess what? Accidents happen, you took a great teachable moment and instead of raising up your daughters and teach them to be good adults, you chose to be punitive against the babysitter. This was a chance to teach your daughters that the truth is the most important thing, that it's okay in life if accidents happen, but when accidents happen the way you recover from them is by doing the right thing. People should be made whole if there's an accident, and you could have parlayed that right into setting expectations for as they get older and will begin to borrow things from each other. Daughters are notorious for borrowing each other's clothes, makeup, music and electronics... This was a chance to lay the foundation that while you might borrow things from others it's still your responsibility to return them in the same condition in which it was borrowed.\n\n\n5. Why are you digging your heels in so much over a pair of glasses? Not only are you being unfair, but this story will travel and it might impede your ability to find babysitters to fill in when you need help.\n\n\nI suggest you think about this entry and the responses of all the other redditors, on this situation you missed the ball completely.\n\nEdit.. grammar",
      "id": 155,
      "comments": [
        {
          "score": 179,
          "content": "Most comprehensive explanation. Definitely the AH.\n\nCommenting to also add that you are in what seems like a tough situation OP, and I'm sure everyone sympathizes, but it's not an excuse. You need someone at night that you can trust, and were fortunately helped by a colleague to watch your girls at night. Finding someone like that who is affordable and trustworthy  is not going to be easy, so accident or not, you should at least pay 50% of a new pair (but ideally 100% because as it's been mentioned, accident or not, your daughter was involved).\n\nIf you want to salvage the relationship with the babysitter, I would recommend calling them and apologizing sooner rather than later. Maybe explain you were taken aback by the situation, it was late, and you've had the opportunity to think about it and you're willing to help pay for the glasses (you can negotiate I suppose).\n\nThis is still a teachable moment as well. You can even talk to your daughters and get more from the story. Explain your not angry, but that accidents do happen and it's a person's responsibility to own up to their mistakes (accidental or not) and deal woth the consequences. \n\nI hope you decide to pay for the glasses, at least in part, and use this as a means to teach your daughters.\n\nMy sympathies for your loss and best of luck\n\nEdit: spelling/grammar",
          "id": 156,
          "comments": [
            {
              "score": 73,
              "content": "It’s really not a negotiable thing, though. Really, the dad owes her at the barest minimum to get them repaired or replace with equivalent glasses. If the optometrist could reuse the lenses and put them in replacement frames or whatever, that would be acceptable. And if she wanted an upgrade above that cost *that* would be for the babysitter to pay. But he 100% owes her equivalent working glasses. \n\nThat said, OP’s original handing of this was terrible and I would be looking for a new family to babysit for if I was their sitter. You’ve harmed your relationship with her even if you replace the glasses.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "No. 50% is not acceptable. Negotiating is not acceptable. Don't give OP more bad ideas for how to be cheap and set a bad example.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I don't sympathize with him at all. He's a selfish A who is teaching his children that they have no responsibility for their behavior.",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "PERFECTLY said.\n\n>this story will travel and it might impede your ability to find babysitters to fill in when you need help\n\nas a former nanny this would've been an immediate \"this isn't a good fit, best of luck finding someone else\" for me.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2356,
      "content": "YTA. Pay for the glasses. Your daughter broke them on purpose, even your other daughter is telling you so. Stop treating her like the baby just because she's the youngest.\n\n Even if it was an accident the decent thing to do would be to pay for them.",
      "id": 161,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2254,
      "content": "YTA\n\nGlasses are for a *disability*\n\nIf your daughter broke a wheelchair, would you still feel the same?\n\nI know I can't see a thing without my glasses. I can't do anything or go anywhere.  And some glasses can cost hundreds because of prescription alone.",
      "id": 162,
      "comments": [
        {
          "score": 205,
          "content": "For the record I 100% agree, but what kills me is that it's likely the cost of the glasses would mean basically nothing to OP and everything to the babysitter. Obviously some people have very serious vision problems young but the vast majority of glasses wearers under like 40 can be covered by a $95 pair at Warby Parker. I am pretty dependant on my glasses but I'm still nowhere near super expensive lens level.\n\nIn college I suffered a lot because I didn't have $100 to spare (not just for glasses but in general) and it would likely mean missed meals even if I went with much cheaper glasses (I think the lowest price I ever saw was $49 but things may have changed). OP is literally so out of line and being so cruel to this girl it's wild to me that he didn't catch it before he posted. It reminds me of someone I babysat for and his kids were WILD but basically refused to hear it so it was just part of doing business.",
          "id": 163,
          "comments": [
            {
              "score": 42,
              "content": ".",
              "id": 164,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I’ve just had to get new glasses, it cost me £260 which is just under $352 US dollars. I’m a university student and it’s absolutely a massive financial stress. OP YTA",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Not to be a dick around here but if a child broke my nice 300$ pair of glasses I wouldn't accept a cheaper model as compensation. Same or similar model of equal value or I'd sue. My glasses are an accessory I ways wear, not some rug. Ppl like OP are infuriating",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}