{
  "post content": "I (24) got pregnant while I was taking a gap year traveling. I met an older guy, nothing gross, I was 19 he was 23. We had fun. I was working in a bar to make money while I explored his city. \n\nWhen I got pregnant he lost interest really quickly. I understood but I am pro choice. And I chose not to terminate. \n\nI went home and had my son. I also made sure to get child support. He could afford it. He did fight it though. I had to prove paternity and everything. \n\nThrough that his parents found out. They are well off. They have met my son and they truly do seem to love him. They have provided gifts for his birthday and Christmas. They helped me with extra money so I could complete my university without going into debt. They have taken us on vacation with them so they could spend time with him. They aren't my biggest fans but we are cordial to each other. \n\nThree months ago my son's father passed away. He got drunk at his bachelor party, tripped on the sidewalk, and hit his head. And that was all she wrote. \n\nMy son and I attended the funeral. We spent a week in that city so his grandparents could see him. \n\nThey approached me with an offer. They had no other children or grandchildren. Their son was only 28 so he had lots of time to provide them legitimate kids (they did not say this I'm just assuming) so they never thought about my son's name. \n\nThey said that if I changed his surname to theirs legally they would make him their primary heir. I think this is dumb. He is their only grandchild and they would deny him an inheritance because of his last name? \n\nI said I would consider it, to be polite, and have left it at that. I actually have a pretty good life as it is. My family has been very supportive. And because of the whole court thing my son's father had to have life insurance with him as the beneficiary. \n\nWould it be nice for my kid to get a big sum of money. Yes. Do I want him to have the surname of a man who didn't want him, see him, or love him? No. \n\nI have been talking to my family about it and a few of them think I'm being an asshole for giving up.this kind of money for my son. It is generational wealth and I'm making the decision based on emotion. I think they are assholes for thinking money is the only thing that matters. \n\nI think I will tell my son's grandparents that they can talk to him about it when he is 16. He will be old enough to understand the implications but young enough not to be tied professionally to his last name.",
  "id": 1,
  "comments": [
    {
      "score": 21307,
      "content": "YTA. F that dude but also you’re kinda screwing your kid by not changing the name. That money is your child’s future and guess what they’ll probably want it regardless of y’all’s beef. If they find out that could also wreck y’all’s relationship.\n\nETA: Get the bag, you can be honoring the grandparents that have been involved in your son’s life and ultimately your kid can change the name if they don’t like it but the money can allow your child to pursue their dreams w/o having to worry about the stress of loans etc.",
      "id": 2,
      "comments": [
        {
          "score": 5937,
          "content": "Yes, I completely understand not wanting him to have the name of a man who did not want him, but being practical, that's a lot of money and if that's all they want, I would make the sacrifice for my son's sake. He shouldn't be punished for his dad being a bad guy.",
          "id": 3,
          "comments": [
            {
              "score": 4808,
              "content": "And it’s not giving him the last name of a man who didn’t want him\nIt’s giving him the last name of his grandparents who did love him and want him and provide for his and his mothers life in very meaningful ways, I mean helping with paying for her schooling ? That’s way more then even most parents would do for their adult kids let alone a basic stranger \n\nThey also took her on vacations and helped pay for things to get her and her son ahead \n\ni would tell them that you don’t feel comfortable making such a big choice and that your son will know and make the choice himself when he is old enough",
              "id": 4,
              "comments": [
                {
                  "score": 2280,
                  "content": ">It’s giving him the last name of his grandparents who did love him and want him and provide for his and his mothers life in very meaningful ways\n\nThis is what I keep coming back to. The grandparents have really stepped up already, but people are saying they never loved OP and their grandchild if they're asking for a name change.\n\nEven if he was an asshole, these people lost their son 3 months ago. It's obvious their hearts aren't made of stone, so of course they're grieving him. I can't imagine that kind of pain and devastation. \n\nRight now, their words are tied to their grief. I don't think they should instantly be viewed as horrible because of it. It's also likely that their wealth being generational comes into play.\n\nAccidents happen, and there's no guarantee the grandparents will live until the child is old enough to make his own decision. I think OP could ask if they'd be okay with a hyphenated name, or make his current last name his middle name.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 490,
                      "content": "This is why I think waiting until kid is older so he can decide himself is maybe a good idea? I don’t know how important this will be to them (tge grandparents) in a year. There’s that common advice not to make big decisions after a big loss. I think you should probably also not yield to big demands right after a loss.  NAH.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This is why I think the grandparents are in the wrong, even if they are grieving though. They are asking OP to change the name of their child AWAY from the only parent who raised him. The mindset they have is literally the same as legitimizing a bastard in feudal times.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "I would make them form an irrevocable trust with son as beneficiary.  No way I would trust these people to keep their promise to put his name in the will.  If they actually mean it, they can do that.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 425,
                  "content": "\"make the choice himself when he is old enough\"\n\nIf the option is still there. They will change the will in the meantime and who knows what will happen between now and then.  One of them may pass and the survivor decides to go in a different direction.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Idk why OP doesn’t go along with the name change now and down the line explain everything to her son. If he wants to change his name he can. If the grandparents die before the talk he can give the money to charity if he doesn’t want anything to do with it…and still change his name. It seems like a no brainer to me.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "That could happen if even they DO change the name",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 399,
                  "content": "Sure. But its also taking away the name of the mother who loves him and is doing all the work to raise him. As though her contribution is somehow less than their future contribution or their monetary gifts. Or that her contribution is chopped liver entirely. The child will become a good adult (hopefully) because of OP's daily and nightly actions, not the sporadic actions of grandparents who live far away.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 133,
                      "content": "I don’t necessarily disagree with you, but the grandparents directly supported OP finishing her degree, as well as including OP and child in family activities, holidays, birthdays, etc. Helping her finish her degree is a big thing to me - they’re helping OP provide a better life for their grandchild. She’s doing the day to day, of course, but she has support and isn’t entirely on her own. \n\nI would try to punt the name change until their grief wasn’t as fresh, but I can see both sides here. NAH.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Is it? Why do children and women get the father’s last name in most cases, then? Even if the father does nothing? If last name is based on who poured the most care in, with the current state of things, it should start going to mothers more often than not.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 241,
                  "content": "But he already had the same name of the parent who wanted him and loved him and is raising him. His mom. I’m amazed at all the asshole votes here.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "Nah. If they really love him, they'd give him the money regardless. It's paternity test proven, he's their grandchild. \n\nIdk, but this action kind of reeks like buying him or buying themselves importance in their grandsons life. A do-over son on paper. Dangling generational wealth above ones head is kind of coercive or a form of emotional/financial blackmailing. They put the mother in the position to 'sell' his lastname or to be the person to deny him big money. But in reality **they** are TA for making such demands and conditions. I'd be extremely wary what this might lead to in the future. And if that inheritance gets dangled above him to get more acces to, visitations from him etc. I'd even suspect they might try and snatch him away from her, once his name is legally changed to theirs. 'Our name has to live on' is such a creepy, outdated blood and soil mentality, and such a non reason to deny the only grandson an inheritance. The grandparents are massive AHs.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "And why isn’t her surname important? She’s the kids mumnWho gave birth to him and raising him?",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": ">It’s giving him the last name of his grandparents who did love him and want him and provide for his and his mothers life in very meaningful ways\n\nExcept that love and willingness to provide now seemingly hinges on whether the kid shares the same name as them? \n\nTbh they come across to me as incredibly wealthy to the point where the things they’ve already paid for are small change, and they were happy to do so while this kid was their only grandchild, all the while assuming their son would produce another more worthy beneficiary in the future. I’m struggling to see why this mother is getting so many asshole votes really.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 451,
              "content": "That's lovely in theory but being a single parent without the same name as your kid puts up a lot of hurdles. Grandparents haven't thought this through, it's not just a piece of paper.",
              "id": 19,
              "comments": [
                {
                  "score": 475,
                  "content": "Does it? My mother (a single mom) and I don't share a last name. My sister (a single mom) and her daughter don't share a last name. There have never been any issues, even during international travel.\n\nEven if it *were* extremely inconvenient, that still wouldn't be a good reason to turn down a huge inheritance. Money is safety and security.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 208,
                      "content": "Didn’t have my mums last name until I was 13 when I chose to have it changed. Never caused any issues other than kids at school asking why we had different last names",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 168,
                      "content": "It cause’s literally zero problems at all. I kept my last name but gave my kids my spouse last name. I had a different last name growing up than everyone else in my family. My moms last name changed multiple times. No one cares.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Seriously, I don't know what this person is on about, both my sister and I had different last names from our single mother AND each other and we traveled in and out of the country multiple times growing up with absolutely no issue.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "I think if it’s really generational wealth then you could just travel private and you can have the situation explained to your private jet help you avoid any problems.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Depending on the country, it can cause issues. Not everywhere is the same. It certainly can cause issues where I live.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 257,
                  "content": "What hurdles? I’ve been a single mom most of my adult life and both my kids have different last names than me. Never, not once, has it caused any questions let alone any issues.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 167,
                      "content": "[deleted]",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 104,
                  "content": "I mean, I'm not disagreeing, as I'm not a parent.  But I have a different last name as my single mom, and it never seemed to be that big of an issue",
                  "id": 28,
                  "comments": [
                    {
                      "score": 147,
                      "content": "Having a different last name than my child as a single parent in 2023 is literally no big deal. This is a made up problem.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "My mom and I have different last names and it was literally never an issue.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Muslim women do not take their husband's last names. Their children take their fathers' last names.  It's not nearly as common as you think for a mother and child to have the same last name.  I am sure this happens in other religions and cultures as well..",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "The father may have been a jerk, but the grandparents have accepted the child and loved him. Doted on him and took him on holidays. Maybe she should look at it as carrying on THEIR legacy and not necessarily the father’s. Also, is neither party open to hyphenated names??",
              "id": 32,
              "comments": [
                {
                  "score": 34,
                  "content": "As well as PAYING FOR HER SCHOOLING?! Like??? These people love the little boy so much that they’ve gone out of their way to take care of her, a casual fling of their sons, as well?? \n\nLike it or not, their surname is his family name! I get not giving it to him in the beginning. But the dad is dead. The kids grandparents want the name to live on thru their grandson who they love. The boy will never know the dad didn’t want him unless OP tells him so. \n\nSwallow your pride op, and do what you know will be best for your sons future.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 21,
                      "content": "[deleted]",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "If those grandparents truly loved their grandson, they wouldn't deny him the inheritance because of his last name.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "That's all they want *now*. Just imagine what they'll want as time goes on. If she caves then they know she's susceptible. \n\nPeople who want to buy a little kid's surname aren't good people. There'll be something else.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Gifts of money that start off with conditions tend to develop more over time and become a means of controlling someone's behaviour when the promise can be withdrawn at any time. There's a point where sunk cost kicks in. Kiddo may start to believe that if his mother was willing to change his name for the money he would be disappointing her if he says no to whatever they ask. There's no reason why they couldn't just put a clause in their will to say that the money can go into trust if they die before the kid is old enough to choose for himself and go to charity if he decides not to and leave it up to him.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Also this establishes a precedent that allows the grandparents to move the goal posts. \"We've decided he has to go to Specific College if he wants to access his trust fund. We've decided he needs to do X to gain Y.\"\n\nThe giving him a choice at 16 is the right decision because ultimately he is the one most affected by it.\n\nAnd honestly? They're probably just bluffing. Who else are they going to give their money to?\n\nNTA OP",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Why is everyone here assuming they will actually pay the money? They have their whole lives to keep adding conditions to this 'primary heir' thing. This is how rich people manipulate people around them",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "But that's the point - how can OP know that's all they'll want? Once they learn that OP can be manipulated by holding the inheritance over her son's head, what else will they expect?",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It's a name today...what if next ask is to sign over parental rights? If they genuinely wanted him to be their heir, he would be with NO conditions",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 474,
          "content": "Yes because money is way more important than having the name of the one person who took care of him all his life. Amazing how quickly people will call someone an asshole when money is involved. She's left it up to him to decide at 16. I think that's reasonable enough.",
          "id": 42,
          "comments": [
            {
              "score": 496,
              "content": "When we don’t live in a post capitalist hellscape we will change our opinions",
              "id": 43,
              "comments": [
                {
                  "score": 130,
                  "content": "Especially since she can just hyphenate the new last onto his existing name.  Boom travel problems solved, coupled with dads death certificate.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "> When we don’t live in a post capitalist hellscape we will change our opinions\n\nYeah, that’s the real issue here.  If we weren’t struggling to survive in this disaster of a system, then there would be no need for the money and no reason to even consider it.\n\n> money is way more important than having the name of the one person who took care of him all his life.\n\nBeing able to live indoors and have clothing and food and medicine is sort of important, yes.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah this makes me think OP would be TA if she didn't at least try to work something out with them. Doing ok is fine for a 5-year-old but it's clear that OP does not have any further savings planned for when it's time for him to go to college if she just had hers paid off by the grandparents. She seems to be relying a lot on family as it is. Not to mention - money for better education, student exchange opportunities, extra curricular activities, etc. This is the difference between struggling as an adult while missing out on key milestones like homeownership and living comfortably. OP isn't thinking about his future if she's willing to pass that up without a solid plan of her own.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 448,
              "content": "If I found out I missed out on legitimate “generational wealth” because my mother didn’t change my last name, when I was old enough I would change it out of spite because I’d be so pissed.",
              "id": 47,
              "comments": [
                {
                  "score": 250,
                  "content": "You can change my last name to assface if you give me 100,000.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Look at you being uppity! I'd do it for $10k",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "I just commented the same lol, I would be super pissed too. I will change my name to literally anything if it means that level of inheritance lmao",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I mean, that’s on par with Henri, Count of Chambord refusing being restored to the French throne because the National Assembly wouldn’t change the flag from the Tri-Colour.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 6,
                      "content": "He may also have remembered all that stuff with guillotines and figured it was best to cut his losses \n\n(I’m sorry)",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 131,
              "content": "I have a different last name than my mom. She was a single mom.  I never felt less connected to her or my family because of it.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "Assuming the option will still be there when he turns 16.  There are numerous scenario's where the option will be gone.  If fact, I believe that is more likely.  And he will resent his mother for the rest of his days as he struggles to survive paycheck-to-paycheck, or worse.",
              "id": 54,
              "comments": [
                {
                  "score": 5,
                  "content": "I think it is more likely that he won’t “need” the money at 16 bc he’s in high school and the support will still be coming in and mommy will be convincing him subconsciously he doesn’t need extra money and his name is all that matters so he will pass it up. \n\nThen it’ll be gone for good and even at 26 when he realizes he really would need it, it’s gone.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "If I found out that I could have had a ton of money for the cost of my last name being different, and my mother decided against it out of spite for a dead man, I would be beyond enraged.\n\nLetting them decide at 16 comes with the risk that there won't be a choice at 16.",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "She had no problem taking their money for her own schooling or vacations.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": ">Yes because money is way more important than having the name of the one person who took care of him all his life.\n\nYes, actually. In what world is it not? You can always change your name. You can't always guarantee wealth. It's not like the kid will get his name changed and suddenly forget that his mom is the one that raised him.\n\nWaiting till a kid his older to decide on something based on his *grand*parents is optimistic. If his grandparents die before he turns 16, he'll miss out on (possibly) stupid amounts of money over his mom being prideful.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "It is more important in the world we live in. But then tbh names are pretty meaningless to me while more money would lift a huge heavy blanket off of me that makes me feel like I‘m suffocating all the time. I would change all of my names to lift that in a second even though I love my family deeply and we‘re close",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Principles are great, but a ton of integrity and an empty wallet won’t buy you dinner. \nThe kid will know who was there and can make the choice to change their name later on. The inheritance will make the legal fees negligible.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "When you want for nothing your whole life you probably won’t think at 16 that you’ll need the money. And he will have mommy in his ear for 11 years convincing him he doesn’t need it and that his name is oh so important. Even if subconsciously. \n\nWhen that support stops at 18 he’s going to realize pretty quick in his 20s what he missed out on.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 229,
          "content": "I have to agree with these YTA's. And this is a blanket statement and not always the case but men and boys and sons and fathers tend to have weird and intense feelings about last names. It would be a connection to his father who he's probably never known and won't know, whether or not the father was an ass. Plus the whole inheritance angle. \n\nShe should just do it, in my opinion. Not just for the money. The chance of the boy being mad that she changed it are slim but the chances of him being mad if she doesn't are quite huge.",
          "id": 62,
          "comments": [
            {
              "score": 573,
              "content": "Shame that women don’t get to be equally attached to their last names. OP could want a legacy for her name too, but oh well, she has to give it up because men need to be placated to get that sweet sweet $$\n\nSure she can set her son up, but gosh this feels scummy. I get why she’s hesitant. What a shitty thing for the grandparents to ask of her.",
              "id": 63,
              "comments": [
                {
                  "score": 210,
                  "content": "Seriously! Those grandparents have clearly not seen the Barbie movie yet. Smash the patriarchy!\n\n\nAll joking aside, what a shitty thing for them to do. What if the child was a girl? Would she no longer be considered an heir? Why should his name reflect family members that only love him on one condition, as opposed to the women who loves and takes care of him on a daily basis? \n\nI think she is being quite generous by letting the son make the decision on his own, but I hope she can get the point across to them of how terrible they're being.\n\nIt's gross how many people on here think she's an asshole when it's clearly the people doing the blackmailing that are assholes.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 94,
                      "content": "Also, today it's his last name. Tomorrow it's his class, music lessons, extra curriculars, his college choice, his major in college, where he lives...\n\nOne request today isn't one request tomorrow.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That's what I was thinking. The grandparents want the kid to have GRANDAD's last name, GRANDMOM's was lost when she married. \n\nAnd, if she gives in, what will they demand next?",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "There are countless kids stuck with the last name of fathers that didn’t want them. OP’s kid would at least be getting the last name of grandparents that truly want and love him and a huge financial advantage that comes with it. YTA, OP. That money could make a huge difference in his life and the ability to chase his dreams.\n\nEdit: grammar",
          "id": 67,
          "comments": [
            {
              "score": 12,
              "content": "I think its important to remember there is no guarantee of receiving the money by changing name. Nor is there a prohibition on the parents giving the money without a name change. \nThis reeks of prime \"let me use my money to control people\"",
              "id": 68,
              "comments": [
                {
                  "score": 13,
                  "content": "Has it been a long con? Is that why they paid for her college and vacations with the family? They’ve already spent a significant amount of money on her and their grandchild with no strings attached.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Just an FYI if you have \"generational wealth\" then some vacations (which sound like trips to the grandparents) and some college fees is rather an insignificant amount of money.   \nAnd there were definitely stings attached on the holiday. And college could well be for keeping up appearances.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 103,
          "content": "Also, it’s not just “the father’s name,” per se, but also the grandparent’s, who are a lot more affectionate towards the kid.",
          "id": 71,
          "comments": [
            {
              "score": 13,
              "content": "But notably, not the kids moms name. Which is a shame since she’s the one raising the kid and the kid already has her name.",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And when they make more demands later if he wants his inheritance then what, kid has to go to the schools they want, church they want, career they want. Turns out he's gay, not if he wants that money.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "And if they change their mind and want her to move closer to them for him to receive the inheritance? Want him to go to their school of choice? Want him to choose a career they approve of? This is a slippery slope. If they would deny their only heir inheritance because the names don’t match, they’re going to leverage this all the way.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "They could change the name and still write him out of the will.  This isn't a contract. I wouldn't do it.",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I would be so dissapointed if I found out my mom denied me a  huge amount of money when I was a child, just because of a principle matter...",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13104,
      "content": " I get where you are coming from in the sense that you aren't fond of him having a name that is tied to his dad who didn't want anything to do with him. However, I just want to give you some things to think about:\n\n* His paternal grandparents did want a relationship with him and have helped out, so the last name is also tied to them who DO want him in their life. \n* You are looking at the as they will totally deny him an inheritance because of his last name, but they didn't say they would exclude him altogether. They said he would be the primary heir. Maybe that means without the last name that all property will be sold and all money will be split with other family members, charities, etc, but if he has their last name that all properties and most money would go to him with little splitting of the money to anyone else. \n* You think that you can wait until he is 16 but that's 11ish years away. What if something happens to them before then?\n* How do you think your son will feel if he doesn't get this and finds out that he could have had generational wealth and never would have to worry about money and all you had to do was simply change his last name? \n   * I mean personally if someone had told my mom I could get generational wealth as long as she named me dumbass ho, and my mom didn't and I found out, I would be mad that my mom didn't rename me LOL.",
      "id": 77,
      "comments": [
        {
          "score": 3806,
          "content": "Yeah I'd be pissed off, and he can always legally change it back with that amount of money",
          "id": 78,
          "comments": [
            {
              "score": 976,
              "content": "The trust can be designed such that he cannot change his name back for quite a while, say until he's 30 or 40, and some of it even later than that.  These people are not ignorant of these things, and even if they were, there will be several lawyers involved, and an executor.  By then, it may be quite difficult for him to change his name back, with titles, deeds, stocks and investment funds in his new name.  I would assume the change is permanent when she decides.",
              "id": 79,
              "comments": [
                {
                  "score": 1327,
                  "content": "For generational wealth I would go by the name Adolf McShitpants, dude. People are really undervaluing this amount of money. It would change this kid's life and the only thing he has to do is have his biological father's surname? This isn't that hard of a choice, imo. But I guess if they're not struggling then maybe she doesn't value that type of thing as much as her pride. I know my pride is worth a lot less to me than that kind of money. Call me whatever you want, I do not care if I don't have to struggle through life.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 716,
                      "content": "She's not struggling ***now***.  But he has a *looooonnnnggg* life ahead of him.  And life can change on a dime.  He won't always have the mommy with her pride to help him.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 174,
                      "content": "People who are saying don't bother getting the money for him have never been old, poor and sick at the same time.  Money going into a good persons hands can do great good, and I assume mom here thinks her son is the bee's knees, she should guide him to become a great do-gooder.  If not for that then for just knowing he will never have to worry about medical bills is worth so much more than a name.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Welp, I now know one of the things I'm going to do if I win one of those billion dollar lotteries",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "[deleted]",
                  "id": 84,
                  "comments": [
                    {
                      "score": 16,
                      "content": "In that case in point, it would be the kids choice to not meet the requirements of the trust fund and forego the money.  His compliance would be administered by the executor.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Yes, but with \"generational wealth\", he can just pay others to do all that grunt work for him",
                  "id": 86,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 455,
          "content": "Good points. It’s THEIR name and they DO love him.",
          "id": 87,
          "comments": [
            {
              "score": 786,
              "content": "No they don't, if they really loved him the name wouldn't have been a condition. You don't hold your grandchild's future ransom like that to manipulate the mom if you actually love the kid.",
              "id": 88,
              "comments": [
                {
                  "score": 467,
                  "content": "Yes this! I don't see why people are so focused on the money instead of what family means! Changing a name is a whole process, too, and then there are the logistics of not having the same name as your child. He'll share the samenlast name as the woman who loves him and cares for him, not the one of the invisible man who didn't want anything to do with him *or* his manipulative parents who think a name is more important than the meaning of family. \n\nOP, NTA.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 29,
                      "content": "People are smart enough to see it from the paternal grandparent's perspective. No one here, even the ones firmly on the side of changing the name, are arguing for naming traditions and name based legacies. But the grandparents are. It is clearly their motivation. I work with the elderly, and depending on the generation of the grandparents, it's not unheard of to have weird and illogical feelings about your family name dying off. \n\nAlso, the man is dead. While it is objectively true that he wanted nothing to do with his son for 5 years, It won't change the son's curiosity and connection he has to his birth father through his grandparents. Their love and family and money are good enough to take free vacations on, why deny their grandson a close relationship to them by harping on the now dead father being a deadbeat?\n\nA hyphenated last name solves most of the logistical problems you are wholey imagining or keeping his original surname as his middle name. Of my 4 single parent friends, only 1 woman shares the same last name as their children, and no one denies them at the airport or school pickup, if that's the type of thing you mean.\n\nI know of a case at my job a long time ago, a rich couple had only daughters (I was the widowed dad's nurse in end stage dementia) and both daughters had kept their maiden name. Where it gets weird is I noticed that all the grandkids, and most of the great grandkids, also had the family name (their respective Mom's maiden name.) One day I was casually chatting to one son in law and I just asked him about it.\n\nHe laughed and said we weren't the first team of nurses to notice. You guessed it, these were men from middle class or poor backgrounds, and my client had been a legacy obsessed lunatic who dangled huge amounts of money in his daughters' faces to keep their names AND name their children that so he wouldn't end the family legacy. Is it crazy and wrong? Probably. But the SonIL kept laughing and told me that for the amount of money this family had, he would have named his first born Bozo the clown maiden name, and his BIL felt the same. And he reassured me they had been great in laws and phenomenal grandparents, but because of being the only ones from his large family to survive WW2, the name was an obvious sore spot before the girls' marriages even happened. \n\nSometimes, maturity is looking at the bigger picture and not just what is moral or technically correct. A lot of people starve alone in perfect morality and having done everything right. \n\nWhile I appreciate your point, it's more nuanced than \"teaching them a lesson in what family really means.\"\n\nStill, OP. it is technically your choice. NAH.\n\nBut when your son finds out at 18, you'll likely be made the asshole if you resist at least adding their last name and compromising with them maturely. Good luck, OP.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "In many countries/cultures a woman keeps her maiden name after marriage.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 336,
                  "content": "I agree that it shouldn’t be a condition, but I also understand how weird people can be about last names when there’s a death. And I understand because I was that person. \n\nWhen I thought about marrying my now-husband, I couldn’t wait to take his last name. And then my dad died. And suddenly, the thought of no longer carrying my dad’s last name—the one thing that I felt like still tied me to him—felt unbearable.\n\nI ended up taking my husband’s last name and made my maiden name my middle name, but it was interesting how something that wasn’t previously important to me (a surname) suddenly became really important upon a loved one’s passing. \n\nAll that to say, I don’t think this necessarily means that his grandparents don’t love him. Maybe they feel similarly to how I did and feel like this is their last remaining tie to the next generation now that their son is gone. Illogical, perhaps, but grief isn’t always logical. We have to remember, after all, that they recently lost their son, and well before they should have. Further, they seem to be good people otherwise (doing more for OP than some people do for their own children), so I’m more inclined to give them the benefit of the doubt than I otherwise may be. \n\nTo OP, I can understand where you’re coming from, but generational wealth will help not only your child, but your children’s children (should he choose to have them). It will open up a world of opportunities and forestall many of life’s most preeminent stressors. It’s something I would want and something I would be upset to have forfeited, all in the name of pride.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 249,
                  "content": "Agreed. They didn’t give a shit about his last name when they thought their fuckup son (God rest his soul) was going to provide them with some legitimate heirs to their inherit their lands and titles.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 11,
                      "content": "If they felt this grandson was \"not worth it,\" they would NOT have supported the child and the OP and welcome them into their lives long before the son died. The grandparents STEPPED UP. They are not the jerks in this story. At all.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Correct; what they are saying is that their love comes with the strings of carrying their last name rather than the last name of the woman that carried, gave birth, raised, loved, provided for, cried over, sang to sleep, and provided 100% of the parental love. It’s insane that we still get so focused on children having the names of their “father”. It’s incredibly selfish of them to diminish the love and sacrifice that their grandson’s mother has invested in their grandchild that they would deprive him of essentially his birthright simply because he isn’t “branded” correctly.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "If their wealth is truly generational wealth it may be part of a trust and its possible one of there's of that trust is that it can only go to people with a certain last name. In that situation they legally would not be able to will it to the grandson without him changing his last name. Not likely, but it is a possibility to consider.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I agree.\nWhat if the grandparents had a daughter who then had a child with someone, and that child has the father's last name? Would that child suddenly not be a real heir?",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 303,
              "content": "But unconditionally.\n\nDo they really love him?\n\nBecause I can't imagine putting conditions as stupid as a name on my child.  \n\nThat's their grandson, And they're the ones who raised a deadbeat.\n\nHe wasn't there through the pregnancy, wasn't there at the birth, wasn't there to help raise him.\n\nAnd btw, grandparents should want to provide for their grandchildren because they love them, not because of some name bullshit.\n\nFuck these people",
              "id": 98,
              "comments": [
                {
                  "score": 26,
                  "content": "I tend to think of it as the grandparents lost their only son, but they want their family name to continue. However, I do agree with you. They shouldn't mandate the name change, but a request doesn't seem unreasonable.",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "To be fair it doesnt look all that complicated to me:\nDo they love him? Probably yes, considering OP said they treat him good. But what they are obviously trying to do here is to make sure their family name lives on, before the fathers death he was the heir, and now they are looking for the next best one to replace him, so it is important for him to get the name, if I had to guess they have some family business thats closely tied to it",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "> as stupid as a name\n\nIt’s only stupid TO YOU. \n\nThat doesn’t mean it’s stupid to everyone. \n\nIt’s their money.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "I get the grandparents are grieving and have made an effort to be a part of their grandson's life so far...but isn't there also no guarantee that, even if OP complies with their request, that they don't disinherit him for something else? Ah well, if you won't move to our city, go to our church, etc. While, if it were me, I would consider a last name change, I do understand OP's hesitation because this all seems rather coercive to dangle a carrot like this *and* especially when no one should count on an inheritance as fact until it's disbursed.",
          "id": 102,
          "comments": [
            {
              "score": 52,
              "content": "Maybe OP can get a lawyer and get it in writing? The way I see it, if OP can be sure that they'll follow through as well as not adding on further stipulations for her son to get the inheritance, then it's YTA.\n\nBut if she has serious doubts about either, it's NTA.",
              "id": 103,
              "comments": [
                {
                  "score": 82,
                  "content": "Wills can always be changed or modified, OP would need something like an irrevocable trust in order for any such inheritance to be somewhat ironclad. I really don't see how OP can assume these people would 100% follow through on this without something like a trust to back it up- she barely knows these people, their son already was uninterested, and they are using their money to get their way, not in the best interests of their grandchild, but due to their sentiments about *their* name and ideas of legacy. I really find it weird and short-sighted that people are jumping to unforgivable AH status for OP.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Then it's a no go unless OP gets a monetary award settled right now. If she changes the name they could decide to disown the son later if he does something they don't like, just for instance.\n\nIts YTA on its face but NTA in practice.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Which is basically impossible. In my experience of people with serious money if they use their money to change others behaviour for one thing they will do it for others. \nThese loving grandparents can just gift the money to their son. \n\nOr if they were really dead set on the name change set up an irrevocable trust",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly. These people can find some other perceived grievance and write the grandson out of the will if OP doesn't acquiesce *again*",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "They paid for her college and made lots of efforts to spend time with him, along with paying for trips for them. All no strings attached. \n\nThese people have enough money to just pay someone else’s debts off without batting an eye.  They’d likely have *their* lawyer prep all legal documents in one go.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "NTA. I will add that if you do agree, that you hire a financial planner, and put the money into a trust that he gets at certain  ages. This is definitely your decision, and I can see both sides.  You appear to be a well grounded parent, which is a bonus. Good luck.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "My FIL's parents were told by FIL's wealthy, bachelor uncle that if they named FIL Clarence (not the real name, but something similar, also very old school and uncommon), that uncle would make FIL his sole heir. They didn't and now FIL is a little salty about it.",
          "id": 110,
          "comments": [
            {
              "score": 4,
              "content": "It’s so creepy to try and control people with money like that. It would make me not trust them",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "All of this. Moneys not everything but damn it sure helps",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Also now you can spite the dad! Didn’t want your kid? Guess what now he has your last name AND he gets your families money !",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7778,
      "content": "[deleted]",
      "id": 114,
      "comments": [
        {
          "score": 11178,
          "content": "Not if she lets him choose at 16.",
          "id": 115,
          "comments": [
            {
              "score": 10125,
              "content": "[deleted]",
              "id": 116,
              "comments": [
                {
                  "score": 4405,
                  "content": "Yup. Fortunately, OP says they are fine. And money is NOT everything. Also, they said \"sole heir.\" So even if he doesn't change his name, he will still probably inherit.\n\nETA: OP says OP and son are fine. I should have made that clearer.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 2465,
                      "content": "How do you figure that? In most jurisdictions, people are generally free to chose their beneficiaries and are not required to name relatives if they are not dependents. Plus, knowing they have nobody to leave it to, they could just spend all their money before they pass on.",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1053,
                      "content": "“Money isn’t everything” I take it you’ve never had to worry about money",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 703,
                      "content": "As somebody who was \"fine\" three weeks ago, I'm now in a great position to know how quickly that can change.  I'm still getting details of my condition and what can be done, but a week ago I went from having a reasonable expectation of seeing my 90s to knowing I might not see 60.  \n\nI don't disagree with the rest of your points,  but assuming their continued health and longevity could be a mistake.   I'd probably at least consider it,  if it were me, but I would be careful to get to know them first.  Once someone starts using money to make you dance,  they may find it easy to keep doing it.  They might also try to use it to govern where he lives,  get visiting rights,  decide where he goes to college,  or other decisions.  If they are decent aside from a \"carrying on the name \" thing,  it isn't the worst trade off.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 686,
                      "content": "His father was also fine, 10 minutes before he died.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 140,
                      "content": "The father was 20-something when he died suddenly.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 113,
                      "content": "Not unless they leave the money to a distant relative or a charity. They could have a will and have it written up that away. \n\nShe could contest but if they have the money she says they could make the will airtight.\n\nPlus if they have generational wealth. Their could already have trust in place with stipulation that anyone to inherit from the trust has to have the surname.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "If they are that well off they will have planned their estate so this is a VERY dubious assumption.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Yeah but just like the dad, they could die anytime so OP needs to decide now. It’s a name. She could make her last name his middle name and add theirs or come to some type of compromise. Money isn’t everything but it’s nice to have a leg up in the world.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Money isn’t everything, but it’s a lot.  Financial security is a peace of mind you just can’t imagine, unless you are fortunate to have it.",
                      "id": 126,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "He doesn’t have to inherit anything. They can donate their entire fortunes to a cat shelter.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "They may make it a condition of inheritance. Eg the amount will be held in a trust until the child is 18 and then he has X amount of time to perform a change of name or else the money will be donated.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Sounds like an 80’s movie plot where his mom only tells him an hour before his 19th birthday so he has to race across the city to change his name in time or lose the inheritance money",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "An attorney can probably sort it out today by creating a trust with a condition that he have adopted that name by whatever age. @OP, talk to a lawyer, not reddit and see if something can be worked out —even if you meet with them and their trust & estate lawyer. Keep it amicable and professional and you can probably get it all squared away and move on with life. Mention that during his childhood it will be more convenient for school and doctor appointments to have matching last names.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Also for travel. Child trafficking prevention means border security often question and even detain people who are travelling with children with different surnames.\n\nObviously, proof of parenthood is usually fairly easy to travel with, but it definitely falls into the category of \"less convenient\".",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Not true, whatsoever. They can create a conditional trust to still allow him to decide what he wants in the event of their untimely death",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Yes, but that really isn't a decision he can make.  What teenager would turn down money in exchange for a name change.  Hell, I'm older and had my name longer but I'd change it to fucking Rumpelstiltskin for the right amount of money.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Why not do the opposite? Secure the inheritance now while his last name isn’t an important part of his legacy, then let him decide when he is old enough to understand whether he wants to spurn the grandparents and forfeit the money by changing it back to his mother’s name. \n\nThat way the kid knows that his mom sacrificed her ego to give him that opportunity and loves him unconditionally, rather than because of his name.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "What if they pass away before he’s 16. Dad died tripping on a sidewalk at 28.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "They could croak any time between now and then.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Rolling the dice. Same thing as saying no. \n\nThere is an offer on the table that is so massive as to change the fortunes of OP and her entire family forever and ever and ever. That is generational wealth. \n\nSon will find out and never forgive her. \n\nYou never know when that kind of money could save his life one day or hers. \n\nYTA OP for denying your child this kind of life opportunity just because you’re angry.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "That’s assuming the grandparents live or remain in sound mental state until he is 16…",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm not going to make a judgment, but I will observe that changing a name at age 5 is a lot less socially painful than doing so at 16.\n\nOne wonders, though, what would have happened has their son decided to get married, have a child, and give the child his hypothetical wife's last name.\n\nOr if, heaven forbid, they had had a *daughter*.",
              "id": 139,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "He can also chose to change it back after getting his inheritance",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2741,
          "content": "I would ask the OP this:  Your son would be sharing the surname of grandparents that love him, wouldn't he?  \n\nMaybe talk to the grandparents about a hyphenated last name if keeping yours is that important to you.  \n\nAlso your son can change his name back after the grandparents die if he really wants to.",
          "id": 141,
          "comments": [
            {
              "score": 461,
              "content": "They can easily arrange a trust that will keep him from changing the name back.",
              "id": 142,
              "comments": [
                {
                  "score": 754,
                  "content": "Well, that doesn’t sound very trusting.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 8,
                      "content": "😂😂😂",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 240,
                  "content": "Seriously?! There’s a way of controlling his ability to change his name from their graves? What if he’d like to take his future partner’s name?",
                  "id": 145,
                  "comments": [
                    {
                      "score": 557,
                      "content": "Conditional trusts are absolutely a thing. Sounds like this family wants heirs. Thats the whole idea of this move, they want a family legacy. \n\nI, personally, would add their last name to his current name and ask the child when he is an adult about the inheritance vs the name and its importance to him. That way he can choose based on his experience and needs.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Yes, there are ways.  They setup a trust that is given over time, piece by piece, and each piece will have his new name on it.  There will be titles, deeds, investment funds, etc. that will all be in his new name.  And there will be an executor that has instructions through the trust.  There may even be an investment fund where he cannot touch the principle for years, only the interest or dividends.  etc.  By the time he gets through all of it, say by 40 years old, he will have his new name on so many legal documents that changing it back would be a nightmare.  Very wealthy people don't just hand over a check.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Depending on how much money we are talking I wouldn't care if the last name was Penisbutt. I'd rather be able to be live a comfortable life if I could.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Same.  Lord Arthur Lloyd Penisbutt III,  aka 'Lil PP  lol",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 449,
              "content": "I don’t know how much they really love him if they’re only willing to make him their heir if he has their name. That’s one hell of a condition on that love.",
              "id": 150,
              "comments": [
                {
                  "score": 136,
                  "content": "Conflating love and inheritance may be a mistake. If this is generational money, THEY may access it via trusts and investments already. They also may regard themselves as custodians of the money that has come down the generations from Great-Grandaddy Moneybags I with obligations to tie it to the name rather than this being a slush fund they should/can drop on their grandson.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 6,
                      "content": "If that was the case, I think that's something that would have been explained to OP. Like \"hey OP, we don't have any other children/grandchildren. We would like to make our grandson the heir but can do only don it if you change the last name because...(add in explanation)\"\n\nBut what they said is \"if you change his last name, we'll make him the heir\". \n\nThe request is the same in both cases but the reasoning behind it is different.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "It will be a different evaluation 10 years from now. \n\nBut now? They are clearly grieving and aren't making the best decisions. They're wrong to be demanding it, but it's currently a NAH situation, IMO. Let the grandparents grieve without crucifying them.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "If they actually loved and wanted him, and wanted him to have an inheritance, they'd leave him the money no matter what his name was.  I wouldn't trust them.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "OP should also think about having a different name from their kid.  It is hard in school, at doctor's appointments, or travel with passports to explain that you are the parent to a kid with a different family name.\n\nAround 14 I stopped getting asked, but when my kids were little it was different.   I had my kids before marriage to their father, then got divorced.  I wouldn't want to go back to different names.  It sucked.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "What about the mother who loved and raised him? Her family who supported her and have been there for them? Just because she's a woman her surname doesn't matter? The grandparents are using money to control her and her child after they so clearly failed to raise their own in any positive way. Honestly she seems comfortable for money I'd cut ties/ go very low contact until child is old enough to decide on their own.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Her son already has the surname of someone who loves him. Why would a single parent not want her kid to have her name? It doesn’t seem unreasonable to me at all.",
              "id": 157,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Op is a single mother, if the child has a different Name it can be Additional hassle for her.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2468,
          "content": "If OP agrees to this, it's not the last time they'll use the strings to treat OP and son like puppets.  Learning gifts have strings attached is a valuable lesson.  These people sound manipulative AF.  And they raised a kid who fell and hit his head in a drinking incident.  And only grudgingly took financial responsibility for his kid.    [ETA: there wasn’t anything wrong with him asking for a paternity test, it’s the subsequent doing the bare minimum to m referring to by begrudgingly].\n\n\nA truly loving grandparent would make the kid their heir regardless of name.  These people will want to dictate where the kid goes to school, college, career, etc.  It'd be one thing if someone was starving or needed to pay for  medical treatment, but that's not the situation here.\n\nETA a commenter pointed out an accident like falling while drinking can happen to anyone. That is true.  In OP’s ex’s case, it was more the overall pattern of not being responsible which makes me see it in this light.",
          "id": 159,
          "comments": [
            {
              "score": 972,
              "content": "Yeah, I don’t know why people aren’t considering the fact that the grandparents can always change their minds and their will in the future even if OP does this. It’s not like this is a contract she can hold them to.\n\nGrandparents have already shown that they are taking a transactional approach to the subject of inheritance when it comes to their only grandchild. They’ll make him primary heir *if* he has their last name. Him existing as their beloved grandchild who has a relationship with them isn’t sufficient. They’ll grant him this level of support *if.* It’s naive to think more *ifs* aren’t going to crop up in the next decade or two. And this *if* isn’t even about something like his conduct, which I would understand.\n\nObviously they’re entitled to do as they wish with their own estate. They’re allowed to make this pitch, even though it’s distasteful. But I don’t think OP would be an AH at all for saying no. She gave birth to this child, she’s his mother, she’s raising him. \n\nAlso, everyone’s saying her son will hate her if he finds out about this when he gets older, but really, if he grows up and grandparents say, “We haven’t designated you as our heir because of your last name” it’ll just make them look petty AF, in my opinion.\n\n(Edit: phrasing)\n\n(Edit 2: I hope someone else also immediately thought of the grandparents in Gilmore Girls, because this would be *such* a Richard and Emily Gilmore thing.) 😂",
              "id": 160,
              "comments": [
                {
                  "score": 358,
                  "content": ">I don’t know why people aren’t considering the fact that the grandparents can always change their minds and their will in the future even if OP does this\n\nPeople only see dollar signs. That's it.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 184,
                      "content": "People are so, so ready to humiliate themselves for some cash.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I don't blame people who do, depending on the situation.  Money isn't just about frivolous expenses, money can mean security, stability, shelter, food, and a peace of mind.  In fact, several studies have shown that overall level of happiness vs yearly earnings diminishes once people hit amounts they can live comfortably on.  Beyond that, it doesn't make people much happier because it's already taking away the biggest stressers; where your next meal is coming from and where you're going to sleep next.\n\nIs a set of syllables really worth giving all of that up for her son especially with how bad things have been getting for people?\n\nIt also removes the biggest time sinks most of us experience, a meaningless full time job.  Her son would be completely free to study what he wishes, do what he wants, and live a life pursuing his passions instead of potentially going to a building 5+ times awake that drives him to either drinking or suicide.  It doesn't happen to everyone, but it does happen a lot.\n\nThis would almost guarantee it wouldn't happen to him.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 232,
                  "content": ">(Edit 2: I hope someone else also immediately thought of the grandparents in Gilmore Girls, because this would be such a Richard and Emily Gilmore thing.) 😂\n\nYES lmao I'm so happy someone else did as well! \n\nI agree with you 100%, the top comment saying OP is the one at fault for her son not getting his grand-parents' inheritance is so backwards? Like, sure, that's a reasonable ask from obviously reasonable people who definitely won't  play any more power games in the future and will keep OP's son as the main beneficiary of their wills until their deaths ; furthermore, it's not like it's a big risk - what, is it going to be an issue for OP to not (checks notes) have the same last name as her son, as his only parent? Surely it won't be an administrative nightmare, on top of the emotional weight of her being the sole parent to a son whose last name is that of a man who wanted nothing to do with him; OP and her son have nothing to lose!!! /s",
                  "id": 164,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Same here! First thought. \n\nOP: ‘those are strings, Pinocchio’",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 215,
                  "content": "This!!! She’s gonna change his last name to get the inheritance, then the grandparents are gonna say “actually we want him to attend every family gathering”, “we want him to move in with us”. As you said, there is absolutely no guarantee that they are going to keep their promise and it’s such a red flag to me ! Like wtf?",
                  "id": 166,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yep.  Like Frank Churchill in 'Emma'.  Gotta hope that they change the will then die quickly so they can't control his life further.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Spot On!\n\nNice catch, that would make birth mother the only one left out. What if both (mother + child) were hyphenated?",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yes - the grandson literally has their genes. He is a direct descendant of theirs and they have lost their only child - so there won’t be any more. What a time to be placing these kind of conditions on a child!! It doesn’t bode well for the future.\n\nI think placing these kinds of conditions (which they can change at any time) sets up a terrible precedent. \n\nI think if I was OP, I’d give a cheerful ‘thank you for that offer. I’m going to say no, but my child is welcome to choose to change his name at 16 if he’d like to.’  And then carry on as before, with the same close relationship the grandparents have currently. \n\nI wouldn’t see this as an end to the relationship or anything to feel awkward about. They asked a question, you gave an answer. \n\nThey will know from this that you have boundaries and can’t be bought. \n\nAnd - this child doesn’t need huge wealth. It could actually screw him up. He just needs enough, and the life insurance policy sounds like it will cover that.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "And don't forget that this wouldnt be without cost for op. \nIf she has a different Name than her child it can be Additional Stress when dealing with authoritys.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": ">Also, everyone’s saying her son will hate her if he finds out about this when he gets older, but really, if he grows up and grandparents say, “We haven’t designated you as our heir because of your last name” it’ll just make them look petty AF, in my opinion.\n\nalso, OP's decision is literally to let the child decide when he is old enough to understand. so he will hear from his mother \"i didnt want to take this decision for you\" VS the grandparents “We haven’t designated you as our heir because of your last name”",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Oh wow, yes you called it. How many more conditions will they put on the inheritance after this? It won’t stop with just the name.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I don't know the laws in OP's country, but in my country, w/o living relatives, OP's son would be entitle to huge part of their assets, family name or not. That's the law.",
                  "id": 173,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 438,
              "content": "It's insane that nobody else in this thread seems to realize this. Does everyone here think they will just sign his name as sole inheritor of their estate and then fuck off until they die?\n\nNTA OP and you're smarter than 90% of reddit for considering this apparently.",
              "id": 174,
              "comments": [
                {
                  "score": 46,
                  "content": "Honestly this threat is really bringing to light how immature so much of Reddit is. Just acting like the mom is the AH because she won’t change her kids identity for some cash.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 226,
              "content": "Absolutely agree with this. They already know the child is definitely their grandchild. If they loved him as much as they say, his last name shouldn't matter. It's definitely a control thing and it's gross",
              "id": 176,
              "comments": [
                {
                  "score": 13,
                  "content": "And they can write a will or alter an existing one, totm specifically exclude him, by name, for any reason or none. Reason does not have to be mentioned in the will just the exclusion. My mother did this bc my sister died in a boating accident but her body was never recovered. This exclusion would prevent someone from turning up claiming to be her & demanding her share - the whole Anastasia thing.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "this is what i was thinking - manipulation & control sounds like a factor. kinda like when parents offer to pay for their kids whole wedding but then want a bunch of things THEIR way when the day isn't even about them but they use the fact that they're paying for shit as a guilt trip to get what they want out of it (like a destination, insisting certain people be invited when the couple getting married doesn't want them there, etc)",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": ">And they raised a kid who fell and hit his head in a drinking incident.\n\nSorry, I agree with most of your comment, but that's kind a weird thing to say. What does that even have to do with anyone's character? That can happen to anyone. Recently, someone in my life died the same way. She was a good person with nice parents. Accidents happen.",
              "id": 179,
              "comments": [
                {
                  "score": 11,
                  "content": "I’m sorry to hear about your friend. It can happen to anyone. In this guy’s case seems like it’s more of a pattern. I’m going to edit to reflect that.",
                  "id": 180,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "And they are promising an inheritance. Not setting up a trust fund now. \n\nIf they really meant this to work and they have money, a lawyer could set up something irrevocable.\n\n”I promise I’ll put you in my will” means zero. A will can be changed at any time. A will does nothing if you spend all your money. \n\nThis is a bad deal even if OP is inclined to do it.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Agree. Changing the last name seems like the first of many changes they’ll expect.\n\nOP - sounds like you’ve got a pretty good head on you. Let that be what your child inherits.\n\nSide note and generalization: of the wealthy people who I personally know (very few) - miserable and vile.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Thisss! **They're testing the waters to see if they can buy the child!** No way are they going to stop making demands like this if OP says yes.\n\nAnd it's such a messed up thing to do, I probably wouldn't have called OP an AH for declining even if OP was struggling financially.\n\nThe grandparents can choose to be decent people and say \"as long as we get to have a relationship with our grandson, we would be happy to let him inherit the money\" if they feel like that's where the money should be going. But *they* are choosing to be AH's about it.\n\nOP, don't let your friends talk you into doing this. And remember the kid will probably be disappointed at some point regardless what you choose. Even if they agree to him getting to decide at 16, he will likely complain about how he had to grow up with one name and then change it to get the money. But saying yes would mean giving them the power to make choices they shouldn't have the authority to make.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 751,
          "content": "I don't think it's the same thing.  \n\nShe and her son have the same name, they are a family.  The father never wanted that, he was never around, he never married her or claimed this kid.\n\nWhy on earth would she give her child a name that has nothing to do with his actual family?",
          "id": 184,
          "comments": [
            {
              "score": 1902,
              "content": "> why on earth would she give her child a name that has nothing to do with his actual family?\n\n**Because this name will give her kid opportunities that most people can only dream of.**\n\nIt will provide for her kid during his entire life, buy him a home, pay for medical bills, college. It sounds like it could even put his kids through college.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 298,
              "content": "I mean, I have that.  My dad was basically nowhere to be found, but I still have his last name.   Didn't make me any less close to my mom or her side of the family.",
              "id": 186,
              "comments": [
                {
                  "score": 98,
                  "content": "I carry my moms last name very proudly, it’s the far superior sounding last name. My dad was a deadbeat… but damn if the opportunity to have generational wealth scarified for simply having his last name.. call me whatever you want, just let me get paid.",
                  "id": 187,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 178,
              "content": "Also the grandparents are his actual family too",
              "id": 188,
              "comments": [
                {
                  "score": 242,
                  "content": "Are they more his family than his mother?  \n\nHis mom is at least willing to make concessions and leave the choice up to him when he's old enough.\n\nThese people are making their love conditional.  That's not love.  That's not what family does",
                  "id": 189,
                  "comments": [
                    {
                      "score": 138,
                      "content": "Their love isn’t conditional. Their money is.",
                      "id": 190,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 115,
              "content": "but the grandparents have stepped up and are part of his family.",
              "id": 191,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 195,
          "content": "Well I think the point is the kid is related by blood, and they supposedly care for him, so not making him their heir just because of his surname is a bit cruel. What's in a name, after all.",
          "id": 192,
          "comments": [
            {
              "score": 85,
              "content": "There could be titled inheritance or trusts long established that require legal barriers for son if he doesn’t have the same last name. Idk just shooting off the cuff here. \n\nPersonally I would think of it like sticking it to my ex and take the money and the security for my child and his future.",
              "id": 193,
              "comments": [
                {
                  "score": 33,
                  "content": "Wouldn't they explain that to OP though? I feel like if that was the case she'd be more likely to agree. So why leave that out.",
                  "id": 194,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "This is the info that’s really needed. \n\nAre the grandparents asking this out of true, legal context or is it an emotional request?",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I think that they are:\n\n1. Grieving the loss of their son\n2. Confronting their own mortality\n3. Hoping their grandson taking their name will \"fix\" both of the first two for them\n\nObviously, it won't fix their grief or their own anxiety about end of life. But it might help them a little. I think that they're making an emotional decision, with a little bit of magical thinking. They both want to give the money to their grandson *and* feel a little less mortal.\n\nI think it's humans being humans.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "She’s not denying him anything. They’re the ones who are showing only conditional love for their only living heir.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Like what's stopping her from changing the name and then changing it back after 🤣🤣 sure they'll be well gone ..problem solved",
          "id": 198,
          "comments": [
            {
              "score": 715,
              "content": "Ever tried travelling as a single parent without the same name as your kid? Then try explaining you don't have the other parents written permission to leave the country because they've passed. Add 4 hours to every airport visit.",
              "id": 199,
              "comments": [
                {
                  "score": 285,
                  "content": "Yes, this is an important logistic point.  And changing it like that would involve the courts, etc.  And the kid might get used to and like one name or the other.  People are commenting like it's a pet.  Hell, I wouldn't even change a  pet's name if it was used to the name.  Unless it was something really unfortunate or awful.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Yes . I knew someone who changed her child's last name when she married the man she had been seeing for several years.  (long story which included a missing dead beat father ) \nIt was a long process and it wasn't  finalised until the child was considered old enough to be able to tell a judge his preferences.. Adoption  wasn't an option either as laws in our country require consent of both bioparents or proof of the other parent's  death .",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "My Japanese passport has two surnames. My father's surname in parenthesis and my mother's maiden name.\n\nUsually the double surname in passports is used for Japanese women who still have their maiden name in Japan's governmental records but go by their foreign husband's surname elsewhere.\n\nThe reason I, who has never married, got this treatment was because my mother had trouble travelling with baby me when our surnames didn't match (she hadn't bothered updating her passport to include her husband's surname). Didn't help that I had lighter color hair than her at the time. So she had her maiden name included in my passport to get rid of the hassle.\n\nSo in Japan my official surname is my mother's maiden name.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 38,
                      "content": "That's an excellent point, I'm only going on the way things work in my country but entering/leaving other countries will have myriad different rules too.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Imagine if you and your partner are different races and your kids skin color is different than yours! This happened to two people I know lolol. They had all the proper documents but still were treated with suspicion and accused and questioned for trafficking or some shit. It all blew over quickly but the hassle was humiliating",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 153,
          "content": "Sure, you can look at it like that but most people would choose to take the last name of the parent who actually raised them and did NOT fight child support. Now that an inheritance is involved everyone’s priorities will change. Tough call, I don’t have the answer. But shifting blame to the parent who was present is super f***ed.",
          "id": 205,
          "comments": [
            {
              "score": 16,
              "content": "Yeah I have no take on what OP should do, it’s very complicated. I only have my perspective as the adult child with the last name of a bad parent which is: I don’t care that much about whose last name I have, I’ve considered changing it to my moms but decided last names don’t matter that much to me, but, having money is always helpful and if I grew up with my moms last name and then found out about this I would be pretty resentful that I was a broke ass young adult as a matter of principle that I had no say in",
              "id": 206,
              "comments": [
                {
                  "score": 7,
                  "content": "My little brother was almost put up for adoption with a really good set of parents. Last minute, my mom decided to keep him. \n\nThe kid got screwed out of a good life. Instead he came to live with us in our roach infested trailer. \n\nOur dad is dead, and was a giant asshole. If his last name gave me free money I’d be stoked and dancing on the street corner he died on. My only consolation is that it sounds cool.",
                  "id": 207,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": ">did NOT fight child support\n\nIn fairness, OP's description of \"fighting child support\" is just that she had to prove paternity. There might not be any more to it than that, and I think checking paternity would just be the sensible thing to do if someone you had a casual fling with claims to be having your child, especially if you are the only heir in a wealthy family.",
              "id": 208,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I talks about how great her life is as if them funding her education had nothing to do with it",
          "id": 209,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "No, because his name is already his name. They want ti change it, even though the actual father didn’t seem to be involved",
          "id": 210,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6680,
      "content": "He’s not likely to forgive you when he finds out what he’s missed out on. And for just a surname. Yeah, his dad didn’t want him, but his grandparents want to involve him as a primary heir. This is a grand move on their part and could change your son’s life.",
      "id": 211,
      "comments": [
        {
          "score": 670,
          "content": "Does the decision HAVE to be made now? If she leaves the decision to her son and he decides to do it at 16, would the grandparents say “Nope, too late. No inheritance for you. You should have changed your name ‘x’ years ago”!",
          "id": 212,
          "comments": [
            {
              "score": 2194,
              "content": "You’re playing chicken with the grandparents’ longevity then.",
              "id": 213,
              "comments": [
                {
                  "score": 655,
                  "content": "Yep there's a reason why the conversations are happening now. If there wasn't a rush, it'd be \"Think it over, we'll check in until he's old enough to be aware.\"",
                  "id": 214,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Conversations are probably happening now because the death of their son means the will needs to be updated now. So it's probably not a \"rush\" per se, but something straightforward to do now (which doesn't necessarily preclude them revisiting in future).",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 165,
                  "content": "Or one dies and the other remarries.  Or the inheritance gets locked in to his old school or somewhere else.  It's a risk.",
                  "id": 216,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 176,
              "content": "They might say nope to life sometime in the next 11 years.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "They might not be alive in 11 years",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP’s baby father died an untimely and unforeseen death. Life itself is unpredictable (like the offer that was made to OP), 11 years is a long time to make a gamble on unpredictability.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Their healthy 28 year old son just died unexpectedly. They’ve suddenly been brutally reminded of the finite nature of life. That’s why they want to make the decision now.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4221,
      "content": "YTA. What happens if the grandparents pass away before your son turn 16 and can decide. He could lose a very generous inheritance because of your resentment of his father. His grandparents have been kind to both your son and you. Do this for your son.",
      "id": 221,
      "comments": [
        {
          "score": 538,
          "content": "Agree.  He may not have had a relationship with the father, but he definitely has one with the grandparents…they stepped forward to do that. Give him  the last name.  He can always change it later himself back to OPs if he wants to.   But not doing that is, I think, rude to the grandparents who didn’t have to step forward at all.  If OP doesn’t, he will most likely resent her later when he discovers what she’s done/didn’t do.  It’s such as easy thing to do.",
          "id": 222,
          "comments": [
            {
              "score": 334,
              "content": "It's not rude to her to force her to give up her family name?",
              "id": 223,
              "comments": [
                {
                  "score": 480,
                  "content": "If they have the kind of money to throw around on (presumably) American college tuition and not even blink, we're talking about a substantial amount of money here. Like college debt free, solid down payment on a house and more kind of money. That's the kind of inheritance that ends in \"illions\". For that money, I would skip bare ass naked to the courthouse while singing their favorite song and change my name to ChickenLittleLaidAnEgg.",
                  "id": 224,
                  "comments": [
                    {
                      "score": 125,
                      "content": "It sounds to me like they're not from America but she is. And they the country that they're from make a big deal out of names and surnames. \n\nI'm not suggesting they're from this country, it's just in my head because I watched a video on a famous person from there, but in Japan, at least during WW2, there was a famous general who changed his last name to that of an entirely different family that he wasn't related to to become their heir. \n\nNames and heirs are a bit cultural thing.",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "This is an excellent point. OP dislikes the father for obvious reasons, but she likes/loves his parents. They're in the life of OP's son and seem to love him. In that sense and in ability to help, they're quasi -parents or at least could be thought as they are. This also could bring them closer, meaning that your son would benefit, not monetarily, but in an emotional support of his grandparents during his youth. The inheritance would be just the fallout of this great relationship with them when they pass.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I was thinking, my biggest fans didn’t even help pay for my college, I sure wish “not my biggest fans” would have stepped up.",
          "id": 227,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2937,
      "content": "YTA\n\nAnd if I ever found out I wouldn't forgive you.",
      "id": 228,
      "comments": [
        {
          "score": 616,
          "content": "I agree with this guy.\n\nI dont care about the shitty father. But if getting tied to the family name/grandparent gets me a huge inheritance id be mad at your decision at…younger age.  Older age i might sympathize with my mother.   Maturity thing\n\nIf their name is worthwhile.  Your son, their geandchild could also benefit just having the name\n\nName opens doors.  Youre deciding based on selfish/sentimental reasons",
          "id": 229,
          "comments": [
            {
              "score": 32,
              "content": "yeah it wouldn't be the name of his shitty father. it'd be the name of the family that loved him.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 193,
          "content": "Yep.\n\nAll I see is a selfish mother who would roll the dice with her son's future just to stick it to a man who isn't even alive to stick it to anymore.",
          "id": 231,
          "comments": [
            {
              "score": 25,
              "content": "I see selfish grandparents who have the means to provide this life changing amount but hold it over OP and her son to jump through their hoops and conditions including changing his identity. \nI would be pissed if my mum sold my name and identity out for money that the people offering could provide without the condition of they wanted to. If they don't, so be it, money was never mine to begin with",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2339,
      "content": "NTA.  They are the ah for tying money to a name.  If they want him to have it they should give it to them regardless of the last name.",
      "id": 233,
      "comments": [
        {
          "score": 2245,
          "content": "You know. I'm curious what other strings that money will have.",
          "id": 234,
          "comments": [
            {
              "score": 1326,
              "content": "EXACTLY!!\n\nWhy is everybody assuming that somebody willing to make this kind of demand will just leave it at that? If OP gives in from now until they die they can hold the will over her head and threaten to change it if they don't get their way.\n\nHonestly if somebody can't respect something as basic as the name I chose to give my child I'd question whether they should even be in contact with them.",
              "id": 235,
              "comments": [
                {
                  "score": 941,
                  "content": "Agree 💯 this is controlling behaviour. And totally sexist. The kid should have her name.\n\nETA: Why are women’s surnames disposable? Why is there no respect for her naming her son with her name given she’s raised and birthed him?",
                  "id": 236,
                  "comments": [
                    {
                      "score": 115,
                      "content": "Agreed!!",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "It's not even that it's mums surname for me....it's that their grandchilds name is disposable to them that pisses me off.",
                      "id": 238,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 400,
                  "content": "Because Redditors can only think 1 step ahead. This site is filled with people who have made SHIT decisions their whole life but will happily hop on this sub and tell you EXACTLY why you're wrong and how theyd do it better. DONT ASK ADVICE ON REDDIT.",
                  "id": 239,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Thank you!! Like these responses are terrible and i wish OP never went on here to ask and just went to a lawyer and therapist",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 159,
                  "content": "Not to mention if she decided to change her mind about them being in her son's life you BET YOUR ASS they'll attempt to claim grandparent's rights and her changing his name will NOT be in her favor.",
                  "id": 241,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yep what if they turn out to be controlling in other ways? No thank you.",
                      "id": 242,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "A will can also be changed at any time, it’s not as if it’s done and dusted now if she does the change the name. They could easily take him off if she doesn’t go along with whatever their next demands are",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "They could still make it a provision of the will.\n\nI hereby declare that Mike Middleclass will inherit everything if he becomes Marshall McWealthy. \n\nSo all of the people who are worried about the grandparents dying before he turns 16, they can stop worrying.",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This tread needs to be so much further up. All those strings you see coming. And the drama that ensues because kid is 'loved' but mom is not.",
                  "id": 245,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 382,
              "content": "I'm predicting decades of emotional blackmail ending with the kid ultimately getting nothing anyway. WTF is going to happen when OP marries and they want the kid to have their new name..",
              "id": 246,
              "comments": [
                {
                  "score": 32,
                  "content": "That happened to my late husband.  His grandmother put all kinds of strings on him and his family members.  When she died, they got nothing.  Only the rebel who didn't comply got the goodies.",
                  "id": 247,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Just because OP gets married doesn't mean her existing son would automatically be given the new guys name. I had a different last name from my mother growing up after she remarried and I kept my deadbeat loser father's name. Surnames are meaningless anyway so if the son could get an actual benefit from having a certain one, OP should 100% do that.",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "People usually don't change their child's last name when they remarry I don't know where you're getting that from",
                  "id": 249,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 337,
              "content": "Anyone who would bribe a child with a promise of a future inheritance won't do it just once. That inheritance will be dangled over his head forever.",
              "id": 250,
              "comments": [
                {
                  "score": 34,
                  "content": "You’re so right. What other hoops will he have to jump through? And why shouldn’t he have his mom’s name? She’s raising him and it makes it easier with school, activities, etc.",
                  "id": 251,
                  "comments": [
                    {
                      "score": 24,
                      "content": "The next hoops include demanding they live in the same country, demanding the specific schools to attend, demanding specific sports / social activities, the list goes on...",
                      "id": 252,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Damn fucking straight. Rich arseholes",
                  "id": 253,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "It will never stop. They will want more and more control. I think OP is right to say no. I’m shocked so many people are going the other way!",
              "id": 254,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": ">I'm curious what other strings that money will have.\n\nI was wondering the exact same thing.  What other conditions will they hold over OP's head so that her son will inherit.  What if they want legal guardianship?  What if they want OP's son to follow their religion? And the list can go on and on without any guarantee that they will actual leave her son as the main inheritor.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "100%. Most of this thread didn’t have a narcissist parent, and it shows.",
              "id": 256,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Is it possible that by changing the surname, the grandparents would have a greater claim to somehow take the child?",
              "id": 257,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Probably a lot because it will likely be in a well written trust,  as it should be.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Thank you! The next statement is “kiddo has to come and stay with us every summer or he’s getting written out of the will.” Then it’d snowball from there.",
              "id": 259,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I can tell you. The son will be part of the fathers family. OP will become the outsider. I know what i would do to make my grandkid like me more than his mother. Possibly even taking the child away from his mother. Dont even underrastimate what rich grandparents would do if they are allready willing to use blackmail like this.",
              "id": 260,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 692,
          "content": "I have to wonder, would the grandparents be putting forward the same proposal if OP had a daughter? Would they pressure a granddaughter to adopt and keep the family name if she married, or even to hypenate it?\n\nOr would they just view it as the end of the line and accept it?\n\nAlso, OPs suggestion of \"lets wait until son is 16 and let him decide\" seems like an ok one, but may end up with the grandparents applying overt and covert pressure to encourage him to change his name.\n\nOr suppose he agrees to change it to get the money but hates the name. Are they going to rig it so that he can't change his name again down the road as an adult?\n\nOr what if the child later decides they are not a he/him, and that they want or need to change their whole name to align with their gender identity?\n\nOverall, I think OP has the right answer. This is their grief talking. When someone's spouse dies, counsellors often tell the surviving spouse to wait a year before making drastic changes that aren't neccesary.\n\nThis is a similar situation. Saying \"this is not the right time. lets wait a couple of years and then revisit the topic\" is the wise thing.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Wild how this isn't the most popular answer in this thread. Fuck those grandparents for making their support conditional, their weird blue-blood brahman obsession with carrying on the family name, and their disrespect to the mother of their grandchild. \n\nPeople are calling her petty for not wanting to arbitrarily change the child's name to that of his deadbeat dad, when there was never any marriage in the first place? She raised the kid at 19 with no spousal support—she can give him any name she pleases. Her offer of giving him the choice at 16 is more than fair. The grandparents can take it or leave it. If they have any love at all for him in their hearts, the will write him into the will anyways. If they don't...we know what kind of people they are.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Scrolled way too far for this, I agree completely. Mom is NTA, grandparents are flaming AH's. Everyone trying to spin this around on mom is bonkers. The **grandparents** are holding their grandkid over a barrel.",
          "id": 263,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I'm absolutely losing it at the number of people who think the *literal name of your child* should be for sale to anyone with money.  And OP isn't even struggling, she's doing fine!  Why tf is she supposed to turn around and let someone brand her kid for money she doesn't need and has absolutely no guarantee her kid would see anyways?",
          "id": 264,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I had to scroll wayyyyy too far for this logical take. Not to mention the further hoops OP and son will have to go through if she allows them to control this, it’ll never end.",
          "id": 265,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Agreed. It’s the “everything is for sale” mentality that bothers me. Maybe let the kid decide when he’s 16-18.",
          "id": 266,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I’m shocked I had to scroll so far down for a NTA. Like I get it, it’s a lot of money, but they’re basically telling OP that there’s conditions \n attached to their resources. I think they’re AHs for even asking, she’s a single mother who sounds like she takes great care of her kid and they should respect that she wants to be connected with her son in name and not have to be constantly reminded of the AH who knocked her up and wanted nothing to do with her. I feel like a bulk of the YTA people are under 30 and don’t yet understand that truly money isn’t everything. If the grandparents love the son and want to be a part of his life which OP has clearly gone out of her way to facilitate, they shouldn’t put conditions on his inheritance by forcing OP to change her sons name like he’s  their property.",
          "id": 267,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Imagine if they don’t follow through on their end of the bargain.",
          "id": 268,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "How do more people not see this? Do they love the grandson or not? What does a name have to do with who they decide to include in a will? Are they so petty that they will deny a kid an inheritance over having their name passed on? And what if he changes it back after they die?",
          "id": 269,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1166,
      "content": "NAH… no matter what you do you could be considered an AH!\n\nBut…\nCould you suggest hyphenating the surnames?\n\nA) you’re primary parent so he should have yours\n\nB) I know that sometimes travelling with a child with a different surname to you can be problematic (asked for proof that they’re your child with birth certificates etc) so him having your surname would be helpful in those circumstances (and sure there’s other circumstances)\n\nC) he still has their surname\n\nD) he can then choose to amend his surname to one or the other when he’s 16?\n\nJust a thought!\n\n(Edit was because spacing)",
      "id": 270,
      "comments": [
        {
          "score": 425,
          "content": "How is it N A H? The grandparents are being vile",
          "id": 271,
          "comments": [
            {
              "score": 132,
              "content": "I would not be so quick to pass judgement. They are also grieving for their son who just died at 28.",
              "id": 272,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's so manipulative. \"We'll be generous and let our grandson inherit but only if he doesn't have his mother's name\". That's gross. \n\nShe is the one who raised him and is raising him. Of course the child should have her name. Their son didn't even pay child support willingly. \n\nThey aren't her biggest fans and now they don't even want her child to have her name? Nah I wouldn't trust this at all. Either they want to be grandparents or they don't. Don't play games.\n\nHopefully it's just the grief talking and they will come to their senses.",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 159,
          "content": "That was my thinking too! Giving the double barreled surname now might come a bit of an annoying mouthful, but it sets up the child to make his own choice when older without missing out on anything in case the grandparents die before then.",
          "id": 274,
          "comments": [
            {
              "score": 21,
              "content": "I have a hyphenated name and it’s actually helpful professionally because it means I’m the only one with my name. It’s also easy to drop one in non-legal situations if it’s too long or annoying.",
              "id": 275,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "This is the best compromise. While the grandparents have been obviously involved and supportive of their grandson, OP is still, y'know, raising the kid and doing the thankless day to day stuff. A lot of which will be made slightly more complicated by having different surnames. I get that the grandparents are grieving but they're putting a lot of stock in a name while OPs should just be discarded? What if the kid does something when he's older that the grandparents disagree with? This kid isn't a replacement for their son.",
          "id": 276,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "This. There's probably a better compromise here than just a full switch to the Grandparents' family name, because this can also create issues for Mom OP with how local organizations treat guardians (travel, school enrollment, hospital visits) when last names are different from the minor. \n\nI wouldn't immediately say no to a name switch, but Mom's name is important too.",
          "id": 277,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I don't get why this is the first post bringing up parent and child having different surnames. After my parents divorced, my mom kept my dad's surname solely for when it came to me and my sister. I definitely think OP should bring up the possible complications that could arise from her and her son having different surnames.",
          "id": 278,
          "comments": [
            {
              "score": 5,
              "content": "I don't understand it either. People are screaming OP ego gets in the way and stuff. Only thinking about the money. What about the consequences for OP?!?",
              "id": 279,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1075,
      "content": "[removed]",
      "id": 280,
      "comments": [
        {
          "score": 112,
          "content": "Yeah, that’s what I was going to say- this feels like she’s considering her own ego more than her kids entire future here. Like, I get the sentiment of “money isn’t everything” but it kind of is. Having access to the kind of wealth that pays for higher education, being able to buy a home, not accumulate debt, or to simply not live in fear of major emergency expenses… That to me is far more important than not taking a last name just because dad sucked.",
          "id": 281,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Does no one think about why this request suddenly matters? If they really loved him, they wouldn’t care.\n\nWhat’s next? “Oh you have to be Protestant, or else we won’t give him inheritance.” “Oh, he’s dating a black girl? Well I don’t want money going to THOSE types….”\n\nThis is the beginning of financial abuse and it is FLOORING me how Reddit, which is so quick to call that shit, is suddenly changing tune.",
          "id": 282,
          "comments": [
            {
              "score": 16,
              "content": "Right?? I'm so surprised by all the Y T A responses.",
              "id": 283,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Not to mention, the child might very well have had no inheritance if the grandparents’ son had gone on to have “legitimate” children.",
              "id": 284,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "\"They have no obligation to give your son anything.\"\n\nThat will continue to be true even if OP changes her son's name. People willing to use underhanded tactics (like implicating disinheritance if they don't get their way on the name change) are unlikely to stop at one request. Next they'll want OP to move to where they are, or let them raise him, or make him pursue a particular career, etc etc.\n\nIt's disheartening how many people are so ready to sacrifice anything for $$.",
          "id": 285,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "What happens when the next statement is “kiddo has to come and spend every summer with us or he’s getting written out of the will”? Or “if we’re going to give all our money to kiddo, we want you both to move closer.” Her kids name shouldn’t be for sale.",
          "id": 286,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "its good to have pride, op has money so its not like the options are change the name or live on the street... \n\nI wouldnt give in to people who said they would only leave inheritance to their ONE AND ONLY GRANDCHILD if they did xyz",
          "id": 287,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1069,
      "content": "NTA I’m surprised that this seems to be the minority view. You’re his only caring parent, and that was true even before his father died. It’s sort of insulting that the grandparents would only consider leaving the inheritance if he shares their name, it feels as if they only consider him proper family if he shares their name when ultimately he’s their grandchild either way. If they’re willing to leave it to him at all, it shouldn’t be based on such weird conditions which immediately tells you it isn’t about love or kindness. Not to mention, the fact this is only coming up now suggests they didn’t really care before realising he was going to be their only ‘heir’ - they were absolutely counting on other grandchildren to come along. Suggest the 16 years of age thing and also consider if you’d be happy with your son having a double barrelled name with theirs. \n\nPeople are accusing you of putting pride and ego above practicality (money) but they are putting pride and ego above family. Money isn’t everything. If you think you and your own family are comfortable enough that your son will not struggle then imo you’re all good. You don’t need family with strings. If you bend on this, who knows how many other things they are going to push you on “for the good of your son” in the future. \n\nSome people on this post seem to think a surname is meaningless but I disagree and I think particularly for women to share their name with their kids it can be a very significant feeling. Lots are saying your son will never forgive you. If I were your child, as someone who did not grow up with money at all, I would still rather have the name than the money.",
      "id": 288,
      "comments": [
        {
          "score": 284,
          "content": "Yes, once they see they can get their way with the name, next step will be what schools he goes to, etc.",
          "id": 289,
          "comments": [
            {
              "score": 231,
              "content": "People are acting like no one rich has ever disinherited themselves by leaving their controlling family and taking no money and starting again.  This isn't a gift.  This isn't even an inheritance.  This is blackmail.  Same as eith blackmail, the blackmailed and keep coming back for more because they hold the power.  This will never end.  Compromise and get an irrevocable trust in his name if they are so wealthy and generous and just want their sons name carried on.  Then she can consider it.",
              "id": 290,
              "comments": [
                {
                  "score": 29,
                  "content": "Also they waited until their son died and they had no chance of other grandchildren. This wasn't \"he's our eldest grandchild he should be our heir\" it's \"he's the only choice we have, please change the name\"",
                  "id": 291,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Or they try to sue for custody themselves.",
              "id": 292,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "What country he lives in… strings attached beget more strings attached.",
              "id": 293,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "Exactly. Why is OP’s surname (and that if her son’s) disposable? I get they’re grieving but this is controlling.",
          "id": 294,
          "comments": [
            {
              "score": 55,
              "content": "That’s how I feel. If the surname is allowed to be such a big deal for the grandparents, why is it not allowed to be a big deal for OP, the actual mother raising the child. It’s insulting and undermining. \n\nMakes me think that they feel like the money they offer is more significant than all the parenting she will do, which is why they think it can be tied to the name.",
              "id": 295,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Bunch of whiners on this thread moaning about not forgiving their parent if they didn’t get money that wasn’t even theirs to begin with.  Wah, I didn’t get a free ride because my mom had some pride.",
          "id": 296,
          "comments": [
            {
              "score": 8,
              "content": "This thread really shows how many teenagers are on this sub.",
              "id": 297,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "NTA. Thank you for this. The Y T A responses are seeing dollar signs and not seeing how the grandparents are asking for something (a name change) by holding money over OP's head. That is financial control and it is generally a bad idea to let someone control you with money.\n\nThe grandparents should be recognizing their grandchild anyway. In any traditional family, you don't have the same name as two of your four grandparents and they would be assholes to deny you inheritance because you are a child of their daughter and don't have their surname. People aren't entitled to have their name pass on anyway - they can have all daughters and therefore traditionally the surname would not pass on. And what, are people saying they have the right to demand one of those grandkids to change their name or they'd be disinherited? That is ridiculous. The grandparents are asking this because it's their deadbeat son's child, and they are making a rather sexist assumption that they are entitled to have the kid take the surname of the male line. \n\nAnd further, the kid's actual father isn't involved in their life, OP is the single parent, so of course the kid will have OP's name. \n\nI say if the grandparents want to pull this maybe they need to learn that OP is the only legal guardian of OP's kid and their relationship is happening with OP's consent. And they're basically threatening to disinherit the child if OP doesn't do what they want. That'd be an interesting case if OP cuts them off: \"we want grandparents' rights after blackmailing OP and refusing to put the child in question in our will\".",
          "id": 298,
          "comments": [
            {
              "score": 8,
              "content": "Yeah these comments are messed up.\n\nMy cousin was not blood related at all. His mother was not a part of our family. But you know what my grandparents did? They didn't make a fuss. They  loved him even with a different last name. They still put him on their inheritance because they loved him. They didn't even ask him to change his last name.\n\nSo I can't believe there's tons of people defending the grandparents, when there's grandparents put there (like mine) that would NEVER set that condition.",
              "id": 299,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "All the Y T A have me shook. I come from a family just like this and trust me, money WILL be used to manipulate OP and the kid. Wealthy families who care about status have a fucked up view of the world and relationships. OP is NTA. Anyone who says otherwise is some broke person willing to sell their soul for money (which, fair, but also y’all are projecting your own monetary needs onto OP and her son).",
          "id": 300,
          "comments": [
            {
              "score": 13,
              "content": "Well, it's Reddit, where everyone will bemoan billionaires and generational wealth but be so willing to sell themselves off for their first chance at it themselves.",
              "id": 301,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yeah, I would have been proud that my mom refused to sell my name for money.",
          "id": 302,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yes yes and yes! People here are so money hungry :(",
          "id": 303,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Can’t believe I had to scroll this far for some sense!",
          "id": 304,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Everyone is just chugging the patriarchy juice. She's the primary parent and they should have the same last name.",
          "id": 305,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I have a narcisstic grandmother who put strings on everyone.. If my mom would have chosen to give me her name so i weill be the only heir, I would be so mad.  \nI don't want to be \"traded\" for money, even if it's just a name\".  \n\n\nmy grandmother was always like \"i support you financially, if you come to me at least once a month\". And that was when I said- nope. Ill visit you, when you like me and we are a family but not when you try to buy me..",
          "id": 306,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}