{
  "post content": "My kids and husband are saying i was being a asshole/karen for being snarky and for quietly complaining to my family that the service sucked. What do yall think?\n\nWe went out to a late dinner at a all night breakfast place. The hostess asks us how many people and I tell her 4. She then turns toward the paper menus, licks her fingers and starts grabbing menus and counting them out. She turns back to me and asks do we need anything else. I told her some menus that didn't have her saliva all over them! We are in a global pandemic , you can't be doing stuff like that! \nThe hostess looked startled and a manager having seen her lick her fingers and heard my comment came running over and grabbed us new menus. A nearby waitress laughed out loud. \n\nWe were seated. Ordered quickly and when the food begins to come out , my daughter's meal is missing and none of the dressings are on the plates. The waitress asks if we need anything else. I just say, the missing meal, syrup, ketchup and ranch and we will be all good. \n\nThe waitress returns with ketchup and I again ask for ranch ,syrup and the missing meal. She returns with a cup of dipping sauce that I soon discover is tartar sauce. I flag her down again and again ask for ranch and tell her of the mistake.  She returns with the ranch. 20 mins later my last child gets her food. We ask for the check and to go containers. Having given up on syrup , we stole one from a departed table. She gives us the check but never gives us containers so we had to flag down the hostess from before. The hostess brings us the containers and tells me she's now wearing gloves and a mask and she's sorry about before. I just told her okay and turned into start packing up leftovers. \n\nSo Am I the asshole for being snarky and not thanking the hostess for putting on gloves and a mask?  We left a 15% tip and filed no complaints so I think I'm not the asshole.",
  "id": 1,
  "comments": [
    {
      "score": 421,
      "content": "ESH don’t go out to eat during a pandemic",
      "id": 2,
      "comments": [
        {
          "score": 107,
          "content": "But-but-muh all-night breakfast",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "This.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 285,
      "content": "ESH.  She did a bad job, but the snarkiness wasn't called for.  Also, as you said, we're in the middle of a pandemic, a 15% tip is low considering she's literally putting her life at risk so you can get pancakes.",
      "id": 5,
      "comments": [
        {
          "score": 141,
          "content": ">she's literally putting her life at risk\n\nShe's putting other people's lives at risk by licking the menus though.",
          "id": 6,
          "comments": [
            {
              "score": 41,
              "content": "Yes, and that's part of why she sucks too!",
              "id": 7,
              "comments": [
                {
                  "score": 11,
                  "content": "I believe the term is \"licks\" :)\n\nNTA - Shitty service gets shitty tip. That's kinda the point behind a tip, no? To go above and beyond to express your thanks for good service.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 7,
                      "content": "A shitty service deserves no tip.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "15% isn't low for poor service.",
          "id": 10,
          "comments": [
            {
              "score": 18,
              "content": "I'd argue that it's low for poor service during a pandemic when you were a rude customer.",
              "id": 11,
              "comments": [
                {
                  "score": 12,
                  "content": "How was OP a rude customer? Starting from the time they walked in the door,  there were problems.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Yes, and I suppose having to ask constantly for what they ordered to be brought out, when everyone else at the table had theirs is such great service, if that happened where I live, they would get no tip, cause that is just bullshit that they had to ask several times for their order to be brought out",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "You don't even know where she lives, it might be reasonable for one place and not for the other.\nThat's not being rude, she paid for it.",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "She’d put life at least risk if she was wearing a mask.",
          "id": 15,
          "comments": [
            {
              "score": 6,
              "content": "Yes, and that's why she sucks too!",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "But she gave poor service. Why would he even consider more? Yes she's working during Covid 19 but if the service is poor,  she doesn't deserve a 20% or even 15% tip. That's rewarding bad behavior.",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "She deserves no tip.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "15% isn't a low tip! Especially as she gave terrible service. Personally I wouldn't have left a tip at all but I do get that it is considerably worse to do so in the US because waitresses don't get paid enough without them. NTA",
          "id": 19,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 130,
      "content": "ESH. If I walked into a restaurant and saw a hostess lick her fingers before touching the menus I definitely wouldn't risk eating there because clearly their safety precautions aren't up to par. You chose to stay, and it was all downhill from there. Not really a shocker. That said, I don't think you were wrong for being snarky. Bad service is bad service.",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 105,
      "content": "ESH. The service sounds like it was definitely lacking, but why go out to eat when you’re so concerned about the pandemic? And these people are putting their lives at risk for you because you’re not wearing a mask and gloves when you’re eating and drinking, so you could stand to be a little more gracious and forgiving.\n\nETA: 15% is a garbage tip, especially under these circumstances.",
      "id": 21,
      "comments": [
        {
          "score": 54,
          "content": "\" but why go out to eat when you’re so concerned about the pandemic?  \"\n\nEXACTLY",
          "id": 22,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -51,
          "content": "I typically tip 20-30%(Sister is a server) , the service was just so bad this time that I left the bare minimum of 15%.",
          "id": 23,
          "comments": [
            {
              "score": 27,
              "content": "Yeah you couldn’t excuse poor service at what sounds like an IHOP during a pandemic \n\nYTA",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 52,
      "content": "YTA. How do you not see the irony of complaining to the hostess about licking the menus when **you are the one going out to eat during a pandemic?** If you're trying to support restaurants, great, get food to go. But sitting in an enclosed area with a ton of other people is what is going to make this pandemic worse. Her licking the menus is probably not going to do anything.\n\n&#x200B;\n\nAll your other complaints about the service seem reasonable, but seriously, **people should not be sitting down and eating in restaurants right now!**",
      "id": 25,
      "comments": [
        {
          "score": -61,
          "content": "It was our first time eating in after our area reopened 6 weeks ago. We went late and to a place that was practicing social distancing.  We followed all the social distancing rules. \n\nThe hostess was the only employee not wearing a mask and according to their sign, was violating the franchise rules. I understand everyone needs to stay in more and be more conscious of the things they touch and keeping distance. But sometimes you crave your routine too.",
          "id": 26,
          "comments": [
            {
              "score": 44,
              "content": "Cool explanation, still an asshole.",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Honey overpriced pancakes aren;t routine they're a luxury that nobody needs right now",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "None of the customers were since they were *chewing* and they still have to move around the restaurant at random intervals, and the one person you *saw* violating protocol was **licking things other people would be touching** until she got reprimanded--how much of that risk is worth your \"craving,\" because it's not just you that you're putting at risk",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "\" But sometimes you crave your routine too. \"\n\nSaying \"sometimes you crave your routine\" isn't an excuse. I'm sorry, but we're all sacrificing a lot because of this pandemic. I'm a health care worker, and I work with a lot of people even higher risk than me. I don't think asking you to give up a luxury is too much to ask to literally save lives and reduce our risk.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23,
      "content": "No, snark is always the best tool for people-people interactions. YTA.\n\np.s. a 15% tip doesn't erase your rudeness",
      "id": 31,
      "comments": [
        {
          "score": 7,
          "content": "How would you have handled the situation? Taken the saliva wet menus or say something?",
          "id": 32,
          "comments": [
            {
              "score": 20,
              "content": "There are ways to be kind. Like asking politely for another set of menus. \"Would you mind grabbing us a new set of menus? I noticed you licked your fingers before touching those. Thank you.\" All can be said without snark.",
              "id": 33,
              "comments": [
                {
                  "score": 9,
                  "content": "Tell her to go wash her hands first. I’m not taking any menus from licky hands over here. I am sorry about the restaurants too but I’m not going near a restaurant until it’s safe like vaccine safe to do it. No pick up or delivery, nothing. They magically became palaces of extraordinary sanitization because it’s a pandemic?",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Since it sounds like OP is in the US, I would've taken this as a sign to reconsider my life choices and gone home to order delivery/to go from somewhere else since our virus numbers are still climbing at a stupid rate",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "I would have asked politely",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "ESH\n\nHer: keep ya fingers out ya damn mouth\n\nYou: make ya own damn pancakes\n\nI rest my case",
      "id": 37,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 18,
      "content": "The disconnect of you saying we're in a global pandemic when you're going out and eating at a restaurant during this time.",
      "id": 38,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "You were right about the saliva. And the service sounds horrible. I don’t really see where you were snarky or a Karen. Reminding a server multiple times for what you ordered isn’t wrong. \n\nNTA.",
      "id": 39,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "ESH. Why the fuck anyone would go to a sit down restaurant is beyond me. If you're that worried about your health then don't go out.",
      "id": 40,
      "comments": [],
      "relation": "No"
    }
  ]
}