{
  "post content": "My wife (37f) and I (38m) have 3 kids, 12, 10, and 8. She is in a constant state of overwhelm and very easily irritated, constantly complaining how it's all too much. I'm of course happy to help and do my fair share for the kids or household, but it's never enough because her standards are too damn high. \n\nShe insists one of us has to be up at 6:45 every morning to make sure the kids are ready and make the bus which comes at 7:45. I told her they're old enough to not need that much help already. They can all dress themselves and pour themselves cereal and milk, there's no reason we have to be up. She says that cereal isn't a good enough breakfast, they need something more substantial, especially the 12 year old, and that the 10 year old has adhd and will definitely struggle without help in the morning and anyway she wants to see them off and kiss them goodbye for the day. So she gets up, I don't, then she gets upset that I never give her a morning off when all she needs to do is just take the morning off when she wants and let the kids handle themselves. \n\nAlso she is super strict about screen time during the week and is exhausted and snappy from arguing about it with the kids and upset i don't support her strict limit of 2 hours a day. I say as long as homework is done, why not until bed. She says it's not healthy for them, they need to play outside or with games and toys, read some books, just entertain themselves in more ways than 1. I agree they should enjoy other things but not seeing why we have to make such a rigid limit. She also likes to get out on weekends and do stuff like zoos, museums etc, but then complains about the planning for the outing and how grouchy the youngest gets by the end of it, and again, I say let's just chill at home and voila, you've cut the work! \n\nI'm an engaged and active parent, I'm not trying to get out of it, but I don't think I should have to help my wife dig herself out of her own self created holes. She creates the stress for herself and then turns to me to alleviate it which I think is unfair. AITA for telling her she needs to do less and then she won't need this level of help?",
  "id": 1,
  "comments": [
    {
      "score": 47778,
      "content": "YTA. Your wife’s standards are just…being a decent parent, and you are not doing your ‘fair share’ if you aren’t helping with these things you consider ‘unnecessary’. An 8 year old and a ten year old with ADHD are not ready to totally get themselves ready in the morning, and you’d know that if you didn’t sleep through the morning routine every day. Two hours of screen time a day is a totally reasonable boundary. And family time and enriching activities are also important. Maybe those can be cut down slightly, but ‘just chill at home’ all the time isn’t the answer either. Stop being lazy and become an actually engaged parent like your wife is.",
      "id": 2,
      "comments": [
        {
          "score": 13725,
          "content": "To be fair - a lot of kids around that age have to get ready on their own because their parents already left for work. I was one of them and it was pretty normal in my social circles and now I am a teacher and know this from lots of students - from when I was 8 my parents left at 4:45 and 6:30 for work and I had to get up and ready on my own. My mother called every morning at 7.15 to check in with me, though.\n\nBUT if my parents would have been home and decided to sleep in instead of getting up with me I 100% would have felt neglected as fuck. Where on earth would that be acceptable behaviour for a parent. Holy shit OP is completely out of touch with reality.",
          "id": 3,
          "comments": [
            {
              "score": 6752,
              "content": "I was one of them too, and it was not good. If the parents are available they should be part of the routine.",
              "id": 4,
              "comments": [
                {
                  "score": 4535,
                  "content": "My mom and dad made sure I got ready for school until I went to university. Even if I was getting my own breakfast and packing my own lunch, mum and dad were still there every day making sure I knew what we had for breakfast and what leftovers needed to go before they went bad. \n\nMy mum didn't have to leave super early for work, and my dad was a SAHD. I loved that shit. Do better, OP, YTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1990,
                      "content": "I had this too and it was honestly so lovely. My dad gave me piggyback rides from bed to breakfast practically until I got taller than him - and would have happily continued except that I realized that I'd probably start hurting him lol. Did he need to? Absolutely not! But it meant that I started every school day with a few seconds hugging my dad. He got up with us every day, even when I was 18. I was perfectly capable of getting myself ready and off to school, and I was a grouchy morning teen so we didn't talk much, but it was nice just existing together in the dark - and collectively giving my mum shit on the rare occasions that she got up and started messing with our routine :D \n\nThis post makes me so sad, cuz he seems to think he's a good father just cuz his kids are still alive, while his wife is actually working her ass off to make sure they're also loved and flourishing.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 723,
                      "content": "I changed job so I could do the school run again. Dad and I are there until 8, dad leaves, then I leave 10 minutes later with the kids. I always have breakfast sorted, even though my son is 14 so they can have a few minutes to chat with us in the morning. I even do my make-up in the kitchen so I can chat to them. I go to the school for 8:40 because my teen has to be there for 8:45 and he wants to walk with me and his sis and the 10yo goes in at 8:55 and then I walk the 5 min to work. I used to leave before them and not see them off to school but I had to change it for them because they are just kids and need one parent to keep an eye on them so they can grow without undue pressure",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 711,
                      "content": "Omg I love that for you. Sounds like a safe space",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 309,
                      "content": "When I was in highschool my dad would still prepare our lunches even tho he was already gone to work by the time we would wake up and my mom was taking care of our baby brother",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "same but because she wanted to make sure we actually went to school haha",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Does your family have room for one more?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "My mom was a stay at home mom. She made sure I was awake and mobile at 6 am. I was not a morning person and without her I wouldn't have gone to school. Miss her every day.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Same. I did have to make my lunches (my mum gave up pretty early on that one lol) but my dad got me up every day from elementary school through high school graduation. I know not everybody has that, and if his work schedule was different, sure, I would've made do. But if I knew he was home and just sleeping while I getting ready by myself, I would've felt like I was missing out on something.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "My parents were the same. They made sure I got ready even into university while I was still living at home. 🩷",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My mom was a SAHM and my dad left for work at like 4am so she was always there alone to get us ready. When she left after cheating, my dad would leave a small note with my lunchbox every morning. He was there even if he couldn’t be there.  YTA OP. Be there for your kids",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1141,
                  "content": "Yeah my parents did this and as consequence I ate nothing all day cause I was never organised (ADHD). OP your wife is right an ADHD kid literally actively needs help especially in planning/prep activities (aka the morning).",
                  "id": 16,
                  "comments": [
                    {
                      "score": 683,
                      "content": "Heck, my fiancee is 30 and has ADHD and sometimes forgets her lunch for work, or doesn't have time to eat in the morning because she wastes time lying in bed/playing with the cat. I can't imagine trying to be 10 and managing that.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "I didn't have ADHD, but because my brothers ate like teenage boys, my disordered eating habits were not noticed. I was able to hide so much because my parents were always at work, or if they were home they didn't keep track of anything I was doing beyond where I was.\n\nOP YTA. Spending time with your kids is knowing your kids.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Not to mention a high carb breakfast of cereal is not the way for a kid with ADHD to start the day!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "As a person with ADHD I can confirm!!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I pack a huge lunch for my ADHD 12th grader (17 yrs old) bc otherwise he just wouldn’t eat. He often doesn’t eat it all (or any of it) at school, but when he comes home he eats it as “snack” and is still somehow able to eat an actual dinner, too. \n\nI pack it bc I care and I want him to eat. Once he’s at college, we’ll pay for the meal plan, so he can go eat when he’s hungry, but I do sense there will be a transition period the first year.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah I have a kid that age with ADHD and the idea of her getting herself up, ready, and out the door in the morning is pretty comical.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "i was undiagnosed as a kid (ADHD but AFAB so hallmarks of it don’t appear as fast as in boys) and because one of the major problems of ADHD is a delayed sleep phase where our circadian rhythms often operate much later than someone neurotypical, it was an ORDEAL to get me out of bed early as a kid when school started at 8. Heck, now as an adult it still takes me like two hours to fully “wake up” and without guidance, i would be even more late every day as a kid if my mom & dad didn’t help me cuz without meds, my brain hasn’t fully left space yet. \n\nYTA op for not doing basic morning work and letting his wife have a couple mornings off",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 386,
                  "content": "Correct. It is 100% neglect to let children those ages try to fend for themselves in the early morning trying to get ready for school.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 449,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 96,
                      "content": "Especially so the parents can have a lay about",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "It definitely wouldn’t go well with either of my kids. The 15 year old is AuDHD and the 11 hasn’t quite got down time management skills. So yeah they’re capable of getting ready and all themselves, but by the time they’ve dressed and eaten they’ve also become completely distracted by something else. So I’m just up to prod them along and to keep them on track",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Same, and I feel bad for younger me who had no one looking out for her. So many embarrassing moments that could have been prevented had my parents been around in the AM.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1265,
              "content": "I currently take a neighborhood 12 yo with ADHD to school every morning because their parents sleep in every morning instead of making sure they have what they need, are fed, and make it out of the house on time.",
              "id": 29,
              "comments": [
                {
                  "score": 721,
                  "content": "i have ADHD and my twin and i started living with our grandma at 13. my (in her 70s at the time) grandma would wake up every morning from ages 13-15 to see us off to school. some mornings she had to wake me up bc my ADHD didn't always allow me to go to sleep at a decent time, every morning she'd make sure i hadn't forgotten to take my meds. i imagine being told at 10 to get myself ready would've added a LOT more days of me forgetting my meds (bc that's what ADHD does to you) and then i would've had way more bad days bc of it.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 158,
                      "content": "OP didn't say if their kid was on meds, but if so, that adds a whole other dimension to this! Most ADHD meds need to be taken in the morning. There is ZERO chance I would trust a ten-year-old with ADHD to take their own meds in the mornings.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I have ADHD and my mom was a teacher in a another district. My bus came at 7 but she left the house at 6:30. We both thought I would miss the bus if I didn’t have her there so she dropped me off at school at 6:30 every day and I did homework.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I didn't think of this (not having ADHD), but that's a damn good point.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Not commenting that you should call CPS and what not (only bc i saw all the other comments saying to and you engaging in those comments so i won’t be repetitive), but I do just want to say you’re an amazing person for taking time to ensure this child makes it school on time. It’s not your responsibility but it definitely shows the 12 year old that there is someone in their corner that cares.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I’m in a different though similar situation with neighbors. They love their kids and don’t speak harshly to them, they make sure they’re bathed and have clean clothing- but there’s a lot to be desired with feeding and entertaining them (9 and 5), and often they’re told to “make a frozen waffle” or left on the screen all day indoors on weekends. Since my kid is friends with them I always offer to feed them, take them to outings with my daughter, and engage with them on weekends since I know it’s likely all they’re getting is snacks they can manage while mom and dad are sleeping or zoning out on their phones/tv. It certainly isn’t a CPS situation, but I do feel like if I can be part of the village it’ll help the kids in the long run.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It's wonderful you're able to help them. Not all neglect is criminal but it doesn't mean it doesn't harm the kids!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 911,
              "content": "It makes me sad for the kids that OP could be a part of the morning and is just choosing not to when so many parents don’t even get a choice.",
              "id": 37,
              "comments": [
                {
                  "score": 716,
                  "content": "Also complaining 6:45 is too early? That’s a reasonable time to get up on weekdays with kids.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 439,
                      "content": "I assumed it said 5:45 and had to re-read. 6:45 on a weekday is sleeping in (or oversleeping) for basically everyone I know, jfc. \n\nYTA, dude, and lazy to boot.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 95,
                      "content": "We got up at 6:15 every morning like it wouldn’t kill you to get up at 6:45 to say goodbye to your kids before they go to school",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 87,
                  "content": "This is what struck me too. I would really miss not being there with my child just for the sake of some extra non-essential sleep (no mention of shift work, etc, in the post).",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 667,
              "content": "My mom woke me up for school every day until I started driving myself, telling me to hide my eyes before she turned on the lights. She generally didn't do anything fancy for breakfast, we just made ourselves cereal or something, and she would pack our lunches until high school or so. As I got older, I couldn't believe that she was still doing all that for me, because I was plenty old enough to use an alarm clock, but to this day, I still think about those simple acts and feel loved and cared for.",
              "id": 42,
              "comments": [
                {
                  "score": 207,
                  "content": "My family has always had breakfast together, it’s how we started the day at home. So same, mum would wake us up even in high school :) My parents live by themselves now - mum needs to be out by 7:15, my dad (retired) gets up with her, cleans up afterwards and often goes back to bed afterwards. For me it’s a sign of caring tbh. But I also find it weird when people don’t have dinner together if they’re all at home, completely foreign to me.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 211,
                      "content": "Bruce Springsteen talks about in the podcast he did with Obama, how his wife said he was missing the best part of the day with them.  So he’d get up make pancakes see them off to school.  Now as a rich rock star he could go nap after.\n\nThe Boss would be so ashamed of the OP.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 130,
                  "content": "And OP is choosing NOT to foster that sense of love and being cared for. Ick.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "My tween “loves it” that I still sing him a morning wake-up song when I have morning duty.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 18,
                      "content": "My mom always used to sing us Oh What a Beautiful Morning, and I do it for my kids too sometimes 😂",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Oh god, my dad did the same for years... a morning wake-up song of his own invention. Horrible earworm. I begged him to stop for so long - but many many years post-childhood I still giggle thinking about that stupid song.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I usually call my two for breakfast with silly insults and laughs. \"silly butt face\" was this morning's one. My two are 10 and 14 btw. The older one loves it even more than the smallie. Kids love feeling loved.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Ya the cereal thing isn’t that bad but the 12 year old probably does need more. It can be fruit or something not an elaborate breakfast but he is still super lazy. An 8 year old is too young, I’m even iffy about 10 so does he expect the oldest 2 to parent his kids for him? I hate mornings to the extreme, I’m a sleep disordered night owl and I have gotten up for my kids at 6 am always. \n\nThen let’s talk about the screen time. Why is this a fight every day? For how many years? Two hours is plenty in school nights. They have activities, homework, dinner, baths all of which leave not much time. I’m guessing it’s a daily fight cuz OP makes comments and doesn’t support her.\nThen we have the weekend, wife is making sure they have a great life but it’s exhausting he says let’s chill at home. Who is going to be watching them at home? Since it’s never him I’m guessing her while they are bored and not getting enough activity. Op is gonna be napping, I know it, you know it, she knows it.\n\nHe claims to be engaged and active with the kids but I don’t see a single example of that, al I see is pure laziness over and over. No wonder she is stressed. Definitely YTA. Have to wonder why op even had kids.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Same. Even in high school after I started making my own lunch (and often my dad’s because I put more stuff in the sandwiches and he made the mistake of telling my mom he liked mine better 🤣) my mom still had breakfast with me and saw me off either with my friend who’s mom drove us or to the bus. I had to leave at 6am to get public transit to class in university and she would at least still get up to say goodbye every morning, even though she didn’t have to be up until 7.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 586,
              "content": "She wants her kids to feel loved and supported by their parents spending time with them in the morning before school, time *they have*. They’re children, they want to see their parents before going off to school, they benefit from the time spent with them and the support. I would have felt deeply lonely if my parents chose sleeping in over seeing me in the morning, every morning.",
              "id": 52,
              "comments": [
                {
                  "score": 208,
                  "content": "My mom slept in.  Was a big lump in the bed.  Stay at home mom who stayed up as late as she pleased and slept in.  I had anxiety over making sure my little brother and I had everything we needed, and had to watch the clock to make sure we made the bus.  Cold cereal every day.  I made sure I was up every day for my kids.  They’re grown and I still love making their breakfast Christmas morning— they custom order their favorites.  “Mom, can we have your oatmeal pancakes??? “. OP is missing out on the privilege of giving them a good send off to the world and creating a family tradition.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 48,
                      "content": "And protecting them from being parentified the way you were by being responsible for younger siblings instead of just being a kid.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Reading these comments is interesting because my parents slept in while I fed myself and then caught the bus in the morning and I never felt any kind of negative way about it. Like I dont need someone to sit on the couch with me to watch Spongebob while we're both barely awake lol. Just interesting how everyone is different",
                  "id": 55,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I would have liked my parents to not be around in the morning vcuz I am NOT a morning person and my father could not get it through his stupid head that I needed quiet while I hung my head over my cereal bowl . My mom left me alone cuz she got it but my dad would start a conversation / interrogation, I would be antisocial . He would get angry and it would turn into a fight aka I’m an ungrateful child conversation . Fucking hate mornings to this day . Gen x signing off",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Same. I certainly wouldn't have labelled it neglect that my mom didn't get up with every school day to help me get dressed and feed myself.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I remember the mornings before school, in wintertime my mum would have a lit candle at the breakfast table. I'm 35 and still cherish those memories. I told my mum about it last year, and she don't remember it at all! But to me they were so important.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Even if you’re not like making an elaborate bfast, or making lunch that morning (I do it the night before), just being able to ask” “where is my…..XYZ?” “Is this a day when I have gym/band/extracurriculars?” \n\nLike sure, my child COULD figure those things out on their own IF I kept a very detailed calendar he could look at. But 1) I don’t always, and 2) they just like the comfort of being able to ask! Also the time hack that comes with asking rather than having to look it up.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 398,
              "content": "I have ADHD and there's no way I could get myself ready perfectly and on time when I was 8.",
              "id": 60,
              "comments": [
                {
                  "score": 232,
                  "content": "I have a 12 year old with ADHD & if I didn’t help him get ready, he wouldn’t. It’s extremely challenging but not his fault.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 168,
                      "content": "i have ADHD & i struggled all the way through high school & college. i simultaneously couldn’t grasp how long it took me to do everything & my brain refused to wake up more than 15 minutes before i had to leave anyway.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 208,
                  "content": "I have ADHD and I struggle to get myself ready in the morning and I’m 37.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Hello, me.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "I don’t have ADHD and there’s no way I could have gotten myself ready at 8 yo. I would have either gone back to sleep or gotten lost in a book. I got up with my kids all through school. Their bus was at 6:45 In elementary school, so we got up at 6:15. \n\nOP, I’d suggest you get up with the kids at least 1-2 times a week. If you think they can do it on their own, then start working with them to show them how to do it. Including making something that they can microwave for a hot breakfast or otherwise meet your wife's (reasonable to me) request for something more than cereal. Cereal leaves me hungry after a couple hours, so I see her point.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 27,
                      "content": "With the kids not getting up to go to school, especially if your kid hates school! Like all kids do! \"Oh no looks like I missed the bus, no school for me!\" Honestly what is he thinking",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, it's not that much more difficult to fry some eggs and make toast. Or do overnight oats, rice cooker oatmeal, eggbake prepared the night before, yogurt with frozen fruit in it, or pancakes, etc etc.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I DON’T have ADHD and when I was 10 my mom still had to make sure I didn’t fall asleep on the toilet when getting ready for school. She worked evenings so she got up with us kids in elementary/middle school because my dad was already out of the house by then, and once we hit high school and had an earlier start time my dad took over and she slept in, because even in high school they still felt like we needed someone to make sure that we, like, actually left the house.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I’m in my 30s and I struggle to get myself ready on time with ADHD. \n\nOP’s wife sounds like an excellent parent, creating the routines, structure, and boundaries that ADHDers need to thrive. OP needs to step up and join her.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 247,
              "content": "Can confirm. Felt neglected as fuck at when I was getting up at 6 to get myself on the bus by 7 as a 10 year old while my mom slept.",
              "id": 70,
              "comments": [
                {
                  "score": 25,
                  "content": "My mom went back to bed after we went to school at 0700, and more power to her, very sensible.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I do that now. Get up at 5:30, make a coffee and make sure the 15 & 11 get up at their 6am alarm. I’m just there to make sure they stay on task and not get distracted and as soon as those buses leave (they go to different stops) I close up shop and go back to bed for an hour or so",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Also can confirm, divorced parents-went week to week for 18 years, my dad was my only real parent who tried to be as actively involved as he could while working around the clock. He made sure that my gramps or nana could be there in the morning to help me get ready for school, eat, have everything for the day etc…if he was at work because we shouldn’t be alone in the morning that young. At my moms I was completely on my own from 5-18, I felt so neglected and like she never cared to be there for me. Anyways it’s obvious who I’m still in contact with versus not, the parent who made me feel like a priority and loved. Also I’m in my mid 20s now and my partner still gets up in the morning with me to remind me to eat breakfast, packs lunch etc because of my ADHD, no way a child should be expected to do it on their own",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 235,
              "content": "[removed]",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "I cannot imagine getting ready for school while both parents are sleeping. That seems sad. (Unless they have a night shift or something.)",
              "id": 75,
              "comments": [
                {
                  "score": 19,
                  "content": "Yeah it was, and kinda lonely tbh. Especially during the cold months when it’s still dark af outside in the morning. I don’t blame my mum, she was working long hours and I was 12-13 when this started but it’d be a lie if I said I liked it. I generally dislike mornings now too",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 146,
              "content": "I got myself ready and on the bus from age 10 onwards. I don't think I would have noticed or cared if my parents were up or not. ???\n\nI still very much get the impression OP is not really pulling their weight as a parent though, and that lady's standards just seem normal.",
              "id": 77,
              "comments": [
                {
                  "score": 111,
                  "content": "Yeah the only thing that is maybe excessive is the weekends, if she's planning stuff every single weekend and the youngest child isn't even enjoying it. Spend the weekend getting caught up or just slowing down to chill sometimes.\n\nOtherwise... get up and help your pre-teens handle the morning and spend family time with them in the evening. Two hours is a reasonable amount of (non-work-related) screen time for *adults*, screen time definitely shouldn't be the only thing your kids do after their school responsibilities. And maybe your kids could get the bare minimum done if the 12 yo kept a vague watch over things, but the 12 yo shouldn't have to, the 10 yo likely needs help due to ADHD and the 8 yo likely needs help because they're 8. Help them streamline the time management and maybe teach them to make breakfast foods so they *are* fully competent by the time they're in high school.\n\nAlso, like... what are you wasting your own time on in the evening if you can't get up at 6:45? (Sorry to anyone with sleep disorders, but generally speaking, people just fuck around late.) I would wake up around then if I *wasn't* working out in the morning and was just getting up for work. 10pm-6am is a perfectly normal sleep schedule for an adult with responsibilities.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I have AuDHD. I can get up at 6:45. I’ll just be really nasty and mean all day because I’m exhausted. My brain - no matter what time I wake up - doesn’t start functioning until nightfall. I can’t sleep until my brain agrees to shut down, usually around 1 AM. \n\nSome brains just really don’t work well in daylight hours.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "It depends on the kids. My daughter has no chill and the weekend is significantly more pleasant if we have something planned. Not for every moment, and not extravagant things either. Two Saturday’s a month we go to Lowes/Home Depot and do free kids builds. We usually go to the park for an hour or two each day. We also track cheap or free events and try to go to one a weekend if we can.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1616,
          "content": "My kids are 10 and 12 and get themselves ready.  But you know what?    I’m still up an hour before hand because I’m the parent.   \n\nIn my opinion, Two hours of screen time is too dang much.  Especially for a kid with adhd.  (I have one as well and our limit is 20 minutes).  I would guess they use screens at school and have already maxed what they should be doing anyway. \n\nYTA, op.   Be a better parent and support your wife.  She’s invested and trying really hard with your kids.",
          "id": 81,
          "comments": [
            {
              "score": 1353,
              "content": "He closes his post with:\n\n>I am an active and engaged parent\n\nYet he thinks his wife helping his kids get ready for school in the morning instead of sleeping in is setting too high of goals?? Sleeping is zero engagement lol",
              "id": 82,
              "comments": [
                {
                  "score": 786,
                  "content": "I have heard some millennial dads say that they are an active and engaged parent, only to find out that what they mean by that is that they are in the same room or in the same house. But not actually that they are helping with care work, domestic work, parenting research and assessing the child's needs. They are simply heroes for not going to golf or hang out with the buddies.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 250,
                      "content": "I ask my friends all the time “what do dads do”.   Their husbands don’t call it babysitting but that’s the only improvement I see from our parents generation.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 235,
                  "content": "Don't forget on weekends he thinks everyone should just chill and stay home all the time.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 358,
                      "content": "\"It is hard to pack up the kids and go have an enriching or fun experience, so why not cut that stress out and just never take them anywhere? Also it is hard to enforce rules so why have 'em? And when your wife asks for help, that, just tell her to relax.\" OP is a lazy jerk who doesn't know he's a lazy jerk.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "This was the most depressing part imo, not the mornings. Kids who go to the zoo, aquarium, and museum grow up to become curious, interested, and engaged adults. They learn about the world and to care about things. When kids just stay home all the time, playing with toys or video games, growing up without any engagement in the world, they grow up to be bored (and boring) and apathetic adults, totally disengaged. They end up like… OP. And the trips also create a bonding experience with their parents. Like, you go to the zoo and your mom picks you up so you can see the tigers better. Little moments like these accumulate into a relationship. OP’s wife sounds like a really good mom.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "“Why can’t the kids just do their homework and watch TV until bedtime?” Yes that’s very active and engaged parenting when you plop them in front of a screen so you can do other things.",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 287,
              "content": "Im not a parent but that was my immediate thought. 2 hours is loads of time for a kid who’s in school. It seems like too much time to me\n\nMaybe I’m biased because I didn’t have screens until my teens (I’m 22) but my parents had a time that we needed to be off the tv at and hiighly encouraged reading/playing outside most of the time. \n\nKids especially shouldn’t have screens up until bedtime as it can seriously affect their sleep",
              "id": 89,
              "comments": [
                {
                  "score": 19,
                  "content": ">2 hours is loads of time for a kid who’s in school. It seems like too much time to me\n\nThat's about as much \"non school related\" screen time I got in the early 2000s, in high school, with NO parental limit put on my screen time (I worked and had extra curriculars).",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 214,
              "content": "Yeah our kids are 9 and 10 and get themselves ready all the way including breakfast if they want it which they don't usually but I'm up with them in case they need anything or just want to talk my ear off about something. \n\nWe cap our kids screen time at about an hour, it's not usually a fight to get them off of screens because it's consistent and we are united. Sometimes we let them go long but all the way to bed time makes it way too hard to get to sleep, they need to wind down.\n\nOverall, OP just seems lazy.",
              "id": 91,
              "comments": [
                {
                  "score": 210,
                  "content": "Yeah, I’m guessing it’s such a fight to cap screen time because he gives into the kids and tells her it’s no big deal if they stay on their screen. \n\nIf you are not united as parents, your kids are not gonna listen to you, they’re gonna play you against each other to get their own way. \n\nOP— try supporting your wife and limiting their screen time. Two hours a day at that age is more than enough and there are about a billion studies proving  that excessive screen time is not good for elementary school age kids. The kids might fight you on it for a week or two but if you stay firm, it will become no big deal and your wife will have way less stress. Also, for the love of God, get up in the morning with them.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": "20 mins is way too strict. I think it’s a bit of fools errand to focus on max time limits either way, but restricting to the minimum possible (one short tv show) is a way to create unhealthy relationships with tv. It’s like sugar or later in life starting to experiment with alcohol. Not a universal rule but generally if you’re taught strict limits you’ll eventually swing hard into indulgence. If you’re raised with healthier relationships to unhealthy things you’re less likely to go off the deep end.",
              "id": 93,
              "comments": [
                {
                  "score": 23,
                  "content": "Can't do anything in that amount of time except like Tik Tok which is probably some of the worst for adhd. I wouldn't even have bothered with it and resented my parents as if I didn't get any. Can't do much in a game in that time. Can't even watch a 30 min slot show as they tend to be 22-23 min even without commercials. Its banning screen time without having to feel like they're banning screen time.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My sister was friends with a girl who grew up in a zero sugar household. Sweetest thing they had were fruit, but even that limited. \n\nEvery time that kid came over, she'd sneak those little sugar packages my mum kept for coffee, but like just as many as she could, eating straight up sugar.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "This. I’m still up. We all get ready simultaneously and stay out of each other’s hair. I’m not a full breakfast spread mom and my kids aren’t huge breakfast eaters. If they’re hungry, they are fully capable of grabbing the many quick breakfast options we have.\n\nYTA OP, your wife is overwhelmed and blatantly asking for your help. Step up.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1536,
          "content": "This is all a great example of OP putting all the mental labor onto wife. It’s up to her to care about, research, and follow best practices generally and for each kid while OP just has personal opinions and preferences that be pits against her informed perspectives. If she “takes a morning off” for herself, he doesn’t pick up the slack, the kids get less care and oversight, it creates more work for her* and she feels guilty, more stressed, and resentment on top. \n\n*Who cleans up after the kids make a mess in the kitchen? Who gets woken up to referee a fight over the bathroom or something(so much worse than waking up intentionally)? Who drops off the lunch or instrument that the kid accidentally forgot? Who has to deal with the heightened restraint collapse from neurodiverse kids who got a crappy start to their day? Who will the kids wake to direct questions to or say “I’m sick” ETC. the default parent, AKA her, unless dad is very intentional about taking all those things on. \n\nWatch how chill she becomes when she has a partner who cares about her mental state more than being right or being inconvenienced. Watch how much she is able to relax when differing parenting styles doesn’t lead to judgement or burnout but better communication and support! He’s asking her to compromise but isn’t willing to compromise himself and isn’t committed to creating a relationship or system that supports her healthy compromise. There may be ways where she can relax her high expectations of herself…as a mom myself I think she probably is getting burnt out and burnout does create rigid thinking because *everything is about to collapse and it’s all up to her all the time*. What what OP is suggesting creates the environment for her burn out and takes zero responsibility for any of it. He has to build trust. \n\nOP—if wife lowers her standards anymore she’d be you. You realize how narcissistic that sounds right? And if they rise even a little more, you’re gonna have to look for an apartment, some daycare options that your divorce attorney says you can afford, and start doing your own research once your genius opinions prove unsustainable. You co-create this family system, which means yes, your wife is responsible for herself and taking care of herself, but you’re accountable for your impact and role in her life and in your home. \n\n-edited to say YTA-",
          "id": 97,
          "comments": [
            {
              "score": 742,
              "content": "This guy’s wife is going to leave him seemingly over dirty dishes and he’ll be shocked and “never saw it coming”.\n\n[She Divorced Me Because I Left Dishes By The Sink](https://www.huffpost.com/entry/she-divorced-me-i-left-dishes-by-the-sink_b_9055288)",
              "id": 98,
              "comments": [
                {
                  "score": 345,
                  "content": "[The Magic Coffee Table](https://youtu.be/-_kXIGvB1uU?si=xrDroFzUxI8tWLy9) is sometimes helpful for denser humans. \n\nI'm holding out hope for OP's wife that he wises up.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 24,
                      "content": "That is such a great skit. Knew what it was going to be before I clicked the link",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "OP needs to read [You Should've Asked aka the Mental Load](https://english.emmaclit.com/2017/05/20/you-shouldve-asked/) too. Sadly, his wife already *IS* asking for help, yet he refuses. Still, it's a great resource.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "u/creative-decision675 \n\nIf you honestly answer all the questions in this post you will also know the answer to whether or not YTA",
              "id": 102,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "This is the answer OP. You need to pick up the slack YOU’RE causing, if you want to get your wife out of a state of ‘overwhelm’. Else kiss your child-free retirement years as a couple goodbye, as she’s going to leave as soon as the kids are old enough.\n\nYTA",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I came here looking to make a comment IDENTICAL to this. As a mom of three -- and primary parent -- thus entire scenario screamed \"mental load\" to me. And it's infuriating that this falls nearly (not entirely, but mostly) to all moms. If we did not do the packing, the planning, the actkvit9, the doctors appointments, the.... all of it.... it simply would not happen.\n\nOP - YTA in the most major way. Seek professional  help with this dilemma to try and see how this is a you issue. Or your wife will continue to stress and resent you.",
              "id": 104,
              "comments": [
                {
                  "score": 21,
                  "content": "Absolutely! The fact that the mom’s only option for taking a day off is letting everything slide and leaving the kids to their own devices made me want to scream/cry. It doesn’t work this way! Your wife definitely resents you, OP.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My heart hurt hearing about how she’s still trying to create joyful connective weekend experiences but is even alone in that. Of course there’s nothing wrong with wanting to chill on the weekends, but that is such an oversimplification. She waits for the weekends to include him because doing it alone is incredibly lonely and doing it together is partnership. It wouldn’t surprise me if it’s also the only opportunity for her to be known and seen by him outside of the house because date nights/couples activities are on her too.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yep. I felt it in my heart. As someone who does the exact same thing for their kids. 😭💙",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Illness wasn’t even a thing I thought about when I was arguing why a parent NEEDS to be awakes and accessible during “going to school time.” \n\nDoes OP (or more likely, his wife) want to get a call an hour into their work day, when they’ve JUST pulled out all the things they need to do their work for the day, saying “come get your kid, they have a fever and starting throwing up”??? That’s even more disruptive than having to call your work and be like “I can’t come in today, my child is very sick.” (Though depending on the age and symptoms, you might be able to leave an older child alone at home while sick—and that’s a thing I would’ve liked to determine BEFORE I’m at work and in the middle of something.)\n\nIf OP was my dad and creating a culture of “don’t wake me! Do it yourself!” I probably wouldn’t wake him up to tell him I feel bad. I also wouldn’t have taken my own temperature at the ages of 8-12.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "\"everything is about to collapse and it’s all up to her all the time\"\n\n&#x200B;\n\nthat is exactly how it feels too!",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This needs to be upvoted.  Spot on",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1055,
          "content": "OP: I'm an engaged and active parent!\n\nAlso OP: I want to sleep in so my 8 year old should be able to get up and ready for school by themselves. Also they can watch TV all day. I also don't want to plan any family activities so that I can lounge around all weekend.",
          "id": 111,
          "comments": [
            {
              "score": 401,
              "content": "OP: my wife's standards are too rigid\n\nOP: doesn't have standards",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "Wife trying to be a good parent\nOP just wants to be good enough",
              "id": 113,
              "comments": [
                {
                  "score": 41,
                  "content": "And yet he’s still failing at that.",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "I think he's more aiming for 'in the same house while the good parenting happens'",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "My 6 (almost 7) year old can get himself up and dressed, grab his own breakfast of greek yogurt, cereal, and a banana, but I am absolutely up with him to make sure he's not screwing around and has enough time to brush his teeth. Just because he could do it on his own does not mean I'm leaving him to fend for himself.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yea!! This was the funniest part of the whole post - he really thinks he’s an engaged and active parent.\nIf it were up to OP the kids would be running around with 1 shoe on, screens all day and never going to school.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 589,
          "content": "I mean, in grade 1 I was getting myself dressed for school, made myself breakfast and packed my lunch/snacks, and walked to school all on my own. And then I'd get myself home from school, make my own dinner, do my homework and get myself to bed. But that's because I had an abusive mother who only had me to get child support. So OP, think about what kind of parent you want to be and adjust accordingly. \n\nYTA.",
          "id": 118,
          "comments": [
            {
              "score": 33,
              "content": "This! I had to do this starting at age 9 because my mom moved out and Dad went to work super early. So… I got ready myself, which meant clothes that didn’t fit and hygiene that could have been better. It is not something I remember fondly.\n\nOP, do better.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 381,
          "content": "Honeslty, thé « if their homework is done, why not let them be on screens u til bedtime » baffled me, especially for the 10 and 8 year old. I agree that there should be more flexibility with the 12 year old, but OP’s overly permissive attitude is bordering on innattentive",
          "id": 120,
          "comments": [
            {
              "score": 257,
              "content": "I would say neglectful and not inattentive. The TV and computer are not supposed to be babysitters.",
              "id": 121,
              "comments": [
                {
                  "score": 18,
                  "content": "Yeah I was raised that way and now my parents complain that I never talk to them… from my point of view it’s the same relationship I had with them as a kid, it seems normal to me",
                  "id": 122,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Same. I always thought it was normal to barely interact with my parents during the week. Apparently, parenting is supposed to be more than just feeding and providing transportation. Who knew.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 326,
          "content": "Just want to add that 2 hours of screen time a day is completely fair and not strict at all. OP should be happy his wife cares. So many parents don't give a shit and we have a generation of children who have no attention spans at the very minimum. \n\nYTA OP.",
          "id": 124,
          "comments": [
            {
              "score": 7,
              "content": "OP’s wife sounds like a wonderful mum that really cares about her children. She’s doing all the tough work, having to be the one to say no and set limits. She’s building the framework so the kids live full healthy lives and grow up to be well adjusted. Not sure what OP is doing….",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 283,
          "content": "I’m gonna be real blunt: a child with ADHD needs support and supervision to get out the door in the morning with everything they need for school (and will suffer unduly more than your other kids if they don’t have everything they need).  I have a 15 year old who can do some of those things for himself, but still needs support because his meds have not kicked in by the time he’s out the door. \n\nI agree that maybe your wife might feel better if she was more flexible and relaxed about weekend activities. But also the kids might not fight the screen time rules as much if you acted like a teammate and backed her up on her standards. However, most importantly, it sounds like she’s crying out for more social support overall. Are you making sure that she has some real time for rest and breaks? She might benefit from a therapist who might help her be less tense over enforcing her totally reasonable parenting standards (the standards are separable from her anxiety & exhaustion over those standards).\n\nYTA here, but don’t feel guilty. You have a huge opportunity to make this a less shitty situation for your whole family. Stand behind your spouse, help her get a break and some support and do what is needed to help your disabled child. There’s a lot of small stuff you can do better.",
          "id": 126,
          "comments": [
            {
              "score": 35,
              "content": "I'm an adult and i still find it easier to get myself out the door when my partner is home. Not that he needs to like get me ready and out the door like a child, but just having another human present and witnessing me is enough to make my brain go \"oh yeah, I'm doing [task]\"",
              "id": 127,
              "comments": [
                {
                  "score": 36,
                  "content": "That strategy is called “body-doubling” and it’s a legit approach to helping people with executive dysfunction! 👌",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "I was prepared to be on his side, but it seems that she has healthy expectations and deserves a little help here.",
          "id": 129,
          "comments": [
            {
              "score": 40,
              "content": "wives and mothers don't need \"help\", children help, they need a partner who is an active member of the household. If this is his attitude towards his kids, I can't imagine he does any domestic or mental labour because I'm sure \"she has too high of standards\" there too. God, heterosexual marriages dynamics like this are the leading cause of dead-bedroom and divorce, like sorry men, being another dependent isn't sexy.",
              "id": 130,
              "comments": [
                {
                  "score": 30,
                  "content": ">God, heterosexual marriages dynamics like this are the leading cause of dead-bedroom and divorce, \n\nBut it's *always* blamed on the woman for not \"putting out\" 🙄\n\n>like sorry men, being another dependent isn't sexy.\n\n100%",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Same. I was ready to defend him until he described a woman with very reasonable parenting goals lmao.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Same here.  He teed it up that she had “high expectations” and I was ready for a monster.  LOL",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Right?! I stress myself the fuck out with regards to our kid because I spiral into trying to make things \"perfect\", like all the themed decor, food, cake, gifts, and matching outfits for a birthday or excessively detailed packing lists and itineraries for vacations, school bake sale submissions etc. My husband will eventually check in on whether the emotional \"return on investment\" is going pay out. \n\nThat's what I thought this was going to be, and the wife freaked out. But no, totally reasonable parenting  and a lazy ass husband.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "wives and mothers don't need \"help\", children help, they need a partner who is an active member of the household. If this is his attitude towards his kids, I can't imagine he does any domestic or mental labour because I'm sure \"she has too high of standards\" there too. God, heterosexual marriages dynamics like this are the leading cause of dead-bedroom and divorce, like sorry men, being another dependent isn't sexy.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Yeah, I don't see her standards as being particularly unreasonable. Obviously if it's overwhelming her, then she should adjust them, but if the only reason why they're overwhelming her is that OP won't help them meet this standard, then yeah, he's totally TA.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18765,
      "content": "*I'm an engaged and active parent..*\n\nYou don’t sound like it. There are things a parent has to do for children in the mornings- your youngest is eight. Cereal is nothing but sugar, a lot of moms don’t want their kids to eat that every day. Two hours of screen time is generous, not strict. You sound rather checked out.    YTA",
      "id": 137,
      "comments": [
        {
          "score": 2734,
          "content": "My sister and I were not allowed any screen time on school nights (that is, Sunday to Thursday) during the school year.  And we were pretty limited the rest of the time as well.  2 hours is super generous.",
          "id": 138,
          "comments": [
            {
              "score": 885,
              "content": "This gave me flashbacks to our rules growing up. We were allowed 30 minutes of “fun” screen time on school nights and an extra 30 minutes if it was “educational”. We only had cd-rom computer games, Nintendo 64, and basic cable. I would spend a half hour playing some kind of JumpStart computer game then watch TV, whereas one of my brothers would watch Kratts’ Creatures then play Nintendo lol",
              "id": 139,
              "comments": [
                {
                  "score": 701,
                  "content": "[deleted]",
                  "id": 140,
                  "comments": [
                    {
                      "score": 117,
                      "content": "This - it's not enough time to really get started onto something. \n\nMy kid tends to self-limit at about an hour, which seems fine to me if it's not every day. I give him permission to start about an hour before a meal or snack, and then he starts wanting the snack about stop-time.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "My sister and I on weekdays and weekends had to “buy” fun computer time with doing a learn to type program. 15 minutes of typing bought you 1/2 hour of computer time",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "I got one hour max on school nights until I was about 13; then the rules got eased off (especially when I got a hand-me-down computer in my room) but I still had to shut off the computer by 9 at the latest.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This should go child by child. I didn't have any strict screen time limits, and was better for it. But I also played outside without being asked, biked to friends' houses, read all the time (I still remember getting my own library card decades later. That *much* reading.), etc. Screen time is fine as long as your child is doing other stuff too.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1770,
          "content": "Plus it sounds like you are undermining your wife in front of your kids. Reading between the lines, it sounds like you allow them unlimited screen time when they ask you, which means that when she says no, two hours only, they fight her. \n\nNo wonder she exhausted and frustrated if she having the same argument over and over with them when you sound like you are undermining her at every turn. \n\nIf she’s planned an outing for the family and you go in and blame her for when the littlest gets tired and ask why she even bothered. \n\nI bet if you provided a united front and enforced the (very reasonable rules) together, then she would feel less overwhelmed and exhausted. \n\nYou are making it harder for her.",
          "id": 145,
          "comments": [
            {
              "score": 883,
              "content": "I’m not sure what’s OP’s definition of “engaged and active parent”. He’s the cool dad who lets his kids do anything they want, as long as he doesn’t have to do much. It sounds like he never helps his wife making plans for the weekend and just criticises her. He undermines her parenting by openly disagreeing with her on topics like screen time and family outings, she has to pick up the slack and of course ends up overwhelmed, which he kind of makes fun of.\n\nYTA OP",
              "id": 146,
              "comments": [
                {
                  "score": 527,
                  "content": ">It sounds like he never helps his wife making plans for the weekend \n\nMy friend was literally considering divorcing her husband for this exact thing.  Of course it's never that it's just the one thing - it's because this is a symptom of just general lazy and unengaged parenting.  \"The kids only like playing video games, why should I make them leave the house and go to the zoo/aquarium/park/etc. when it's easier for me to just let them sit in front of the screen?\" Uh, because part of parenting is forcing you kids out of their comfort zones and teaching them about the world around them. \n\nOP sounds insufferable and like a terrible co-parent.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 253,
                      "content": "More and more women are opting for single parenthood over these types of unequal and damaging dynamics. I’m pleasantly surprised at the top comments being YTA because even ten years ago I feel it would have been different. \n\nThe pandemic really brought domestic labor into our field of public vision and we can finally talk about it.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yep, I grew up with an a dad that prided himself on being “active and engaged”, recently I realized all he ever did was show up to my sporting events (that he had to drive me to). Other than that, he bought me gaming consoles which is what I spent literally 100% of my free time doing",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "puzzled fretful late treatment marvelous sense snatch direful alleged elderly\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 150,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "OP's definition is probably, I do some activities with my kids, and like, talk to them.",
                  "id": 151,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "There is strong evidence that the more time they spend on screens, the harder they fight when you try to get them off them too.\n\nEvery parent I know can say this anecdotally. Screens before bed are a nightmare. The kids have meltdowns when you try to get them off screens when they’ve spent too much time on them.\n\nI’ve also seen teachers comment here that they can tell at school which kids have too much screen time at home - their behaviour is worse and their concentration poor.\n\nThere’s a slew of negative physical and mental health issues associated with too much screen time. \n\nOP is a lazy, uncaring parent if he just wants to let his kids be on their screens all afternoon until bedtime.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 667,
          "content": "It sounds like he wants to do what’s easy, not what’s healthy.",
          "id": 153,
          "comments": [
            {
              "score": 114,
              "content": "He treats them like mini adults",
              "id": 154,
              "comments": [
                {
                  "score": 247,
                  "content": "He treats his children like roommates.",
                  "id": 155,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I got to the end and literally said out loud \"so....  you're lazy.\"",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 597,
          "content": "\"I am an engaged and active parent\"\n\n\"I just want the kids to stay home all the time and distract themselves with electronics\"\n\nhmmmm\n\nSure getting up at 6:45 is a lil extra and maybe she could give the kids a few more responsibilities than they have, but I think only eating sugar for breakfast is not super healthy and it's really awesome of her that she wants to cook in the mornings. OP should help with that. Lots of kids ARE raised on cereal -- and okay, so was I, I don't blame any parent for doing that. But if you don't HAVE to, maybe you shouldn't.\n\nEdit: I agree “extra” is a bit of a loaded term and doesn’t actually apply here, I only meant to say “even if you give this guy the absolute maximum benefit of the doubt possible, he’s still being a lazy parent”",
          "id": 157,
          "comments": [
            {
              "score": 437,
              "content": "6:45 is completely normal, honestly a little late, if you're an adult with an 8/9-5 job and kids, what the actual hell\n\nEdit to add, since everyone else is sharing *their* morning routines: I'm a single person with no children and an 8 o'clock start time at work. 7:45 if I'm opening the office that week. I wake up at 5:45 so I have time to:  make coffee/eat breakfast, feed the dog, make my bed, clean up my dishes from breakfast, make my lunch, and then by 6:45 I have to start putting on makeup and getting dressed. If I don't leave my house by 7:25, I'll be caught in morning school traffic and get to work barely on time, which isn't the way I like to start my mornings, especially when I'm seeing my first patient at 8:05. I also have ADHD and time blindness is something I STRUGGLE with. I've found it much healthier for me to sacrifice a little bit of sleep so that my morning is 75% less chaotic and I'm in a good mood once I get to work. It doesn't work for everyone and I'm glad/jealous that a lot of you commenting can sleep in and get to work on time!!! I just can't imagine under my circumstances being able to do that, let alone *with children!??* But some of y'all are superheroes and I applaud you!!!",
              "id": 158,
              "comments": [
                {
                  "score": 73,
                  "content": "I get up at 7 for my 8-5 job. I have plenty of time to get ready though, even with making sure my youngest (13) is ready for her bus by 7:45am.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Do you work from home?",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "People have commutes.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "1 at 13 =/= 3 between 9 and 13, not by a long shot, a veeery long shot…",
                      "id": 162,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "Right?  Unless he works late, with three kids, that's when he should be getting up anyway.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 324,
              "content": "645wake up with a 745 bus pickup is not extra when you have 3 kids to make sure they are dressed, fed properly and not forgetting anything.",
              "id": 164,
              "comments": [
                {
                  "score": 184,
                  "content": "No that’s actually insanely impressive because also she is doing it alone bc OP is sleeping the whole time",
                  "id": 165,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Yeah this woman sounds like a machine tbh",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Especially when his wife is only suggesting he take over some days.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It’s more than not extra, it’s goddamn god like, 1 hour to cook, feed and prep 3 kids?  I couldn’t do that, not without serious night prep , which she probably does as it sounds like mom is really working to plan everything out while lazy dad trope sleeps and fails to support her in any meaningful way.  No wonder she’s irritated all the time.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "> getting up at 6:45 is a lil extra\n\nThat's about 45 minutes to get three kids ready and out the door. Not sure how that's 'extra'.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "Cereal is a healthy breakfast if you buy the right cereals (i admit this may be different in America than the uk). It's more than enough, why wear yourself out cooking breakfasts with all the clear up after? \n\nBut a parent has to be up. Not only because of the 8yo and 10yo, but to supervise and care. I do mornings for my child who is 11 now, and the routine for years has been get up, get dressed, here's your breakfast, I have a shower, get ready, then he can brush his teeth whilst I prepare packed lunch. At least he is old enough to walk to school with a friend now, although I will walk with him if the friend has a club. Then it's 9 hours of work (from home) but I will go out to collect him from school just to get exercise,which extends the work. I often do dinner too, which also extends the work. \n\nI have lie in days, at the weekend. I'm a night owl so the above routine is painful for me but I do it. \n\nWhat I don't do very well is cleaning (where to fit it in!) and mental load for stuff at home (work is a big mental load, and I can't do everything). A list of tasks helps greatly.",
              "id": 170,
              "comments": [
                {
                  "score": 37,
                  "content": "> i admit this may be different in America than the uk\n\nIt isn't. Cereal can be healthy, just got to pick the right ones.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That’s when I get up for my job at 8:30. Gives me a sec to wake up, pack lunch, maybe eat if I’m hungry, get dressed and then get to work. If I also had to get kids ready I could not make that work super easy",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 156,
          "content": "Agree. OP, do you want to read this post by your children in a few years?\n\nhttps://reddit.com/r/emotionalneglect/s/bC8lxDSMpc",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Dude sounds like every guy, who claims that they’re doing “like, SO much at home” and how their wives or girlfriends basically stress too much and overwhelm themselves, but the reality is that the guy coasts on the shirttails of the woman in the household running everything and carrying the mental load for everything. It’s easy to be “chilled and relaxed guy” if you don’t have to do any of this stuff. \n\nFor the record - 8-12 is still the age where you should try to influence what and how your kids eat, eg breakfast on school mornings, because teenage bodies burn calories like crazy and you don’t want your kids to think they can just eat sugar and empty carbs and never worry about the calories vs nutritious food. Kids are also horribly addicted to screens these days, so 2 hours a day is actually quite a bit, especially if they use computers or phones during school time too. ADHD already has attention span issues coded into it, so to add 2 hours a day is just bad in overall. \n\nDude is the guy who thinks fatherhood is super easy because he doesn’t have to actually do anything.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13473,
      "content": ">I'm an engaged and active parent\n\nDoes anybody but you think this?\n\nYTA. Breakfast, a screen time limit and weekend activities are absolutely normal standards.",
      "id": 175,
      "comments": [
        {
          "score": 3552,
          "content": "his idea of being an engaged parent is to provide them with money so they don't starve.",
          "id": 176,
          "comments": [
            {
              "score": 2028,
              "content": "And to make sure there's wifi and a box of cereal.",
              "id": 177,
              "comments": [
                {
                  "score": 1671,
                  "content": "Make sure there's a wife* and a box of cereal\n\n*to actually do everything",
                  "id": 178,
                  "comments": [
                    {
                      "score": 162,
                      "content": "Facts!",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "This is why so many women who are unsure about being a parent say: ‘if I could be a dad I’d be keen to have kids’. \n\nThere are many fantastic, super involved dads. I know dads who are the primary carers and they are wonderful parents.\n\nBut there are still way too many lazy husbands and dads that do sweet FA. The stats back that they are the majority. It’s just not good enough.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "WHYYYYYY DID YOU TAKE AWAY AWARD, REDDIT? WHYYYYYY???\n\nHere, take my counterfeit Gold: \n\n🎖️",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "...make sure there's money for a box of cereal*. You know he doesn't do the grocery shopping.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 770,
              "content": "Seriously. OP sounds like one of those \"dads\" who call spending time with their kids \"babysitting\" and any time doing housework \"helping my wife\".",
              "id": 183,
              "comments": [
                {
                  "score": 783,
                  "content": "He literally says \"I'm happy to help\" in the beginning of the post 🤦 like no, parenting your children and doing what needs to be done around the house are not favours you do to your wife, it's your responsibility as a father",
                  "id": 184,
                  "comments": [
                    {
                      "score": 394,
                      "content": "Also then clearly demonstrates he’s not willing to “help.”",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "And if you can't do all that then you're not really a father.",
                      "id": 186,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 112,
              "content": "He sounds like my dad. He’d slap some money on the table for food and then disappear to another city for like 3 days",
              "id": 187,
              "comments": [
                {
                  "score": 16,
                  "content": "So how many half siblings have you found on 23AndMe?",
                  "id": 188,
                  "comments": [
                    {
                      "score": 7,
                      "content": "None that I know of, but I would not be surprised in the slightest if one or more pop up as I get older.",
                      "id": 189,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Or sitting on the couch watching TV at the same time as them on the weekend.  That's all that's required for being a good parent right?  Watching TV at the same time?",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Yeah now he has made the kids he don't want to take any responsibility.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Nah it is probably just sitting down on the couch watching some random tv show whilst they are glued to something on an ipad. And his excuse will probably be \"we are having bonding time\" but it is just two people in the same room together and thats it.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Come on, he probably knows the names of at least two out of three!",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 511,
          "content": "Right? Like waking up an hour before the kids have to be on the bus is too high of a standard? Geez. And 6:45 isn’t an insane wake-up time either. I know some parents who wake up at like 5 to make breakfast and pack lunch for their families.",
          "id": 194,
          "comments": [
            {
              "score": 145,
              "content": "We have zero kids and wake up at 5am so we can exercise our dogs and prepare for our work day.  Is 6:45 early to most normies? Cause I’m with you on that one, it’s not an insane wake up time",
              "id": 195,
              "comments": [
                {
                  "score": 21,
                  "content": "I'm obviously prepared to have to change if I'm ever able to afford children, but I'm not usually up until between 7:30 and 8 depending on when my first meeting is. On the weekends it's 10 or 11. I have the displeasure of being one of those people whose body can't get by on 8 hours for too long consecutively; I have to plan for 10, so if I had to get up at 5 I would have to be in bed by 7 PM, when I might not have even gotten out of work yet and certainly have not managed to cook yet.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Oof. Same. I need at minimum 9 hours to function. No, I cannot get up at 6:45am. That's when my body thinks it's prime sleep time. 9am is the ass crack of dawn to me.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "No kids here and yes, it is extremely early for me.  Some people are night owls, it is literally in our blood. (Certain DNA markers can tell you if you’re more prone to be a night owl vs. early riser.) But again, no kids.  OP, YTA.",
                  "id": 198,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "Yes! My 12 year old has to be at school at 6:45am for show choir practice. And this guy thinks that's too early to wake up as an adult on a weekday?",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yes! Even if the kids managed to get themselves healthy breakfast, it's pretty cold to let them go through all morning every morning with no adult interaction just so daddy can sleep in.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It's difficult if you stay up too late gaming or watching tv the night before.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 460,
          "content": "He’s one of those dads that says “I’m super involved.   I do anything my wife asks to do.   If I’m not busy, that is,”",
          "id": 202,
          "comments": [
            {
              "score": 287,
              "content": "And disappear for 30 minutes to go \"poop\" in the bathroom when she needs help the most.",
              "id": 203,
              "comments": [
                {
                  "score": 145,
                  "content": "[deleted]",
                  "id": 204,
                  "comments": [
                    {
                      "score": 22,
                      "content": "And all he does is move things around, or find a different way to organize the tools (that were already organized), or put everything loose that creates clutter into \"temporary\" boxes that will never be opened.",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 282,
          "content": "Its cliche, but \"breakfast is the most important meal of the day\" for some ADHD issues.  Recommendations for ADHD diet are often high protein, low sugar (OK, what isn't these days) and just a bowl of sugary cereal could impact the kiddo's school work in the morning.",
          "id": 206,
          "comments": [
            {
              "score": 141,
              "content": "Even for the kids without ADHD, now that I understand that cereal is basically a big bowl of sugar…I wouldn’t be giving them that.  Yeah, I used to eat it as a kid, that doesn’t make it okay.  I know better now.  I have dippy eggs.  Or peanut butter toast with fruit.  And some yogurt always.  Doesn’t take long to make, much healthier than a bowl of processed sugae,",
              "id": 207,
              "comments": [
                {
                  "score": 32,
                  "content": "Yeah, younger kids are starving by mid-morning if they don't have some protein at breakfast, because their stomachs aren't very big. And then teenagers are starving by mid-morning if they don't have protein at breakfast because they are actually black holes in a human body designed to suck down your entire grocery budget and then announce, \"I'm still hungry.\"",
                  "id": 208,
                  "comments": [
                    {
                      "score": 19,
                      "content": "15 year old will eat a full breakfast with a protein shake and still grab a granola bar and a Gatorade for his mid morning study hall. And then come home and tell me what he sucked down for lunch and then declare “when’s dinner?”",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Everyone needs to food, and cereal isn't the right way to start the day.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Every morning, my daughter has hummus on wheat toast or peanut butter on wheat toast (once in a while she wants Cheerios). She then  has options of yogurt, banana, apple, or applesauce pouch, and she can have either milk or apple juice. She's 6 and she's basically been having this kind of breakfast since she was at least 2-3 years old. I've offered some deviations (different cereals, waffles, etc) but she likes her healthy breakfast and I'm not going out of my way to discourage that. When she chooses hummus toast over chocolate chip waffles, I don't question it lol.\n\nI don't have the time or energy to make a fancy breakfast. If she wants nice breakfast foods like homemade pancakes, eggs, hash browns, etc. we have breakfast for dinner. I looooove breakfast foods, I'm just not a morning person.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "My son has ADHD and forgets to eat sometimes. He gets served breakfast at school but the school bus barely gets there in time so I have to make sure he eats before he gets on the bus.",
              "id": 212,
              "comments": [
                {
                  "score": 39,
                  "content": "Hi random internet stranger. I work in a school and our cafeteria ladies bag up breakfasts for kids who get there later than normal breakfast time. Even if your school doesn’t normally do this I bet they’d be willing to arrange something for your kiddo. I’ve never met a lunch lady who wanted a kid to go hungry.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I don’t mind making him breakfast, he’s turning 14 in two weeks and soon enough he will be “too cool” to hang out with mom and dad….",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "I take medication for my adhd and if I don't eat breakfast they just don't work as well. I also regularly forget to eat and, at the age of 30, still have to be gently reminded by my partner.\n\nEven if the 10 year old is overpowering any executive function issues, there's always that one day where symptoms aren't as manageable or you're burnt out or you didn't quite sleep enough and every coping mechanism falls down. And having their mum there to remind them to eat will mean the world to them!",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Well if you can't give proper meal to your kids then you shouldn't be parents.",
              "id": 216,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Plus ADHD meds can suppress appetite - my son tends not to want to eat much for lunch because of his medication so I try and make sure that he has a proper breakfast so that he’s fuelled up for the school day.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "An engaged and active parent but, “why do we have to go out and do things? Let’s just stay home” rather than take over for her and plan every other outing or something. \n\n“Why not let them just have screen time all day long and have such strict boundaries?” Idk ab anyone else but 2hrs is a generous amount of daily screen time.",
          "id": 218,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "I only allow my kids an hour of screen time a day during the week. By the time they do homework, eat dinner, bathe, there really isn’t even that much time before bedtime. 2 hours seems very generous to me. \n\nHe just wants to be lazy",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah and these things should be done by every parent out there.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11916,
      "content": "This is how this reads: \"My wife is a hands-on, active parent who wants our children to have well-balanced meals, minimal screen time, and fun and stimulating outings and that's too much work for me, I'd prefer my kids eat whatever they can find in the kitchen without bothering me, that we stay home and do nothing and the kids play on their devices and watch TV in their spare time\". No wonder she's stressed. She sounds like a great parent, and you come off sounding lazy and disinterested in parenting your own kids.  YTA.",
      "id": 221,
      "comments": [
        {
          "score": 2843,
          "content": "He wants his children to be playing on their devices so that he can do the same thing too.",
          "id": 222,
          "comments": [
            {
              "score": 1499,
              "content": "I’d imagine he’s addicted to screens if he thinks *two hours* of daily screen time is “rigid” for 8-12yos.",
              "id": 223,
              "comments": [
                {
                  "score": 334,
                  "content": "Especially if they're playing videogames. That's about the amount of time it would take for my brother and I to get mad at each other and start fighting in real life at that age.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I honestly think OP is where his son got the ADHD, even if he doesn't realize it.",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I wonder if he even has a job or not, doesn't sound like that.",
                  "id": 226,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "I never realized 2 hours was a lot, when I was 8-12 I was getting like 6+ hours on weekdays and 12+ hours on weekends",
                  "id": 227,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Same. I have fond memories of staying up all night playing video games during summer break.",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "2h really depends on what they're doing on that screen.\n\nI did digital art as a kid bc my family was too broke for proper art tools, and 2h is nowhere near enough time if you want to be productive.\n\nTho OPs wife sounds like the type to set everything in motion to make sure the kids have decent art tools if they'd be into it and judging by all the activities she does with the kids they also seem to have the finances to do so too.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 108,
              "content": "His wife and kids are gonna be better than him.",
              "id": 230,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "He wants the kids to have unlimited access to these devices so he doesn’t need to “entertain“ them. In other words, he doesn’t wanna do the work parenting.",
              "id": 231,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 657,
          "content": "[deleted]",
          "id": 232,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 490,
          "content": "OP doesn’t realise it’s him that’s stressing her out, not the kids",
          "id": 233,
          "comments": [
            {
              "score": 144,
              "content": "Exactly, she’s doing this whole thing by herself and having to tell her own partner to parent their kids, this is the situation for millions of women",
              "id": 234,
              "comments": [
                {
                  "score": 48,
                  "content": "To any woman reading this I hope you know you deserve better, you deserve a true partner, and the sooner you are able to leave the sooner you can hopefully find that! It is hard, not everyone can do it on the same timeline, but it can be done, and you are worth it.",
                  "id": 235,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Plus being undermined by her partner. Remember he doesn’t “support” her screen time limit. Sounds like when she tells them no, they go to dad and he gives in. Parenting has to be a united front, kids are manipulative. Some more than others.",
                  "id": 236,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah the dad is often the “fun parent” that the kids turn to when the mom says no. I can recall this from my own childhood when I was too young to understand.",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "In addition to three kids she also has to raise a baby",
              "id": 238,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Inb4 his next AITAH post “AITAH for divorcing my wife because she won’t have sex with me anymore?”\n\nThis woman is a married single mother",
              "id": 239,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "Probably 80% of her \"stress\" is actually just emotional distress from feeling abandoned, disregarded, unappreciated, and used by her husband. If she were single, I bet she could do all the same things for her kids and totally rock it with an upbeat attitude, because she wouldn't be weighed down by the constant disappointment and grief.\n\nIt must be eating away at her self-esteem, too, having to listen to him minimize everything she does all the time and tell her her efforts are worthless.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yep. Meanwhile with any hope she’s online seeing all the reels by people in her situation who got out and are enjoying single parenthood without another child to take care of. OP is in for a rude shock. Then it will be ‘my wife left me for no reason, it’s bullshit’.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "This!!!.. God I feel for her… sounds like she has 4 children to take care of!",
          "id": 242,
          "comments": [
            {
              "score": 9,
              "content": "Pretty sure that's how she sees it as well lol, and that's not good.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "That’s how I read it too!",
          "id": 244,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "All of those things she insists on create TIME. Time for you to learn about your kids and who they are growing into, time to find out what's going wrong at school or with friends, or what's going right, time for them to talk to you about things they are interested and excited about.\n\nThis guy is missing out",
          "id": 245,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3920,
      "content": "YTA , help her out. Kids require a lot of work that you signed up for when you decided to have kids. Her “high standards “ are literally bare minimum. Every morning she is setting them up for success with no help from you which is why she’s so overwhelmed. Getting three kids ready in the mornings and making sure they are well fed before sending them off to school is such a blessing. The screen time is so reasonable and good that she is encouraging them to be outside and have more of a child hood. Sounds like you want them to be tablet kids to get them off your back a little more. Give her a thank you and some appreciation because she is picking up your slack. Treat her more for doing so much & become a better parent and partner before its too late",
      "id": 246,
      "comments": [
        {
          "score": 8,
          "content": "Yes but it’s not helping out, it’s doing you part as a co-parent. ‘Helping out’ suggests he is kindly aiding her with her responsibilities, whereas what he should be doing his actually doing his responsibilities.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2745,
      "content": "YTA. Your wife is essentially trying to enact boundaries and maintain a routine for 3 kids, while you are not backing her up. It has to be monumentally frustrating for her to manage 3 middle/elementary school age kids on her own. A lot of that stress is probably because she IS asking you to help, and because you don't see why you should have to do these things, then she's stuck organizing and corralling the kids by herself. \n\nShe probably wants to take the kids to the museum because it's fun for the kids, and you're doing that non-committal \"I don't see why we have to do this so I don't want to do it\" so then it's all about YOU and not about the kids at all. It's majorly invalidating her feelings and her position as a parent.\n\nWhat are you doing right now, in terms of helping the kids, that makes you an active and engaged parent? While I read this post, I could just see the situation in my head - your wife doing all the work, and then when the kids complain, letting her be the bad cop all the time while you sit on the couch and say \"it's fine, honey! just let them do it\" and she probably wants to go in the next room and cry. Major YTA.",
      "id": 248,
      "comments": [
        {
          "score": 231,
          "content": "Yeah, that’s pretty much the conclusion I came to as well.",
          "id": 249,
          "comments": [
            {
              "score": 9,
              "content": "That's good conclusion and I can understand what you're saying.",
              "id": 250,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Ugh this guy sounds EXACTLY like my own father, who has the \"ehh they'll figure it out\" view on parenting. My mom was a bit more overbearing than this mom, and we fought A LOT, but if it was just him, I'd either be dead or knocked up. \nOP:  ENGAGE with your kids. SHOW that you actually give a shit about their wellbeing and success.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Completely agree, the one thing you didn’t mention is the mental burden on OPs wife having to plan and organise everything and everyone. I imagine that she has to organise and keep track of lunches, clothing, medical needs, who needs to be where and when for extra curricular activities and appointments, not to Manitoba planning family activities and getting everyone ready, while op is ‘active and engaged’ by driving and attending some of the activities. \n\nIt is exhausting being an unsupported parent. Being active and engaged means you take some of that burden, not tell your wife to care less. Do better OP.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Their mom is setting them up to have healthy eating habits and not be unsocial phone freaks and he thinks she’s the problem.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": ">Your wife is essentially trying to enact boundaries and maintain a routine for 3 kids, while you are not backing her up\n\nnot only is he not backing her up, he's fighting against it. She's literally having to fight against all 4 of them to keep things in order. Even if he doesn't agree with her approach, unless it's something hugely problematic he should be supporting her in front of the kids and having a conversation with her about possible changes that they can agree on.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "You are pointing out a very important thing. Not only is she not getting support from her spouse, but he is telling her that she is overdoing it, trying to invalidate her VERY valid concerns with proper routine and healthy meals for their growing children. Can't imagine how much stress that actually adds to her plate. No wonder poor woman feels overwhelmed. OP YTA",
          "id": 255,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1945,
      "content": "YTA\n\nWhat exactly is your definition of an \"engaged parent\"? Because what I'm seeing here is you think it's unreasonable to cook elementary and middle school aged children a decent breakfast and spend time with them so they don't rot their brain with phones and iPads.",
      "id": 256,
      "comments": [
        {
          "score": 588,
          "content": "He probably is busy gaming when he isn't sleeping, or complaining about how his wife is bothering him.",
          "id": 257,
          "comments": [
            {
              "score": 354,
              "content": "Agree, I’m curious about what chores he “helps” with. He probably thinks his wife has very high cleaning standards as well and that they could clean even less and that would be ok too.",
              "id": 258,
              "comments": [
                {
                  "score": 182,
                  "content": "There was a post on here just like that not long ago. It was something like, “my wife has unreasonable cleaning standards. She takes the trash out when it’s full, when it’s fine to let it sit if nothing is rotting. She also cleans the bathroom weekly, and washes the sheets biweekly. Her standards are completely insane!” Thankfully, everyone pointed out that the way she did things was normal.",
                  "id": 259,
                  "comments": [
                    {
                      "score": 48,
                      "content": "I get that from my husband and kids when I get pissed that I cleaned the kitchen before going to bed and then come down to a mess to clean in the morning. I just want to get up and have a cup of coffee or tea and have the house be clean and restful at the start of the day and I can’t even get that. I shouldn’t clean at 10 pm and then have a new mess to clean at 8 am before I start work.",
                      "id": 260,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "There are those kinds of people are here? Well that's not good.",
                      "id": 261,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": "Be realistic. He calls it \"nagging.\"",
              "id": 262,
              "comments": [
                {
                  "score": 9,
                  "content": "Yeah that would really being realistic about it honestly.",
                  "id": 263,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "He took the time to list everything the wife does he finds unreasonable but didn’t list a single thing that shows him to be an engaged parent.",
          "id": 264,
          "comments": [
            {
              "score": 8,
              "content": "Don’t you realise that he can just say he’s an engaged and active parent and that makes it true?",
              "id": 265,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "He just wants to keep the money on the table, that's it for him.",
          "id": 266,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1643,
      "content": "Trust me, your wife is already making one huge concession in her expectations by putting up with your lazy ass. YTA. Get to work or it won’t be long before your wife realizes how pointless you are and decides to cut you loose.",
      "id": 267,
      "comments": [
        {
          "score": 335,
          "content": "Indeed. It's hard on the wife, when she's the only adult in the household.",
          "id": 268,
          "comments": [
            {
              "score": 28,
              "content": "Yeah OP is wrong his wife has 4 kids 🤦🏻‍♀️",
              "id": 269,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yeah I can't even imagine all the stress she must have got.",
              "id": 270,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "And if she does cut him loose, and he has visitation days, he’s gonna fold like yesterday’s newspaper. OR, he’ll dump them on his mommy, as do soooooo many of these so-called ‘active and engaged’ sperm donors. She has *4* children currently. So sad.",
          "id": 271,
          "comments": [
            {
              "score": 57,
              "content": "He'll be the \"fun weekend dad,\" by which I mean they'll go to his house, pig out on junk food, and watch crap for two days straight.",
              "id": 272,
              "comments": [
                {
                  "score": 33,
                  "content": "He’ll by the fun “every other weekend” dad. No way he will give up every weekend to parenting.",
                  "id": 273,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "While he plays video games and ignores them.",
                  "id": 274,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It really is sad, and this is the thing which I hate the most about it.",
              "id": 275,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I know plenty of women who realized they were doing everything alone anyway and decided to loose the guy and they were better off after.",
          "id": 276,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I can’t help but wonder how much the wife could relax her rules if she had a fully engaged and supportive partner helping to hold things together",
          "id": 277,
          "comments": [
            {
              "score": 16,
              "content": "Her methods are probably on their own reactive to his lack of contribution. It isn’t so important to keep on top of things if you know another adult isn’t actively sabotaging you all the time.",
              "id": 278,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "100%, one day she’ll wake up and realise it’s easier just to parent on her own and leave, and OP will be wondering what happened because he seems to lack any self-awareness.",
          "id": 279,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I hope she does dump his ass. She will have a much lighter load to bear. And the kiddos with ADHD will prob cope better too.",
          "id": 280,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1082,
      "content": "YTA I was expecting some wako/Marie Kondo request but making breakfast for the kids, limit 2 hours of screen time a day and do some family activity… I am wondering what is at this point your concept of engaged parent? ‘Here you go watch your tablet’?",
      "id": 281,
      "comments": [
        {
          "score": 308,
          "content": "Yeah literally! She’s tired because she’s doing the work of 2 parents while having her husband make her feel guilty. Typical ‘I didn’t even know she was unhappy’ when she snaps and wants a divorce.",
          "id": 282,
          "comments": [
            {
              "score": 49,
              "content": "Most women (that I know personally and other anecdotal stories I’ve heard) in this kind of situation find their lives are WAY less stressful after divorcing an unhelpful partner like this, even if they have full custody, because the mental load that was dedicated to fighting their partner is gone and the kids are less confused and stressed from getting 2 different sets of conflicting standards everyday. And if they have joint custody, then they actually have FULL DAYS to mentally relax, which is clearly not happing for OPs wife now. Just from this post I get the feeling he’s on pretty thin ice and has no clue.",
              "id": 283,
              "comments": [
                {
                  "score": 33,
                  "content": "Yep, that's been the experience of the women I know.\n\nIt's also easier to keep a clean house without another adult just wondering around, making messes he doesn't \"see\". And it turns out to be cheaper because money doesn't disappear from the bank account because he decided to get something cool for himself.",
                  "id": 284,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Posts like this make me scared to have a family with a man someday 😵‍💫 I hope my bf will be a better father than OP",
                      "id": 285,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Totally reasonable stuff. OP forgot to complain about how the mom is so crazy she has to make sure the kids clothes are clean and bedding is changed, and on top of that she does the dishes when she could just leave them in the sink for a few days. \n\nI think we all know at least one marriage that failed or is failing because of this kind of attitude where one parent sat on their ass all day. I know of 2 of at least.",
          "id": 286,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 928,
      "content": "You want an 8 year old to get up, fix their own cereal, and leave for the bus on time while you sleep in? That’s not an engaged and active parent. That would feel awful to me if I were a kid. YTA.",
      "id": 287,
      "comments": [
        {
          "score": 333,
          "content": "Better yet, he’s looking to parentify his 10 and 12 year olds. They can handle it, right??",
          "id": 288,
          "comments": [
            {
              "score": 62,
              "content": "His 10-year-old with ADHD!",
              "id": 289,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "He wants the kids to be more responsible than he is.",
              "id": 290,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "I had to start getting myself up and ready for school around 7th grade (11 turning 12 for me) after my parents slept in a few too many times and I got a “demerit” for tardiness. Breakfast usually consisted of a frozen waffle, standing in the kitchen eating with the lights off, while everyone else in the house were still sleeping. It really sucked. \n\n\nOn an unrelated note, I’m now “no contact/ low contact” with my mom.",
          "id": 291,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Especially ones with ADHD. Time management and completing several tasks independently can be tough for kids with ADHD. They need a fibre and protein rich breakfast, and structure.",
          "id": 292,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}