{
  "post content": "First time ever posting anything so apologies if I make mistakes!\n\nOne of my friends (Let’s call them Avery) brought up a conflict in a server they're in with some of their other friends (Let’s call one of these friends Jay). Jay had shared a copypasta about leaving the server due to feeling left out. This made everyone on that server panic, so Avery came to me to ask about what they should do (Jay said they’d leave because of the server’s “toxic” atmosphere, and I cannot speak for them on this as I’m not a part of the server, but I suspect it might be another lie due to Avery saying repeatedly and recently that everyone is superbly nice)\n\nLater, Jay spoke up and said it was all a lie. Avery relayed this information to me and who we’ll call Jake. Avery said another person asked Jay if it was legit, and they said it was faked. I suggested the mods on the server maybe kick that person out for that (This is where I suspect I could be seen as the a-hole here, and I understand that)\n\nJake supported me while telling Avery about my personal opinion on the matter. But Avery says I might have been overreacting, and I understand why they’d said that, but I also don’t think I am.\n\nThis is also all the information I was given by Avery, so there could be parts I’m missing but cannot be achieved at this time due to Avery not wanting to talk (I also understand if I’m the A-Hole for prying a bit) \n\nAm I the A-Hole here?\n\nsmall edit: fixed misnamed friend\nedit: gave everyone fake names for more clarity",
  "id": 1,
  "comments": [
    {
      "score": 4,
      "content": "NAH (except maybe friend B if I am understanding your post correctly). So friend B, let’s call them Bob, made up drama about the server being toxic and wanting to leave over it, ensuing panic in the server? Then Bob basically says “haha Jk?” Well in that case, of course Bob should be kicked for causing drama. Did Bob give a reason for the unnecessary drama? That doesn’t make you an a-hole wanting to kick someone who is creating drama where none exists. Although the entire thing sounds like a headache and I would honestly see myself out if I were in your shoes…",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Yes you read the post correctly! I don’t believe “Bob” ever had a reason other than maybe saying it as a hurtful joke to everyone?? But then again I’ve never spoke to them so I don’t know what they’re like\n\nAlso yeah I probably shouldn’t have gotten involved but it was nagging me to no end",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "Okay yeah B deserves a swift kick from the server. Causing drama isn’t funny, it’s unnecessary, uncalled for, and annoying. Changing from NAH to NTA. Very reasonable actually.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "I can't tell the difference between friend A, B and C, it's easier to make up fake names, lol.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "aaa sorry!! I’m a bit new to Reddit so I wasn’t quite sure what to call everyone of the people mentioned",
          "id": 6,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believed I did not have a overreaction to the things Friend B said, which is where I could be judged. I understand if I’m judged on being the A-Hole here due to me being too harsh, as Friend A told me.\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst time ever posting anything so apologies if I make mistakes!\n\nOne of my friends (Let’s say Friend A) brought up a conflict in a server they're in with some of their other friends (Let’s call one of these friends Friend B). Friend B had shared a copypasta about leaving the server due to feeling left out. This made everyone on that server panic, so Friend A came to me to ask about what they should do (Friend B said they’d leave because of the server’s “toxic” atmosphere, and I cannot speak for them on this as I’m not a part of the server, but I suspect it might be another lie due to Friend A saying repeatedly and recently that everyone is superbly nice)\n\nLater, Friend B spoke up and said it was all a lie. Friend A relayed this information to me and who we’ll call Friend C. Friend A said another person asked B if it was legit, and they said it was faked. I suggested the mods on the server maybe kick that person out for that (This is where I suspect I could be seen as the a-hole here, and I understand that)\n\nFriend C supported me while telling Friend A about my personal opinion on the matter. But Friend B says I might have been overreacting, and I understand why they’d said that, but I also don’t think I am.\n\nThis is also all the information I was given by Friend A, so there could be parts I’m missing but cannot be achieved at this time due to Friend A not wanting to talk (I also understand if I’m the A-Hole for prying a bit) \n\nAm I the A-Hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Oh my God now you need aita over copypasta????",
      "id": 9,
      "comments": [],
      "relation": "No"
    }
  ]
}