{
  "post content": "My husband rented his aunts home before we got married. He signed a month to month lease when he moved in. I moved in with him after our marriage because the rent was super cheap. \nMy parents recently came to me asking if they could park their RV at our home.\nI didn’t see a problem with this. Our yards are really big and there is space.\nBecause of city ordinance the RV has to be parked in the back yard. There was no RV gate in the fence. My husband went to his aunt and asked if we could install a rv gate? His aunt said no. My husband relayed the message to me and my parents seemed upset when I told them. 2 days ago. I came home from work and saw that my dad had a construction crew at our home and had removed part of the fence for the gate. There was a apple tree in the way. They couldn’t fit the RV in the yard. My husband angry told my dad not to continue and that they needed to repair the fence.\nAt this point I felt like it was pointless. The fence guys already built the columns for the gate. It would cost a lot more money to rebuild the fence. I told my dad to finish the job but make sure it was left super clean. That it looked nice. I planned on talking to the aunt later and explain what happened.\nWhat I didn’t know was my dad told the guys to remove the tree. \nMy husbands aunt came by and saw the tree cut down and started to cry. She has refused to talk to my dad or me. When my husband came home he found a 30 day notice on our door.\nTerminating our lease. He tried to call his aunt and she didn’t answer the phone. He then called my MIL and she went to talk to our aunt.\nLater I got several messages calling me an A for cutting down the aunts late husbands tree. I had no idea he planted the tree. Now my husband and his whole family are really angry at me. I never told them to remove the tree. I feel like I am being thrown under the bus here. Am I the A here?",
  "id": 1,
  "comments": [
    {
      "score": 51300,
      "content": "YTA for letting it continue when your husband said no. the aunt said no to the gate and no is a complete sentence. Your parents removed a tree from a yard they DO NOT own. How stupid and selfish of them. Everyone is the AH besides your husband, his aunt and family. The Aunt can hire a lawyer and sue your parents and the company who did it without her permission. And honestly I hope she does\n\n\n\nEdited to add: Thanks for all the awards!!",
      "id": 2,
      "comments": [
        {
          "score": 14476,
          "content": "All of her comments show no contrition or realization of why this wrong.\n\nThey knowingly betrayed the Aunt and planned on cutting down the tree.\n\nPlan was just to apologize? Say 'Oops?!' There is no way that the Aunt should have anything to do with her again.\n\nI am glad that I don't see any mention of children in this, because she has completely betrayed her husband and his family.",
          "id": 3,
          "comments": [
            {
              "score": 6439,
              "content": "Seriously.  Aunt would have been in her rights to throw them the hell out just for the fence.  What kind of entitlement and presumption does it take to march onto someone else’s property and just start making changes to suit oneself?",
              "id": 4,
              "comments": [
                {
                  "score": 6186,
                  "content": " It blows my mind, that her father arranged for a construction crew and having work done, on an other's person property after he had been told no.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4521,
                      "content": "You can see where OP gets her audacity from. \nI’m absolutely baffled that she thought this would be ok. Her and her parents are huge YTA. A commenter posted that her parents did this to a yard they do not own, OP doesn’t even own the yard either. \nI totally understand aunts reaction, I’d be devastated too.\n\nEdit: spelling",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 808,
                      "content": "the construction crew is kind of ta too, do they not have to make sure that the property actually belongs to whoever hires them?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 755,
                      "content": "The aunt should sue the father.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 377,
                      "content": "Absolutely. Imagine having the audacity even after your daughter tells you no to go hire a crew to come destroy property so you can move in anyway? Assuming op actually told her parents as she claims. (Edited: midnight spelling!)",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 266,
                      "content": "And what kind of \"contractor\" accepts a job that hasn't been authorized by the home owner?  Unless they lied to the contractor and claimed to own the home...",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "I don’t believe she didn’t know dad was coming. I think she’s using dad as a convenient scapegoat so hubby and family aren’t even more mad at her",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "It's more likely than not that the op actually gave an okay to Dad but got caught. She probably thought it's better to ask for forgiveness than permission since she was already told no",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 689,
                  "content": "Also, don’t you usually have to schedule contractors weeks, if not months in advance? Kinda seems like this plan had been hatched,and not discussed with the appropriate parties, long ago.  I picture the conversation being something like this: “How mad could she be? It’s just a tree! We’ll just act really sad and say sorry! It’ll be totally fine”",
                  "id": 13,
                  "comments": [
                    {
                      "score": 534,
                      "content": "Yeah totally agree. They all assumed Aunt would just roll over...and now they need a new house.\n\nI hope the aunt sues them for distress,  claims the RV and burns it down. Thats what I'd do",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 176,
                      "content": "Depends on how far out the fence company is booking yeah. Plus they had to come out to do an estimate. And pull a permit through the town for construction work and call dig safe.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Definitely, because in another post she said the \"contractors\" already had the gate on-site, so they had to have it planned out.\n\nUnless the dad went to Home Depot and then picked up some day labors, which I wouldn't put past him either. Gonna do what he wanted no matter what.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I can only hope Aunt sues everyone involved except her nephew.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1500,
              "content": "I wonder what makes them to think that they are not Ah.\n\n1. they wanted to park a RV without informing the owner.\n2. after saying no dad brought a crew himself without informing anyone.\n3. started a construction without owners knowledge or approval. (what would city say?)\n4. after husband says no, op gave the green light to construction, which they have no ownership.\n5. cut down an important tree without any knowledge about it or informing anyone. \n\ndamm, aunt can sue op, husband, father and construction crew for all they worth.\n\nin case if it isn't clear, yes you are YTA op. also your father too, one can guess where it comes from...",
              "id": 18,
              "comments": [
                {
                  "score": 574,
                  "content": "Because they're vampires \nCheap rent for OP, free campground for her parents (when they can apparently afford a whole construction crew WTF!)\nHope you and family get sued! \nBlatant YTA!",
                  "id": 19,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I suspect \"construction crew\" means dad's buddies and a case of beer.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "If her dad was able to get a crew out there like that I’m thinking he must be local, so he’s probably not camping, he’s looking for free RV storage space. RV’s take up a lot of room, and even outside lot RV storage isn’t cheap. But he certainly is.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 176,
                  "content": "and the property owner was doing the op and husband a favor by renting them the house at a really low rate should be in there somewhere before they abused her trust and property.",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "Can we also add that parking a giant RV in the backyard would kill part of the lawn?  And who was going to pay for the increased electric and water usage from this RV being back there, and likely lived in?",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Right? And the response is always the same \"well I didnt know...\"\n\nThey told you no!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "The woman is trying to use the one small detail of she didn’t know about the tree. My ex was like this. If he was right or innocent about one small but crucial detail than he was innocent of it all. In this example the biggest issue is the removal of the tree=she didn’t know or gave permission to remove the tree therefore she isn’t guilty of being at fault.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "But there are no such things as rental lots to park RVs! /s\n\nThey killed an apple tree to save $50 a month.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "The wife was definitely in on all this! She assumed aunt either wouldn't notice or would just let it go. The dumb part in all this is by the time dad paid for the fence and tree removal he could have just paid for RV storage!",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 643,
              "content": "Because it's a relative. I bet you if their landlord has been a stranger OP wouldn't be here asking this question. She wouldn't have allowed it to continue at all. But felt entitled to do as she pleases because it's family so she didn't have to owe the same respect to the property she would a traditional landlord.",
              "id": 28,
              "comments": [
                {
                  "score": 20,
                  "content": "Yea, but it wasn't even her relative's property.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 463,
              "content": "[deleted]",
              "id": 30,
              "comments": [
                {
                  "score": 376,
                  "content": "She tried to ask for advice on this in r/legaladvice and swiftly deleted it 😂",
                  "id": 31,
                  "comments": [
                    {
                      "score": 130,
                      "content": "Oh man, I so wish I'd been able to see that post and the responses. Hopefully they got it through her head just how screwed she is, since she doesn't seem to be getting it from this post.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "oh shit i wish i'd seen them dragging her",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 136,
                  "content": "People often don’t realize that the damages awarded when you unlawfully cut down a mature tree run in the tens-of-thousands of dollars!",
                  "id": 34,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I hope that they at least lose their RV.  It’s a whole damn family of assholes.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 33,
                  "content": "Doubt she'll update to say she's wrong. I would love if the aunt posted about tree law somewhere else.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 21,
                      "content": "There's still hope of finding out. Her husband might be posting in relationship to know how to handle the divorce.  \n\nBecause, I don't know about you... But I wouldn't want to stay married to her. So, it's safe to deduce that he might have some feelings himself about this whole mess. Some feelings that she will not like.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 454,
              "content": "Yes, the lack of remorse for substituting her own decisions for her aunt's and her husband's decisions is appalling.  OP doesn't get it that she was wrong, and that her father actions were appalling...or does he always act like this and OP thinks this is how you get to great people?  Aunt had every right to refuse the request to have the RV in HER back yard for any reason, and her evicting OP and husband is a natural consequence of OP and OP's father's disregard for aunt's property.  \n\nOP, don't whine about being thrown under the bus: you threw own self under the bus when you didn't tell your bullheaded father to put the fence back up (no \"the gate looked nice\" crap) and he had to join you in apologizing to the aunt.   Take responsibility.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 238,
              "content": ">Plan was just to apologize? Say 'Oops?!' There is no way that the Aunt should have anything to do with her again.\n\n\nHonestly a huge red flag for manipulation right here. \"I trample people's boundaries for my/my family's benefit, and then I simply apologize so they need to move on and if they don't they're in the wrong for being so unforgiving.\"\n\nYeah, haven't heard that one before /s",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "The plan was to say that the tree tripped, fell, and landed on the fence, so they had to install a gate where the hole now was.",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 51,
              "content": "OP'S dad was gonna put that RV in the backyard no matter what anyone said or did. He TOLD OP that the RV was going in their yard because he tried to park it in his but city ordinance forbid it. He said he had no other options, becausehe doesn't have money to park it and hasn't sold his home. OP states it would have been disrespectful to go against her dad so she didn't care what the aunt said anyway.\nOP keeps saying she hopes the Aunt will come to a compromise? She clearly doesn't know what a compromise is, because the tree is already down. Seems like OP wants to keep the low rent and the RV in the backyard, what will the aunt get?\n\nI hope it's a big RV, OP and parents are going to be living in it.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "Exactly! \n\nI have a cousin who likes the motto ‘better to ask forgiveness than permission’ and it annoys me no end, but even she means it over something like taking the last cookie before she’s made it to the store to replace them - not cutting down a mother f-ing tree on land she does not own and has specifically been told not to!!",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "And I don't knownif she realized how fucking EXPENSIVE tree basedawsuits are either. This has the potential to be a massive monetary fuck up",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1212,
          "content": "Tree Law!\n\nThat tree could easily be worth $150,000 in a lawsuit.",
          "id": 44,
          "comments": [
            {
              "score": 762,
              "content": "Edit: added the italics sentences for clarification of my personal opinion.\n\nExactly. Don’t fuck with trees. I hope for OP’s sake they’re not in a treble damages state. *In general, not taking OP’s sake into account, I hope they* are *in a treble damages state. Don’t fuck with trees that you have no right touching. And don’t fuck with fruit trees that aren’t yours. They take* years *to mature. Depending on the size (dwarf, mini, full), over a damn decade to produce fruit. The house isn’t OP’s, it’s sure as shit not her dad’s, they’re selfish and give zero fucks about anything aside from what they want. Sentiment of the tree aside, I’d sue for damages. I’d also see if anything else can be tacked onto the law suit, on top of monetary value of the tree and the cost to turn my fence back into a fence because fuck you.*\n\nDepending on the age of the tree and the variety of apple, that tree could have been worth a small fortune.\n\nTimes that small fortune by 3 and it could take a lifetime to repay the debt (obviously because likely it can’t all be paid in lump sum).\n\nOP (and her father) better hope eviction is the furthest the aunt chooses to pursue the matter.",
              "id": 45,
              "comments": [
                {
                  "score": 336,
                  "content": "I kinda hope they are in a triple damages state.\n\nIt's rare I'm *for* someone being sued, but the circumstances of this one I think are a clear indicator OP/her dad actually deserve to be.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 10,
                      "content": "seriously how many \"no\"s do you need from the owner of the house in order to avoid ripping open the fence and tearing down a tree?  many places aren't equipped for RVs.  park it somewhere designed to allow an RV.  not your landlord's fenced off backyard.  it's idiotic to even ask about being TA in this instance.  this could honestly be creative writing, combining tree law and in-laws and tearing down fences is almost too reddit-bait-y to believe lmao",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "\" I hope for OP’s sake they’re not in a treble damages state. \"\n\nI hope they are. She deserves to pay for such disregard for someone else's property!",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Well OP’s dad seems to be very rich seeing all the resources available to him. He should pay.",
              "id": 49,
              "comments": [
                {
                  "score": 17,
                  "content": "Could have afforded to rent a parking space somewhere for the RV rather than violate someone’s private property",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 797,
          "content": "I hope she does too! The pain I felt reading about it, I can’t even imagine how the aunt must feel. \n\nOP YTA and don’t try to act like you didn’t know they were going to cut the tree. You said yourself they removed part of the fence but the RV still couldn’t fit because there was a tree in the way.\n\nI feel like it’s common sense that if she said no (seemingly for no reason) and the apple tree is in the way (you discovered this after going against the owner’s wishes) it’s probably the reason she said no in the first place. Like did it occur to you ‘ oh maybe she said no because she knew the apple tree is in the way’ and ‘I wonder why she doesn’t want to harm that tree’ and also why didn’t she just sell the house to your husband? Perhaps it has sentimental value…? \nOP you are so TA and your family is even more TA . Honestly the level of entitlement to go alter a property that doesn’t belong to you or them after specifically being told no 🤯\n\nI really hope she sues all y’all and I wish this was punishable by jail time because if I was your husband’s aunt I’d want you all in Jail",
          "id": 51,
          "comments": [
            {
              "score": 374,
              "content": "I keep reading the post and it makes me sadder every time I do. \nWe have a pear tree in the front garden of my family home. It was planted as a little tiny twig 30yrs ago. It has grown up with me and my sisters from kids to adults. My stepdad and BiL have suggested cutting it down before and have been met with a firm no from all of us - they now know the importance of that tree. \nI’m absolutely devastated for aunt. And OPs husband too, it was a reminder from his late uncle.",
              "id": 52,
              "comments": [
                {
                  "score": 275,
                  "content": "That’s the part that bothered me most too. Beyond the audacity of making changes to a property they do not own, without permission, they cut down a beloved tree. Then OP says this:\n>Later I got several messages calling me an A for cutting down the aunts late husbands tree. I had no idea he planted the tree. \n\nIt doesn’t matter! The removal of a beautiful mature tree was approved without the owner’s permission. That’s horrendous. The fact that it was planted by the late husband just makes it so much worse, and it was unforgivable to begin with. It makes me sick to think about. OP is lucky if she’s just evicted. If I were the aunt I’d go after damages, and they will be HUGE.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Exactly, I've moved a rhubarb plant twice cuz it was my mom's. It means something. She's been gone 21 years. It's a dumb plant. But I love it.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Exactly. Even if the aunt planted the tree the day before her husband moved in with zero sentiments value, they still have no right to cut it down at all whatsoever",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "Agreed, it makes it feel all the more tragic and infuriating when you can kind of relate to how important that tree seemingly was to the aunt. \n\nThe family home on my mother's side has housed three generations of our family over the last 90 years. My great grandmother planted the sycamore and apple trees, my grandmother planted the pecan and the plum trees, and my mother planted the magnolia in the back yard. Those trees have sheltered us in their boughs for decades, they've grown with us over three generations, provided tasty summer treats, and endless supplies of pecans for pies in the fall. But what makes them so special is the fact that each tree was planted for us by our beloved (and since departed) kin. When we suddenly lost my mother a few years ago, I would spend the days when I missed her the most hiding in the branches of her 25 year old magnolia, crying like a child and hugging the tree as if it were her. It sounds ridiculous, but that tree kept me grounded during those first awful months without her. Those trees are unquestionably considered to be members of our family, and my *entire* family would absolutely raise hell against anyone who would seek to harm a single one of them. The thought of it honestly enrages me. The years of care and sentiment that apple tree must have signified, destroyed in moments thanks to OP & family being mind-bogglingly selfish and inconsiderate assholes.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 27,
                      "content": "That garden sounds absolutely beautiful. And such a place that is filled with comfort and understanding. What makes is even more beautiful is how you’ve described who has added what to it over the years. Thank you for sharing it warmed my heart. \n\nWhat op doesn’t seem to wrap around is the memories that you’ve mentioned - they cannot be replicated or replaced. It’s way more than “just a tree”.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My dad planted a tiny weeping willow when I was a baby and we had just moved into our home.  My mom loved that tree so much.  Eventually my dad had to cut it down because it was eating into the roof and the roots had gotten into the city drainage and caused problems.  My mom was so mad that she left the house for that week because she couldn't handle seeing it cut down.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Doesn’t matter why. It’s her property.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It's destruction of property, could she press charges?",
              "id": 60,
              "comments": [
                {
                  "score": 22,
                  "content": "Yes. Absolutely. And mature trees are MUCH more expensive than most people realize.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Oh yeah, they're very expensive. And apple trees are so lovely, I feel so bad for the aunt 😥 and with such a sentimental value, too",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 563,
          "content": "I hope they sue her as well. That’s just so selfish. It pisses me off. How could you completely go against someone’s word and think that you’re not the asshole for doing so. Of course you’re the asshole.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 459,
          "content": "MAY OP AND HER PARENTS FACE THE FULL WRATH OF TREE LAW",
          "id": 64,
          "comments": [
            {
              "score": 154,
              "content": "TREE LAW!\n\nTREE LAW!\n\nTREE LAW!",
              "id": 65,
              "comments": [
                {
                  "score": 38,
                  "content": "TREE LAW!\n\nTREE LAW!\n\nTREE LAW!",
                  "id": 66,
                  "comments": [
                    {
                      "score": 31,
                      "content": "TREE LAW !\n\nTREE LAW!\n\nTREE LAW!",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "r/legaladvice LOVES tree law cases.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 404,
          "content": "“Oh the rent is super cheap so while I’m a tenant I am entitled to do whatever I want, including major structural work and taking down the landscaping, how was i supposed to know my late uncle in law planted that apple tree you can get apples from trader joes anyway, she overreacted to throw us out, I’m thrown under the bus by my parents who also think that rental = the property is mine to do as fit JUST SO THEY CAN FRIGGIN PARK A CAR boo hoo hoo.”\n\nIn case i’m not clear, #sarcasm and yes YTA, you and your parents.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 242,
          "content": "It is going to be a VERY awkward 2022 holiday season in this household",
          "id": 70,
          "comments": [
            {
              "score": 474,
              "content": "Nah, it'll be fine. \n\nOP's husband and his family will have a wonderful day together, maybe with a few funny jabs at his ex and her family (While they're all reaching for the last serving of the favorite treat, they all laugh and agree its good that OP and her family aren't there since they would have taken all of the favorite treat before anyone even got some.. then give the last serving to the aunt)\n\nOP and her parents will be super grumpy to be in a place that they deem beneath them after losing, justifiably, losing big in court and having to sell the town house and the RV.",
              "id": 71,
              "comments": [
                {
                  "score": 15,
                  "content": "I can just imagine the family banter now, “How’s that divorce going?” \n“I knew she was a selfish type, no accountability or responsibility… good riddance “",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Doesn't sound like OP experiences complex emotions like shame and awkwardness.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 234,
          "content": "She's been living in a nice place for barely anything for years and she can't even respect the rightful owner stance when said no. I sincerely hope they sue and take them to the cleaners.\n\nAfter reading this, is pretty clear who OP has taken her selfish and entitled attitude from. OP and her whole family are a bunch of selfish, entitled cockroaches.",
          "id": 74,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 176,
          "content": "All so they could park a fucking RV, like are you for real? YTA 100 times over. Hope you get sued too, asshole.",
          "id": 75,
          "comments": [
            {
              "score": 24,
              "content": "I bet she meant for her parents to live there, rent free and without prior agreement. \n\nAlso, I don't believe she didn't know what her parents meant to do in the yard. It's pretty telling that she ordered the workers to continue even when her husband said stop.\n\nFinally, OP had no idea the workers were cutting down the tree? I call BS on that. She said she came home before they did it, did she not hear the chainsaw?\n\nUgh, what a nasty person. I hope her husband comes to his senses and realises she's dragging him down.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "I don't even know how she can even QUESTION this.\n\nABSOLUTELY YTA.\n\nFrom top to bottom.\n\nThere's not even any wiggle room on this one.",
          "id": 77,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14697,
      "content": "YTA. She said NO!\n\nWhy do your parents have an RV that they have no room for? \n\nWhy did your father even think any of this was appropriate?\n\nLet me reiterate - she said NO!",
      "id": 78,
      "comments": [
        {
          "score": 2608,
          "content": "I bet this chick was thinking long haul and was playing 4d chess only in her mind moving her parents on the property hoping to one day own the aunts house.",
          "id": 79,
          "comments": [
            {
              "score": 969,
              "content": "Bold thinking when they are only month to month",
              "id": 80,
              "comments": [
                {
                  "score": 417,
                  "content": "[deleted]",
                  "id": 81,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Boldest by getting involved in tree law...",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Property disputes are usually where the boldest argues come into play",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1617,
          "content": "Why did they spend money to install a gate and ruin a yard that wasn’t even theirs when they could’ve just paid for a rented spot?",
          "id": 84,
          "comments": [
            {
              "score": 1224,
              "content": "Because, based on OP’s whole post and her responses here, she was raised in a family of entitled AH who figure that they can do what they want and sure, someone might be upset about it, but no one’s really gonna DO anything. Legal recourse is expensive and exhausting.\n\nBut also I bet they were assuming that one upfront cost for construction was better than the long-term cost of paying for a rented space.",
              "id": 85,
              "comments": [
                {
                  "score": 568,
                  "content": "Lol if this happened in Washington they’d literally have to pay 3x the cost of installing a new, fully grown apple tree. Easily hundreds of thousands of dollars. Other states will be different but OP’s parents are probably fucked. So much for ever owning a home.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 244,
                      "content": "Tree law is no joke.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "/r/treelaw",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "That doesn't include the emotional aspect.  The fact that the aunt's late husband planted it means that they're on the hook for emotional damage as well - and in California and some other jurisdictions, emotional distress gets the same 3x multiplier as other tree torts.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Right? Taking out any tree is bad. Taking out a fully grown apple tree is like 100x worse.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Exactly. They were month to month but OP and her folks probably assumed it would just be forever and they’d never be kicked out since family so why not just renovate the place and treat it as yours.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 318,
          "content": "I assumed they wanted to live in the RV on the aunt's property. \nThat's against bylaws in many cities",
          "id": 92,
          "comments": [
            {
              "score": 51,
              "content": "Me too…you just know that was the next step in the plan…OP’s parents were moving in…",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "They’re cracking down on that in my city, the people park their RVs everywhere or just, you know, wherever they want. Plus it blocks our view of oncoming traffic when they park it on our street (which is at least is now designated no parking for RVs). I was happy to see that.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "YTA. Husband needs to divorce you because you and your family have absolutely no respect for him and his family.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "What, is the RV actually in the aunt's yard right now? I would have it towed out to the desert and lit on fire.",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "This whole thing makes me feel terrible for Clark Griswold",
          "id": 97,
          "comments": [
            {
              "score": 11,
              "content": "That there is an aaaaaaaar-vee.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Wait, why did her father think it was appropriate? How did he know the couple wasn't going to get home at some point, blow up, and leave him with the costs of a half made fence?\nInfo: OP, you dug the hole deep enough that you're not getting out either way, so tell the truth and shame the devil, did you tell your dad he could park the rv and open the fence anyway after the aunt said no?\n\nOh, and YTA",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Honestly, if it were my house and my tree, the next time I'd be seeing you was in court. YTA on such a spectacular level.... Your husband really should be leaving your entitled ass.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Pay storage like we do",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10342,
      "content": "YTA\n\nYou are such TA I'm a bit speechless you thought to post this. \n\nHere's my main sticking point. You asked. She said no. \n\n>My husband angry told my dad not to continue and that they needed to repair the fence. At this point I felt like it was pointless. The fence guys already built the columns for the gate. It would cost a lot more money to rebuild the fence. I told my dad to finish the job but make sure it was left super clean.\n\nWho are you married to, your father or your husband? Why did you not put your foot down with your father? I'm just sorry that your husband has to share the consequences to this.\n\nEdited to add: TREE LAW",
      "id": 102,
      "comments": [
        {
          "score": 3399,
          "content": "I think OP planned this. This reeks of beg forgiveness instead of asking permission (yes they asked about the gate but not about anything else). It was an act. “Oh gosh darn gee whiz, what’s a person to do? How can I stop the big burly fence company? Oh no! Aaaaaaaahhhh I can’t prevent this! Woe is me!”",
          "id": 103,
          "comments": [
            {
              "score": 1722,
              "content": "I have my suspicions as well. She's attempted posting about Tree Law recently as well. She's now panicking and trying to \"fix\" it. There is no fix to this.",
              "id": 104,
              "comments": [
                {
                  "score": 745,
                  "content": "God, I love Tree Law",
                  "id": 105,
                  "comments": [
                    {
                      "score": 431,
                      "content": "We all love tree law.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "It seems people in this situation instead of apologizing just resort to gaslighting, “why would you have a tree right where a gate could go in”",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "When I was a wee tiny botany student, we had an ongoing joke about the value of black walnut (this ain’t that) and “apple” tree can mean a lot of things from “crab apple” to “prize heirloom producing,” but my guess is that OPs’ family fucked up in a way that they will never be able to pay off.",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Oh, there's a fix. It's called $$$$$$$$$$.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "What was she posting about tree law? I would love to see how badly she shit her pants after figuring out that yes it’s a thing and that it’s going to cost her parents dearly for their hubris.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 238,
              "content": "It's wise not to do the seek forgiveness maneuver when the action can end up costing you tens of thousands of dollars. It's just supremely stupid.\n\nOh how I love tree law legal cases.",
              "id": 111,
              "comments": [
                {
                  "score": 27,
                  "content": "Tens of thousand of dollars AND your place to live. Her dad still doesn’t have a place for his RV and they’re now homeless. I hope it was worth it.",
                  "id": 112,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Tens of thousands if she’s lucky. I’ve seen torn-down cherry tree go up to 200k.",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Absolutely this. I do not believe for one second that she told her parents “no”.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 224,
          "content": "On another point, she’s possibly effed things up for her husband in finding another place to live if they don’t comply with the 30-day notice because if the aunt goes through the rest of the eviction process; it makes it extremely difficult to find another decent rental to live in for about 7-10 years.  For the husband’s sake I hope her she isn’t dumb enough to be entitled about that too and that she’s not there in a months time whining about the aunt going through the eviction process because of a *mistake.*.    \n\nI used to work in property management.  You do NOT want an eviction in your credit history. It’s harder to come back from than a bankruptcy.",
          "id": 115,
          "comments": [
            {
              "score": 110,
              "content": "Her other comments make it seem that she has no intention of leaving and thinks it’s negotiable or optional, just a request. There’s a housing shortage, they can’t find anything for the same price range, there’s nowhere else to go, can’t go to her mom & dad’s since they’re selling… just excuses and the wording definitely sounds like she’s just gonna drag her feet and not take it seriously then go all surprised pikachu when it goes to court. Just like she’s shocked and can’t believe his aunt is “ghosting” them over “a mistake”. Zero responsibility, zero respect.",
              "id": 116,
              "comments": [
                {
                  "score": 20,
                  "content": "I get that impression too.  I just hope that the husband who seems to be an innocent party in this doesn’t end up paying the price for her stupidity.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I’m sure once her husband tells his aunt that the legal proceedings to make OP his EX wife have been filed, and he will help her sue OP & her father into abject poverty, he may not have to look for a new place to live. OP is going to find her shit piled out on the lawn though either way though if she doesn’t get the hell out, for sure.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "He may have to move in with his parents. Maybe OP can move into the RV.",
              "id": 119,
              "comments": [
                {
                  "score": 14,
                  "content": "I can’t see the marriage surviving this and he’s a fool if he stays after this.",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I don't see this marriage lasting. If you already having communication issues and being selfish....and newly married???....",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "I get an entitlement vibe from OP. I’m thinking she thought her husband would inherit the aunt’s home. Hence the changes…",
          "id": 122,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "I'm only knowledgeable in bird law",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Far superior though to TREE LAW is Bird Law.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "If you say \"tree law\" three times, lawyers everywhere begin drooling uncontrollably",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "OP didn’t listen to her husband and made her decision, which TBH was put in RV gate.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I really like how she says\n\n>they needed to repair the fence. At this point I felt like it was pointless. The fence guys already built the columns for the gate. It would cost a lot more money to rebuild the fence.\n\nAnd then an old ass tree gets cut down...\n\nThe dad didnt have permission to touch the fence? Even if tree law doesnt get involved the money for court and lawyers are going to greatly outweigh the fence money",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6404,
      "content": "YTA. NONE of this is fair to your aunt, and it doesn't matter if the tree was a random tree growing on her property or had a special meaning; you broke the lease and cost her damages and I would expect to be sued for the loss if I were you.",
      "id": 128,
      "comments": [
        {
          "score": 1373,
          "content": "Exactly. This was not their property to make irreversible changes to. Just like any other normal rental. \n\nAlso why did the father feel entitled to change the property of another family without explicit permission to fit their RV???",
          "id": 129,
          "comments": [
            {
              "score": 671,
              "content": "Not only lack of explicit permission, but explicit DENIAL of permission -- the aunt's \"no\" was relayed to him two days before he decided to break the law and OP decided to enable his actions.\n\n\\[Edit:  Sorry; the \"no\" being reportedly relayed to him probably happened sooner; the \"two days\" from the post was the time between the illegal construction crew showing up and OP making this post.  The father being told \"no\" probably came sooner, unless he found a construction crew with immediate free time.\\]\n\nYTA, OP.",
              "id": 130,
              "comments": [
                {
                  "score": 14,
                  "content": "Let's not forget how hard it is to get a construction crew ooutit right away especially now that the economy is bouncing back.  He had already contacted and booked them before the Aunt even said no and then just said \"fuck that. I'm still doing it\" just like the attitude of his daughter.   \n  \nWe just had a concrete slab poured in our backyard and part of the concrete in front of our garage doors fixed. It took ober a week to get them out here and then it took 3 extra days because of jow far behind the cement truck delivery schedule was.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "My landlord, I have to get permission, just to have another person move in..they have to be added to the lease.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Probably where OP got her sense of entitlement.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 486,
          "content": "Her aunt? Her HUSBANDS aunt. The audacity of both OP and her parents is beyond me and OP from her comments seems dense as hell. Poor husband and his aunt.",
          "id": 134,
          "comments": [
            {
              "score": 71,
              "content": "Can you imagine being that aunt and letting your nephew and new niece-in-law rent a home you lived in with your late husband for 30 years… and she not only allows, but also *encourages* her family to treat it like this. I was glad to see that OP’s husband is already [making her find an apartment.](https://www.reddit.com/r/AmItheAsshole/comments/xncev7/aita_for_my_husbands_aunts_tree_being_cut_down/ipsz47d/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)\n\n> My husband told me I had to find an apartment. If I don’t then he will go live with my in-laws. Who are mad at me right now. I am hoping it’s just out of anger and he will calm down. Either way I will keep trying.",
              "id": 135,
              "comments": [
                {
                  "score": 20,
                  "content": "Good, cause from that update she still sounds way too delusional and entitled.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 243,
          "content": "Don’t forget in tons of states tree lawsuits are treble damages (3x the money awarded)",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 77,
          "content": "I would expect to be evicted.",
          "id": 138,
          "comments": [
            {
              "score": 11,
              "content": "I wrote elsewhere that the eviction shouldn’t have been a surprise. Nor should being served divorce papers.",
              "id": 139,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "What’s so surprising is she doesn’t realize that even if the tree was never touched and fine, she’s still the asshole bc it’s wrong in the first palce",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Yep. My uncle had a tenant who had a tree removed. My uncle sued him and easily won.",
          "id": 141,
          "comments": [
            {
              "score": 35,
              "content": "Yup. Trees, especially older trees have a lot of value. This was a financial loss for the Auntie, in addition to the emotional value.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "They would have been fucked for building the fence on someone else's property alone.\n\nBut the tree... that is a special kind of fucked.",
          "id": 143,
          "comments": [
            {
              "score": 17,
              "content": "Agreed. There's no bringing back the tree.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6134,
      "content": "YTA, obviously and hugely. Everybody else already told you that. \n\nHowever — if the felled tree is still there and still has live branches on it, you might be able to take some cuttings and make clones for your husband’s aunt. is won’t save you from getting evicted or from other consequences, but it might be a good start for showing contrition. The tree appreciation sub r/marijuanaenthusiasts (yes, really) can provide more instruction on taking and rooting fruit tree cuttings — and give you an idea of what the law thinks of your liability for the tree.",
      "id": 145,
      "comments": [
        {
          "score": 1124,
          "content": "It was nice of you to suggest this. I didn't even think of this. Take the award.",
          "id": 146,
          "comments": [
            {
              "score": 876,
              "content": "This IS a good idea and a nice gesture- but it’s not going to mean much to the Aunt. \n\nI’m a widow myself- and the reason that tree was important was not because it was that kind of tree. It was because her husband planted it. They had memories there. \n\nI still keep my late husband’s clothes. If someone “accidentally” threw them out but offered to replace them - with the exact same of every piece of clothing - I wouldn’t accept. \n\nBecause the reason I keep the clothes is not because I want his clothes- \nIt’s because he wore them. \nIt’s because that shirt still has the stain on it from that one time we got lost in the woods. \nBecause I remember the day it was so hot- he cut the sleeves off that one T-shirt. \nBecause even though he’s been gone for a year, the clothes still smell like him. \nCrazy that last one, he’s not here anymore to even make that smell- his natural pheromone smell - but I sniff his shirt and it’s like I’m sitting next to him again. \n\nBut a new set of clothes that look exactly like his wouldn’t have those things. And I’m sure it’s probably the same for the aunt. I don’t know how old she is or how long her husband has been gone- maybe it’s because I’m young and recently lost my husband unexpectedly- but I can’t imagine it gets any easier or that she wouldn’t still be attached to that tree in the same way even though she doesn’t live there currently. It’s still a terrible thing to do and a clone is a very nice gesture- but if she’s using it to just not get kicked out- then it loses the very little meaning it would’ve had.",
              "id": 147,
              "comments": [
                {
                  "score": 139,
                  "content": "I'm so sorry for your loss. And, everything you said makes perfect sense.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "The gesture isn’t worth much… but it’s the best OP could possibly do, afaik. At least the sapling clones would be *from* the same tree planted by the deceased spouse, not just an “equivalent” tree.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Oh I agree it should still be done - but I thought someone said she was going to do it “so we can still stay”. Something like that. But there’s still no replacing something that sentimental.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I’m so sorry for your loss.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Uf...  You deserve to get a big hug.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I’m so sorry for your loss- he must have been an amazing person to be loved so well by someone as kind and thoughtful as you seem to be. May his memory always be a blessing. \n\nWhat you describe about the power of the scent of your husband’s shirt totally changed my perspective about the tree cloning. I had been thinking that cloning could be a viable solution  because at least that way the specific tree the aunt’s husband planted survives. It would look different but still be a superior replacement versus an entirely new tree that matched the age and size of the original. But I realized that your comparison cuts even closer to the bone, because a cloned tree would be like if someone just came over one day while you were out and washed all your husband’s things. Sure, you’d still have the same physical items of clothing that he actually wore, but there’s truly no way to replace or restore the olfactory aspect of their sentimentality. \n\nThe aunt has irrevocably lost the actual tree that her husband put in the ground with his own hands and that they and she tended to and watched grow over the years. Having something of the original is better than nothing, but it can’t ever be the way it was because some AH decided they knew better. It doesn’t matter in the slightest that AH OP and her AH father didn’t know the full story of the tree’s importance, because they *did* know it *wasn’t* their property *and* that the owner had already said no to the whole project in the first place. Not every mistake can be repaired and that’s one very good reason why we should respect the boundaries other people set for their stuff.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 482,
          "content": "Except that cloning patented fruit trees is super-illegal (it's stupid, but it's true), and also, unless you're grafting it onto the right sort of root stock (probably dwarf or semidwarf) you're gonna end up with a monster\n tree that doesn't fruit for 15 years. \n\nBut liability, boy is OP screwed. A lot of states have treble damages on trees and replacing a full grown apple tree is 8-10k, before you treble it.",
          "id": 154,
          "comments": [
            {
              "score": 111,
              "content": "Cloning a patented fruit tree is illegal? Is it due to the original inventor essentially owning the cloned flora?  \n\n\nAlso, what difference is cloning and the tree reproducing naturally? Is it due to the nature of the clone being the patent?",
              "id": 155,
              "comments": [
                {
                  "score": 84,
                  "content": "It's complicated, and a couple of factors at play.  Firstly the land-grab of patents over hybrids, and that can fuck right off imho, and I'd go ahead and do it without remorse.  \n\nThe rooting stock is more complicated, many domestic fruit trees are actually one heavy fruiting top grafted on to a different more vigorous growing base, so cuttings are likely to disappoint.\n\nNatural reproduction, like animals, features a mixing of genes from the parent and another plant, so you get genetic diversity and the seeds aren't identical with the parents.\n\nQuite a lot going on there, and I've not done it justice, just a bit of background :)",
                  "id": 156,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Most fruit trees are grown on dwarfing or semi-dwarfing stock because nobody wants to pick the apples off of a 50+' tree, and also because it takes non-dwarfed trees forever to get to fruiting size. Ideally, you want a fruit tree to be 12'-20' max, for reasons of practicality and speed.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Also r/treelaw. Most likely the cost of a full mature tree will be in the thousands and that’s not if OP is liable for treble damages",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I wish we could send this to the aunt I hope she's able to salvage the tree in some way at OP's (financial) expense of course",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I really hope she does this. I would be devastated to lose a tree on my property regardless of the added sentimental value; just because some people don’t view trees that way doesn’t negate the fact that others DO. Attempting to clone the apple tree ASAP should be considered a must, and worst-case save the wood to have a memorial bench constructed from it. OP and especially her parents have acted shamefully and without any consideration.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Assholes this big don't feel contrition.  This is why Saruman lost.",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3654,
      "content": "Your dad is mostly the a-hole.  He started the gate, plus he ordered the tree to be removed.  BUT, why didn't you stop all of this as soon as you realized what was happening?  You are the point-of-contact for your side of the family, so they blame you.  You are going to have to own this one.  YTA.",
      "id": 162,
      "comments": [
        {
          "score": 793,
          "content": "Because she knew. She knew what her parents were doing. She lied to her husband, she lied to her husband's aunt, and now she's lying to AITA. What is your end game, OP? Are you waiting for just one commenter to side with you so you can show it to your husband and his aunt, thinking it'll save your marriage and your home? Are you going to wave it in front of the judge when your parents get hauled into court and sued? You and your parents are in the wrong. Nothing is going to fix this. I feel so badly for your husband and his family. You'll probably make yourself really hard to get rid of once he decides to divorce you.",
          "id": 163,
          "comments": [
            {
              "score": 68,
              "content": "There's even a comment saying she knew the tree was going to be cut down, as it was in the middle of the spot her dad wanted to park the rv. YTA on so many levels, Op.",
              "id": 164,
              "comments": [
                {
                  "score": 14,
                  "content": "Really would not be surprised if this ends in divorce for OP and after all that, she's still sitting there with a \"Well I never!\" Shocked Pikachu face.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Maybe she’s trying to establish precedent in a super fucked up way to claim the property as their’s one day?",
              "id": 166,
              "comments": [
                {
                  "score": 30,
                  "content": "I don't know, maybe. It definitely sounds like she thought she was home free as far as housing goes because it was owned by a family member. She really thought she could do whatever she wanted and they would have no choice but to forgive her. But yeah, she's obviously already thinking that it's her house.",
                  "id": 167,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "They blame her because she *is* to blame.\n\nAhe came home, saw what was going on and just let them continue. She knew exactly what her dad was planning and you can see from her comments that she knew the tree would be cut down because that's the only way to fit an RV in the garden. By not kicking them all out she gave consent.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Probably because she was the one who told them to do it anyway in the first place. Would you make this expensive changes if you know you're risking the tenants coming home (and the will) and stopping you immediately at some point, or getting so angry they cut contact and you don't get to park the rv anyway?",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3004,
      "content": "YTA. Why would your parents think they have the authority to come into town and wreck your the aunt’s fence? I’m going to guess and say you either didn’t tell them they couldn’t or you told them to just go ahead anyway…just like you told your dad to just finish the gate instead of paying so much more to repair the fence. \n\nYour husband and his whole family is understandably mad at you. I doubt your husband will even want to stay with you after this.\n\nETA: I see now OP said she told her parents the answer was no on the gate, but I’d still like to know where her parents got the audacity…",
      "id": 170,
      "comments": [
        {
          "score": 521,
          "content": "lol and you believe her? The absolute obliviousness of OP to how badly she and her father screwed up feels like she’s trying to justify that *of course* she’s not at fault! Giving tacit permission without saying the words until it was too late so there was plausible deniability on her part but it doesn’t sound like anyone in her family is buying it.",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 357,
          "content": "Not to mention... If there isn't a gate then there definitely isn't a concrete pad for the RV to park on.  That means she just wanted to kill a section of the lawn/landscaping and leave bit ruts across the yard from driving it in and out..\n\nMy neighborhood has really hard soil, but you can still see ruts if people drive something as big as an RV across a lawn. That's not an easy fix.\n\nSo even if OP didn't plan to kill the tree from the beginning, she and her parents planned to destroy the landscaping and lawn from the get go.",
          "id": 172,
          "comments": [
            {
              "score": 30,
              "content": "Not to mention that just because the bylaws say you have to park the RV behind the house doesn’t mean that you can use it as a guest house in many places.  I bet they never checked that either.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 148,
          "content": "I’m with the other commenter. I assume OP told dad “you can put up a gate and put it in our yard” aunt said no and OP never told parents. It’s hard to believe this story otherwise. How could OP and father BOTH suck that much?!",
          "id": 174,
          "comments": [
            {
              "score": 29,
              "content": "I mean, he raised her",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Apple doesn’t fall far from the tree",
              "id": 176,
              "comments": [
                {
                  "score": 18,
                  "content": "Especially if it's been cut down...",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Actually, the husband told her parents the answer was no on the gate.  The more I read through this post, the more I would not be the tiniest bit surprised if OP was conspiring with her parents about it.  She said they came home and found construction had begun and that her husband was angry and told them to stop, but nowhere does she say that she was surprised to see the crew or that her parents would do that after they'd been told no.  Nope, we don't have that.  Instead, we have OP telling her husband that they may as well finish it because they've done so much already and it will cost more to put it back the way it was.  I honestly think she might have been in on it.",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 65,
          "content": "I’m not sure I believe that part of her account but if she did say no, she basically did the same thing to the aunt they did to her, so I think it’s a family trait. Just do what you want and expect others to fall in line 🤷🏽‍♀️\n\nEdited *the aunt- not hers",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "I don’t know where her parents got the audacity, but it’s clear OP got hers from them. There’s something so funny about stories where parents show you exactly how their kids got like they did.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "She didn’t tell him No. she said “ my husband told him know. I felt it was useless to repair the fence and told him to go ahead and finish just make sure everything was left as clean as possible”.",
          "id": 181,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2487,
      "content": "INFO: What the fuck",
      "id": 182,
      "comments": [
        {
          "score": 261,
          "content": "Best info request. . .EVER!!!!",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Also info: Name of the contractor so we all can avoid them?  \n\n Not getting permission from the property owner is one of the stupidest laziest things you can do",
          "id": 184,
          "comments": [
            {
              "score": 16,
              "content": "I don't blame the contractor for assuming OP's dad owned the property in question.\n\nI can't imagine there are huge numbers of entitled assholes walking around who are bold enough to contract out for home improvements on other people's properties.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1855,
      "content": "You and your dad YTA. You rent someone’s house and ask to make permanent alterations and are refused. Then you go ahead anyway and cut down their tree to make it more convenient? I would throw you out too.",
      "id": 186,
      "comments": [
        {
          "score": 498,
          "content": "That’s what I’m struggling to comprehend too , why did they think it’s okay to make these alterations against the wishes of the owner , how did they think it’s okay",
          "id": 187,
          "comments": [
            {
              "score": 435,
              "content": "It’s like her father said “f@ck your husband and his auntie” and she said “right on dad”. They did this to a house where there had a month to month lease. If they had a year’s lease they would have probably knocked the whole damn house down to situate the RV in the best possible spot.",
              "id": 188,
              "comments": [
                {
                  "score": 199,
                  "content": "Basically yeah , after reading some of the OPs comments I don’t see any respect towards the aunt , the husband or his family  and even less towards the property , just that she didn’t want to dissatisfy her AH entitled father",
                  "id": 189,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Oh absolutely. I don't know who the hell she thinks she is. YTA so so much",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I wouldn't be surprised it the parents intended to move into the rv permanently...\n\nThat's the way to thank Auntie for being kind enough to give your husband a nice place to live with a low rent....\n\nOP, you and your father (and other family who thought this was ok) are not only AHs you're COLOSSAL YTA s.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Oh yeah. She aaid in another comment they want to sell their house and move into the RV. So not only were they destroying someone else's property who said no already, they were going to move into the RV on her land without asking and have 4 people live there on the super cheap rent she's no longer going to get.\n\nThe responses are so unremorseful and self-centred too. I hope she gets sued and divorced.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Lack of thinking was a big thing with OP and her dad. It's the only conclusion.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1846,
      "content": "YTA I think what makes you the biggest AH is despite people explaining why it's wrong you still don't get what a bug deal this is. The compromise is that she isn't suing your family and the company did this. Like fence aside do you have any idea how much a fully grown apple tree. If my husband did this and continued to act like it was no big deal I'd seriously consider a divorce. \n\nAnd I do get your side. I rent from family and I couldn't afford to live else where.",
      "id": 194,
      "comments": [
        {
          "score": 451,
          "content": "The Aunt could still sue. This ain't over.",
          "id": 195,
          "comments": [
            {
              "score": 289,
              "content": "I really hope she does. And files a criminal complaint as well.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "Not just *could*... she fucking SHOULD.",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 107,
              "content": "If Aunt decides to sit down with OP and dad for the conversation OP Wants to have, I have a feeling her mind would change from not suing to going after them for everything.",
              "id": 198,
              "comments": [
                {
                  "score": 28,
                  "content": "Right! This is what I was trying to get across. I know facing being homeless is scary but asking for a \"compromise\" while aunt is already being extremely generous is like pouring gasoline on a fire.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I’m with ya, OP needs to understand that aunt not talking to them is the best case scenario rn because with this nonchalant attitude nothing good can come out of that conversation",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "not just sue. She could press criminal charges.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "She’s oblivious to anything you have to say! No respect for where she is living but perhaps her dad and mom have her so blindfolded on it?",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 115,
          "content": "I hope she does sue them. Their entitlement seems astronomical and needs to be checked by someone! I would 100% divorce this woman too. This whole thing is mind boggling.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "If you can’t afford to live somewhere else you should kiss the ground of the person helping you. Not piss all over it",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}