{
  "post content": "So my (29f) boyfriend (27m) and I were at a bar that has video games and we were casually playing smash. Context here is that I suck at playing video games. I am very much a noob. I've only played Smash and Kirby is my jam. My BF does not suck at video games. In fact, he's been playing them all his life and even has a video game related career going for him. He has always beat me in every game, especially Smash.\n\nLast night we were playing and surprisingly I was just whipping his ass with Kirby while he main'd Mario. At first, he was proud. We jokingly shit talk eachother all the time, whether playing games or in life, and during this match, the shit talking seemed fun. \n\nWelp, close to the end of our game, the waiter came by to ask how we were doing. I said \"awesome, I'm beating his ass\". The Waiter asked if we needed anything else and I said \"some bandages for him and maybe an empty pitcher for his tears.\" Now, after I said this, I didn't notice my boyfriend being annoyed. Honestly, I thought he was laughing with me. We played Kirby vs Kirby and I won. Finally, I played Mario (a character I never play) and he played Kirby. He won. After winning, he got kinda loud and was like \"See this is the evidence that Kirby is a broken character! It is definitive that this character is a bad character and is noob friendly.\" \n\nI was annoyed by this, not because I lost the final match, but just his announcement that my character sucks and all my wins were due to it being broken. As we were walking home, I tried to ask him why he had to make such a show that Kirby is a broken character, just be a gracious loser that I won all those other rounds. He would say, \"yeah, you won, But...\",  then follow up with his long explanation why me playing Kirby doesn't really matter because the character is broken and hit boxes, yada yada....\n\nIt led to an argument because I was really annoyed that he couldn't just be a good sport. We weren't playing competitively. Shit, I don't even know about tiers or smash players. I was playing for fun with a character that I always play. It annoyed me to because everytime we play, I'm always losing. I \"got good\" and beat him.\n\nLater on, he came to me and apologized for how he responded. He told me that the reason why he said what he said was because of my shit talking to the waiter annoyed him.\n\nI told him I'm not going to apologize for making jokes that I would typically make. I'm not apologizing because his ego is hurt that I beat him with Kirby. I'm not going to \"appeal to [his] authority\" just because he works in the industry knows more about video games and its culture than I do. What do you think?\n\nEdit 1 : (I mentioned this in one of my comments) \"I should have made it clear that we know the waiter, we're regulars at that bar, and we both were joking/ shit talking with the waiter. I just happened to be in the advantage point of winning at that time, so yeah, I was a little cocky.\" It's not the first time we played games at this bar or joked/shit talked one another in the presence of a waiter. It is the first time one of us got upset about it.\"\n\nEdit 2: (also posted below) \"It seems like a lot of people are pretty upset by the shit talking because i did it in front of the waiter (public shaming) and that my post isnt clear on if I was the only one talking shit in front of the waiter. It might read that I was the only one, but I was not. We both engaged in shit talking in the presence of the waiter. What I said, within the circumstances of the game, just seemed to cross the line. Which is why I brought up the ego part, the amount of times I've lost and endeared the shit talking... it doesn't phase me. But I actually won for once and I'm the asshole for dishing the shit.\n\nI'll admit for being cold to his feelings about feeling embarrassed, but I'm just not being sold on being more of the asshole because I talked shit and won.  I am interested on people's thoughts though.\"\n\nFinal edit: I am really glad that I posted and heard from ya'll. My boyfriend saw the post and shared that he really didn't know the waiter like that and did feel publicly shamed. I apologized for embarrassing him and it is noted that we both won't shit talk in the presence of strangers again. Thanks for helping us grow up.\n\nTl;dr- AITA for shit talking my boyfriend when playing video games and beating him with Kirby?",
  "id": 1,
  "comments": [
    {
      "score": 45,
      "content": "ESH. Everyone sucks here a lot. Firstly, you took a joke too far and it wasn't fun for him anymore. You should apologise for that. He behaved badly too, but when he apologised for his behaviour and you refused to apologise for yours, you came off looking like the bigger AH.\n\nJust be nice to each other.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "This",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -9,
          "content": "Oh come on.",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "Everybody knows Kirby is the easiest character to play, and is basically a cheat.\n\nESH- at first it may have been funny but you took it too far. He took the game too personally, but he at least apologized. You’re being petty and an ass by not apologizing. Both need to grow up.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "ESH. He sucks cause his response was very poor and it kind of feels like he's insecure about losing to you at video games which is weird. You suck cause he told you how he felt and you basically said you didn't care about his feelings.",
      "id": 6,
      "comments": [
        {
          "score": -7,
          "content": "Thanks for responding. Just to clarify, I didn't apologize because we had been joking with the waiter our whole time there. It's not that I don't care about his feelings, I just won't fall into the trap of apologizing for someone else's insecurities. I am here to help him through his feelings and if I'm wrong, I'll apologize. Outside of being social and continuing to joke with the waiter like we both had been doing, I do not see what I did that was wrong. \n\nYou mentioned it's kinda weird that he seems insecure about losing to me. That's on him to figure out. I'll be here to help, but i'm not gonna change my character (kirby) or apologize just because he's insecure about losing. It's the same thing with a jealous person. It's not on the other individual to fix unless they are purposely trying to make that person jealous. I wasn't purposely trying to make him feel insecure.\n\nNevertheless, he and I will talk more about it once we're off from work.",
          "id": 7,
          "comments": [
            {
              "score": 10,
              "content": "That you both had previously been talking like this to your waiter is relevant.  It sounded like you just decided to shit talk your bf to the waiter out of the blue. \n\nAnd yeah it's up to him to figure that out his insecurities. Losing in a video game is not something to get mad over. \n\nHope you two can talk it out and move past this.",
              "id": 8,
              "comments": [
                {
                  "score": -6,
                  "content": "Thanks for your explanation. I will apologize in that I was pretty cold when he was sharing his feelings as to why he was upset. \n\nI should have made it clear that we know the waiter, we're regulars at that bar, and we both were joking/ shit talking with the waiter. I just happened to be in the advantage point of winning at that time, so yeah, I was a little cocky. \n\nHaha thanks for your help!",
                  "id": 9,
                  "comments": [
                    {
                      "score": -3,
                      "content": "Don’t apologise to him. He needs to get over himself.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "YTA. So shit talking is fun when you’re playing a game, but you shit talked him to the waiter effectively embarrassing him publicly, you took it too far.\n\nNow when you’re embarrassed and annoyed it’s hard to get out that disgruntled headspace so I understand why he got into a bad mood. Yes, he should not have been as butt hurt as going off about the character and what have you, but he eventually recognized he was being shitty and apologized. The reason this is YTA and not ESH is because he recognized he was being an ass and apologized, whereas you refuse to apologize for embarrassing him to the waiter. Just seems like you took it a step too far there and should apologize",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "NTA. This particular type of gamer guy is super annoying. Like, keeping the shit talk between the two of you rather than including a 3rd party (the waiter) would have been more mature, but his response doesn’t seem especially called for either. So NTA, with that small caveat.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "YTA with mild ESH.\n\n&#x200B;\n\nHim - Being a bad sport and trying to \"over-explain\" his losses rather than take the hit. \n\nYou - Not so much the shit-talk with waiter (if that's how you roll) rather the part where he recognised he climbed down and explained why he behaved the way he did (apologising) you made a point of talking about why you're not going to apologise and (based on what you typed) did not acknowledge his point at all.\n\nYou said you weren't going to apologise for his ego being hurt by being beaten by Kirby (that's not what he told you when he apologised)\n\nYou said you won't going to apologise for comments you normally make (that's not what he said either, he said it's the way it made him feel)\n\nYou said you're not going to appeal to his authority on the subject (nothing he said even relates to that).\n\nTo me you're adopting a very hard \"i'm not wrong, you're wrong\" position rather than showing a little gbit of grace and it's making you the asshole. You essentially ignored what he said (about his feelings) and made it about how you have a point of \"not apologising for something i'd normally do\". Even if you normally don't refrain from such, in this instance he mentioned it bothered him, and you just said essentially that you don't care.\n\nIf both of you spent more time listening to each other than trying to \"win\" you may find things a bit smoother. There is no weakness in accepting than another's attempts to \"climb down\" is an opportunity to diffuse the situation and put it to bed, but you instead used it as an opportunity to reiterate how you were \"right\", and won't climb down, and he wasn't. That's pretty obnoxious honestly.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "ESH. You guys are both too petty and competitive in your relationship. He should have just let you have your victory without downplaying it and you should’ve kept the trash talk between the two of you. He already apologized, so what are you trying to gain by posting this?",
      "id": 14,
      "comments": [
        {
          "score": -10,
          "content": "What's to gain? I'm asking if I am the asshole.",
          "id": 15,
          "comments": [
            {
              "score": 8,
              "content": "Okay, smart ass. What is the utility of this to you or your relationship? Will the consensus inform how you move forward in your relationship? Should it? Is it purely out of curiosity? Or are you looking for reaffirmation? These are questions for you to answer yourself.",
              "id": 16,
              "comments": [
                {
                  "score": 7,
                  "content": "I'm sorry haha. I'm still high off being an asshole from yesterday. I'll think on these questions, but seriously, hearing people explain why I am TA or why ESH really has helped me. My boyfriend and I will have a conversation later on today once we're off work.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Hope it goes well.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "YTA. It seems like everything was fine until you started shit talking him in front of the waiter. There was no need to make it public, as he didn’t do the same to you. You started it, then he reacted poorly to it, but the last paragraph shows no remorse because you’re mad he didn’t let you trash talk in front of someone else freely. That’s hardly submitting to his authority, that’s just you publicly shaming him and refusing to feel bad about it since you didn’t like how he retaliated",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "YTA. You think you have more of a right to be annoyed when you made fun of him in front of the waiter? Anyone who does that to their SO in front of a stranger is an AH. He made a show by saying something loudly?? While you talked that sh*t to him in front of the waiter? You are a bad sport, he got defensive when you tried to publicly shame him. He apologized but you owe a larger apology, he was totally fine losing until you started purposefully shaming him to others. I tolerate shit talking among friends, in public, we show each other more respect than that.",
      "id": 20,
      "comments": [
        {
          "score": 1,
          "content": "I added an edit because of your response. \n\nIt seems like a lot of people are pretty upset by the shit talking because i did it in front of the waiter (public shaming) and that my post isnt clear on if I was the only one talking shit in front of the waiter. It might read that I was the only one, but I was not. We both engaged in shit talking in the presence of the waiter. What I said, within the circumstances of the game, just seemed to cross the line. Which is why I brought up the ego part, the amount of times I've lost and endeared the shit talking... it doesn't phase me. But I actually won for once and I'm the asshole for dishing the shit.\n\nI'll admit for being cold to his feelings about feeling embarrassed, but I'm just not being sold on being more of the asshole because I talked shit and won.  I am interested on people's thoughts though.",
          "id": 21,
          "comments": [
            {
              "score": 3,
              "content": "“He was proud and it was fun” even with the shit talking. Then you brought the waiter in on it. \n\nThere’s a difference between talking shit to each other in front of the waiter and talking shit about the other to the waiter. \n\nDoes he regularly make fun of you to the waiter or to other people when beating you or in any other circumstance?",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH. You both sound 12.",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}