{
  "post content": "This situation is complicated and I’m at my wits end. I have 2 daughters who are civil to each other but don’t get along with each other. My eldest is married to Steve while my youngest is engaged to Adam. Steve and Adam are so different they disliked each other the first time they met.\n\nSteve works part time because he treasures family time with my daughter. They spend their time traveling and exploring different parts of the states. He spends freely because he often say he can’t take his money with him when he dies. \n\nAdam is an executive and for his side business, he owns several dozen properties. He works about 80 hours a week at both jobs because his philosophy is that he wants to make as much money as possible while he’s young so that he can retire early.\n\nSteve thinks Adam is a corporate shill and basically blames him for everything that’s wrong with society. Steve said that Adam is actively keeping people from buying homes and making them dependent on him. Adam thinks Steve is a slacker and have told Steve people like him who does the bare minimum but expects hand outs are what’s wrong with society.\n\nNeither of them are bad and they treat my daughters well. \n\nI retired last year due to my health so Adam built a house for me so that I can live comfortably. I was able to customize everything in the house to fit my taste. Adam owns the house, pays for all of the utilities, and charges me $1 a month for rent. Part of our deal is that no one else can live in the house but me. He was very clear about this.\n\nSteve recently lost his job so he and my eldest are living off of her single income. As you can imagine, they are struggling. My eldest recently called me crying because their savings are almost gone and they can’t make next month’s rent. She asked if she and Steve could move in with me until he finds another job. I live on a fixed income so I don’t have money to set them up in another apartment. She’s my daughter and I couldn’t let her be homeless so I let Steve and her move in. I gave them strict rules and a time limit on when they had to move out. I didn’t think my youngest and Adam would find out because they live in another state but somehow she found out. She called and screamed at me last night for betraying Adam’s trust but I argued that I’m a mother to 2 daughters and I can’t let one be homeless. I told her about the rules and time limit and begged her not to tell Adam. She hung up on me so I don’t know what’s going to happen.\n\nI know I went back on an agreement but I had a good reason.\n\nEdit\n\nI couldn’t add many details in my original post because I was afraid of going over the character limits. \n\nAdam pays the taxes and utilities on this house but because it’s the only house he has in this state, he keeps its financials separate from the rest of his properties. Also, he doesn’t really have anything to do with the house. Instead, he gave it over to my youngest to take care of so she handles all of the bills and maintenance and pays them out of an account he set up. She noticed the increased utility cost which is when she called. \n\nWe just spoke again and I laid my soul bare to her. I knew I was going back on our agreement but it was to keep her sister from being homeless. We had a lengthy conversation and in the end, she agreed not to tell Adam. She’ll cover the increased utility cost out of her own pocket so he won’t notice it. In exchange, her sister and Steve will have 3 months then will have to move out. I originally told them they had 6 months. \n\nI’m lucky to have such a compassionate daughter. Thank you for taking the time to read my post. Some of the comments were very hurtful but some were helpful. You made me realize I should have called my youngest at the start and asked. That would have saved alot of tears.",
  "id": 1,
  "comments": [
    {
      "score": 19084,
      "content": "YTA. I’m sorry but Adam is doing you a favour by gletting you live in this house and he gave you one rule so he’s not taken advantage of and not only did you break this rule but you did so by allowing the person who insults Adam to live there.\nYour daughter and her husband want to live by the values they have fair enough but they need to be able to have money to back that up. If by Steve losing his part time job they are in this much trouble then they didn’t have the money to spend freely and go travelling to begin with.\nYeah you have two daughters but at the end of the day the person who owns this house has no obligation to house your adult daughter and her husband and honestly you so if you loose your home because of this then you only have yourself to blame.",
      "id": 2,
      "comments": [
        {
          "score": 14311,
          "content": "I feel Adam set up that rule because he knew this was going to happen.",
          "id": 3,
          "comments": [
            {
              "score": 7004,
              "content": "He totally did. I mean this guy works part time and is clearly not responsible with money but then slags off Adam for being what’s wrong with the world, when in fact Steve is the problem expecting to put very little effort in but then reap rewards. He knew he was going to come with his hands out.",
              "id": 4,
              "comments": [
                {
                  "score": 5089,
                  "content": "Steve should stick to his values and not live in a \nHouse built by a corporate shill 🙄 (sarcasm)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4388,
                      "content": "Steve should stick to his values and not live in a House built by a corporate shill 🙄(No sarcasm) ¯\\\\\\_(ツ)_/¯",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1129,
                      "content": "No see Steve only thinks Adam is a corporate shill when Adam’s money doesn’t benefit Steve. If it benefits Steve then it’s totally not being a shill.  Or something…🤦‍♂️\n\nEdit to add:\n\nIf Steve thinks the house was built using money that he believes was ill begotten, he should refuse to live in the house on principle.  He won’t do that because he’s a schmuck.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 54,
                      "content": "OMG….I literally screamed!!! 🤣🤣🤣🤣😂",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I know so many narcissistic enlightened types who use their moral high ground as an excuse for not providing for their families. It's usuallly only due to understanding (enabling) friends and family they get to carry on with this shit.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Nah. No sarcasm.\n\nIf you're going to insult someone, you should not expect to live in their house.\n\nI hope Adam's wife did tell him and he's just not pushing it. Otherwise you are risking the mother's home and a daughter's marriage for a slacker who has a life philosophy that he canr backup. The risk outweighs the benefit.\n\nIf I were Adam, and I found this out later that my MIL, SIL, BIL and wife were playing me for a fool- I'd file for divorce. Lying, in any magnitude, is unacceptable. Breaking the one rule- unforgivable. He should be presented with the Steve and SIL situation and HE decides for HIMSELF if it's ok.\n\nFTR: I am married and have been for over a decade- My Trust is not earnable. I have cut out people for smaller lies.\n\nSTEVE IS A SELLOUT.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 935,
                  "content": "Wanting to spend time with family is admirable. Spending money freely while working part time is not. Steve was unwise and financially irresponsible and either had no plan for if something happened or planned to just have other people help him. Steve basically spent money he didn't have and risked his family's security.\n\nI very much suspect as has been said that Adam saw this coming. OP is using someone else's generosity to help other people, and in particular someone who has spouted nothing but vitriol to the owner of the home.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 636,
                      "content": "> Spending money freely while working part time is not. Steve was unwise and financially irresponsible\n\n100% this. \n\nOP is blind to the fact that Steve is a financially irresponsible person. And has the audacity to be sanctimonious about his frivolous ways.\n\nWhen the foolishness of Steve's irresponsible ways finally catches up to his family, he uses MIL to sneak into one of Adam's houses.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 295,
                      "content": "When OP said work part time to spend it with family, I had imagined inclusive of kids.  All bs drivel since the wife works full time, so how exactly is he spending extra time with her when she’s at work and he isn’t.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 207,
                      "content": "And now OP has convinced her eldest daughter to actively deceive her spouse for three months in the name of providing the youngest daughter and her irresponsible and sanctimonious husband with a roof over their heads in the home that Adam provides to her for free!    \n\nI feel like this can't possibly end well for anyone involved.  \n\nSomeone needs to give Steve a swift kick in the rear to go get a job, *any* job.  And he needs to be shut down the next time he makes snide comments about profiteering capitalists to Adam (whose success in business is preventing Steve and company from being homeless).",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 136,
                      "content": "Everything is a choice in life.  Steve’s approach to work life balance is just fine…as long as he accepts the conditions that come with that choice.  Unfortunately, his taste and spending doesn’t seem to match.  And it’s not people like Adam who are responsible for that-Steve needs to look in the mirror and open his eyes.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "  Op's daughter definitely needs to tell Adam, asap,  otherwise she risks the relationship with her own husband, and op needs to re-evaluate just how well Steve has been treating her daughter, since the daughter has been working full time and Steve part time, and they are about to become homeless.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "Yep, it’s fine for a couple to balance 1.5 jobs if there’s a savings cushion or a solid plan to cut expenses and live lean if necessary for a little while. Lots of people live kind of downshifted like this and make it work with self sufficiency and a clear-headed plan about how to increase their income if they need to. They should not have been this thrown off by the part time person losing his job.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Adam was 100% correct in his assessment of Steve, a person not even doing the bare minimum to be a useful member of society and expecting hand outs from others when something bad happens. I'm also wondering if he lost his job because his unwillingness to work was showing through at his work, and he was just be a lazy incompetent worker. They probably got stick of him taking lots of time off to travel and barely working part time. He probably would just be like \"hey boss, I'm taking off for a next starting tomorrow. That's fine right?\" The boss probably talked with him and gave him warnings, which he ignored and then to nobody's surprise (except maybe his own) he was fired.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "And now OP her daughter to betray Adam too!! This is not going to end well.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Also I’m curious about that setup in the first place. He uses the excuse that he values time with his SO as to why he doesn’t want a full time job… but was his wife also working part time? Or was she working full time? Because that would just negate the benefits. He wouldn’t be seeing her any more than if he had a full time job anyway!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 216,
                  "content": "I mean...  Adam is partly what is wrong with this world...  but that doesn't mean Steve is doing things right either.\n\nOP is the AH because when you're an adult, and someone gives you the gift of an essentially free house, you have to suck it up and live by their rules, or move out and find your own place.\n\nMy husband and I follow a similar life attitude to OP's older child.  We work enough to be able to do what we want to do NOW, instead of over working now in the hopes of doing what we love later...  but we don't spend freely, we tightly budget to make sure we're in an acceptable financial situation.\n\nWe take more vacations than most, often taking long weekends, or taking an extra day or two off in conjunction with holidays to stretch 4-5 days together.  At my husband's last job that often meant taking un-paid vacation days...  and I've always had hourly jobs, and rearrange my schedule as needed (my employers know not to turn down a request off because I'll just quit, and I'm a good worker and they don't want that, so they figure it out).\n\nIt's not Steve's worldview that's inherently the problem, it's his execution.  You can't live like he wants to while spending freely, being the type of worker that gets fired when essentially everywhere is under staffed (I'll give him an exception if he was working for Google, but I doubt he was), or ending up in a position where you are begging your in-laws for things like housing.\n\nSteve needs to get his head out of his rear end, because he's making the rest of us look bad!",
                  "id": 21,
                  "comments": [
                    {
                      "score": 136,
                      "content": "[deleted]",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 139,
                  "content": "[removed]",
                  "id": 23,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I just love that her username is \"fairmom\". Like, how is she being fair by getting her daughter in trouble by breaking the one rule she had?",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 100,
                  "content": "And Steve does not want Adam to know about it while denouncing his world view.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": ">I mean this guy works part time and is clearly not responsible with money\n\nBut notice how OP paints Steve in such a wonderful light:\n\n\"Steve works part time because he treasures family time with my daughter\".\n\nHa ha haaaa ! Steve works part time cause he's a SLACKER !!! :)))))",
                  "id": 26,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah and like someone said how is spending time with family by working part time when the wife works full time so she’s not even home",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 230,
              "content": "Yup & Steve likely won’t reach a point of being able to provide this for his wife’s mother. Adam is responsible & trying to create stability for the mother’s future on a limited income.",
              "id": 28,
              "comments": [
                {
                  "score": 372,
                  "content": "Here’s my INFO: when Adam evicts you, is Steve going to put a roof over your head?",
                  "id": 29,
                  "comments": [
                    {
                      "score": 67,
                      "content": "🥇🥇🥇the question OP needs to be asking herself!",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 218,
              "content": "Adam set the rule to PREVENT this from happening.",
              "id": 31,
              "comments": [
                {
                  "score": 22,
                  "content": "And it didn't work because he cannot trust OP. Very, very obviously OP can't be trusted. And just in case breaking their deal was not enough, OP got their daughter to omit/lie to her fiancee (not yet husband), which is definitely be a huge problem once the truth comes out. Adam is going to double betrayed, by OP and by his fiance (not yet wife).\n\n\n\nEdit: fiancee/husband, fiance/wife",
                  "id": 32,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah. OP, her SIL, and her two daughters may end up killing the golden goose.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 163,
              "content": "Yep, and depending on how long they have been there, he may have to go through the courts to get them out. I can totally see those two refusing to leave regardless of the \"strict timeline\"",
              "id": 34,
              "comments": [
                {
                  "score": 117,
                  "content": "Agreed. That strict timeline will turn into “we just need a few more days” to “next month” and before you know it, they’ve been there a year. I feel for OP, I do. But Steve doesn’t strike me as someone who’ll be quick to let go of a free place to crash.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I’m cynical enough to expect a totally unplanned, super surprise pregnancy just before the move-out deadline.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "There are endless posts here about people letting ne'er do wells move in and the ugly consequences.  This is just another example.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yes, if they're there for 3 months like OP's edits indicate, they would legally need to be evicted in most states.   The courts are so backed up from the pandemic eviction moratoriums that they could stay there for a year or more without paying a dime before being evicted - likely along with OP for good measure, since she would be the one who moved them in.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 7,
                      "content": "And what happens to sisters marriage when Adam finds out.  Because you know good and well he will find out, because sister two and Steve ain't never leaving a rent free situation with a pushover.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This is 100% what is going to happen. They’ve already established tenancy. It’ll take them a year in court to get evicted.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "that was my first thought.  \n\n\nAdam gonna find out when he, as the legal owner/landlord, finds out.  No way he doesn't.  They'll visit at some point.  \n\n\nThis is just the beginning of what will be a huge mess.  If I were Adam, this is a huge breach of trust and might be a marriage ender.  Momma and both sisters done messed up.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "That is exactly what he did! I knew from reading what was going to happen. Steve is a acting really immature so of course his part time work wouldn’t work out.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Ding ding ding! This is it. That rule was in place to avoid this exact situation. I’m sorry, OP, but YTA. You always love your children, but when they’re adults, you have to eventually let them figure out their own solutions without bailing them out.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He absolutely did. I have a similar arrangement with my dad so his “grown” stepdaughter doesn’t keep mooching off him",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 839,
          "content": "Steve and your daughter are adults. They are responsible for monitoring their own budget to keep a roof over their own heads. \n\nThey chose to let Steve skimp on the work side and to have your daughter be the main breadwinner. They chose to spend their money recklessly and to not save much or invest. \n\nSteve may have been laid off, but if they had time to burn through the meagre savings they did have…well, then Steve had the time to find any job that would have allowed him to contribute to the family coffers.\n\nSteve has invested quite a lot into insulting and demeaning Adam for his work ethic and goals. Steve likes to look down on men like Adam and claim the ‘moral high-ground’. \n\nBut now Steve sees an opportunity to mooch off of Adam’s generosity and hard work…but not have to ‘lose face’ by directly asking Adam for money. And he and your daughter don’t care that this way would jeopardize YOUR financial stability or housing. \n\nYou could have shown your youngest daughter and Adam some respect and gone to them to ask permission (outlining the terms and conditions) but instead, you played favourites and tried to do this ‘under the radar’. That would have never worked…because either Steve and daughter would stay forever…or Steve would eventually throw it in Adam’s face that Adam was financially supporting Steve without knowing it. \n\nBottom line: YTA and Adam and your youngest daughter deserve better.\n\nETA: Your update makes your situation a bit worse, not better. You’re patting yourself on the back…for guilting your youngest daughter to lie (by omission) to her fiancé in order to cover for you and your eldest daughter’s deception. You’re now jeopardising her relationship and HER stability/future in addition to your own. 🤦🏼‍♀️",
          "id": 45,
          "comments": [
            {
              "score": 191,
              "content": "Grasshopper and the ant. Grasshopper plays instead of preparing for winter because he can do it later, but when winter comes he is not ready and asks to benefit from the ant's hard work preparing for winter.",
              "id": 46,
              "comments": [
                {
                  "score": 20,
                  "content": "This. I suddenly became unable to work at 45 with a decent mortgage. But my investments and savings and the fact I never allowed myself the nice cars I always wanted because I was saving for later meant that I was able to pay off the mortgage and keep the home. Luckily in the UK I can live off disability benefit so my wife can care for me and our disabled son.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "\" 'Not I', said the little red hen\"",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "YTA\nIt will escalate into Adam finding out, having a fight with his wife and everyone ending up homeless. Not only did OP broke Adams trust, she is also ruining her youngest daughter's marriage.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I find it interesting when a healthy young male has the opinion that him being required to work is what's wrong with society. If children, mentally ill, or elderly who are unable to work, are homeless then that is a problem that society should be able to support. But who does a young healthy male expect to do the work, if not him? If we live in a society where everyone is equal, HE WILL STILL HAVE TO WORK. Who does he expect to build and maintain the infrastructure....we still need plumbers, carpenters, roofers, sewer maintenance, loggers, farmers. Does he expect all the other young males to support him while he stays home with his daughter? I get it's hard that it's a bit of a dog eat dog world, where some thrive and some succeed... But thinking that you deserve a life where you don't have to work hard is pretty selfish.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Absolutely agree with this. OP, YTA, and just made it worse by making your other daughter lie to her fiancé. I wouldn't blame Adam for thinking that the entire family is now trying to take advantage of his generosity and financial stability.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "OP is going to get herself evicted by Adam and her daughter dumped for lying. Then they are all going to be homeless, and of course Steve is not going to help our, even if he has a job, because, you know, he can't afford it and it will be a good time for them to learn to live with less, they should take the time to travel, etc... Steve is a lazy leech and they all are supporting it and letting him leech off of the person he looks down on for actually working.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Like now the youngest is lying to her husband and thats not right either. Like this whole thing is messed up. \n\nLike you cant scream about how one person is the bane of the world and then mooch of said bane and not expect repercussions.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It wouldn't surprise me if Steve started hostilities and Adam got annoyed enough to snipe back. I'm not condoning Adam's sniping but he has a far better grasp of actions and consequences.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yes. The edit is worse. OP is digging herself out by having her other daughter lie to her husband!!! Now she's interfering with their marriage, too.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 339,
          "content": "[removed]",
          "id": 56,
          "comments": [
            {
              "score": 207,
              "content": "Pound to a penny I bet the reason Adam did it this way was because he knew that even though he put all the money into the house and doesn’t charge OP anything really, that if he signed over the house to her she would with sign it straight over to the daughter and SIL or they would get it when she dies because the other daughter has Adam.",
              "id": 57,
              "comments": [
                {
                  "score": 39,
                  "content": "This really isn’t emphasized enough in the other comments. I’ve lived a similar situation for over a decade - my husband (then boyfriend) bought a house for his mom because they grew up so, so poor and he only ever wanted to know she’d have somewhere to live. It was hell - she constantly insisted she could buy it (she couldn’t) and tried to get her usury daughter to move in multiple times ( we had a lease she’d be violating and she knew it). Well she ended up buying a house (from the same daughter who became a scummy realtor) that she can’t afford and has begged us to sell the house we bought and give her the money. Something is wrong with you, OP. Why would you want to jeopardize your daughters marriage by lying? \n\nOh and YTA.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "That and he probably is paying a mortgage on the property. My friend is \"building\" her own house (ie. getting her house built to her specifications) and it absolutely involves taking on a lot of debt\nIt would be absurd to sign over the title. He's a young man, it's a young relationship, and they're not even married yet. Can you imagine continuing to pay a 30 year mortgage on a house that belongs to the mother of a woman you broke up with 25 years ago?",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 135,
              "content": ">Fast food restaurants are literally begging people to apply with starting pay of $15+ an hour and 4 figure signing bonuses\n\nOh, but a job with a schedule will get in the way of Steve's family time that he values so much and his freedom of travel and spending... /s",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 254,
          "content": "Absolutely agree.  OP - YTA in a big dishonest sneaky way.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "Well, well. If it isn't the consequences of Steve's actions",
          "id": 62,
          "comments": [
            {
              "score": 120,
              "content": "EXACTLY.\nI don’t get all these people trying to portray him as the victim of the economy, he CHOSE to work part time, he has no savings because he CHOSE not to have them, he didn’t spend his money of necessities and then struggled, he spent his money on wants whilst IGNORING his needs.",
              "id": 63,
              "comments": [
                {
                  "score": 12,
                  "content": "Also not mentioned why steve cant move in with his parents (theyre tired of his freeloading and cut him off which is why he had to get with daughter).  You’d think he’d have some friends with all his free spending, but i’m guessing he isnt generous on spending money on his friends either and just freeloads off everyone.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "Oh dear, everyone needs to stop enabling and coddling Steve. He's financially irresponsible, that stops being cute and charming once you have a family to take care of.\n\nIt's extremely generous of the other daughter to allow them to stay for three months....But we all know Steve is *never* going to leave willingly. And Adam *will* find out sooner than later, especially when an eviction is necessary. \n\nYTA",
          "id": 65,
          "comments": [
            {
              "score": 14,
              "content": "I think this needs to be noted. Steve does not treat her daughter well. He is failing as a husband not able to provide enough to keep a roof over their heads. And this isn't a new concept from modern capitalist slavery. Even though the idea is as old as life itself, human pregnancies are worse than those of other animals, and human children are more vulnerable than other animals. Providing for your family is a concept as old as humanity and he needs to man up because, well he's a failure as a human.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Adam will find out when he gets the bill for the power and water and sees it's risen beyond the point a single person's actions. This plan also has more holes in it than a slice of swiss cheese, Adam could come by and it would be hide all evidence of Steve (and I don't trust Steve not to do something to spite the \"shill\").",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "And she's the asshole for hoping to get her daughter to lie to her husband.  Wants to risk ending her daughter's marriage for the comfort of the other one.  Stupid too,  because the marriage goes, so does the free house",
          "id": 68,
          "comments": [
            {
              "score": 12,
              "content": "That the worst part. I would have told my husband before confronting my mom. We don’t keep secrets.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 71,
          "content": "100% well said👏👏👏",
          "id": 70,
          "comments": [
            {
              "score": 526,
              "content": "[removed]",
              "id": 71,
              "comments": [
                {
                  "score": 232,
                  "content": "And Adam is not even married to her daughter. Just engaged. OP's dishonesty could jeopardize her daughter 's relationship with her fiance. To save one daughter she actually risked another.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 76,
                      "content": ">!OP's dishonesty could jeopardize her daughter 's relationship with her fiance.\n\n\nThat's one of the layers of OP's betrayal.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "This is huge. If Adam finds out his fiancée is lying to him, I would be shocked if he didn’t call off the engagement. Breaking trust that badly is a terrible omen for a marriage.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "It will compromise her younger daughter’s relationship. She’s gotten her youngest to collude in a lie to her fiancé. So they’re both liars now. Oh and I’m sure Adam will find out, either before or after (if they do actually leave). Does anyone think Steve can keep his mouth shut? /s",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "One daughter I am willing to bet she never set rules or limits or held her to any accountability.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Be clear - NOT to 'save one daughter' - THAT daughter works FT, and likely can support herself.  It's her lifestyle with husband STEVE she can't support.  Or can, but doesn't have to, because OP has no integrity, cannot be trusted to keep her own word.  YTA.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I had the same thought. He might break off the engagement thinking he can't trust her since she lied to him about it. Not to mention he might not want to be part of a family that's so disrespectful to ignore the one and only rule he set for the mother. He knows Steve is a low-life who expects everything to be handed to him, why he did that. She put her daughter in a horrible position and all she wants to do is defend Adam who could find another job in a day or two if he actually tried. There was no need to move out, he's just incredibly lazy.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Obviously she went back on her word and she is basically lying to her SIL but there is something WAY worse at play here. She just dragged her daughter into it by not telling her husband. Now if he finds out, not only is OP an AH but technically the daughter lied too. So OP is about to put 2 people on his shit list her and her daughter. Thats whats really fucked up here. These 2 are gonna fight and its all OP's fault",
          "id": 79,
          "comments": [
            {
              "score": 13,
              "content": "And the OP seems really happy about this compounded lie in her edit, like what a great agreement we have. What you have, OP, is the beginning of the end to your family as you knew it.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "YTA\n\nAdams one rule may very well have been foresight. If I were Adam to me it would be a logical step to prevent Steve specifically taking advantage. Knowing or feeling as he does about Steve and his ability to keep a stable lifestyle, it would be an easy latch to go to mom who has a house free and clear.\n\nSteve can't take money with him when he dies, but apparently he can't plan a budget or have a concept of savings in case of emergency (like losing his job or change of life circumstances). I wonder if Steve will learn anything about this experience about saving, or will he just perceive Adam as a problem that's kicking him out earlier how(entitled) \n\nI would like to think Adam would have enough compassion that if mom met a romantic partner or wanted visitors for a week or two here and there that it would be ok. Rather than enforcing living alone or loneliness, just her and an empty house. \n\nWould be interesting if OP would provide context on Adams one rule, if she knows. Or if she herself now recognises Adams one rule was ultimately to protect OP on her fixed income. \n\nYTA simply for not asking Adam since it's the only thing he ever asked after building you a house and managing all expenses and customizing the house for you. he has ensured your comfort in retirement at his personal cost. He has kept this property separate from the rest of his business? I wonder if that's a white lie, and he personally manages it from his income outside of the business accounts. \n\nOP also important to know, I can empathize with you helping your daughter and Steve, your intentions are well meaning. But if Steve and your daughter don't change their lifestyle and financial management it'll happen again and again. \n\nMake sure this is a one time deal, or you'll burn bridges with your other daughter and Adam.\n\nYou're also best to come clean to Adam, a lie by omission is still a lie, and now you have your daughter(his partner) lying to him too. Come clean, don't cause problems in their marriage with Steve's instability and your decisions.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6810,
      "content": "YTA. You went back on an agreement that you made. Why didn't you call your youngest and tell her the situation instead of going behind their back?",
      "id": 82,
      "comments": [
        {
          "score": 2377,
          "content": "Because she thought they wouldn’t find out and would never have told them , which makes her a bigger AH",
          "id": 83,
          "comments": [
            {
              "score": 478,
              "content": "Exactly. That's the part that reallly gets me about this situation.",
              "id": 84,
              "comments": [
                {
                  "score": 193,
                  "content": "Whatever happens to honesty is the best policy?   Sorry but YTA OP. As someone with your age and wisdom she should know better.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 8,
                      "content": "She was going for \"it's better to ask forgiveness than seek permission\" apparently. She's wrong to do so.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "And now, the other daughter is lying to her husband and breaking that trust.  They all may be homeless soon - except Adam.",
              "id": 87,
              "comments": [
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It sounds as if Adam pays for all the bills, you think he wont notice she's using much more electricity, water, gas, etc?",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 547,
          "content": "[removed]",
          "id": 90,
          "comments": [
            {
              "score": 222,
              "content": "\"You can't take your money with you when you die, but I can take your money from you while we're still alive.\"",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 465,
          "content": "She didn’t call and tell them because she knew they’d say no. They put that stipulation on her living in the house alone because they probably knew this would happen. I can completely understand. It’s one thing for son in law to work his tail off to provide for his wife and MIL with health problems, but it’s a completely different story to work his tail off and be expected to provide for 2 additional able bodied adults that have no problem leeching off of him. It’s not like it was an emergency, something that happened suddenly. They saw their savings dwindling and did NOTHING but rely on abusing BIL’s kindness to their mother, assuming they were entitled to the same financial support. The fact that they have zero issue spending their savings, having no money for rent, crying and expecting family to bail them out is maddening. I’m in a similar situation with my brother. Refuses to pay for anything, makes double what I make and expects me to take care of him, bail him out and feel bad for him for things he’s caused for himself. (We’re in our 30’s, I have a child, am in college and work 2 jobs. Bro sees no issue with my bf meeting the financial gap that he causes for us and I’m always the AH) It hurts when u work urself half to death to have nice things and care for the ones that need it to get a slap in the face from the ones that expect it.",
          "id": 92,
          "comments": [
            {
              "score": 115,
              "content": "I have the same brother.  Prepping for another “lay down the law” convo with him today.  It’s miserable and so aggravating.",
              "id": 93,
              "comments": [
                {
                  "score": 22,
                  "content": "Right ??!!! It sucks because our whole lives we were best friends and he was a spoiled kid who grew into a spoiled man…I treat him like a roommate that is a stranger for the past 8 months that he’s been giving me problems. It blows my mind how some people can be so entitled and selfish. We were raised the exact same way with the exact same parents and we are polar opposites in the entitlement department. I find the “lay down the law” talks just cause temper tantrums so it’s easier to act like he doesn’t exist. As much as it hurts the both of us.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 8,
                      "content": "How does your brother make double what you do but can’t come up with his half of the household expenses and Why do you still live with him?",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "> They put that stipulation on her living in the house alone because they probably knew this would happen.\n\nYep. Adam knows his BIL and knows as a landlord that once a family starts living in your house for free, no matter how they got there, it can be difficult to get them out.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Geez. Stop doing it.",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I agree, if say the apartment complex had a fire or something out of their control. I can see it but only if they had called Adam first and asked if they could say with the mom temp while repairs are done. But this was all on them. They spent all the money, had no savings and it sounds like they've been there a couple weeks and somehow Steve still hasn't found a job, even one at a fast food place. He has no intention of working or leaving after 3 months. If they are still there he'll cry and say how hard he's trying and all the stuff he does around the house.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "Probably because she knew the answer would be no.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Particularly insulting to go behind their back after the lovely thing Adam did for OP. I mean he got her into a comfortable living situation when she fell ill! Not everyone does that for their mil!",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Plus, now with the edit she's convinced her daughter to hide this from her husband.\n\nHow betrayed is he going to feel by his wife when he eventually finds out (likely when Steve rubs it in his face next family get together)???\n\nShe may have fucked up her extremely generous living situation and ruined her daughter's marriage.\n\nThe two of them are basically tricking a man into paying the rent for a man that insults him to his face.\n\nYTA, and now you've made your daughter one too.",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "And shame on OP for wanting her daughter to lie to her partner - the owner of the home. Hopefully OP doesn't destroy her daughter's relationship.",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5279,
      "content": "YTA, I'd say your were going for the better to all for forgiveness than permission type, but you didn't even plan on telling Adam. Given how you describe Steve, I'm betting they won't be out by X date.\n\nETA: I have a feeling Adam set that condition because he saw this coming.\n\nEdit: Based on OPs edit how many people think Steve and sister will be out in 3 months? I predict we see youngest post in 3 months. \"AITA for not telling my husband that my sister and BIL moved in with my mom\" because hiding big things like this from your future husband totally never turns out bad, right?",
      "id": 103,
      "comments": [
        {
          "score": 1697,
          "content": "Adam definitely knew this was coming.",
          "id": 104,
          "comments": [
            {
              "score": 776,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 265,
                  "content": "I knew it was coming.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 250,
                      "content": "My imaginary girlfriend knew it was coming.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "My golden retriever knew it was coming.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 198,
              "content": "Yeah, OP thinks he’ll be more sympathetic because it was for family, little does she realize the rule was MADE for that family. Adam is kicking both of them out, and OP is going to trash her other daughter’s relationship over this, because OP’s kid now has to choose between her mom and her fiancé.",
              "id": 109,
              "comments": [
                {
                  "score": 44,
                  "content": "OP definitely knew Adam wouldn’t be sympathetic, which is why she snuck them in and is now asking her daughter to lie.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Yeah, which is just going to end in everyone getting screwed. OP is a lot of things I can say as I don’t want to get banned. I really hope Adam’s fiancée sees the light and comes clean.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "And the worst part is that OP is gambling on losing her house without being able to afford housing on her own. I hope that she starts looking for a part time job because what is her plan when inevitably Steve rubs it in Adam’s face? The fact that OP literally relies on her youngest daughter to support her means she’s in no position to offer support to anyone else. \n\nPersonally, I think she should have talked with her youngest daughter first and asked if she can take in her oldest daughter only. And Steve can go stay in a shelter or sleep in his car until he is back on his feet. I feel like he needs a harsher lesson to realize that he needs to build a safety net for himself because nobody around him is prepared to provide for him.",
              "id": 112,
              "comments": [
                {
                  "score": 62,
                  "content": "Actually, the worst part is that OP is jeopardizing her youngest daughter's relationship with her partner by asking her to deceive him on her behalf.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Exactly! She should've definitely asked if the daughter could stay and let Steve figure it out. He could crash on couches until he gets back on his feet. Now everyone is at risk of being unhoused",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "OP could well end up living in her eldest daughter's car, with Steve and the children.  Her youngest daughter might end up losing her generous fiancé.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 14,
                      "content": "OP didn't mention any children. I'd have more compassion for her if there were kids involved; we're talking about two able-bodied adults.",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Adam read Steve like a fuckin book.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "For sure. And it’s only a matter of time until the daughter tells Adam even though she said she wouldn’t.",
              "id": 118,
              "comments": [
                {
                  "score": 31,
                  "content": "And she should. Like, yesterday. Otherwise, she will be entering her new marriage with this huge lie hanging over her - one that she will have to sustain for the rest of their lives.\n\nIf I were Adam I'd be royally pissed if I ever found out, and I'd probably reconsider the relationship. All she is doing is demonstrating that she'll be dishonest and deceitful when it comes to her family. She can't be trusted.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yep, that is a huge potentially relationship ending lie.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "And she SHOULD. Keeping that secret will be horrible for their marriage.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 304,
          "content": "100%.  I said this in another comment but that edit made it worse!  He saw it coming, put down rules, they will NOT be out in 3 months (the men already have a strained relationship so there’s no way that Steve won’t be walking around like “well who cares that we’re not paying anything, he already makes so much and takes away peoples ability to own” and every other thing he’s already said, all the while working part time to not at all).  Then the cherry on top being that now the daughter is lying by omission to the one person in the family that they’re all dependent on.  Yeah, this will turn out great\n\nEdit to add: OP, if you are living on a fixed income to the point that you are only paying $1 a month and no utilities and still can’t afford to financially help them rent another place you need to understand how badly this could go for you.  You are a tenant breaking a lease agreement.  What if he finds out in 2 months and evicts you?! Right or wrong, you are completely and totally financially dependent on your landlord.  Do NOT put yourself in danger like this and it is insane to me that your daughter and son in law would ask you to.  Unless you have written consent from your landlord to move them in, do not do this",
          "id": 122,
          "comments": [
            {
              "score": 65,
              "content": "Not even by omission, she's using her own money to cover for the lie. IANAL but I do wonder what kind of liability they are putting on Adam also.",
              "id": 123,
              "comments": [
                {
                  "score": 17,
                  "content": "That's MY question! What is something happens? I'm sure the Insurance is set up for 1 renter! What if daughter or SIL is injured on the property? What if there is a fire and the insurance company refuses to pay?",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 155,
          "content": "They definitely won’t leave in three months. Steve will not have found a part-time job he is “passionate” about. \n\nAdam will find out. And when he does, he’ll sell the house and maybe divorce his wife.  The only way I see the marriage being saved as if they have kids.",
          "id": 125,
          "comments": [
            {
              "score": 162,
              "content": "Youngest is only a fiancé not even a wife yet. Adam could easily walk away from this relationship if he feels betrayed enough. And then op loses the house too.",
              "id": 126,
              "comments": [
                {
                  "score": 42,
                  "content": "Oh. Then it’s done for sure.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Oh god I missed that. \n\nThere was a tiny shred of \"well, I guess if they're married then technically daughter is half-owner of the house\", but nope. At this point I hope Adam finds out and removes himself from the lot of them.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "After what she did, Adam should walk.  They're not even married and she's lying to him.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 142,
          "content": ">Based on OPs edit how many people think Steve and sister will be out in 3 months?\n\nThe edits make it worse.  Now she's put her younger daughter in a horrible position and has got her lying to her husband.",
          "id": 130,
          "comments": [
            {
              "score": 60,
              "content": "Yeah, the younger daughter wasn't an AH until she agreed to lie to Adam. OP says she's lucky she has such a compassionate daughter. Some how I doubt Adam will feel this way.",
              "id": 131,
              "comments": [
                {
                  "score": 46,
                  "content": "Well duh, Adam is not compassionate. Yes, he put a free roof over his MIL's head, but he doesn't understand that his BIL is a free spirit who's not meant for work! /s",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 116,
          "content": "Spot on. He definitely knew especially with their ~~irresponsible~~ free lifestyle.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I just saw the edit too. She is really just selfish and now is probably gonna end up causing issues in her daughters marriage. If I was Adam I would be very upset at my wife for keeping something like that for me, It's not obviously not something I would consider divorce over, but I would definitely be very upset with her and her family and she would have damaged our trust deeply",
          "id": 134,
          "comments": [
            {
              "score": 41,
              "content": "As someone else pointed out, they aren't even actually married yet. So while it might not cause a divorce, it could make Adam rethink marriage.",
              "id": 135,
              "comments": [
                {
                  "score": 33,
                  "content": "Yep, OP has persuaded her daughter to prove to her future son in law that she can't be trusted. And future son in law sounds like he has his shit together well enough not to tolerate that.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 39,
          "content": "Oh for sure. And it’s reasonable that Adam doesn’t want to float this entire family.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "OP is manipulating the younger daughter to destroy her relationship with her fiancè. Adam will not be happy that his former future wife joined her entitled mom in defying his conditions while living in his house, and hiding that fact from him. The longer the lie stands, the less likely OPs youngest emerges with a SO.",
          "id": 138,
          "comments": [
            {
              "score": 14,
              "content": "And now I'm wondering if other daughter isn't the golden child and Mom is purposely sabotaging this relationship because if golden child can't have everything she wants why should scapegoat?",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Steve IS the problem with this world.....\n\nAccording to mainstream media, there are plenty of jobs to be had.  No reason to be unemployed.",
          "id": 140,
          "comments": [
            {
              "score": 13,
              "content": "I know it can vary by location, but surely Steve can find something? Fast food, convenience stores, and call centers are always hiring. Also a lot of manufacturing jobs. It could be enough to keep a roof over their head.",
              "id": 141,
              "comments": [
                {
                  "score": 14,
                  "content": "No, no, he *chooses* to work part time because he *values* family time. His values are so important to him that he just can't afford to house and feed his family without mooching off of others. You get it, right?",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Adam needs to leave WHOLE family, he seems very successful and goal oriented and is on a good path to retire early. And seems like a really good dude for giving his MIL a free house. I'm sad that everyone has betrayed his trust.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3683,
      "content": "YTA. \n\nYou're not renting. You're not paying any bills.\n\nYou had rules and you broke them.\n\nAdam is willing to pay for you, but not for anyone else.",
      "id": 144,
      "comments": [
        {
          "score": 904,
          "content": "Right, like how did she think they wouldn’t figure it out? The utility bill for one person is not the same as the utility bill for 3…and Adam is the one who’s going to receive that new, higher bill.",
          "id": 145,
          "comments": [
            {
              "score": 519,
              "content": "100% and I bet Steve isn’t one to watch utilities usage especially when he isn’t paying. With the price of everything this year- the cost of energy double or even triple in some places, Adam’s guna get some fat bills. Really goes to show- no good deed goes unpunished- in the end if you do something outrageously nice for your MIL you’ll end up paying for your deadbeat SIL and her husband too",
              "id": 146,
              "comments": [
                {
                  "score": 236,
                  "content": "Steve is 100% the type of person that is taking an hour long hot shower and leaving all of the lights on",
                  "id": 147,
                  "comments": [
                    {
                      "score": 35,
                      "content": "And adjusting the thermostat because he cant be cold while sitting at home on the leather couch that adam bought.  Blankets are for corporate shills!",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Of course he wouldn't watch his utilities usage. He likes to live his life freely ~~off the backs of others~~",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "Even worse! Younger daughter has agreed to pay the difference out of HER pocket so Adam won't find out as she's not going to tell him. She's taking care of her mum but told her they HAVE to be out in three months, not six. Still not fair that she's paying though, mum should paying the difference. It's her fault, not her younger daughter's.",
              "id": 150,
              "comments": [
                {
                  "score": 151,
                  "content": "So between the 3 of them they can’t even afford to pay for the increased utility bills??? This is a mess. I highly doubt they will be out of there in 3 months.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Surely OP could contribute to the extra utility expenses, even if the elder daughter and Steve cannot? She is currently paying $1 with no other expenses except for food and travel... why is she letting younger daughter foot the extras out of her own pocket? Something is smelly here...",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": ">Adam won't find out as she's not going to tell him.\n\nHere's another thing, OP is literally forcing her daughter to LIE TO HER HUSBAND FOR HER! Does anyone understand how fucking terrible that is of OP to do to her daughter? Now she'll feel guilty, and when the truth inevitably comes out, what if Adam leaves her? Now you have another struggling daughter to take care of on your \"fIxED rEtIReMenT iNcOMe\". YTA OP and I hope Adam and your daughter can mend their marriage when he finds out he was taken advantage of by his in laws and lied to by his own wife",
                  "id": 153,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Fiancé, not husband.\n\nThe wedding won't go through.",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "And when her sister and Steve don’t leave in 3 months, and need to be evicted, it’s going to blow up in her face and show her fiancé that she can’t be trusted. Younger daughter needs to tell Adam immediately; she’s chosen a side against him and it’s not going to work out well.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "The fact that the younger daughter just seems cool with hiding all of this from Adam - you know, her fiancé - is deeply troubling to me. I don't see it being mentioned much in the comments. It sucks that OP put her in this position but keeping something like this from your spouse when they're helping your mother out already, and sneaking around behind their back to do it seems wrong to me.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Mother emotionally blackmailed her younger daughter. I feel pity for her.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "The youngest daughter is about to lie to her husband. He will find out, and their relationship will be ruined, trust destroyed, and mom and daughters will all be homeless. The youngest daughter needs to tell Adam immediately! He gets to be right that he called it, and they can make an agreement upfront. No other way does this work out without both daughter and mother being homeless because Steve thinks his time is more valuable than stability or housing, apparently. I am calling it as everyone is going to be homeless. Except for Adam, he will just have trust issues and a house to sell.",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "And the profile name....OP clearly thinks this is fine.  The post will probably disappear shortly.",
              "id": 159,
              "comments": [
                {
                  "score": 95,
                  "content": "Calls herself fair mom while expecting the younger daughter to cough up the difference in power usage to cover the fact they're living there! She's agreed not to tell Adam but has to pay the difference so he doesn't notice. Why isn't mum sending her that cash? She agreed and broke that one rule, not her daughter!",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Just noticed that! Wow! The nerve",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "It’s important to clarify, Adam was probably willing to pay for other people, but it’s obvious the rule was made so Steve didn’t get help. This was THE person he wasn’t willing to subsidize, and OP is fucking horrible mother for putting her OTHER daughter in a situation where now she either needs to leave her mother to fend for herself, or cause a rift in her own relationship.",
          "id": 162,
          "comments": [
            {
              "score": 114,
              "content": "The daughter agreed not to tell Adam but has to cover the difference in the power bill herself to hide it from him. And she called herself Fairmom? Even though her younger kid is jeopardising her relationship with her husband to protect her mum. Those two better be out in the three months she's given them! Mum wanted to give them SIX months! The liberty!",
              "id": 163,
              "comments": [
                {
                  "score": 25,
                  "content": "Yeah….. OP needs to kick Steve out, otherwise Adam will leave her daughter when he finds out about this sort of betrayal.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "It sounds like OP and Steve have a lot in common. She feels so entitled to the handouts she’s been given, that she actually considers herself “fair” for deceiving and trying to steal from the people who have gone so far above and beyond to help her out. She’s too dense to realize that she’s offering resources that aren’t hers to share, and she has zero issue with forcing her other daughter to risk her relationship and pay extra to support additional free loaders out of her own pocket. Hopefully younger daughter comes around and tells Adam before it’s too late. YTA.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Yeah. The next post will probably be “my daughter lied for me and her fiancée found out and called off the wedding. Now we’re homeless: AITA?”",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": ">You're not renting\n\nThis.\n\nOP, reframe this - You are not renting. You are a GUEST in your future son in law's house. Only a guest. Guests do not get to decide other people move in. He has given you freedom to live there without financial worry but you threw away his kindness.\n\nYTA",
          "id": 167,
          "comments": [
            {
              "score": 31,
              "content": "If I could pay $1/month to live in their home, I would follow every reasonable rule they gave me. And if they had unreasonable rules I wouldn’t move in. \n\nNow that I think about it, Steve probably didn’t lose his job. He quit knowing that Fair Mom over here wouldn’t let her older daughter and husband live on the street",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "This is the way OP needs to look at it.\nWhy would Adam want to pay for Steve’s family’s living expenses?",
          "id": 169,
          "comments": [
            {
              "score": 19,
              "content": "100% YTA, so is Steve. You made an agreement. You accepted the terms of living in this house, when you didn’t mean it at all if you knew you’d never let your child go homeless. You never should have said yes. \nAdam sounds like an extremely generous person. Not even married to your daughter yet and built a house customized for you? And you took advantage of that. You want to be generous with someone else’s property. Go move into a new place with Steve and your daughter if you don’t want them to be homeless, so Adam can sell or rent his place. Or pay Adam a proper rent if you want the right to move anyone else in. \nStop spending other people’s money.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "The kicker is that this may piss off adam enough that he makes OP’s daughter choose him or her. Both daughters and OP might be homeless in the end all because OP wants to support another family that she can’t even afford. What a dumpster fire.",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Even if she were renting she still would need to ask the landlord permission to move new people in.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2479,
      "content": "Awww Op I can understand you wanting to help your eldest daughter but you did the 1 thing you weren't supposed to do. YTA. I'm betting Adam figured this would happen eventually and that was why he made that 1 rule. \n\nSteve is irresponsible.. if he only worked part-time then I'm failing to see why he hasn't found another job already to keep him and his wife from becoming homeless.",
      "id": 173,
      "comments": [
        {
          "score": 1021,
          "content": "I feel Steve saw dear MIL had a free house and decided to come up with a plan to not need to work anymore.",
          "id": 174,
          "comments": [
            {
              "score": 383,
              "content": "That was my thought.  If they are allowed to stay Steve will find a way to leech off these women until they are used up.  Then he will move on.",
              "id": 175,
              "comments": [
                {
                  "score": 69,
                  "content": "But don’t you know, he’s only doing it to spend more time with his wife? 😒😒😒",
                  "id": 176,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "Yup, thats why they cant live with his family/friends… he was already cutoff from all them.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 331,
              "content": "Definitely, but it should have been easy to call him out on this? \"I'd love to house you, Steve, but my housing is provided by a corporate shill and I wouldn't want you to compromise the morals that got you into this mess in the first place\".",
              "id": 178,
              "comments": [
                {
                  "score": 109,
                  "content": ">\"I'd love to house you, Steve, but my housing is provided by a corporate shill and I wouldn't want you to compromise the morals that got you into this mess in the first place\".\n\nThis is definitely what OP should have said rather than jeopardize not only her own housing situation, but the relationship of her youngest daughter. She can't seem to understand that she also, if not for Adam, would potentially be homeless.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "[deleted]",
              "id": 180,
              "comments": [
                {
                  "score": 25,
                  "content": "Ahh but the younger daughter isn't a stupid. She's told them they have three months to get their shit together! In the meantime she's bailing them out by paying the difference in the power bill so Adam won't notice. Poor girl. Mum should be sending her that ffs.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 29,
                      "content": "[deleted]",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "Also, I fail to see how hard it is to find another part time job. Any restaurant would hire someone even just to wash dishes. With some kind of serving or bartending experience, it’s incredibly easy to find a part time job. I worked in restaurants for 15 years starting at 15 years old washing dishes. I’m sure Steve as an adult man can handle that too but he’s just being lazy or picky",
          "id": 183,
          "comments": [
            {
              "score": 27,
              "content": "There’s a lot to be said for the bullshit and evils of capitalism - that said, there’s a certain kind of guy who loudly complains about the state of things (check), loudly refuses to engage with it (check), is bad with money (check), and leaves his partner in a lurch because he also feels Too Pure to put on a Starbucks apron.",
              "id": 184,
              "comments": [
                {
                  "score": 15,
                  "content": "He's a career victim.",
                  "id": 185,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": ">I fail to see how hard it is to find another part time job.\n\nMy teenage kid walked into McD's, laid down a resume, had an interview with the days and hours they wanted in a week, went through training and started a week later. They are still short staffed and will take anyone willing to work. If you want a job, there is certainly one out there. But it's certainly easier to mooch off your wife, mother-in-law and a corperate shill than actually work.",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "There's a huge labour shortage in the US right now in a number of industries including the restaurant industry and retail.",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Agree! \n\nIt irks me that she said Steve works part-time because he treasures family time with her daughter. Ok, Jan. \n\nSounds like OP prefers Steve even though Adam is taking care of her and planning for a future with her daughter. \n\nIt's time for Steve to step up, and if that means being homeless, then maybe that's the fire that will light his ass. \n\nYTA OP.",
          "id": 188,
          "comments": [
            {
              "score": 5,
              "content": "He's not even taking care of kids or anything.",
              "id": 189,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Simple solution: let the daughter move in, and let Steve experience a bit of hungry and homelessness.\n\nThey're great motivators.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1821,
      "content": "YTA\n\nI get the concern, but you dont get to be generous to your daughter and Steve on Adam's dime.   If you really wanted to do this, you should have asked Adam if he would agree to a short term exception, not gone behind his back.\n\nAlso, Steve needs to step up and help support his family.   Only working part-time so the family can spend more time together and travel is not a luxury he can afford.  He and your eldest daughter are also AHs for trying to do so on Adam's dime.  Especially after calling Adam a corporate shill and everything that's wrong with America blah blah blah.",
      "id": 191,
      "comments": [
        {
          "score": 915,
          "content": "I’m very skeptical of this “he works part time to spend more time with my daughter” when it turns out daughter also works. So what’s he doing when she’s at works? Sounds like daughter has been flowering up her shit husband to mom for a while and moms taken the bait. Is Steve into video games by chance?",
          "id": 192,
          "comments": [
            {
              "score": 301,
              "content": "At best, it’s « he works part-time and does all the housework » so when OP’s daughter comes home, all they do is hang out. But that’s unfortunately so unusual for a man to pick that particular way of working that I very much doubt that this is the case.",
              "id": 193,
              "comments": [
                {
                  "score": 203,
                  "content": "Yeah that’s 100% not what’s happening. Daughter married a dud and is lying to mom about it and now mom’s about to be homeless with them.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 33,
                      "content": "And now the younger daughter is deceiving her fiancé, so she may end up homeless right along with them. Steve is the weight that’s dragging all of them down.",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 97,
                  "content": "It is how my husband and I do it. I make most of the income and he has the partime job and housework. Since I hate most housework and he doesn't it works for us. But I very much agree that that is an unusual agreement, and I do not think this dude is doing much housework.\n\nAlso if my husband lost his parttime job we would not be in direct financial problems, and if it was financially needed he'd work more.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "I have known precisely one heterosexual couple where the underemployed man actually maintained the home. It's far more common for them to act like teenage sons.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "My husband and I had this, I miss it now he's working full time again and I have to do more chores. But mine is a rare man who actually enjoys housework and proactively does it.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I too have a rare gem of a man. I’ve been sick for over a week, went to the hospital over it. He’s been amazing. He’s done everything for our baby and ran to get me a slush (ice is one of the few things I can tolerate eating right now) at 1 am. \n\nAnd I feel like shit over it. Because society has ingrained in my mind that I am suppose to do all that. It makes me feel awful knowing he’s working full time, taking care of our baby, doing chores and taking care of me. He’s been amazing and I really need a way to express how much I appreciate him. I tried saying it with words but he tells me it’s what a partner does.",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": "Agreed - OP should have discussed this with her landlord before doing this. Perhaps a temporary clause to the lease could have been drawn up. Of course, this is the very thing Adam anticipated when he made his stipulation. OP's deceipt is the icing on the cake. Now OP has bitten the hands that feed her, and put the daughter married to Adam in a terrible position. OP is most certainly TA.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "IKR, you do not get to insult a guy for being successful and then secretly leech off the guy by emotionally blackmailing mil.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1082,
      "content": "YTA Your future SIL is paying all your utilities and only charges $1, he done something incredibly generous for you.  You take advantage of him by secretly having him also provide for your daughter and her loser husband, he should kick all three of you out. Of course he was going to find out about them living there, there is a big difference in paying utilities for one person vs three people. Why should your daughter and her future husband support your other daughter and husband? He should kick all three of you out for taking advantage of him.\n\nEdited to add: Correct relationship error and... \n\nOP you are having your youngest daughter keep a huge secret from her fiance, this could end their relationship. How would you feel if that happens?",
      "id": 202,
      "comments": [
        {
          "score": 306,
          "content": "You made an incredible observation.\n\nI was wondering how the youngest daughter found out until I read your comment. The utilities!",
          "id": 203,
          "comments": [
            {
              "score": 134,
              "content": "[deleted]",
              "id": 204,
              "comments": [
                {
                  "score": 14,
                  "content": "And yet…",
                  "id": 205,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "If this is the area he owns dozens of properties in, then he probably is on a first name basis with the local locksmiths and such, who might mention something like that.  \"Hey man, thanks for single-handedly keeping my business afloat.  Thought you might want to know 123 Street Road just asked me about making a bunch of extra keys for your house\"",
              "id": 206,
              "comments": [
                {
                  "score": 36,
                  "content": "You dont call a locksmith for spare keys, you go to ACE and the old lady behind the counter does it.",
                  "id": 207,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "It’s double as bad cause loser Steve has been shitting on Adam the entire time while living on Adam’s dime. How does he even call himself a man?",
          "id": 208,
          "comments": [
            {
              "score": 7,
              "content": "Next family get together you know Slackerman is going to be tossing this in Adam's face!\n\nHaha, everyone has been lying to you for months and they've all been paying for me slack off in the house YOU OWN!!!   HA!!!\n\nThat'll be a fun night for all of them.",
              "id": 209,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 704,
      "content": "YTA. You had ONE job. \n\nAdam's right, Steve is a slacker, and now he's reaping the consequences of that.\n\nWhere are you, Steve, and your oldest daughter going to live when Adam kicks you out for breaching your agreement with him?",
      "id": 210,
      "comments": [
        {
          "score": 260,
          "content": "I LOVE that Steve accused Adam of being the reason why people can't buy homes and become dependent on him.... and they proceeded to go choose to be dependent on him.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Lol Steve is guna squat so now it’ll cost the price of eviction too",
          "id": 212,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 479,
      "content": "[removed]",
      "id": 213,
      "comments": [
        {
          "score": 191,
          "content": "YTA\n\nThis and more.\n\nYou also broke the trust of a very kind SIL who has gone above and beyond in looking after you.\n\nSteve seemed to prioritise working part time and enjoying life above being a responsible adult. You’ve just condoned and enabled that behaviour.\n\nSteve needs to get a job pronto and step up. They need to find alternative accommodation pronto",
          "id": 214,
          "comments": [
            {
              "score": 24,
              "content": "Keep in mind Adam and Daughter 2 aren’t even married yet. They’re engaged. Adam built his MIL-to-be a custom house, covers all the utilities, and charges her $1 a month, IN THIS ECONOMY! And OP is asking Daughter 2 to cover the extra utilities help Steve be a mooch.",
              "id": 215,
              "comments": [
                {
                  "score": 12,
                  "content": "It’s crazy right! OP is such a mooch enabler.",
                  "id": 216,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 359,
      "content": "YTA— sorry OP, but you are a massive asshole. This guy built a house for you and asks you to pay $1 rent with the only condition that you don’t allow others to live there. I don’t know anyone living in such generous and giving conditions.\n\nSo yeah, you massively breached the trust of the giving hand. I understand your concern for your less successful daughter and her husband —who works part time, so I guess your more successful son in law was right about him being a slacker, but the very least you could have done was to ask for permission.\n\nYou just burned the relationship and trust of the person who was allowing you to live so comfortably. Really dumb.",
      "id": 217,
      "comments": [
        {
          "score": 48,
          "content": "[deleted]",
          "id": 218,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Yes, and I bet that Adam had a very specific person in mind when he made that stipulation…",
          "id": 219,
          "comments": [
            {
              "score": 14,
              "content": "He may have, but it’s usually standard for legal and insurance reasons. \n\nAlso, he could have been looking out for her against older guys who prey on older single ladies. I had a similar issue with my grandma. My grandpa passed away and a year later this older guy had moved in and basically taken over the home. We now have to go through him to even try and talk to her, let alone see her.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}