{
  "post content": "This is something that just came to light last night, im on mobile and I'm still pissed so please excuse any grammar errors.\n\nI have been with my BF \"Dean\" for over a year and a half. He is everything to me and I'm everything to him. He helped me gain the courage to get mental help and to straighten myself out, become less of a doormat, etc. I see myself possibly and more than likely being with him for the rest of my life and he feels the same.\n\nMy brother, \"Roger\" and his wife, \"Emma\" are already married but her and her family wanted a big wedding which they are doing this next year in the summer.\n\nI called my mom like usual after work since she lives in another state and she keeps me sane while driving home. Due to the weather this last weekend I couldn't make it up to her place for Christmas as it is a 5 and a half hour drive for me. But my two brothers and their SOs are there.\n\nShe told me that Emma was trying to not invite Dean to the wedding since we aren't married, aren't fiancés, and apparently aren't living together? We are and have been living together for a while. But these same parameters don't go for my other brother and his GF. My father caught wind of it and he too said that Dean was going if he could and she would be wrong to not invite him. My mother told Emma and Roger that if Dean was not invited, she wouldn't go and that she wasn't going to be paying for the rehearsal dinner.\n\nWhen I heard it from my mom, I did say some choice words that I'm not too proud of but I was angry. Like I said, I support my brother fully but she has changed him. We all three bonded (brothers and I) over a shitty divorce and a sucky upbringing and now he doesn't even call me once in a while like he used to. It feels like I'm losing my brother, but I suck it up because he seems happy and I want him to be happy.\n\nI told Dean and he now doesn't want to go even though my mom smoothed it over and made sure he was invited.\n\nNow onto the issue, no one but my mom knows that me and Dean know about the uninvited to invited issue. I dont think I can bring myself to be civil at our Christmas celebration this weekend at my Dad's place. I know Dean won't pretend he doesn't know, but I honestly don't know if I should bring it up at all. I want to, everytime I think about it my blood boils.\n\nI just want an apology, a heartfelt apology, but I know I'll never get one. I might still back out of going to the wedding over this, it will break my heart because my brother probably won't talk to me ever again if I dont go. But I can't just let this go.\n\nSo WIBTA if I were to basically cause a scene this weekend with my SIL? I'm fully prepared for the fallout but I don't want to ruin our Christmas celebration especially since this is the first time in a long while all the \"kids\"(us) are together in one place again. I know I shouldn't be a doormat about this but I feel like I'd just make everything worse.",
  "id": 1,
  "comments": [
    {
      "score": 215,
      "content": "ESH if you do that the way you are planning to. \n\n Absolutely do not talk to your sister in law directly. You have no idea what's actually going on behind the scenes and this whole \"Emma's rules...\" may not even be hers.  You're more likely to get a real conversation and an answer from your brother.\n\nYour mum was right to say they aren't helping pay if your boyfriend isn't invited.  Leave it at that.  They made a bad decision that excludes someone who is, clearly, considered part of the family.  It got fixed.\n\nIf you confront her and only her (as if it isn't two people's wedding) it becomes a clown to clown conversation.  You even look worse because you caused the scene at Christmas.\n\n If you want to find out why it happened talk to your brother privately about it.  But I have noticed brides tend to get blamed a lot for the decisions the couple, or even the groom by himself, makes.",
      "id": 2,
      "comments": [
        {
          "score": 69,
          "content": "Thank you, ill definitely see if I can snag my brother away to talk with him after the festivities are over.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "YWBTA to intentionally cause a fuss at the Christmas gathering. Don't be an AH.",
      "id": 4,
      "comments": [
        {
          "score": 24,
          "content": "I figured, I just got really angry. It's not the first time she's done something to cause a rift. But like I said I just want my brother to be happy.",
          "id": 5,
          "comments": [
            {
              "score": 1,
              "content": "It's not your wedding. They get to decide who they want to be there.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "YWBTA pushing on this.\n\nIt was a dick move, but also THEIR wedding. If you feel that strongly, don't go. \n\nIt would be a GIANT AH move to cause a scene. It was already addressed and resolved.",
      "id": 7,
      "comments": [
        {
          "score": 18,
          "content": "I don't understand this. It wasn't really resolved. SIL is still a (probably bigoted) AH who only backed down because financial support was going to be yanked if she insisted on her plan of action. The real issue is still unresolved.",
          "id": 8,
          "comments": [
            {
              "score": 0,
              "content": "SIL sounds rude and entitled. It's also their wedding to decide who gets invited.\n\nClearly, they could and should still have a discussion, but not a scene at the actual wedding",
              "id": 9,
              "comments": [
                {
                  "score": 7,
                  "content": "OP has repeatedly said they wanted to confront the SIL and brother at Christmas, not the wedding.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I figured, I dont want to cause a scene. I know its their wedding, and if they talked to me privately about it, it probably would've hit me better.",
          "id": 11,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "YTA.\n\nWhy?\n\nBecause the issue is settled. Your parents handled it at the get go. \n\nDo not bring it up during the gathering.  A gathering when all of you are together in one place after a long time.\n\nWhy ruin things for everyone?\n\nThat's not your job.\n\nYour steaming and putrid anger is not going to help anyone if it blows up at the gathering.\n\nAs it stands? You are both coming to the wedding.\n\nAnd? If you do want to discuss it? In a polite manner? Talk to your brother privately. After the gathering.\n\nDon't cause a scene.\n\nIf you can't be civil and polite towards everyone?\n\nDon't go to the gathering or the wedding.\n\nPlease do everyone a favor? For the sake of unity, love, and sanity?\n\nBe supportive  Don't cause a scene.\n\nThis is not your hill to ruin things on.",
      "id": 12,
      "comments": [
        {
          "score": 17,
          "content": "Thank you for taking time to reply. I wasn't meaning I was going to just blow up on her or anything. Just if wedding invites were brought up I wasn't going to pretend I didn't know. I have decided I'm going to speak to my brother privately about it, and I'm still going to be supportive and civil at the gathering.",
          "id": 13,
          "comments": [
            {
              "score": 2,
              "content": "So happy to hear that!",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15,
      "content": "[removed]",
      "id": 15,
      "comments": [
        {
          "score": 5,
          "content": "It only got resolved this morning, I told him last night when I first heard about it, I had to cut down character length for the post. I totally understand the judgement, I just needed to get opinions down to cool my head.",
          "id": 16,
          "comments": [
            {
              "score": 6,
              "content": "Ahh.  I take back my YTA and lower it to a you would be the asshole if you or Dean reopen the issue.  If it wasn’t resolved at the time of you telling him, you did nothing wrong. He’s invited now, accept the invite and move on.",
              "id": 17,
              "comments": [
                {
                  "score": 2,
                  "content": "Sorry I guess I should've left that in there when posting.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm glad you got it resolved. It's understandable to be angry. But never ever ever make a scene at someone else's wedding.",
              "id": 19,
              "comments": [
                {
                  "score": 4,
                  "content": "Oh I would never at the wedding, I've heard too many stories about that, it's their day. They're already married but her family wants this huge beautiful wedding and it sounds like it'll be cool.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Happy 🎂 Day!",
          "id": 21,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "Am I reading this right, that you're looking to cause a fight at Christmas, because you believe your BF will be uninvited from a wedding?",
      "id": 22,
      "comments": [
        {
          "score": 6,
          "content": "No im not trying to cause a fight, I just dont think id pretend to not know if they brought up wedding invitations.",
          "id": 23,
          "comments": [
            {
              "score": 5,
              "content": "Alright.  But if someone gave me crap about wavering in giving them a plus one to a wedding, I'd rescind their invitation.  You got what you wanted, no point in poking the bear.",
              "id": 24,
              "comments": [
                {
                  "score": 6,
                  "content": "Youre right, I've already decided to speak to my brother privately to see what the hubub was.",
                  "id": 25,
                  "comments": [
                    {
                      "score": -4,
                      "content": "But still why speak to your brother when the issue has been resolved? Either way it will stir up drama coz it's going to get back to your sil. Let this go Op, it's not worth it.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "YWBTA. While I get its satisfying to play it out in your head, unfortunately it will accomplish nothing but adding more drama. \n\nWhile I think its crappy of them not to have invited your bf, ultimately, they didn't have to invite any particular person.",
      "id": 27,
      "comments": [
        {
          "score": 5,
          "content": "I know, it's definitely up to them. Thank you for replying, I needed people's perspective away from the situation.",
          "id": 28,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "I would say you would be TA and would recommend to talk to your brother after Christmas. Also, does he know? Or is it only sil?",
      "id": 29,
      "comments": [
        {
          "score": 8,
          "content": "Im not sure if he knows or not, like I said this all started last night, my mom got it mostly resolved this morning. I have decided to pull him aside after the celebration and talk to him privately about it.",
          "id": 30,
          "comments": [
            {
              "score": 4,
              "content": "I think that's a good idea. And also I get it that you are hurt and angry but try to stay calm and tell him how you and how your partner feel. Good luck",
              "id": 31,
              "comments": [
                {
                  "score": 6,
                  "content": "Thank you, I will update after I have a talk with him.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "YWBTA\n\nFirst, don't start drama at Christmas, especially over here say. \n\nSecond, its their wedding, even if they are already \"married\". They can invite or not invite whomever they want. \n\nIf your boyfriend has decided he doesn't want to go, then leave it at that. If you are still super worried about it, pull your brother aside privately and discuss it. But don't ruin Christmas over it.",
      "id": 33,
      "comments": [
        {
          "score": 5,
          "content": "Youre right, I wasn't going to try to make a scene, just if it was brought up I wasn't going to pretend I didn't know. I will privately talk to my brother about it though after festivities are all done and all.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Go and just ignore her. Don't mention what is going on and wait and see if it's brought up. Now that the situation is resolved ywbta for starting drama but of someone else brings it up feel free to say everything you are feeling.",
      "id": 35,
      "comments": [
        {
          "score": 4,
          "content": "Okay, I definitely will just keep it civil. I dont really want to ruin christmas.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}